{
  "title": "The Terminator",
  "rating": 7.6,
  "release_date": "1984-10-26",
  "summary": "A cyborg (Arnold Schwarzenegger) is sent from the 21st century to present-day Los Angeles to assassinate a seemingly innocent women whose child will play an important part in the world from which the killer came. [MGM]",
  "critic_reviews": [
    "Director James Cameron and producer Gale Anne Hurd (both of whom co-wrote the script) demonstrate their storytelling virtuosity.",
    "A blazing, cinematic comic book, full of virtuoso moviemaking, terrific momentum, solid performances and a compelling story.",
    "Getting the extraordinary physical specimen of Arnold Schwarzenegger for the lead was a stroke of genius and a stroke of fortune. Each of his pecs is the size of a bull’s flank. It is a tremendous black-comic performance and, without Schwarzenegger, the movie is of course unthinkable.",
    "From the slam-bang direction to the relentless pace to the not-a-word-wasted dialogue and even the driving synth score, everything else about The Terminator just works.",
    "The havoc makes for a genuine steel metal trap of a movie that may very well be the best picture of its kind since The Road Warrior.",
    "It's a rousing science fiction story that proves an on-screen adrenaline rush.",
    "An amazingly effective picture that becomes doubly impressive when one considers its small budget.",
    "When Terminator is not taking itself seriously -- and sometimes even when it is -- it's lots of fun. And filmmakers James Cameron and Gale Anne Hurd don't drown us in blood, though it's not for the squeamish.",
    "An efficient, cold-blooded sci-fi splatter movie that never makes the mistake of forgetting that on some level it is deeply ridiculous.",
    "Those nightmares we’ve all had about being chased by some relentless, unstoppable monster? This is the movie adaptation.",
    "It's rather confusing. But in the context of this wildly imaginative movie, it's all, rather exciting, too.",
    "Schwarzenegger is presented as a lumbering slab of dumb, destructive strength--the image is more geological than human--and Cameron plays his crushing weightiness against the strangely light, almost graceful violence of the gunplay directed against him. The results have the air of a demented ballet.",
    "A B-movie with flair."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Terminator keeps a steady diet of action flowing throughout the film, without excess of the 80's cheese. Keeping this James Cameron gem a lean, mean, fighting machine.",
      "review_date": "2012-01-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the greatest sci-fi/action flicks ever to be made. Also, it spawned at least two amazing sequels--in which the Terminator is a protagonist rather than an antagonist?  The next sequel...not so much.",
      "review_date": "2011-08-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Like the original Mad Max, the original Terminator may be limited by its lower budget, but James Cameron knows how to work around it and tried his best with what he had at the time. It's a great movie, that's really all I have to say.",
      "review_date": "2015-06-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the most iconic films ever made. An absolute classic. **** the low scoring users, who have no interest in boosting the film industry by watching fantastic pieces of work like this.",
      "review_date": "2014-07-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Whoever can truly say that they don't like this movie can shove their head up their arse and speak, because that's where crap should really come from.",
      "review_date": "2019-02-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "this is one of the best actionmovies of all time, it's better than T2 in my opinion. Arnold is so good in this movie even though he does not have a lot to say, your afraid of him and you feel for the characters, This movie does not need thethis is one of the best actionmovies of all time, it's better than T2 in my opinion. Arnold is so good in this movie even though he does not have a lot to say, your afraid of him and you feel for the characters, This movie does not need the action sequences of T2, this movie is so thrilling9/10",
      "review_date": "2020-06-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is one of that movies that you want to watch it when you get bored, anytime,anywhere. I cant believe this movie affected me that much. Only one fault on this one: Kyle Reese Paradox which is not possible.",
      "review_date": "2011-08-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nIt is a science-fiction action blockbuster and it is an intriguing story line and a highly interesting one. it as everything you could have hoped for in a film of this genre. it will be remembered as a classic for a very long time.",
      "review_date": "2013-06-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A great action movie, one of the best of it's time. The Movie has great actors. The special effects were fairly good for the time. My main complaint is that i wanted to know more about the terminator and his backstory. The movie talks aA great action movie, one of the best of it's time. The Movie has great actors. The special effects were fairly good for the time. My main complaint is that i wanted to know more about the terminator and his backstory. The movie talks a little bit about the Terminator's origin but i wanted to know more.",
      "review_date": "2014-09-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of my favorite sci-fi film. The unique atmosphere of techno-gothic style in the 80's the United States, a kind of sci-fi noir.... If you think, really scary movie. It is not a \"positive\" Terminator from the \"Judgment Day\", it really is aOne of my favorite sci-fi film. The unique atmosphere of techno-gothic style in the 80's the United States, a kind of sci-fi noir.... If you think, really scary movie. It is not a \"positive\" Terminator from the \"Judgment Day\", it really is a terrible killing machine that is before anything and never stop. In my opinion  the best job J. Cameron.",
      "review_date": "2013-10-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is not a popular opinion, but I love this film far more than Terminator 2. As a fan of both the noir and sci-fi/cyberpunk genres and the 80s I am very grateful for this film. This film captures the gritty atmosphere of LA and has anThis is not a popular opinion, but I love this film far more than Terminator 2. As a fan of both the noir and sci-fi/cyberpunk genres and the 80s I am very grateful for this film. This film captures the gritty atmosphere of LA and has an amazing soundtrack to go along with it. Terminator 2 might have a bigger budget and far better VFX, but in terms of story and atmosphere it can't beat the first film.",
      "review_date": "2017-01-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Action packed, intelligent and entertaining, James Cameron's  The Terminator is a pinnacle of sci-fi/action films to come and a standout for Arnold Schwarzenegger.",
      "review_date": "2015-07-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A remarkable science fiction movie from James Cameron that started a successful franchise, entered pop culture history and has of cause Arnold Schwarzenegger's most iconic role. In the future of 2029 humanity was heavily decimated after aA remarkable science fiction movie from James Cameron that started a successful franchise, entered pop culture history and has of cause Arnold Schwarzenegger's most iconic role. In the future of 2029 humanity was heavily decimated after a nuclear holocaust and is at war with the supercomputer Skynet and its machines. Shortly before being defeated Skynet sends one of his Terminators back in time to stop his biggest menace in form of the woman Sarah Connor. However the human resistance manage to send one of their soldiers named Kyle Reese back too. Now the battle for the future of humanity begins. The story is entertaining, succeeds in worldbuilding and creating lore you are invested in. It has of cause some loopholes but I think there is no movie that is 100,0% perfect. It matters that it is entertaining and works well. Action wise it delivers and has memorable scenes. It is a hard race against a seemingly unstoppable persecutor who will stop at nothing and has no compassion. The practical effects for the movie were for its time remarkable and I have seen newer movies with higher budgets performer much weaker. You can see again and again how much effort was put into the movie. The soundtrack by Brad Fiedel was great. It is amazing how a simple theme the Terminator theme is but is has become iconic. Lets go to the actors: We have in general a great performance and lets start with the Terminator himself Arnold Schwarzenegger. It is his most iconic role that everyone relates him to it. He does an excellent job as cruel, logical and efficient killing machine (I am not even sure if he speaks more than 100 words in the movie). Then we have Linda Hamilton as Sarah Connor who is similar. She does also a great job and it will be her signature role too. She developed a lot in all the movies and the TV series. Finally for the trinity we have Michael Biehn as Kyle Reese. He is a great actor and his filmography is as excellent as his acting skills. The rest is a good addition but the main appeal are these 3 characters. Overall this is an iconic movie that I recommend for everyone who likes science fiction. It started the successful franchise that is still strong today even if the later movies are weaker (Of cause not Terminator 2 which is the best sequel in movie history or at least a frequent contender). It has the tropes and stories that give immersion and kept you engaged.",
      "review_date": "2021-03-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "a chilling and gritty action flick, the Terminator gives us a futuristic thrill ride where were given a chance to save the future from total annihilation\r Arnold Schwarzenegger is terrifying as the futuristing mechanical hunk, who was senta chilling and gritty action flick, the Terminator gives us a futuristic thrill ride where were given a chance to save the future from total annihilation\r Arnold Schwarzenegger is terrifying as the futuristing mechanical hunk, who was sent back in time to terminate the mother of a heroic leader of a future human rebellion, with Michael Biehn as Kyle Reese as humanity's only hope.\r James Cameron probably stands next to Ridley Scott and George Lucas as a modern sci-fi pioneer who gives a new wave of storytelling by adding more action that I can grasp to as one of my favorite thrillers of all time!",
      "review_date": "2015-05-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not as good as I remembered it being when I was a kid. I wish I could watch it again with those eyes",
      "review_date": "2021-12-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is one of the action classics that has never left the TV since it premiered. It started a cinematographic franchise that developed later and has been one of the most dystopian visions of the future of humanity in cinema: anThis film is one of the action classics that has never left the TV since it premiered. It started a cinematographic franchise that developed later and has been one of the most dystopian visions of the future of humanity in cinema: an extermination war between humans and machines.In this film, Sarah Connor is a young girl like so many others. However, she is the target of a dark killer, who will not stop until she is killed. When he is about to succeed, another man appears, saves her and tells him the truth: the killer is actually a complex machine, sent to the past to kill her before she can give birth to a guerrilla commander who, fifty years from then, will lead the war against machines.If it is action that we are looking for, this film takes that expectation seriously: what it offers us is pure and hard action, from start to finish. It's full of normal and welcome elements in films like this: destroyed cars, car chases, police cars, exploding trucks, highway shootings, high-speed cars. Okay, these folks in the Eighties and Nineties don't seem to be able to design an action movie without destroying cars! Nothing against it, but it is something that I found curious. I particularly liked the shooting sequence at the police station, and the ending, at the factory, is just as memorable.Linda Hamilton is the most interesting actress in the cast. She is a good actress, and shows talent in the scenes where she is allowed to. I say this because the film was not nice to her: the only thing she does most of the time is to be in danger and to look scared and confused. Still, she did it sincerely. Michael Biehn has more time and opportunities to show what is worth, and he too was extremely competent in his work. But it is Arnold Schwarzenegger who takes the rug off them and makes the film iconic. The film is still from that time when he was just a muscle mountain, hard as steel, with a strong, barely disguised, German accent. He couldn't be better, and it's hard to imagine another actor for the role.James Cameron ensures an inspired direction. He knew how to guide his team and get the best out of his cast. Being a 1984 film, I was expecting something different, much more dated and looking ugly, as many films of that decade seem to be now. However, I was very impressed: cinematography is beautiful and the film is sharp and excellently filmed; sets and costumes are, of course, a reflection of the time, but that was to be expected. What about visual and special effects? Okay, I'm willing to concede that they seem archaic to our eyes, but here the fault is ours. James Cameron is an effects expert and used the best there was... in 1984. And in fact, considering it's age, special effects will look much more magnificent. Before finishing, a word of praise for the main theme of the soundtrack designed by Brad Fiedel in synthesizer: undoubtedly, one of the most striking soundtracks for action cinema.",
      "review_date": "2021-01-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI know metacritic is for everyone to share their opinion, but how can this movie have that many negative and mixed/mediocre score? This movie in my opinion is better better than the t2, since it has way more suspense and have great flashbacks about the future.",
      "review_date": "2018-02-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In regards of every single aspect, The Terminator is the textbook example of just how much can be done with as little money.With a simple, yet innovative use of camera movements, and different camera angles, James Cameron shot some of theIn regards of every single aspect, The Terminator is the textbook example of just how much can be done with as little money.With a simple, yet innovative use of camera movements, and different camera angles, James Cameron shot some of the most impressive action sequences and car chases. The use of zooming technique, in particular, in chases scenes also created a great deal of tension.Simply put, The Terminator is one of the best paced action movies ever. It's not fast as most of the cheesy action flicks of the eighties, nor slow-burning like Blade Runner's that definitely wouldn't suit the movie's tone. It's just perfect!Some may say the special effects are dated and don't hold up very well, but I don't mind them at all. In fact, I liked so much the visual effects, and I found them pretty convincing. The makeup is also remarkable for its time.What dazzles me aren't the effect, though, but the not-a-word-wasted dialogue. There is no line of dialogue that has been wasted. Every line or even gesture is as short as it's powerful as you can ever imagine.The movie isn't without its flaws, though. I found the way we got to know for the first time about the background story pretty lazy. Also, the whole situation was unsuitable for giving us information, but, nonetheless, the time was perfectly enough for us to know the most important things. There were also a couple of times later when the luck played a vital role in saving the protagonist's life. Besides, there is a glaring plot hole at the end of the movie that really drove me crazy till the credits roll.The movie features Arnold Schwarzenegger in his career-defining role, and I can easily see why. Casting him was a perfect choice to portray a relentless, rigid, indestructible cyborg. From seeing her vulnerable to accepting her fate, and trying to convince herself of it, Linda Hamilton is absolutely terrific as Sarah Connor. Michael Biehn is fantastic as well. Kyle Reese is my favorite character from the movie.A great score that just hits the right note by walking a fine line between the bleakness of the post-apocalyptic world and the cheesiness that distinguishes the movie's nature.Unpretentious filmmaking at its finest!(8.5/10)",
      "review_date": "2018-10-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Terminator is a fun action movie! Arnold is great. Linda Hamilton is great. I love the time travel aspect.",
      "review_date": "2018-05-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I still love and will always love this movie. It’s just such a classic that I could rewatch for ages and never get bored of it.",
      "review_date": "2019-07-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A tech/noir scifi horror, looks a bit dated now but the action and tension are high and Arnie is great as the Terminator!",
      "review_date": "2018-09-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"The Terminator\" is quite possibly one of the greatest action movies of all time and that says a lot, considering how many great action movies are available.The film's greatest strength isn't its relentless pacing nor James Cameron's\"The Terminator\" is quite possibly one of the greatest action movies of all time and that says a lot, considering how many great action movies are available.The film's greatest strength isn't its relentless pacing nor James Cameron's fantastic directing style. It's Arnold Schwarzenegger's performance, who plays the murderous robot sent from the future to kill Sarah Connor. The way he portrays this robotic figure that doesn't have human emotion in him is phenomenal. He proves that he's just more than an handsome bodybuilder who looks good on screen. Arnold pretty much steals every scene he's in, but make no mistake, Linda Hamilton and the rest of the cast are also great. I actually really liked Paul Winfield's character, Lieutenant Ed Traxler. Usually in these type of movies, side-characters would bother me, but he was surprisingly charismatic and humanized. He wasn't just a one-dimensional cop. I appreciate that.Besides the action and the fast pacing, the movie also succeeds in telling a heartfelt story, with an astonishing chemistry between Linda Hamilton and Michael Biehn (Kyle Reese). This movie fires on all cylinders (no pun intended) and sure is one of the best movies in my book.10/10",
      "review_date": "2019-02-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A pretty decent action movie...weird how much better the sequel is, though.",
      "review_date": "2021-04-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I think it has a very predictable plot but you can kind of enjoy the fast-paced action sequences.",
      "review_date": "2021-10-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What a debut by director James Cameron for this movie that is one of those rare cases of a movie turning out to be inferior to its sequel but it still remains a great movie and surely a cult. This movie is full of suspense and the action hereWhat a debut by director James Cameron for this movie that is one of those rare cases of a movie turning out to be inferior to its sequel but it still remains a great movie and surely a cult. This movie is full of suspense and the action here is well dosed without to be eccessive. Schwarzenegger proves he can be able to do good movies.",
      "review_date": "2021-11-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"The Terminator\" is a loud,noisy action \"block bluster\"; pretty good CGI (considering it was 1984), solid acting from Mr. governor, a dull but appealing story. Expect fun.",
      "review_date": "2011-09-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best movies I ever seen",
      "review_date": "2011-08-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was down right action packed. Arnold Schwartezennager rules!!",
      "review_date": "2008-06-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "When it comes to sci-fi there just isn't another mind out there like Cameron's. His legendary work here infuses the genre with dark and gritty noir. Heck, given the relentlessness and ferocity of it's antagonist it's darn near part horror asWhen it comes to sci-fi there just isn't another mind out there like Cameron's. His legendary work here infuses the genre with dark and gritty noir. Heck, given the relentlessness and ferocity of it's antagonist it's darn near part horror as well. The film's world pulls no punches in any department. While certain aspects of the movie might seem simple by today's standards the film is no less impressive.\r The story is effectively conveyed through minimalist dialog. Characters do carry on conversations, but the actual backstory is told rather quickly so as to put the film's focus squarely on the conflict at hand. The time travel scenario may have you scratching your head at some points until you realize the ending is meant to set up the sequel. It doesn't completely wrap up the overall story b it's conclusion. It instead leaves you with a satisfying ending for it's story while leaving viewers with the promise of more.\r The characters are portrayed spot on by the actors, but the real star of the show is Arnold Schwarzenegger. He plays the ruthless and somewhat terrifying \"terminator\" to perfection. While ultimately he doesn't do much actual acting as his lines are kept to a minimum he still manages to instill terror at his presence. Also it's just as fun as ever to watch him shoot things up.\r The film also just does a lot of cool things. While the special effects are obviously dated today, it' not hard to notice how cool the scenes must have looked back in the day. There are some really cool effects going on that toady couldn't be done without at least a little CGI. Cameron made the film's most impressive moments (which usually involve gore) all happen without it. A very impressive feat considering the time.\r While aspects of it haven't aged well and it's not as groundbreaking today as it was when it first came out, this is still one of the most original and creative sci-fi movies out there. With a sharp plot, good writing, cool effects, and an original theme this is one that 's still worth watching. It still manages to stand out as one of the best sci-fi movies you'll ever watch. If you haven't seen it yet I highly recommend that you do.\r I give it an 8.9/10.",
      "review_date": "2015-07-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Just could not get into this one. The premise is interesting and the thrills are certainly there for the most part, but all I saw was an overhyped movie that is like many things we see today; a movie with an interesting premise that getsJust could not get into this one. The premise is interesting and the thrills are certainly there for the most part, but all I saw was an overhyped movie that is like many things we see today; a movie with an interesting premise that gets drowned out by needless explosions and countless shootouts. I think this one would be well served if there were less of those action elements and more of the sci-fi and human drama that could really carry this one. I am not advocating removing all of the action elements, but use them less as it is numbing by the end of the film and you barely care about what is going on. There are certainly great moments, in particular the end of the film, but that is not action, rather it is the sci-fi/human drama element I like the most of this one. Sadly, those moments are few and far between, as the action dominates the screen and kills the rest. However, the action sequences are well put together and the sci-fi/human drama parts are great, so this one is not a total failure, but I thought I would like it a lot more than I did.",
      "review_date": "2014-06-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Terminator is one of the greatest action movies ever made, with it's intriguing plot, perfect action, and Arnold Schwarzzeneger's best role, this is truly one for the ages.",
      "review_date": "2014-02-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Where do I start with this movie? It is the greatest action/sci-fi film of all time… And my personal favourite!\r The action is extremely well filmed, with great stunt acting.  Arnold Schwarzenegger, Linda Hamilton and Michael Biehn playedWhere do I start with this movie? It is the greatest action/sci-fi film of all time… And my personal favourite!\r The action is extremely well filmed, with great stunt acting.  Arnold Schwarzenegger, Linda Hamilton and Michael Biehn played the film's leads.\r With memorable performances, scenes and phrases… The Terminator comes out as (in my opinion) THE GREATEST FILM OF ALL TIME!!\r A low-budget masterpiece!\r The only movie I have ever seen to score a 10/10 - MUST WATCH",
      "review_date": "2016-11-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "James Cameron's The Terminator made in the year 1984 is a sci fi action classic and easily the best in the Terminator series (yes even better than T2)... Arnold Schwarzenegger is sent to earth after a few flashes of blue lightning, completelyJames Cameron's The Terminator made in the year 1984 is a sci fi action classic and easily the best in the Terminator series (yes even better than T2)... Arnold Schwarzenegger is sent to earth after a few flashes of blue lightning, completely naked and he's a cyborg which means half man and half machine. Seconds later some other dude is sent down to earth from the future too and is naked and he's the protector named Kyle Reese (Michael Biehn) and he loses the cops and steals a shotgun from their car. They both track down Sarah Connor ( Linda Hamilton) who is the primary target for assassination. Arnold Schwarzenegger is The Terminator and must kill Sarah Connor because her son will become important in the future. Fast paced action sci fi, plenty of car chases, plenty of unsettling moments especially the eye removing scene, blood, explosions and a shootout at a bar called Tech Noir The Terminator delivers plenty of action and has a dark, serious and sinister feel throughout that creates tension, suspense and grabs the viewer and never let's go for one moment! Excellent film.",
      "review_date": "2020-03-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"I am the Terminator,\" what agay type of movie this is. Sure some of the action scenes were pretty sweet but overall the movie totally completely sucked. Thumbs down for James Cameron.",
      "review_date": "2007-07-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There isn't much to say except, this film is practically perfect. I think the story is extremely well written and enticing and I don't understand how anyone could say it is \"dull\" (review before mine) Plenty of action sequences, interestingThere isn't much to say except, this film is practically perfect. I think the story is extremely well written and enticing and I don't understand how anyone could say it is \"dull\" (review before mine) Plenty of action sequences, interesting time travel ideas, and cheesy 80s music. I LOVE IT.",
      "review_date": "2012-03-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It has 1 or two funny lines that probably arent' suppose to be funny but otherwise you have slow, repetitive pile of junk, that has acting below par and a movie that should have been terminated from the beginning.",
      "review_date": "2012-12-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What a horrible piece of dung. Everything that was funny, was clearly not intended to be. The story and acting are pretty worthless and pitiful. I wish this series never would have started to begin with, as the others are pretty meaningless also.",
      "review_date": "2012-12-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "After watching the **** Genysis i decided it was time to go back and watch James Cameron's cult classic film the original Terminator. Terminator is absolutely badass, every scene is just balls to the walls action with brilliant cheesy 80s oneAfter watching the **** Genysis i decided it was time to go back and watch James Cameron's cult classic film the original Terminator. Terminator is absolutely badass, every scene is just balls to the walls action with brilliant cheesy 80s one liners. My only real flaw with the film is the romantic elements, it just feels kinda forced, whilst being a very important plot point, also anybody kinda think Kyle is a bit creepy considering the fact that because if a picture he becomes obsessed wit Sarah Conor. Please watch terminator its a brilliant film.",
      "review_date": "2015-07-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Terminator is a classic scifi smash that was one of the first of its kind. It may not feature that great of effects, but the movie still works here, thanks to Arnie. James Cameron does the best with what he has, and the results are phenomenal.",
      "review_date": "2014-06-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I recently went back and watched this movie for the first time in years and man I forgot how great it really is. Everyone talks about T2 and how great it is and how it was a masterwork for visual effects, which is very true but I honestlyI recently went back and watched this movie for the first time in years and man I forgot how great it really is. Everyone talks about T2 and how great it is and how it was a masterwork for visual effects, which is very true but I honestly think this first movie is better. I know i may be in a small minority that this this one is better but just look at it, the atmosphere is fantastic. For the time and budget the scenes in the future look good even today and you get a feeling of dread and fear from seeing this wasteland that used to be our home. The acting in this film is great and I dare anyone to disagree with me on that, it just sucks you right into the film and keeps you hooked and interested for the entire running time. One this about this film that I don't hear a lot of people talk about is the music, this soundtrack is superb. It has the cyberpunk feel that this film asks for and has influenced many imitations. I cant imagine anyone not having seen this film but if you haven't then I implore you to seek this out, its not hard to find. Enjoy!",
      "review_date": "2015-07-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I do not like \"The Terminator\". It is one of those films that were great when they came out but over time, they've aged terribly. Some films like \"Casablanca\" age well through time and get better each time you watch it. This is not the caseI do not like \"The Terminator\". It is one of those films that were great when they came out but over time, they've aged terribly. Some films like \"Casablanca\" age well through time and get better each time you watch it. This is not the case with \"The Terminator\".",
      "review_date": "2016-10-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I love this film for how unique it is and how sci-fi was redefined by this with great characters and an easy to follow, but in depth plot.",
      "review_date": "2018-04-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This looks and sounds so eighties! It is the epitome of the decade. The hair, the production design, the effects, everything in this film is defined by and defines the eighties. Not that it’s a bad thing, it is good to be distinctive. TheThis looks and sounds so eighties! It is the epitome of the decade. The hair, the production design, the effects, everything in this film is defined by and defines the eighties. Not that it’s a bad thing, it is good to be distinctive. The sound design is excellent, surprisingly good considering the age. The music fits with the tone but I did find it a touch synth which comes across as a bit cheesy. The story is actually really strong and incredibly well told. I love time travel and robots! The future war scenes compliment and contrast the eighties perfectly. The slow menacing stalker makes this feel a little like a slasher horror movie, again a very good thing. My only real gripe is that it is occasionally a little slow. Overall it really is an awesome film that never ceases to entertain.",
      "review_date": "2023-01-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The storyline and scripts are great. But with better effects this movie would have rocked.",
      "review_date": "2006-08-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best sci-fi films ever made, brilliantly done with an imaginiative and powerful plot. Excellent special effects, well acted and relentlessly fast paced. This one will have you on the edge of your seat throughout.",
      "review_date": "2009-06-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the great sci-fi adventure films to date. This one is actually a little creepier than T2. Schawrzenegger has some funny lines. I'll be back!",
      "review_date": "2006-12-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nFor a low budget 80s flick, it was pretty damn good! The movie did a great job of introducing us to Arnold Schwarzennegar's most iconic role ever. My only complaint was that I don't like sex in the movies I watch, then again, this was directed by James Cameron, he has sex in almost all of his movies...",
      "review_date": "2011-04-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "this movie is just the right action flick for fans of James Cameron",
      "review_date": "2010-10-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Pretty good SciFi action with Arnie and some cool stuff though its dated a bit visually.",
      "review_date": "2019-04-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "For once, an 80's movie that actually got it right. The Terminator is a really good movie and it's interesting to see how many elements and stylings modern movies have stolen from it. This is also the perfect role for Arnie since he's maybeFor once, an 80's movie that actually got it right. The Terminator is a really good movie and it's interesting to see how many elements and stylings modern movies have stolen from it. This is also the perfect role for Arnie since he's maybe the worst actor of all-time. He has no ability whatsoever to convey emotions in a realistic manner so a role that asks for him to be his robotic self is fitting.",
      "review_date": "2012-11-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The original Terminator fires on all cylinders. It's such a classic sci-fi movie. I'm really surprised to see anything negative said about it.",
      "review_date": "2020-01-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Its visuals are not as impressive as visuals seen today, but \"The Terminator\" still remains a thrilling, action-packed and intelligent    sci-fi.",
      "review_date": "2014-03-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's a little bereft in the effects and cinematography departments, but The Terminator succeeds largely on its quickly paced, exciting action sequences and powerful performances from Michael Biehn, Linda Hamilton, and, of course, AH-NULD!",
      "review_date": "2012-10-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A very intense and original science-fiction film. It's not as good as the sequel and some of the effects are dated, but that doesn't stop it from keeping you on the edge of your seat.",
      "review_date": "2012-10-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I honestly don't think that this movie needs an introduction, but I'll give it one anyway - \"The Terminator\" is a 1984 film crafted by legendary filmmaker James Cameron. The film tells the story of a cyborg assassin (Schwarzenegger) who isI honestly don't think that this movie needs an introduction, but I'll give it one anyway - \"The Terminator\" is a 1984 film crafted by legendary filmmaker James Cameron. The film tells the story of a cyborg assassin (Schwarzenegger) who is sent back in time from 2029 to 1984 to kill a young woman (Hamilton). Well, starting from the top, the movie's premise is certainly bizarre and outlandish, though Cameron and team seem to successfully transcend this obstacle by presenting the film's plot with utmost realism and seriousness. Quite possibly the greatest aspect of the film is, in fact, Arnold Schwarzenegger's truly menacing portrayal of the titular character. I wouldn't go so far as to say that this was a difficult performance, but Arnold pulls off one of his earliest acting roles with an intense amount of menace. The action sequences were also a masterstroke aspect of the film. Nearly every set piece in the film contained a good dose of thrills and jaw-dropping moments. The movie itself is, arguably, one of the greatest and most revolutionary science fiction films in film history. \"The Terminator\" was one of the first films to introduce the concept of self-aware artificial intelligence to the big screen, it catapulted the careers of Arnold Schwarzenegger and James Cameron to new heights, and simultaneously introduced several memorable lines of dialogue that most people are familiar with. In 2008 \"The Terminator\" was selected by the Library Of Congress for preservation in the United States National Film Registry, being deemed \"culturally, historically, or aesthetically significant\". Did it deserve this honor? I believe so. For, \"The Terminator\" was a fun, intelligent, novel film for me to experience.",
      "review_date": "2012-11-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "To conclude though, Terminator is the default 80s action film to go to. Not perfect, but it is solid in pacing, visuals (for the time), action and the concept of man vs machines in a bleak and hopeless future. One definitely for a film-makersTo conclude though, Terminator is the default 80s action film to go to. Not perfect, but it is solid in pacing, visuals (for the time), action and the concept of man vs machines in a bleak and hopeless future. One definitely for a film-makers handbook.",
      "review_date": "2016-07-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the absolute best movies ever made one of the action classics  the CGI is amazing for 1984 and Arnold is just so awesome the storyline was really good even though there was a big plothole",
      "review_date": "2013-07-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Well, it's got it's ups and downs. Arnold gives an amazing performance as the Terminator as well as very entertaining scenes, but I find the other movies better. They have longer moments telling the story, but the first movie has, in my eyes,Well, it's got it's ups and downs. Arnold gives an amazing performance as the Terminator as well as very entertaining scenes, but I find the other movies better. They have longer moments telling the story, but the first movie has, in my eyes, too many moments with Arnold shooting things and killing people. Sure, that's what he does, but can we have something else aside from mindless killing in the first 15 minutes please?",
      "review_date": "2014-04-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Today a classic movie with a good story. Even today you can enjoy this movie, because the story makes sense (somehow of course)",
      "review_date": "2020-12-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Terminator: the groundbreaking action film that changed the sci-fi genre.\r The story is so well done; it almost terrifies me every time I watch this film. The concept: that an almost indestructible machine from the future travels backThe Terminator: the groundbreaking action film that changed the sci-fi genre.\r The story is so well done; it almost terrifies me every time I watch this film. The concept: that an almost indestructible machine from the future travels back in time to change everything it just spectacular. If only all sci-fi films were like this. The movie is overall highly entertaining, and there are much cool things. The characters are great, especially the villain. The actors are also great, even though there are some less great actors. The Terminator is surprisingly very well made for a sci-fi film from the 80s. But at the same time are there some aspects in the film that could have been done better, like some of the practical effects. It’s also visible on some places that there are dolls instead for real objects. The action though, is awesome. But there could have been more. The soundtrack is very good, it’s so classic and it gives the audience really scary feelings. The film couldn’t have had a more incredible ending that it got. It’s so great.\r There are a bunch of great things in this film that the sci-fi genre got as foundation nowadays, and this truly is a classic sci-fi film. Unfortunately could the action been a bit more extensive. It’s a bit low for my taste.\r The Terminator gets a 7.8.",
      "review_date": "2014-12-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "For two hours, I was engrossed in James Cameron's cat-and-mouse sci-fi thrill ride. Say what you will about Schwarzenegger's acting, but he was made for this role. Biehn and Hamilton, playing characters separated by different worlds, formFor two hours, I was engrossed in James Cameron's cat-and-mouse sci-fi thrill ride. Say what you will about Schwarzenegger's acting, but he was made for this role. Biehn and Hamilton, playing characters separated by different worlds, form such a complex and ingenious chemistry together, one that is lacking in many action/thriller movies. It never stops for a second, and that's how action movies should be.",
      "review_date": "2019-08-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An original classic that brought a fresh new perspective on story-telling.  The social commentary of technology also is quite fitting for an age where computers were just starting to become prevalent in everyday life.",
      "review_date": "2014-02-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Sure: the effects and some of the soundtrack selections have dated somewhat – the pop songs I mean, not the magnificent score! – yet this is still one of the most compelling sci-fi/action movies ever made, and an astonishingly resourcefulSure: the effects and some of the soundtrack selections have dated somewhat – the pop songs I mean, not the magnificent score! – yet this is still one of the most compelling sci-fi/action movies ever made, and an astonishingly resourceful achievement for its relatively low budget. It also functions surprisingly well as both a horror AND romance film, making it one of the most successfully multi-genred movies of all time.A must-see for virtually anyone who can get past a bit of dodgy make-up and stop-motion.",
      "review_date": "2020-07-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A classic Sci-Fi that paved the way for many of today's special effects. The overall vibe and look fits the intricate and action-packed plot perfectly.",
      "review_date": "2013-12-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In my opinion, The Terminator needs no introduction. It's classic sci-fi mixed with elements of horror with Arnold Schwarzenegger becoming a pop culture icon in a role that required little to no dialogue. Its a testament to how goodIn my opinion, The Terminator needs no introduction. It's classic sci-fi mixed with elements of horror with Arnold Schwarzenegger becoming a pop culture icon in a role that required little to no dialogue. Its a testament to how good low-budget films can be",
      "review_date": "2019-07-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "So machines took over the world! In 2029 The Terminator (Arnold Schwarzenegger) is sent by Skynet to kill Sarah Connor in 1984,  mother of John Connor leader of the human resistance, if the Terminator kills Sarah Connor then John Connor wouldSo machines took over the world! In 2029 The Terminator (Arnold Schwarzenegger) is sent by Skynet to kill Sarah Connor in 1984,  mother of John Connor leader of the human resistance, if the Terminator kills Sarah Connor then John Connor would not have been born (basically The Terminator's mission). But then Kyle Reese (Michael Biehn) is sent back in 1984 to stop the Terminator from killing her. Linda Hamilton's performance as \"Sarah Connor\" is sentiment; Arnold Schwarzenegger as the villain/Terminator, was awesome he brings so much energy into his character. Michael Biehn as Kyle Resse was kick ass as the hero. Writer-director James Cameron and producer Anne Hurd (both of whom co-wrote the script) present their virtuosity storytelling with mastering creativity towards the story. The film has it's like able characters which you can get in a science fiction film. Grade A+",
      "review_date": "2015-07-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Solid noir action thriller that takes the 80's slasher mantle and provides a sci-fi twist with a few guns thrown in for good measure. A dirty grimy world in which the pain of young waitresses destiny hunts her in the form of a 6ft cyberneticSolid noir action thriller that takes the 80's slasher mantle and provides a sci-fi twist with a few guns thrown in for good measure. A dirty grimy world in which the pain of young waitresses destiny hunts her in the form of a 6ft cybernetic organism seeking to tear her world apart.",
      "review_date": "2022-09-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"The Terminator\" is an intense, action-packed flick that will keep you in the edge of your seat. This is definitely one of the best action flicks of all time, watch this if you haven't yet.",
      "review_date": "2015-01-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Terminator is... its just a great movie. But its low budget shines right through. Look, I understand, there are alot of great low-budget movies out there, and this is one of them, but I can't help but feel that it could have been betterThe Terminator is... its just a great movie. But its low budget shines right through. Look, I understand, there are alot of great low-budget movies out there, and this is one of them, but I can't help but feel that it could have been better with a bigger budget.",
      "review_date": "2016-01-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nPretty much one of the most iconic sci-fi action romps of its time \"The Terminator\" manages to pull you into its time twisted, post apocalyptic and (defiantly now) retro 80's ride, filled with an action packed storyline, putting time aside for not only character relations but also throwing in elements of a horror, \"The Terminator\" doesn't drag nor disappoint, with a seemingly flexible cast and an actor who was born to play this role, \"The Terminator\" is full of surprises that might just leave you wanting more.\r Like I said Schwarzenegger was born to play the role of the Terminator, its an iconic part, one filled with many quotes and catchphrases (which is pretty much all of his dialogue) contributed by fantastic and believable performances by Linda Hamilton and Michael Biehn, thrusting this film into a gripping tale of hunter and hunted. The soundtrack is one that gets you motivated and pumped but has a sense of sadness to it one that gets you even more emotive (especially when the drums kick in) towards the actual war taking place as the story takes a route down memory lane for Kyle Reese, its another part that makes this franchise iconic as its a theme you will never forget.\r Yes, this is a bit of an action flick, one taken with a pinch of salt, and for a low budget film (especially in the 80's) its done an amazing job at heart, with only the CGI and make up looking very naff at some points, but hey.. cant blame them! Yes, there are a few questionable moments that end up in explosions and onslaught, but that's all apart of the experience, what I'm surprised at is how an action romp such as this has time to fit in sensible and likable characters that have point and purpose to the entire integrity of the films lore. I have to say I'm not a mega fan of James Cameron's work, but seeing what tools where at his disposal he has done a fantastic job with this, making something original and thought out, that can and does deserve at least one good sequel. Yes, I do like this film, of course there are flaws with it, even at its time, mainly being a tad mediocre and following a noticeable A to B format but I think we can agree that the action contracts that. this one is for retro loving thrill seekers!",
      "review_date": "2014-07-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In 1984 a movie did not have more than one storyline and a dozen script reviews plus 1 year postproduction for CGI... So my Vote is from a 1984 view...",
      "review_date": "2019-11-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Terminator was one of the most revolutionary films of all time and is one of the defining films of the action genre. This is one of the most well written and directed action films. James Cameron put himself on the map with this movie thatThe Terminator was one of the most revolutionary films of all time and is one of the defining films of the action genre. This is one of the most well written and directed action films. James Cameron put himself on the map with this movie that inspired several films after it. The CGI is ground breaking for its time and the action hold up just as well now as it did in 1984. Arnold Schwarzenegger plays The Terminator which is the film that broke him into the mainstream and really is the role he was born to play. Linda Hamilton and Michael Biehn are also amazing. This film blends action with the perfect amount sci-fi and there is even some elements of horror involved. There are points in this movie were the Terminator feels like a really good slasher film villain. You cannot call yourself an action film fan without watching The Terminator.",
      "review_date": "2015-07-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Terminator films have become so bloated with effects and one-liners that it's easy to forget it all started with this comparatively small sci-fi thriller. This is a film that does what few can, providing just enough story to keep the ballThe Terminator films have become so bloated with effects and one-liners that it's easy to forget it all started with this comparatively small sci-fi thriller. This is a film that does what few can, providing just enough story to keep the ball rolling without ever feeling like it's being stingy, but it's essentially just a three-character shoot-em-up in 1980's Los Angeles. It could have so easily ended up being a cheesy b-movie, but the tight direction and the way the principles throw themselves into their roles instead make it one of the better action films ever made.",
      "review_date": "2015-07-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Who would've thought that a low-budget B-movie featuring a first -time director would become one of the greatest, and most iconic action/sci-fi films ever?  Suspenseful throughout, and gives Schwarzenegger the role he is most identified withWho would've thought that a low-budget B-movie featuring a first -time director would become one of the greatest, and most iconic action/sci-fi films ever?  Suspenseful throughout, and gives Schwarzenegger the role he is most identified with today.  This movie gets better every time you watch it.\r 9.8/10",
      "review_date": "2014-12-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Full of suspense, full of energy, this film is quite interesting even wear those years    .",
      "review_date": "2015-10-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The acting, suspense, 80's culture, one liners, action, dark humor, and impact on the media makes this film deserve a 10 out of 10, and it takes a lot of courage for me to give any film a 10 out of 10. Need I say more?\r One thing I will sayThe acting, suspense, 80's culture, one liners, action, dark humor, and impact on the media makes this film deserve a 10 out of 10, and it takes a lot of courage for me to give any film a 10 out of 10. Need I say more?\r One thing I will say though, why does this film have only a 7.7/10, whereas its (in my opinion) overrated sequel have a 9.1/10? The first one was way better.",
      "review_date": "2015-11-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Looks very dated but it's pretty good. Nicely developed characters and a cool villain that doesn't need any introducing. The effects aren't that great but it's not a deal breaker.",
      "review_date": "2016-09-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This amazing movie to this day is one of the best sci fi movies I have ever seen. Even though T2 outshines the original, the original 1984 terminator is a really fun and intense ride.",
      "review_date": "2015-07-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Terminator, the film that catapulted Arnold **** into Hollywood's stratosphere, was never designed for more than a niche audience. Indeed, while the film made a nice profit for Orion Pictures (returning grosses about six times its cost),The Terminator, the film that catapulted Arnold **** into Hollywood's stratosphere, was never designed for more than a niche audience. Indeed, while the film made a nice profit for Orion Pictures (returning grosses about six times its cost), it did not make the kind of money that would cause it to be labeled a \"blockbuster\" or that would justify a sequel. But The Terminator arrived at a time when America's appetite for science fiction was escalating and when the home video revolution was taking off. Although only a minor success in theaters, The Terminator was a gargantuan hit on home video. And, when James Cameron solidified his reputation by directing Aliens, it became unthinkable that there would not be a sequel to The Terminator.\r The movie's strength is that, like The Matrix, it combines action with ideas. This isn't a run-of-the-mill turn-off-the-brain collection of chases and fight scenes. The plot, which involves time travel and the paradoxes inherent therein, requires viewers to pay attention or risk having no idea what's happening. I remember leaving the theater 25 years ago and hearing a girl remark: \"I liked it but I didn't understand what was going on. Was that guy from the future Arnold's father?\" Cameron, as it turns out, took a little too much license in claiming full credit for the story. Noted science fiction author Harlan Ellison sued, arguing that The Terminator bore more than a passing resemblance to two of his Outer Limits teleplays, \"Soldier\" (about two time-traveling soldiers who end up in 1964, where they fight to the death) and \"Demon with a Glass Hand\" (about a time-traveling robot that looks like a man). The settlement resulted in Ellison gaining an on-tape credit as well as an undisclosed amount of money.\r The Terminator is structured as one long chase, with the vulnerable Sarah and Reese fleeing from the relentless Terminator. At first, Sarah distrusts Reese, believing him to be demented. But, once The Terminator has destroyed a police station and killed most of the cops within, she has no choice but to trust Reese. That bond develops into a romance, but The Terminator's pursuit allows little opportunity for down time or sweet nothings. Nevertheless, Cameron has a knack for getting us to care about the characters and their relationship even though not a lot of time is spent getting to know them. (There are actually more \"character building\" sequences in the more heavily action-oriented Terminator 2.)\r Key special effects, which were cutting edge in 1984, appear dated by today's standards. Stan Winston's stop-animation Terminator, which takes over for Schwarzenegger at the end, looks like what it is: the product of a special effects lab. It's not credible, but the story is strong enough to overcome such shortcomings. In fact, some of the other visual chicanery - time travel effects, Schwarzenegger's makeup, and flash-forward scenes set in a post-apocalyptic 2029 - are effective. By the time Terminator 2 arrived, Cameron had both the budget and the ability to better integrate the robot Terminator into its surroundings. The herky-jerky awkwardness that marks the climax of the first movie is not evident during the sequels.\r The potential evidenced by Cameron in The Terminator - the ability to sustain suspense, meld action with story, and provide compelling characters despite the limitations of the actors portraying them - would be fully realized in two future features, Aliens and Terminator 2. This movie, however, is in some ways more impressive than either of those because of what the filmmaker was capable of achieving with a limited budget and without significant studio backing. The themes and ideas presented in The Terminator hold up well today, even though we have moved into the post-Cold War era and only the most nihilistic individuals could see 2029 in such bleak terms. It's a rousing science fiction story that proves an on-screen adrenaline rush need not short-circuit the brain.",
      "review_date": "2015-04-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Have not always been a big fan of action films, after seeing my fair share poorly made, dull and predictable, sloppily written and badly acted ones that delivers just as little on the action (the worst of Steven Seagal being prime examples.Have not always been a big fan of action films, after seeing my fair share poorly made, dull and predictable, sloppily written and badly acted ones that delivers just as little on the action (the worst of Steven Seagal being prime examples. The Terminator however is like Die Hard, a thrilling well-made film that succeeds as an action film and a film in general, and treats its audience and genre with respect. It is also one of director James Cameron's best films along with Terminator 2 and Aliens.The Terminator looks great still, sure the special effects have not held up as well as the rest of the film but they are not that bad. The film is beautifully and slickly photographed and the sets and lighting are so imaginative and wonderfully nightmarish that one really does get sucked and immersed into its world., and filled with sharp details. Cameron's direction is superb, some of the best of his whole career. The music score is hauntingly eerie and its synthesised sound doesn't date the film at all, instead adding hugely to the atmosphere. The script (including the famous 'I'll be back') is snappy and smart with plenty of wittily written lines, the story is incredibly engrossing and exciting to the maximum with plenty of suspense and fun.Action fans are guaranteed too to be thrilled by the action here, being both dynamic and thrilling, the climax really does jangle the nerves. Michael Biehn and especially Linda Hamilton shine in their roles, and Arnold Schwarzenegger has never been more perfectly cast as his most iconic character to date. All in all, a brilliant film and one of the greats of the action genre. 10/10 Bethany Cox",
      "review_date": "2020-09-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I love this movie !!! A lot of Action !!! Good Story and a cool character and super gloomy :)  The Terminator in search after Sarah Connor. The classics.",
      "review_date": "2015-11-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best sci-fi action movies available for basically every sci-fi fan out there, the Terminator will terminate all the bad moments in the movie and you're going to like it no matter what your opinion is.",
      "review_date": "2016-01-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nGreat movie but I hate that Kyle dies I don't think they should have killed of Kyle but great movie very intense which is good. warning this movie is not suitable for under 15 unless the parents let them",
      "review_date": "2016-01-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Well, ladies and gentlemen, here it is. The one you all been waiting for, The Terminator, starring Arnold Schwarzenegger and directed by James Cameron. And get this: my old friend Jacob Dimmock, he is a fan of Arnold Schwarzenegger and IWell, ladies and gentlemen, here it is. The one you all been waiting for, The Terminator, starring Arnold Schwarzenegger and directed by James Cameron. And get this: my old friend Jacob Dimmock, he is a fan of Arnold Schwarzenegger and I think everybody's a huge fan of him. This is the first film I've ever looked that has an 100% rating from critics from Rotten Tomatoes and one of Arnold Schwarzenegger's best films. You can't really go wrong. It's just unbelievable. OK, I'm going to tell you the details. Arnold Schwarzenegger plays an evil cyborg aka The Terminator sent back in time from 2029 to 1984 (the film is been released in the year 1984) to kill Sarah Connor played by Linda Hamilton before she gets pregnant to the boy who will one day become a savior against machines in a post-apocalyptic future. So he walks naked and comes across the three punks. One was played by the memorable Bill Paxton and two of them I don't know. One of them said ''Nice night for a walk.'' and ''Nothing clean, right?'' and The Terminator starts copying what he is saying and he says ''Your clothes. Give them me, now.'' and the punk leader says ''Fxxx you, axxxxxe!'' so the Terminator starts beating the punks and kills one of them by punching through his chest, pulls his fist out full of blood and holding his heart and one of them takes his clothes off and makes him wear them. I didn't know he punches through his heart at first because all I can see is a pool of blood but I think my brother had a reaction from that scene what The Terminator had just did. Then we see Michael Biehn as Kyle Reese as an soldier from the future (one possible future) sent back in time to protect Sarah Connor and the first chase scene is gripping it's dark. There's a scene where Sarah goes to the nightclub where the 80s party songs are on is a scene where she's been tracked down by The Terminator and Kyle Reese but Reese protects her from The Terminator before he kills her. I love the pacing and directing for this scene, it's unbelievably brilliant. Now the second chase scene where Kyle drives away from the cyborg Terminator and explains to Sarah that The Terminator can't be bargained with and can't be reasoned with and doesn't feel pity, or remorse, or fear and absolutely will not stop ever, until she is dead. Now the scene The Terminator is cleaning himself by cutting through his wrist and wipes his face and eyes but pulls his eye out and use a cloth to clean through his eye patch and as you can see Arnold looks so different when he get the cloth out of his eye and you can clearly see that his eye is an robotic cyborg skeleton. OK, there is a shootout scene after Arnold famously says his memorable favourite quote of all time that many people has impressed and blown away by is ''I'll be back.'' I bet he says that at every single movie he does. And there's a scene where the person says ''Hey, you got a dead cat in here or what?'' and The Terminator chooses the possible response choosing Yes/No or What?, Go away, Please come back later, Fxxx you, axxxxxe and Fxxx you. He chose by saying ''Fxxx you, axxxxxe.'' I even chuckled at that scene. And that it, that's the end of it. I didn't tell about The Terminator killing the wrong Sarah Connor or the ending cause I think you and the audience in the world have already know that movie by heart. Arnold Schwarzenegger doesn't talk much in this film because The Terminator is so quiet and keeps in character while filming. That's why his character is so great in this film. Linda Hamilton is great in this so is Michael Biehn and all the actors and actresses who did their fantastic portrayal in this movie. Well, guys, I guess you've all know this movie by heart and James Cameron and Gale Anne Hurd did their fantastic job making this film. Even the special effects at the end looks sort of Stop-Motion-ish. I don't know, it looks like it's from the older films like Sinbad and King Kong and all the other dinosaur films. Jeez. Anyways, The Terminator is one of my favourite films of all time along with the others like Die Hard, Lethal Weapon, Highlander, Goldeneye, Bird On A Wire and many more. So I guess this is it then. 10/10. Favorite of all time. Starring Arnold Schwarzenegger.",
      "review_date": "2018-06-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The terminator promised to become one of the best sci-if films ever, and it doesn't lie. With an interesting premise, a cool end and a satisfying result, The terminator deserves the most prestigious awards of this kind of films.",
      "review_date": "2016-09-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best cyborgs of all time is in this action packed movie directed by a great director known as James Cameron, The Terminator. The Terminator is about somewhere in the year 2029, the rulers of Earth, to ensure their success, decideOne of the best cyborgs of all time is in this action packed movie directed by a great director known as James Cameron, The Terminator. The Terminator is about somewhere in the year 2029, the rulers of Earth, to ensure their success, decide to reshape the future by changing the past. They send The Terminator back in time to destroy Sarah Connor, who doesn't realize the awesome role her unborn child will play in the decades to come.",
      "review_date": "2016-03-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Terminator is a classic. One of the all-time great sci-fi/action movies which keeps you interested throughout its duration.",
      "review_date": "2020-06-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A classic.............................................................................................................................................",
      "review_date": "2016-08-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the movies that put the names of Schwarzenegger and James Cameron on the spotlight. The action sequences works as well, without being hampered by the special effects; the final 20 minutes are heart-pounding. An essential of 80s, forOne of the movies that put the names of Schwarzenegger and James Cameron on the spotlight. The action sequences works as well, without being hampered by the special effects; the final 20 minutes are heart-pounding. An essential of 80s, for binge during the quarantine.",
      "review_date": "2020-04-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of Cameron's best movies. For 1984, the film is simply great, and Arnold Schwarzenegger perfectly approached the main role. We can say that this is the best film in the franchise, given the meager budget.",
      "review_date": "2020-09-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A MasterpieceThe Terminator is a classic, No doubt about that because of all the memorable scenes.",
      "review_date": "2019-07-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Terminator. Come with me if you want to live. Cool science fiction movie from the inimitable James Cameron. All the actors performed their roles perfectly. Especially Arnold Schwarzenegger who played a great cyborg killer. Although theThe Terminator. Come with me if you want to live. Cool science fiction movie from the inimitable James Cameron. All the actors performed their roles perfectly. Especially Arnold Schwarzenegger who played a great cyborg killer. Although the film leaves behind some logical questions, it (the film) is still cool.",
      "review_date": "2020-03-23",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 113,
  "genres": [
    "Action",
    "Sci-Fi",
    "Thriller"
  ]
}