{
    "rating": 9.1,
    "release_date": "2023-04-13",
    "num_reviews": 53,
    "genres": [
        "English"
    ],
    "summary": "\"The Lost Weekend: A Love Story\" explores the 18-month relationship (1973-1975) that John Lennon spent with May Pang, his Chinese American assistant turned lover (on Yoko Ono's insistence). With May's help, Lennon reunited with his son Julian and had his most artistically and commercially productive period post-Beatles -- with the albums \"Mind Games\", \"Walls and Bridges\" which included his only #1 Hit Single \"Whatever Gets You Through the Night\", \"Rock and Roll\" and collaborated with Elton John, David Bowie, Harry Nilsson, Mick Jagger, and Ringo to name a few. Pang chronicles it all revisiting her younger self, a naïve 22-year old experiencing her first, unforgettable love.",
    "reviews": [
        {
            "content": "Great film!! A really interesting perspective and a beautiful love story between May Pang and John Lennon! Highly recommend.",
            "review_date": "2023-04-27",
            "source": "rt"
        },
        {
            "content": "Beautifully told!\n The movie does an amazing job intertwining  real-life photos, videos, doodles and music to tell this interesting love story.",
            "review_date": "2023-04-26",
            "source": "rt"
        },
        {
            "content": "May Pang bares her soul, her courage and her love...\nBeautifully filmed, her personal photos, animations throughout, so much to see to hear, and to feel!\nPersonally, saw it four times...  I highly recommend to all...",
            "review_date": "2023-04-25",
            "source": "rt"
        },
        {
            "content": "I thought the movie was great! It moved right along. It was informative and entertaining.",
            "review_date": "2023-04-24",
            "source": "rt"
        },
        {
            "content": "Better than I expected!  Loved the photos and the interviews",
            "review_date": "2023-04-23",
            "source": "rt"
        },
        {
            "content": "If you have not seen The Lost Weekend A Love Story, I recommend it highly. We saw the documentary—and it is not only a slice of rock history, but a love saga extraordinaire.",
            "review_date": "2023-04-22",
            "source": "rt"
        },
        {
            "content": "This is a great heartfelt evocative, important piece of filmmaking. I was choked up and crying, to differing degrees, repeatedly throughout the film. For anybody who cares about the Beatles or cares about empathy, compassion and the human condition ￼this is so worth it. A masterwork.",
            "review_date": "2023-04-22",
            "source": "rt"
        },
        {
            "content": "I'd like to know more about john Lennon",
            "review_date": "2023-04-21",
            "source": "rt"
        },
        {
            "content": "The bias toward Yoko Ono only comes off as simplistic and redundant. It would have felt more genuine if it were more honest, yet it's so clearly biased.",
            "review_date": "2023-04-21",
            "source": "rt"
        },
        {
            "content": "This was a great film! Charming and very entertaining mixture of stills, clips, music and interviews combined with a present-day voiceover from Pang. Lennon-style animation is used effectively to illustrate some of the more dramatic parts of the story. Lennon's humor and warmth, as well as his musical productivity are highlighted without erasing the more disturbing aspects of the story. Lennon's son Julian is a large focus and Pang is rightfully credited with helping repair the relationship between father and son. The film is engrossing throughout and concludes with an unexpected but tasteful emotional pay-off. Leaves the viewer with a more nuanced view of both Lennon and May Pang's relationship as well as Julian and John's.",
            "review_date": "2023-04-20",
            "source": "rt"
        },
        {
            "content": "I very much enjoyed hearing May's personal account of her time with John. I read the reviewer for The NY Times and I really do not agree with his assertion that May \"trashed\" Yoko. I believe she told her truth, and along with Julian's presence in the film, one has to consider the authenticity of her perspective.",
            "review_date": "2023-04-20",
            "source": "rt"
        },
        {
            "content": "Compelling story of untold events during the time when John Lennon was separated from Yoko Ono.  Expertly scaffolded, the story walks the audience through May Pang's intimate experiences with John, his relationship with Julian, his reconnecting with former Beatles, and his irrepressible musical genius. A must see it for any Beatles fans!",
            "review_date": "2023-04-19",
            "source": "rt"
        },
        {
            "content": "Turns out this first generation Beatlemaniac doesn't know it all. I loved May Pang's informative , heartwarming documentary. The emotional ending with Julian had me bawling like a baby. Congrats May for sharing yours and John's love story.",
            "review_date": "2023-04-19",
            "source": "rt"
        },
        {
            "content": "Apr 18, 2023\nThis film is a must see if you were of the generation of the Beatles! May Pang told her incredible story and I couldn't get enough. Growing up, I had no idea that this love story existed. It was so rare to see the everyday life of John Lennon and the other musicians of the day, Elton John, Alice Cooper and the likes.  It was an authentic glimpse into the interesting story of John Lennon and Yoko Ono as well. \nThis is a story that needed to be told and I was so happy to be able to glimpse into the love between May and John.",
            "review_date": "2023-04-18",
            "source": "rt"
        },
        {
            "content": "A wonderful Documentary......learned so many new things about John Lennon and his important time with May Pang.  I can't wait to see it again!",
            "review_date": "2023-04-18",
            "source": "rt"
        },
        {
            "content": "May Pang finally gets to tell her side of the \"Lost Weekend\" story after 50 years.  This is a well-crafted, interesting and emotionally touching documentary.  Highly recommended for any fan of that early 70s time, John Lennon and the Beatles and pop culture!",
            "review_date": "2023-04-18",
            "source": "rt"
        },
        {
            "content": "I enjoyed seeing and hearing Pang's recollection of this pivotal time in both her and Lennon's life.  I remember when this was happening and did not know what to make of it.  I never admired Yoko Ono, and I think this documentary provides some very interesting information about wife #2 in Lennon's too-short life.  She was considered very avant garde, but she wasn't good at what she did (FLY was a crashing bore and her singing is like nails on a chalkboard).  My feeling about Ono is that she had narcissistic tendencies and was insecure (hence keeping John and Julian apart and not dealing kindly with Cynthia). I feel that she chose Pang because this way she could control the separation and also she felt that this young assistant would pale in comparison to her.  Instead the opposite happened and Yoko was not amused.  I appreciated that Nancy O'Dell was one of the people that the film interviewed; she worked for Apple in London and her book details her experiences with the Beatles (she had an affair with Ringo), Leon Russell, etcetera, so her in-put was appreciated by this viewer.  In fact, O'Dell has written about this part of her life and that, too, would make a wonderful documentary.",
            "review_date": "2023-04-17",
            "source": "rt"
        },
        {
            "content": "May Pang did an excellent job explaining how \"The Lost Weekend\" came to be & also many questions were answered regarding Yoko's relationship with John. Great insight to that period of time.",
            "review_date": "2023-04-17",
            "source": "rt"
        },
        {
            "content": "If you are a John Lennon fan (like I am), you will mesmerized by this movie!  His signature is written all over it!  The trailer barely touches on the true vibe of this gem.  Created completely in the \"Beatle\" movie genre, the backdrop is animated, cheeky, and, well, John Lennonish.  We begin with May Pang's story and relationship with Yoko Ono and John Lennon.  Before you know it, we are transported into a delightful glimpse of Lennon's private relationship with his son, song writing, and social life.  May Pang's youthful innocence and enthusiasm pull John into a brighter perspective, and us into a beautiful love story.  An intimate original I highly recommend.",
            "review_date": "2023-04-17",
            "source": "rt"
        },
        {
            "content": "I've met May Pang but didn't really know much about her.  Needless to say I became interested in seeing this movie and of course anything that has to do with the Beatles.   It was so well done, fast moving and quite the emotional journey through May's life.  Although I've met May, the movie really gave me an insight into her life from birth to current day and everything in between.  Thank you May Pang for sharing your life with us.  A great rock and roll love story indeed!",
            "review_date": "2023-04-16",
            "source": "rt"
        },
        {
            "content": "Fantastic!  Loved hearing the story in May's words and pictures.  Gave me new insight to what I thought I knew about the \"lost weekend\".   It was great to see Julian at the end and see the love they have for each other after all these years.",
            "review_date": "2023-04-16",
            "source": "rt"
        },
        {
            "content": "Outstanding!\n\nBeyond the marketing of the Beatles and the individual members, there exists little in the way of understanding the human beings at the core...and for John Lennon, at least,  this film fills some of that gap. If you need to hear some music, stay home and listen to a CD....this film is about a time of relationships and the love that was repaired, shared, and the possibilities that were lost for all of us. \n\nThe Lost Weekend: A Love Story beautifully tells the story of a moment in time, from the perspective of those closest to Lennon, and especially through the eyes of his lover, May Pang.  The film is made from interviews, narration, old film, pictures and drawings. I found myself feeling a wide range of emotions with the fresh candor of this story telling, even moments of tears. It felt as if I were sitting there with Pang as she relayed her story. I applaud Pang for her courage in bringing this intimate story forward and sharing this moment in time with all of us.",
            "review_date": "2023-04-16",
            "source": "rt"
        },
        {
            "content": "Such an inspirational film!!",
            "review_date": "2023-04-16",
            "source": "rt"
        },
        {
            "content": "Loved this so much. Would recommend.",
            "review_date": "2023-04-16",
            "source": "rt"
        },
        {
            "content": "\"The Lost Weekend: A Love Story\" is a mesmerizing film experience and an absolute must see for anyone who thought they \"knew\" John Lennon through his music, his interviews and his writings. \nMay Pang shares with us the love affair she had Lennon in the early 1970s. Beautifully constructed using film clips, incorporating Pang's vast photographic collection and using Lennon's line drawings, the film is a deep dive illustration and narrative into the love story between Pang and Lennon and shows us a man who appears more relaxed, more social and fun-loving than he had appeared in the past.\nPang reunites Julian Lennon with his father, also bringing John's first wife, Cynthia into the fold. Listening to Julian share his fond memories of the time he shared with his father makes it clear that Pang is the real thing. Authentic. It does make one wonder, if only….\nI read May Pang's \"Loving John: The Untold Story\" in the 1980s so I wasn't shocked by the story, but I was taken on an emotional ride through their time together, and after.  As the song goes, \"All You Need is Love\" and it is clear that Pang lives life from a place of love and not ego. She was the impetus for Lennon to restore friendships from his past and in doing so, recharge his musical genius.\nCongratulations to May Pang, Micki Purcell (Executive Producer), Richard Kaufman and Eve Brandstein (Producers) and their teams for creating this beautifully indepth piece of history.",
            "review_date": "2023-04-16",
            "source": "rt"
        },
        {
            "content": "This film takes you on a journey through love, life and the Beatles. The way the film is so beautifully stitched together with photos and historical footage is incredible, and May's delightful energy and  voice weaving it all together is so moving and really brings you in. Lots of emotions through this film, it really takes you on a ride. A must see!",
            "review_date": "2023-04-16",
            "source": "rt"
        },
        {
            "content": "This is a must see for Beatle and Lennon fans.  Fast paced and full of great stories, I thoroughly enjoyed this film. A touching look at May Pangs amazing life and her years spent working for and living with John Lennon. Highly recommended!",
            "review_date": "2023-04-16",
            "source": "rt"
        },
        {
            "content": "This documentary is a must see! Especially if you were a part of the Beatles era. May Pang narrates her passionate love story with the infamous John Lennon, and she does so with such intrigue. I found myself so invested, staring at the screen wanting to know more and more! The way she captivates you, as she recalls falling in love with John, has you feeling like you are right there on the journey with her. I would definitely see this movie again and encourage you to go see it! You won't regret it.",
            "review_date": "2023-04-16",
            "source": "rt"
        },
        {
            "content": "If you loved the Beatles,  and John Lennon, this is a must see!  I did not expect a documentary type movie to affect such an emotiomal response from myself, and the packed theatre, but this well done movie does just that.  Interweaving interviews, live video footage, and previously unseen pictures,  one gets a compassionate and sensitive look into the relationship between John  and May Pang.  The Beatles and John Lennon's music is the soundtrack of many lives, and this movie gives a very up close and personal peek behind the curtain to understand what transpired during the mysterious \"Lost Weekend\", and how John's relationship with May affected his music, his relationships with his former bandmates, and the restoration of his relationship with son, Julian.  A well done, and engaging movie!",
            "review_date": "2023-04-15",
            "source": "rt"
        },
        {
            "content": "Just saw The Lost Weekend: A Love Story- a documentary about John Lennon and May Pang's relationship.  Congrats to Micki Nolan Purcell- Executive Producer!! The movie is incredibly well-done, it keeps you on the edge of your seat because it's such an interesting story with Lennon's music and interesting facts that no one knew about until now.  Go see the movie!  You won't be disappointed!!",
            "review_date": "2023-04-15",
            "source": "rt"
        },
        {
            "content": "I grew up during that generation and was a big  Beatles fan I never knew this relationship.  I only knew Yoko and John   I spoke to many friends who were unaware as well.  This is a very telling story  I know you will enjoy! I truly enjoyed the movie. It was well done !",
            "review_date": "2023-04-15",
            "source": "rt"
        },
        {
            "content": "I absolutely LOVED this film! May Pang told her incredible story and I couldn't get enough. I had no idea the way this love story unfolded. I felt like I was there reliving moments in time...and getting a rare, authentic glimpse into the loving, playful and adorable side of John Lennon and the bond of love they formed. It was captivating start to finish. Bravo to May and all of the brilliant filmmakers.",
            "review_date": "2023-04-15",
            "source": "rt"
        },
        {
            "content": "The movie exceeded my expectations.  Understanding the life of John Lennon from a personal perspective, and learning about May Pangs impact on both John and Julian's life was eye opening.  My heart goes out to out.  RIP JL",
            "review_date": "2023-04-15",
            "source": "rt"
        },
        {
            "content": "I've been a huge Beatles/John Lennon fan for over 50 years (ouch!)  I thought I already knew almost everything there was to know about Beatles history.  Yet this documentary film gave even more personal color to the amazing, creative and brilliant life of John Lennon.",
            "review_date": "2023-04-15",
            "source": "rt"
        },
        {
            "content": "Love story documentaries often require a delicate touch to capture the love and emotions that the subjects share for one another. This movie beautifully captures John Lennon and May Pang's passion and love for one another over such a short period of time. It also explores their personal life struggles, battle of addiction, the downfall of The Beatles but most of all their dedication to each other during these difficult times.\nThe film's pace is captivating, and the editing is seamless, flowing effortlessly from one part of their lives to another. The use of old photographs and archival footage adds an element of nostalgia and depth to the story like you wouldn't believe! I highly recommend for anyone who loves a good love story!",
            "review_date": "2023-04-15",
            "source": "rt"
        },
        {
            "content": "Spectacular documentary! Very creative use of videos, stills and sketches. Add to that the personal narration by May, I felt more like a friend hearing a story than a voyeur peeking at celebrity. And even though she was not \"in the picture\" I got a sense of the magnetic influence of Yoko. For better or worse, this influence profoundly impacted the musical world. Now I understand it better. Entertaining and informative, what more could you want from a documentary? Bravo!",
            "review_date": "2023-04-15",
            "source": "rt"
        },
        {
            "content": "It was a good movie. Good insights into the \"lost weekend\". Good to see if you are a Beatles fan. It tells a story from May Pang's point of view.",
            "review_date": "2023-04-15",
            "source": "rt"
        },
        {
            "content": "This movie was uplifting and enlightening...the whole audience was rapt with attention throughout the screening. First movie I've seen for years where people weren't texting or scrolling. At the end, there was a burst of spontaneous applause. Please give this film a wide release...it has huge appeal. Everyone in the audience stayed afterward to talk about the movie, even though most of us were strangers. That doesn't happen with a lot of movies these days. Please check it out if you can",
            "review_date": "2023-04-15",
            "source": "rt"
        },
        {
            "content": "Great documentary. Found out a few new facts about John Lennon",
            "review_date": "2023-04-15",
            "source": "rt"
        },
        {
            "content": "Excellent movie for real Beatle fans for the insight to a little known part of John Lennons life told in 1st person",
            "review_date": "2023-04-14",
            "source": "rt"
        },
        {
            "content": "This movie exceeded my expectations.  It was beautifully done. The photographs coming to life and the artwork animation done in Lennons style was so interesting and charming.  It captivated me throughout the entire story.",
            "review_date": "2023-04-14",
            "source": "rt"
        },
        {
            "content": "i love john lennon, but we really needed another documentary about his life? We have to respect people's privacy, especially those who have passed away",
            "review_date": "2023-04-14",
            "source": "rt"
        },
        {
            "content": "Top notch documentary. Well edited, with great music. May Pang gives an inspiring performance.",
            "review_date": "2023-04-14",
            "source": "rt"
        },
        {
            "content": "Beautiful, heartbreaking look into John and May's life during the early 1970s that will have you asking \"what if?...\" \nA must-see for all Lennon fans",
            "review_date": "2023-04-14",
            "source": "rt"
        },
        {
            "content": "What an exquisitely made and wonderful film!  Provides striking illumination to a period of time that we had only bits and pieces of before.  At the very least, the film can take its place as an equal among the other great films of the Beatles-universe canon.  \nWell done May! ❤️",
            "review_date": "2023-04-14",
            "source": "rt"
        },
        {
            "content": "Moved to tears more than once. If you walk away with anything in this amazing documentary is that it's a stark reminder of just what a massive talent and larger than life man John Lennon was and how lucky we all were to be touched by it. God Bless May Pang for sharing with us these incredibly candid moments, stories and vintage photos. I can't think of another Lennon documentary that showed us what it was like to be around this amazing man. Warts and all… A MUST-SEE for any Beatles fan…",
            "review_date": "2023-04-14",
            "source": "rt"
        },
        {
            "content": "If you thought you knew this story, youre wrong. A very well made film, and it is worth the effort to seek it out.",
            "review_date": "2023-04-14",
            "source": "rt"
        },
        {
            "content": "Truly fabulous. Must see. a joy a delight and incredible insight to such iconic figures. 5 star",
            "review_date": "2023-04-14",
            "source": "rt"
        },
        {
            "content": "Loved the untold story. Learned a lot from May. We thank \nher.",
            "review_date": "2023-04-14",
            "source": "rt"
        },
        {
            "content": "If you have the chance see this film. The production of this film is a knock out!",
            "review_date": "2023-04-14",
            "source": "rt"
        },
        {
            "content": "I deeply appreciated Mays sincere candor when sharing such personal experiences. Very well done!  Given the opportunity, this is a film I’d like to see again.",
            "review_date": "2023-04-14",
            "source": "rt"
        },
        {
            "content": "A beautiful love story.",
            "review_date": "2023-04-14",
            "source": "rt"
        },
        {
            "content": "It was so awesome! I want to see it again ! I’m John and May biggest fan",
            "review_date": "2023-04-14",
            "source": "rt"
        }
    ]
}