{
  "title": "Kagemusha",
  "rating": 6.2,
  "release_date": "1980-10-10",
  "genre": [
    "Drama",
    "History",
    "War"
  ],
  "summary": "A petty thief with an utter resemblance to a samurai warlord is hired as the lord's double. When the warlord later dies the thief is forced to take up arms in his place.",
  "critic_reviews": [
    "Simple, bold, and colorful on the surface, but very thoughtful.",
    "Though the story's Shakespearean underpinnings give Kagemusha the weight of classic tragedy–in this case, the tragedy of a man rendered helpless by larger historical forces–the film astonishes mostly as pure spectacle.",
    "An often breathtaking but slightly bloodless samurai epic.",
    "An often overlooked fine entry in the Kurasawa canon, this shows a good many western 'epics' how it's done.",
    "The massive battle scenes rank with the director's best, using brilliant color, contrasting light, and the enormous cast to great advantage. Kurosawa also alternates compelling scenes of near hypnotic stillness with scenes of rousing action.",
    "Kurosawa, at 70, shows himself young indeed in the impressive handling of this historical drama laced with shrewd insights into the almost Shakespearean intrigues of power.",
    "The film vibrates with a profound respect for historical veracity, the busy intersection between political sociology and psychology, and grunting, portentous masculinity.",
    "Something large and abstract is stirring here, though the film's ultimate implications are chilling",
    "For all Kurosawa's splendidly colourful recreation of 16th century Japan, and though Nakadai's performance is impressive enough, it's all ultimately rather empty and tedious; it could easily have been cut by almost an hour, while the grating Morricone-like score only serves to underline the fact that the director fails to achieve the emotional force of his finest work."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Oh ben mince alors, la grosse bouse de 2h40 que voilà…! alors 2h40 peut-être… mais qui semblent durer 4h40 ou 5h40. Environ. Il faut dire que la mise en scène statique et psycho-rigide d’un autre âge (révolu) n’arrange rien, bien auOh ben mince alors, la grosse bouse de 2h40 que voilà…! alors 2h40 peut-être… mais qui semblent durer 4h40 ou 5h40. Environ. Il faut dire que la mise en scène statique et psycho-rigide d’un autre âge (révolu) n’arrange rien, bien au contraire. Seuls les costumes impressionnent un minimum (et les armures surtout) ainsi que quelques figurants (quand même).On remarque ça de loin en loin, alors qu’on avance à marche forcée avec l’avance rapide. Mais même comme ça… on fatigue vite. Les paupières se font lourdes et la somnolence vous envahit… Très peu d’action dans cette chienlit de toute façon… surtout des bavardages de types constipés qui attendent de monter sur le trône et/ou de virer celui qui l’occupe déjà.A noter que l’on s’est fendu d’une VF intégrale pour cette grosse bouse… une VF excellente certes mais franchement, c’est de la confiture à un cochon de film de merde ! quel gâchis et quel temps perdu ! car ce film long comme un jour sans pain et à dormir debout est également nul à chier debout !",
      "review_date": "2022-10-12"
    }
  ],
  "num_reviews": 10
}