{
  "title": "The Maltese Falcon",
  "rating": 8.0,
  "release_date": "1941-10-18",
  "summary": "A private detective (Humphrey Bogart) takes on a case that involves him with three eccentric criminals, a gorgeous liar, and their quest for a priceless statuette.",
  "critic_reviews": [
    "The Maltese Falcon is frighteningly good evidence that the British (Alfred Hitchcock, Carol Reed, et al.) have no monopoly on the technique of making mystery films. A remake of Dashiell Hammett's hard-boiled mystery, it is rich raw beef right off the U.S. range.",
    "The strange, dreamlike tension of the film escalates with each new confrontation, each new tailing, each new beating, with Gutman and Cairo shot from a queasy low angle, and the nightmare culminates in a gripping series of closeups on each strained face.",
    "The movie is essentially a series of conversations punctuated by brief, violent interludes. It's all style. It isn't violence or chases, but the way the actors look, move, speak and embody their characters.",
    "The Maltese Falcon is an unassailable triumph of script, casting, direction and editing.",
    "The film that brought the detective movie into the modern world, complete with novel film-noir techniques (shadows, low-angled shots, anti-heroes and duplicitous dames) and assembled one of the most enjoyable casts ever to play off each other.",
    "It's the slickest exercise in cerebration that has hit the screen in many months, and it is also one of the most compelling nervous-laughter provokers yet.",
    "On a number of accounts it is distinguished celluloid entertainment, but it is of great interest to the trade because it reveals, in startling terms, the unheralded talent of topflight scenarist, John Huston, who, in the dual capacity of writer and director of this picture, is now entitled to take his place among the most important creative artists in the industry.",
    "This is one of the best examples of actionful and suspenseful melodramatic story telling in cinematic form. Unfolding a most intriguing and entertaining murder mystery, picture displays outstanding excellence in writing, direction, acting and editing--combining in overall as a prize package of entertainment for widest audience appeal.",
    "A stunning directorial debut from screenwriter John Huston.",
    "Boldly manipulating light and shadow, utilizing drastic camera angles, and introducing Bogart’s Sam Spade, the first-time director’s detective classic defines film noir.",
    "The Maltese Falcon might not have been the first film noir, or even the most stylish, but all the genre elements are smartly in place here: the dark streets, the treacherous female, the monogrammed office door, the breathless smart talk. Bogart saying \"When you're slapped you'll take it and like it\" should feel like a cliché, but the freshness remains, the thrilling sense that nobody had ever talked like this in a movie before.",
    "The Maltese Falcon is the first crime melodrama with finish, speed and bang to come along in what seems ages, and since its pattern is one of the best things Hollywood does, we have been missing it.",
    "What makes it a prototype film noir is the vein of unease missing from the two earlier versions of Hammett's novel. Filmed almost entirely in interiors, it presents a claustrophobic world animated by betrayal, perversion and pain, never - even at its most irresistibly funny, as when Cook listens in outraged disbelief while his fat sugar daddy proposes to sell him down the line - quite losing sight of this central abyss of darkness, ultimately embodied by Mary Astor's sadly duplicitous siren.",
    "With Hammett's dialogue incorporated virtually verbatim into the screenplay, Bogart in top form, and Huston allowed total directorial freedom, watching this first of the films noir is an experience to be embraced.",
    "The Maltese Falcon is really a triumph of casting and wonderfully suggestive character detail; the visual style, with its exaggerated vertical compositions, is striking but not particularly expressive, and its thematics are limited to intimations of absurdism (which, when they exploded in Beat the Devil, turned out to be fairly punk). But who can argue with Bogart's glower or Mary Astor in her ratty fur?"
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Bogart is bluffing with such authenticity, he is deep and cannot be disenchanted; enters a lady with a tricky case.The Maltese Falcon\n\nHuston is, as a storyteller, simply narrating. A lot of directors have come and gone, but none of themBogart is bluffing with such authenticity, he is deep and cannot be disenchanted; enters a lady with a tricky case.The Maltese FalconHuston is, as a storyteller, simply narrating. A lot of directors have come and gone, but none of them was just reading it to you, tucking you in, he whispers the book in his infamous adaptation like it is his, the director's, John Huston. The story, if you are aware of it, has been wielded before too, but it didn't come out this durable and.. well, shiny. The narration is a bit tricky in here, since it is something that would- I wanna say be better if on paper, because it is and it was good- resist if exaggerated.The scenarios, the characters, the entire tone of this film-noir is bound within four walls. It ping-pongs here are there with \"He said. She said\" affair where as an audience you are in a rush to figure out what actually is going on or has been going on in this first act. After which the film reveals all its cards and we relaxed back in our seats, hoping for something \"Bang!\" to go wrong. But it doesn't. This is where the film cheated me the most and left me in awe of it.For if I think about it I never wanted it to go wrong or right or in fact anywhere. Huston's filmmaking is so present in that room where around three to four major characters are sitting around or roaming about that you don't want this day to end. Anticipation is the game then, and the tease, is Huston's key to success. Watch how a simple phone call or a knock on the door pumps up your heartbeat fast, scared, hoping that it wouldn't collapse, \"The stuff that dreams are made of.\" The Maltese Falcon is as good as any historic event, I say claim it history and be done with it.",
      "review_date": "2019-06-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "classic detective movie with complex characters and good actors. Some scenes are outdated, but the story is intelligent.",
      "review_date": "2021-05-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is probably one of the most compelling classics in noir movies. It is a style that even today has passionate and faithful followers, and sometimes reappears in cinema, whether in the form of simple tributes or even in the form of a kindThis is probably one of the most compelling classics in noir movies. It is a style that even today has passionate and faithful followers, and sometimes reappears in cinema, whether in the form of simple tributes or even in the form of a kind of \"neo noir\" that we can see in films like \"Shutter Island\", \"The Black Dahlia\" or \"Mulholland Drive\".The story of this film revolves around a statuette of a falcon, made of gold and precious stones, an ancient artifact that an order of knights - which the film clarifies at the outset to be \"the Knights Templar of Malta\" (I will talk about this later) - offers in the 16th century to Emperor Charles V in exchange for the Mediterranean island of Malta. According to the story of this film, the object was lost and never reaches the hands of the emperor. In this film its the search for the artifact that motivates a crime that is investigated by a detective, alongside the police.The biggest problem I had with this film lies in the historical premises on which the script was built. It may seem petty, but I am a historian and I value a certain historical rigour. That is why the expression \"Knights Templar of Malta\" gives me chills of horror as it mixes and confuses two orders of cavalry that should not be confused. One is the Order of the Temple, or the Knights Templar, which has nothing to do with this film, and the other is the Order of the Hospital, or Order of Malta. The Knights Templar were founded after the conquest of Jerusalem in 1099, at the end of the First Crusade. The order became very rich, acquired land, prestige and power, aroused envy. Persecuted by the French king Philip IV, it was extinguished by Pope Clement V in 1312. The Order of the Knights of St. John, or Knights Hospitallers, was also founded after the conquest of Jerusalem and also enriched but was never extinct and still exists today, with another name: Sovereign and Military Order of Malta. This is due to the fact that, when Jerusalem was lost by the Christians, the knights moved their headquarters to Cyprus, then to the island of Rhodes until, finally, they settled on Malta in 1518. The island, then part of the territories of the Crown of Aragon, was ruled by the Germanic emperor Charles V, who was also the king of Castile, Leon and Aragon (today Spain), as Charles I. Calling Templars to the Hospitallers Knights is, thus, a gross history error, almost like saying that Lincoln founded the United States of America, or that Napoleon I was the last king of France.The film is dominated by the presence of Humphrey Bogart. A great actor from the golden age, he is excellent and I just found it difficult to keep up with him when he accelerated his speech and ran over words, making it difficult to understand what he was saying. I also liked the performance of Gladys George and Mary Astor, which surprises us in the end with an interesting but somewhat obvious twist. In turn, the character of Peter Lorre struck me as a bit of a caricature. The film has a lot of dialogue and it can be a bit boring, especially for those who expect a little action, but I handled it well except for Bogart, as I said.Technically, its a discreet but very competent film, with quality production values. It has excellent cinematography, with impeccable and original shooting angles and camera work. Its relatively high contrast looks good on the screen and makes the film visually pleasing. The light and shadow effects and lighting are truly superb. The sets are routine but elegant, the costumes are excellent with all the raincoats and fedora hats we could wish for. Of course, cigarettes and alcohol couldn't be missing, and I don't see any problem with that.",
      "review_date": "2020-08-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Stuff is dreams are made of...Movie that's defines film-noir. All of it's there: cynical detective, femme fatale, light/dark contrast. And also one of the most regonizeble MacGuffin in movie history. Humphrey Bogart is amazing, the manThe Stuff is dreams are made of...Movie that's defines film-noir. All of it's there: cynical detective, femme fatale, light/dark contrast. And also one of the most regonizeble MacGuffin in movie history. Humphrey Bogart is amazing, the man that oozing with his charisma through the screen. Bogart and Huston just simply created a character that is all noir.I have to be honest, i didn't like it at first time, but giving it a thought it was really something... With my \"not liking it at the first time\" conflicting with my love for cinema i'm giving this picture only 7, even though deeply inside i know it deserves more...",
      "review_date": "2018-04-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Shout out to short king Humphrey Bogart, this man was at least 6\" shorter than I figured he was. Enjoyed this well enough on his performance alone.",
      "review_date": "2022-07-18",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 20,
  "genres": [
    "Mystery",
    "Film-Noir"
  ]
}