{
  "title": "Alvin and the Chipmunks: The Squeakquel",
  "rating": 4.6,
  "release_date": "2009-12-23",
  "summary": "Before you could say, \"Alvinnnnn!!!\" talks began about a new Alvin and the Chipmunks movie. Not content to rest on their laurels, the 'Munks are preparing yet another \"first\": There have been many great movie sequels. There have even been prequels. Now, get ready for the world's first Squeakquel, in which Alvin, Simon and Theodore finallyBefore you could say, \"Alvinnnnn!!!\" talks began about a new Alvin and the Chipmunks movie. Not content to rest on their laurels, the 'Munks are preparing yet another \"first\": There have been many great movie sequels. There have even been prequels. Now, get ready for the world's first Squeakquel, in which Alvin, Simon and Theodore finally meet their match - and maybe more - in the newly arrived female trio, The Chipettes. (20th Century Fox)\r… Expand",
  "critic_reviews": [
    "A frenetic but undeniably funny follow-up that offers twice the number of singing-and-dancing rodents in another seamless blend of CGI and live-action elements.",
    "Perhaps not since \"The Godfather: Part II\" have we seen a sequel come along that more than matches the mastery of the film that came before it -- all the pathos, the brio, the epic sweep. . . . the cheese balls.",
    "The excellent animation makes up for a so-so plot, but it really doesn't matter. \"The Squeakquel\" is for kids.",
    "It seems as if no professional actors were hired in the making of this motion picture.",
    "Closing out a pretty great year for children's movies—Betty Thomas's dutiful animated and live-action sequel to 2007's \"Alvin and the Chipmunks\" brings up the rear with capable mediocrity.",
    "Smarter than its predecessor, the movie aims for the \"High School Musical\" market.",
    "As shrill, partly-animated musicals about singing vermin go, Alvin and the Chipmunks: The Squeakquel really isn't all that bad.",
    "The whole thing is rather insipid. But Thomas makes it smoother and more palatable than it deserves to be.",
    "Among cutesy pop musical trios aimed at nondiscerning audiences, I'll take Alvin and Co. over the Jonas Brothers any day.",
    "Call it a Christmas miracle, albeit a minor one: Alvin and the Chipmunks: The Squeakquel isn't entirely awful.",
    "The earlier “Alvin” movie made more than $217 million just in the United States. It’s hard to imagine this somewhat confused sequel doing as well.",
    "If only for the sake of adults, couldn't the folks behind the Alvin films have had the good grace to turn Alvin and the Chipmunks: The Squeakquel into a musical?",
    "Sure enough, director Betty Thomas delivers pretty much the bare minimum: peppy, brightly colored, tune-filled nonsense sure to meet the low, low standards of its pre-kindergarten core audience.",
    "Alvin does high school rom-com and very poorly at that.",
    "Charmless sequel.",
    "The 6- to 10-year-old audience this movie is aimed at deserved better.",
    "Almost but not quite as obnoxious as its title. Little kids will love it. You’ll need a hazmat suit.",
    "First, and perhaps most important, it should be disclosed that my 4-year-old laughed pretty much nonstop throughout Alvin and the Chipmunks: The Squeakquel. This was his \"Citizen Kane.\"",
    "The Squeakquel might be appreciated by filmgoers aged 10 or younger.",
    "Blending CGI and live action, this “squeakquel” to the witless 2007 kids’ film proves just how dangerous such technology is when placed in the wrong hands."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "I am not a big fan of sequels aren't I? (Look at my profile), but it was funny, great songs added and I think it could have got a better mark than this, preposterous and lanky at that though.",
      "review_date": "2013-07-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not as good as the other 2 chipmunks movies but still great. The storyline was good. It was funny overall. The songs were great. It even had Wii Sports make a cameo. Alvin and the Chipmunks: The Squeakquel is a great movie and you shouldNot as good as the other 2 chipmunks movies but still great. The storyline was good. It was funny overall. The songs were great. It even had Wii Sports make a cameo. Alvin and the Chipmunks: The Squeakquel is a great movie and you should watch it anytime.",
      "review_date": "2015-03-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I have to say I can't quite see what's TOO bad about this movie. Some parts of it may not make sense and contain cheesy jokes, but overall, I just can't imagine myself giving it a three or a four. I mean, not a ten either, but I thought itI have to say I can't quite see what's TOO bad about this movie. Some parts of it may not make sense and contain cheesy jokes, but overall, I just can't imagine myself giving it a three or a four. I mean, not a ten either, but I thought it was pretty good.",
      "review_date": "2010-10-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I do not get the problem with this movie, I found it fun. Man the alvin and the chipmunks movie are great examples of underrated movies, and I hope the bad criticism stops with road chip.",
      "review_date": "2015-12-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "it has been 11 years since the made the bible into the movie. Now at first that sound like a bad idea but this is why i still haven't committed not alive",
      "review_date": "2020-07-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I watched thiz movie with no expectations. I think all of the things that they wanted to show us already appeared in the first movie. So the sequel (which named: The Squeakquel) is only a repetitions on what we saw before. The movie stillI watched thiz movie with no expectations. I think all of the things that they wanted to show us already appeared in the first movie. So the sequel (which named: The Squeakquel) is only a repetitions on what we saw before. The movie still cast by: Jason Lee and David Cross. The Alvin Character is voiced by Justin Long. The former Director Tim Hill (who also directed GARFIELD, 2004) replaced by Betty Thomas. It is very clear, The movie-makers intend to refresh things up by the appearance of new characters, The Chippetes (the girl version of The Chipmunks). Members of The Chippetes are: Brittany (Christina Applegate), Jeanette (Anna Faris), Eleanor (Amy Poehler). We certain knew the trio as creditable Drama-Comediennes. I think in some ways, the movie is less musical than the first one. The Chippetes performance looks like based on the nowadays Hip Hop style. If we looked at the human characters, Zachary Levi who seems to have more proportion than Jason Lee, both of them did not make us stunned by their performance. Their role definitely could be replaced easily by other Casts. In the end, I just said thiz kind of movie definitely just for fun.\r Visit My Blog on JONNY'S MOVEE : http://jonnyfendi.blogspot.com",
      "review_date": "2011-01-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A worthy successor to the last movie, which is good or bad depending on your stance. Other than an over-dependence on the introduction of the Chipettes, there's nothing 'wrong' with this sequel that wasn't equally wrong in the original, butA worthy successor to the last movie, which is good or bad depending on your stance. Other than an over-dependence on the introduction of the Chipettes, there's nothing 'wrong' with this sequel that wasn't equally wrong in the original, but it seems to lack the same heart. If you liked the first one, you'll like this one too, but it comes across as a sequel more than a worthy tribute to the source.",
      "review_date": "2011-04-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Get your earphones or headphones ready as the chipmunks return for another dull movie of theirs as they hit the screen for even more annoying singing!",
      "review_date": "2015-12-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The characters have improved, not the story. The addition of new characters was great, and felt fun to watch. The story is a lot like the first though, and that is not good.",
      "review_date": "2017-05-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I recommend her 100% for the family at my time I was looking forward to it. When I saw her on TV I was expecting more but most of all, the chipettes were beautiful, especially Brittany.",
      "review_date": "2020-11-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My 7 year old son laughed, my 9 year old daughter was bored. and everyone else agreed that it was painful and insulting. Even David Cross couldn't save the experience.",
      "review_date": "2010-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie would be cringe worthy, even for a 5 year old.",
      "review_date": "2010-01-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "everyone knows how stupid singing chipmunks are. If you don't you should die or suiside right away. this movie has no aparent humor, and dance moves that makes this the worst musical ever. I am not even sure if this is a musical. everyone knows how stupid singing chipmunks are. If you don't you should die or suiside right away. this movie has no aparent humor, and dance moves that makes this the worst musical ever. I am not even sure if this is a musical. Probobaly, a ****tty kids comedy that even a 4 year old wont find humorous.",
      "review_date": "2010-01-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "No... Just, no. These types of movies need to die.",
      "review_date": "2010-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wow not worth the time.",
      "review_date": "2009-12-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What a terrible excuse for a cute movie. Absolutely brainless.",
      "review_date": "2009-12-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Anyone over 12 years of age will find this movie boring, childish, repetitive, and stupid.",
      "review_date": "2009-12-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "So Much More Than The 1st One! It Lacks Creativity But Earns In Back In This Movie! :D\rHonestly This Isent A Really Good Or Really Bad Movie... Good... Average...",
      "review_date": "2011-11-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Alvin and the Chipmunks: The Squeakquel\" is a movie so preposterously obvious you won't remember a thing except for the annoying high-pitched voices of the chipmunks after 2 hours.",
      "review_date": "2011-09-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nOne of the best movies of 2009! It was so epic! (Why did Ian have to be half *****, that part disturbed me). Anyway, this is very funny, go buy it before the shelves. I checked the \"spoiler\" box because i said a movie part. Easy to know :P",
      "review_date": "2011-05-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I think the movie was terrific and very kid friendly. Adults will love it too.",
      "review_date": "2009-12-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Well one thing for sure is that its worse than the first movie.",
      "review_date": "2011-01-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My son is 19 months and doesn't like hardly any tv, but he loves both of these movies! Anything to buy me a few min to rest is worth it, he's soooo busy!!!",
      "review_date": "2010-06-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "No modicum of effort has gone into this film and every lazy, predictable attempt at humour only serves to zap the energy audience members will desperately need to get through an hour and a half of, what can only be described as, crass commercialism.",
      "review_date": "2013-03-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "OBNOXIOUS SINGING CHIPMUNKS. If that's not bad enough for you, how about OBNOXIOUS SINGING CHIPMUNKS AND THEIR OBNOXIOUS SINGING GIRLFRIENDS. Coz that's basically what this crap squeakquel is. *shudders*",
      "review_date": "2015-11-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The first one started out watchable but then went downhill but this one goes downhill from the beginning, it adds THREE EXTRA OBNOXIOUS HIGH PITCHED VOICES to the mix and essentially just copies the story from the first. I think my iq izThe first one started out watchable but then went downhill but this one goes downhill from the beginning, it adds THREE EXTRA OBNOXIOUS HIGH PITCHED VOICES to the mix and essentially just copies the story from the first. I think my iq iz lowering thiss moovie makes you stoopid dont wach it duuuuh... Save you-self...",
      "review_date": "2015-09-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Much lower than the first, Which Was the movie Where the whole family enjoyed the film and laughed Became only for children under 5 years.The squirrels that would be the novelty and promise become boring. Movie predictable.",
      "review_date": "2010-08-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A boring, irritating cash grab that challenges your sanity for 1 1/2 hours. An atrocity to film making, its among the worst films I've had to suffer through. The fact that this made well over $400m at the box office makes me question how muchA boring, irritating cash grab that challenges your sanity for 1 1/2 hours. An atrocity to film making, its among the worst films I've had to suffer through. The fact that this made well over $400m at the box office makes me question how much more greedy Hollywood can be. The abysmal \"humor\" throughout the whole movie gets stale immediately and it's filled with writing that was quite possibly made by a 5 year old. A complete waste of your time, don't go near this abomination.",
      "review_date": "2015-03-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very cute for kids. Our granddaughters ages 3 and 7 loved it.",
      "review_date": "2010-01-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A perfectly acceptable kids film. My little boy loves the first film and the Squeakquel was just as well received. I wouldn't watch this film on my own, with out the company of my son, Alvin and his pals are best enjoyed with a younger A perfectly acceptable kids film. My little boy loves the first film and the Squeakquel was just as well received. I wouldn't watch this film on my own, with out the company of my son, Alvin and his pals are best enjoyed with a younger audience in tow.",
      "review_date": "2010-01-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A great movie to take your kids to but adults may like it, some in-the-middle, and some may not.",
      "review_date": "2010-02-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not much to say about the movie, I just can't believe Chad S. brought up \"Howard the Duck\", now THAT was a weird ass movie. What seems strange to me is that I think both Alvin and Howard were supposed to be directed towards a similar Not much to say about the movie, I just can't believe Chad S. brought up \"Howard the Duck\", now THAT was a weird ass movie. What seems strange to me is that I think both Alvin and Howard were supposed to be directed towards a similar demographic, yet I'd say Howard was a FAR more mature film (or perhaps just violent and controversial) despite it being almost twenty years older. One has to wonder.",
      "review_date": "2010-01-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What a change from Scaring the pants off most of the movies to Laughing all the time.",
      "review_date": "2010-02-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Same as before, families will enjoy the world's first Squeakquel.",
      "review_date": "2010-04-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Hey good movie ad has the capacity to hold your bredth for the whole duration. and to cater the audience from 3 to 63 its worth that.",
      "review_date": "2009-12-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Having not seen the first one, I was worried that maybe I wouldn't be able to understand the 'squeakquel' but I caught on within the first few minutes as the plot doesn't really carry on, or so I'm told anyway. Having not seen the first one, I was worried that maybe I wouldn't be able to understand the 'squeakquel' but I caught on within the first few minutes as the plot doesn't really carry on, or so I'm told anyway. Generally, the film is aimed at children, but the film also has been tailored so that it is enjoyable for parents too. Overall a good film with a great, but sometimes predictable storyline. 7/10 from me.",
      "review_date": "2009-12-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was a very entertaining film and worth 90 minutes and $7. The so-called professional reviewers need to lighten up. This is a movie about talking chipmunks. If you are entertained, that is all you can expect. We had ages 3, 7, 10, 29, This was a very entertaining film and worth 90 minutes and $7. The so-called professional reviewers need to lighten up. This is a movie about talking chipmunks. If you are entertained, that is all you can expect. We had ages 3, 7, 10, 29, 35, 39, 61, 62 in attendance. Everyone was entertained and thought it was a good movie.",
      "review_date": "2009-12-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Filled with a few laughs here and there. They some what \"kill off\" Jason Lee's character due to him making very little appearance in the film. He recovers in the hospital while the Chipmunks are to stay with their aunt and attend school. ThisFilled with a few laughs here and there. They some what \"kill off\" Jason Lee's character due to him making very little appearance in the film. He recovers in the hospital while the Chipmunks are to stay with their aunt and attend school. This seems more like an excuse to send the Chipmunks back home and introduce a new character. Toby who takes the place of Dave ( Jason Lee) as he \"tries\" to take care of the chipmunks. He is filled with poor dialog and serves no real purpose to the story. It was a very poor mistake to use Toby rather than Dave. I would have expected a move like this if it was straight to dvd or Jason Lee not wanting to play the role anymore. One of the biggest issues people may find with this title is copy and paste. The Chipettes find Ian who repeats his actions to them as he did to the Chipmunks in the first movie. Principal Dr. Ruben requests the Chipmunks to help with a music contest to help save the music program. This Squeakquel felt like there should have been more to the entire movie. The overall plot is lacking and the music selection was okay. The only redeeming thing about the entire movie is the Chipettes. They should have been introduced in the 3rd movie while making this one about something else.",
      "review_date": "2011-11-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is way better than the Chipwrecked sequel and it is the best of the whole series. But there are scenes that are too annoying and there are scenes that are good. The high-pitched voices of the chipmunks sometimes disturbs me and sometimesThis is way better than the Chipwrecked sequel and it is the best of the whole series. But there are scenes that are too annoying and there are scenes that are good. The high-pitched voices of the chipmunks sometimes disturbs me and sometimes impresses me. But overall, it is an average movie for adults and a great one for children.....",
      "review_date": "2012-05-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Alvin and the Chipmunks: The Squeakquel may lack some of the surprise that the original had, but it is still kid friendly. It may be a hit or miss for most adults though.",
      "review_date": "2011-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A sequel that has nothing to do with his former party. Pesima but good to hang out.",
      "review_date": "2013-02-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Children will love it of course, but I didn't like it that much. Compared to the first one it feels cheap and that it could have been better. But then again not everything lives up to it's potential.",
      "review_date": "2014-01-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I found myself bored. The movie is just like the first but more stupid and less fun. The reason it even got a 1 is because Theodore is amazing. The rest of the characters are just pathetic and so are the events following the stupid characters.",
      "review_date": "2013-01-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I may have been more optimistic on the first film, but the second is just downright outrageously old. With its cliche roles of the smarts, handsome looks, and the charmer; the characters in \"Alvin and the Chipmunks: The Squeakquel\" areI may have been more optimistic on the first film, but the second is just downright outrageously old. With its cliche roles of the smarts, handsome looks, and the charmer; the characters in \"Alvin and the Chipmunks: The Squeakquel\" are downright old and boring, and even worse as they add three more talking chipmunks with similar personalities as well. If David Cross' character wasn't horrible in the first, his role in the second is very dull and boring as well, with his already cliche character before turning horribly annoying. The plot of the story is obviously kid-friendly, as it takes on the role of high school that hundreds of films have already taken, and is nothing new. Although most kids will enjoy this film, to me, it was a bit to overdone with its annoying and boring plot and character elements, and its tired singing musical with the chipmunk voices.",
      "review_date": "2013-07-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I don't even think my little cousins would like it. I was a kid myself when I watched it, and I thought nothing of it. Now, re-watching it, it's probably the worst live action movie. Not one joke really made me laugh.",
      "review_date": "2014-07-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Talk about ending the year off with a whimper. After my review of \"Avatar\" spoke very positively of the James Cameron film, the last film that I'm reviewing from 2009 is \"Alvin and the Chipmunks: The Squeakquel,\" the easily inferior sequel toTalk about ending the year off with a whimper. After my review of \"Avatar\" spoke very positively of the James Cameron film, the last film that I'm reviewing from 2009 is \"Alvin and the Chipmunks: The Squeakquel,\" the easily inferior sequel to the surprisingly decent 2007 film. While the first film had a few charming and entertaining moments, \"The Squeakquel\" loses those moments, and overall, it's boring, much less fun, less humorous, and the soundtrack is definitely worse here. While it's perfect for the kids (minus one really weird, out-of-place pole-dancing joke), it's overall a poor sequel that I can't really recommend. There are plenty of better family options for the holidays than this film.On a side note that has no impact on the score, you know what's crazy? This film managed to outgross pretty much any-and-all holiday family films released in 2009. \"A Christmas Carol,\" \"Fantastic Mr. Fox,\" \"The Princess and the Frog,\" you name it, this film passed ALL of them. And fun fact: when I went to see \"Avatar,\" for some reason, the people at the theater gave us tickets to this film (which we had already seen, by the way) and, in our desperate attempt to find the theater that was showing \"Avatar\" (which luckily, we found), we walked into 3-4 screenings of this film. How it got that big, I will never know, but regardless, \"The Squeakquel\" is an underwhelming experience at the movies, and you should take your child to something more competent.",
      "review_date": "2016-11-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Really a very tasteless movie. I don't want to waste my time with another brainless movie like this. Really stupid argument even for a 5 years kid!!  And they want to make another!!! Noooooooo!",
      "review_date": "2014-01-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Alvin pulled a sequel, and Alvin, Simon and Theodore have company of Ardites , lol that funny idea of ​​a sequel to Alvin and the Chipmunks , but otherwise was the best movie of one of the most disastrous film of the family sagas.",
      "review_date": "2015-12-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Just when I thought I might enjoy it, it just brings a slap to the face as you are giving the same movie over again. Juat keep it for the kids so that the adults can stay in another room.",
      "review_date": "2016-03-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Alvin and the chipmunks: The Squeakquel is not as funny as the original and and it shows simple a characters with boring story-telling and very down-beat plot. Fans will be disappointed with this very low result, with good-enough music and aAlvin and the chipmunks: The Squeakquel is not as funny as the original and and it shows simple a characters with boring story-telling and very down-beat plot. Fans will be disappointed with this very low result, with good-enough music and a bad premise.",
      "review_date": "2016-03-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Just as bad as the previous film. Again they don't try to make it anything more than something you can avoid fall asleep to while babysitting a 4 year old.",
      "review_date": "2017-12-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Throwing in 12 subplots and rushing them all with poor ass writing doesn't make a good movie.",
      "review_date": "2017-10-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was tolerable but a big let down from the first one.  It just wasn't as funny.",
      "review_date": "2018-11-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A lazy story with lazy turns is more than apt for this cash grab of a skqueakquel",
      "review_date": "2020-10-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The modern music chosen was cool to hear in the movie, but it was your standard sequel, complete with peer pressure, slap stick, dumb teenagers a moral to stay true to yourself and to work together. I guess that for a child it would be a The modern music chosen was cool to hear in the movie, but it was your standard sequel, complete with peer pressure, slap stick, dumb teenagers a moral to stay true to yourself and to work together. I guess that for a child it would be a cute movie but JUST as a movie regardless of age group it is not particularly intelligent or creative.",
      "review_date": "2010-02-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A good movie to take the kids to. As an adult movie not so good, I found it to be boring. I almost fell asleep a couple of times. Maybe I was to tired to go to this movie that night.",
      "review_date": "2010-01-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Poorly written dialogue. Nothing special. the chipmunk voices actually go from cute to annoying.",
      "review_date": "2010-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie definitely needs work but is a sure contender against the first one.",
      "review_date": "2010-02-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Better than first surprisingly excellent.",
      "review_date": "2009-12-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Here's a novel idea: since the 3D animated chipmunks inhabit the real world, why not go the distance and outfit the singing vermin with a story where real world rules apply? Alvin, Simon, and Theodore attend a normal public high school, Here's a novel idea: since the 3D animated chipmunks inhabit the real world, why not go the distance and outfit the singing vermin with a story where real world rules apply? Alvin, Simon, and Theodore attend a normal public high school, in which they find themselves in situations that seem written for \"normal\" chipmunks, not superstar ones. Asked by the principal to save the music department, Alvin and his furry bros have to win a high school talent contest, and for some strange reason, this directive is important to them. Aren't they supposed to be an established singing group? (It also begs another question: Wouldn't a professional act be disqualified from an amateur contest?) It's not that they're humble: the writers give these chipmunks amnesia, especially Simon. The jocks pick on the bespectacled chipmunk because he's a nerd, but this is a nerd who's been on tour, and yet the worldly chipmunk gets tricked into being the \"litter monitor\". Not far behind in the poorly written department is Alvin; he goes out for football as part of his aspiration to be one of the cool kids. Why bother? He's a star; he has millions of adoring fans; he inspired a middle-aged woman to get a tattoo bearing his band's namesake. If the chipmunks were spoiled rock stars, then, perhaps, their stint as high school students, as a preventive measure against megalomania, would make the film's narrative seem less of a series of arbitrary choices. To make matters worse, there's The Chippettes(and the \"Dreamgirls\" subplot) to contend with. Couldn't \"Alvin and the Chipmunks: The Squeakquel\" just go the \"Howard the Duck\" route and have one of the chipmunks fall for a human girl?",
      "review_date": "2009-12-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "To much slapstick and not enough humor.",
      "review_date": "2009-12-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI liked it but it lacked a scene where each one of the chipettes make themselves known with the squirrels I miss jeanette and simon. the no-kiss scene between alvin and brit almost got a heart attack like saying oh my love in this movie for children when it was just a push with the tray you disappointed. the good ending already knew what was going to happen.",
      "review_date": "2020-11-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "entertaining funny in some moments and nostalgic the chipettes are beautiful brittany's personality came out very well DOES NOT BITE OR CRITICAL KICK if I am not fair the version of the 80s and the one in the series is balanced but for me itentertaining funny in some moments and nostalgic the chipettes are beautiful brittany's personality came out very well DOES NOT BITE OR CRITICAL KICK if I am not fair the version of the 80s and the one in the series is balanced but for me it seems like a bipolar I like the more the hairy.and I hope they don't touch her in the fifth movie oh in a soon spin of.",
      "review_date": "2020-11-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The female chipmunks are evil. They haunt my drams and plague my day. Please save me from these demons.",
      "review_date": "2022-07-21",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 86,
  "genres": [
    "Fantasy",
    "Comedy",
    "Romance",
    "Music",
    "Animation",
    "Family"
  ]
}