{
    "title": "Dragonball Evolution",
    "rating": 2.3,
    "release_date": "2009-04-10",
    "genre": [
        "Action",
        "Adventure",
        "Sci-Fi",
        "Thriller",
        "Fantasy"
    ],
    "summary": "Heroic Goku is a powerful warrior who protects the Earth from an endless stream of rogues bent on dominating the Universe and controlling the mystical objects, the Dragonball. As the Master Roshi guides Goku on the young man's epic quest to save the Earth from the forces of darknes, he encounters Bulma, a beautiful woman intent onHeroic Goku is a powerful warrior who protects the Earth from an endless stream of rogues bent on dominating the Universe and controlling the mystical objects, the Dragonball. As the Master Roshi guides Goku on the young man's epic quest to save the Earth from the forces of darknes, he encounters Bulma, a beautiful woman intent on retrieving the mystical Dragonballs for her own reasons and Chi Chi, a young martial artist who captures Goku's eye. (20th Century Fox)… Expand",
    "critic_reviews": [
        "May or may not appeal to fans of the Japanese fantasy franchise it is based on, but aficionados of apocalyptic teenybopper kung fu extravaganzas are in for a real treat.",
        "Far more entertaining than it deserves to be, unless you're a 10-year-old boy, in which case it's only the greatest movie ever made.",
        "A popular Japanese manga series gets a pleasing if paint-by-numbers live-action makeover in Dragonball Evolution, which half-heartedly tries to keep the faith for its pubescent male fanbase.",
        "Marvel at the fact that something this trippy made it to our local multiplex.",
        "Nearly all the actors seem to be having a good time, and the action moves so fast that you don't mind when something nuts happens.",
        "The film is crammed with treats for old-school \"Dragonball\" fans, from the inclusion of all these characters (who don't actually do much) to the moment when spiky-haired Goku dons his orange gi. For everyone else, this amounts to another seen-it-before, probably-willing-to-see-it-again distraction.",
        "Director James Wong (\"Final Destination\") and writer Ben Ramsey are utterly blasé in their approach to the series' mythology and structure, cobbling together an 84-minute movie that seems to exist only to rile up fanboys. On that count -- and that count alone -- Dragonball Evolution triumphs.",
        "Bottom line: costumed Goku and Chi Chi cosplayers may argue the finer points of this adaptation, but it is fairly dazzling it its own overextended, futurist-teenpulp fashion, and Chow makes a vastly more entertaining Roshi than he did a King.",
        "Just know there's a whole lot more great stuff out there than just what Evolution has in store for you -- namely, the anime that it was based on.",
        "Completely lacking in visual, narrative or stylistic coherence, the film also suffers from cheap-looking visual effects and poorly staged and edited action sequences that will not exactly please the fanboys."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "The film is mediocre at best. It's an alright action movie but it doesn't resemble the franchise AT ALL. They messed up one of the greatest anime franchises ever. The only things that I can relate to the franchise were the names The film is mediocre at best. It's an alright action movie but it doesn't resemble the franchise AT ALL. They messed up one of the greatest anime franchises ever. The only things that I can relate to the franchise were the names and the dragon balls themselves otherwise the whole story was completely wrong. What ever happened to Goku being a happy cheery kid flying and a yellow cloud? What ever happened to Goku killing Gohan by mistake (not Piccolo killing him)? Whatever happened to Roshi being a perverted funny old man? Whatever happened to Yamcha actually not being totally obsolete? What happened to Krillin? And the list goes on... So overall unless you know barely anything about the franchise, don't bother watching this shamble of a movie.",
            "review_date": "2009-04-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I don't think this film could appeal to anyone. It destroys the story (and general greatness) of the manga and anime series (Goku as a high-schooler who is too nervous to talk to girls, why?) too much to even be viewed as funny bad for fansI don't think this film could appeal to anyone. It destroys the story (and general greatness) of the manga and anime series (Goku as a high-schooler who is too nervous to talk to girls, why?) too much to even be viewed as funny bad for fans of dragonball. It's too bad for kids, seriously, my younger brother, who is the target age for the film didn't like it. It will annoy anybody who even tries to watch it. I Can't fathom what brought the creators to get the license for a much-loved franchise and to completely kill anything that was good about it in a terrible film. Dragonball could make a good film, but this is most definitely NOT it. Why, just why?",
            "review_date": "2011-12-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Man this film is bad. of what I've heard, it's not really true to the manga and anime at all (it doesn't seem it anyway). It's an awful film. the best things i can think of are that it has kind of okay special effects and a couple of momentsMan this film is bad. of what I've heard, it's not really true to the manga and anime at all (it doesn't seem it anyway). It's an awful film. the best things i can think of are that it has kind of okay special effects and a couple of moments are more like 5/10. It has awful acting, rubbish action, the actors don't look anything like the characters the portray, pointless and terrible plot twists, and extremely cheesy moments! this film is a melted cheese sandwich in cheesy bread (the cheese that it's got in it really doesn't taste nice at all).",
            "review_date": "2012-03-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "i like watching the cartoons...BUT this movie SUCKED soooooo bad..you guys need to put more things too it..like the cartoons..you disappointed me AND the faNs of DBZ..YOU BETTER STEP IT UP..And make the next DBZ movie BETTER.",
            "review_date": "2009-06-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I do not approve of this... just because you have the license and are able to use the character's names and likeness, doesn't mean you can label this Dragonball! My baby brother could come up with a better adaptation!",
            "review_date": "2009-04-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the worst movies I've ever seen. If you like the cartoon, the comic or things that are good, stay away.",
            "review_date": "2009-04-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I know my review is late but I just have to say how much I hate this movie. I'm a huge fan of the series and I've never seen such disrespect for core material. It's like the writer looked on a box cover and wrote an entire movie on that. TheI know my review is late but I just have to say how much I hate this movie. I'm a huge fan of the series and I've never seen such disrespect for core material. It's like the writer looked on a box cover and wrote an entire movie on that. The director must have known even less about the series and just shot the scenes by ear. As for the good, Goku has a nice fight scene outside a party. That's it. The rest is just an hour and 30 minutes of trash.",
            "review_date": "2011-01-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I can't even understand why the director and producers ever thought it would work, this one is absolutely horrible. Like many other popular comic books and cartoons, the story of Dragon Ball could have been made into a good movie, although itI can't even understand why the director and producers ever thought it would work, this one is absolutely horrible. Like many other popular comic books and cartoons, the story of Dragon Ball could have been made into a good movie, although it is childish, violent, weird, and never taking itself too seriously; and that's exactly why it is so hard to adapt it into the big screen. It is a work that should have been made by a director who is good enough to appreciate what the original has to offer, someone who would know how to adapt this kind of weird genre into a live-action film (a good result for a movie who did it right â",
            "review_date": "2011-02-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If they ever make a One Piece or any other live-action film based off an anime, hands off I will smack every producer that ever thought that was a good idea. This movie isn't worth the trouble of paying for.",
            "review_date": "2013-09-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "My God what is thing thing,a terrible movie based on on of the best anime ever.They destroyed everyone's childhood with this bad Hollywood film that has no good part whatsoever.The acting is even worse than the story line.Why why did thisMy God what is thing thing,a terrible movie based on on of the best anime ever.They destroyed everyone's childhood with this bad Hollywood film that has no good part whatsoever.The acting is even worse than the story line.Why why did this terrible director do this to us,why? And to think that is has a score of 45 at Metacritic.OMG.Who could like this film,just who ? Justin Chatwin must stop acting because his portrayal of Goku is by far one of the worst performance ever given in the history of movie making.\rWhat is this story about ? Is based nothing upon the original anime,it's like they just found some kid with terrible imagination and wrote a story line that sucks ass and makes no sense what so ever.Even the Visual Effects are garbage.Still can't believe that there are actual people who enjoyed this movie but I guess everybody has it's own opinion.",
            "review_date": "2015-06-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Didn't do any justice to the O.G Dragonball. 75% of this movie was purely a bad interpretation of one of the most epic anime series. The other 25% isn't even worth mentioning, I just saw it today, and as a die hard dragonball and Didn't do any justice to the O.G Dragonball. 75% of this movie was purely a bad interpretation of one of the most epic anime series. The other 25% isn't even worth mentioning, I just saw it today, and as a die hard dragonball and dragonball z fan, didn't know whether to laugh or to cry at this feeble attempt to recreate this masterpiece. No Krillin, no Oolong, No Tien, No Mercenary Tao, No Nimbus Cloud, No Super Dragon Fist and No Power Pole Extending. I understand that due to the limitation on money and time they must leave out a lot of side story, but they left out a lot of keys that would have made this movie more reminiscent and attractive to old school fans like me.",
            "review_date": "2009-04-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie should not have dragonball in the title. it is in no way related to the series other then the names of the characters. The myth changed, it's in modern day, the ape form is about eight feet tall, no tail on goku, the This movie should not have dragonball in the title. it is in no way related to the series other then the names of the characters. The myth changed, it's in modern day, the ape form is about eight feet tall, no tail on goku, the kamahamaha is sad, and goku is white. If someone doesn't know about the dbz series then the movie can rate about a five, but by using the dragondall name in it's title it's a complete failure. Worse of all, i was so looking foward to a live dbz movie for the longest time, even if i didn't have high expectations it still would suck. (if they ever make a zelda movie this bad then i would quit movies all together).",
            "review_date": "2009-04-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "ive seen every episode of DBZ and just about every episode of DB . i knew from past experiances this film was most likely gonna suck but i tried to keep a open mind thinking there will be some cool redeaming factors atleast that will maybeive seen every episode of DBZ and just about every episode of DB . i knew from past experiances this film was most likely gonna suck but i tried to keep a open mind thinking there will be some cool redeaming factors atleast that will maybe make it ok. well wow i suprised how this movie got pretty much every thing wrong . the only thing that resembles the DB anime is the names of the charicters and thats it. every thing els is eather wrong or badly badle very badly done. piccalo and guko use to be teamed up ... WTF!!! the action is lame and the special effects look like a B movie or some thing off of the power rangers tv show. one of the worst takes ive ever seen on any thing be it game , comic , cartoon , or anime. if your are a DBZ fan dont ever ever ever see this film.",
            "review_date": "2011-01-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I was one of the lucky ones that only saw one ad of the movie, but didn't have time to go to theaters to watch it. However, there was no escape when it was played as one of those movies they show on international airplane flights.\r I willI was one of the lucky ones that only saw one ad of the movie, but didn't have time to go to theaters to watch it. However, there was no escape when it was played as one of those movies they show on international airplane flights.\r I will tell this right now: This movie is not only the worst adaptation of all time, but it's also one of the worst movies I have ever seen in my life. The plot is a hacking piece of horsecrap. Nothing but stolen cliches, plotholes, and few characters (not to mention that these characters don't even try to be adapted from the original sorce, neither appearance or personality). But the action makes up for it, right? WRONG! The fighting scenes are boring and choreographed, and the \"energy\" effects are nothing more than re-colored wind-effects. They even call it \"airbending\" in order to cover their own incompetence. The acting is also terrible. I would elaborate, but merely writing this review is throwing me into a torrent of rage and hate. To think that something of THIS terrible quality can be released in THIS day and age is a complete insult to humanity, and only proves that 20th Century Fox only dwelves into making money by rehashing icons of previous generations. **** you, Hollywood. Just **** you. The only reason it even has a single point is because it actually accomplishes BEING A MOVIE! Of course, a half-point would definetely be more accurate.",
            "review_date": "2011-04-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Dragon Ball is an epic saga of a kid named Goku, who travels the world to find 7 mystical balls of power to stop them from falling in to the hands of evil. In his travels he constantly overcomes his own limits to defeat any opponent in hisDragon Ball is an epic saga of a kid named Goku, who travels the world to find 7 mystical balls of power to stop them from falling in to the hands of evil. In his travels he constantly overcomes his own limits to defeat any opponent in his way, protect his friends and become the greatest fighter in the world. It was a great anime that had many memorable characters and some of the most impressive action sequences on television. Dragonball Evolution on the other hand is an hour and a half of disappointment, watching as franchise that has such an enormous fan-base be ruined, losing all the charm that made the anime it was based on great to begin with.\r Obviously it's understandable for a film adaptation to make changes from the source material, but there is so little here that even resembles the anime that it's based on. It does keep the basic story the same. Goku and his friends are still trying to collect the dragon balls to prevent them from falling in to the hands of the likes of the evil Lord Piccolo. They also try to incorporate various other mythos from the show like the Kamehameha wave, but they fail at doing it well. All of the explanations of the universe and Goku's powers are rushed over so quickly that people new to the series will be lost and loyalists of the franchise will be annoyed at how poorly these mythos are incorporated in the film.\r Also whilst the characters share the same names as their anime counterparts, this is about as far as their similarities go. Goku's personality is changed from being a light minded fool who cares about only doing good and being the best fighter he can be, to being a typical teenage kid who spends most of the film having a crush on Chi Chi. Roshi's nothing more than a generic master who Goku finds. Bulma is just a Lara Croft type character without any of the attitude that made her character enjoyable. The character closest to their anime counterparts ends up being Lord Piccolo, since at the least he looks like the villain that he's based on. Everyone else suffers from worse miscasting than The Last Airbender movie with all the cast having nothing in common with their respective roles.\r It's also a dreadfully made film on a technical level, with director James Wong taking the epic world destroying fights from the original anime and turning them into amateuristic sequences that seem like they were made by a film student. They use a mixture of awful choreography with the fighters moving slowly and fast paced editing where each shot will last no more than a second at a time. Plus for a film with a 45 million dollar budget, the effects really suck. When the 2D cartoon that the film is based on looks more realistic than the effects do, it's pretty obvious that you screwed up.\r This film fails in every way. It won't appeal well to people unfamiliar to Dragon Ball since the characters and story are so generic, whilst being a terribly made mess of a film. And fans are certain to hate it since it fails to recapture anything that made the franchise great to begin with. It doesn't even feel like a real film. It feels like one of those parody trailers you see in something like The Simpsons that spoof how bad Hollywood is at with adaptations got turned into a real film. If you want to enjoy Dragon Ball just stick with the anime.",
            "review_date": "2015-08-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the worst movies Ive watched. The characters arent the same as the manga or anime. The plot blows. The ending was one of the worst their budget must have been what 5 dollars? The special effects were soem of the worst",
            "review_date": "2011-11-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Dragon ball evolution is a 2009 film directed by James Wong and inspired by the manga by Akira Toriyama. Little Lord two thousand years ago, during a solar eclipse, tried to conquer the earth, but a group of monks managed to imprison himDragon ball evolution is a 2009 film directed by James Wong and inspired by the manga by Akira Toriyama. Little Lord two thousand years ago, during a solar eclipse, tried to conquer the earth, but a group of monks managed to imprison him thanks to Mafuuba. Now Piccolo is back and killed Son Gohan and it's up to her grandson Goku defeat and prevent it from Namek to find the Dragon Balls. The film, although it is seen as a film in its own right and not as inspired by the manga, it really bad. If you take it as a film based on the manga there is nothing that seems like the names. The characters were very badly and do not have any characteristics equal to those of the manga (aside from something Son Gohan) as well as the bad, little has been done wrong, especially the trick (there are so many things to list that not resemble the manga as, for example, the fact that Goku goes to high school). If you take it as a film in its own right you can see that the plot is very trivial, obvious and done in a hurry, the characters do not have their own psychology, there are some really embarrassing moments in the film and the special effects are made bad. A film really be avoided, fan or not.",
            "review_date": "2012-11-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "this movie was **** i mean they killed the dragon ball franchises with what nothing showing  this movie had so many plot whole and so many not great actors this whole movie ****  piccolo does not controller the ape nobody could and does itthis movie was **** i mean they killed the dragon ball franchises with what nothing showing  this movie had so many plot whole and so many not great actors this whole movie ****  piccolo does not controller the ape nobody could and does it not require sayian tail  transform into one huge ape.\r i mean this how movie **** up",
            "review_date": "2012-08-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Making a live action dragonball movie was a ridiculous idea to begin with. How the hell could they expect it to be any good? Think of all the great humor, action, emotion, dialog, and rich story that was crammed into every 20 minute episode.Making a live action dragonball movie was a ridiculous idea to begin with. How the hell could they expect it to be any good? Think of all the great humor, action, emotion, dialog, and rich story that was crammed into every 20 minute episode. Think of how difficult, expensive, and time-consuming the show was to create. And that was just animated!\r A decent live-action DB movie would need the original writers and probably take a decade to produce. Not to mention that the amount of capital needed to create it is inconceivable.\r Aside from all that, if someone told me that the people responsible for this movie did an \"okay\" job with the resources they had, I would laugh until I threw up. Everything that made Dragonball the wildly entertaining series that we all loved was excluded from this movie. The characters differed from the originals in every way. The original Goku was a playful, honorable, child-like(yet god-like) , warrior/hero. This Goku is a brown-haired, blue-eyed, scrawny white kid who talks and behaves nothing like the original. The series was filled with diverse characters and a deep storyline. This movie is empty and half-assed. A pathetic imitation.",
            "review_date": "2012-05-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Good lord, if you ant to watch a movie that just pisses all over it's source material, here you go. I remember wanting to watch this when I was younger; better to say when it came out on \"on demand\", I had to ask my mom if I could buy it toGood lord, if you ant to watch a movie that just pisses all over it's source material, here you go. I remember wanting to watch this when I was younger; better to say when it came out on \"on demand\", I had to ask my mom if I could buy it to watch it. I regret that decision to this day. So what do you get with this? No really, what do you honestly get from watching this? Nothing! All this does is make a beloved hero become like any typical kid at high school. Right off the bat your messing things up because Goku doesn't go to school, one of his character traits was that he didn't get an education, and that's why we loved him; one of the many reasons of course. The characters all around don't feel like who they should be; it's been a while since I've seen this, and I prefer to leave it as is. What I do remember is that Piccolo looks really stupid in this, and that's really bad compared to what he is in the show. I know he's an alien here and there, but the way they did it here was so wrong, I don't see martial arts villain, I see a goddamn alien from a bad movie. Finally the ape scene, this was just so pathetic. It might have been better if he was actually the size they were suppose to be, but I doubt that would even save this. PLus, the ending about piccolo still being alive, we know this isn't going anywhere, and to see such a desperate attempt at a sequel is so pitiful. In the end  I still hate this movie; heck back then I had this sense of: this doesn't make sense and I'm not having fun, and this is the big reason why anime should stay anime.",
            "review_date": "2013-06-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Absolutely horrible. The worst film I have ever seen. Outside of the characters names, it doesn't even stay close the the source material. And even when it tries to put it's own spin on something, if fails spectacularly. Stay away from it atAbsolutely horrible. The worst film I have ever seen. Outside of the characters names, it doesn't even stay close the the source material. And even when it tries to put it's own spin on something, if fails spectacularly. Stay away from it at all costs, and if you're a fan of Dragon Ball then burn every single copy you come across.",
            "review_date": "2014-03-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "God, I hate this Movie.\r This \"Film\" is easily my pick for the worst film of all time. By it's own merit alone, it's just a generic, poorly made action film. BUT, the problem is it's source material. Now, I grew up watching the Dragon BallGod, I hate this Movie.\r This \"Film\" is easily my pick for the worst film of all time. By it's own merit alone, it's just a generic, poorly made action film. BUT, the problem is it's source material. Now, I grew up watching the Dragon Ball franchise, and was a big fan of the show, and I still am. However, I do understand it's not perfect. Some of the writing is stilted, the filler episodes tend to drag, and the action takes forever to start. However, the show still has an underlying charm to it that makes it accessible to this day, and still makes it feel timeless, and has lasted almost three generations.\r However, This \"THING\" has nothing of that.\r This movie captures none of the charm, scale, and creativity of the original series. It is a giant spit in the eye to Akira Toriyama and all fans. This is the absolute worst live action remake of anything I've ever seen. The Plot is a paper thin carbon copy of the series, without the sustenance the original offered. The Characters are all either stereotypes of the characters, boring, dull, or even worse, completely misrepresented. The pacing is insipid, even worse then the filler of the series, and goes nowhere. The setting is awful, completely contradicting the point of the world of the series. The Lore is awful, completely ruining core aspects of the Manga and Anime. The effects are laughable. They wouldn't pass for D-Movie Standards in their fakeness.\r But the Absolute worst part is what it does. this movie destroys and makes a mockery of the original series, something held special in both childhood nostalgia, and in generations of people as a beloved show. This Movie completely trashes on the original, and therefore, is a direct insult to anyone who has ever watched it.\r This is my pick for the Worst Movie of All Time",
            "review_date": "2014-07-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ban this movie. No wonder why Akira Toriyama doesn't wan't Hollywood to adapt another DBZ movie. Everything about this movie is terrible, this is truly an insult to entire DBZ universe and it's fans. It looks nothing like a Dragon Ball.",
            "review_date": "2014-05-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "this movie is ranked number 1 on my worst films of all time it really sums up everything i hate in bad movies. terrible adaptions with no respect for the source material, terrible over reliance on special effects over story, and crediblethis movie is ranked number 1 on my worst films of all time it really sums up everything i hate in bad movies. terrible adaptions with no respect for the source material, terrible over reliance on special effects over story, and credible actors who should've taken another look at the script before saying yes\r i hated this film taking one of my all time favourite series and turned it into one of the most terrible and generic martial art films that somehow forgot it was based on a famous manga and anime and instead rips off everything else\r i haven't seen battle of the gods yet but hopefully it will resurrect some respect for the dragonball franchise",
            "review_date": "2014-10-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is just an insult to all Dragonball fans. Horrible acting, Stupid Design choices and WTF Goku goes to school ARE YOU SERIOUS?. Don't watch this pile of crap they **** everything up.",
            "review_date": "2015-06-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Cheap special effects? Check. Horrific character redesigns? Check. PROMETHIUM ORBZ? Check. Emo Goku? F*CKING CHECK! Conclusion? My childhood has been horribly, horribly raped.",
            "review_date": "2009-07-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "God-awful tripe, it barely resembles the original, and has the none of the stylistic coherency or flair. I can't help but feel that the film would have been handled better by Zack Snyder, which would have at least given the film the God-awful tripe, it barely resembles the original, and has the none of the stylistic coherency or flair. I can't help but feel that the film would have been handled better by Zack Snyder, which would have at least given the film the visual quality it deserves.",
            "review_date": "2009-08-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This really, really blew. I knew it would be bad, but this is just ridiculous. It's basically just a crappy highschool AU fanfic with characters slotted in wherever they could fit them. Why is Gohan Goku's grandfather? Did Goku go This really, really blew. I knew it would be bad, but this is just ridiculous. It's basically just a crappy highschool AU fanfic with characters slotted in wherever they could fit them. Why is Gohan Goku's grandfather? Did Goku go back in time and copulate with his great grandmother? Ew. What's with Roshi? Why is it never mentioned that Goku is a saiyan, and why doesn't he go into super saiyan? Is it based on the original Dragonball or Dragonball Z or what? Where's Vegeta? Where's Krillin? If Gohan's in it, why isn't Goten or Trunks? Why does Goku hardly have to charge up Kamehameha at all? Why is he in highschool? WHY IS HE WHITE? The list goes on. Sucks. At least the Kamehameha at the end was epic, but it should've taken way longer to charge. God, I hate this.",
            "review_date": "2009-04-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A terrible movie with no redeeming qualities. I saw this at my local ODEON and was dumbfounded by the pure laziness of the production. My advie is to ignore this movie.",
            "review_date": "2009-04-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "being a huge fan of th DB series, i tried to like the movie, but its just unwatchable. It has nothing good to it, just a lame story mixing karate kid, spider man and a typical lousy kung fu movie. It had no coherence at all...out of nowhere, being a huge fan of th DB series, i tried to like the movie, but its just unwatchable. It has nothing good to it, just a lame story mixing karate kid, spider man and a typical lousy kung fu movie. It had no coherence at all...out of nowhere, Picollo just appears, you dont know how he scaped, or who helped him, he suddenly enters the conflict with a huge airship and a female assistant,.... Where does he get that stuff??? I Think this movie was called \"Evolution\" Because the shrinked size of the Saiyan Ape form (lamely presented in the movie), which was is as big as a regular Gorilla. Other thing that caught my attention was that the power levels should be epic... ...which werent....as how this was presented in this film, even The Hulk is stornger than Goku. I could go on and on of how much i hated this film, but its just doesnt worth it. HUUUUUUUGE disapointment. Its not fair to wait over 15 years to see this crap.",
            "review_date": "2009-04-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie sucks dragon balls. It does not come any close to the anime/manga counterpart of Dragonball Z. You're better off watching the show than this crap.",
            "review_date": "2009-06-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Absolute waste of time.I still can't believe I watched it.It warrants a 0 because there are too many gaps that needed to be filled and the acting was below par.This movie was supposed to be based on the cartoon but there was so many Absolute waste of time.I still can't believe I watched it.It warrants a 0 because there are too many gaps that needed to be filled and the acting was below par.This movie was supposed to be based on the cartoon but there was so many things changed for the worst.The characters excluding Roshi and Bulma were very disappointing.",
            "review_date": "2009-08-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "THIS IS THE WORST MOVIE EVER!!! I am a SERIOUS Dragon Ball and Dragon Ball Z fan and I was so upset while I as watching the movie... Goku, some little wimpy punk at SCHOOL!!? He has NEVER went to school, what were they thinking!? The Oozaru THIS IS THE WORST MOVIE EVER!!! I am a SERIOUS Dragon Ball and Dragon Ball Z fan and I was so upset while I as watching the movie... Goku, some little wimpy punk at SCHOOL!!? He has NEVER went to school, what were they thinking!? The Oozaru looked like it was made out of CLAY and Bulma and Yamcha...WHAT THE HECK!!? They RAPED this entire movie. They gave absolutely no info. about the Saiyans, nor Frieza....Chichi simply asked. \"Where are your parents?\" and Goku stupidly replied. \"I don't know..\" It's terrble, HORRIBLE...\"B\" RATED!!! Not enough quality and WHERE THE HECK IS KRILLIN!!? WHERE IS MY FAVORITE HUMAN CHARACTER!!? Piccolo's Antennae are shoved up in his head like he got into a car wreck..WTF!? Chichi doesn't even act as firery as she does on the Anime, these people RUINED this movie, it was WASTE of time, a WASTE of money and WASTE OF MY ENERGY...Thank you so much for pissing me off!!!! And now they want to make another movie...shesh... Raditz is my ABSOLUTE favorite Dragon ball Z character and I hope...I HOPE like HELL they do not put him in it because if it's as bad as the first, they're going to rape him too. I just wanted you all to know my thoughts about this movie...and I rated it a Zero, I hope you're happy.",
            "review_date": "2009-08-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It gets one point for CGI. Now aside from that, this is a piece of trash nor matter if your a DBZ fan or simply an action movie fan. Acting: awful, and not in the funny way. Story: well, if they stayed with accurate representations of the It gets one point for CGI. Now aside from that, this is a piece of trash nor matter if your a DBZ fan or simply an action movie fan. Acting: awful, and not in the funny way. Story: well, if they stayed with accurate representations of the anime and the characters within it, then they might've had a little something going for them, but they butchered all that and replaced it instead with \"things\". Apparently Bulma duel-wields pistols now (never did in the anime; never really needed to), Goku gets knocked unconscious by normal bullets, Master Roshi is a turtle hermit at all. Piccolo has an unidentified female sidekick who uses guns and can fight for some odd reason, etc. This is a sesspool of a movie. Don't PAY to see this",
            "review_date": "2009-04-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The high point of Dragonball Evolution is the occasional cleavage - and that should tell you enough how good thins thing is: awful. The acting is horrendous. The photography and visual/special effects are something to laugh about. The The high point of Dragonball Evolution is the occasional cleavage - and that should tell you enough how good thins thing is: awful. The acting is horrendous. The photography and visual/special effects are something to laugh about. The plot... well, you should expect something close to a super sentai series from the 80s.",
            "review_date": "2009-04-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This film Is sooooo far away from the source material. Ramsey and Wong took a big dump on the Dragonball franchise by tuning a great novel / anime and turn it into a teeny bopper, cheezy,multy-cliche, ripoff upon another ripoff kind of This film Is sooooo far away from the source material. Ramsey and Wong took a big dump on the Dragonball franchise by tuning a great novel / anime and turn it into a teeny bopper, cheezy,multy-cliche, ripoff upon another ripoff kind of movie. It's TOTAL DISRESPECT to Dragonball. It's evolution in a mutated form. This needs a reboot in a hurry. Don't see it!!!!",
            "review_date": "2009-04-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "For an extremely successful manga series, I am disgusted at the lack of innovation and effort put into this anime adaptation. The one GOOD thing about Dragonball Evolution is that it's a litmus test for Hollywood, who now see how NOT to For an extremely successful manga series, I am disgusted at the lack of innovation and effort put into this anime adaptation. The one GOOD thing about Dragonball Evolution is that it's a litmus test for Hollywood, who now see how NOT to adapt anime. This deserves a reboot, or an everlasting death, whichever one I don't care. Much of the plot was just thrown together without any explanation, no character development, cliche after cliche, cheesy special effects, and pre-teen-esque comedy. The plot deviates from the source material on many occasions. It was an epic failure and I honestly can't pick out anything of value that was good about it. I'm glad I watched it online for free instead of paying money. With the depth of characters and plot from the actual manga/anime, a reboot should justifiably be at least as long as Watchmen. They really rushed this film, it is so terrible. Fans and nonfans alike will generally have a deep hatred for this film, please avoid at all costs. Or see it if you must, but afterwards just make sure to pick up some burning charcoal to take your mind off the pain or a heavy night of drinking to forget you watched it.",
            "review_date": "2009-04-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is awful. If you're a fan of Dragonball series, it is better to stay away from this movie and rather watch the show and its regular, anime movies. This movie Dragonball Evolution sucks actual Dragonballs badly. And one more This movie is awful. If you're a fan of Dragonball series, it is better to stay away from this movie and rather watch the show and its regular, anime movies. This movie Dragonball Evolution sucks actual Dragonballs badly. And one more thing don't see it or better yet ignore it and go see something else because this movie have a terrible storyline that looked like it is written by a 4 year old, horrible acting expect for the women, and worst of all it's a complete piece of dog crap.",
            "review_date": "2009-04-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Honestly, I was less than dissatisfied. I'm a really big fan of the manga and anime and enjoy cosplaying as well. As a fan, I shouldn't have had ANY expectations because I already knew how much Ben Ramsey screwed up the story.As Honestly, I was less than dissatisfied. I'm a really big fan of the manga and anime and enjoy cosplaying as well. As a fan, I shouldn't have had ANY expectations because I already knew how much Ben Ramsey screwed up the story.As well, it's sad Fox was desperate enough for a movie script during the writer's strike, they pulled this one up. I recall reading what was apparently a leaked script, and this movie follows it pretty closely, except James Wong removed the \"trading card game\" from the movie. Yes, the cast were going to play a card game based on what their adventure would be. Don't ask... Aside from the movie being so inaccurate to the series (and the omission of important character while being substituted for useless ones who appear for a mere 1 to 5 minutes max), the editing and acting was sub-par. The movie was WAY too rushed (in my opiion, it should have been the length of Harry Potter.) The acting was at the point my stomach churned. I did chuckle twice during the entire movie. Yes, I counted. The final fight was too short and anti-climatic. The special effects and Shenlong were so-so. In addition, I wasn't impressed at the randomness of the locations, the poorly paced timing of the script, and the \"convience\" of the Fullum Assassins. Everything seemed to easy and cliche. I'm happy I got to see this pile of poo for free. Either a reboot is necessary in a few years by another distributor and production company, or no sequel should be made. Take your pick.",
            "review_date": "2009-04-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Dakota G: If you like this movie, youre NOT a DB Fans. Everything n this movie based on a highschool sh*t, typicall for a american story. Son Goku dont go to school, the only charactor who goes to school is Burma and she can´t even Dakota G: If you like this movie, youre NOT a DB Fans. Everything n this movie based on a highschool sh*t, typicall for a american story. Son Goku dont go to school, the only charactor who goes to school is Burma and she can´t even fight.. but in this movie shes could defend herself and fight almost as good as Son Goku??? And Yamcha.. in this movie he can´t even fight!!! I´m very very big fans of super martial arts Anime.. so this movie made, me to watch Dragonball Anime again to wash away the bad acting and story in this live movie... The only thing that was good with this live movie .. was all the beautiful girls in it....I only watch the movie cause them.",
            "review_date": "2009-05-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I'm a DB fan, I've been for the longest time and like most fans of the show i was expecting something a bit more truthful to the original product. Now i understand that is a big difference between what's acceptable in a I'm a DB fan, I've been for the longest time and like most fans of the show i was expecting something a bit more truthful to the original product. Now i understand that is a big difference between what's acceptable in a cartoon or anime an what's acceptable in a live action movie, things such as having Goku portrait as a small boy might have not gone well with some people, specialy when he is expected to be involved in fight sequences, but if you're not willing to grasp the appeal of the original Goku then don't even try to make a movie about it. I'm not sure who they were trying to please with this movie because it failed in every aspect, it was the complete oposite of what the fans wanted to see, by giving us unecessary changes to the story and simply screwing around with the characters and their personalities, but also anyone who went to see the movie without any preconceived opinion, espectation or knoledge of the original series was completly put off by the plot holes and lack of explanation.",
            "review_date": "2009-07-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It sucked balls. don't watch it. After 30 minutes, you get sleepy. No, maybe 15 minutes. The guys are bad at fighting, the acting sucks, and the story and the lines are cheesy. Not worth the money to buy and watch. Even if you can It sucked balls. don't watch it. After 30 minutes, you get sleepy. No, maybe 15 minutes. The guys are bad at fighting, the acting sucks, and the story and the lines are cheesy. Not worth the money to buy and watch. Even if you can stream it online, it's not worth your time. And of all people, why make it a WHITE guy? seriously!!! and the guns are hecka crappy too. you can tell immediately that they're made out of plastic. and the way the people use their guns, HORRENDOUS! D: seriously. don't watch this movie!",
            "review_date": "2009-08-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Oh my gosh! I was so excited to watch this movie because I am really a dragon ball and drangon ball z fans but I was so disappointed on what they did to this movie. Goku never went to school and chichi what happened to her? She is rich yes Oh my gosh! I was so excited to watch this movie because I am really a dragon ball and drangon ball z fans but I was so disappointed on what they did to this movie. Goku never went to school and chichi what happened to her? She is rich yes but she is also stubborn and always on fire!! Goku started as a young boy not a grown up teen already. I was so disappointed.. they perhaps did not conduct a research for this.. I almost fell asleep when I was watching it in theater. Next time please do a research first... this movie is way far from the original.",
            "review_date": "2009-08-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This Piece of **** was a Complete **** You to The Fans of Dragon Ball. This is the Worst Movie I have ever seen Hands down and it ruined my Childhood.",
            "review_date": "2016-01-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Imagine someone taking your childhood and throwing it on the fire and slowly watch it burn as the movie goes along. I just felt bad watching this movie. How did they thought about this? No beams just hand farts of magic.",
            "review_date": "2014-11-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Worst Adaptation from a beloved Anime or Cartoon or Whatever. DragonBall Evolution is very bad and has some potential to be good film if not the worst films of all time!",
            "review_date": "2014-12-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "complete dumbass James Wong gives one giant finger to Japan, fans of Dragon Ball and anyone who loves cinema. The movie is a cloppy, overlong nonsensical stupid piece of cinema diarrhea. It's poorly done live action knockoff of possible thecomplete dumbass James Wong gives one giant finger to Japan, fans of Dragon Ball and anyone who loves cinema. The movie is a cloppy, overlong nonsensical stupid piece of cinema diarrhea. It's poorly done live action knockoff of possible the greatest anime of all time Dragon Ball Z. A pain from the beginning to the end Dragon Evolution is almost hilarious in it's failure, but it's ripping apart something from my childhood something I still still love today so it can burn in movie hell. it's not evolution it's a big step backwards",
            "review_date": "2015-09-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "i have to say something that nobody said? if this is not the worst movie ever is the worst adaptation. james wong is just a **** he ruined the best anime of all time. siriously, this movie is an insult to akira toriyama, an insult to the fansi have to say something that nobody said? if this is not the worst movie ever is the worst adaptation. james wong is just a **** he ruined the best anime of all time. siriously, this movie is an insult to akira toriyama, an insult to the fans and an insult to dragon ball.\rDON´T WATCH IT PLEASE",
            "review_date": "2016-05-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is the worst adaptation of anything period. The writers, producers and director obviously had no prior knowledge of the original manga and show, as they manage to miss the mark with all the characters and the story. I was a massiveThis is the worst adaptation of anything period. The writers, producers and director obviously had no prior knowledge of the original manga and show, as they manage to miss the mark with all the characters and the story. I was a massive Dragonball fan growing up (still am) and I was extremely excited when this movie came out, but even as a nine year old I knew this movie was terrible and if I was nine and there was a product that had \"Dragonball\" slapped on it, it had to be disgustingly bad for me not to enjoy the **** out of it.",
            "review_date": "2016-11-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is trash!!!!!! How can you give this movie anything higher than a 3 if it didn't follow any of the dragonball source material. Stop lying to the people about how great this piece of **** movie is and tell them the goddamn truth, itThis movie is trash!!!!!! How can you give this movie anything higher than a 3 if it didn't follow any of the dragonball source material. Stop lying to the people about how great this piece of **** movie is and tell them the goddamn truth, it SUCKED ASS!!!!!!!!!!!!!",
            "review_date": "2017-10-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"Dragonball: Evolution\" is a movie not for kids, but for kindergartners. Its a film you definitely want to skip and just watch the anime (the anime's way better than this crap).",
            "review_date": "2011-09-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Loved the cartoon and used to race home to see it on Cartoon Network some 10 years ago, but this is a travesty. It's so dumb and sad to see this movie made this way. Thanks for trying to kill it.",
            "review_date": "2010-10-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I'm not too familiar with the Dragonball series outside of occasionally watching a few episodes when I was a little kid, but HOLY COW this movie is an unwatchable mess. I hated this movie, and the only redeemable quality is that it isI'm not too familiar with the Dragonball series outside of occasionally watching a few episodes when I was a little kid, but HOLY COW this movie is an unwatchable mess. I hated this movie, and the only redeemable quality is that it is mercifully short. Atrocious acting, godawful cgi, infantile script, and absolutely no cohesion on any element of this movie. The only redeemable quality this movie has is that it is mercifully short. I can't imagine how fans of Dragonball must feel.",
            "review_date": "2017-10-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "There's no way to look at it and call it Dragon Ball, it's a big mistake, just a ridiculous, stupid, unnecessary movie.    .",
            "review_date": "2014-01-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "oh where to begin... this movie was so behind any manga to movie transition I ever saw...goku is not in this movie so don't look for him, I did not like the movie It has many issues as a movie standing by itself, I watched this movie withoh where to begin... this movie was so behind any manga to movie transition I ever saw...goku is not in this movie so don't look for him, I did not like the movie It has many issues as a movie standing by itself, I watched this movie with lowered expatiations as per family/friends advice... ... ... it didn't help me my childhood was spent watching the whole db and dbz story lines so I have a vary good idea what a db or dbz movie should be, I read the Shonen jump ad/interview on db evolution, it sounded quite promising, and after watching this movie I felt like that ad cheated me somehow...oh well upon finishing watching the movie I laughed at all the documentary/special behind the scenes cheesy stuff on the dvd, and not cause it is supposed to be funny ether, but because everyone being interviewed thinks this movie rocks, DUDE THIS MOVIE SO DOES NOT!!!, it does not rock, it does not even attempt to convey the characters personality from the original series... ... well okay to be fair piccolo was done okay...but I don't want to see okay in a db/dbz movie, I want to see dbz action, or at the least even db comedy. none of this is in this movie this movie reminds me of son of the mask ,while not as bad in the effects department as that movie, It is still the same let down I felt after watching that movie.\rI was also like thinking... who on earth picked Justin Chatwin he just has vary little acting talent to offer in this role, when he says \"I'm Goku\" you really don't believe him. Goku is supposed to be the savior of earth,pure of heart, he loves to fight, loves to eat...loves to eat a lot, loves to help others if he can etc.\rThis dork in the movie, who brazenly claim is Goku has none of that, now to put this into words that db and dbz fans will understand, imagine Goku and young mischievous [slightly perverted] krillin fused permanently. and he is interested in girls in this movie no lies... which explains why they did not put a nimbus cloud in the movie, or maybe it was Hollywood's excuse not to add a nimbus cloud so they could pocket some of the money on this horrible stinking movie.",
            "review_date": "2014-08-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "In my opinion, this is the absolute worst movie I have ever seen in my life. From Goku shooting out fire farts from his hands and turning into a werewolf (?), to a pointless unmapped plot to the casting of caucasian actors to play AsianIn my opinion, this is the absolute worst movie I have ever seen in my life. From Goku shooting out fire farts from his hands and turning into a werewolf (?), to a pointless unmapped plot to the casting of caucasian actors to play Asian roles, there is absolutely no way to spin this movie into a half decent flick. If I had to choose eye cancer or to watch Dragonball Evolution over again, I'd choose eye cancer every time. Don't waste 85 minutes of your life watching this crap, just stick to the anime.",
            "review_date": "2017-02-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I didn't see many things to critisize besides the obvious wire work and that I expected more action from it, it was pretty good, better than I thought it would be. I'd REALLY like to see more from it if there is a sequel to satisfy I didn't see many things to critisize besides the obvious wire work and that I expected more action from it, it was pretty good, better than I thought it would be. I'd REALLY like to see more from it if there is a sequel to satisfy the fans.",
            "review_date": "2009-04-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "My family and I liked it. It was a pleasant diversion, the hero did not whine and the rest of the characters were likeable. It made sense of the occasional Dragonball Z cartoons I had seen. We liked it well enough to buy the dvd because we My family and I liked it. It was a pleasant diversion, the hero did not whine and the rest of the characters were likeable. It made sense of the occasional Dragonball Z cartoons I had seen. We liked it well enough to buy the dvd because we would enjoy watching it again.",
            "review_date": "2009-04-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I must say... i liked it. not so much because the movie itself was good (in any way), but because it evoked memories of the original dragon ball (and dbz), which i LOVED. 10 for the memories, 0 for the movie... averages out to 10.",
            "review_date": "2009-08-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The best dragonball movie i've ever had the pleasure of watching, truely awesome! The movie was so enjoyable that i've found myself watching it multiple times, something i can't say with most other movies.",
            "review_date": "2015-07-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Its somewhat enjoyable and if you are familiar with any of the dragonball shows, you'll probably feel the nastalgia. Its way better than The Last Airbender.",
            "review_date": "2012-05-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Good, I also though it would be worse. I'm a HUGE fan of the anime, the movie doesn't totally do it justice but it does bring an interesting twist to the story, I hope it will continue through to the final saga!",
            "review_date": "2009-04-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I thought the movie was awesome! I used to watch dragonball all the time when I was a younger kid, and I've always dreamed of it one day coming to life on the big screen. And it turned out better than I thought! I expected more action I thought the movie was awesome! I used to watch dragonball all the time when I was a younger kid, and I've always dreamed of it one day coming to life on the big screen. And it turned out better than I thought! I expected more action and for it to be longer though. But there's always sequels!",
            "review_date": "2009-04-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Seriously, the movie was very cheesy and if you can get past the corny acting and the lack of closeness to the source material it was an overall well done movie. The action scenes were pretty sweet with the slowdowns in some of the fights Seriously, the movie was very cheesy and if you can get past the corny acting and the lack of closeness to the source material it was an overall well done movie. The action scenes were pretty sweet with the slowdowns in some of the fights bringing some good laughs from the crowd. Of course some of the movie sucked like the fact that is was only 90 minutes or so when it should have been at least 2 hours or more to better explain the story. If you haven't seen any of the original DragonBall stuff you will be confused a little bit and it does break from the source material but in some ways it is a good thing. I am going to buy it when it comes out on DVD and Blu-Ray.",
            "review_date": "2009-04-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A great start of a series, but if theres a sequel, don't let James Wong direct, and make it a lot longer.",
            "review_date": "2009-04-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "modern day action movie with some old world mystic, and some Kung-Fu thrown in. The special effects is a must see.",
            "review_date": "2009-05-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I would consider myself a Dragonball Z fan, not a Dragonball fan. For those who don't know better, Dragonball Z is the \"sequel\" to Dragonball. This movie is about the Dragonball storyline (which is where I see a lot of fan comments not I would consider myself a Dragonball Z fan, not a Dragonball fan. For those who don't know better, Dragonball Z is the \"sequel\" to Dragonball. This movie is about the Dragonball storyline (which is where I see a lot of fan comments not being able to connect the dots). Overall, it wasn't bad. They tried very hard (no easy task) to turn the cartoon into a movie and I think they succeeded in preventing what could have been way too over the top stuff being crammed into a film. However, they did so at the cost of skipping way to much explanation and missing out even more on character development. I'm ok with the story changes. Those are expected in a live-action translation. I'm not ok with the poor choreography for the fight sequences and the even cheesier special effects. It's was like every time a cool punch was going to be thrown and see, they instead cut away to terrible angle so they didn't have to animate the special effects or something. In the end, the movie just didn't feel important. It didn't really stink, it was just un-important. And I'm sure many people wanted to feel good about it at the end, instead.",
            "review_date": "2009-07-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It was actually pretty good, and was better than I expected. I like the way they modernized the look of the Dragonball and its characters. But it was just too short, just like this review.",
            "review_date": "2009-04-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I give this movie a perfect ten. And to all those haters out there did you really expect a perfect adaptation? That would be completely unrealistic. This movie brings a sense of realism that really made me love it. I am gladly going to see I give this movie a perfect ten. And to all those haters out there did you really expect a perfect adaptation? That would be completely unrealistic. This movie brings a sense of realism that really made me love it. I am gladly going to see it again and again. Props to Chow and Justin! Great job guys!",
            "review_date": "2009-04-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I was pleasantly surprised that the movie was as god as it was. While there were a few minor details I (as a fan) would have changed; character appearance, characters included; etc. the movie was still worth seeing and greatly exceeded my I was pleasantly surprised that the movie was as god as it was. While there were a few minor details I (as a fan) would have changed; character appearance, characters included; etc. the movie was still worth seeing and greatly exceeded my expectations. I expected a poo fest and received pure gold that kept my adrenaline peeked the whole time.",
            "review_date": "2009-04-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Nowhere near as bad as everyone seems to think it is. It's funny, just like the original series. It relies on adventure, just like the original series. The plot is pretty much identical to the original series, give or take a few things. Nowhere near as bad as everyone seems to think it is. It's funny, just like the original series. It relies on adventure, just like the original series. The plot is pretty much identical to the original series, give or take a few things. There isn't alot of action, just like the original series. So yeah, it's pretty much just like the original Dragonball series. If you go in expecting a Dragonball Z movie, you'll be disappointed, because it's not based on Dragonball Z, it's based on Dragonball. Go in expecting a film that, even with it's many shortcomings, it's shit loads of fun.",
            "review_date": "2009-04-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Entertaning movie but it never gets to the \"wow\" moment. The final fight was a total anti-climax and some aspects of the story were changed for the worse. It was better than i expected it to be but still... i don't feel like watching it Entertaning movie but it never gets to the \"wow\" moment. The final fight was a total anti-climax and some aspects of the story were changed for the worse. It was better than i expected it to be but still... i don't feel like watching it again... ever. If there's a sequel, i hope they make it better and with fights worthy of the original series.",
            "review_date": "2009-04-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A lot better than I was expecting! Fun fights, genuinely funny moments, and a certain visual charm I can't quite put my finger on. While not nearly the best film in the world, I felt pretty satisfied, both as an avid film goer, and a A lot better than I was expecting! Fun fights, genuinely funny moments, and a certain visual charm I can't quite put my finger on. While not nearly the best film in the world, I felt pretty satisfied, both as an avid film goer, and a fan of the manga series prior.",
            "review_date": "2009-04-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I watched dragonball heavily growing up, and in no way was this near the disappointment fans have claimed it to be. Folks expected a live-action dragonball. Well, that's impossible since dragonball is a cartoon and cartoons are I watched dragonball heavily growing up, and in no way was this near the disappointment fans have claimed it to be. Folks expected a live-action dragonball. Well, that's impossible since dragonball is a cartoon and cartoons are completely different from live-actions. If you port a cartoon to live-action, you have to change so much to create the same entertainment value. Plus, the filmmakers had to create a story fitting for live-action that contained the right amount of bad guy-good guy contrast, which meant they had to compress tons of stuff into a film length they could market towards the one audience that's gonna bring in the money, which is not the early 20s nostalgia fan, but the 8-12 year old boy general viewer. Have you ever seen an Uwe Boll film? nuff said. This was a great action movie for kids and did the nostalgia job pretty well for the older fan.",
            "review_date": "2009-05-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Rather silly and juvenile nonsense. There are some decent special effects. The acting by the young actors in the film is poor, which very much effects the film.",
            "review_date": "2009-07-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "You know what, I watched this movie because I thought it was going to be terrible and I wanted a good laugh I got two things, a good movie, and an AMAZING time. This movie is FANTASTIC! Yes, it's Dragonball NOT Dragonball Z; glad we got You know what, I watched this movie because I thought it was going to be terrible and I wanted a good laugh I got two things, a good movie, and an AMAZING time. This movie is FANTASTIC! Yes, it's Dragonball NOT Dragonball Z; glad we got past that bit. This movie was ridiculous, and over the top ALL the time, which is exactly why I enjoyed it. Goku was not some little emo kid like some people claim, just a teenager who hasn't been given the chance to show that he can kick some butt. Chi Chi is the only one I had a problem with, just because I chose to. Bulma was freakin hott. Yamcha was just as scam filled as ever. Master Roshi was VERY master Roshi. Piccalo was a hoot with how he looked, but come on, how much makeup would it take to make someone look like piccalo?? I really hope they are able to make the second and third ones; I expected to be disappointed, but I guess I'm glad I wasn't!",
            "review_date": "2009-08-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Solid movie. Not great obviously, but it was interesting to see what they did with the characters. Seems like fans of the series are looking for reasons to hate on this movie just because it's not the series.",
            "review_date": "2009-08-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Yes the film did suffer from poor directing and much-needed visual aids but in the end u cant do much better than what they have given other than if its animated like it original Anime. And if you review a movie learn how to spell right Dean Yes the film did suffer from poor directing and much-needed visual aids but in the end u cant do much better than what they have given other than if its animated like it original Anime. And if you review a movie learn how to spell right Dean Dum ass Mqueen. I give you a zero for pure stupidity",
            "review_date": "2009-04-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is pretty good, in a so bad it's good way. The story sucks, as a Dragonball fan even I couldn't understand half of it. However, if you switch yur brain ff you can enjoy the exciting action sequences and cheesy dislogue.",
            "review_date": "2009-04-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Since Chi Chi(Jamie Chung) is a competitive fighter and can hold her own against the men, \"Dragonball: Evolution\" misses a golden opportunity to evoke the Japanese translation of her name, which is \"father\", by having the young woman taunt Since Chi Chi(Jamie Chung) is a competitive fighter and can hold her own against the men, \"Dragonball: Evolution\" misses a golden opportunity to evoke the Japanese translation of her name, which is \"father\", by having the young woman taunt her prospective vanquished male opponent with a lusty, \"Who's your daddy?\" Chi Chi also has a second meaning; it's slang for a part of the woman's anatomy, the breast. In Laurent Cantet's \"Entre les murs\", a Parisian middle school teacher calls two ethnic female students, \"skanks\", without realizing that the term in their culture is slang for \"prostitute\". To him, a \"skank\" means somebody who is talkative. Mr. Marin(Francois Begaudeau) gets the benefit of the doubt. \"Dragonball: Evolution\" gets the benefit of the doubt, too, in the scene where Chi Chi fights a doppleganger. The second Chi Chi transforms her namesake into an anatomical one, because now we see two Chi-Chis(\"chi-chis\" from the Spanish), beautiful, to boot. The fake Chi Chi was trying to steal the dragonballs. There's seven of them, but the film title refers to just the one \"Dragonball\", which to me, suggests a mythical creature who survived a bout of testicular cancer. The other ball collectors have self-defeating names, too. Besides Chi Chi, there's Goku(Justin Chatwin), playing yet another version of the \"Karate Kid\", and then there's Bulma(Emmy Rossum), who to my disappointment, never eats anything. Thankfully, at eighty-plus minutes, there's enough time to physically collect just three of the seven dragonballs. \"Dragonball: Evolution\" also stars Chow-Yun Fat, who slums along happily in a comic performance that shows off an unbeknownst funny side to the usually stoic star of \"Crouching Tiger: Hidden Dragon\". He's a bit of a perv. In one scene, he puts a hand on Bulma's knee while they share a motorcycle. He probably notices her chi-chis.",
            "review_date": "2009-04-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I don't know why everyone seemed to hate this movie. This was an amazing movie! Everybody doesn't seem to get that this is an adaptation of the anime series. And also, for those of you who really wanted Vegeta, you must not be true I don't know why everyone seemed to hate this movie. This was an amazing movie! Everybody doesn't seem to get that this is an adaptation of the anime series. And also, for those of you who really wanted Vegeta, you must not be true dragonball fans because if you knew dragonball well enough, you would know that this was dragonball, not dragonball z and vegeta doesnt come in until dragonball z. I really liked pretty much everything about this movie. I liked the new story and how they changed it up a bit. I really liked the special effects and all the casting (except for yamcha) was great. My one big issue with the movie was that it was so short that i didnt feel really connected to any of these characters, other than Goku. If they would have made it at least another half an hour it wouldve been a perfect movie. I wish they wouldve showed more Picolo. I can't wait for the sequel!!!",
            "review_date": "2009-04-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "NOT AS BAD AS YOU THINK. And believe me on that one. I was one of those people who kept on bashing the previews and saying over and over that this was gonna be the worst movie ever. A nightmare to all true DBZ fans. I also kept sayin \"I know NOT AS BAD AS YOU THINK. And believe me on that one. I was one of those people who kept on bashing the previews and saying over and over that this was gonna be the worst movie ever. A nightmare to all true DBZ fans. I also kept sayin \"I know it's gonna be bad, but I'm still watching it because It's f***ing Dragon Ball!!! It's gonna suck though\" but after I saw the movie, it wasn't all that bad. It really has almost nothing to do with Dragon Ball, it's just related somehow with character names and super human abilities, but thats it. The whole movie runs by way too fast, and when it was done, I wished they have made it longer. It's still a bad movie, but it was entertaining. It also has a good sense a humor, which is good. If your a DBZ fan, just watch it. You probably wont like it, but... it's DBZ, so watch it.",
            "review_date": "2009-08-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If you are in your early twenties hoping for some epic case of nostalgia -reminisce of those wasted nights of youth spent watching a dozen DBZ episodes, of course with Japanese subs- this isn't the movie for you.If you are looking for a funIf you are in your early twenties hoping for some epic case of nostalgia -reminisce of those wasted nights of youth spent watching a dozen DBZ episodes, of course with Japanese subs- this isn't the movie for you.If you are looking for a fun action movie to kill time, take a look. But really, nothing special here.",
            "review_date": "2011-02-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I've started this movie about 4 times but every time I turn it off because I fall asleep or lose interest. What a shame on the series. Stick to the anime. But set your expectations for this film at 0 and you might actually appreciate it aI've started this movie about 4 times but every time I turn it off because I fall asleep or lose interest. What a shame on the series. Stick to the anime. But set your expectations for this film at 0 and you might actually appreciate it a bit. I give it a 4/10 because I see it as an ode to the series. Still, don't watch it if you aren't a dragonball fan",
            "review_date": "2012-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Dragonball anime is cack anyway and even if this was the greatest film ever made the sad little \"cool to be controversial\" fanboys are going to slate it. As a stand alone movie its average. Mortal Kombat the movie average.",
            "review_date": "2009-08-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A disgrace in all calibers for a DBZ fan , it broke my heart and it will broke the heart for every single one that read this and that is a fan of this anime. Just came from nowhere to be hidden in the garbage. Stand aside people.",
            "review_date": "2011-07-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "With the name Dragonball: Evolution, I can understand the creators trying to make the concept more approachable to modern audiences.  You can see this when they made Goku a 18 year old horn dog and making Yamcha a “dude bro”.  However, thisWith the name Dragonball: Evolution, I can understand the creators trying to make the concept more approachable to modern audiences.  You can see this when they made Goku a 18 year old horn dog and making Yamcha a “dude bro”.  However, this was executed exceptionally poorly.  Not only did it miss all the key elements of the main characters, the movie itself is nonsensical.  The movie is campy, cheesy, and poorly acted.  The voice overs are atrocious and the special effects, well lets just say they’re not very special.  This felt more like a Disney straight to TV movie like Luck of the Irish or Zenon: Girl of the 23rd Century.  You can tell this movie was made with no love from anyone on the production team, including the actors.  It’s actually very sad because Justin Chatwin and Emmy Rossum are excellent in their follow up roles in the show Shameless.  Dragonball is beloved by too many people for someone to barf out a script and having the actors phone in a performance.  It shows courage that the writer apologized for this mess years later, but one writer does not make a movie.  The fact that this was even approved shows that no one in Hollywood cared even the slightest bit about transforming arguably the biggest anime series of all times to a life action movie.  This movie failed on just about every level.  The writing, acting, effects, story, characters, and editing are all just a massive mess.  I can’t imagine one single fan was on the production team, because if their was they would have at least spoken up about how this is nothing like the original and is, in fact, a mockery of it.  Instead, everyone kept their head down and pushed out this pile of cat vomit for a payday.  I don’t have a problem with people making movies for money, it IS a business after all, but when your payday comes at the expense of something beloved by so many people is when you know you’ve made the worst of the worst.  It’s universally hated by Dragonball fans, and is even a terrible movie to watch with zero knowledge of the original series.  Stay far away from this, its not even worth watching to make fun of, as its just a sad abomination of film making.",
            "review_date": "2021-04-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It is a bad movie and horrible adaptation of Dragonball. The movie even surpasses “Avatar the last Airbender” in the awful adaptation category as there they at least try to use the source material even if it is horrible. If you are a fan thisIt is a bad movie and horrible adaptation of Dragonball. The movie even surpasses “Avatar the last Airbender” in the awful adaptation category as there they at least try to use the source material even if it is horrible. If you are a fan this is unbearable as they slap names, themes and tropes from Dragonball onto a movie that is barley recognizable to the source material. I think it is a mixture from teenage drama, fantasy and martial arts. I picked teenage drama firstly not by accident as they made this clear as starting point. Lets start at the beginning: I heard about the awfulness of the adaptation when it came to the cinema and the criticism did not decrease over the years. I was curious about this and finally watched the movie. Dragonball is based on Akira Toriyamas legendary Manga that was adapted to a successful Anime series which is based loosely on the classic tale “Journey to the West”. It follows the main protagonist Son Goku on his journey to find the Dragonballs which grant a wish if you get all together. This is incredibly simplified as there are tons of adventures, lore, characters, developments and arcs to be told. For the movie: In the introduction that already changes a lot of canon source material we are told that 2000 years the demon Piccolo nearly extincted mankind before he was stopped. The story jumps to current day high school student Goku who is trained by his grandfather Gohan in martial arts. I stop here not only because of spoilers but to not anger fans. While I have to admit that the movie has its good moments it is often hilariously bad and has wooden acting. Like I said if you rename a few things I would not recognize Dragonball except for idea theft. It could probably be in my “So bad its good” soft spot but I know the source material so it is disqualified. What to say about the cast. I don't blame actors for being trapped in a bad movie / script. I think there are great actors in this as I am a fan of Chow Yun-Fat, Ernie Hudson and James Masters. Sadly that could not save the movie. There are cringe-worthy and wooden scenes. Some are unintentionally funny and I repeat it is a horrible adaptation. Also I do not recognize the characters from the source material in a lot of actors. I don't know about the production but director James Wong is normally far better so I don't blame him either with the benefit of doubt. I think I praise the martial arts scenes as those were entertaining but even there I spotted errors. In the beginning Goku is attacked by 2 people with poles. He evades them so they hit each other but I spotted without looking for errors that they changed the gap to make this happen as they would clearly miss before. By the way the scene / fight itself was awesome. I generally like those fights with a bit of cheesiness and say it saves the movie from a lower rating. Overall this is a bad movie. As adaptation it is hardly a 1/10 and maybe a 0/10 but as movie it has some redeeming qualities but not enough to raise it above a 2/10.",
            "review_date": "2022-08-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An incredibly mediocre movie. I am not in any way familiar with the anime dragonball z but just hearing the characters talk made me want to throw up. The interactions between them felt forced and uncomfortable. whoever wrote the moviesAn incredibly mediocre movie. I am not in any way familiar with the anime dragonball z but just hearing the characters talk made me want to throw up. The interactions between them felt forced and uncomfortable. whoever wrote the movies dialogue should be fired. I understand its a kids movie but why not make it at least somewhat less cringe worthy. The pacing was also way off and just made this a  chore to sit through despite it's short run time. The kung fu scenes were entertaining but other than that dragonball z is a horrible mess from start to finish",
            "review_date": "2016-04-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "As a Dragon Ball fan this was clearly not anything even similar.As a movie fan, this was atrocious.Its hard to understand what kind of drugs all the people involved were in",
            "review_date": "2018-08-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie should not exist anymore! He ruined everything in Dragon Ball franchise. I thought that Home Alone 4 or any kind of abomination are the worst movies, but this crap beats all of them.",
            "review_date": "2018-03-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "AbysmalDragonball: Evolution isn’t quite as unbearable as The Last Airbender, But this movie is still a complete and utter insult to the fans and moviegoers in general.",
            "review_date": "2019-12-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Film critics are a complete joke. How does this score higher than the all the resident evil movies?",
            "review_date": "2021-11-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is one of the worst movies ever made the movie is not even a good live action movie or good movie if it was dbz or not it is a disgrace to the show and toriamas work and awful visuals that look rushed and is one of the worst movies inThis is one of the worst movies ever made the movie is not even a good live action movie or good movie if it was dbz or not it is a disgrace to the show and toriamas work and awful visuals that look rushed and is one of the worst movies in the world and is completely a waste of time and is very bad and is a disappointment",
            "review_date": "2018-03-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I'm going to be honest, this movie is actually a ton of fun to watch, this would go on a list of bad movies that I would watch with a group of friends because its so funny. The effects and dialogue are so hilarious to make fun of. However asI'm going to be honest, this movie is actually a ton of fun to watch, this would go on a list of bad movies that I would watch with a group of friends because its so funny. The effects and dialogue are so hilarious to make fun of. However as funny as this movie is, it's still bad. The plot is a mess and the acting is below average. Not to mention it leaves a lot of beloved characters and plot points out of the movie, as well as changing entire character personalities. As a Dragon Ball fan i enjoyed laughing at this movie, but I see why people despise this movie so much. If your looking for a bad movie to have fun with and laugh with your friends, i recommend this movie. However if you want a legitimate dragon ball movie, there are better options out there.",
            "review_date": "2018-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "i don't know why this exist...like...why would you make a anime movie real life?",
            "review_date": "2019-09-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is a disgrace to dragon ball and the whole franchise. When people say gt was the worst thing in dragon ball history. They should watch this to see what a real disgrace to a series is. They ruined dragon ball that ruined theThis movie is a disgrace to dragon ball and the whole franchise. When people say gt was the worst thing in dragon ball history. They should watch this to see what a real disgrace to a series is. They ruined dragon ball that ruined the characters into unrecognizable people that we don't understand like goku never went to goddamm school.",
            "review_date": "2019-08-20",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 110
}