{
  "title": "Fantastic Mr. Fox",
  "rating": 8.3,
  "release_date": "2009-11-13",
  "genre": [
    "Adventure",
    "Comedy",
    "Crime",
    "Animation",
    "Family"
  ],
  "summary": "Mr. and Mrs. Fox live an idyllic home life with their son Ash and visiting young nephew Kristopherson. But after 12 years, the bucolic existence proves too much for Mr Fox’s wild animal instincts. Soon he slips back into his old ways as a sneaky chicken thief and in doing so, endangers not only his beloved family, but the whole animalMr. and Mrs. Fox live an idyllic home life with their son Ash and visiting young nephew Kristopherson. But after 12 years, the bucolic existence proves too much for Mr Fox’s wild animal instincts. Soon he slips back into his old ways as a sneaky chicken thief and in doing so, endangers not only his beloved family, but the whole animal community. Trapped underground and with not enough food to go around, the animals band together to fight against the evil Farmers - Boggis, Bunce and Bean - who are determined to capture the audacious, fantastic Mr. Fox at any cost. [20th Century Fox]… Expand",
  "critic_reviews": [
    "For the reportedly painstaking labor it took to create, the film is a marvel to behold--with wonderful shifts in perspective, an intensely tactile design, and an intentional herky-jerkiness of motion that only enriches the make-believe atmosphere.",
    "With its virtuoso tomfoolery, Fantastic Mr. Fox is like a homegrown Wallace and Gromit caper. To Wes Anderson: More, please!",
    "Anderson has pulled off the most elusive of goals: He's made a nonchalant masterpiece, a movie that feels dog-eared and loved before it's even reached our hands.",
    "You don't want to watch this movie, you want to climb inside it and play.",
    "Witty and wonderful, Fantastic Mr. Fox is the perfect Thanksgiving entertainment.",
    "The result is an instant classic. The material allows Anderson to neutralize the most irritating aspects of his work (the precociousness, the sense of white-bread privilege) and maximize the most endearing (the comic timing, the dollhouse ordering of invented worlds).",
    "Fantastic Mr. Fox may be his most purely pleasurable film to date, evoking the Dahl books and Rankin-Bass productions that so transported him as a kid.",
    "Anderson has created a world as stylized and inventive as anything he's done... \"Fox\" is a visual delight.",
    "Endlessly enchanting.",
    "A pleasantly cerebral experience, exhilarating and fizzy, that goes to your head like too much Champagne.",
    "In some ways his (Anderson) most fully realized and satisfying film. Once you adjust to its stop-and-start rhythms and its scruffy looks, you can appreciate its wit, its beauty and the sly gravity of its emotional undercurrents.",
    "A captivating entertainment for the holiday season and well beyond.",
    "This is an animated film that happily has room for both an existentialist dread of death and a grinning joie de vivre.",
    "An adventure in pure imagination that plays to the smart kid in all of us.",
    "A gorgeous and witty piece of stop-motion animation.",
    "Most of all, it’s a magical feat, one that turns puppets into personalities and an English meadow into Anderson’s world.",
    "By forgoing actual human beings, the director has made his most charming, least annoyingly fey film - a thing of lovely comic wisdom.",
    "These animals aren't catering to anyone in the audience. We get the feeling they're intensely leading their own lives without slowing down for ours.",
    "Has its pleasures, foremost being its look – a sophisticated puppet primitivism backdropped by near-psychedelic colorations.",
    "For all the ostensible immaturity of its form, Fantastic Mr. Fox is the most grown-up thing the director has done in years.",
    "Genuinely original: a silly, hilarious and oddly profound adaptation for adult-sized children.",
    "The film's style, paradoxically both precious and rough-hewn, positions this as the season's defiantly anti-CGI toon, and its retro charms will likely appeal more strongly to grown-ups than to moppets; it's a picture for people who would rather drive a 1953 Jaguar XK 120 than a new one.",
    "The result is a visual treasure that successfully blends deadpan quirkiness with a wry realism rarely seen in any film, let alone one for children.",
    "This is no more a kids’ movie for kids than \"Where The Wild Things Are\"; it’s a film strictly for Wes Anderson fans of all ages. By now, they should know who they are.",
    "It's an intriguing match of material and filmmaker. Dahl's distinctive, edgy storytelling seems to fit well with Anderson's idiosyncratic worldview and visuals.",
    "If there's an argument against the film (and, admittedly, it's not much of an argument), it's that the movie may not be suitably childish to appeal to younger viewers.",
    "Mr. Fox's old-fashioned, hand-crafted animation is one of its main attractions. Another is Anderson's whimsical, dry humor, a natural for this tale of a crafty, dapper fox.",
    "Anderson injects such charm and wit, such personality and nostalgia - evident in the old-school animation, storybook settings and pitch-perfect use of Burl Ives - that it's easy to forgive his self-conscious touches.",
    "Fantastic Mr. Fox imparts lessons as profound as \"The Road's\" about love and gratitude and awareness of others. It just has more fun doing it.",
    "The tale may be Dahl's, but there's a whole new wag to it – this is decidedly, weirdly and, at best, wonderfully a Wes Anderson movie.",
    "Even though it's right there in the title, \"fantastic\" might be a touch hyperbolic in describing director Wes Anderson's stop-motion adaptation of Roald Dahl's The Fantastic Mr. Fox,  but only by a whisker.",
    "I’m flummoxed as to why the movie left me feeling up in the air, as opposed to over the moon. Partly, I think, it’s a matter of how Anderson’s sense of humor rubs up against that of the book’s author, Roald Dahl.",
    "It’s unfortunate that the result is so unaffecting, especially in light of all the things the director does right.",
    "The animals are often caught in a stare as if they, too, are looking for the tale that Anderson forgot."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Witty, intelligent, fun. Great soundtrack too.",
      "review_date": "2009-11-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Interestingly its choice of presenting the visuals using clay is definitely one of what makes \"Fantastic Mr. Fox\" a good movie. But its the childish, simple script you'll love.",
      "review_date": "2011-09-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Wes Anderson instantly became one of my favorite directors after seeing this great animated film.  His quirky style was perfect for this story, and voice-overs were outstanding.  Clooney in particular was brilliant.  I am a huge fan ofWes Anderson instantly became one of my favorite directors after seeing this great animated film.  His quirky style was perfect for this story, and voice-overs were outstanding.  Clooney in particular was brilliant.  I am a huge fan of animation and I usually don't like it when I recognize an actor's voice because I only think of the actor while watching the film, but in this case the famous actors (George Clooney, Meryl Streep, Bill Murray) became the characters they voiced and were perfect.  The music was also brilliant throughout.  I hope Wes Anderson makes more animated films in the future.  BRILLIANT!",
      "review_date": "2012-06-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was definitely Wes Anderson's comeback hit, and the argument can be made that this is Wes Anderson's best movie. The animation is great and only serves to heighten Wes Anderson's quirky and unique style. It's charming, heartwarming, andThis was definitely Wes Anderson's comeback hit, and the argument can be made that this is Wes Anderson's best movie. The animation is great and only serves to heighten Wes Anderson's quirky and unique style. It's charming, heartwarming, and funny. Best of all, it's fun for the whole family, as there is no CUSS-ing in this flick!",
      "review_date": "2018-07-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It makes you feel good. Great movie.",
      "review_date": "2009-11-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This could only have been made in Britain. Hollywood, now CGI 'd, out would have never been able to understand the charm element. The movie must have been exceedingly difficult to make, the Production Manager as well as getting a This could only have been made in Britain. Hollywood, now CGI 'd, out would have never been able to understand the charm element. The movie must have been exceedingly difficult to make, the Production Manager as well as getting a 'tile' should also be nominated for an Oscar.",
      "review_date": "2009-11-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Don't see Twilight, see this. It's just brilliant.",
      "review_date": "2009-12-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Franklin Bean(Michael Gambon), a manufacturer of apple cider, is no Davy Crockett, but he, as well as his farmer friends, are not the men in black hats; are not in actuality, on closer inspection, the bad guys. Unlike Crockett, who opposed Franklin Bean(Michael Gambon), a manufacturer of apple cider, is no Davy Crockett, but he, as well as his farmer friends, are not the men in black hats; are not in actuality, on closer inspection, the bad guys. Unlike Crockett, who opposed the removal of Indians from their homestead, Bean wants the animals off his land. (Note: It's the wolf who's the stand-in for the Native American, not the meadow animals.) Although it's only natural that you, the moviegoer, should side with the talking critters, don't overlook the fact that it's the foxes who start the war, in which the landowners are forced in a position to defend their respective livelihoods. Interestingly enough, the filmmaker uses The Beach Boys' \"Heroes and Villains\" during a scene where Mr. and Mrs. Fox(voiced brilliantly by George Clooney and Meryl Streep) steal chickens. The Brian Wilson-penned song calls into question the role of the foxes as either being heroes(the natural assumption made by the audience), or anti-heroes. Despite being adorable and wryly funny, they're undoubtedly the latter, as the sequence is preceeded by the opening scene's uncanny resemblance to the one in Fred Zinneman's \"High Noon\", where the posse of gunslingers congregate while being scored by a Tex Ritter ballad(\"Do Not Forsake Me\"). There's a juxtaposition at work, as the song reflects the protagonist's desire to see \"Frank Miller dead\". Likewise, \"Fantastic Mr. Fox\" uses \"The Ballad of Davy Crockett\", and Davy Crockett is not Mr. Fox: it's Bean. In both cases, the protagonist's song humanizes the villain. The filmmaker pays homage to the imagery in \"High Noon\" where one gunslinger is approached by his associate on horseback, as Mr. Fox is joined by Mrs. Fox in a meadow before they they plunder a squab farm. The foxes are lovable, but they're thieves, and worse, don't have the excuse of being indigenous creatures, because they're civilized, a cut above the wild animals(like the wolf). (The badger, played by Bill Murray, is an industrialist; he owns a flint mine.) Most notably, Kristofferson(voiced by Eric Chase Anderson), the foxes' charge, arrives by train, as Frank Miller does in the Gary Cooper film, and like the \"High Noon\" antagonist, this slightly effeminate visitor is targeted for death. The filmmaker references this fact, arguably: Ash(voiced by Jason Schwartzman) owns a train set that he demonstrates for Kristofferson, which is followed by a cut to the actual train he arrived on.",
      "review_date": "2009-12-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fantastic Fox shows a great deal of humor.",
      "review_date": "2009-11-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A beautifully made movie, and an entertaining one to boot. It was just a world I could get immersed in, and wouldn't mind getting lost in. A real triumph.",
      "review_date": "2009-11-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An excellent adaptation of Roald Dahl's noted children's book, with a terrific roster of readers and entertaining both for kids and adults.",
      "review_date": "2009-11-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "My absolute favorite animated film already. The humor was spot-on, the stop motion was incredibly done, the voice acting was perfect, and the style was just bewilderingly effective.",
      "review_date": "2009-11-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fantastic mr fox is nothing short of fantastic. very creative. if you like art, then that is exactly what this movie is. it's art. very refreshing.",
      "review_date": "2009-12-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Superb! Wes' world ported over to animation very well. I had the biggest grin on my face throughout the entire movie. Extremely well done production, voice acting, script...come to think of it, I enjoyed every little detail of it.",
      "review_date": "2009-12-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Zero mention by anyone of the fact that this is a roaldh Dahl book? written yonks ago!? it gets to hollywood and all of a sudden its written by wes anderson! i suppose he wrote charlie and the chocolate factory too?? Is there one film critic Zero mention by anyone of the fact that this is a roaldh Dahl book? written yonks ago!? it gets to hollywood and all of a sudden its written by wes anderson! i suppose he wrote charlie and the chocolate factory too?? Is there one film critic reporter anywhere in the usa who actually researches? Buy your kids the book people!",
      "review_date": "2009-12-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Wes Anderson's style shines through even to the animated genre. It is brilliantly written and brilliantly directed. It is not on the same level as UP in terms of animated films, but it is certainly enjoyable. Take your kids to see this Wes Anderson's style shines through even to the animated genre. It is brilliantly written and brilliantly directed. It is not on the same level as UP in terms of animated films, but it is certainly enjoyable. Take your kids to see this one, and you will have an equally \"fantastic\" time.",
      "review_date": "2009-12-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "More playful than anything W.Anderson has done, but more disciplined, too, probably because he he's guided by his source material. This explains why it goes a bit off-the-rails emo-loony the way W.Anderson movies do when he creates an More playful than anything W.Anderson has done, but more disciplined, too, probably because he he's guided by his source material. This explains why it goes a bit off-the-rails emo-loony the way W.Anderson movies do when he creates an epilogue the movie never had. Still, there are the cute moments you would expect with an animated movie voiced by Clooney, Meryl, J.S., and Owen Wilson (the whackball tutorial is a highlight), even if the title character kind of comes off as kind of a selfish, self-satisfied a-hole.",
      "review_date": "2009-12-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Absolutely delightful. Best thing Wes Anderson has done since Rushmore.",
      "review_date": "2009-12-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Back to form for Anderson after a couple of uneven films. I thought this was great ... funny, cool to look at, great performances and good humor.",
      "review_date": "2009-12-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the best movies I've ever seen. Go see this movie. You may love it and you might hate it, but if you do love it you'll smile for a month of Sundays.",
      "review_date": "2009-12-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Brilliant, brilliant, brilliant. This movie didn't require an explanation.. It was absolutely beautiful and possessed the right amount of \"Art\".",
      "review_date": "2009-12-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Cant See how people wouldn't find this funny. And as much as its meant to be a kids movie its really is not. To Louisa, its meant to be a kids movie ! Why the cuss are you going so deep into how the animals are sized and a possum in Cant See how people wouldn't find this funny. And as much as its meant to be a kids movie its really is not. To Louisa, its meant to be a kids movie ! Why the cuss are you going so deep into how the animals are sized and a possum in Britain and that the foxes only have one cub, Jesus Christ, its an animated 'kids' movie.. The toys talk in toy story, does that bother you ?",
      "review_date": "2009-12-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was funny. star studded cast too.",
      "review_date": "2009-11-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What artistry! As a life-long Wes Anderson fan, and with so many wonderful masterpieces in his own filmography to compete with, I must say that it was no competition at all. It truly challenged modern animation and made a powerful, nostalgic What artistry! As a life-long Wes Anderson fan, and with so many wonderful masterpieces in his own filmography to compete with, I must say that it was no competition at all. It truly challenged modern animation and made a powerful, nostalgic impression. Also, the excellent screenplay contributed to the film's beauty and wit. What a fantastic milestone in cinema! I have never had so much fun in a theater!",
      "review_date": "2009-11-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A really great movie. Hilarious throughout. The animation was not slick, but the jerkiness was charming and often used for comedic effect. As for marking it down for not having a good message for kids - well, it's not a kids movie. They A really great movie. Hilarious throughout. The animation was not slick, but the jerkiness was charming and often used for comedic effect. As for marking it down for not having a good message for kids - well, it's not a kids movie. They might like it, but it isn't the targeted audience.",
      "review_date": "2009-11-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "UP, you have competition at the Academy Awards this year! To keep it short, this was a great film that had me grinning the entire way through. A must see.",
      "review_date": "2009-12-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I loved this quirkly film. It had me hooked in the first 5 minutes and grinning and laughing throughout. The animation was perfect for the quirky type of film it was. George Clooney was great in the lead role, but everyone else was up to the I loved this quirkly film. It had me hooked in the first 5 minutes and grinning and laughing throughout. The animation was perfect for the quirky type of film it was. George Clooney was great in the lead role, but everyone else was up to the challenge as well. Pixar finally has some competition, as this movie AND \"A Christmas Carol\" were BOTH better than \"Up\".",
      "review_date": "2009-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Superb, fun and artistic, \"Fantastic Mr. Fox\" is a whimsically hilarious tale that simply must be experienced. Cheers to Wes Anderson's creative genius.",
      "review_date": "2009-12-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the best movies I have ever seen. It was \"cuss\" good. The animation was unique, what do you expect from claymation? The famous voices added more than zip, although the movie was amazing with or without them.",
      "review_date": "2009-11-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This used to be one of my favorite books when I was younger and so I had high expectations for this movie. This movie met it and exceeded the expectations. It was wonderfully done and I loved every second of it.",
      "review_date": "2009-11-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A wonderful film. I had a smile on my face at the end of it, to my amazement.",
      "review_date": "2009-11-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Artfully made and incredibly entertaining.",
      "review_date": "2009-11-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Truly, absolutely spectacular. One of the best movies I've ever seen, and certainly the most original. Anderson has managed to squeeze more character out of a collection of miniature animal puppets than is exhibited in the majority of Truly, absolutely spectacular. One of the best movies I've ever seen, and certainly the most original. Anderson has managed to squeeze more character out of a collection of miniature animal puppets than is exhibited in the majority of live actors, and every painstakingly animated moment is a joy to behold. The Fantastic Mr. Fox truly lives up to its name!",
      "review_date": "2009-11-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a Fantastic Mr. Fox. I laughed, I smiled and I laughed some more at this quirky little film. I was even smiling on the way out. The music even made me laugh. I think adults will like this even more than kids will. The voices were This is a Fantastic Mr. Fox. I laughed, I smiled and I laughed some more at this quirky little film. I was even smiling on the way out. The music even made me laugh. I think adults will like this even more than kids will. The voices were great and though the \"animation\" was a little different you get swept up in the story. Spread the word about this film.",
      "review_date": "2009-11-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It breaks my heart that this movie is bombing, It deserves to be seen - and I don't use those words often.",
      "review_date": "2009-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Very clever and fun Wes Anderson film with great animation and witty writing.",
      "review_date": "2019-04-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fantastic Mr. Fox surprisingly has a lot of heart, actually more than most movies. And the movie has support of its star studded voice cast who give funny performances. Altogether the movie is funny, clever and heartfelt with fitting stopFantastic Mr. Fox surprisingly has a lot of heart, actually more than most movies. And the movie has support of its star studded voice cast who give funny performances. Altogether the movie is funny, clever and heartfelt with fitting stop motion animation. I give this movie 91%.",
      "review_date": "2012-01-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Relentless in it's intricately amusing ways, Fantastic Mr Fox is animated perfectly and written with an abundance of intelligence and wit.",
      "review_date": "2013-04-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "After 12 years of bucolic bliss, Mr. Fox (George Clooney) breaks a promise to his wife (Meryl Streep) and raids the farms of their human neighbors, Boggis, Bunce and Bean. Giving in to his animal instincts endangers not only his marriage butAfter 12 years of bucolic bliss, Mr. Fox (George Clooney) breaks a promise to his wife (Meryl Streep) and raids the farms of their human neighbors, Boggis, Bunce and Bean. Giving in to his animal instincts endangers not only his marriage but also the lives of his family and their animal friends. When the farmers force Mr. Fox and company deep underground, he has to resort to his natural craftiness to rise above the opposition. Fantastic Mr. Fox is a delightfully funny feast for the eyes with multi-generational appeal -- and it shows Wes Anderson has a knack for animation. I give Fantastic Mr. Fox an A+.",
      "review_date": "2018-05-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "to speculate it with such nuance..Fantastic Mr. Fox\n\nFantastic Mr. Fox is a character driven animated comic drama about a fox that fails to act against its nature and gets into trouble along with his family. The symmetric world of Andersonto speculate it with such nuance..Fantastic Mr. FoxFantastic Mr. Fox is a character driven animated comic drama about a fox that fails to act against its nature and gets into trouble along with his family. The symmetric world of Anderson never fails to delight us and the primary reason is it being brimmed with fine details that speaks volume. The work went behind the stop-motion animation is just marvelous especially to pull it off on such large scale and to speculate it with such nuance that it leaves the audience in an awe of it. The acts distributed in here and the way they shift from one to another is bizarrely ingenious and extremely powerful. It is eerily fast paced yet aptly cooked characters that offers enough depth for the viewers to dig in and explore. The writing is sharp, to- the-point and explicit with tiny tactics installed in here that not only is infomercial but hilarious too. Such dysfunctional family might have been familiar to the audience but with a perspective like this, the clock starts from zero. It is rich on technical aspects like its up beating background score, amazing songs, metaphorical cinematography and fine editing that paints the picture brighter. The voice cast fills in perfectly in this wild world and has done a hilarious work especially by Clooney, Streep, Murray and Wilson. Anderson's strong script matches its brilliant execution where you know that you have surrendered to his surreal world when he draws out emotions from these characters and pours it like rain over the audience. The three dimensional characters, satirical humor, moral conflicts and thought provoking policy that is genuinely effective are the high points of the feature. Fantastic Mr. Fox is a forced to be reckoned with, that not only shows potential in such animation but also the structure of the script.",
      "review_date": "2018-09-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A bombastic, unbarred children's tale whose only considerable flaw is that it is too much fun. Both Wes Andersen and George Clooney are at their peak.",
      "review_date": "2010-08-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Beautiful, funny and tragic all at the same time. Fantastic Mr. Fox is nothing short of life affirming.",
      "review_date": "2009-12-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is definitely a good film. Visually it is rather interesting and quite engaging in a way, which is rather refreshing for animated features. The musical score was definitely the high point of the film! Simply brilliant. However, neverThis is definitely a good film. Visually it is rather interesting and quite engaging in a way, which is rather refreshing for animated features. The musical score was definitely the high point of the film! Simply brilliant. However, never having read the book, the film itself does not seem to have a point to it. If one watches it and disregards that it's a children's book originally, one would ask themselves \"what the heck is the point of this thing???\" despite it being rather entertaining. Also, the actors did an excellent job with the voice-over, especially George Clooney, and it was lovely to hear Meryl Streep's voice!Overall, it is definitely a good film, but keep in mind that it does not necessarily have a point to it. It's a children's story turned into a film. Fun, but not very deep/challenging.",
      "review_date": "2010-09-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I didn't have any sort of expectation for this film, but i found considerably disappointing all the same. even with a great animation style the film is hampered by basically everything else.",
      "review_date": "2017-12-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Wary of quirky Wes Anderson films about the privileged and anxious? So was I, but he's knocked this one out of the park. It's a labour of love, wonderfully written, casted and crafted (a thoroughly appropriate word in this Wary of quirky Wes Anderson films about the privileged and anxious? So was I, but he's knocked this one out of the park. It's a labour of love, wonderfully written, casted and crafted (a thoroughly appropriate word in this context.) Made for smiles not yuks, and all the better for it.",
      "review_date": "2010-01-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was my favorite movie of 2009. Intelligently imagined and meticulously detailed. I fell in love, and took friends to see it with me for a total of four viewings!!",
      "review_date": "2010-01-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This may have been the single most enjoyable movie of 2009. The visual style lends to an all pervasive sense of playfulness that never slips, even in more serious moments. The script is excellent and all the actors deliver their lines This may have been the single most enjoyable movie of 2009. The visual style lends to an all pervasive sense of playfulness that never slips, even in more serious moments. The script is excellent and all the actors deliver their lines perfectly. There is not a film I saw this year I would recommend more readily.",
      "review_date": "2010-02-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I'm not understanding the harsh criticism this film is getting from some people on here. \"unwatchable\", \"worst attempt at film making...\", \"boring boring boring dumb\". Well-crafted and witty films like this restore my faith in Hollywood I'm not understanding the harsh criticism this film is getting from some people on here. \"unwatchable\", \"worst attempt at film making...\", \"boring boring boring dumb\". Well-crafted and witty films like this restore my faith in Hollywood after being clubbed over the head with productions like Avatar. Perhaps that's what's wrong with the aforementioned 'reviewers', they've subjected themselves to too many low-brow cinematic beatdowns that they can't identify talented filmmaking when it's presented to them in a subtle and sophisticated fashion.",
      "review_date": "2010-03-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's hard for me to explain why i loved this movie so much. Maybe it was its beautiful art style. Maybe it was because of its fast paced structure? Maybe it was because of its subtle off-beat humor? I think it was its capability to It's hard for me to explain why i loved this movie so much. Maybe it was its beautiful art style. Maybe it was because of its fast paced structure? Maybe it was because of its subtle off-beat humor? I think it was its capability to blend all of the these aspects together into a full cohesive experience that was enjoyable on so many levels. I don't have any kids, and don't know if they would find this movie to be fun or funny... but I... a 22 year old man... found it to be completely fulfilling and it greatly surpassed my expectations.",
      "review_date": "2010-02-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Divisive film. Wow. I love this movie and can't wait to get it on DVD. I'm a huge fan of Wes Anderson films, and it's a pleasure to have one that's completely innocent (with brilliant uses of the word \"cuss\"). I suppose Divisive film. Wow. I love this movie and can't wait to get it on DVD. I'm a huge fan of Wes Anderson films, and it's a pleasure to have one that's completely innocent (with brilliant uses of the word \"cuss\"). I suppose if you're used to Disney and all the other movies produced in the same vein, this may come off poorly. However, if you watch carefully, there are scores of clever and charming moments that made me laugh out loud. Like a good meal or a quality album, this takes a little more thought to enjoy than say, your typical summer blockbuster. Thank goodness for dry humor. I watched this with my parents, who I thought would not enjoy the film. They loved it almost as much as I did, and with good reason. It's a lovely film, and beautiful (with great use of Helvetica all over the place). I enjoyed the characters and the dilemma. Another plus: Wes Anderson seems to understand that PG doesn't have to mean \"kids movie.\" See this and pay careful attention - you'll be rewarded.",
      "review_date": "2010-02-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Amazing movie, great cast, and just plain awesome. are all words i would use to describe this movie. with its great sense of humor, and perfect timing on all the jokes makes this one of my favorite movies ever.",
      "review_date": "2010-02-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I absolutely adored this movie. Easily one of my favorites so far this year. I don't really think too many people will end up watching it, but I highly recommend it to anyone. Well, anyone with a decent sense of humour at least.",
      "review_date": "2010-03-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Finally, a non-3D animated film! I don't mind 3D animated films in general; they're actually one of my few preferences for the use of 3D. But the old fashioned method of Fantastic Mr. Fox's animation was riveting and colorful. Finally, a non-3D animated film! I don't mind 3D animated films in general; they're actually one of my few preferences for the use of 3D. But the old fashioned method of Fantastic Mr. Fox's animation was riveting and colorful. Wes Anderson added humor and surprising tension to draw you into these characters and feel sympathy for them. Despite the unnecessary drug content, this movie is highly recommended and should have won Best Animated Film.",
      "review_date": "2010-03-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best film of '09. Saw it twice and will but it right wen it comes out on DVD. Its a witty, lovable film in a sea of unlikable crap to come out this year (transformers 2, G.I. Joe) No matter what genre it says, it is not a kids movie. Best film of '09. Saw it twice and will but it right wen it comes out on DVD. Its a witty, lovable film in a sea of unlikable crap to come out this year (transformers 2, G.I. Joe) No matter what genre it says, it is not a kids movie. They won't get most of the jokes that Wes put in. In fact, he had to add a censor word to replace what were originally swears(the word is Cus) He did this because it was based of a kids book so he had to make it kid friendly. If you haven't seen it yet, see it on DVD.",
      "review_date": "2010-01-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The humour is outstanding and the style superb. The brilliance of it can miss those not looking for it. It shouldn't be taken as a book adaption or a genre-defined movie. The realism of the closeness to the averageness of it is what The humour is outstanding and the style superb. The brilliance of it can miss those not looking for it. It shouldn't be taken as a book adaption or a genre-defined movie. The realism of the closeness to the averageness of it is what drives Mr. Fox to look for a way out of the dull life he is in. There are many deep emotional levels that appeal to the heart of human nature and the dark side of business as seen by nature. Some things seem underplayed, but the story is solid. Don't go looking for something that makes you laugh every second especially if you have a close-mind. This movie is 50% opinion and 50% art.",
      "review_date": "2010-03-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is incredible, its not going to cater to you with easy jokes and physical humor, but its hilarious. Dont be fooled by the blowhards below me, watch this movie immediately.",
      "review_date": "2010-03-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fox retires from stealing chickens, becomes a journalist, wants to steal from three big farms, doesn't tell wife, farmers want him dead.Brilliantly animated adaptation of Roald Dahl's book which is helped by solid voice work from GeorgeFox retires from stealing chickens, becomes a journalist, wants to steal from three big farms, doesn't tell wife, farmers want him dead.Brilliantly animated adaptation of Roald Dahl's book which is helped by solid voice work from George Clooney, Bill Murray & co.The Stop-Motion reminded me of 1970's Eastern European fairytales which I'd seen when I was younger & really does add to the whole feel & setting of the film.Some nice music used throughout as well.",
      "review_date": "2010-10-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A fun story that balanced the expected cartoon-style character development with adventures and bright, madcap action. My only complaint is the fact that professional voice actors seem to be nearing extinction as money-grubbing movemakers hireA fun story that balanced the expected cartoon-style character development with adventures and bright, madcap action. My only complaint is the fact that professional voice actors seem to be nearing extinction as money-grubbing movemakers hire the big names, even though the stars go unseen. George Clooney's voice is so recognizable -- and his persona is so un-fox-like--that it was impossible not to feel throughout that his voice was kind of miscast.",
      "review_date": "2011-01-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the most entertaining, funny, clever and wonderfully voiced animated film I've ever seen. Wes Anderson's screen adaptation is brilliantly cast, uniquely animated as clever as the cast who voice the main characters.",
      "review_date": "2010-12-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "idk, i didn't see any comedy, any action, any anything in this movie, the only thing i found about it was it was boring. i mean, it seems to be aimed at children, but most of it is pointed at adults. so in all, it just wasn't my thing",
      "review_date": "2012-06-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "From the point of view of someone who hasn't been brought up in the US and wasn't familiar with the novel or the character of Mr. Fox, this movie presents quite an issue. It's not particularly funny, there's a certain creepiness about it, andFrom the point of view of someone who hasn't been brought up in the US and wasn't familiar with the novel or the character of Mr. Fox, this movie presents quite an issue. It's not particularly funny, there's a certain creepiness about it, and I'm not convinced about Clooney dubbing the main character. Overall, it left me with a very upsetting feeling of being tricked into watching something that turned out to be something completely different.",
      "review_date": "2011-08-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The voices are great but I absolutely    hate the animation style. Wes Anderson's films seem to not be my thing",
      "review_date": "2017-08-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Quite simply the laziest and worst attempt at film making I have ever had the misfortune of sitting through.",
      "review_date": "2010-02-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Unwatchable. Not funny for adults, dull for kids. There are no entertaining issues here, just a waste of talent. It isn't clear why this nostalgic amateurish animation technique was used, but it looks like a student film. Though it Unwatchable. Not funny for adults, dull for kids. There are no entertaining issues here, just a waste of talent. It isn't clear why this nostalgic amateurish animation technique was used, but it looks like a student film. Though it looks like critics were impressed by A-list talent working on this kind of movie, the big question for the rest of us is what cellular service they used to phone in these performances.",
      "review_date": "2010-01-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was the worst movie I have ever seen next to \"Mountains of the Moon\"...I was with a group of 8 of us, and not a single person including the kids had one thing good to say about it when if finally ended...boring, boring, boring, dumb!! I This was the worst movie I have ever seen next to \"Mountains of the Moon\"...I was with a group of 8 of us, and not a single person including the kids had one thing good to say about it when if finally ended...boring, boring, boring, dumb!! I kept wanting to leave, but thought it had to get better...never did! It was 90 min. I'll never get back! Although it felt like days sitting there being annoyed! Can't figure out what the hype is all about because it was BAD!!",
      "review_date": "2010-02-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fantastic Mr. Fox is a stop motion animated film about woodland creatures doing things. I donâ",
      "review_date": "2011-12-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Not exciting and witty like the book it's based on. Gimmicky.",
      "review_date": "2010-01-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "For anyone who enjoyed Roald Dahl as a child, be aware: this movie is one of the greatest disappointments I've ever seen.  Shoddy writing, inexplicably stupid characters, and a generally foolish plot hit me where it hurts.  George Clooney,For anyone who enjoyed Roald Dahl as a child, be aware: this movie is one of the greatest disappointments I've ever seen.  Shoddy writing, inexplicably stupid characters, and a generally foolish plot hit me where it hurts.  George Clooney, who I usually enjoy immensely, actually managed to make me want to punch him in the mouth; none of the other actors managed even that large of a rise from me, instead filling me with resigned disgust.  By the end, I was cheering for Boggis, Bunce, and Bean.",
      "review_date": "2011-02-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I was so looking forward to this movie, everyone said it was so great but when I saw it, it was the worst movie I ever saw. The storyline made no since, the characters had no  personality. Overall, do not see this movie, it is a waste of time.",
      "review_date": "2012-03-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The worst kind of movie is a movie that makes you feel nothing. At least a really bad movie will make you emote, it will make you angry so at least you care. I sat in the theater and the movie rolled and I felt almost nothing. The main The worst kind of movie is a movie that makes you feel nothing. At least a really bad movie will make you emote, it will make you angry so at least you care. I sat in the theater and the movie rolled and I felt almost nothing. The main character is wholly unlikeable and I didn't care about any of the rest of the cast.",
      "review_date": "2010-01-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fantastic Mr Fox has the quirkiness of most Wes Anderson movies which work wonderfully with the 1970's palett, unfortunately however it also has the forced, trying to hard, moments of the Darjeeling Limited. The feel of the movie works Fantastic Mr Fox has the quirkiness of most Wes Anderson movies which work wonderfully with the 1970's palett, unfortunately however it also has the forced, trying to hard, moments of the Darjeeling Limited. The feel of the movie works and certain scenes fit together just perfectly creating a \"realistic\" Roald Dahl world with a touch of charm. Pity then that Wes Anderson resorts to his \"awkwardness\" tool, which breaks the movies flow, stops the fun and pulls the rug under the feet of any child (or in my case; adult) trying to enjoy it!!",
      "review_date": "2010-01-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Beautifully executed and essentially dull; 5 minutes after leaving the theatre we asked ourselves, \"What was that about?\"",
      "review_date": "2009-12-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Clever! Dashing funny! Its got a thrilling speed this is the type of movie I love! I was very impressed so entertaining! Go See this film right now! amazing! The drums in the movie in some of the exciting scenes really buzz it up a bunch Clever! Dashing funny! Its got a thrilling speed this is the type of movie I love! I was very impressed so entertaining! Go See this film right now! amazing! The drums in the movie in some of the exciting scenes really buzz it up a bunch this movie is cunning and sinister, total knock-out awesome film! Gotta love it as fun as ratatouille!!!!",
      "review_date": "2010-01-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I felt it was just an average film with average characters that didn't move me at all. I appreciated the stop-motion animation and the beautiful score, but the story was boring and rather tedious. It's not as witty or humorous as I felt it was just an average film with average characters that didn't move me at all. I appreciated the stop-motion animation and the beautiful score, but the story was boring and rather tedious. It's not as witty or humorous as Roald Dahl's fantastic book.",
      "review_date": "2010-02-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I didn't find it funny at all, and only heard 1 person laugh out loud maybe twice. My 5 year old says it was ok, but we were both having a hard time staying awake. Wouldn't even rent this one.",
      "review_date": "2009-11-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Truly one of the worst movies I've ever seen.",
      "review_date": "2009-11-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Didn't like it at all. Pixar's got it beat. Animation was not up to par, and the characters never grabbed my attention. One of my fellow moviegoers slept through 98% of the movie.",
      "review_date": "2009-11-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A review for any people out there who wanted to see an animal movie: this is not it. To give some context for my review: I totally loved Bottle Rocket, Rushmore, The Royal Tenenbaums, and The Life Aquatic. For me (my sister violently A review for any people out there who wanted to see an animal movie: this is not it. To give some context for my review: I totally loved Bottle Rocket, Rushmore, The Royal Tenenbaums, and The Life Aquatic. For me (my sister violently disagrees) the Darjeeling Limited and its prequel, for all their magical sets and wonderful details, was just recycling the previous movies, and I found the Fantastic Mr. Fox, for all its amazing, unique animation, even more recycled. For a movie all about delightful detail, why do we have an opossum in Britain? a pair of foxes with only one cub? beagles without a trace of beagleishness? a rat the size of a fox? The reason is that this is not a movie about animals, it is a movie about people, and in fact this is a movie about people we've already seen in previous Wes Anderson movies. Several times I had an eerie (and not necessarily negative) feeling of deja vu, feeling that Anderson had literally recreated scenes from his live-action movies in puppet form. Roald Dahl is nowhere to be found (\"The Fantastic Mr. Fox,\" which I only read out of curiosity after finding the movie so un-Dahl-ish, was for me not anywhere near the top 10 best Dahl stories, but I was interested to see it was almost completely different in its sense of humor and its priorities--it was really about a fox, for one thing, not a human in a fox's clothing). Anderson's characters' lack of animalness stands in sharp contrast to Pixar's recent terrific movie \"Up,\" where the bird and dogs are wonderfully real and beast-like--even though clearly imaginary.",
      "review_date": "2009-12-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was a pretentious, boring, painful to watch piece of \"I am so cool. Look-it me I am a hip director\" movie. So it was somewhat visually interesting. I think I would have enjoyed it a lot more if the sound had malfunctioned in the This was a pretentious, boring, painful to watch piece of \"I am so cool. Look-it me I am a hip director\" movie. So it was somewhat visually interesting. I think I would have enjoyed it a lot more if the sound had malfunctioned in the theater. Then I wouldn't have had to hear the ridiculous dialog and painfully bored hip dialog.",
      "review_date": "2009-12-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This stiff moving absurdity taught some moral lessons tied into frequent glitches in movement, filler shots to try to confuse even more and absurdities about farmers, foxes and animals. The intro scenes were cute, the the and worked well, This stiff moving absurdity taught some moral lessons tied into frequent glitches in movement, filler shots to try to confuse even more and absurdities about farmers, foxes and animals. The intro scenes were cute, the the and worked well, even though the movements were stretched to fill the time. All in all adults can stay away, though my granddaughter loved it, My wife pretty much felt the same as I, even though she taught the book is school.",
      "review_date": "2009-11-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Weird and creepy......Wouldn't recommend it at all.",
      "review_date": "2009-11-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fantastic Mr. Fox is the best animated film of the year! It was based on the book by Roald Dahl,who created Charlie and the Chocolate Factory. It's a great stop-motion animated film since The Nightmare Before Christmas and Wallace & Gromit.Fantastic Mr. Fox is the best animated film of the year! It was based on the book by Roald Dahl,who created Charlie and the Chocolate Factory. It's a great stop-motion animated film since The Nightmare Before Christmas and Wallace & Gromit. The setting was beautiful. The story is very funny and very dark edge at the top. The characters are way awesome. George Clooney plays the best voice of Mr. Fox,he does react like Danny Ocean from The Ocean's Trilogy. So does Meryl Streep who voices Mrs. Fox,she's more foxxy like the other films that she done. Bill Murray was better playing as the owner of the tree,well done dude! So I enjoy this movie! It's was done by Wes Anderson who created slow and seriously films like The Royal Tenebaums and The Life Aquatic of Steve Zissou,but that his first independent animated film and it's sure it's great!",
      "review_date": "2010-09-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best animated movie I've seen in a long time!! If you are tired of the typical, soulless animated crap that's out there these days, give this movie a try. Subtle humor, wonderful animation. Great movie. Not perfect, but very enjoyable.",
      "review_date": "2011-01-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Title: fantastic mr. foxPunchline: wild animalsType: animation\n\nScript: an average script. Mr. fox steals the chickens , refrigerated ones and alcohol from some peasants. They hatch a plan to kill fox. Fox obliges his mistake to his wife.Title: fantastic mr. foxPunchline: wild animalsType: animationScript: an average script. Mr. fox steals the chickens , refrigerated ones and alcohol from some peasants. They hatch a plan to kill fox. Fox obliges his mistake to his wife. He says that he is responsible for this and he will do anything to continue this. But mistake goes the other way. His son ash and cousin christopherson plan a secret route to bring back the stolen tail. This brings trouble and christopherson is been kidnapped by the peasants. Now fox and rest need to do save christopherson. What they do? And how they do ? is the rest of the movieExecution: the two questions in the script are perfectly executed. Editing is quick and movie does not lose the tempo. Perfect execution. Nice ending scene. Direction and screenplay: direction is good and narrated perfectly. Screenplay is gripping giving nice mood to the average script.Casting: all the voices for the foxes and expressions by the animals like beavers rats and mice, rabbits are good. Their animation is perfect. Dialogs and action are perfectly synchronized.Music and background score: the music is good. Background score is good during the tractor scene. Gun shots and explosions are reverberating and perfectly engineered.Cinematography: this is the main life to the movie. Nice scenaries , nice cities , nice shops and good camera work. All the scenes are perfectly captured.Editing: very quick and movie has a short running time. Good editing and really works well with the narrative speed.Cgi/ production values: the visual effects ( animation ) are good. Production values are worthy. Entertainment value: a colorful rich treat for young children. With parents spending 90 minutes with them , this movie is a rejoice to watch during weekends. Final analysis: the movie begins with fast paced narration and the first half ends well. The second half has a serious tone to the script and execution is perfect. The climax is good and will cause goose bumps for more to come. Overall the movie is a treat to watchRating: 3.75/5",
      "review_date": "2011-03-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie bored me to the point I almost fell asleep many times during it. The beautiful animation and style can only keep you entertained for so long. The story is just a poor excuse. I am sorry but this movie with the cast and director itThis movie bored me to the point I almost fell asleep many times during it. The beautiful animation and style can only keep you entertained for so long. The story is just a poor excuse. I am sorry but this movie with the cast and director it had should have been much much better.",
      "review_date": "2010-11-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Halfway through this movie is when it hit me: this is terrible. Anderson has taken to laboring over the cuteness and quaintness of his movies that nothing has any meaning or substance. Everything he does is to serve this pathetic inner-childHalfway through this movie is when it hit me: this is terrible. Anderson has taken to laboring over the cuteness and quaintness of his movies that nothing has any meaning or substance. Everything he does is to serve this pathetic inner-child issue that it's simply nauseating. That aside, there's so much dialogue in the Fantastic Mr. Fox, with all of it amounting to nothing, that I was sad afterward that I saw it.",
      "review_date": "2016-11-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "So far, as of writing this short, brief, review, i have only watched 2 of Wes Anderson's Films \"The Grand Budapest Hotel\" and \"Fantastic Mr. Fox\", also a tiny bit of \"Moon-rise Kingdom\" and i have to give all my praise to Anderson's bizarreSo far, as of writing this short, brief, review, i have only watched 2 of Wes Anderson's Films \"The Grand Budapest Hotel\" and \"Fantastic Mr. Fox\", also a tiny bit of \"Moon-rise Kingdom\" and i have to give all my praise to Anderson's bizarre and unique style of filming, it really makes you feel as if your within the film, you are a character, with that out of the way lets began. Anderson's Fantastic Mr. Fox is very different from the tale , yet, still manages to feel the like the original, bizarre i know, while also expanding on such a small, modest, kids tale into an elaborate sophisticated story and character driving thrill ride full of charm and wit, which is all i ever ask for within a film, Charm, Plot, Characters and Wit, when all of these are done with the utmost care and compassion while trying to stay close to the source material yet also breaking it into something more, you know by now that i absolutely adored this film.\r 10/10",
      "review_date": "2014-05-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I didn't have any sort of expectation for this film, but i found considerably disappointing all the same. even with a great animation style the film is hampered by basically everything else.",
      "review_date": "2017-12-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fantastic masterpiece, one of the only movies I still watch like once every year.The witty humor and soundtrack are simply unforgetable, and will make even the grumpiest person laugh out loud",
      "review_date": "2020-05-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fantastic Mr. Fox is perfect. The soundtrack gives me good vibes and the stop motion animation provided a nice change of scenery.",
      "review_date": "2020-05-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Mr. Fantastic just wasn't. The animation was awkward. The famous voices really added zip; they might have been anyone. As to its being a movie for kids: Mighty mixed messages (theft is okay if the victims are creeps?).",
      "review_date": "2009-11-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Being a Wes Anderson fan is not required for this fun and quirky screen adaptation, but enough of his style seeps through for those that are. The story is never too childish and Dahl's source material rich and -frankly- bizarre enough Being a Wes Anderson fan is not required for this fun and quirky screen adaptation, but enough of his style seeps through for those that are. The story is never too childish and Dahl's source material rich and -frankly- bizarre enough to keep adults guessing- with a good amount of near-cussing thrown in too. The stop motion fills the screen with an array of sights that leave the viewer wishing they had a pause button. Be prepared to leave the theater ready to watch it again as this film, like many of Anderson's other movies, will get improve with a second viewing.",
      "review_date": "2009-11-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A highly entertaining film with great visuals.",
      "review_date": "2009-11-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fantastic Mr. Fox is unmistakably a Wes Anderson movie. It may be stop motion animated and based on a classic children's book, but it's as slavish to Anderson's style as Rushmoore or The Life Aquatic. Prime amongst it's qualities is theFantastic Mr. Fox is unmistakably a Wes Anderson movie. It may be stop motion animated and based on a classic children's book, but it's as slavish to Anderson's style as Rushmoore or The Life Aquatic. Prime amongst it's qualities is the familiar off kilter humor and gentle catharsis that made his previous works such essential viewing. Fantastic Mr. Fox is overflowing with charm, impressive animation and belly-rumbling laughs. An excellent film for children and adults alike.",
      "review_date": "2012-06-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fantastic Mr. Fox was actually even better than I imagined it to be. I thought it would lean a lot on the lead voices (George Clooney and Meryl Streep) I think the movie would have done fine with out them (not to say they weren't a greatFantastic Mr. Fox was actually even better than I imagined it to be. I thought it would lean a lot on the lead voices (George Clooney and Meryl Streep) I think the movie would have done fine with out them (not to say they weren't a great finishing touch). With a quirky storyline and witty dialogue, this movie will leave you entertained and satisfied.",
      "review_date": "2011-03-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "We all must admit, we don't usually like stop motion that much, unless it's something Tim Burton. But in this case, it's different. Fantastic Mr. Fox got everything right... the soundtrack, the visuals, the voice cast... it all made thisWe all must admit, we don't usually like stop motion that much, unless it's something Tim Burton. But in this case, it's different. Fantastic Mr. Fox got everything right... the soundtrack, the visuals, the voice cast... it all made this stop-motion movie something that flew into Pixar territory, and in a huge way.",
      "review_date": "2011-04-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A excellent animated movie that I bet pretty much all adults will chuckle or evan laugh out load at. Goerge Clooney and Meryl Streep were really good at voicing mr and mrs fox and definitely the right choice of all the actors and actresses inA excellent animated movie that I bet pretty much all adults will chuckle or evan laugh out load at. Goerge Clooney and Meryl Streep were really good at voicing mr and mrs fox and definitely the right choice of all the actors and actresses in the world to portray them. Bill Murray was also great at voicing the badger. I have watched the film quite a few times and I enjoyed every single one.",
      "review_date": "2011-10-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Wes Anderson is a filmmaker who can run along a bizarre path, stop, look over at some odd detour, contemplate about it, and then keep on running. Fantastic Mr. Fox is Anderson in his purest form, and arguably his most entertaining.",
      "review_date": "2011-08-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "t was definetly a breath of fresh air in originality and it had fantastic visuals. Stop motion has always been one of my favorite art styles and the thing I don't like about it nowadays is that people prefer all slam bam in your face cgt was definetly a breath of fresh air in originality and it had fantastic visuals. Stop motion has always been one of my favorite art styles and the thing I don't like about it nowadays is that people prefer all slam bam in your face cg effects, and nothing organic, and it is getting very old, but when you see something like this it is just fantastic. And this is a dying art to filmmaking, think about it it has been 3 years since another Wallace and Gromit film, and 2 years since a Stop Motion film has had a theatrical release, and thats why I think this is a dying art. I love all the details that are put into the characters, like how the fur on the puppets constantly moves throughout the scenes, plus the voice acting is really, really funny and entertaining. I didn't know who George Clooney was until this movie and im happy it introduced me to him, plus this movie i think has the biggest all star cast ever for a stop motion film, Bill Murray, Adrian Brody, George Clooney, Owen Wilson, even the small part characters have big actors.",
      "review_date": "2011-09-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Funny, this movie is just........different, Fantastic Mr Fox is a good example of how we can find stories in every single element of the nature, but this movies is not another stupid talking animal movie",
      "review_date": "2011-09-26",
      "source": "metacritic"
    }
  ],
  "num_reviews": 134
}