{
  "title": "Notorious",
  "rating": 5.7,
  "release_date": "2009-01-16",
  "genre": [
    "Biography",
    "Drama",
    "Music"
  ],
  "summary": "In just a few short years, Notorious B.I.G. rose from the streets of Brooklyn to become one of the most influential hip hop artists of all time. B.I.G. was a gifted storyteller; his narratives about violent life on the streets were told with a gritty, objective realism that won him enormous respect and credibility. His stories wereIn just a few short years, Notorious B.I.G. rose from the streets of Brooklyn to become one of the most influential hip hop artists of all time. B.I.G. was a gifted storyteller; his narratives about violent life on the streets were told with a gritty, objective realism that won him enormous respect and credibility. His stories were universal and gave a voice to his generation. (Fox Searchlight)… Expand",
  "critic_reviews": [
    "A good film in many ways, but its best achievement is the casting of Jamal Woolard, a rapper named Gravy, in the title role.",
    "Notorious makes the death of Biggie Smalls look like a tragic mistake, instead of the outgrowth of a culture devoted to selling the fantasy of who's the biggest man.",
    "Though there was little surprise by the end--how could there be?--Notorious,' a movie about the life and death of rapper Christopher Wallace (a.k.a. The Notorious B.I.G., a.k.a. Biggie Smalls, a.k.a. Biggie), still managed to stun, unsettle and move me.",
    "Engrossing biopic, throbbing with style and attitude.",
    "Layering his film with the songs that made his subject an icon, Tillman is aware that Biggie connected with his audience because he told stories others instantly understood. Notorious does that, too.",
    "Much closer to Scorsese than \"Scarface,\" Notorious gives a heartfelt yet clear-eyed sendoff to the late Brooklyn rapper Christopher Wallace.",
    "What gives Notorious its staying power is what happens before AND after its hero's death.",
    "The director is a cinematic equivalent of his subject, but a man who was able to reach middle age and examine that culture's good and bad points with a clear, detached mind.",
    "Angela Bassett is great as his strict, single mother; The soundtrack is great, of course, and the ending features moving archival footage of the streets of Brooklyn after Wallace's murder.",
    "For a man apparently making his first film, Woolard carries the movie like a pro. Cross your fingers that this is no fluke, for this guy could be a real comer.",
    "A rock-solid biopic with a foolproof rise-and-fall storyline and a warmly nuanced performance by Jamal Woolard.",
    "Through it all are the rhymes and the music, hugely enjoyable in their own right, and the long, large shadow of Biggie.",
    "Surprisingly and pleasantly unflashy, a straightforward picture that makes a distinction between classiness and bling.",
    "It's the spirit that Biggie Smalls, born Christopher Wallace, put into inventing himself and his music that ignites Notorious, a biopic that sees the flaws in the man but can't help accentuating the positive.",
    "It's an engaging enough story, crisply told, and the lip-synced music scenes in the studio and on stage are brought off in high style.",
    "After 110 minutes of the \"n\" word being deployed with abandon, Biggie vows to renounce it. And just like that a deluxe episode of \"Behind the Music\" turns into an evening at church.",
    "Notorious is like a piece of well-crafted bling. It looks good, and facets of it shine, but behind the gilded facade there's not much there. And what is there can be troubling and retrogressive.",
    "It's not bad enough to walk out on but neither is it good enough to walk into.",
    "Notorious settles into a curious comfort zone; it's half pop fable, half naturalistic docudrama. Not a bad movie, but nowhere near as strong as its soundtrack.",
    "Notorious suffers from biopic-itis, that regrettable tendency to reduce complicated lives to a greatest-hits assemblage of melodramatic highs and agonizing lows.",
    "Notorious, despite its bigger-than-life subject and habit of dripping sex sweat at the most unexpected moments, is rather square.",
    "Bassett as Voletta is her usual captivating self.",
    "For anyone looking for something as real or engaging as Biggie's music -- or a good introduction to it -- will be disappointed by this mediocre celluloid life-after-death.",
    "Like a drunk on a bender, Notorious seems to have given up even trying to moderate its dependence on cliché.",
    "What the picture doesn't do is make sense of the world it tries to depict, or even, truly, depict it. Biggie -- and, for that matter, Woolard -- deserved better.",
    "A fawning bio-pic.",
    "Notorious excels at showcasing Wallace's music and his magnetism as a performer: It fares less well at giving that music a proper context.",
    "Notorious isn't, not even remotely.",
    "The movie leaves us with the sense that, twelve years after Biggie Smalls's death, a lot of people are trying to extract whatever profit or pride they can from the chaotic life of a young man who was, as he well knew, a work in progress.",
    "Juicy, revved-up, semi-satisfying biopic.",
    "Cloyingly, Biggie narrates his tale from the grave. It's a device that feels irksome and condescending.",
    "Absent the actual music, Notorious would be a lot worse."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "An Average Movie, Could have been way better... The dialogue is too cheesy. Too many mistakes in comparison between what happened and the script (like for instance, Biggie doing his freestyle in the year 1990, and with a zoom out you get toAn Average Movie, Could have been way better... The dialogue is too cheesy. Too many mistakes in comparison between what happened and the script (like for instance, Biggie doing his freestyle in the year 1990, and with a zoom out you get to see him standing next to a poster of 2Pac's movie \"Juice\" which was released in 1992)\r There has been too much emphasis on the characters that got me to think that Puff Daddy was an angel and an inspirating machine, with lots of fortune cookie quotes (No Wonder, he's the executive producer). and you get the feeling that 2Pac is nothing but a maniac, trying to turn him into a villain... The relationship between the characters where mysterious, you never get to know what happened between Biggie and Jan... or with Biggie and Faith after his accident. The scene before he was shot was OK, but filled with cheap drama...\r Nevertheless, the actors did a really good job. Angela Bassett aced in her performance as Voletta Williams. Naturi Naughton's portrayal of Lil Kim was really good, Antonique Smith as Faith Hill was a really promising performance. Jamal Woolard did the best he could to try to talk like Biggie..\r In a nutshell, it would have been a way better movie if there was much more investment on a better story! Kinda sad that Antoine Fuqua wasn't chosen to direct this, could have been better with him!",
      "review_date": "2013-10-15"
    },
    {
      "review_title": null,
      "content": "A mixture of a hastily cut together rememberings of The Notorious and Cloverfield. Half of the movie i had no idea what was going on because the camera would be shaking so heavily you weren't sure what was going on. The movement of the A mixture of a hastily cut together rememberings of The Notorious and Cloverfield. Half of the movie i had no idea what was going on because the camera would be shaking so heavily you weren't sure what was going on. The movement of the film seemed like they were only bigs afterthoughts to his life. a cheesy and bad voice over job did what little progression the movie showed. in some of the later scenes you couldn't tell if it was 17 year old christopher wallace or 24 year old B.I.G. overall this movie was just above decent. Definitely not what i wanted to see about one of my favorite rappers.",
      "review_date": "2009-01-18"
    },
    {
      "review_title": null,
      "content": "Don't listen to bullshit about people complaining that Notorious isn't \"historically accurate,\" because they, and the majority of people don't know Biggie the way people like his mother, cousin, close friends, and associates Don't listen to bullshit about people complaining that Notorious isn't \"historically accurate,\" because they, and the majority of people don't know Biggie the way people like his mother, cousin, close friends, and associates did. All of which were integral part in making this film. They presented this film and the story from the best point of view they can, and that is exactly what Biggie went through. Notorious tells the tale of a man following the poor examples of everyone around him in the ghetto, striving to be somebody, and in his final moments where he has a grip on life, is brutally and tragically killed. A few portions of the movie suffer from some poor dialogue or just stale delivery, but it is still good. The funeral scene in particular brought tears to my eyes. The events Voletta Wallace has had to experience are truly horrific. It is blasphemy that suspects of this murder who have hard evidence against them were never brought to justice. Jamal Woolard does a spot-on job as Biggie. When you see how this man normally acts and the transformation he makes to take on this role, it is truly impressive. Angela Basset delivers a powerful performance as Big's mother, and the rest of the cast is mostly just solid talent.",
      "review_date": "2009-01-25"
    },
    {
      "review_title": null,
      "content": "This movie really showed me how a person with real talent can grow up in the worst situations, and still end up at the top, no matter what. 8/10 for Notorious.",
      "review_date": "2009-01-31"
    },
    {
      "review_title": null,
      "content": "Poorly Executed Acting along with Poorly constructed Situations. The Tone of the movie overall was monotonous, along with the tasteless Nudity. This movie is why the notion \"Less is more\" is so Powerful.",
      "review_date": "2009-02-05"
    },
    {
      "review_title": null,
      "content": "all of biggie's hit's were included which is a big plus.some of the acting was good and some bad, just like 8 mile which got mostly rave reviews in it's opening. this movie will open your eyes and inform you about biggie and all of biggie's hit's were included which is a big plus.some of the acting was good and some bad, just like 8 mile which got mostly rave reviews in it's opening. this movie will open your eyes and inform you about biggie and the game. streetsa and industry.",
      "review_date": "2009-04-20"
    },
    {
      "review_title": null,
      "content": "I thought derek luke did a great job playin Puff but Gravy was to shluby to play big,he had no star apeal to me.It was entertaing I liked it.",
      "review_date": "2009-04-20"
    },
    {
      "review_title": null,
      "content": "A bad film.Notorious is bored.",
      "review_date": "2009-01-17"
    },
    {
      "review_title": null,
      "content": "I am a Big Biggie Fan and I know he died at the end but the movie move me so much to tears! He went before his time! I will always love Big Poppa!",
      "review_date": "2009-01-17"
    },
    {
      "review_title": null,
      "content": "The movie Notorious had the worse characters acting the role of the rappers, it was horrible my dad could have played tupac and the film was not detailed at all, the clips that were showed are every day clips you could catch on youtube or The movie Notorious had the worse characters acting the role of the rappers, it was horrible my dad could have played tupac and the film was not detailed at all, the clips that were showed are every day clips you could catch on youtube or bet about biggie. Im a Biggie fan and it didnt make me see the name behind B.I.G. I think puff rushed this film and wouldnt recommend no one to go spend there money and time to see this movie, get on bootleg and I dont support bootleg movies It was horrible.",
      "review_date": "2009-01-19"
    },
    {
      "review_title": null,
      "content": "For an indie-rock fan like myself, insulated from the casual scatology of gangsta rap, east coast/west coast in the early-to-mid-nineties, symbolized Chapel Hill's unsuccessful attempt to usurp Seattle as ground zero in the wake of the For an indie-rock fan like myself, insulated from the casual scatology of gangsta rap, east coast/west coast in the early-to-mid-nineties, symbolized Chapel Hill's unsuccessful attempt to usurp Seattle as ground zero in the wake of the alternative rock explosion. Archers of Loaf's \"Web in Front\"(\"Stuck a pin in your backbone/Spoke it down from there...\") should have been the scene's breakout song that challenged Kurt Cobain for his throne, and put North Carolina, front and center, in the nation's consciousness. Sad for the true believers, Eric Bachmann never was a household name, and never will be. But that's no reason to reach for your revolver and shoot Eddie Vedder, right? Watching \"Notorious\", it all came back to me, the sensational news report about musicians planning hits on each other like street gangs; a scenario that would seemed ludicrous, even for the equally squalid American hardcore scene. While all musical biopics sanitize their subjects, \"Notorious\" seems ill-fitted for the kid gloves treatment, you would think, since the appeal of Christopher Wallace's music was his song-as-documentary approach. \"Notorious\" doesn't keep it real. Save the sentimental scenes with his mother(Angela Bassett) for a Tyler Perry flick. Whitewashing the street out from The Notorious B.I.G.'s soul, robs his music and lyrics of its visceral tableau quality. \"Notorious\" demystifies gangsta rap by refuting the perception that both factions plotted the deaths of their two brightest stars. Gangsta rap, with all its violent imagery, nihilism, and misoginistic notions about women, can only be justified, as the argument is made time and time again by the genre's proponents, that it's a reflection of inner city life. If gangsta rap is not always unequivocally honest, which \"Notorious\" suggests, since the filmmaker absolves Wallace and his entourage from any part in Tupak Shakur's assassination, the two rap artists edge closer to being professional wrestlers, than men who talk and walk. Art imitating life is one thing, but if life is imitating an art that creates the life it purports to be imitating, then the naysayers have a point about rap being a menace to society. The novelty of a dead narrator goes all the way back to Billy Wilder's \"Sunset Boulevard\" when William Holden did the honors, but Shakur fans might be rankled by the B.I.G.'s VO, since the documentary \"Tupac: Resurrected\" used the same tactic.",
      "review_date": "2009-01-23"
    },
    {
      "review_title": null,
      "content": "The movie was wonderful the camera shoots fantastic this movie was done with care the music was great! I give it a 8 very entertaining!!!!!!",
      "review_date": "2009-01-27"
    },
    {
      "review_title": null,
      "content": "The performances are excellent, but as a biography, it seems like the director had too much footage and threw together scenes resulting in a story which only scratches the surface of the title character. Too much is squeezed into an already The performances are excellent, but as a biography, it seems like the director had too much footage and threw together scenes resulting in a story which only scratches the surface of the title character. Too much is squeezed into an already too long two hour time frame. Perhaps a more skillful director could have pulled it all together.",
      "review_date": "2009-04-18"
    },
    {
      "review_title": null,
      "content": "The actor has a resemblance to Biggie, but is missing the lazy eyes. The story leaves out the murders Biggie committed and the movie serves to prop him up as a hero instead of understand the true evil behind the man. That said, evaluating The actor has a resemblance to Biggie, but is missing the lazy eyes. The story leaves out the murders Biggie committed and the movie serves to prop him up as a hero instead of understand the true evil behind the man. That said, evaluating this movie not from a historically accurate lens allows us to see that a good film, with good acting exists on camera. Maybe it should just be fiction.",
      "review_date": "2009-01-16"
    },
    {
      "review_title": null,
      "content": "The actor has a resemblance to Biggie, but is missing the lazy eyes. The story leaves out the murders Biggie committed and the movie serves to prop him up as a hero instead of understand the true evil behind the man. That said, evaluating The actor has a resemblance to Biggie, but is missing the lazy eyes. The story leaves out the murders Biggie committed and the movie serves to prop him up as a hero instead of understand the true evil behind the man. That said, evaluating this movie not from a historically accurate lens allows us to see that a good film, with good acting exists on camera. Maybe it should just be fiction.",
      "review_date": "2009-01-16"
    },
    {
      "review_title": null,
      "content": "The acting was actually very good. It was surprising to me that it actually felt like a great movie that an A List Celebrity would do. Some of the actors and actresses could have done a better job but the main characters were all dead on, The acting was actually very good. It was surprising to me that it actually felt like a great movie that an A List Celebrity would do. Some of the actors and actresses could have done a better job but the main characters were all dead on, especially P. Diddy's depiction, with all the dancing lol.",
      "review_date": "2009-01-22"
    },
    {
      "review_title": null,
      "content": "Actors that played puffy & 2pac were off it seemed. However Jamal Woolard couldn't have portrayed big any better. The movie be a 5 disk season set, but since it is a movie, they did a great job choosing what to put in and take out. Actors that played puffy & 2pac were off it seemed. However Jamal Woolard couldn't have portrayed big any better. The movie be a 5 disk season set, but since it is a movie, they did a great job choosing what to put in and take out. Highly recommend.",
      "review_date": "2009-02-13"
    },
    {
      "review_title": null,
      "content": "A boring passable film on one of the most convtroversal figures of his time, Christopher Wallace, a.k.a. The Notorious B.I.G.",
      "review_date": "2009-05-11"
    },
    {
      "review_title": null,
      "content": "Bad in every way. Bad acting. Bad directing. Bad pacing. Bad dialog. Bad. Bad. Bad.",
      "review_date": "2012-11-13"
    },
    {
      "review_title": null,
      "content": "Good movie, provides an honest look into the life of the Notorious BIG up until his untimely death. While its much better than \"All Eyez On Me\" as it delves into the man Christopher Wallace was and not the hardened rapper he portrayed onGood movie, provides an honest look into the life of the Notorious BIG up until his untimely death. While its much better than \"All Eyez On Me\" as it delves into the man Christopher Wallace was and not the hardened rapper he portrayed on screen, there was still some room for improvement to be had here. The film isn't perfect by any means and I only wish \"All Eyez On Me\" could have been as good as this but that didn't stop me from enjoying it nonetheless",
      "review_date": "2019-12-05"
    },
    {
      "review_title": null,
      "content": "There is some room for improvement in this movie but that didn't keep me from truly enjoying it. I watched this not knowing a thing about the Notorious B.I.G and I did not feel lost at any part in the movie. It is also a movie about musicThere is some room for improvement in this movie but that didn't keep me from truly enjoying it. I watched this not knowing a thing about the Notorious B.I.G and I did not feel lost at any part in the movie. It is also a movie about music that actually contains a good amount of music from that artist. I'm thinking about checking out biggie after watching this movie.",
      "review_date": "2014-08-27"
    },
    {
      "review_title": null,
      "content": "Good casting and soundtrack, but Notorious feels too depressing to be an enjoyable movie after a while. The movie tells the story well, but leans on drama that is almost never fun or cheerful, although the ending was very emotional.",
      "review_date": "2017-01-07"
    },
    {
      "review_title": null,
      "content": "Notorious is famous and infamous at the same time. That's why we should fuse those two words together to form one word even though they'll result in the same title.",
      "review_date": "2016-04-01"
    },
    {
      "review_title": null,
      "content": "The movie is cheap and shallow (with naked scenes to keep your attention for lack of everything else).. the actors don't really look like the people they are acting.. the whole movie feels like a simple cash grab..",
      "review_date": "2020-05-12"
    }
  ],
  "num_reviews": 56
}