{
  "title": "Taken",
  "rating": 7.4,
  "release_date": "2009-01-30",
  "genre": [
    "Action",
    "Drama",
    "Thriller",
    "Crime"
  ],
  "summary": "When his estranged daughter is kidnapped in Paris, a former spy sets out to find her at any cost. Relying on his special skills, he tracks down the ruthless gang that abducted her and launches a one-man war to bring them to justice and rescue his daughter. [20th Century Fox]",
  "critic_reviews": [
    "The beginning is a little slow, but after Neeson starts his hunt and does his best wrath-of-God impression, it doesn’t skip a beat.",
    "Taken moves so fast and with such single-minded, vindictive energy, there's no time for moral ambivalence.",
    "There is no mythology, no irony, no real soul--just a Charles Bronson simplicity about the whole affair.",
    "There's a xenophobic element to Taken's premise, to be sure - the idea that travel, even to Western Europe, isn't safe for Americans, and that foreigners (Albanians, Arabs) are by nature shifty and sinister.",
    "Taken is nonsense, but it's terrifically entertaining nonsense.",
    "I won't tell you Taken is great, but it's great fun.",
    "A satisfying thriller as grimly professional as its efficient hero.",
    "The delirious and sometimes nasty little pleasures that Taken offers don't hinge as much on surprise as they do on the action (which is crisp and fast, with a minimum of computer enhancement) and on the story's unabashedly sentimental underpinnings.",
    "Taken--in the hands of director Pierre Morel (District B13), with Neeson in nearly every shot--works like gangbusters. The Frenchies have made the filet mignon of meathead vigilante movies.",
    "Accomplished if misguided thriller.",
    "If you find the film's xenophobic undercurrents distasteful, take solace in this: Taken was co-written and directed by the Frenchmen responsible for \"District B13,\" so at least the xenophobia is imported.",
    "If there are any \"24\" fans who have wondered what the TV series might be like if Liam Neeson replaced Kiefer Sutherland, Taken provides an opportunity to have that question answered.",
    "Taken shows Mills as a one-man rescue squad, a master of every skill, a laser-eyed, sharpshooting, pursuit-driving, pocket-picking, impersonating, knife-fighting, torturing, karate-fighting killing machine who can cleverly turn over a petrol tank with one pass in his car and strategically ignite it with another.",
    "Taken does have a few things going for it. At the top of that short list is Liam Neeson in the starring role.",
    "Not one to overstay its welcome, this suspenseful tale is an economic exercise in delivering the goods for those who are interested in a two-fisted Liam Neeson vehicle to soak up, bask in, and then leave behind as soon as it's over.",
    "Neeson growls his way through the functional dialogue as an unstoppable killing machine in impressive, cold-eyed style.",
    "A brisk and violent action programmer that can't help being unintentionally silly at times.",
    "In the post-Columbine age, far too many cops' partners have gone un-murdered. And too many unsuspecting daughters have freely traveled abroad, unmolested by foreign fiends. Leave it to the French to give Americans what we didn't realize we were missing.",
    "Propulsively outandish thriller.",
    "However handsomely and efficiently staged, the actual action in this action movie feels immaterial. It’s a foregone conclusion that Mills is going to get his daughter back, no matter what obstacles are thrown in his way.",
    "Might do good business at home and abroad among audiences unconcerned with the finer points of characterization or psychological insight.",
    "Neeson's tormented weariness lends an air of dignity to the film's pulpy, grubby nastiness, but as striking as he is in action-hero mode, the truth is that Taken doesn't need dignity.",
    "Taken's subject matter is too serious for an escapist chop-socky movie, and the sleazy, exploitative tone undercuts the thrills.",
    "You do wonder how this commanding actor (Neeson)--who carries so much more conviction than the plot--felt about delivering the line \"I'll tear down the Eiffel Tower if I have to.\"",
    "Neeson's better than this. You can't watch him here without thinking, Geez, every fight-choreography session could have funded \"Love, Actually.\" This bash-the-door-down action scene likely took as long to film as \"Kinsey.\" That gunfight required more stunts than all of \"Schindler's List.\"",
    "The film promises so much more than it delivers that, by the end, I felt like registering a complaint with the Obama Administration's Consumer Protection squad.",
    "This film isn't an enjoyable martial-arts extravaganza like \"District B-13\" or the \"Transporter\" films.",
    "Taken starts in low gear and almost immediately stalls out.",
    "Cowriters Luc Besson and Robert Mark Kamen (Gladiator) saddle Neeson with indigestible dialogue and preposterous situations.",
    "Taken? You bet.",
    "Don't be taken in by Taken.",
    "A Liam Neeson thriller so lacking in ambition they should have called it \"Paycheck.\""
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Surprisingly well done, and very intense. Liam Neesen does and excellent job playing the role of the action hero. The James Bond franchise should look at this movie and take some pointers.",
      "review_date": "2011-02-16"
    },
    {
      "review_title": null,
      "content": "Taken is \"slow\" at the beginning FOR A REASON. It must make you CARE about the man's daughter and the relationship with the father. Otherwise you won't be invested in the outcome. How can these critics not realize this? Taken is Taken is \"slow\" at the beginning FOR A REASON. It must make you CARE about the man's daughter and the relationship with the father. Otherwise you won't be invested in the outcome. How can these critics not realize this? Taken is NOT about a former CIA agent rescuing his daughter. That's the location. It's really about an estranged parent and the lost love of a child and not giving up no matter how hard it is to repair that. Saving your bond with your child is tough but worth it. C'mon movie critics should know that!",
      "review_date": "2010-02-17"
    },
    {
      "review_title": null,
      "content": "Could have been a lot better. The first half is really engaging but the movie loses steam going into the second half. The ending could have been more rewarding, too.",
      "review_date": "2013-01-24"
    },
    {
      "review_title": null,
      "content": "Are these \"critics\" out of their minds? I'm not really in the mood of writing a review after metacritic turned down my last review saying the film wasn't out yet when it had already been out in the UK, so I'm not going into Are these \"critics\" out of their minds? I'm not really in the mood of writing a review after metacritic turned down my last review saying the film wasn't out yet when it had already been out in the UK, so I'm not going into detail, but Taken was just as good as, if not better, than any of the Bourne films. Neeson was absolutely awesome as always, and it provided some of the best action (non-stop) of 2008. Brilliantly shot, and the story actually stayed quite unteresting, but the film stayed true to it's roots, a hard as nails action flick in which Liam Neeson tares apart anything with legs. I LOVED this film, please watch it. Unless you're a stuck up snob who tries to pride himself among watching independent films and only agreeing with metacritic's review scores, and not taking the time to sit back, relax, and enjoy a film, then watch this and you wont regret doing so.",
      "review_date": "2009-01-30"
    },
    {
      "review_title": null,
      "content": "Liam Neeson displayed a very deep, very dangerous man in this intense thriller directed by Pierre Morel (From Paris With Love, District B13). The story takes you in from the first scene. Hence the title: Taken. Liam Neeson plays Bryan Mills,Liam Neeson displayed a very deep, very dangerous man in this intense thriller directed by Pierre Morel (From Paris With Love, District B13). The story takes you in from the first scene. Hence the title: Taken. Liam Neeson plays Bryan Mills, a former spy with very deadly, very stealth, and very deadly skills that make him a straight up nightmare to people involved in dirt, scum, kidnapping rings, drugs etc. When his daughter and her best friend take a trip to Paris to follow rock group U2 on their Europe tour, things go terribly wrong and the two young girls are kidnapped and taken into a seedy underworld of prostitution and drugs. Mills knew that it was a bad idea the whole time, but his ex-wife played by Famke Janssen encourages the trip to let her daughter be free and see the world. Neeson engages in a personal mission to get his daughter back, a process that he is willing to stop at nothing for.-Taken was directed really well and has some pretty good acting. The super-glue of the film was in fact the tense story. Overall 'Taken' was a very original and interesting story, and it ultimately proves that you do not want to **** around with Liam Neeson, especially if it involves his daughter! Very good movie.",
      "review_date": "2010-09-22"
    },
    {
      "review_title": null,
      "content": "Screw the critics - I loved it. Get's into the story quick and doesn't let up. Give me this over and over rated James Bond movie any day.",
      "review_date": "2009-01-31"
    },
    {
      "review_title": null,
      "content": "Great action - not for the bleeding hearts who mostly review movies.",
      "review_date": "2009-01-30"
    },
    {
      "review_title": null,
      "content": "Fun flick. Just what you would expect. 1 and 1/2 hours of *ss-kicking.",
      "review_date": "2009-01-31"
    },
    {
      "review_title": null,
      "content": "First of all, the drawbacks. I know I hate to do this, but there was a few things wrong with the film. For one thing, it was slightly predictable because I didn't think this film would end with something bad happening. Everything's good untilFirst of all, the drawbacks. I know I hate to do this, but there was a few things wrong with the film. For one thing, it was slightly predictable because I didn't think this film would end with something bad happening. Everything's good until the ending, it just sort of fizzles out. Next, it would be pretty exaggerated that someone would be able to rescue someone from a human trafficking group in only a few days. The pacing was a bit thin on the ground, and I also think the girls were portrayed as screechy, weepy, able to believe anything anyone says and blab everything to someone they've just met. Now that's over and done with, there's a few good points I'd like to say. It tackled a very important issue, and, even if it were over exaggerated, that does happen in the world, so it was quite brave to tackle this kind of issue. I think the violence was the least of my problems, and it was thrilling to see Liam Neeson do a bit of ****-kicking because he definitely looked suited for the role. I loved the relationship of his daughter and him, which made me hate the step-father and mother more (what an **** hole and a **** Generally it was a entertaining film, it just needs a bit more work to fix the predictable and confusingly paced storyline, although I think the critics have been a little harsh on what I call an OK film.",
      "review_date": "2012-03-04"
    },
    {
      "review_title": null,
      "content": "Finally saw the root of many memes! :D What can I say.. Thrilling action movie with of course some disadvantages like poor dialogues, underdeveloped history andd not so good ending. But beyond that, Taken is great.",
      "review_date": "2018-07-02"
    },
    {
      "review_title": null,
      "content": "Don't believe these morons (critics), Taken is an overall great movie. The pacing is perfect, with never a dull moment or long, drawn out dialogue scene. Neeson is entirely believable, especially if you are familiar with the problems of Don't believe these morons (critics), Taken is an overall great movie. The pacing is perfect, with never a dull moment or long, drawn out dialogue scene. Neeson is entirely believable, especially if you are familiar with the problems of human trafficking. Can't wait to get this on Blu-ray.",
      "review_date": "2009-02-02"
    },
    {
      "review_title": null,
      "content": "The problem is people are comparing this to other revenge movies. When simply this movie is all about an endless sacrifice and the power and emotion behind this makes you realise that family is the most important thing of all. I related to The problem is people are comparing this to other revenge movies. When simply this movie is all about an endless sacrifice and the power and emotion behind this makes you realise that family is the most important thing of all. I related to this movie so much as I have a daughter and felt the real emotion. Amazingly acted and one of the best character relationships I've seen in a movie.",
      "review_date": "2009-02-02"
    },
    {
      "review_title": null,
      "content": "Very good movie. Worth the money. It has a very good story line and keeps you on the edge of your seat. The movie starts off great and continually moves up the ladder.",
      "review_date": "2009-01-31"
    },
    {
      "review_title": null,
      "content": "I highly recomend this movie, especialy if you were disipointed by the last James Bond film. I find Neeson's character more comelling than Bond because he's not in it for the beautiful women, he's in it to save his family.",
      "review_date": "2009-01-31"
    },
    {
      "review_title": null,
      "content": "Solid action all the way through. Neeson does a great job in this film.",
      "review_date": "2009-01-30"
    },
    {
      "review_title": null,
      "content": "A good action film, worth the watch. Liam's Neeson puts in a decent performance throughout but I was let down by the weak ending.",
      "review_date": "2009-02-02"
    },
    {
      "review_title": null,
      "content": "I read the critics' reviews for Taken before heading to the theater, and they almost dissuaded me.  However, I thoroughly enjoyed the movie.  Sure, it lacked the psychological pins and needles that every movie these days must walk uponI read the critics' reviews for Taken before heading to the theater, and they almost dissuaded me.  However, I thoroughly enjoyed the movie.  Sure, it lacked the psychological pins and needles that every movie these days must walk upon before being branded as \"watchable\", but I liked that.  It was elegantly simple.  It didn't try to be too complicated.\rGenerally speaking, movies of that nature really are a bore, but Taken pulled it off very well.  It wasn't a plot involving Russian conspiracy, or aliens, or betrayal by the American government.  It was about a retired CIA field agent who, with all of his skills, can't seem to manage a successful life.  But he puts those skills to use to get his daughter back, simply because he's a dedicated father.  That's it.  Why do movies have to be taken so seriously these days?\rSee Taken if you like Liam Neeson, and you enjoy just having a good time watching a movie.  Avoid it if you prefer to have to unravel a large puzzle to get to your coq au vin.",
      "review_date": "2009-03-03"
    },
    {
      "review_title": null,
      "content": "You get what you expect. Liam is an awesome action hero. I don't expect high review scores by the newspapers but people will like it.",
      "review_date": "2009-01-31"
    },
    {
      "review_title": null,
      "content": "It is absolutely, positively absurd that critics are not giving Taken much better reviews. (48). It a really good story, well acted and directed and the viewer cares about the characters-which is rare in a film. Dark Knight an 82, Gran It is absolutely, positively absurd that critics are not giving Taken much better reviews. (48). It a really good story, well acted and directed and the viewer cares about the characters-which is rare in a film. Dark Knight an 82, Gran Torino a 72 and Taken a 48? I don't think so.",
      "review_date": "2009-01-31"
    },
    {
      "review_title": null,
      "content": "Could only have been better if instead of Albanian bad guys it was Wall Street Bankers! Gets your mind off everything!!!",
      "review_date": "2009-01-31"
    },
    {
      "review_title": null,
      "content": "Great movie although a little too short, leaving one longing for more.",
      "review_date": "2009-01-31"
    },
    {
      "review_title": null,
      "content": "Fantastic movie. I will start reading more of the users review and much less the of the critics review. I was not expecting much as the critics score 50. But the movie was quite a suspense and I shook from the beginning to the end. The Fantastic movie. I will start reading more of the users review and much less the of the critics review. I was not expecting much as the critics score 50. But the movie was quite a suspense and I shook from the beginning to the end. The actors were convincing in their role with the only exception of the daughter. Liam Neeson is superb. hopping theaked qued on my seat from the beginning to the end. comments.",
      "review_date": "2009-03-11"
    },
    {
      "review_title": null,
      "content": "Liam Neesen makes a convincing action hero with a \"particular set of skills\" in this wisp on an action film.  Things move along at a rapid pace and the outcome is never in doubt which makes for a tidy movie going experience.  Still, a littleLiam Neesen makes a convincing action hero with a \"particular set of skills\" in this wisp on an action film.  Things move along at a rapid pace and the outcome is never in doubt which makes for a tidy movie going experience.  Still, a little bit of complexity and a touch of emotional depth would have helped to keep this meager revenge fantasy from fading almost instantaneously from memory.",
      "review_date": "2013-01-13"
    },
    {
      "review_title": null,
      "content": "This movie is great. Liam Neeson did an awesome job, but there were a few cheesy parts / parts with poor dialogue that could have been done better. It was not a fault of the actors and I feel like they all played it out very well. Also thisThis movie is great. Liam Neeson did an awesome job, but there were a few cheesy parts / parts with poor dialogue that could have been done better. It was not a fault of the actors and I feel like they all played it out very well. Also this is partially due to it being a new series. They had to start somewhere, even if it meant a very simplistic concept / plot. If you're looking for some interesting action scenes you will probably enjoy the movie overall. Sort of an underdog to the 007 movies, but I am excited for Taken 2 and I feel like if they play their cards right they can make Taken a bit more distinguished.",
      "review_date": "2012-06-27"
    },
    {
      "review_title": null,
      "content": "I really didnt know why I liked the movie as much as I did until I relized that it was Liam Neeson's performance that took this film to the next level. The action is great, the plot is interesting but somewhat generic compared to other actionI really didnt know why I liked the movie as much as I did until I relized that it was Liam Neeson's performance that took this film to the next level. The action is great, the plot is interesting but somewhat generic compared to other action films, and the cast is solid. Totally worth watching.",
      "review_date": "2012-01-20"
    },
    {
      "review_title": null,
      "content": "It's got all the attributes of a guilty pleasure - excitement, some undeniably enjoyable scenes and the absence of what it needs to be more memorable and more substantial.",
      "review_date": "2012-10-15"
    },
    {
      "review_title": null,
      "content": "Taken doesn't bring much to the table.\rThe movie is paced well, the story if fine, and the action is lackluster. It mainly is plagued with an extremely simple plot combined with a very predictable outcome. An okay action flick.",
      "review_date": "2013-11-16"
    },
    {
      "review_title": null,
      "content": "I definitely think Taken deserves a 65 or even 70 instead of 50 ! The film is very touching, with Liam Neeson playing a loving father who is willing to do anything to rescue his daughter no matter how wrong and cruel those things are. That isI definitely think Taken deserves a 65 or even 70 instead of 50 ! The film is very touching, with Liam Neeson playing a loving father who is willing to do anything to rescue his daughter no matter how wrong and cruel those things are. That is what makes this movie unique, for it is just 30% an action movie in my opinion. The remaining 70% goes to the father's complicated yet determined internal feelings as he is on the way to kill every bad guy responsible for his daughter's abduction.",
      "review_date": "2014-01-18"
    },
    {
      "review_title": null,
      "content": "Pretty fun and thrilling movie is violent. Liam Neeson is great in the film and the movie is very fun. The plot is pretty stupid but Liam Neeson doing his bad-ass job is always entertaining.",
      "review_date": "2015-05-18"
    },
    {
      "review_title": null,
      "content": "Liam Neeson makes a surprisingly convincing one-man mean machine in \"Taken.\"\r Onetime Langley grunt Bryan Mills (Neeson) has moved to Los Angeles to be near his spoiled 17-year-old daughter Kim (Maggie Grace), now embedded in a world ofLiam Neeson makes a surprisingly convincing one-man mean machine in \"Taken.\"\r Onetime Langley grunt Bryan Mills (Neeson) has moved to Los Angeles to be near his spoiled 17-year-old daughter Kim (Maggie Grace), now embedded in a world of luxury since his ex-wife Lenore (Famke Janssen) married rich businessman Stuart (Xander Berkeley). When some ex-CIA pals offer him a night’s work bodyguarding a singer (Holly Valance), it’s clear Bryan has lost none of his Jason Bourne-like skills when he saves the diva from an attempted slaying.\r Under pressure from Lenore, Bryan reluctantly agrees to let Kim go on a Euro trip with schoolfriend Amanda (Katie Cassidy). But when both girls are kidnapped by evil Albanians within minutes of their arrival, Bryan hops one of Stuart’s private jets to Paris to find her. He reckons he has 96 hours before Kim ends up a drug-addicted lump of white meat.\r Besson alum Pierre Morel, who was d.p. on “The Transporter” and previously helmed 2004’s futuristic actioner “District B13,” wisely doesn’t give the viewer any time to ponder the string of unlikely coincidences in the script by Besson and regular scribe Robert Mark Kamen. From the actual kidnapping — breathlessly staged with Kim actually on the phone with dad — to Bryan arriving in Paris and immediately causing a pileup outside the airport, pic has the forward, devil-may-care momentum of a Bond movie on steroids.\r With grudging help from former French intelligence op Jean-Claude (Olivier Rabourdin) and an Albanian translator (Goran Kostic), Bryan discovers and then trashes the baddies’ ramshackle brothel prior to tracking down kidnapper Marko (Arben Bajraktaraj) and his gang. He then learns Kim has been sold in a high-class auction arranged by a certain Patrice St. Clair (Gerard Watkins) for — natch! — Arab clients.\r Interventionist politics of the movie, which plays like “Rambo in Paris,” hardly bear thinking about, but Neeson growls his way through the functional dialogue as an unstoppable killing machine in impressive, cold-eyed style. For a thesp now in his mid-50s, he handles the niftily edited, bone-crunching action way better than his scenes as a sappy, devoted father. Other thesps simply register as evil gun-fodder or script cutouts (including a wasted Janssen), with only Rabourdin suggesting anything like a real character.\r Widescreen package is technically slick at all levels, and ditto the action choreography, in a cartoonish way.",
      "review_date": "2016-04-03"
    },
    {
      "review_title": null,
      "content": "The movie is surprisingly good if you look at decent standards. However if you think harder, you would suspect that the movie's a kinda bit... shallow?",
      "review_date": "2011-09-25"
    },
    {
      "review_title": null,
      "content": "Thought it was excellent! Especially 'i will find you scene'. Maybe you got to be a parent to understand it!",
      "review_date": "2009-12-03"
    },
    {
      "review_title": null,
      "content": "I like Liam Neeson. I like Luc Besson. I even like Pierre Morel and thought his District B13 was great fun. But this? No, not so much. \"I'll tear down the Eiffel Tower if I have to\" and such dialogue was worse than any fingernails on I like Liam Neeson. I like Luc Besson. I even like Pierre Morel and thought his District B13 was great fun. But this? No, not so much. \"I'll tear down the Eiffel Tower if I have to\" and such dialogue was worse than any fingernails on the chalkboard and the ignorant xenophobia that's framed as paternal love is so ridiculous it hurt. Had they played up the camp aspect of all this crap it might have been more enjoyable. As it is, it just plays to the myopic Middle American mindset that equates \"foreign\" with \"evil\", shows an older actor pathetically attempting ",
      "review_date": "2009-02-16"
    },
    {
      "review_title": null,
      "content": "\"Taken\" is an insult to the intelligence of the viewers and the star of the movie. The action sequences are just as unbelievable as the other events in the script.",
      "review_date": "2009-02-09"
    },
    {
      "review_title": null,
      "content": "Exceptional!! Taken is the most adrenaline pumping, action packed thriller I've seen in awhile. Taken stars Liam Neeson as Brian Mills an ex-black op's agent who while trying to reconnect with his estranged daughter allows her to Exceptional!! Taken is the most adrenaline pumping, action packed thriller I've seen in awhile. Taken stars Liam Neeson as Brian Mills an ex-black op's agent who while trying to reconnect with his estranged daughter allows her to go to Paris for some fun and relaxation away from home. But as soon as they get there she is kidnapped by a group of men who are involved in human trafficking. Now Brian has less than 48 hours to find her or she's gone forever. Taken is one of the most well made movies to come out this year, it's an amazing thrill ride that you cant miss. I very highly recommend this movie.",
      "review_date": "2009-01-30"
    },
    {
      "review_title": null,
      "content": "Utterly and completely awful. Taken trips along, fueled only by Liam Neeson's passable performance. To say Neeomson's performance is anything but aweful is to say a lot though seeing as the script was like that of a D grade Utterly and completely awful. Taken trips along, fueled only by Liam Neeson's passable performance. To say Neeomson's performance is anything but aweful is to say a lot though seeing as the script was like that of a D grade straight to DVD thriller. More disturbing still was the definite xenophobic vibe that oozes from this peice of tripe. If the Bourne movies (which I actually quite admire) and Hostel were to meet and produce an ungodly bastard child, he would resemble this.",
      "review_date": "2009-03-17"
    },
    {
      "review_title": null,
      "content": "The most xenophobic movie I've ever had the misfortune to see. There is one part where he shoots a person for being French, how does this get released?",
      "review_date": "2009-03-03"
    },
    {
      "review_title": null,
      "content": "Taken is a surprise in the fact that  it's enjoyable on a lot of levels most notably in it's main character and it's action sequences which were both well done and Liam Neeson is really on top form for both. the film has excellentTaken is a surprise in the fact that  it's enjoyable on a lot of levels most notably in it's main character and it's action sequences which were both well done and Liam Neeson is really on top form for both. the film has excellent cinematography  and the plot while engaging suffered from having a lot of aspects kind of rushed and not fully explored. i also think the film could have used a more bond style villain to seem like a challenge to Bryan mills though that may have decreased the films realistic tone. that being said it was a film that is a great turn off you're brain and just enjoy feature and i would still place it as a possible recommendations over a lot of the large amounts of action films on offer nowerdays",
      "review_date": "2015-01-06"
    },
    {
      "review_title": null,
      "content": "This film was missing kick the crap out of everyone who gets in your way action. Many will say that it was not needed but I think that thing makes this type of movie much better. Liam Neeson's acting was nice, loved it. But there was aThis film was missing kick the crap out of everyone who gets in your way action. Many will say that it was not needed but I think that thing makes this type of movie much better. Liam Neeson's acting was nice, loved it. But there was a problem with the story, it was too simple. The story needed to be more powerful. Also, the character development was also not done nicely. They should have done the character development seeing that the sequels are gonna come. Overall, you will enjoy the film but it's not for hard-core action fans.",
      "review_date": "2020-08-28"
    },
    {
      "review_title": null,
      "content": "It's passable. You know the movies where 10 bad guys are shooting at the hero and nobody hits him? That's this one. Repeatedly. How bout the movie where everyone tries to kill the hero, then just when they got him, they tie him up, It's passable. You know the movies where 10 bad guys are shooting at the hero and nobody hits him? That's this one. Repeatedly. How bout the movie where everyone tries to kill the hero, then just when they got him, they tie him up, wait till he wakes up, says some fancy words, and then say \"kill him!\". Yep. Got that too. Watch one of the Bourne movies again instead. They're much better.",
      "review_date": "2009-05-12"
    },
    {
      "review_title": null,
      "content": "Laughable action sequences, laughable story. avoid at all costs!",
      "review_date": "2009-06-08"
    },
    {
      "review_title": null,
      "content": "Liam Neeson does an exceptional job in this film. Love the way he bashes bad guys faces in while only breaking slightly more of a sweat then Bond. Good movie. Well worth your time",
      "review_date": "2012-05-19"
    },
    {
      "review_title": null,
      "content": "Taken represents a wierd oblique encouragement for western authorities to 'take the gloves off' when dealing with middle eastern threats, represented here by Albanian slave traders with a crescent moon tattoos. The other enemies, of courseTaken represents a wierd oblique encouragement for western authorities to 'take the gloves off' when dealing with middle eastern threats, represented here by Albanian slave traders with a crescent moon tattoos. The other enemies, of course are the corrupt, and decadent French, who for some sin or other are characterised as ammoral devils who would turn a blind eye on western girls being sold into sexual servitude for just a few Euros. Somewhat wierd for a movie that cites a Frenchman in its production. Sadly fact is usually more amazing than fantasy and this movie is no exception. Something based on the real plight of Eastern European women being sold into forced prostitution could have been far more compelling. This movie soon degenerates into a sadistic tirade of the hero beating up and killing dozens of run-of-the mill bad guys. The movie has no pauses, no moments of realisation, nothing interesting or scary. No good dialogue, nothing but the celebration of the killing prowess of a professional killer. Liam Neesen dials in a very unenthusiastic performance looking very much like an actor who lost his wife in a skiing accident, with no interest in the slightest in making a movie glorifying murder, going through the motions because he will get a paycheck so that he can go back and spend quality time trying to live as happily as he can in the shadow of his loss. As far as I can see the whole thing is some kind of propaganda effort trying to reinforce negative stereotypes. The action is the same crap you see in almost every American movie these days. Fight scenes where the hero is good at ramming random household objects up the noses and into the brains of certified 100% guaranteed 'bad guys' who deserved to die. The audience is thus invited to relish and glorify a whole bunch of romantically enhanced butchery, and feel great when the good duy inevitably walks into the sunset, without even bruised knuckles. Since practically everything made in America is made to exactly the same recipe, taken is your standard contemporary American garbage with a Frenchman embarrassing himself in the credits. I'm sure Albanian slave traders are very nasty indeed. A movie that dealt into the hows and whys of that would have been much better than this crap. Don't movie makers understand that incessant violence dilutes the dramatic power of violence. The fear of death is worse than death. There are a thousand creative cliches that advice film makers on what constitutes narrative power. All yellow and red reviews indicate signs of intelligence. Green constitute the mob. Fools all.",
      "review_date": "2012-10-04"
    },
    {
      "review_title": null,
      "content": "It's a cross between Frantic and the Bourne movies, but by the Transporter Team.\rI suppose there's some appeal in seeing kidnapping scumbags get their come-uppence, but there's no real tension or intrigue. He goes to France, he follows theIt's a cross between Frantic and the Bourne movies, but by the Transporter Team.\rI suppose there's some appeal in seeing kidnapping scumbags get their come-uppence, but there's no real tension or intrigue. He goes to France, he follows the trail with improbable ease, he kills EVERYONE, often with just a quick flick of the wrist. He gets knocked on the head and captured once...3 minutes later he kills them all too.\rEntertaining enough guff, but it's nothing more than a very daft action movie with some nasty scenes and a reasonably respectable lead actor.",
      "review_date": "2011-01-10"
    },
    {
      "review_title": null,
      "content": "Influenced by the Bourne films, but unlike those, fails to make sense of the way a professional would handle himself in the given situation. Neesons character dives suicidally head-first into problems which would require thinking and Influenced by the Bourne films, but unlike those, fails to make sense of the way a professional would handle himself in the given situation. Neesons character dives suicidally head-first into problems which would require thinking and calculation, and instant gratification follows. You would expect more from such quality actors and writers. (The personal issue at hand can't excuse the total lack of sensible behavior. If that were the case, the movie would negate itself). If you replace Neeson with Steven Seagal, it would accentuate what this movie really is: A mediocre action-flick.",
      "review_date": "2009-02-01"
    },
    {
      "review_title": null,
      "content": "This movie is utter garbage, now i knw why d name \"liam neeson\" rang no bells...\"Taken\" definitli topped mi list of crappiest movies of 2008.i mean seriosly,i was nt d list bit thrilled...nd d 1 liners \"this is nt a threat,wen i get u it willThis movie is utter garbage, now i knw why d name \"liam neeson\" rang no bells...\"Taken\" definitli topped mi list of crappiest movies of 2008.i mean seriosly,i was nt d list bit thrilled...nd d 1 liners \"this is nt a threat,wen i get u it will b very slow nd it will hurt\".(wit unbelievable sarcasm)..oh no plzz,im so scared,im literally shaken in my boots....wat a joke.HORRIBLE ACTING,Avoid dis movie",
      "review_date": "2009-02-04"
    },
    {
      "review_title": null,
      "content": "It's one of those. And a mediocre one at that. The genre wears thin. Maybe 2 or 3 surprises, but if that's all it has to offer beside Liam Neeson then it's not enough for me.",
      "review_date": "2009-02-01"
    },
    {
      "review_title": null,
      "content": "This movie was amazing. Like most critics say, its a little slow at first, but once Neeson starts his hunt, it sky rockets.",
      "review_date": "2009-02-01"
    },
    {
      "review_title": null,
      "content": "I have no idea why the (so-called) critics have panned this movie so much, it really isn't anywhere near as bad as they're making out. You've seen it all before in various other revenge movies, but it has enough new ideas to I have no idea why the (so-called) critics have panned this movie so much, it really isn't anywhere near as bad as they're making out. You've seen it all before in various other revenge movies, but it has enough new ideas to hold interest and enough of it's own style to keep things fresh. It's a slowish start but barely worth a mention as once the action starts it's non-stop, but this is possibly also the films weakest point. Everything just seems to happen with little regard for pacing, plot direction or character building. Every move Liam Neeson takes seems to work out and give him yet another lead, you never get the feeling that the film will have anything other Hollywood ending. Along with a few cheesy moments and a bit of bad acting the main body of the film feels rushed. That said though, it's a good watch, with the girlfriend or a group of friends everyone will enjoy this. Neeson gets you behind him and you find yourself egging him on to add to the growing tally of corpses left in his wake. More deep than say Transporter, not by much though but it feels less aimed at teens. Definite one to watch.",
      "review_date": "2009-02-01"
    },
    {
      "review_title": null,
      "content": "A lot of action, but not much for excitement. Can't hold a candle to any of the \"Bourne\" movies, although it's shot in that style. Neeson is good, his character is invincible, and he tracks down the bad guys in unbelievable A lot of action, but not much for excitement. Can't hold a candle to any of the \"Bourne\" movies, although it's shot in that style. Neeson is good, his character is invincible, and he tracks down the bad guys in unbelievable fashion. That is all to easy to be believed. A dismal movie, with plenty of action...",
      "review_date": "2009-02-05"
    },
    {
      "review_title": null,
      "content": "The movie starts out slow, but once Liam Neeson starts his hunt, it never slows down, and Liam Neeson, along with the rest of the cast is excellent.",
      "review_date": "2009-02-01"
    },
    {
      "review_title": null,
      "content": "Really a 9.5, but give it the extra 1/2 point for the pure fun of watching this guy work. Sure, it has its weaknesses: Famke plays an unattractive gold-digging, irrational shrew; Neeson is not aging well; Maggie Grace is unspectacular; but Really a 9.5, but give it the extra 1/2 point for the pure fun of watching this guy work. Sure, it has its weaknesses: Famke plays an unattractive gold-digging, irrational shrew; Neeson is not aging well; Maggie Grace is unspectacular; but the bad guys are all well-cast and it is delightful to watch Neeson work is way through one scumbag after another. What fun to watch him take on all the Eastern European mob trash, and the misogynists on the vulgar sheik's payroll. Do shiksas and other innocent young ladies really get collected and turned out by thugs?? Probably. Do construction sites really have brothel trailers supplied by the underworld in cahoots with crooked cops?? Who knows, maybe so. Can one man turn that slave trade upside down?? Probably not. But TAKEN is clear about who the good and innocent folks are, and who the evil exploiters are, and allows the hero to clean up the entire underbelly of Paris in the process. Other than a few problems with plot, weak dialog, and poor casting, TAKEN is a fun ride. Any reviewers who have a problem with this film are not worthy of being heard, they are from some implausible PC planet.",
      "review_date": "2009-02-05"
    },
    {
      "review_title": null,
      "content": "The most shocking thing in this movie is how it",
      "review_date": "2009-01-31"
    },
    {
      "review_title": null,
      "content": "On what was supposed to be a routine detail assignment, Bryan Mills(Liam Neeson), recently emasculated by a bout of birthday present one-upmanship, gets one ball back after he successfully defends a pop diva from her would-be assassin. He On what was supposed to be a routine detail assignment, Bryan Mills(Liam Neeson), recently emasculated by a bout of birthday present one-upmanship, gets one ball back after he successfully defends a pop diva from her would-be assassin. He gets the other ball back when Kim(Maggie Grace) is kidnapped by a sex-trafficking ring, in which this former spy, to his good fortune, gets to reassert himself as the alpha male in his daughter's eyes, should he afford her the opportunity to ride the horse that trumped the karaoke machine. Jokingly referred to as Rambo by a friend, the name not only suits his one-man army stronghold tactics, but the filmic context in which he does battle, as well. There's a war in France, a war against the sex industry, that surreptitously makes reference to the Indochina War, in which France and Vietnam are forever intertwined. As Ted Kotcheff's \"First Blood\" was a wish-fulfillment movie about saving POWs, \"Taken\" also serves the same function, since the filmmaker, like the men who helmed the Rambo franchise, puts things into order by means of reductionism. In stark contrast to \"Taken\", there is Lukas Moodyson's fatalistic worldview of the same topical issue, the sobering \"Lilya 4-Ever\", where a Polish girl gets sexually exploited with no hope for a familial savior to emancipate her. For all its slick pacing and snappy action; in other words, its entertainment value, there's a distinctly unpleasant air to this whole enterprise, since \"Taken\" seems to be predicated on the father getting his ego back, in deference to the pain and humiliation of indentured women. His daughter's kidnapping rejuvenates him; his sac is restored to full capacity. Bryan now seems ready to f*** the horse Kim's stepfather rode on. \"Taken\" is a revenge fantasy against ex-wives who remarry richer, more accomplished men. Kim's mom(read:\"the bitch\") is punished for letting their daughter go globe-trotting in Europe.",
      "review_date": "2009-01-31"
    },
    {
      "review_title": null,
      "content": "\"I'll tear down the Eifle Tower if I have to!\" Not as thrilling as the commercial, but still enjoyable. Unintentionally funny, it's entertaining for a forgiving audience. http://www.criticalmass.fcpmainline.com",
      "review_date": "2009-02-26"
    },
    {
      "review_title": null,
      "content": "There were about 3 good minutes in this otherwise awful, derivative movie. Wait until it hits cable.",
      "review_date": "2009-03-15"
    },
    {
      "review_title": null,
      "content": "Taken produced by same French team that made the Transporter flicks, Clueless mother lets her daughter go on a trip to Europe with only another girl who just supposedly turned 18. They get kidnapped by an Albanian ring who specialize in Taken produced by same French team that made the Transporter flicks, Clueless mother lets her daughter go on a trip to Europe with only another girl who just supposedly turned 18. They get kidnapped by an Albanian ring who specialize in white slavery, etc. Liam Neeson, the father, is an ex some kind of special op's for the government. In other words, he knows how to kick ass. He goes over to Paris and proceeds to become a one man Albanian but kicking crew. I believe he kills or maims half the Albanians in Paris before he gets his daughter back! If you have ever seen Mystery Science Theater, with the wise ass robot making fun of the proceedings , then that was I watching this flick. Neeson does a great acting job keeping a straight face throughout. Lots of silly action and over the top fighting and violence. Give it a 2 for the amusement factor.",
      "review_date": "2009-04-18"
    },
    {
      "review_title": null,
      "content": "I thought this movie was pretty fun to watch. Neeson's character is very inspirational.",
      "review_date": "2009-05-11"
    },
    {
      "review_title": null,
      "content": "Not a realistic movie, the old agent taking on the whole gang is impossible for me. A boring plot.",
      "review_date": "2009-05-27"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nIf you are looking for a Bourne rip-off with logic, you are in the wrong area. If you're look for a fun action-thriller, you are in the right place.If you even try to incorporate logic, you're gonna hate it. Because Neeson takes on 10 bad guys firing at him several times in the movie and he only gets hit once in hit abdomen. And it's predictable, but that doesn't take away from this fun exciting movie. This is Neeson's show. he is in every scene and he pulls it off perfectly. Maggie Grace plays her role great. Overall, if you like fun and suspenseful movies, you will like Taken",
      "review_date": "2010-09-06"
    },
    {
      "review_title": null,
      "content": "I never saw this in theaters, or saw it when it first came out on DVD. My friend gave me a boot-leg of this, so I didn't have to spend I dime on it. I never bothered with it till I saw the trailer of a sequel to this movie in theaters, so II never saw this in theaters, or saw it when it first came out on DVD. My friend gave me a boot-leg of this, so I didn't have to spend I dime on it. I never bothered with it till I saw the trailer of a sequel to this movie in theaters, so I was thinking that I should just watch this movie and get it over with. I just watched it, and I am completely shocked about how well done this was. Liam Neeson is one of my favorite badass actors ever since he was Ra's Al Ghul in \"Batman Begins\". All I need to say is that he is one of the smartest action heroes I've ever seen in any action movie. Here's what I mean, in many action movies, the hero always takes his time to kill the boss or a henchmen. They just waits till the last minute to kill them or just leave them alive. But in this movie, Liam Neeson doesn't take his time or leave the enemies alive, he kills them all immediately! Even the final boss was simple to finish off. When the boss is holding a knife on somebody you've been trying to rescue, just shoot him in the head. He's not gonna kill her after he's gonna be dead by a simple shot, and that's exactly what Liam Neeson did. Smartest action hero EVER. Not only was the hero great, but the action and chase scenes were unbelievable. It keeps getting better and more exciting, I've been jumping and cheering Liam to survive and quickly save his daughter. It was awesome, and unexpecting to see something like this in an action movie. This movie deserves more positive reviews from critics, because this isn't one of those simple cliched action films. This is something different and well done, and needs to be seen by every action fan.",
      "review_date": "2012-08-31"
    },
    {
      "review_title": null,
      "content": "Taken is one of the greatest action movies I have ever seen, the plot will keep you hooked and on the edge of your seat, I wasn't disappointed with this movie and you wont be either.",
      "review_date": "2011-03-08"
    },
    {
      "review_title": null,
      "content": "This movie was actually better then I thought it would be. For the last year all I have heard is how great this movie was, but I could not see this actually being any good. I finally got a hold of a copy and sat down and watched it. First offThis movie was actually better then I thought it would be. For the last year all I have heard is how great this movie was, but I could not see this actually being any good. I finally got a hold of a copy and sat down and watched it. First off the acting was all around great for an action flick. Typically action flicks have good leads and weak everything else. I didn't really see a horrible actor. Next the plot was good and kept me interested. The thing that bothered me was the bad guys fell victim to the typical action movie pit fall. They shot thousands of bullets and only his him once (at the end of the movie no less). Yet our hero typically hits whoever is being aimed at. I get he was a hard core special forces guy but for the love of god he doesn't have an invisible force field. I kinda gave the fact a pass because I really can't think of an action movie that doesn't have that issue. Over all the movie was fun and exciting, its a definite watch.",
      "review_date": "2011-06-12"
    },
    {
      "review_title": null,
      "content": "Some words to describe this movie: tenacious, no mercy, intense, action-packed, etc.  This movie is different from the mainstream movie of today, which I liked.  In most action movies the main character usually doesn't shoot everyone with noSome words to describe this movie: tenacious, no mercy, intense, action-packed, etc.  This movie is different from the mainstream movie of today, which I liked.  In most action movies the main character usually doesn't shoot everyone with no mercy, in most movie he tries to find the \"nicest\" way to get to the end, but not in this movie.  Liam does everything in his power to save his daughter, he just walks in and starts shooting everybody, no stand offs where the characters talk to each other while they have guns pointing at each other heads in this movie.",
      "review_date": "2012-02-06"
    },
    {
      "review_title": null,
      "content": "This movie was long and drawn out, Taken's plot used several cliches and had several awkward moments. Taken was painful to watch.The movie is boring and doesn't get engaging until the end.",
      "review_date": "2012-09-26"
    },
    {
      "review_title": null,
      "content": "'Taken' is a very basic action/thriller, centering on a man doing whatever it takes to get his kidnapped daughter back. The man is played by Liam Neeson, however, which means trouble for the guys that took his daughter. There is a lot of'Taken' is a very basic action/thriller, centering on a man doing whatever it takes to get his kidnapped daughter back. The man is played by Liam Neeson, however, which means trouble for the guys that took his daughter. There is a lot of hand-to-hand combat in the film, and it's exhilarating to watch as Neeson takes out multiple people in a matter of seconds with quick shots and the feel of impact as people are punched and kicked. There really isn't much reason to see the film for other than Neeson's strong performance and the butt kicking action scenes. With that being said, the film is well made and entertaining throughout it's brisk 93 minute running time.",
      "review_date": "2012-08-29"
    },
    {
      "review_title": null,
      "content": "I saw it last year and I still don't see the hype with this film. A father trying to find his daughter somehow turns into an action epic. Reallly???????????? Don't even get me started on 2",
      "review_date": "2013-11-30"
    },
    {
      "review_title": null,
      "content": "Slick action, a straightforward story, and one of the most fearsome performances from Liam Neeson I have ever seen make \"Taken\" an awesome filmic experience.",
      "review_date": "2012-11-28"
    },
    {
      "review_title": null,
      "content": "\"Taken\" is a brutal, relentless, adrenaline-charged punch to the face. It manages, in 90 minutes, to kick more ass than your average 2-hour action thriller, and still it leaves plenty of exposition to develop true, believable characters and\"Taken\" is a brutal, relentless, adrenaline-charged punch to the face. It manages, in 90 minutes, to kick more ass than your average 2-hour action thriller, and still it leaves plenty of exposition to develop true, believable characters and establish genuine relationships. Liam Neeson delivers a powerhouse performance as a retired government spy who goes after a prostitution ring responsible for abducting his daughter, and although he may not look like it at first, he could give James Bond a run for his money. The action in this movie is very fast-paced, and once things get going the movie goes a mile a minute - you cannot help but get swept up in it all. This is one satisfying vendetta of violence at its most polished and pristine.",
      "review_date": "2012-11-30"
    },
    {
      "review_title": null,
      "content": "It's horrible, too unrealistic. Weak guys are always dumb, die stupid.  Protagonist always wins the battle easily. I hate it.",
      "review_date": "2013-05-20"
    },
    {
      "review_title": null,
      "content": "When Kim and her slutty friend Amanda get kidnapped in Paris, its up to her father to rescue them, while Kim's  mother Lenore and her OK (but not better) stepfather watch.\rWhile Taken might not be the most realistic action film out there, itWhen Kim and her slutty friend Amanda get kidnapped in Paris, its up to her father to rescue them, while Kim's  mother Lenore and her OK (but not better) stepfather watch.\rWhile Taken might not be the most realistic action film out there, it is still a good action film that benefits from having a great main lead: Liam Neeson! Liam Neeson is a excellent action actor, having starred in: Taken, Taken 2, Unknown, Battleship, Batman Begins, The Dark Knight Rises and The A-Team, and is the perfect person to star in this movie as ex-CIA agent Bryan Mills. Exceptionally made, with solid-action, this is an awesome film. Another thing the film benefits from is having a lot of action, since it lets the audience forget the string of unlikely coincidences. One of my favorite scenes of all time is the \"I will find You\" scene. My only complaint was that there should've been more interaction between Bryan and Kim.\r If you liked this review, read my other ones. If it was helpful, please mark it as helpful.\r And P.S, at least Amanda got laid in Paris like she wanted.",
      "review_date": "2013-09-23"
    },
    {
      "review_title": null,
      "content": "You guys asked this and I answered them right here.\r Is it better than the sequels? Yes... however, the sequels are far from being bad.\rIs it a good film? For some cases.\rDo you think it deserves the 7 score? Yes.",
      "review_date": "2016-01-20"
    },
    {
      "review_title": null,
      "content": "10 minutes of set up for 80 minutes of intense, non-stop action. I saw this movie last year in Australia and loved every minute of it.",
      "review_date": "2009-01-30"
    },
    {
      "review_title": null,
      "content": "Best action thriller in 2008 by far.",
      "review_date": "2009-02-04"
    },
    {
      "review_title": null,
      "content": "It's always entertaining to watch scumbags have justice served on them in an abrupt fashion, rather than have them surf through a dysfunctional legal system. Liam Neeson is a good choice for this part and plays it well. Sadly, this It's always entertaining to watch scumbags have justice served on them in an abrupt fashion, rather than have them surf through a dysfunctional legal system. Liam Neeson is a good choice for this part and plays it well. Sadly, this movie starts out strong but dwindles to a shoddy plot finish. It's as though the writers had a great idea to start but ran out of time and scratched out the ending in the wee hours of one morning on a napkin. The low point is when Neeson's somewhat estranged and clueless daughter, after watching her father risk life, limb and everything to get her back, basically just gives him a hug and then goes back to her even more clueless mother and stepfather.",
      "review_date": "2009-02-17"
    },
    {
      "review_title": null,
      "content": "A hugely entertaining rollercoaster ride as Neeson cuts a swathe through the Albanian criminal diaspora on the hunt for his abducted daughter. Wildly un-PC but Bourne fans will love this one too.",
      "review_date": "2009-02-21"
    },
    {
      "review_title": null,
      "content": "Very good story, great action, Liam Neeson did a very good job.",
      "review_date": "2009-02-02"
    },
    {
      "review_title": null,
      "content": "Liam is a cheater he set it to god-mode , killed them all, and got his daughter back.. well just another crap and wasted time watching it.",
      "review_date": "2009-02-25"
    },
    {
      "review_title": null,
      "content": "Purely viseral. Belivable for the most part, no super human abilities. I do wish however hollywood would learn how actual gunfights occure rather than the taking turns shooting around corners at each other.",
      "review_date": "2009-02-03"
    },
    {
      "review_title": null,
      "content": "Saso, Dave, the Captain, Art, the Spectre, Martin, and Dustin have got it right. \"Don't believe these morons (critics)\"! Taken is not the kind of movie you over-analyze like critics are compelled to do. It's the kind of movie to Saso, Dave, the Captain, Art, the Spectre, Martin, and Dustin have got it right. \"Don't believe these morons (critics)\"! Taken is not the kind of movie you over-analyze like critics are compelled to do. It's the kind of movie to just be enjoyed. It's good fiction and a very entertaining thriller. Liam Neeson makes a wonderful kick-ass daddy who gives the bad guys exactly what they deserve and you enjoy every minute of it.",
      "review_date": "2009-02-06"
    },
    {
      "review_title": null,
      "content": "Don't listen to these ridiculous low scores from the critics. The movie was very well shot and edited and is great for what it is... a non stop action movie. Neeson is great, the fight scenes are well done and the movie keeps you on the Don't listen to these ridiculous low scores from the critics. The movie was very well shot and edited and is great for what it is... a non stop action movie. Neeson is great, the fight scenes are well done and the movie keeps you on the edge of your seat.",
      "review_date": "2009-02-06"
    },
    {
      "review_title": null,
      "content": "Pure adrenaline. Anyone who expected anything else thinks too much and will be disappointed. A fun getaway film.",
      "review_date": "2009-02-06"
    },
    {
      "review_title": null,
      "content": "What do we need critics for ? They gave this movie 50 out of 100 and now the movie maybe wont come to Denmark. By accident i saw it at hotel Room in England and its one of the most exciting ive ever seen. So thumbs down to critics and thumbs What do we need critics for ? They gave this movie 50 out of 100 and now the movie maybe wont come to Denmark. By accident i saw it at hotel Room in England and its one of the most exciting ive ever seen. So thumbs down to critics and thumbs up to movie and look at user average before my vote. 8,2 out of 10 ? Do we have a gap ? I believe so. Watch it.",
      "review_date": "2009-02-07"
    },
    {
      "review_title": null,
      "content": "I thought this movie was excellent! I am still thinking about it and all the parts that really had me jump!!!",
      "review_date": "2009-02-09"
    },
    {
      "review_title": null,
      "content": "Some would say taken is a ridiculous far fetched thriller, their very wrong compare it to say hitman or the transporter series, now those get far fetched this is more like the bourne series better realism in its action, and yes perhaps the Some would say taken is a ridiculous far fetched thriller, their very wrong compare it to say hitman or the transporter series, now those get far fetched this is more like the bourne series better realism in its action, and yes perhaps the villains arnt original but its really well done i wouldnt recommend it like i would with the bourne ultimatum, but its right a floor below that, if you like thrillers watch taken also nice acting well done!",
      "review_date": "2009-03-30"
    },
    {
      "review_title": null,
      "content": "This movie was the right way to start of 2009- with a bang!",
      "review_date": "2009-03-04"
    },
    {
      "review_title": null,
      "content": "A very good action flick with a believable story and a great star in Neeson. Thought the movie was well paced to where when the action started, it was unexpected and thrilling. Yes there are some scenes that are over the top, but still A very good action flick with a believable story and a great star in Neeson. Thought the movie was well paced to where when the action started, it was unexpected and thrilling. Yes there are some scenes that are over the top, but still passable because this is an action flick first and foremost. I did not feel a xenophobic vibe at all, other than you have to always be careful, even in the country you live in and to never trust strangers. Overall the movie did it's job, it was entertaining and gave my family room to discuss the whole drive home from the theater.",
      "review_date": "2009-05-10"
    },
    {
      "review_title": null,
      "content": "You won't be bored for a minute, but you won't believe a minute of it.",
      "review_date": "2009-07-27"
    },
    {
      "review_title": null,
      "content": "This is an action film. This is a thrilling action film. Neeson is very good. This is not a great film. However, it's a great, great action film. It goes by in what seems like twenty minutes.",
      "review_date": "2009-11-22"
    },
    {
      "review_title": null,
      "content": "I've always appreciated cringeworthy kitsch so long as it's self-consciously so. Taken is the kind of horribly over-acted, ridiculous, self-indulgent thriller that sort of defines cringeworthy kitsch, particularly Liam I've always appreciated cringeworthy kitsch so long as it's self-consciously so. Taken is the kind of horribly over-acted, ridiculous, self-indulgent thriller that sort of defines cringeworthy kitsch, particularly Liam Neeson's frankly awful script and delivery thereof. We all know he's a talented actor, so why did he stoop to this low? Easy money? That said I love the insipidness of the plot, and the fact that it knows that it's awful. The dramatic tone change, however, makes me think that the overall mood of this one is more than a little confused - the impending doom hangs over the considerably lighter first half hour, but was it really necessary to beat the life out of it with the dispassionate performances? The characters are cartoony and unbelievable. As a b-movie, it suffices as a nice little kitschy distraction, but sometimes I wondered how serious it was really trying to be, and that's what stagnated it. Not a disaster, but pretty damn average and confused with lots of cliché heaped atop the lowest-common-denominator nature of its inception.",
      "review_date": "2009-10-30"
    },
    {
      "review_title": null,
      "content": "What's wrong with the critics giving such scores for this? This movie was just what it tried to be, an action movie with a lead character being a real badass killing machine with the know how and moves. His girl gets taken away from What's wrong with the critics giving such scores for this? This movie was just what it tried to be, an action movie with a lead character being a real badass killing machine with the know how and moves. His girl gets taken away from him, he goes to get her back. Simple and nothing else needed, I felt entertained thro the whole movie. Also I miss these \"feel good\" action movies from time to time where the lead really kicks ass and gets the job done without too much hassle. I mean take Arnold's Commando for example, if you want to see paypack delivered with no questions asked, these are the movies you'd want to see. Bravo!",
      "review_date": "2009-01-30"
    },
    {
      "review_title": null,
      "content": "It was a good enjoyable movie that had great realistic action and suspense. Liam Neeson was great.",
      "review_date": "2009-02-01"
    },
    {
      "review_title": null,
      "content": "I like to rate films on there content and knowing what I film I am going to see. This of course is an action film so I went in with no high expectations of plot but I found accebtable and could happen. But what made me so excited and loving I like to rate films on there content and knowing what I film I am going to see. This of course is an action film so I went in with no high expectations of plot but I found accebtable and could happen. But what made me so excited and loving every scene was the fast pace, you sit there and beg for the action scene and they do not disappoint. Only reason I did'nt give this film a ten is the ending and the sometimes corny dialogue between Liam and his daughter. Liam is a legend in this film and has got my full respect as an action hero! Excellent and fast paced film!",
      "review_date": "2009-02-11"
    },
    {
      "review_title": null,
      "content": "Great film, saw it months ago, what happened Meatcritic? Very late reviews. Fantastic action, as good as Bourne, far better than Bond.",
      "review_date": "2009-02-10"
    },
    {
      "review_title": null,
      "content": "Delivered in every respect.",
      "review_date": "2009-02-01"
    },
    {
      "review_title": null,
      "content": "I thought this movie was fantastic. It didn't pretend to be something it wasn't, it didn't try to make a point... it was simply a flim about an incredible badass that goes on a f***** rampage to try and get his daughter back. I thought this movie was fantastic. It didn't pretend to be something it wasn't, it didn't try to make a point... it was simply a flim about an incredible badass that goes on a f***** rampage to try and get his daughter back. Highly entertaining the whole way through, and that's what a movie should be.",
      "review_date": "2009-02-19"
    },
    {
      "review_title": null,
      "content": "Good and fun flick. I didn't like some of the action, but the movie's quirkiness made up for it. Will watch again. The critics didn't like it because it portrayed Albanians badly? Well yeah, they were the bad guys -- some Good and fun flick. I didn't like some of the action, but the movie's quirkiness made up for it. Will watch again. The critics didn't like it because it portrayed Albanians badly? Well yeah, they were the bad guys -- some movies have bad guys you know. Because it protrayed foreign travel as dangerous? Yeah, this is not a foreign college road trip movie. It's an action flick, not a insightful psychological drama. I don't know why they expect it to be something that it isn't.",
      "review_date": "2009-02-20"
    },
    {
      "review_title": null,
      "content": "I thought that this was a great movie. I loved the action and the overall pacing of the film. It felt like an older version of Jason Bourne. Liam was a bada**.",
      "review_date": "2009-02-23"
    },
    {
      "review_title": null,
      "content": "Proof that critics really don't understand what the general populace are looking for in a film, during these down-economic times. \"Taken\" really seems to connect with father's, in particular. Great revenge flick. Possibly the best Proof that critics really don't understand what the general populace are looking for in a film, during these down-economic times. \"Taken\" really seems to connect with father's, in particular. Great revenge flick. Possibly the best since the days of \"Death Wish\".....?",
      "review_date": "2009-02-27"
    },
    {
      "review_title": null,
      "content": "Best action movie of 2000s. Better than bond, better than stupid giggly camera boy hero Bourne. This is just a pissed off father taking his daughter back from illegal immigrants. Rocks! I love when he personally electrocutes criminals. Liam Best action movie of 2000s. Better than bond, better than stupid giggly camera boy hero Bourne. This is just a pissed off father taking his daughter back from illegal immigrants. Rocks! I love when he personally electrocutes criminals. Liam rocks! doesn't get much better than a pissed off seal. Focused. Driven. Screw the critics. This one's a keeper.",
      "review_date": "2009-02-05"
    }
  ],
  "num_reviews": 132
}