{
    "title": "The Hangover",
    "rating": 7.8,
    "release_date": "2009-06-05",
    "genre": [
        "Comedy",
        "Crime"
    ],
    "summary": "Two days before his wedding, Doug and his three buddies drive to Vegas for a blow-out night they'll never forget. But when the three groomsmen wake up the next morning with pounding headaches, they can't remember a thing. Their posh hotel suite is beyond trashed and the groom is nowhere to be found. With no clue of what happened and littleTwo days before his wedding, Doug and his three buddies drive to Vegas for a blow-out night they'll never forget. But when the three groomsmen wake up the next morning with pounding headaches, they can't remember a thing. Their posh hotel suite is beyond trashed and the groom is nowhere to be found. With no clue of what happened and little time to spare, the trio must attempt to retrace their bad decisions from the night before in order to figure out where things went wrong and hopefully get Doug back to L.A. in time for his wedding. However, the more they begin to uncover, the more they realize just how much trouble they're really in. (Warner Bros.)… Expand",
    "critic_reviews": [
        "This is a movie where you WANT to stick around for the credits. The beauty is that you are totally set up for it, and you don't mind one bit. That final sequence ties the movie together in an awesome fashion.",
        "A piercingly funny, twisted \"whatever-happens-in-Vegas\" caper.",
        "At once raucously free-wheeling and meticulously contrived, picture satisfies as a boys-gone-wild laff riot that also clicks as a seriocomic beat-the-clock detective story.",
        "The Hangover is a shaggy-dog tale that's actually, when you step back from it, perfectly shaped.",
        "Todd Phillips is no artist, but his lowbrow comedies (Road Trip, Old School) always hit the mark because they're so psychologically true: the superego tries to control the id, but the id gets drunk and barfs all over it. Hilarious.",
        "A funny movie, flat out, all the way through. Its setup is funny. Every situation is funny. Most of the dialogue is funny almost line by line.",
        "The Hangover ain't art, but Phillips has shaped the hardcore hilarity into the summer party movie of all our twisted dreams.",
        "So if you're looking for the next stop on the Shockingly Experimental Comedy train, don't get off here -- this ride is strictly for laughs.",
        "There is a sort of perverse brilliance or brilliant perverseness to be found in this story of a bachelor party gone terribly wrong.",
        "A furiously paced, inventive and flat-out hilarious take on a tried-and-tested formula. An exemplary bromantic comedy that doesn't sacrifice heart in pursuit of laughs, maintaining plenty of the former and a superabundance of the latter.",
        "The Hangover instantly has the feel of one for the ages.",
        "Overall it's more amusing than hilarious.",
        "The Hangover remains unrepentantly irresponsible and hilarious throughout, culminating with what could be the funniest montage ever to grace a picture's end credits. The summer's first sleeper hit has arrived.",
        "It's a worst-case-scenario of bachelor party morning-after, and it is howlingly funny.",
        "Director Todd Phillips (Old School) has a knack for extreme scenarios and outside-the-box casting. He has made a movie that is consistently funny from start to finish.",
        "The Hangover pushes the boundaries of good taste, good sense, and good will toward man. And you'll feel good about it all.",
        "A lot of what happens is gross, puerile and gratuitous, granted, but Helms and Galifianakis are truly funny in offbeat fashion, and the script allows Phillips room for some brilliant slapstick. You will not be ennobled. But you will be entertained.",
        "The funniest movie so far this year.",
        "Raunchy frat comedies are as hard to pull off as any other kind because they have to keep surprising the audience, and The Hangover does with a bizarre series of uproarious situations with explanations that just about stay within the bounds of plausibility.",
        "For a viewer in the mood for something rude, crude, and lewd, it would be difficult to find a more satisfying food.",
        "It is classless, it is tasteless, it is idiotic, it is juvenile and it is something your mother totally wouldn't approve of. But it also is flat-out hilarious, a go-for-broke comedy that not only is the best laugher released so far this summer, but one of the best so far this year.",
        "Phillips can't bring himself to push the material into truly outré territory, or to characterize his growth-impaired guys as degenerate creeps rather than lovable scamps.",
        "But true to its title, The Hangover goes down smoothly enough and then kicks you in the head later on, when you start to examine the sources of your laughter.",
        "This kind of \"one crazy night\" tale relies on drum-tight structure to work. Without it, The Hangover sputters to a sentimental halt. Still, it's worth staying for the closing credits.",
        "Sitting through The Hangover is like watching \"Memento\" featuring the Three Stooges.",
        "It doesn't disappoint. It gets the job done thanks in large part to the breakout performance given by Galifianakis. It's no \"Old School,\" but it will do nicely until that film's anticipated sequel rolls around in 2011.",
        "It's an agreeably unambitious comedy that might be called a romp, if that word didn't imply a little too much energy.",
        "Even Galifianakis's pervy charm, and a deeply weird cameo by Mike Tyson, can't save The Hangover. Whatever the other critics say, this is a bromance so primitive it's practically Bro-Magnon.",
        "Rude, lewd and occasionally in the nude, The Hangover brings a collection of fresh faces to the familiar raucous male-bonding comedy.",
        "Amusing as it is, it never feels real.",
        "The Hangover is like an infernal comedy machine. Surrender your soul to its foul mesh of cheap cleverness and vulgarity. and you howl like a delighted demon. Resist, and you feel all sense and sensibility being crushed in its cogs."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "Oh what to say, this could be the best comedy of the year, everyone in the film is hilarious, and to top it off with mike tyson, everyone needs to check this film out, acting was superb, and the movie was just genuinely funny. Oh and make Oh what to say, this could be the best comedy of the year, everyone in the film is hilarious, and to top it off with mike tyson, everyone needs to check this film out, acting was superb, and the movie was just genuinely funny. Oh and make sure u stay after the credits, some of the funniest parts are in it.",
            "review_date": "2009-06-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Although I am a huge Zach Galifianakis fan (yes there are some of those) I came into this movie with pretty low expectations. I was extremely surprised by the movie as a whole. The writing and storyline were good, but the acting by Ed Helms, Although I am a huge Zach Galifianakis fan (yes there are some of those) I came into this movie with pretty low expectations. I was extremely surprised by the movie as a whole. The writing and storyline were good, but the acting by Ed Helms, and particularly Zach G. (who carried the movie) was excellent. The entire theater was laughing throughout the whole movie. This was one of the best comedies I have seen in a while.",
            "review_date": "2009-06-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Hilariously funny movie with a brilliant cast. Zach Galifianakis and Ed Helms were absolutely hilarious.",
            "review_date": "2009-06-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "There has never been a statue made of a Critic.. and this is why..get a Real JOB and wake up from your Hangover.. how could you not find this Funny?",
            "review_date": "2009-06-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "From start to credits, I laughed with few pauses. Where other comedies have failed, The Hangover doesn't treat the plot as a to-do list to run through after the gags are done, it keeps it fun and involved.",
            "review_date": "2009-06-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is brilliant. I think one of the stupidest movie in the world, but it makes me laugh and has a great cast with actors appreciable and estimable! Great film!",
            "review_date": "2013-06-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Fuuuuuuuuuuuuuuuuuuuuuuuuun! This is one really good comedy and you'll not regret watching it. It's original and unpredictable with so much funny jokes and situations. We all know, that there are more 2 following parts. And we also know, thatFuuuuuuuuuuuuuuuuuuuuuuuuun! This is one really good comedy and you'll not regret watching it. It's original and unpredictable with so much funny jokes and situations. We all know, that there are more 2 following parts. And we also know, that they are full crap, extremely unsuccessful, even annoying. They really did a great job with the presentation of the story in the first part, so much, that they run out of originality, ideas and jokes in the next parts. So enjoy the first part and in my opinion don't waste your time with the other 2 parts.",
            "review_date": "2018-05-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great movie! extremelly true and funny! Very funny, I would say! Will recommend! People who think this movie is not good, I think they should watch The Box...(Cameron Diaz). After that, they will appreciate it a lot more and realize that theGreat movie! extremelly true and funny! Very funny, I would say! Will recommend! People who think this movie is not good, I think they should watch The Box...(Cameron Diaz). After that, they will appreciate it a lot more and realize that the money spent on making the move has not been wasted!",
            "review_date": "2010-12-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I sometimes wonder if i just watched the same movie as everyone else...it was quite possibly the worst film i have seen in years. dumbed down jokes, repeated scenes, terrible acting and poor storyline. I'm guessing it appeals to people whoI sometimes wonder if i just watched the same movie as everyone else...it was quite possibly the worst film i have seen in years. dumbed down jokes, repeated scenes, terrible acting and poor storyline. I'm guessing it appeals to people who have been in this situation......",
            "review_date": "2011-07-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Hangover is one of the best \"straight-out\" comedies in the last decade! It is not the 'intelligent' type of comedy, such as \"Lost in Translation\" or \"Sideways,\" but it's a crowd-pleaser!! The hilarious screenplay is just perfectly writtenThe Hangover is one of the best \"straight-out\" comedies in the last decade! It is not the 'intelligent' type of comedy, such as \"Lost in Translation\" or \"Sideways,\" but it's a crowd-pleaser!! The hilarious screenplay is just perfectly written and, quite frankly, though the situations are completely insane, they seem rather believable in the film. The cast is also rather good, so overall it is a great comedy that will make you laugh harder than the vast majority of comedies out there, nowadays! Great film!",
            "review_date": "2010-12-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"The Hangover\" is a brazenly brainless comedy that doesn't know what its doing. But guess what; that's why its funny.",
            "review_date": "2011-09-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I wanted to like it, I really did.",
            "review_date": "2011-06-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie was stupid...not stupid funny, just stupid. After 45 minutes, my girlfriend and i both looked at one another and completely agreed that this was a waste of time. If you enjoyed movies like Pineapple Express or Strange Wilderness This movie was stupid...not stupid funny, just stupid. After 45 minutes, my girlfriend and i both looked at one another and completely agreed that this was a waste of time. If you enjoyed movies like Pineapple Express or Strange Wilderness and found them entertaining and clever...then yeah, you'd probably enjoy this movie. If you value well written movies or genuinely good comedy, pass on this POS.",
            "review_date": "2009-06-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is the most overrated mess known to man. Someone seriously needs to explain the Hype cause I dont get it. Its Stupid, Not funny at all. over rated to the fullest.",
            "review_date": "2010-12-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Take the movie Dude Where's My Car, remove the plot, cast and humor.Then add hire some idiots with no acting experience to play the main cast.Add a common prescription drug which people hardly know anything about.\nAnd then you get TheTake the movie Dude Where's My Car, remove the plot, cast and humor.Then add hire some idiots with no acting experience to play the main cast.Add a common prescription drug which people hardly know anything about.And then you get The Hangover...A bunch of guys completely forgot what happened last night and spent the entire movie trying to figure it out. Extremely dull and unoriginal.",
            "review_date": "2010-10-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie barley ever made me laugh. The plot line was terrible, all the humor was childish and the characters were annoying. If you like movie plots were people get drunk wake up in the morning not remembering anything with stupid obviousThis movie barley ever made me laugh. The plot line was terrible, all the humor was childish and the characters were annoying. If you like movie plots were people get drunk wake up in the morning not remembering anything with stupid obvious humor though out  be my guest. This movie is an example of why all the other countries hate us.",
            "review_date": "2012-02-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Funny with a hint of character progression, but the bro atmosphere, random events, and physical comedy, while executed well, become repetitive and boring halfway through.",
            "review_date": "2009-06-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The movie contains a lack of humor rarely found in well reviewed comedies.",
            "review_date": "2010-01-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Devoid of wit or ingenuity. Relies completely on vulgarity and cruelty to be funny. I find vulgar and cruel jokes funny in doses, but an entire movie predicated upon them is just tedious. The fact that most of America seems to disagree with Devoid of wit or ingenuity. Relies completely on vulgarity and cruelty to be funny. I find vulgar and cruel jokes funny in doses, but an entire movie predicated upon them is just tedious. The fact that most of America seems to disagree with me on this point is depressing.",
            "review_date": "2010-01-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Absolute garbage. The movie tried way too hard and never made any sense. I thought the plot would make for an interesting movie but the amounts of random garbage thrown at the viewer(way way random than one would expect at Vegas).. just felt Absolute garbage. The movie tried way too hard and never made any sense. I thought the plot would make for an interesting movie but the amounts of random garbage thrown at the viewer(way way random than one would expect at Vegas).. just felt over the top. I cannot possibly understand how people enjoyed this.",
            "review_date": "2010-01-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The trailer looked great & the film surpassed my expectations. It was non stop laughs from start to finish as we discovered what happened that fateful. A great comedy movie that isn't a \"lads\" film & isn't just full of purile slapstick.",
            "review_date": "2009-06-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Obviously, a real split in opinion on this movie. I guess some people don't enjoy laughing or think a comedy must be ever so tasteful or maybe just walk around with a stick up their a$$ and it hurts too much to laugh. Personally, I Obviously, a real split in opinion on this movie. I guess some people don't enjoy laughing or think a comedy must be ever so tasteful or maybe just walk around with a stick up their a$$ and it hurts too much to laugh. Personally, I thought this was one of the funniest movies I've seen in years. I laughed out loud (along with eveyone else in the theatre) enough times that I lost count. Sure it was crude, but c'mon what did you expect when you saw a tiger, Mike Tyson and a baby in sunglasses in the trailers? Galifianakis, Helm and Jeong (Mr. Chow) were simply hilarious and the reveals became funnier as the movie went on. The credits tied everything together perfectly, contrived or not.",
            "review_date": "2009-07-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Watched half of it, couldn't stand a minute more, just dreadful, vulgar and nothing funny about it.",
            "review_date": "2010-01-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Stereotypical and obvious laughs. Overrated with few laugh out loud moments. Unmemorable and predictable.",
            "review_date": "2010-01-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I thought this movie was bad but not horrible, Zac Galifianakis was funny as usual but everything else was..well horrible. The dentist guy's wife was the queen of bitches for some reason. I mean did they make her the seed of Hitler to I thought this movie was bad but not horrible, Zac Galifianakis was funny as usual but everything else was..well horrible. The dentist guy's wife was the queen of bitches for some reason. I mean did they make her the seed of Hitler to draw away from the horrible plot and actors? That must be it, kind of the opposite of comic relief. Well anyway the Chinese guy made me want to throw the remote at the screen, when he jumped out of the car and beat them up was just plain awful. I love crude humor and physical comedy as much as the next guy but taking a movie that has that kind of Big Libowski feeling to it and adding a stupid scene like that just made me want to puke. The guy pulling his own tooth out was absolutely terrible, the fact that they stole a cop car and it wasn't recovered before the next morning was completely unbelievable. Oh yeah its impossible to count cards on a multi-deck table too. After that scene i knew for sure that this movie is bent on amusing stupid teenagers and college frat boys. I laughed at Galifianikis quite a few times so he was basically the only reason i didn't give this movie a big fat zero. Thumbs down be watchable.",
            "review_date": "2010-01-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I wish I had that 2 hours of my life back. Heard all year about how fantastic it was, finally rented it, and I agree with all the other posters here: vastly overrated, not the slightest bit funny, with unbelievably crude and ludicrous I wish I had that 2 hours of my life back. Heard all year about how fantastic it was, finally rented it, and I agree with all the other posters here: vastly overrated, not the slightest bit funny, with unbelievably crude and ludicrous situations. I can find humor in raunchy movies like 40 Year Old Virgin or Superbad or Tropic Thunder, but this travesty has none of the charm or plot or character development of those films. One of the worst I've ever seen, and the closing credits will make you want to take a shower.",
            "review_date": "2010-03-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Other than Zach Galifianakis, this one had no redeeming qualities. I don't see how anyone but boys 13 to 18 could relate to this.",
            "review_date": "2009-11-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Such a dumb movie... Scenes that are supposed to be funny but aren't, bad acting, lame script. It was a good idea for a movie but they didn't even come close to pulling it off, for me at least. There was only one part that made me Such a dumb movie... Scenes that are supposed to be funny but aren't, bad acting, lame script. It was a good idea for a movie but they didn't even come close to pulling it off, for me at least. There was only one part that made me laugh, couple others made me smile slightly. Very surprised it's even rated this high. 2 stars for the one line that made me laugh in the alter lol... The movie was worth it for that one line.",
            "review_date": "2010-01-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "First off, I heard everybody saying how awesome this movie was, so I decided to watch it on New Years with some friends on my Xbox. Crap. That's all it was--I laughed maybe twice. The huge amounts of acclaim for this movie makes me First off, I heard everybody saying how awesome this movie was, so I decided to watch it on New Years with some friends on my Xbox. Crap. That's all it was--I laughed maybe twice. The huge amounts of acclaim for this movie makes me thing, more than ever, that I don't belong in this society. Large amounts of Alcohol can't make this movie good. My only explanation is that everybody must've been high--and even then I can't see so many falling for it. I don't understand this country. I'll give it a 2 for 2 Laughs which is generous. I should rate it based on the number of laughs it was obviously trying to get and failing...the score would've been way way worse.",
            "review_date": "2010-04-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Never laughed once. I haven't been into adolescent humor since, well, I was and adolescent. I guess I do not find movies funny that focus on the gross, irresponsible, idiotic and implausible. This is 2 hours of my life I will never get back.",
            "review_date": "2010-05-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Through the entirety of this film I giggled (Note: giggled, not laughed) maybe twice, three times if I'm feeling really generous. Call me humourless but seeing people hurt themselves in many \"wild and whacky ways\" is hardly what I Through the entirety of this film I giggled (Note: giggled, not laughed) maybe twice, three times if I'm feeling really generous. Call me humourless but seeing people hurt themselves in many \"wild and whacky ways\" is hardly what I consider to be humour. I mean come on. I could have written all the \"funny\" elements of this film when I was five (but God forbid I was EVER that stupid). Great, the guys constantly hurt themselves, whoopee.",
            "review_date": "2009-10-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It is a comedy as superficial as unoriginal. Movie with moral that can be seen approaching from a distance, you learn without seeing her. In the U.S. has been a surprise box office, becoming one of the great comedies of the summer, but the It is a comedy as superficial as unoriginal. Movie with moral that can be seen approaching from a distance, you learn without seeing her. In the U.S. has been a surprise box office, becoming one of the great comedies of the summer, but the truth is that the phrase: 'What Happens in Vegas, stays in Vegas', could be trouble in this movie' What happens in the film stays in the trailer '. \"The Hangover\" is a trap for those who hoped for a refreshing comedy. A very heavy and boring pace, where you surprised at any time in the light of crap that happen to the three protagonists. To be more clear, and spared the nonsense and verbiage without foundation, saying it is a comedy that has nothing new to offer, and offer entertainment offers neither.",
            "review_date": "2009-11-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Spot on review. A vile movie. Due to my work schedule I wasn't able to see it in the theater. I couldn't wait for it to come out on DVD. I love a raunchy comedy as much as the next person as long as it's funny. The Hangover Spot on review. A vile movie. Due to my work schedule I wasn't able to see it in the theater. I couldn't wait for it to come out on DVD. I love a raunchy comedy as much as the next person as long as it's funny. The Hangover wasn't funny at all. I found the references to pedophila frankly disturbing and any parent who would allow their baby to be in a film to do a mock masterbation scene should be locked away for good. Anyone who finds pedophilia to be worth a laugh needs to do a shot of hemlock for the greater good and gene pool cleansing. If this is what passes for humor in America - especially among the American male, we're doomed. Sign of the times as to how stupid we Americans are. We're becoming an Idiocracy. There's a film the inbreds who loved the Hangover should check out but I fear it's message would be lost on them.",
            "review_date": "2009-12-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Sigh...more vulgar than funny. There were a few laughable moments but it falls in line with all the other supposedly slpastick but mostly dirty humored films.",
            "review_date": "2009-11-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Awful. Just Awful. I have no idea why this movie received such good reviews. Its the most predictable and cliched \"comedy\" I've ever seen. Didn't crack a smile even once during this 100 minute torture test.",
            "review_date": "2009-11-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "No comedy value whatsoever...i had heard it was clever so was very disappointed. It is totally stupid and not funny at all...I gave it a \"1\" for the baby being such a good sport.",
            "review_date": "2009-12-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's a good movie, there's no denying that, but it just didn't meet the expectations set by my friends and some of the reviews I read. I'm not the kind of guy who is too critical on comedy movies, but I just didn't find this THAT funny. SomeIt's a good movie, there's no denying that, but it just didn't meet the expectations set by my friends and some of the reviews I read. I'm not the kind of guy who is too critical on comedy movies, but I just didn't find this THAT funny. Some jokes were forced, and some plot elements were just stupid and unfunny. However, the movie did have a lot of extremely memorable and hilarious quotes, and Alan is a hilarious character. The plot is kinda dumb, but obviously it isn't meant to be taken seriously, so who cares? I'd recommend seeing it with friends, and it's definitely worth watching.",
            "review_date": "2010-09-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Director Todd Phillips has a knack for making some of the best buddy comedies. Road Trip, Old Scool, Starsky & Hutch, and the upcoming Due Date starring Robert Downey Jr. and Zach Galifianakis. I didn't care for most of the previous titles,Director Todd Phillips has a knack for making some of the best buddy comedies. Road Trip, Old Scool, Starsky & Hutch, and the upcoming Due Date starring Robert Downey Jr. and Zach Galifianakis. I didn't care for most of the previous titles, except Old School. It took me a long time to see Old School, but when I did I was thoroughly satisfied. It wasn's the movie itself that I fell in love with, as much as the genuine feeling of comradery and friendship between Mitch (Luke Wilson), Frank the Tank (Will Ferrell) and Beanie (Vince Vaughn). That is the very same feeling I get when I watch The Hangover. The actors all have a chemistry that makes you believe what's happening to them, no matter how outrageous it is. Zach Galifiankis was the best. What a great way to break onto the movie scene, after a decade of extra roles, and tv spots. The slogan, \"Some guys just can't handle Vegas\" is perfect. Without saying, if you saw the trailer you alreay know that the premise of the story is a bit extreme, but I never got the feeling that events from the film were beyond the realm of reality. Another great thing about this movie was the cameos. I'm always a sucker for good cameos, and The Hangover doesn't disappoint. I loved the appearances of Ken Jeong as the gay Chinese gangster Mr. Chow, Rob Riggle as the over-caffinated cop, and Mike Epps as black Doug. Oh yeah, and that other Mike too. Although, they probally shouldn't have spoiled that one in the preview. With so much going on in the story, this film could have easily had a few unfilled plot holes, but I'm happy to say that it didn't. The only question that went unanswered was how that chicken got in the hotel room. The Hangover was one of my favorite films of the summer. That's saying alot because there were quite a few great movies that came out in the summer of 2009. Todd Phillips may use the same basic buddy comedy palette for each of his movies, but why shouldn't he? It works. I can't wait for Due Date. And if theres any truth to this, we should be expecting a sequal to The Hangover. My fingers are crossed for that one.",
            "review_date": "2011-03-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the best comedies of recent years and one most people can relate to (although not on such a grand scale) of memory gaps or complete blanks after a good drinking session. The gags are predictable but still make you laugh and the cast isOne of the best comedies of recent years and one most people can relate to (although not on such a grand scale) of memory gaps or complete blanks after a good drinking session. The gags are predictable but still make you laugh and the cast is perfectly suited to the roles.",
            "review_date": "2011-07-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "if you saw the previews, you saw the movie. it's obvious the guy who wrote it had a few funny ideas about all the funny things that can happen when your drunk and decided to make it into a movie. the movie is basically getting from funnyif you saw the previews, you saw the movie. it's obvious the guy who wrote it had a few funny ideas about all the funny things that can happen when your drunk and decided to make it into a movie. the movie is basically getting from funny moment A to funny moment B.",
            "review_date": "2011-11-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "'The Hangover' is one of those buddy comedy films where you have to stop asking questions, grab a bucket of buttery popcorn, sit back and enjoy the ride. Character development is virtually non-existent and not everything is correctly wrapped'The Hangover' is one of those buddy comedy films where you have to stop asking questions, grab a bucket of buttery popcorn, sit back and enjoy the ride. Character development is virtually non-existent and not everything is correctly wrapped up and explained by the end of the movie. Regardless this is a truly funny feature. The unpredictably and random events are what I'm sure most people will highly appreciate. The lack of a proper narrative is fine and although some people might be put off by the nudity I thought it was brilliantly amusing",
            "review_date": "2012-05-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It shows how bad the movies are for THE HANGOVER to get this score. This movie sucks so bad I shut if off in the middle. I couldn't take it anymore. What were you all smoking when you went to see it? Crack?",
            "review_date": "2010-11-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I just didn't get it. Everyone kept telling me The Hangover is the funniest movie of the decade so I expected the funniest movie of the decade. I didn't get it. The movie had it's funny moments and it certainly is a quote-able movie, but II just didn't get it. Everyone kept telling me The Hangover is the funniest movie of the decade so I expected the funniest movie of the decade. I didn't get it. The movie had it's funny moments and it certainly is a quote-able movie, but I didn't think it was anything remarkable.",
            "review_date": "2011-12-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is just bad. The jokes are simple and cheesy, the whole \"plot\" of this movie is about friends who go to Vegas (just like everyone else has for the longest time). after a night they cant remember the guy who is getting married isThis movie is just bad. The jokes are simple and cheesy, the whole \"plot\" of this movie is about friends who go to Vegas (just like everyone else has for the longest time). after a night they cant remember the guy who is getting married is lost and the rest of the movie is spent trying to find him. If you like simple stupid movies like those who have will ferrel in them then you'll like this movie. If not then skip it and see something alot better.",
            "review_date": "2012-03-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I believe comedy is mostly about the performance, and the theori that is behind the performance. If you want those laughs where your brain tickles anyway (only comedy that does it for me). In this film I wasn't bored, and sometimes I I believe comedy is mostly about the performance, and the theori that is behind the performance. If you want those laughs where your brain tickles anyway (only comedy that does it for me). In this film I wasn't bored, and sometimes I even smiled of the comedy they presentet for me, but not once did my brain tickle. For me that is the art of comedy, too create moments where I actually laugh even if i try to resist. I don't give this low rating because I think the story is boring or the acting doesn't convince me. It simply didnt make me laugh. The movie could possible even have been funny on paper, but the result isn't. To be a little more spesific: the awkward moments arnt awkward, and the bizzarity isn't bizzar. Once again, I dont think this movie was broken already in the manuscript fase (maybe it was, maybe it wasnt), it might look like the performance from the actors and the directing is the blame for this not working. (excuse my bad English grammar, working on it).",
            "review_date": "2010-01-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not funny. I wish it were. But I like 'Wedding Crashers' humor, which is crude and clever. The humor in 'The Hangover' isn't clever. It's all reactive. Even a good line like \"you're dressed like a Cholo on Not funny. I wish it were. But I like 'Wedding Crashers' humor, which is crude and clever. The humor in 'The Hangover' isn't clever. It's all reactive. Even a good line like \"you're dressed like a Cholo on Easter\" from 'Knocked Up' is way way funnier than anything in 'The Hangover'. Nobody will ever quote this film, because none of the lines are funny. Mostly sight gags, situational mishpas, and pissing in public jokes. Don't get me wrong. I like crude, so long as it's clever. Galafinkis (whatever his name is) isn't funny. But being unfunny is his schtick, right? I mean he's intentionally not funny. This is SNL/'Hot Rod' grade humor. And there's barely any t and a in it. Also, the pacing is leaden. Poor Cooper is burdened with a lot of lame straight man lines that state the obvious. It's just not funny. Maybe you have to be in college. I don't know. I had high hopes. I'll go watch Wedding Crashers and Mr and Mrs Smith for the sixth time.",
            "review_date": "2009-12-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie had sooo much potential!!! I was getting ready for the movie to be laugh out loud funny, but it never got there.",
            "review_date": "2009-12-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "After the movie, I felt drowsy.",
            "review_date": "2011-10-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I like JoelZ's response below \"no particaular scene really stands out, just brilliant from start to finish.\" Usually when something is **** brilliant, you can at least pick one stand out scene, my man. One long cliche for the McDonalds public. Enjoy!",
            "review_date": "2011-05-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Yeah in parts it was funny but by the time I watched it all my friends had told me it was amazing and the hype was just that hype. The film was predictable and if I watched it more than once I would probably give up after about 20 minutesYeah in parts it was funny but by the time I watched it all my friends had told me it was amazing and the hype was just that hype. The film was predictable and if I watched it more than once I would probably give up after about 20 minutes because I would realise how bad it was the first time round.",
            "review_date": "2011-05-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is the first comedy I watched where I did not laugh once. Not once, I am serious. What is the problem with this movie ? First of all, it is very obvious that these guys are not friends, but just actors working together. There is not theThis is the first comedy I watched where I did not laugh once. Not once, I am serious. What is the problem with this movie ? First of all, it is very obvious that these guys are not friends, but just actors working together. There is not the slighest feel of a real bond between these guys. They never act like friends, they never talk like friends. Then, each one of the main characters is a cliche, at its worst. The nerd, the fat guy, the handsome guy, and the reliable dreamgroom.\rThe jokes are not funny, and always out of place. Why was this movie made ? Each and every idea has been exploited before, and much, much better...",
            "review_date": "2011-04-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An over rated, over anticipated movie. I didn't find this movie funny at all.",
            "review_date": "2010-04-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "standards are LOW ....\r the 'dumbing down' is almost complete ......\r\n\r\ndo NOT believe what the 'critics' say about this one ....... it is pretty HORRIBLE ......\r\n\r\nthe only half amusing thing in this film are the stillstandards are LOW ....\r the 'dumbing down' is almost complete ......\r do NOT believe what the 'critics' say about this one ....... it is pretty HORRIBLE ......\r the only half amusing thing in this film are the still photos that come up during the end credits .......\r 3 out of 10 \r\rwhere i'd give 'pineapple express' 7 and harold and kumar 8.5  and something like 'dr.strangelove'  a 10",
            "review_date": "2009-08-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Sadly the film lacks a huge amount of heart, but where it lacks in that category it makes up for in tons of laughs, fantastic performances, and originality. I give this movie 73%.",
            "review_date": "2012-02-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the best movies i've seen in a while, no particaular scene really stands out, just brilliant from start to finish.",
            "review_date": "2010-01-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A few lines and sight gags that made you smile but this thing got old and predictable quickly. It seemed like a bunch of cliche ideas that were haphazadly stung together. Probably what you wind up with if you smoked a couple bowls, wrote A few lines and sight gags that made you smile but this thing got old and predictable quickly. It seemed like a bunch of cliche ideas that were haphazadly stung together. Probably what you wind up with if you smoked a couple bowls, wrote down your unrelated thoughts, and tried to tie them together with a lame plot. If you must, wait until it rents and being 'high' when watching it could only improve it.",
            "review_date": "2009-10-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Relying on cheap gag scenes and rarely on witty clever dialogue it gets old real quick and part of you keeps waiting for something hilarious to ensue.",
            "review_date": "2009-06-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Mostly trashy and stupid, with a few chuckles here and there. Juvenile and immoral types will like it.",
            "review_date": "2009-06-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Lame. Shocks are not enough. How about some character development? And you don't have to be a critic to spot lameness. Sorry.",
            "review_date": "2009-06-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Very funny, the writing is excellent and cleverly pieced together. The cast is terrific, especially Ed Helms. Very well edited, good score, outstanding pace. One of the better comedies of the last few years.",
            "review_date": "2010-01-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "VERY WELL DONE. The script was good. the acting was good and the entire movie was funny and thoughtout. There were no moment where youn wanted to get up and leave. This film is so worth watching.",
            "review_date": "2010-01-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie was hilarious. The situations were ridiculous and the characters were all crazy out of their minds on drugs. Watching the fallout of their antics is good old fashioned family entertainment.",
            "review_date": "2010-01-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie was so hilarious! I couldn't stop laughing!",
            "review_date": "2010-03-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I think this movie is one of the most hilarious of all time!",
            "review_date": "2010-05-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This was one funny movie. As the movie progressed, each scene became funnier and funnier. By the time the Chinese mobster was let loose from the trunk and unloaded on the three guys, I was howling. Later, when he tells the guys to suck on This was one funny movie. As the movie progressed, each scene became funnier and funnier. By the time the Chinese mobster was let loose from the trunk and unloaded on the three guys, I was howling. Later, when he tells the guys to suck on his Chinese Nuts, forget it. I was laughing too hard. The next day I tried to describe these scenes to my wife and I couldn't stop snickering. Just the memory alone got me laughing all over again. It was contagious. My wife started laughing along with me as I tried to tell her between laughs how the guy told everyone to suck on his Chinese nuts. And that was just two scenes that were out and out hilarious.",
            "review_date": "2010-06-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "What are you talking about Kenny? The film adresses cliches used in it and avoids them in some parts, making for something truly original. By the way... it's freakin highlarious!!!!!",
            "review_date": "2009-12-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not bad. not great either.... it's everything you'd expect after seeing the trailer. i was hoping for better since it got good reviews but it didn't wow me.... it was average entertainment with a couple laughs. it's Not bad. not great either.... it's everything you'd expect after seeing the trailer. i was hoping for better since it got good reviews but it didn't wow me.... it was average entertainment with a couple laughs. it's basically like a 'dude, where's my car' redux.",
            "review_date": "2009-06-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I don't get it. I went to the movies expecting something as funny as Superbad. Maybe it's because I'm a girl and it's made for men, but it was boring, not funny and not surprising or original (the nerdy nice man going I don't get it. I went to the movies expecting something as funny as Superbad. Maybe it's because I'm a girl and it's made for men, but it was boring, not funny and not surprising or original (the nerdy nice man going wild, the bored teacher learning the value of his family, the strange crazy dude, and the groom going missing). I don't get the phenomenon. Ok, it probably wasn't so bad, but all the positive reviews just make me go \"REALLY?\".",
            "review_date": "2009-06-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Tasteless, mean-spirited, not funny, violent. Can you tell I was disappointed?",
            "review_date": "2009-06-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The few funny bits aren't redeemed by the non-stop vulgarity and crassness. Will appeal most to demented junior high boys.",
            "review_date": "2009-06-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This was an absolute waste of time. The characters actions, of which we see very little, were not believable to the behaviors that they displayed the next day. There was no chemistry, the scenes felt forced and scattered as if there were a This was an absolute waste of time. The characters actions, of which we see very little, were not believable to the behaviors that they displayed the next day. There was no chemistry, the scenes felt forced and scattered as if there were a dozen frat boys trying to tell a coherent story. I don't think I laughed out loud once, each line was cliche and unoriginal. This movie was cruel and moronic and in no way clever or funny. I can't believe the amount of people who enjoyed this film, it breaks my heart that we will most likely see more films like this in the future.",
            "review_date": "2009-06-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The worst movie i have ever seen, truly abominable. i fear for humanity, the US in particular, given this films success. stupid--I never laughed once.",
            "review_date": "2009-06-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "While funny and mostly entertaining, can't say I thought is was nearly as good as many of the others. Much of it was over the top and unbelievable. Want to see a better Vegas movie starring Heather Graham. Rent Swingers.",
            "review_date": "2009-06-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Although \"Hangover\" turned out not to be the 10 my wife and I had hoped for, we found ourselves howling loudly at the many hilarious scenes. We are not fans of raunchy and vulgar movies, but this one at least kept most of the raunch just on Although \"Hangover\" turned out not to be the 10 my wife and I had hoped for, we found ourselves howling loudly at the many hilarious scenes. We are not fans of raunchy and vulgar movies, but this one at least kept most of the raunch just on the adult side of juvenile which made it not only a little more tolerable, but actually amusing. However all the enjoyable humor of the movie instantly dissolved, and every decent bone in our bodies was violated when disturbing pornographic images appeared along with the movie credits. Whether or not they liked the movie, every critic should have issued a warning about these images. Despite one critic writing, \"you WANT to stick around for the credits ... and you don't mind one bit,\" the last thing we wanted to see was an explicit image of a woman performing oral sex. If it can be assumed that the majority of movie audiences who can tolerate some level of vulgarity, would welcome grotesque pornography, then we had better reexamine our values as a society.",
            "review_date": "2009-06-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I finally got a chance togo to this movie, after hearing how hilarious is was, and I must say, I was very disappointed. I enjoy ridiculous comedies as much as the next person, but this movie tried way too hard to make weird stuff funny. The I finally got a chance togo to this movie, after hearing how hilarious is was, and I must say, I was very disappointed. I enjoy ridiculous comedies as much as the next person, but this movie tried way too hard to make weird stuff funny. The Mike Tyson cameo was just plain stupid, and could they not get a better celebrity to do a cameo? Overall, certainly some funny parts, but this movie is not all the rage that some make it out to be.",
            "review_date": "2009-09-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The year's best comedy by far.",
            "review_date": "2010-01-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I wish there was a rating above 10 so the dumb people that vote 0 wouldn't bring this movie down. It is physically impossible to be any funnier. There is a reason that this is the #1 comedy of all time on the DVD charts.",
            "review_date": "2010-02-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Hilarious movie.I must watch for Superbad and Knocked Up lovers. Zach Galifianakis has an amazing part in this movie as well as Ed and Bradley.",
            "review_date": "2010-04-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the best movies EVER!!!! I can't wait till it comes out on DVD, after seeing it in the theater.",
            "review_date": "2009-11-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It was ok, but only a few laughs. Watch Very Bad Things....much better.",
            "review_date": "2009-12-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Wow, I haven't seen a movie this over hyped since...last summer! Not nearly as funny as all the bro's out there seem to think, but then again...UFC is really popular.",
            "review_date": "2009-07-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Overdone raunch that lacked true humor. More like a middle school bathroom conversation between preteens that never happened.",
            "review_date": "2009-07-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "VERY DISAPPOINTED...i came in looking forward to a good comedy after reading all these reviews and all i got were cheap one liner jokes. Laughed a couple of times, but never a laugh out loud moment...some parts were just stupid, and i feel VERY DISAPPOINTED...i came in looking forward to a good comedy after reading all these reviews and all i got were cheap one liner jokes. Laughed a couple of times, but never a laugh out loud moment...some parts were just stupid, and i feel that with the story they had they could have made this much more funnier. without zach galifinakis i would have gave this movie a 0.",
            "review_date": "2009-07-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie was obviously written for five year olds. Amusing at best. Manages to combine plain bad taste in places with weirdness in others.",
            "review_date": "2009-08-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Outstanding! I didn't know what i was getting myself into. My brother said it was good, to me it looked like any other Vegas drunk comedy. I was very glad to find out it was anything but ordinary. I couldn't stop laughing. I had to Outstanding! I didn't know what i was getting myself into. My brother said it was good, to me it looked like any other Vegas drunk comedy. I was very glad to find out it was anything but ordinary. I couldn't stop laughing. I had to watch it again, the jokes keep coming so steady that i laughed so hard i missed a lot of the movie. It sucks to be that guy that hated it, this movie is GENIUS!",
            "review_date": "2010-01-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The movie was about 4 guys going to Las Vages for a barchler party one ends up getting lost This movie was like no other,it was outrageously funny must see movie, they didn't waste time with off topic things This movie left you wanting The movie was about 4 guys going to Las Vages for a barchler party one ends up getting lost This movie was like no other,it was outrageously funny must see movie, they didn't waste time with off topic things This movie left you wanting more,it wasn't slow and boring,it was fun and out going film all the way threw I think this movie was amazing and a must see film.",
            "review_date": "2010-01-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "R rated movies have always felt a little too dirty for me. With all the adult content I sometimes wonder whether I can handle an R rated movie. Up until today the only really good R rated movie I saw was Super Bad. However, the Hangover R rated movies have always felt a little too dirty for me. With all the adult content I sometimes wonder whether I can handle an R rated movie. Up until today the only really good R rated movie I saw was Super Bad. However, the Hangover knocks that movie out of the ballpark. The plot of the film is essential these four guys have decided to have a bachelor party in Vegas. So they go out and have a good time. Come next morning though the bachelor is nowhere to be found and three guys can't remember anything from the night before. So begins their hilarious quest to find Doug, the bachelor. Most of the humor in this movie revolves around these guys finding out what it was they did the other night. Without giving anything away all I'm going to say is that these guys did some serious s-word. The core of this comedy is these guys finding out what they did through the consequences of their actions. Throughout a good portion of that part of the film I was laughing my head off. However, the jokes began to dry out after the trunk incident. Nonetheless when this water is boiling it makes the kettle whistle. For any parents reading this let me assure that the Hangover isn't the most adult movie in the world. Most of the R rated content comes in the form of the language used. In fact there was nothing really that disturbing in this movie. Nonetheless, this movie is still for the more mature audience. The Hangover is the comedy. It will make you laugh so hard that you'll either throw your head back clap your hands, or both. However, the humor fails to endure for the entire film . Nonetheless, the movie is hilarious long enough for me to give it an 85/100. However, since Metacritic doesn't do decimals I'm stuck giving my secondary opinion. Bottom line go watch this movie for what it's worth, this movie is a freaking good time.",
            "review_date": "2010-06-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Pure comedy. Loved it from the first to the last, the direction was in some ways unique, but not the only one of its kind. It was worth the wait to watch this movie, the trio couldn't have been more perfect.",
            "review_date": "2009-11-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Though the film has strong performances, there are far too many gaps in the movie that just aren't funny. Zach G. makes up for the lack of comedy with a standout role.",
            "review_date": "2009-12-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Okay, if I had only watched in once I would have given it a 5, but it was actually funnier the 2nd time around. Still not as funny as everyone makes it out to be, and I doubt I'll watch it a 3rd time unless there is nothing else on and Okay, if I had only watched in once I would have given it a 5, but it was actually funnier the 2nd time around. Still not as funny as everyone makes it out to be, and I doubt I'll watch it a 3rd time unless there is nothing else on and it's on cable somewhere.",
            "review_date": "2009-12-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the best comedies I have ever seen, really enjoyable to watch with a great story and cast.",
            "review_date": "2009-11-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Just saw it 2nd time and it still was funny. i haven't laughed this hard @ a comedy in ages. maybe some of the jokes are cheap but they come in such good acting you don't care. the plot is brilliant, it keeps you guessing Just saw it 2nd time and it still was funny. i haven't laughed this hard @ a comedy in ages. maybe some of the jokes are cheap but they come in such good acting you don't care. the plot is brilliant, it keeps you guessing what's next. its refreshing for the comedy genre to have a main plot that actually intrigues. for a comedy flick, it doesn't get much better than this.",
            "review_date": "2009-12-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "its been along time since i seen a comedy that gave me a good laugh . the hangover turned out to be the first one in a long time to do so. its jokes can be clever , rediculas and ruanchy but pulls them off pretty well. after waching it 3its been along time since i seen a comedy that gave me a good laugh . the hangover turned out to be the first one in a long time to do so. its jokes can be clever , rediculas and ruanchy but pulls them off pretty well. after waching it 3 times which i dont think ive done for any commedy since the wedding crashers i can still get a few laughs out of it . its a solid commedy in years where every other one is very predictable or about as funny as waching a door close .",
            "review_date": "2011-05-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Are you kidding me?How can you not like this movie.Every part of this movie is amazing and funny.I have been waiting for a movie like this to come out for years.This is the kind of movie you can watch over and over again and relate to it inAre you kidding me?How can you not like this movie.Every part of this movie is amazing and funny.I have been waiting for a movie like this to come out for years.This is the kind of movie you can watch over and over again and relate to it in one way or another.I hope they make a sequel cause it's set up were it can have a great sequel.Great movie!",
            "review_date": "2010-11-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "There are plenty of great moments in this raunchy comedy and it's definitely the funniest movie of the 2009, combining abdsurdity and vulgarity like I have never seen before.Still, I also feel like it relies too heavily on shock value toThere are plenty of great moments in this raunchy comedy and it's definitely the funniest movie of the 2009, combining abdsurdity and vulgarity like I have never seen before.Still, I also feel like it relies too heavily on shock value to induce a response from the audience rather than actual substance (though I'll feel that way about any movie that feels the need to show an old man's ass crack for no reason). It's not brilliant but it definitely gets the job done, and then some.",
            "review_date": "2010-08-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I agree with my sweet heart husband, This movie was and still very deep, If you talk about real this movie real than real, trust this word and believe it.Just watch with more focus because every part relate the other and never never changeI agree with my sweet heart husband, This movie was and still very deep, If you talk about real this movie real than real, trust this word and believe it.Just watch with more focus because every part relate the other and never never change your mined to watch it, watch this movie over and over because  very grate movie. I give this movie 10",
            "review_date": "2010-11-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of my favorite comedies of all time. Purely for entertainment. Not a kids movie whatsoever.Pretty much every scene generates laughter. The entire theater roared for most of the flick.Definitely one to watch.",
            "review_date": "2010-08-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "LOVED IT!!!! Can't wait for the 2nd one to come out because I enjoyed the whole story and 'Alan' is a hoot!! I watch this movie again and again. Hope the 2nd is just as good OR better!!!",
            "review_date": "2010-09-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This was one of those movies I had little expectation walking into. It turned out to be hilarious. Now I have this urge to go to Las Vegas. The second part to hangover just sucked so this first installment really gets its thumbs up!",
            "review_date": "2011-07-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Quite Frankly one of funniest movies since Knocked Up. And newcomer Zach Galifianakis Steals the show. Though it has its flaws the movie simply cant be missed.",
            "review_date": "2010-10-01",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 131
}