{
  "title": "Baby Geniuses",
  "rating": 3.2,
  "release_date": "1999-03-12",
  "summary": "Two doctors (Turner and Lloyd) set out to dominate the world once they discover they can crack the code to a secret baby language.",
  "critic_reviews": [
    "Formulated on an idiotic idea and develops a predictably lackluster motion picture from it.",
    "This movie wasn't nearly as bad as I thought it would be. It's still not that good though.",
    "Bad films are easy to make, but a film as unpleasant as Baby Geniuses' achieves a kind of grandeur.",
    "Formulaic and deeply unfunny.",
    "About as endearing as unanesthetized gum surgery.",
    "The laughs are few, far between and pretty darn faint in this comedy.",
    "The hokey dialogue and witless physical gags keep everything painful and hectoring.",
    "There are ticklish moments, but no real laughs.",
    "A thoroughly misguided, unfunny film that proves you shouldn't beat a dead horse.",
    "The worst movie of 1999.",
    "One way to get through Baby Geniuses is to think about whether it really is the worst movie you've ever seen. Probably not, but pretty darn close.",
    "A stupid comedy with toddlers talking like hip '90s grown-ups.",
    "Trying to encapsulate the movie's storyline is not possible; it doesn't appear to have one.",
    "A horrible, horrible film that wears out its welcome before its opening credits."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Really Really Really Super Uncreative, Plot Is Trash, The Cast Is Just Blech, One Of The Worst Directors Of ALL TIME!\rOne Of The Worst Movies I Have Ever Seen In My Whole Life (I'v Seen This & Titanic :)",
      "review_date": "2012-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There must be a standard as to how bad movies get, but this is just ridiculous. Hard to believe they made a sequel to this considering how bad this movie was. The idea for it is the worst I've heard of, and this movie might just match up toThere must be a standard as to how bad movies get, but this is just ridiculous. Hard to believe they made a sequel to this considering how bad this movie was. The idea for it is the worst I've heard of, and this movie might just match up to how bad Howard the duck was.",
      "review_date": "2012-11-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Baby Geniuses is possibly the worst movie I have ever seen.It is full of bad acting,bad jokes,and worst of all a bad story line. Baby shooting off one liners may sound funny but it is not. Call those jumping jacks? More like jumping jerks!Baby Geniuses is possibly the worst movie I have ever seen.It is full of bad acting,bad jokes,and worst of all a bad story line. Baby shooting off one liners may sound funny but it is not. Call those jumping jacks? More like jumping jerks! Yeah this is some real quality stuff. Sadly that is one of the better quotes in the movie. The fight sequences are so bad it is almost funny to watch. After seeing guys with guns chase a baby,and then the baby defending himself with kung-fu that looks like something from the Matrix you know you are watching a bad movie. The musical score is terrible beyond explanation,and never backs up the dialouge or the scene of the movie. You can not blame the actors (even though there bad) for there acting no one can make that script sound good. All in all this is the one of the worst movies ever and you should not see it!!!!!!!!!!",
      "review_date": "2010-08-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Really Annoying Movie!",
      "review_date": "2012-06-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "How did this movie even pass anything? It has one of the worst ideas ever, with terrible acting and a terrible script all together. I know this is a kids movie, but I don't see how any kid would appreciate this. It even has awful humor thatHow did this movie even pass anything? It has one of the worst ideas ever, with terrible acting and a terrible script all together. I know this is a kids movie, but I don't see how any kid would appreciate this. It even has awful humor that seals the deal.",
      "review_date": "2013-11-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "We all come across some memorable and beautiful films a lot of the time, films that do not disappoint and makes us all happy. That is not the case with \"Baby Geniuses\", a film released in 1999 starring Christopher Lloyd and Kathleen Turner asWe all come across some memorable and beautiful films a lot of the time, films that do not disappoint and makes us all happy. That is not the case with \"Baby Geniuses\", a film released in 1999 starring Christopher Lloyd and Kathleen Turner as the main villains. The film was directed by Bob Clarke; if you are unfamiliar with this director, he directed the memorable holiday movie \"A Christmas Story\". So why did the director start to make these kind of films? We my never know.\r \"Baby Geniuses\" sounds like a movie that would come free with a box of diapers, put your child in the diaper and he/she will instantly become smarter than any other infant out there. These babies do not prove to be a genius at all, this film should be properly titled \"Baby Smart-alecs\". Because these so called \"babies\" have a bad mouth, cursing and fooling around with others to annoy the audience instead of being funny. Besides the fact that these infants are unlikable, all the other characters are about as hated as the toddlers. You should not care for any of the characters in the movie much less like them.\r The jokes are all unfunny and some even repeat; for example, a few characters say the term \"diaper gravy\" a total of three times in the movie. I guess the screenwriters of the film liked this joke so much that they wanted to repeat a poop joke. Another example is when two men dressed as janitors try to capture one of the infants, the scene then turns into a cat-mouse situation where one of the men predict that they will be hit in the balls with a ski board. Obviously the man does get hit and walks out, the other man who is also dressed as a janitor comes and the exact same thing happens, I am not even kidding. Besides jokes repeating, every joke tries to be funny and original, none of the jokes are funny nor original.\r The film starts out with the two main villains (played by Christopher Lloyd and Kathleen Turner), they announce their new park properly titled \"Joyworld\". The scientists both think that every baby is born to use a secret language that adults cannot hear. One of the geniuses named Sylvester escapes the hands of the two villains by jumping in a dirty diaper truck (this is supposed to be funny for some reason). Sylvester finds his twin brother who apparently never knew each other for some reason, but one of them is kidnapped by the two villains and is tested to do more experimenting.\r Another thing to mention is that when the infants talk their mouth never sync with the voices in the background. This happens from beginning to end, even the voices cannot help this movie be any better. The film editors could have made the infants not talk, but still have the voice overs. This film could have been like \"The Adventures of Milo and Otis\" where the animals never move their mouths, but still have voice actors talking for them.\r \"Baby Geniuses\" is a movie that should not have ever been shown to the public and instead left on the shelf. Be sure if you are buying/renting a family movie, make sure you walk past this one.",
      "review_date": "2015-07-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Movies like this one shouldn't be allowed, kids that I know hate this movie, it's cheap and senseless. It's incredible that TV programs such as Curious George can be much more interesting than this poor product.",
      "review_date": "2012-12-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This has to be one of the most atrocious films I have ever laid eyes on. I went into this film thinking it would be slightly decent, because Bob Clark was directing it, I guess I was completely wrong.",
      "review_date": "2013-03-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Seriously this movie is so bad\r........................................................\rit flips you in some kind of vortex\r\n.........................................................\r\n.........and becomes amazing.......Seriously this movie is so bad\r........................................................\rit flips you in some kind of vortex\r.........................................................\r.........and becomes amazing.......\r...................somehow.....................",
      "review_date": "2016-04-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was really bad. The acting is ridiculous and the idea of baby's bieng as smart as adults is just stupid. Honestly i don't know how they were a aloud to make 4 move movies after this on! DO NOT WATCH THIS MOVIE!",
      "review_date": "2014-12-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If babies were really geniuses, then they would know anything about this movie not being a good idea. They would tell the people who were making this film to stop at what they were doing and abandon the entire idea.",
      "review_date": "2016-01-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I've heard a lot of hubbub among the cinephile circles that Baby Geniuses is one of the worst films of all time. I wanted to watch it and see for myself if this was the case. Well...the legends were true. This movie is boring, offensive, andI've heard a lot of hubbub among the cinephile circles that Baby Geniuses is one of the worst films of all time. I wanted to watch it and see for myself if this was the case. Well...the legends were true. This movie is boring, offensive, and awfully made. A vast majority of the jokes are oddly sexual and seem really inappropriate for the target audience. I would never ever let my children watch this movie, as I feel it would promote sexual degeneracy and it might influence my children to call in a fake bomb threat someday. Oh yeah, that's a thing that happens in this movie. Baby Geniuses is just so blindly idiotic that it should never ever be watched by anyone ever again. There are a lot of way better children's movies out there. Please show your kids something else instead.",
      "review_date": "2019-10-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Here's an easy way to tell if Baby Geniuses is for you. Question 1, do you enjoy intelligent and well thought out humour? If yes, get the hell outta here. Question 2, have you recently suffered severe brain injuries? Or are you 1 year old? IfHere's an easy way to tell if Baby Geniuses is for you. Question 1, do you enjoy intelligent and well thought out humour? If yes, get the hell outta here. Question 2, have you recently suffered severe brain injuries? Or are you 1 year old? If yes you may find some small, tiny, almost non-existent form of entertainment. However, if you possess enough mental capability to be trusted with scissors, this movie is as predictable and immature as it gets. Steer clear.",
      "review_date": "2016-06-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I grew up watching this movie. its somewhat funny. and it appeals more towards kids. obviously most adults wont find it fun! this movie isnt that bad. so im giving it a 5.",
      "review_date": "2011-08-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What are the directors of this movie thinking. Just think of it. 1 year olds are beating up 40 year olds. Now does that make any sense?",
      "review_date": "2007-01-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Fantastic! Finally the film world has brought us something to rival the Kubricks, Scorseses and Welles'. If you enjoyed this masterpiece, i strongly recommend Fudge-a-mania or Karate Dog!",
      "review_date": "2007-06-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Really funny movie. Its a great movie to watch with the family.",
      "review_date": "2006-05-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "i love d this film my kids would'nt stahp laughing it was so good  . i loved it soooo much i made by hubby take me to lichtinstein, it was as beautiful as this film. i may have beena  bit tipsy but the vid and saund fx were fantastic plz makei love d this film my kids would'nt stahp laughing it was so good  . i loved it soooo much i made by hubby take me to lichtinstein, it was as beautiful as this film. i may have beena  bit tipsy but the vid and saund fx were fantastic plz make more and send $$ thanks.",
      "review_date": "2015-03-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It was meant for children so it should be rated by children. Not the best movie I have ever seen but certainly not the top ten worst.",
      "review_date": "2007-07-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There is not enough pot in Jamaica to make this movie funny.",
      "review_date": "2007-08-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Im really suprised to find this movie in the top 10 worst rated movies...... It wasnt a great movie it wasnt even an average movie but top 10 worst movies? Its not looking to be a masterpiece its looking to appeal to little kids. I dont Im really suprised to find this movie in the top 10 worst rated movies...... It wasnt a great movie it wasnt even an average movie but top 10 worst movies? Its not looking to be a masterpiece its looking to appeal to little kids. I dont understand why every single movie is reviewed the same way if you are a professional movie critic why would you rate a childrens B movie the same way you would rate an academy award winner?",
      "review_date": "2005-11-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "You know when you read a review and the critic says \"it hurt to watch this movie\" and you think \"oh behave, it's just a movie, grow up.\"... this one literally hurts to watch. I felt actual pain watching it. Genuinely gave me a headache. ItYou know when you read a review and the critic says \"it hurt to watch this movie\" and you think \"oh behave, it's just a movie, grow up.\"... this one literally hurts to watch. I felt actual pain watching it. Genuinely gave me a headache. It may just be the worst movie ever made. You'll turn it off exactly three minutes into it, I won't explain exactly why because honestly I really don't need to, the scene speaks for itself in how absolutely ridiculous it is. I persisted solely due to what I assume is a weird masochism I have.Google just told me it got a sequel. I will never watch that. I'm not THAT masochistic.",
      "review_date": "2023-01-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was a game changer. I have stopped combusting and started thinking",
      "review_date": "2022-05-01",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 37,
  "genres": [
    "Sci-Fi",
    "Comedy",
    "Crime",
    "Family"
  ]
}