{
  "title": "Being John Malkovich",
  "rating": 8.7,
  "release_date": "1999-10-29",
  "genre": [
    "Drama",
    "Fantasy",
    "Comedy",
    "Romance"
  ],
  "summary": "An out-of-work puppeteer takes a filing clerk job on the cramped 7 ½ floor of an office building where he discovers a hidden tunnel allowing him to enter the mind and life of actor John Malkovich for 15 mintues before being ejected onto the New Jersey Turnpike.",
  "critic_reviews": [
    "Gloriously inventive, delightfully nutty comic treasure is unlike anything you've ever seen.  It's lunatic.",
    "If we're allowed just a couple of truly singular discoveries in twelve months, it's a good year; when one of them is a film as exhilarating as Spike Jonze's feature debut, it's a banner year.",
    "Irresistable, nimble and very funny.",
    "The most excitingly original movie of the year.",
    "A wildly inventive, unrelenting thrill that amazes us with its visual and intellectual treats and dazzles us with its ongoing ingenuity.",
    "Absolutely, see the movie.",
    "Either Being John Malkovich gets nominated for best picture, or the members of the Academy need portals into their brains.",
    "Breathlessly imaginative.",
    "Devilishly inventive and so far out there it's almost off the scale.",
    "But then Being John Malkovich is a brilliant juggling act, too, brilliantly brought off.",
    "It's the film we leave most movie theaters wishing we'd seen instead.",
    "Smart people will relish its temerariousness, average people will smile awkwardly and comment that it's \"kinda different,\" and dimly lit people may mistake it for the Elmo movie and drool quietly in the back rows.  It's a movie for everyone.",
    "It's a cheerfully deranged stunt, executed in a spirit of infectious lunacy that powers the resulting film to its strongest laughs, and weirdest depths.",
    "So full of creativity, so subversive, so alive.",
    "A clever and outrageous piece of whimsical fantasy that is unique, unpredictable and more than a little strange.",
    "Weird, beguiling premise.",
    "It's among the most inventive, screwily funny and consistently surprising movies I've seen in years.",
    "It's tremendously entertaining, and probably worthy of repeat viewings.",
    "This outrageous comic fantasy may not sustain its brilliance throughout all of its 112 minutes, but it keeps cooking for so much of that time that I don't have many complaints.",
    "Surreal to the point of poeticism, amusing and tragic by turns.",
    "The most offbeat studio comedy since \"Rushmore.\"",
    "It's a gleeful, nitrous-oxide high.",
    "Everything I've ever dreamed of in a crazy comedy.  It's close to pure farce, yet its laughs are grounded in loneliness, impotence, self-loathing, and that most discomfiting of vices to dramatize: envy.  The action is surreal, the emotions are violently real.",
    "(Jonze and Kaufman's) work is so bold, funny, and original that it's hard to believe they aren't wide-screen veterans.",
    "It's essentially a one-joke situation, but screenwriter Charlie Kaufman and first-time director Spike Jonze definitely make the most of it.",
    "This is the most impressive directorial debut since\"Reservoir Dogs.\"  Being John Malkovich is weird, all right-- the best kind of weird, the kind you haven't seen before.",
    "Bizarre, utterly original and truly indescribable comedy...You just have to see it for yourself."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Being John Malkovich really is a film like no other. Director Spike Jonze and writer Charlie Kaufman's vision for the film is so complete, so unique and off-the-wall, it makes for an utterly spellbinding viewing experience. The performancesBeing John Malkovich really is a film like no other. Director Spike Jonze and writer Charlie Kaufman's vision for the film is so complete, so unique and off-the-wall, it makes for an utterly spellbinding viewing experience. The performances are all superb, and many a far cry from the respective cast member's usual roles.John Cusack makes a very engaging, if highly unlikeable protagonist as Craig Schwatz, an ambitious but morally bereft puppeteer, who finds a mysterious portal into the head of John Malkovich. Malkovich, quite amusingly, gives one of the best performances of his career, playing a parody of himself, who is unwittingly used by a whole host of people for entertainment, entrepreneurial ventures and for a far more sinister purpose. Cameron Diaz, Catherine Keener and Orson Bean are all excellent too as Craig's unfulfilled, animal-loving wife, his sexually deviant co-worker and his ancient and looney boss respectively. Being John Malkovich delivers on all fronts, from the cast playing a weird and wonderful array of characters to Spike Jonze's tight and controlled direction, Lance Acord's cinematography perfectly capturing the simple, yet effective visuals, Carter Burwell's fantastic score and especially Charlie Kaufman's slick, sharp and side-splittingly funny script. It's surreal, dark, well-written and simply hilarious. It's also superbly odd, bordering on lunacy, but in a good way. There's nothing else like it, and there likely never will be. By the end of Being John Malkovich, you've certainly been on a journey - you're not certain where you've been, or what it all means, but by God you had a good time.",
      "review_date": "2012-02-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best movie of all time . One of the better films of the past few years.A strikingly original and often brilliant movie that seems to run out of steam in the last 15 minutes, but then again, maybe its supposed to.",
      "review_date": "2011-08-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a very strange movie. It is a drama with a little bit of fantasy thrown in. It kind of keeps you on the edge of your seat in anticipation sometimes to see what this messed up situation will do to the romantic relationships between theThis is a very strange movie. It is a drama with a little bit of fantasy thrown in. It kind of keeps you on the edge of your seat in anticipation sometimes to see what this messed up situation will do to the romantic relationships between the people involved. The scene with all of the John Malkovich's at once is hilarious. Personally, I enjoyed this movie. If you're into well-written dramas or off the wall movies you will like this movie. If you want a typical Hollywood action movie or romantic comedy this movie is not for you.",
      "review_date": "2013-01-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Without a doubt, one of the best films of the 1990s. Dark, hilarious, and brilliant. Spike Jonze gives us a mindbending science fiction dark comedy with top-notch performances from the entire cast.",
      "review_date": "2013-12-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": ",,,,,,,,,,,,,,,,,,,,,........+×÷=@#$%-\":;^%&!*?(),.€£_《》¤•°⊙☆¡¿♧◇♡♤■□●○▪°•°•°•°•{}[]°•°•°•~~°•°••°°•",
      "review_date": "2021-05-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Being John Malkovich is the work of a clearly twisted individual (Director Spike Jonze) but its hard to deny that Jonze is unbelievably talented as he balances multiple plot threads and complex characters while managing to infuse the filmBeing John Malkovich is the work of a clearly twisted individual (Director Spike Jonze) but its hard to deny that Jonze is unbelievably talented as he balances multiple plot threads and complex characters while managing to infuse the film with a hilarious satirical element. The film follows a professional puppeteer (John Cusack) as he is forced to take a position as a file clerk in an oddly shaped office building at his animal loving wifeâ",
      "review_date": "2012-02-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Watched this movie again last night after not seeing it for years. It really is a fantastic film. Charlie Kauffman never fails to come up with bizarre and intriguing scripts, and Spike Jonze is also on his A-game. This movie starts off on aWatched this movie again last night after not seeing it for years. It really is a fantastic film. Charlie Kauffman never fails to come up with bizarre and intriguing scripts, and Spike Jonze is also on his A-game. This movie starts off on a strange note, and it continues to spiral into a twilight zone of hilarious proportions. I don't even like Cameron Diaz, but I thought she was very good in her role, and I loved the rest of the cast as well. If you are looking for a film that is unlike any other film you have ever seen, or ever will see, then this film matches that criteria. It's a lot of fun, but also has some interesting things to say about real life issues.",
      "review_date": "2012-02-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Malkovich Malkovich, Malkovich? Malkovich Malkovich Malkovich Malkovich, Malkovich Malkovich Malkovich. Malkovich Malkovich Malkovich, Malkovich! (Genius!)",
      "review_date": "2014-08-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"Being John Malkovich\" must surely rank as one of the most inventive, original, and yet daring films of the last ten years. A metaphysical journey about the desire to transform oneself involving identity, gender, and creativity. It's silly,\"Being John Malkovich\" must surely rank as one of the most inventive, original, and yet daring films of the last ten years. A metaphysical journey about the desire to transform oneself involving identity, gender, and creativity. It's silly, unpredictable, and completely faithful to its distinctive, perverse vision. A brilliant premise written by the Charlie Kaufman, and masterfully directed by Spike Jonze. A truly an ingenious film and considered a modern day classic.\r Craig Schwartz (John Cusack) is stuck in a frustrated rut in his life. His pet obsessed wife Lotte (Cameron Diaz) seems more concerned with providing a decent home to various animals as opposed to satisfying his marriage needs. Also, money is drying up, Craig's dreams of becoming a world-famous puppeteer appear to be eroding, and he is pressured into finding a job. Because of his quick hands, a skill necessary for artful puppetry, Craig applies for a job as a filing clerk. His job requires him to work on the seventh and a half floor in a strange office block. His days are spent trying to persuade the object of his attention Maxine (Catherine Keener), into having an affair with him.\r While losing a file behind a storage cabinet one day, Craig discovers a strange and murky tunnel hidden behind the cabinet. Crawling inside, Craig finds the tunnel to actually be a portal, and the destination is inside the actor John Malkovich's head! Although Craig has no say with regards to Malkovich's actions, he can clearly witness and influence what the actor is doing. Fifteen minutes later, Craig is forced out of Malkovich's head, and dumped along side the New Jersey turnpike.\r Part of the pleasure in watching \"John Malkovich\" is seeing these actors at full creative throttle, and knowing how much they relished the insanity of the script. But it's clearly Malkovich who has the most fun here. Spoofing oneself is usually therapeutic, but for Malkovich whose reputation as an intellectual prima donna, must have been ecstatic at an incredibly unique opportunity.\r Without spoiling what follows, \"Being John Malkovich\" features a fine cast of dryly-comic actors who are very much in on the joke. That can even be said of Charlie Sheen, who turns up for some wicked self-parody in a film that also features cameo appearances by Sean Penn, Brad Pitt. \"Being John Malkovich\" doesn't bog down in allegories, while remaining tremendously entertaining and thought provoking, and definitely worthy of repeat viewings. Fantastic performances all around by the entire cast, but especially by Cusack and Malkovich. Nominated for three Academy Awards.",
      "review_date": "2013-08-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "¿What if you find a trap door to the mind of your favorite actor? In lesser words this the notorious prima opus of Spike Jonze, with script of so notorious Charles Kauffman, making an witty mixture of fantasy, romance and comedy. The sequence¿What if you find a trap door to the mind of your favorite actor? In lesser words this the notorious prima opus of Spike Jonze, with script of so notorious Charles Kauffman, making an witty mixture of fantasy, romance and comedy. The sequence of John Malkovich exploring his own mind and finding a Malkovich-verse is for anthology. A must to see.By the way, Happy Birthday Mr. Malkovich (December the 9th).",
      "review_date": "2019-12-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Usually you are waiting to go, \"oh, this is that kind of a film\" it never happens.Being John Malkovich\n\nSpike Jonze makes films about humans. I know what you are thinking. None of his films, even the ones with human faces crowding theUsually you are waiting to go, \"oh, this is that kind of a film\" it never happens.Being John MalkovichSpike Jonze makes films about humans. I know what you are thinking. None of his films, even the ones with human faces crowding the screen actually take a route through them. Yes. He never does take a simple route. Although his film will always be effortless. Setting up the premise with an ease, is sugarcoated by sharp witty humor that does its own magic before the curtain drops too. What lies beneath is a thundering drama, zapping you with practically anyway, in any perspective you can see this head spinning concept explored with. But I don't want to just mention his contribution to what remains a story or a film that I do not understand to this date.This is equally the writer, Charlie Kauffman's film. Coming from a comedic background, he can balance the humor with the drama- that he has worked exceptionally on- with his eyes closed. And it is also one of those rare screenplays that is considered to be the most unique in cinematic history and yet feels the most known and formidably a captivating show of a seen-this-seen-that humanization of the wooden faced puppets. Incredibly scary and achingly funny in what it has to procure.And you'd think that with such unique elements that the film is embedded with, the makers would be careful. But they are instead carelessly throwing, pitching ideas left and right in this battlefield. It is basically a football game. Chaotic chase, the last run, the last whistle that is always about to blow in this section of the game, the film is exhaustingly amped up in its speech throughout the course of the film. Being John Malkovich might start off as a social satire only to evolve into what you might think as a political statement before revealing into what we call, a human nature.",
      "review_date": "2019-09-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Being John Malkovich is has great acting and a cool concept. A puppeteer discovers a portal into the\rmind of John Malkovich. John Malkovich is in the movie, he plays himself and he gives many\rfunny lines throughout the movie. This movie isBeing John Malkovich is has great acting and a cool concept. A puppeteer discovers a portal into the\rmind of John Malkovich. John Malkovich is in the movie, he plays himself and he gives many\rfunny lines throughout the movie. This movie is one of the most original and visually diverse movies\ryou'll ever see. The twist in the movie is funny and the movie will never be duplicated, A+.",
      "review_date": "2014-07-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Very strange film like a spirit labyrinth.\rJust awesome epic scenes with joke ;)\rU hate or u Love it but u must to see him !!!\rI absolutly love it !!!",
      "review_date": "2013-01-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I'm not going to lie, I did not like this movie the first time I saw it. But after I saw Adaptation and Eternal Sunshine, I watched B.J.M. again and I realized what I missed the first time, the whole thing. The originality is beyondI'm not going to lie, I did not like this movie the first time I saw it. But after I saw Adaptation and Eternal Sunshine, I watched B.J.M. again and I realized what I missed the first time, the whole thing. The originality is beyond impressive. I also never thought Cameron Diaz could look so ugly. Yes, the movie is a huge metaphor, so people who consider movies like Norbit or Transformers to be the best movies will not appreciate nor understand this. There is  nothing like this",
      "review_date": "2011-01-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best part of the entire movie is when puppeteer Schwartz (John Cusack) is punched by a father conveying his disappointment in the perversion of a puppet show, which are typically enjoyed by children.  The Puppeteer",
      "review_date": "2012-08-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An appaling waste of time and talent. Shallow, unlikeable characters; unpleasant, jumbled cinematography, a shoddy script and no redeeming characteristics whatsoever.",
      "review_date": "2006-02-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was one of the silliest things i have ever watched! It doesn't make sense at all, i don't really know what to write! I'm dumbfounded by how silly this movie is",
      "review_date": "2007-10-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Absolutely awful in every way, shape and form. No likable characters, a scatterbrained story, and just mean-spirited. Avoid at all costs. Please, for your own sake, avoid this movie!",
      "review_date": "2011-08-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I am a little confused about this movie. And frankly speaking before I read other comments, I can not understand this movie. But to some extent, I think it is a good movie but not perfect one.",
      "review_date": "2011-06-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Being John Malkovich is hillarious and rare, contains surrelism, absurdity, Kaufman-style. But I think Eternal Sunshine of  Spotless Mind still top of it. No head-f**kery this time",
      "review_date": "2011-02-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The most unique film that I have seen in a while. I could never guess what turns the plot would make. My biggest problem with the film is the fact that it is underpinned by relatively generic archetypal characters (such as the strugglingThe most unique film that I have seen in a while. I could never guess what turns the plot would make. My biggest problem with the film is the fact that it is underpinned by relatively generic archetypal characters (such as the struggling tragic artist and the **** hot co-worker) which makes it difficult to become attached to the main characters. However, it is easy to overlook this flaw due to the films numerous accomplishments.",
      "review_date": "2017-06-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Weirder than a rabbit riding a pony.  Sure, sometimes it's funny, and it's certainly original, but it's also perverted and it condones just about every type of sexually immoral relationship out there.  Well, except for the illegal types, butWeirder than a rabbit riding a pony.  Sure, sometimes it's funny, and it's certainly original, but it's also perverted and it condones just about every type of sexually immoral relationship out there.  Well, except for the illegal types, but it's still pretty messed up.  But anyways, just about every part of this movie is bizarre.  The characters are bizarre.  The concept is bizarre.  Even their workplace is weird!  (The ceilings are about 4 ft. tall and everyone has to walk on their knees.)  Bottom line; It's unlike anything else out there, but if I told you that it makes less than no sense, I'd be being extremely generous.",
      "review_date": "2013-11-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Now, if you want to see a movie that takes horrific cruelty and wraps it up in quirky comedy wrapping paper from Wal-Mart, grab a copy of Being John Malkovich. But don't watch it. Instead, burn it. Burn them all. Because Malkovich takes theNow, if you want to see a movie that takes horrific cruelty and wraps it up in quirky comedy wrapping paper from Wal-Mart, grab a copy of Being John Malkovich. But don't watch it. Instead, burn it. Burn them all. Because Malkovich takes the torture-wrapped-in-comedy genre to such a far degree that just thinking about it makes me sick. I no longer like seeing John Malkovich, Cameron Diaz, Catherine Keener, or John Cusack on screen in anything. I'm not exaggerating here, just seeing one of them makes me shudder. This movie is such a perversion of film and the human mind that I want my memory erased after watching it.\rI want to forget how this movie made me feel. I'm not holding back. Here's everything I haven't successfully repressed:\rJohn Cusack is a creepy and depressed guy who lives with his creepy and depressed wife. Their entire existence and atmosphere in the film is miserable. Everything about it is uneasy. Cusack is a puppeteer, and in the film's opening, he makes two puppets bang while a young girl is watching him perform on the street. The film's best part occurs when the girl's father punches him in the face and destroys his display. Oscar for Best Supporting Actor goes to Suckerpunch Guy. I f**king mean it. Give that guy a career.\rSo Cusack joins this creepy company, and there's a door leading into John Malkovich's brain, where you can see through his eyes for 15 minutes. After 15 minutes, you magically appear on the turnpike just outside of New York, conveniently a few miles away. Why? Who cares!? The film is quirky! It doesn't need logic, or thematic elements, or quality in general.\rCusack and his creepy and depressing coworker sell 15 minute excursions into Malkovich's head for a while, until they realize that they can control him if they focus hard enough. So they start doing that, and they replace Malkovich's conscience (John Malkovich plays John Malkovich, a flat character who is... creepy and depressed. Great.), and in the end, Malkovich must consciously sit by as this dirty creep controls his mind and perverts his body, destroying his soul. No one is happy. Nothing good happens. Nothing intelligent happens. Malkovich just gets **** on, Cusack locks his wife in a cage. It's creepy and depressing. It's disgustingly cruel, and it insults us by pretending it's all a joke.\r\"Come on guys, we'll laugh about this someday.\" said Spike Jonze as devil's horns emerged from his forehead. Hey, you hear that? Sounds like the cries of the damned to me.\rIf Jonze's 2013 romance film Her hadn't been such a masterpiece, I'd probably hate him. He redeemed himself for this one, so I can let him off with a warning. Every director ever: making films like these is like putting the Boogie Nights disc in What About Bob's box. Stop selling these as comedies. Please, god, stop. This really must be the most unbearable film I've ever watched. Jesus, take the wheel. My cinema hurts.",
      "review_date": "2014-12-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was a pretty clever movie with a weird storyline and ideas but what was truly unmatchable and top notch about this movie was the acting performances of all the lead actors. They all deserved academy awards in the respective categories inThis was a pretty clever movie with a weird storyline and ideas but what was truly unmatchable and top notch about this movie was the acting performances of all the lead actors. They all deserved academy awards in the respective categories in my opinion",
      "review_date": "2016-01-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "These days, critics (and non-critics, for that matter) are fond of complaining about how multiplexes are populated by cookie-cutter motion pictures that follow safe, formula-derived patterns designed to please audiences who want a differentThese days, critics (and non-critics, for that matter) are fond of complaining about how multiplexes are populated by cookie-cutter motion pictures that follow safe, formula-derived patterns designed to please audiences who want a different version of a story they have already seen dozens of times. And, while there's some truth to the maxim that \"there's nothing new under the sun,\" Being John Malkovich tries hard to be the exception. Admittedly, the themes addressed by the movie - those of identity, celebrity, and manipulation - are familiar, but the manner in which director Spike Jonze and writer Charlie Kaufman address them is fresh and inventive. I'm not arrogant enough to claim that nothing like Being John Malkovich has ever previously been committed to celluloid, but, if it has been, I haven't seen it.\r This is the first movie to be directed by Jonze, who cut his teeth doing TV commercials and music videos. Unless you're isolated from all aspects of pop culture, you've probably seen his work. (He also has one of the four primary roles in Three Kings.) As is the case with many of the so-called \"MTV filmmakers,\" Jonze displays a strong sense of style. However, unlike most of his contemporaries, he does not rely on quick cuts and visual gimmicks. He has sound, mature cinematic instincts.\r Kaufman's script is not constrained by viewer expectations. For about 110 minutes, he pushes the envelope, taking us in new and unexpected directions. Every time I thought I recognized where Being John Malkovich was headed, the movie surprised me. The screenplay is as funny as it is clever. Some of the jokes are of the \"big laugh\" variety, but few are representative of the cheap shots and dumb humor that have become commonplace in '90s offerings. Being John Malkovich revels in smart comedy instead of wallowing in the opposite. And, alongside the laughter, there's plenty of material for contemplation. Cinematically speaking, this is a well-balanced, multi-course meal.\r Unlike most comedies, which go for laughs without worrying about depth, Being John Malkovich has both. The film raises questions about the nature of identity, and how some people are only completely free when their real self is hidden behind a mask or beneath a costume. With Craig as a puppet-master and Maxine playing him like a musical instrument, issues of manipulation rise to the surface. How much of what we do in our day-to-day lives involves attempting to pull the strings of others, or having our own strings pulled? Being John Malkovich also addresses the appeal of stardom with greater impact than Woody Allen's Celebrity. Certainly, some of those willing to pay to enter the portal are interested in having a temporary personality transference, but others want the experience of being a star. In fact, taken as a whole, this could all be seen as a commentary on the crafts of acting (taking on an alternative identity) and directing (manipulating others). Beyond that, there are issues of ethics and commercialism (will we exploit anything?), as well as addiction (some customers become addicted to the experience). And, for those who like to see the dark side of things, the film offers unsettling threads about the annihilation of identity and the price of immortality. Is this too much material for one movie? Not with Jonze at the helm and a capable cast in front of the cameras.\r That cast is headed by John Cusack, one of Hollywood's most underrated actors. Cusack (last seen in Pushing Tin) has astonishing versatility and is able to thoroughly inhabit the skin of any character he plays. Craig isn't the most pleasant of men - during the course of the film, he does some unconscionable things - but Cusack is so effective that we form a tenuous bond with him anyway. As Lotte, Cameron Diaz is almost unrecognizable. Like her male co-star, she disappears into the character (with the help of an atypical hair style). Catherine Keener, for years the muse of filmmaker Tom DiCillo (Living in Oblivion), continues to show why she has always deserved the greater exposure she is starting to get.\r Then there's John Malkovich, who plays an exaggerated, fictionalized version of himself. Although that might initially seem like a simple role, it isn't, especially considering that Malkovich must re-invent himself as a man being possessed by others. His performance is flawless, mixing a version of the world-weary actor with an imitation of John Cusack and a touch of Steve Martin from All of Me. Jonze and Kaufman chose Malkovich as the title character because they wanted someone who is both well-known and a little elusive.\r The movie is surreal precisely because Jonze plays everything straight. The characters are not aware that they're in some kind of distorted reality, gazing through the looking glass darkly. It is a triumphant debut for Spike Jonze.",
      "review_date": "2016-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An entirely unique concept brought together by solid performance (particularly Diaz, Cusak, and Malkovich). A rare film treat that provides both laughs and contemplation. It doesn't have the traditional \"happy ending\" many viewers An entirely unique concept brought together by solid performance (particularly Diaz, Cusak, and Malkovich). A rare film treat that provides both laughs and contemplation. It doesn't have the traditional \"happy ending\" many viewers demand, but neither did \"Hamlet\" and I hear that got decent reviews.",
      "review_date": "2006-05-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a modern day classic. You have to be a certain type of person to enjoy the humor, and if you are you do so immensely. If this kind of comedy had been applied to a slightly more controlled plot or concept, it would've belly This is a modern day classic. You have to be a certain type of person to enjoy the humor, and if you are you do so immensely. If this kind of comedy had been applied to a slightly more controlled plot or concept, it would've belly flopped. Instead, it takes an idea that's just so far out there and laughable, combines it with characters that are all completely unaware of their own short-comings and moronity, and pretends that it's a serious film. With all the irony flying around in this movie, it HAS to pretend to take itself seriously- as seriously as the characters take themselves. I think where this movie lost that final point for me was in the tone. Yes, it needed to be dark to pull it off, and yes, the mundane nature of the characters' lives had to be reflected somehow in the film itself, but after a comedy so ludicrous and dark one has to be able to feel giddy, not slightly morbid. Too much Donnie Darko, not enough Everything is Illuminated.",
      "review_date": "2006-07-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Funny and intelligent movie. One of the best I've seen in years.",
      "review_date": "2008-10-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I thought Adaptation and Confessions of a Dangerous Mind both have it beat by a wide margin. Maybe I should see it again.",
      "review_date": "2006-10-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What an incredible movie! Works both as a hilarious comedy and as a deep reflection on identity and the many ways that it shifts based on our own wants and needs. Simply brilliant.",
      "review_date": "2006-02-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Amazing, amazing film. Great acting, great direction, and an excellent screenplay. I don't understand people like Chris B. who give zeroes to movies that get mainly 9s and 10s. Even if you really dislike a movie, it still deserves Amazing, amazing film. Great acting, great direction, and an excellent screenplay. I don't understand people like Chris B. who give zeroes to movies that get mainly 9s and 10s. Even if you really dislike a movie, it still deserves points for effort. A genuine \"0\" movie would have to have absolutely no redeeming qualities whatsoever.",
      "review_date": "2006-08-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An amazing mind-trip.",
      "review_date": "2007-01-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Being John Malkovich is a magnificent film, scuplted by master writer Charlie Kaufman and and then sharpened to a deadly blade by director Spike Jonze. The ideas that this film is packed with are amazing, when was the last time you recall Being John Malkovich is a magnificent film, scuplted by master writer Charlie Kaufman and and then sharpened to a deadly blade by director Spike Jonze. The ideas that this film is packed with are amazing, when was the last time you recall being even more overwhelmed with ideas in the third act than you were with the first? Being John Malkovich is almost perfect, but Jonze and Kaufman's second film, Adaptation, remains superior.",
      "review_date": "2005-11-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What an exciting and original movie!!! It was hilarious throughout and the surprises don't stop until the very end. Each character changes and turns with every scene. Fantastic movie - a must see.",
      "review_date": "2005-10-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Amen Matt A. Being John Malcovich is an unusual film to the world of cinema. It seems more original than any of Burton's movies. Full of twisted love triangles, and drama, along with wierdness and puppets.",
      "review_date": "2005-09-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is such an amazing and brilliant film, I usually do not like John cusack films, but this is not like a really regular e Cusack film.",
      "review_date": "2005-12-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It’s fair to say that when Being John Malkovich was released in 1999, very few people were even aware of the creative mind of Charlie Kaufman. In fact, he’d only really been working as a writer on Tv shows with Malkovich being his firstIt’s fair to say that when Being John Malkovich was released in 1999, very few people were even aware of the creative mind of Charlie Kaufman. In fact, he’d only really been working as a writer on Tv shows with Malkovich being his first feature film screenplay. When it hit, it was regarded as the most daringly original film of the year with a concept so bizarre that it’s a wonder that it was even green-lit for production in the first place. Thankfully, director Spike Jonze had the chutzpah to take it on and in doing so, introduced us to one of cinema’s truly subversive talents. Kaufman is a one-of-kind writer and Being John Malkovich alone is testament to his warped and offbeat imagination. It’s darkly humorous and genuinely unique in its inventiveness but moreover, it has an intellectual depth that raises it beyond a mere gimmick. Fair play to John Malkovich himself for being a good sport throughout and it also boasts some career best work from John Cusack, Cameron Diaz and, especially, the wonderful Catherine Keener. Ultimately, though, this film put both Jonze and Kaufman on the map and it’s a place they both rightfully deserve.",
      "review_date": "2020-09-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I just do not know. Being John Malkovich may truly be the most unique and thoroughly weird film I will ever be blessed to lay my eyes upon. In many ways, it is truly brilliant. In others, it merely odd and tries to find new ways to out-oddI just do not know. Being John Malkovich may truly be the most unique and thoroughly weird film I will ever be blessed to lay my eyes upon. In many ways, it is truly brilliant. In others, it merely odd and tries to find new ways to out-odd itself. Yet, I cannot help but feel that I truly loved this film. From beginning to end, it is hysterical and its unique concept is accurately explored. Even better, it leads to so many questions about existence, free-will, the self, and many other postmodern ideas. One thing is for sure though: Being John Malkovich is wonderfully written. With great characters and incredible execution of such a weird idea, this one shows why Charlie Kaufman should be revered as one of the best living screenwriters. His wonderfully odd imagination plays out in his films and this one is no exception. The acting is fantastic, especially John Cusack, Catherine Keener, and John Malkovich. While undeniably weird, Being John Malkovich is a delightful door into the human mind that explores what makes us tick, what makes us human, and makes you incredibly paranoid that somebody is in your head.",
      "review_date": "2016-04-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Spike Jonze and Charlie Kaufman never seem to shy away from going weird but amazing.\r The story is about a skillful puppeteer finds the perfect puppet when he discovers a portal in his new office on a \"half\" floor. It leads him literallySpike Jonze and Charlie Kaufman never seem to shy away from going weird but amazing.\r The story is about a skillful puppeteer finds the perfect puppet when he discovers a portal in his new office on a \"half\" floor. It leads him literally into the brain of John Malkovich. He and his discoverer try make a living off of others interests while his wife becomes jealous.\r Charlie Kaufman and Spike Jonze are the two people that can take a weird and strange story and make it amazingly well made and as a viewer you some how correct to it with no reason to it. I don't think I ever came across a bad movie from these genius of directing and writing and Being John Malkovich is another great film from them, they never disappoint me.\r The one thing that I loved about this movie is how self aware it is. It knows it's weird with some of the scenes that will kind of question yourself for watching it but not in a horrible way more like \"I'm I weirdo for understanding this and also enjoying it?\", something like. The film has a sense of humor to itself and knows it' ridiculous but it goes along with it and man is it funny.\r The director from Spike Jonze once again dose an amazing job directing this movie. He mix the humor, weird scenes and the fantasy element to it which perfectly came together so well and smoothly. Spike Jonze is fantastic director and in this he really dose shine with his talent of presenting story telling.\r The writing in this movie is probably hands down the best writing I've seen in a while. The way they pulled off this crazy story line and make it comedy gold is truly genius and worth bringing up because it's not a easy thing to do as it seems impossible for some writers out there and Kaufman makes it look easy.\r The acting from everyone was excellent. John Cusack, Catherine Keener and Cameron Diaz all three did brilliant in their roles. John Malkovich pretty much playing himself in this movie did a funny performance as himself has he get's taken over by pretty much everyone. I would pay good money to see John Malkovich been given the script for the first time to this movie while he knows nothing about it yet and him reading it and seeing his face has it probably went into WTF mode, but he said yes anywhere because the movie is about him and he give a outstanding performance.\r For problems I don't really have any to be honest. I couldn't really find anything that I thought wasn't right. Well overall Being John Malkovich is smart, weirdly amazing movie with a fantastic script and outstanding directing.",
      "review_date": "2015-03-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A joke isn't it? If you look at it, it's pretty much not just by forming the final conclusion. Being John Malkovich just pretty much rocks on every genre it belongs.",
      "review_date": "2016-05-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Ce film est comme une vieille bagnole, il peine à démarrer puis il a du mal à s'arrêter. Il fait beaucoup de bruit pour pas grand'chose même si ce \"pas grand'chose\" est parfois, il faut bien le dire, un authentique génie de l'absurde, drôleCe film est comme une vieille bagnole, il peine à démarrer puis il a du mal à s'arrêter. Il fait beaucoup de bruit pour pas grand'chose même si ce \"pas grand'chose\" est parfois, il faut bien le dire, un authentique génie de l'absurde, drôle et inventif. En vérité, il repose énormément sur la performance du fantastique acteur qu'est John Malkovich, un authentique génie du jeu et contrairement au film, il ne fait jamais défaut.Car \"Dans la peau de John Malkovich\" a quelques difficultés à exploiter son concept de départ brillant et à le faire fructifier sur la durée. Plus le film avance, plus il se délite en absurdités au fil des circonvolutions d'un scénario casse-gueule auquel on adhère de moins en moins.Les acteurs assument tous leurs rôles de caricature avec brio, sans doute transportés par la présence mirifique de Maître Malkovich, y compris la bécasse Cameron Diaz étonnamment supportable et toute jeunette ici.Bref, passé l'émerveillement de ce délire assurément très créatif, le film n'a l'effet que d'un pétard mouillé par faute d'un manque de maîtrise de son développement.",
      "review_date": "2017-01-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Being John Malkovich is deffinantly  one of if not the strangest thing ever put to film. There is no way this film should work if you wrote this out on paper and showed it to someone this would happen. They would laugh and ask \"Is that reallyBeing John Malkovich is deffinantly  one of if not the strangest thing ever put to film. There is no way this film should work if you wrote this out on paper and showed it to someone this would happen. They would laugh and ask \"Is that really a thing?\" in which you would have to answer with \"yes\". Being John Malkovich has a flare to it the handheld style adds a sort of grounded reality for something so crazy. Which it deffinantly needed, the acting is great all around you believe all the characters and there actions. While they might not be likable they still are believable and I mean it. The soundtrack is amazing it adds so much to this film which an amazing soundtrack is supposed to do. A quick little bit Charlie Kaufman is insane and Spike Jonez is either a god or a wizard to be able to make this one of the best films I've ever seen.",
      "review_date": "2017-08-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Definitely one of the most original films I've seen in a long time, even nearly 20 years after its original release. Superbly executed vision.",
      "review_date": "2018-06-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich,Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ? Malkovich, Malkovich ?",
      "review_date": "2020-07-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the most original and imaginative movies of the 1990's and arguably the best movie of 1999.Jonze & Kaufman are a match made in heaven in this whimsical and smart comedy.Must see.",
      "review_date": "2021-01-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■",
      "review_date": "2021-06-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●●■●■●■●■●■●÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%$$$$$$$$$$$$$$$$$$$$$",
      "review_date": "2021-07-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Spike Jonze puts on a really crazy and original script written by that genius Charlie Kaufman. The plot is delirious: a failed puppeteer who lives with his wife and countless animals in the house, is fired and gets a job in an office in aSpike Jonze puts on a really crazy and original script written by that genius Charlie Kaufman. The plot is delirious: a failed puppeteer who lives with his wife and countless animals in the house, is fired and gets a job in an office in a skyscraper where he falls in love with a woman named Maxine. The protagonist discovers a secret passage in the wall of the building that leads into John Malkovich's head. Once inside this tunnel you stay in the actor's mind for 15 minutes and then you are dumped in a ditch. Spike Jonze stages a very difficult subject with great skill, making a very pleasant and very funny film. An inspired and desperate dramatic comedy, a real cult that you shouldn't miss.",
      "review_date": "2022-10-04",
      "source": "metacritic"
    }
  ],
  "num_reviews": 75
}