{
    "title": "Lock, Stock and Two Smoking Barrels",
    "rating": 8.2,
    "release_date": "1999-03-05",
    "genre": [
        "Thriller",
        "Comedy",
        "Crime"
    ],
    "summary": "In this wild comedy of errors, a group of London friends find themselves deep in debt to an unsavory underworld figure.",
    "critic_reviews": [
        "A dynamite bundle from British writer-director Guy Ritchie. Even when the accents are as indecipherable as the plot, Ritchie keeps the action percolating and the humor on high.",
        "The acting, mostly by a bunch of unknowns, is equally fresh and funny, and Ritchie keeps the movie moving faster than you can say, \"bludgeoned to death by a 15-inch black rubber dildo.\"",
        "With such a frenetic, brain-melting load of images to ponder, it's easy to forget that there are also some terrific actors at work here, not the least of whom is the amazing Vinnie Jones.",
        "It's a superior thriller made with the guts and gusto that too many recycled entries into the genre fail to exhibit.",
        "Lock is filled with great writing, great acting, colorful characters, and a tight story. I actually like this film more than \"Pulp Fiction\".",
        "Ritchie's showmanship--half macho braggadocio, half emotion-tinged bravura--slaps and tickles the viewer into submission. He takes a group of not-so-goodfellas, whose idea of fun is setting farts afire, and, against all odds, makes them lively and engaging.",
        "Ritchie appears to have been paying attention to what made \"Reservoir Dogs\" (a huge hit in the UK) work, rather than coming away convinced that the formula for success begins and ends with pop-culture allusions and scarcely digested \"homages\" to classic crime films.",
        "A special weapon unto itself. Spring-loaded with cockney esprit, it peppers its audience with aggressive, sarcastic grapeshot. That's English for \"fun,\" by the way.",
        "A considerable kick, though it would have helped if one of the boys had wiped off the lens of the camera once in a while.",
        "Much of the action is laugh-provoking, and even the plentiful violence is handled as comic by-play. The cast is revved up to sizzle, with Sting in a smallish role, and the thick cockney dialogue is more comprehensible than you might think.",
        "Lock, Stock and Two Smoking Barrels is in the scabrous mode, and I like it better than \"Trainspotting\" -- it doesn't pretend its shenanigans are revolutionary.",
        "If the dialect is hard to comprehend, that soon becomes part of the joke. It's unlikely that even the British audiences who made Lock, Stock a big hit got it all.",
        "[It's] like Tarantino crossed with the Marx Brothers, if Groucho had been into chopping off fingers...Fun, in a slapdash way; it has an exuberance, and in a time when movies follow formulas like zombies, it's alive.",
        "Flawed but scrappy, confusing yet exhilarating, the Brit-made Lock, Stock is far from a perfect movie. And it's not for anyone squeamish about violence. But it is, like Green Day, a rockin' good time.",
        "The film's lures, while undeniable, are synthetic, and we never do learn what fuels all the greed besides pints of beer.",
        "The best one can say is that it's a smart cartoon, and a fairly exhausting viewing experience.",
        "Flashy, random shifts of film speed and a true rogues' gallery of striking if one-note characters, do hold interest even if they have no real right to. The commercial aspects also deflect attention from the fact that this story has almost no center at all.",
        "The humor is as crude as the characters, but the picture has energy.",
        "Given its boundless sarcasm, running-jumping- standing-still ambience and hyperbolic Guignol violence, Lock, Stock aspires to be something like the Beatles meet the \"Wild Bunch.\" Too bad it doesn't have even a rubber soul.",
        "Blends extremes of violence and humor to create an irreverent tone that nullifies everything; the plot is so clever it crushes the characterization, making all the action seem perfunctory.",
        "The laborious title of an even more laborious Cockney action movie that some people think is the cat's pajamas crossbred with the bee's knees.",
        "It's supposed to be visually exciting, but the result is more like a corpse-strewn Gap khakis ad than a triumph of technique. At least, based on the film's grainy texture and amber lighting, it's nice to know that the guy who shot every porn movie released in the '70s appears to be working again.",
        "The tediously convoluted plot involves the foursome’s attempt to pay him back, a labored venture that involves crooks with names like Dog and Plank, a man on fire, some fine cinematography, plenty of gore though no real point."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "Brilliant plot development. Guy Ritchie proves that he has what it takes with this movie. It outshines, dare I say it, Quentin Tarantino and Pulp Fiction.",
            "review_date": "2005-10-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I know I'm not stupid. But in ever Guy Richie film, I have no idea what in the hell is going on. I fell asleep in this movie. What a waste of money buying it.",
            "review_date": "2007-05-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I loved watching this movie and I couldn't stop laughing at the end. It was really good and I recommend it to everyone.",
            "review_date": "2007-06-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Fantastic Cockney Gangster Film!",
            "review_date": "2009-08-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Lock, Stock and Two Smoking Barrels was a decent debut for the wildly inconsistent Guy Richie. The acting is good (but not great) and overall, the movie is just a lot of stupid  fun. The only real downside is the fact that most of the actionLock, Stock and Two Smoking Barrels was a decent debut for the wildly inconsistent Guy Richie. The acting is good (but not great) and overall, the movie is just a lot of stupid  fun. The only real downside is the fact that most of the action takes place off-screen. One stunning gunfight might have elevated Lock, Stock and Two Smoking Barrels yet another notch.",
            "review_date": "2013-08-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It was impossible for me to become involved with this film. None of the actors convinced me. Every line of dialogue they spat out sounded so forced, like they didn't believe in the characters they were playing. Some of the dialogue isn't veryIt was impossible for me to become involved with this film. None of the actors convinced me. Every line of dialogue they spat out sounded so forced, like they didn't believe in the characters they were playing. Some of the dialogue isn't very well written in the first place. There's one line that Dexter Fletcher said that goes \"Also, I think knives are a good idea... Knives are good, because they don't make any noise, and the less noise they make, the more likely we are to use them\", and I thought to myself, Is this guy trying to sell me knives? Vinnie Jones was the only one who really impressed me. I wanted to see more of the guy. He played his part perfectly, nailed every scene he was in, and I loved that his character brought his son around for everything like it was \"Bring Your Kid To Work Day\". I also felt the narration by Alan Ford, you gotta love his accent, but I felt some of the stuff he narrated made it sound like he was talking down to me instead of telling me things I couldn't have figured out otherwise. It was condescending and intrusive, chiming in at all the wrong times. The only good writing is evident at the very end of the movie, the \"cliffhanger\" ending, which I thought was brilliantly scripted and played out. Another issue I have with the film is the dirty look it has. I know this is accounted for its low budget, but the amber lighting and the heavy grain, it's not a pretty mix, and it's one of the ugliest-looking films I've ever seen.",
            "review_date": "2011-06-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The film is not great because of its comedy, but for its style, editing and pacing. I'm not exactly sure why people saying \"Jesus Christ\" is supposed to be rip-roaringly funny. The delivery of most of the jokes (supposed or not) just The film is not great because of its comedy, but for its style, editing and pacing. I'm not exactly sure why people saying \"Jesus Christ\" is supposed to be rip-roaringly funny. The delivery of most of the jokes (supposed or not) just isn't done very well. The characters themselves are the reason Ritchie's films are so good. Even if you don't like them, you *must* pay attention, and they're almost always totally watchable. Vinnie Jones has to be one of the coolest badasses of all time! Personally, I think Snatch, though very much a copy of this movie, is the better of the two. For pure entertainment, this movie is hard to beat. If you haven't seen this movie, by all means rent it, and then proceed to rent Snatch. They're both great movies!",
            "review_date": "2009-04-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The crititcs are smoking dope. This is a gritty, funny, film in the same vein as Pulp Fiction (though British). It's the anti-chick flick. If you have a pair, you'll dig this movie.",
            "review_date": "2007-01-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "this is the best movie of all time guy riche is a genius.",
            "review_date": "2006-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Mad bad and highly entertaining, I really enjoyed this film. I particularly liked the fact that when things got particularly violent the camera wasn",
            "review_date": "2012-11-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Critics score is 66??? WTFThis is an amazing movie. Some funny moments in it, and entertaining from start to finish and plenty of memorable lines.In my opinion (i think im not alone here) the best British movie ever made. Deserves all theCritics score is 66??? WTFThis is an amazing movie. Some funny moments in it, and entertaining from start to finish and plenty of memorable lines.In my opinion (i think im not alone here) the best British movie ever made. Deserves all the praise it gets.",
            "review_date": "2011-07-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Pros: Funny, clever, action packed.\r Cons: Too British, predictable, nasty language\r\n\r\nI say Get it, and if you get it, you'll get it. As a disclaimer, I should point out this movie is not for everyone, it has a pile of nasty language, aPros: Funny, clever, action packed.\r Cons: Too British, predictable, nasty language\r I say Get it, and if you get it, you'll get it. As a disclaimer, I should point out this movie is not for everyone, it has a pile of nasty language, a small amount of gratuitous nudity, and a bit (although not to graphic) of violence. Also, if you don't like Monty Python or movies like Pulp Fiction, you won't like this movie. However, if you pass those litmus tests, you are in for a great ride. The story of how poor communication and crime leads to the downfall of virtually everyone, this clever action comedy has a great story, some great one liners, and characterization that deserves high accolades. Although at the end of the movie you get the point and it is a bit predictable, there is always another surprise waiting for you, and even guessing the plot outcomes is part of the fun. Putting all the pieces together gives one as much enjoyment as watching them unfold (usually with a twist) in this film. Definitely worth a rent, check it out.\r (NOTE: This review was originally written on Oct 12 '99)",
            "review_date": "2012-09-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The plot is complex yet understandable and enjoyable. The comedy is pretty good. Their English accents are not good but it doesn't get in the way of the film that much, cause it's a comedy you can't take it too seriously.",
            "review_date": "2011-08-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Fairly enjoyable film with a ridiculous but entertaining plot. Cast does a solid job.",
            "review_date": "2019-09-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The film that launched Madonna's one time husband Guy Ritchie to the masses is a triumph of the East End gangster culture laced with a heavy dose of humour and inept characters. One long Mexican stand off in the making with a sharp scriptThe film that launched Madonna's one time husband Guy Ritchie to the masses is a triumph of the East End gangster culture laced with a heavy dose of humour and inept characters. One long Mexican stand off in the making with a sharp script full of memorable lines, 'it's been emotional', it's easy to imagine Lock Stock as a film Tarantino would be proud of.\r The opening scene belongs to Jason Statham, in his first film, playing a dodgy dealer in a role different to the action tough guys he would go on to trademark, as he wheels and deals fenced items with a  slang heavy script, 'it's a deal, it's a steal'. Ritchie does a good job of gradually introducing the film's characters as the layers of the story develop through narration and hearsay and the characters, from drug kingpin Rory Breaker to Rob Brydon's traffic warden, score the film major plus points.\r Lock Stock also boasts a brilliant soundtrack of contemporary British music, Ocean Colour Scene, The Stone Roses and some classic songs, Zorba the Greek, that are well used in the film.",
            "review_date": "2013-07-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"Lock, Stock, and Two Smoking Barrels\"' smart and witty script propels this one above your run-of-the-mill crime film. At every turn, the dialogue was perfect and really made the film a fun watch. In addition, the constant twists, turns, and\"Lock, Stock, and Two Smoking Barrels\"' smart and witty script propels this one above your run-of-the-mill crime film. At every turn, the dialogue was perfect and really made the film a fun watch. In addition, the constant twists, turns, and confusion for the characters, was very interesting and, for the most part, unexpected. The movie I got was not the one I was expecting at all and I am completely ok with that, as the movie I got was way better than the one I expected. In addition, the acting from the whole cast was good. Nobody really stood out (in fairness, no one person had a large enough role to stand out), but since everyone was good, no complaints there. There is also some comedy in this. I did not find it that funny, but there were definitely some lines that had me laughing.\r Only complaint I can think of for this one is that at times the numerous layers of plot (particularly in the beginning) can be a little confusing and tough to adjust to. However, once the movie really gets going, all of the pieces come together and you begin to understand more and more with little difficulty.",
            "review_date": "2014-06-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An excellently plotted, stylishly shot, and overall enjoyable action drama.",
            "review_date": "2012-11-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I watched this film for the first time over the weekend and thought it was brilliant.  I thought it was cleverly done and was hooked from the start.  Why I hadn't seen it before I don't know.  I am not planning to book a locations tour fromI watched this film for the first time over the weekend and thought it was brilliant.  I thought it was cleverly done and was hooked from the start.  Why I hadn't seen it before I don't know.  I am not planning to book a locations tour from here: http://www.britmovietours.com/bookings/lock-stock-and-two-smoking-barrels-locations-tour and also watch some more of Guys Richie's movies!",
            "review_date": "2013-04-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Absolute classic  Amazing film. Funny gags and one-liners, great action and the way that all the different character's story's come together is genius. 10/10.",
            "review_date": "2013-07-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Guy Ritchie's gangster debut screams like a British 'Pulp Fiction' without being a ripoff. The interconnected story-lines flow with finesse until they merge to create an immersive experience. Ritchie, aside from the entertaining plot andGuy Ritchie's gangster debut screams like a British 'Pulp Fiction' without being a ripoff. The interconnected story-lines flow with finesse until they merge to create an immersive experience. Ritchie, aside from the entertaining plot and characters, cinematography that creates a gritty enriching atmosphere, wins above all else in his dialogue. It's like Tarantino in how it carries the story, adding humor where you'd least expect, but he makes it with his own cockney flare. And his music selection is worthy of praise, too. This is an amazing movie, and I can't believe it took me this long to review it. It's lock, stock, and whole lot.",
            "review_date": "2019-10-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is about as good a movie about the East End that you can get. Not sure Americans can get the layers and implications, however, stating fact, Americans cannot make movies like this. Beneath every grimace, scowl or threatening words,This is about as good a movie about the East End that you can get. Not sure Americans can get the layers and implications, however, stating fact, Americans cannot make movies like this. Beneath every grimace, scowl or threatening words, there's history and culture and classes. The toffs as opposed to the yardies and the locals make this a treasure. Even though all Brits understand each other, language is only half the picture. Our verbals tell us within a few sentences almost everything about that person. Education, social class, status etc. Our villains are true villains. Well hard! Blokes who'll put it about with their fists and character. The multi layers of any interaction actually mean, unless you are from the UK, you get only 50% of the communication. We are connected in such a way that the Queen's beans on toast would be the same as the lad from Peckham. Prince Phillip is excluded since he is as unBrit as Madge, (Madonna). We actually live and die together as a nation, as one. We really know each other!\rThis movie weaves East End culture like a Terry McCann, Arfur Daley episode. Essentially it's a gem!\rSomething that reflects everything British, not the PBS codswallop, Americans are enamored with.\rIt makes one almost sad that everyone except a Brit is able to understand the complexity and wonder that this movie is. That beautiful language that is evident, took centuries. The slang and violence doesn't convey except to a non Brit, just how gentle and patient the people are. Eg. and this isn't racist, simply trying to convey the beauty that is Britain. Black players are revered in Milwall.\rThe language used here is probably baffling to non Brits, which is exactly the effect intended. Unless you know specifically what you are talking about Critics, you only demonstrate ignorance and how daft you really are.",
            "review_date": "2013-12-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The early opus of british Guy Ritchie is a rollercoaster of mistakes, scam, robbery and clumsy crooks; a formula that produces lots of laughs. Pay atention for brief appareance of Gordon Summers (aka) Sting.",
            "review_date": "2017-10-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "the needy from the greedy..Lock, Stock And Two Smoking Barrels\n\nIf its anything that enlightens this sketchy gangsta feature, its the gripping and hilarious screenplay which even though walks on the same tone in each phase works like athe needy from the greedy..Lock, Stock And Two Smoking BarrelsIf its anything that enlightens this sketchy gangsta feature, its the gripping and hilarious screenplay which even though walks on the same tone in each phase works like a charm. Guy Ritchie's eerie execution and tone takes time to settle in but the writing part is too strong for anything to factor in which later on creates issues as it is a flat out zero on character's perspective. And on terms of performance level, the feature delivers the expectancy and nothing beyond than that for the actors weren't given enough space and range in it. Lock, Stock And Two Smoking Barrels is of course a plot driven movie that satisfies the fantasy of gangsta movie goers as it spices it up with comic sequences but as far as genuine reasoning, characters and practicality is concerned; its a no go.",
            "review_date": "2018-03-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A visual study in Poe's law, there's a reason why this film brought Guy Ritchie into the forefront of action cinema, with snappy dialogue and a slimy cast of characters that all collide into one another like a newly established CERN project.",
            "review_date": "2018-06-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's quite funny, fairly clever and so cool, but it's also not even nearly as funny, as clever or as cool as it thinks it is. The pacing also was uneven, and the second act dragged due to monotonous dialogue that made me miss the overstylizedIt's quite funny, fairly clever and so cool, but it's also not even nearly as funny, as clever or as cool as it thinks it is. The pacing also was uneven, and the second act dragged due to monotonous dialogue that made me miss the overstylized yet energetic first act. the film also has subplots that didn't add up, and supporting characters which I didn't care about even a tad bit. But it really picked back up till it reached its third act which is simply fantastic. And the cliffhanger ending is one of the best I've seen in a long time. Plus, The soundtrack is fire!(7/10)",
            "review_date": "2019-09-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is generally gritty and funny. The plot is well-paced and well thought-through. A good level of originality.",
            "review_date": "2020-01-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The very entertaining ending makes this film.I wasn't sure about 'Lock, Stock and Two Smoking Barrels' up until that point. Like, don't get me wrong, it is a good film from the get-go but I wasn't personally convinced by it to be more thanThe very entertaining ending makes this film.I wasn't sure about 'Lock, Stock and Two Smoking Barrels' up until that point. Like, don't get me wrong, it is a good film from the get-go but I wasn't personally convinced by it to be more than that until the credits rolled - at which point, I found myself to have been thoroughly entertained.With Guy Ritchie in his directing debut and a whole host of familiar British faces, it isn't a difficult film to get into. I did feel at some points that there were too many characters and that they weren't distinctive enough; there were momentary bits where I had to think a tad harder at which characters were linked with each other. However, that actually turns into the film's best thing at the end as it does come together brilliantly.All in all, this 1998 gangster flick is something I'd consider as very good and worthy of watching.",
            "review_date": "2022-03-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a monumental film.  A must watch for any movie buff. This is the film that put Guy Ritchie in the map. And for good reason. Amazing cinematography, strong plot, and more action than I generally get excited for. Incredible.",
            "review_date": "2020-04-17",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 51
}