{
  "title": "Magnolia",
  "rating": 4.5,
  "release_date": "1999-12-17",
  "summary": "On one random day in the San Fernando Valley, a dying father, a young wife, a male caretaker, a famous lost son, a police officer in love, a boy genius, an ex-boy genius, a game show host and an estranged daughter will each become part of a dazzling multiplicity of plots, but one story.  [New Line Cinema]",
  "critic_reviews": [
    "At its best, Magnolia towers over most Hollywood films this year.",
    "Part poem, part jungle blossom, all brilliance.",
    "The kind of film I instinctively respond to. Leave logic at the door. Do not expect subdued taste and restraint, but instead a kind of operatic ecstasy.",
    "Spellbinding.",
    "The kind of brilliantly weirdo picture that, by all rights, shouldn't have gotten made at all but this time, miraculously, was.",
    "Hands-down the best movie of the year.",
    "What leaves you breathless, though, is the knockout acting by the cast.",
    "Anderson must have needed that bonkers third-hour climax because there was nowhere to go short of spontaneous combustion.",
    "A quantum leap in ambition from \"Hard Eight\" and \"Boogie Nights\" and is, to my mind, much more interesting.",
    "The most imperfect of the year's best movies, Magnolia's flaws are easily forgiven because they are the result of go-for-broke ambition.",
    "An exhilarating and at times operatic film.",
    "Anderson's big, showy flower of a movie unfurls brilliantly, each plot petal a thing of exquisite design. Then it ripens. Then it disintegrates, leaving a mess of color and a faint whiff of rot.",
    "If you thought \"Boogie Nights\" blew it in its final third, you ain't seen nothing yet.",
    "Like Spielberg, even if the content is questionable or the performance is missing, his scenes always manage to be visually thrilling.",
    "It's astonishing to see a film begin this brilliantly only to torpedo itself in its final hour.",
    "Highly audacious, hugely enjoyable, exceptionally well-written, brilliantly edited, and exuberantly actor-driven extravaganza.",
    "Drunk and disorderly on the pure joy of making movies. A frantic, flawed, fascinating film that is both impressive and a bit out of control, often at the same time.",
    "Anderson strikes a near flawless balance between looseness and structure, and indulges the occasional flight of cinematic fancy without undermining the movie's emotional integrity.",
    "As intoxicating as the flower it's named for, and its characters, most of them as flawed and fascinating as the film itself, seem intoxicated by the overpowering scent.",
    "Anderson, 29, does so much in Magnolia, with such nerve, with wily humor and out-of-the-blue bravado, that the film's flaws and lapses don't really matter. It ain't perfect, but it's awe-inspiring.",
    "Magnolia is \"Short Cuts\" with hope.  It's my kind of mess.",
    "Exhausting at times, frustrating in others, Magnolia is mostly just exhilarating, the product of a raw, vibrant talent finding his footing in an adult world -- and unafraid to make mistakes.",
    "There is undeniable power in Magnolia, in which small moments of truth are given epic gravitas, not just by Anderson's adroit cinematic style (no one's camera is more restless or inquisitive), but by the wisdom and compassion of the characters he creates.",
    "At times, Anderson may be too brilliant for his own good, and there is a risk that viewers will tire of the director's relentlessly prowling camera.",
    "A remarkably inventive and audacious film that almost overcomes its flaws.",
    "Unlike any other film released this past year, be it from the aspect of its storylines, of which there are many, or its emotional clarity, which is, quite frankly, brutal.",
    "None of the characters in Magnolia feel as vividly imagined as the porn stars and filmmakers and hangers-on of \"Boogie Nights.\"",
    "A hard-striving, convoluted movie, which never quite becomes the smoothly reciprocating engine Anderson ...would like it to be.",
    "There's precious little to think about despite the screenplay's comic-philosophical musings on fate and coincidence.",
    "But while this terrific cast gets to strut and preen, it's difficult to make an emotional connection with most of them.",
    "I went into Magnolia like a kid running onto a beach with a pail and shovel ready to explore, only to find myself neck deep in quicksand three hours later, screaming for help.",
    "A brilliant piece of garbage -- mesmerizing, but only because you can't believe someone has the temerity to put so much into so little.",
    "A three-hour-and-10-minute exercise in slight characterization, pointlessly showy editing and vapid plotting."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Think of the most pretentious \"symbolic allegorical\" wanna-be movie you can think of. Got it? Now multiply the pretentious factor by 10, and maybe you can come close to imagining the nature of this film. A royal waste of time. If I had paidThink of the most pretentious \"symbolic allegorical\" wanna-be movie you can think of. Got it? Now multiply the pretentious factor by 10, and maybe you can come close to imagining the nature of this film. A royal waste of time. If I had paid to have watched this movie in the theatres, I would have without a doubt demanded PAYMENT for the THREE HOURS of attention I gave to this movie. I truly did not expect this from the same director which graced us with There Will Be Blood. If you enjoy absurdism, this is the movie for you. This movie tries SO hard to be some kind of metaphorical master piece, but falls flat on its face, and the beauty of it all is that you can essentially see the exact point at which this movie drops to its knees and begs for the title of 'artistic masterpiece'- it's at the point where the members of the cast, all in different locations, have a sing-along. But what really drove home the pointless nature of this movie was a scene near the end when a certain amphibian begins raining from the sky. I wish I could say I was not being literal in my description, but I am. I highly dissuade one from viewing this movie, and to instead waste their time banging rocks together, because at least the latter will not cause a brain hemorrhage.",
      "review_date": "2020-09-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie drags on for over 3 hours. A note for the director, if you're going to make a 3 hour and 8 minute long movie make sure the actors have great chemistry & that the movie has a message. Magnolia has neither of these crucial elements.",
      "review_date": "2021-04-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What a raw and powerful film that succeeds in every category possible. Writing, directing, acting, editing, camera work are all fantastic in another PT Anderson masterpiece. All the more great because it is a film that denies hollywoodWhat a raw and powerful film that succeeds in every category possible. Writing, directing, acting, editing, camera work are all fantastic in another PT Anderson masterpiece. All the more great because it is a film that denies hollywood convention and instead creates something more bizarre and memorable and a work of art that demands to be seen and talked about.",
      "review_date": "2012-09-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "but the past ain't through with us..Magnolia\n\nHolding an audience on the edge of the seat for more than 3 hours is an accomplishment let along entertain, mesmerize and inspire them with some outstanding writing ever to be written for thebut the past ain't through with us..MagnoliaHolding an audience on the edge of the seat for more than 3 hours is an accomplishment let along entertain, mesmerize and inspire them with some outstanding writing ever to be written for the screen. When it comes to manipulate multiple characters and make them dance like puppets and bring out the best from each and every situation, no one can hardly touch Paul Thomas Anderson, for his awareness of its eerie world, concept and characters is what makes it work all the way through. Magnolia offers a rare experience that cinema and art could still bedazzle us by its thought provoking aspects toward life and humanity. It is carried and depicted by so many great performances by Tom Cruise, Julianne Moore, William H. Macy, Philip Hoffman and John C. Riley pitching each and every words on screen majestically. Magnolia contains fast paced exhilarating script which is supported thoroughly by stellar performances, breathtaking background score and perfect execution.",
      "review_date": "2018-02-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A modern masterpiece in unique storytelling that from start to finish will have you captivated inside It's killer plot that never lets up, only becoming more and more intense as the story progresses. Afterwards it won't matter that the filmA modern masterpiece in unique storytelling that from start to finish will have you captivated inside It's killer plot that never lets up, only becoming more and more intense as the story progresses. Afterwards it won't matter that the film is 3 hours, because It's 3 hours well spent and many more to come.",
      "review_date": "2015-04-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "'Magnolia' is perhaps the most polarising of Paul Thomas Anderson's work. A lot of people have found it thought-provoking, emotionally impacting and dazzling in many ways, while many others have found it dull, self-indulgent, bloated and'Magnolia' is perhaps the most polarising of Paul Thomas Anderson's work. A lot of people have found it thought-provoking, emotionally impacting and dazzling in many ways, while many others have found it dull, self-indulgent, bloated and overlong.This reviewer falls into the former camp. 'Magnolia' perhaps feels indulgently overlong in places, and the final group musical number does feel contrived and out of sorts with the rest of the film. On the whole though 'Magnolia' is a dark, daring and dazzling film, and another winner in a filmography where this reviewer has yet to watch a dud.All of Anderson's films are visually stunning, and 'Magnolia' has some of the most haunting and scintillating arresting images of any of his films, especially at the end. The long takes and tracking shots are distinctively Anderson and look wonderful, the whole film is beautifully shot, very atmospherically lit and the production design is suitably audacious. The soundtrack is rich in emotion and sticks in the head, and all the song choices are well chosen. Some found it intrusive, not to me.Regarding the script, it contains some of the most thought-provoking, layered and poignant writing of all Anderson's films. The story has a long length to work with, and doesn't disappoint with the pacing which is a mix of suitably manic and suitably languid when either extreme is needed, unpredictable, beautifully developed, hugely entertaining, dark and often very emotional scenarios and richly layered characters, remarkable for so much going on. Anderson's direction is also exemplary.Another controversial asset of 'Magnolia' is the ending, something that many will find powerful (again fall into this camp) and others will be perplexed. Whatever extreme you find yourselves, it certainly is not an ending that one forgets easily. Anderson's mastery of direction of actors and their interactions shows through loud and clear, with the whole cast giving superb performances in one-of-a-kind roles, for some among their best.Tom Cruise in particular has an absolute ball, and he is particularly well supported by a gleefully entertaining and charming John C. Reilly, a touchingly restrained William H. Macy, an as always exemplary Philip Seymour Hoffmann and a heartfelt Julianne Moore. Jason Robards and Melora Walters also do brilliantly.In conclusion, dark, daring and dazzling. The most polarising of Anderson's films but incredibly well executed, a flawed masterpiece somewhat. 9/10 Bethany Cox",
      "review_date": "2022-04-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Magnolia has some good performances, some good cinematography, was Oscar-nominated, but what about its story...or some worthiness? If you enjoy a lot of actor abuse, verbal abuse (even professional child abuse) you could somehow like thisMagnolia has some good performances, some good cinematography, was Oscar-nominated, but what about its story...or some worthiness? If you enjoy a lot of actor abuse, verbal abuse (even professional child abuse) you could somehow like this movie. If you've ever wondered what a movie might be like that's written and directed by a self-confessed cocaine user, under-aged pornography addict, as well as being, Quote; “my favourite filmmaker copycat” - then this could be getting close to realising your dream (perhaps this might also sadly sum up Hollywood today and some audiences) Have tried to sit this through several times (only because of the cast and the hugely conflicting reviews!) but each time was left wanting to throw something at the screen or run screaming from the room. 'Over-everything' is one description that readily comes to mind but, other unprintable ones are first and foremost. Many others have neatly summed-up this tosh very well but few can ever do it the justice it deserves. Writer/director P.T. Anderson can’t even write a single paragraph that's not filled with vulgar language or unnecessary four-letter words and 90% of his characters are not worth caring for.Maybe this could be another example of the modern Academies short-sightedness spotlighting one of the reasons why so many patrons stopped going to the movies around this time, also why many movies of this ilk don't deliver the good returns expected. If your life is so uneventful that you can throw away over three (yes 3) laborious hours of visual splendour being wasted on a theme so repugnantly ugly - then you're welcome to this excruciatingly heavy-handed overindulgence. The movie plays out like several movies in one, with none of them much good or making much sense when edited together - mild interest soon gives way to boredom. As for the director’s favourite singer being played endlessly in the background, this just becomes another annoyance. When a moviemaker publicly makes a statement like: \"I'll make pretty good movies the rest of my life but I guess Magnolia is, for better or worse, the best movie I'll ever make\". Then please let me say: Stay out of our lives P.T. Anderson - way out.  But of course, those either on the payroll or who consider themselves as knowing better than most will disagree.",
      "review_date": "2021-01-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Magnolia is a very intelligent film from a usually impressive director Paul Thomas Anderson, Magnolia is very unique and watchable. The cast delivers great performances. Tom Cruise is in one of his strongest role as Frank T.J Mackey. A greatMagnolia is a very intelligent film from a usually impressive director Paul Thomas Anderson, Magnolia is very unique and watchable. The cast delivers great performances. Tom Cruise is in one of his strongest role as Frank T.J Mackey. A great way to follow up Boogie Nights!",
      "review_date": "2014-05-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Grandly emotional, brilliantly edited, and makes use of music in startlingly original and profound ways. However, this sprawling opus isn't perfect; It's a bit hard to follow and some plot points get left dangling. The cast is excellent, andGrandly emotional, brilliantly edited, and makes use of music in startlingly original and profound ways. However, this sprawling opus isn't perfect; It's a bit hard to follow and some plot points get left dangling. The cast is excellent, and while it isn't flawless, it is a great film. Definitely worth seeing.",
      "review_date": "2011-05-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Magnolia is a great film on any level, but the cliche about never seeing a film in a vacuum certainly is addressed to this film. I saw it just after a close friend died and everything about this film rang so true.\rI think that Anderson wasMagnolia is a great film on any level, but the cliche about never seeing a film in a vacuum certainly is addressed to this film. I saw it just after a close friend died and everything about this film rang so true.\rI think that Anderson was saying was don't hold back having the BIG discussions or you may find it's too late to do so. And we all are somewhat guilty of that. What an experience Magnolia is...and so sad to see it now with Phil Hoffman gone. Wonder if he had the time to have the discussions.",
      "review_date": "2016-08-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I keep trying, but I cannot connect with Paul Thomas Anderson supposed genius and mystery. This film is a fantastic formal exercise. Editing, music, acting, characters ... but, I cannot feel anything else. For me, it lacks depth andI keep trying, but I cannot connect with Paul Thomas Anderson supposed genius and mystery. This film is a fantastic formal exercise. Editing, music, acting, characters ... but, I cannot feel anything else. For me, it lacks depth and exploration, heart and truth. Maybe it is there, but I certainly cannot see it.i",
      "review_date": "2015-10-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Don't treat Magnolia like a movie. Surrender yourself to it's awesomeness and allow it to play on your emotions like music. It'll blow you away.",
      "review_date": "2012-11-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A rare success with this film is that it is a Tom Cruise film I like. But to be honest,it's not really about him it's how the cinematography is so interwoven you can't remember where you went last and where you are going to go next. To thinkA rare success with this film is that it is a Tom Cruise film I like. But to be honest,it's not really about him it's how the cinematography is so interwoven you can't remember where you went last and where you are going to go next. To think of a story like this takes time and dedication and to keep you hanging on for 3 Hours isn't a bad feat either.",
      "review_date": "2010-10-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Magnolia is a beast of a movie, and not just in terms of its 3 hour plus running time.  Paul Thomas Anderson's ambitious and challenging film (in some ways it's more daring than Boogie Nights) juggles an enormous cast of characters who areMagnolia is a beast of a movie, and not just in terms of its 3 hour plus running time.  Paul Thomas Anderson's ambitious and challenging film (in some ways it's more daring than Boogie Nights) juggles an enormous cast of characters who are all in desperate need of love and redemption, and sometimes both.  The film digs deep emotionally into the souls of its characters and suggests that each and every one of them is deserving of these very qualities despite their sins and transgressions.   Magnolia is an art film that begs to be attacked for its pretentiousness and for a gonzo finale, but it's all the better for those very things.",
      "review_date": "2012-07-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Every so often a movie that you have heard a lot about but never seen blows your mind. Magnolia is one of those movies for me. Immediately after viewing this film I knew that it would be on my mind for weeks and that it would become one of myEvery so often a movie that you have heard a lot about but never seen blows your mind. Magnolia is one of those movies for me. Immediately after viewing this film I knew that it would be on my mind for weeks and that it would become one of my top 10 films. Every character in this movie is interesting on multiple levels. Every scene in this movie is thoughtful and poignant. The scenes that opponents of this film  have problems with, the frogs and the musical interlude, work for me in every way. Both these scenes do seem out of place in this story, but for me that is what makes them amazing. They come from nowhere, but interlock these characters in a visceral, interesting way. There is so much to unravel in a film this large, with multiple plot lines and characters running both separate from each other and together at various times. You could probably write a book trying to accurately review this movie. I look forward to watching this movie again and again over the years, and trying to unravel all the characters and premises in my mind.",
      "review_date": "2012-10-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Interesting interwoven tale of numerous lives although the Tom Cruise character dominates the movie. A superbly acted and directed movie which everybody should see.",
      "review_date": "2012-02-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Who would guess that a film like this would be successful? However, it absolutely is. Magnolia explores the themes of loneliness, regret, forgiveness, the past, and parent-child relationships, with snapshots of the life of a group of brokenWho would guess that a film like this would be successful? However, it absolutely is. Magnolia explores the themes of loneliness, regret, forgiveness, the past, and parent-child relationships, with snapshots of the life of a group of broken and troubled people who are all linked, even if they do not know it. Thanks to great acting from the ensemble cast featuring Tom Cruise, Melinda Dillon, Jeremy Blackman, Philip Baker Hall, Philip Seymour Hoffman, William H. Macy, Julianne Moore, John C. Reilly, Jason Robards, and Melora Walters, Magnolia's diverse (yet not as diverse as you may think) are brought to life brilliantly. It also does not hurt that the writing is superb and the depth we go to with these characters in just three hours is amazing. On that note, this one comes in at three hours and in spite of it, it feels like it was nothing more than an hour and a half, as the runtime just flies by. The ending is incredibly odd, though it brings the biblical references and the freak happenings of this one to conclusion nicely, as odd as it may truly be. Overall, Magnolia is a beautiful and brilliantly made film that will move and entertain you.",
      "review_date": "2014-08-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I thought \"The Village\", \"Random Hearts\" and \"Intersection\" were the worst movies of all time. Now they're only the 2nd - 4th worst movies of all time thank to this hunk of junk. The most interesting part of the film was the first 1 I thought \"The Village\", \"Random Hearts\" and \"Intersection\" were the worst movies of all time. Now they're only the 2nd - 4th worst movies of all time thank to this hunk of junk. The most interesting part of the film was the first 1 minute when 3 coincidences were summarized - the only coincidence involving the actual characters in the movie were the boredom in which they inflicted, the pointlessness of their stories and the over-the-top acting by all of the cast members. By the end of the movie, I was praying that they all would die together, quickly because I cared nothing for any of them and only wanted to stop my pain. It will be tough to top this one as the worst ever, but I'm sure some Hollywood genius is already hard at work.",
      "review_date": "2006-07-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was garbage, and every scene was drawn out long enough for you to be begging for the next scene, and it added up to a 3 hour piece of junk. Really garbage.",
      "review_date": "2009-02-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Various blighted, phony, humorless characters strutting and fretting between ridiculous marginally intelligent speechifying, all of them so dishonest, lost and damned that the only salvation (or relief at least) possible would be a plague of Various blighted, phony, humorless characters strutting and fretting between ridiculous marginally intelligent speechifying, all of them so dishonest, lost and damned that the only salvation (or relief at least) possible would be a plague of equally phony frogs dropping from the sky. Reminded me of the Sam Kinison routine about the people starving in the desert. Like, if your life is really anything like that, why the fuck don't you MOVE? It made my 10 worst films of all time list, nearer the top than the bottom.",
      "review_date": "2009-07-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Oh boy, oh boy. I don't know where to begin.They cannot make movies like this nowadays.One percent of what is there would be considered too politically incorrect.\nAnd that is a shame, because it is a masterpiece.\nI watched it 20 years agoOh boy, oh boy. I don't know where to begin.They cannot make movies like this nowadays.One percent of what is there would be considered too politically incorrect.And that is a shame, because it is a masterpiece.I watched it 20 years ago when it just came out, in a theater. And I loved it.Since then I forgot what it was about, I just remembered that I loved it 20 years ago.Decided to watch it again. So happy I did.The movie is intensely packed. The script is enough to make at least three good dramas ofShakespearean quality. The ensemble of actors... All the best of the very best is there.Performances vary from very good to breathtaking.Some would say it is too intense, too intermingled. Maybe.The clear advantage of watching it at home is that one can take a break when it becomes unbearable, and it does. That is when you know it is not just a good movie.Plus you could read subtitles and not miss any word they sometimes mumble.'Nough said.It is a must-see movie.",
      "review_date": "2020-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Few people seem to understand this movie, but then few people understand me either. We are damaged, the film's characters and I. We struggle with pain and a crippled emotional life. It is a beautiful film. It sings a lovely and desperate song.",
      "review_date": "2012-03-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Definately my kind of movie: it has multiple storylines with different characters, which are entwining and crossing each other in some points. They are mostly dramatic, telling about ruined lives, personal regrets and skeletons in the closet.Definately my kind of movie: it has multiple storylines with different characters, which are entwining and crossing each other in some points. They are mostly dramatic, telling about ruined lives, personal regrets and skeletons in the closet. Most of the characters have an amazing backstory, which is revealed during the movie. Also I'd like to mention Tom Cruise's role, probably his best one I've seen.",
      "review_date": "2013-09-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In Paul Thomas Anderson's \"Magnolia\" we get to follow a range of characters during one day as their fates are tied together. I can start by saying that I really liked this movie and its many characters, one of them brilliantly played by TomIn Paul Thomas Anderson's \"Magnolia\" we get to follow a range of characters during one day as their fates are tied together. I can start by saying that I really liked this movie and its many characters, one of them brilliantly played by Tom Cruise who, according to me, should have won the Oscar for Best Supporting Actor instead of Michael Caine. The fates of all the characters are tied together so beautifully and so elegantly by PTA that I think it's safe to say that he is nothing less than a master, one of the greatest artists of his generation. Despite \"Magnolia's\" brutal length, I didn't look at my watch a single time, much because of its soundtrack that gives the movie an admirable pace  both Aimee Mann's songs and the composition by Jon Brion is magical. This is a film that every movielover out there should see.",
      "review_date": "2013-02-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "this movie without a doubt is the most creepiest 3 hours i spent on the big screen for long long time  the writing is so weird that after finish watching the movie  i felt manipulated and i felt that Paul Thomas Anderson  should made a betterthis movie without a doubt is the most creepiest 3 hours i spent on the big screen for long long time  the writing is so weird that after finish watching the movie  i felt manipulated and i felt that Paul Thomas Anderson  should made a better explanation for all the events that been going on for the entire movie  i get the idea that everyone was acting hard  but some of them tried so hard it's ridiculous for example Alfred Molina has a 10 minutes of fame and he was acting like it was a scene from the godfather ,Tom Cruise and Julianne Moore did their parts very well but after all the movie is awkward but that make sense since Paul Thomas Anderson  is also the director and the writer of there will be blood that awkward movie with a very questionable ending. after this i will never watch his movies again.",
      "review_date": "2013-04-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best Tom Cruise movie, still ahead of its time. Too bad the director turned back from his roots to make action horror movies.",
      "review_date": "2021-02-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Paul Thomas Anderson knows how to write interesting characters. \"Magnolia\" centers around the different stories of multiple people. We have two characters dying of cancer. One is a cop that falls in love with a drug addict. Tom Cruise is aPaul Thomas Anderson knows how to write interesting characters. \"Magnolia\" centers around the different stories of multiple people. We have two characters dying of cancer. One is a cop that falls in love with a drug addict. Tom Cruise is a sex mentor. The list goes on. As a result I love this movie. Grant it, it's not a perfect movie and has its issues. But we'll get to that later. To be fair, there is a lot to love about this movie. Anderson wrote and directed the living crap out of this movie. He has such a beautiful vision not just from a cinematic scope, but from a storytelling point of view. And he has also written tons of interesting characters. John C Reily as the cop. Jason Robards and Phillip Baker Hall as the two men dying of cancer. Phillip Seymour Hoffman as Robards nurse. TOM CRUISE AS A SEX MENTOR! There are tons of more characters than that, but can't talk about them all day. However the performances from the cast is stellar. They hold their own emotional weight to their specific stories and carry the film. Sure some were better than others, but all their stories were nevertheless engaging. And Tom Cruise just kills it in this movie. In a movie filled with literally top notch performances, he stands out as my favorite character. It was just something totally different from what we've seen him do before. I loved how the stories are interconnected but never to the point that they have to try to have everyone come across everyone in some forced way or fashion. It's not like those ensemble movies in which everyone meets up at the end. For a 3 hour long movie, it keeps me engaged the whole way through. If anything only the last 5 maybe 10 minutes dragged. That's it! Plus it also has a rewatchability factor to it. Again, it goes back to having all the interesting characters keep you engaged the entire movie. Ive seen this movie twice and still plan on watching it a third time in the near future. As far as issues, I will say that Julianne Moore's character was the one that I could never care about. It's the fault of Anderson's writing rather Moore's performance is completely over the top. Luckily she doesn't have as big of a story as essentially every other character. But I could never get into to her character like I did with everyone else. And there is a big event near the end of the movie, while a great scene, it just felt completely over the top and absurd. Maybe because that the whole movie felt so grounded in reality up until that point. I guess it's just something I have to look further into. But overall, it's such an entertaining movie with stunning performances by almost everyone, fantastic writing and a great vision (for the most part) by Anderson. I'm going to give \"Magnolia\" an A-!",
      "review_date": "2015-08-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There are very different little stories with top actors except Julianne Moore, who was a annoyance to watch. Tom Cruise was great. But the movie is too long. And was what that frog raining? So out of place and wannabe art.",
      "review_date": "2021-02-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Magnolia is the kind of film that Paul Thomas Anderson likes: intelligent, full of symbolism and great characters that connect beautifully in the end.",
      "review_date": "2013-07-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This epic montage gives an incredibly honest yet dark insight into the lives of the average human being through a stunningly complex and intelligent script. The three hours goes by in seconds, as the complexity andThis epic montage gives an incredibly honest yet dark insight into the lives of the average human being through a stunningly complex and intelligent script. The three hours goes by in seconds, as the complexity and likability/love-hate-ability of the superbly-acted characters (especially Julianne Moore as Linda Partridge and Melora Walters as Claudia Wilson Gator) keeps us engaged and guessing, as well as putting us through at least ten different emotions a minute. The climactic scenes are masterfully executed by P T Anderson, and give the perfect balance between satisfactory ending and a provocative one. The film is stylishly and atmospherically shot, indulging us and gripping us in the tense and unfulfilled, yet obscurely warm and wonderful world that is Magnolia.",
      "review_date": "2013-12-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I almost disliked this movie. I almost trash-talked about this movie. But I didn't. Magnolia is kinda stressful to watch. Yeah! Stressful to watch. The casts are amazing. Everyone did an amazing job. The performance is amazing. And theI almost disliked this movie. I almost trash-talked about this movie. But I didn't. Magnolia is kinda stressful to watch. Yeah! Stressful to watch. The casts are amazing. Everyone did an amazing job. The performance is amazing. And the soundtrack. Oh my dear! I love the soundtrack so much. That is one of the main reasons I kept watching this movie. In the end, I will say Magnolia is a really weird (in a good way) drama movie.",
      "review_date": "2015-06-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of my Top 3 films of all time (With Drive & Blade Runner) a beautiful film in each and everyway, with millions of layers upon it. This is one of those films that keeps you talking for days after your first viewing, and keeps you thinkingOne of my Top 3 films of all time (With Drive & Blade Runner) a beautiful film in each and everyway, with millions of layers upon it. This is one of those films that keeps you talking for days after your first viewing, and keeps you thinking about it for weeks to come. Definitely not a film for everyone as it is 3 hours long and can be very slow, but to me the film is flawless. The directing is superb as to be expected with P.T.Anderson, with fantastic cinematography and beautiful shots. The acting from everyone is top notch, not one bad performance is present throughout the film. Writing is brilliant with great character development. Each character is unique and feels realistic, you really do feel for certain characters.\rOverall a perfect film that needs watching. Certainly not for everyone but to me it is magnificent cinema!",
      "review_date": "2015-06-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Amazing movie, great actors, performance and what is the most important for me - plot. I see that many have disliked it, but I enjoyed it a lot especially as each character's story was dependent on other characters.",
      "review_date": "2017-06-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The length flies by. Great look at how we overcomplicate and **** up our lives over **** that doesn’t really matter — and how much better it would be if we could simplify our lives down to what truly counts.",
      "review_date": "2021-05-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "How on earth there is a space for sympathetic characters, terrific performances, coherent drama, comedy, miraculously connected storylines, logical sense in such a bizarre lengthy mess of a movie?Wait a second! .... am I not describingHow on earth there is a space for sympathetic characters, terrific performances, coherent drama, comedy, miraculously connected storylines, logical sense in such a bizarre lengthy mess of a movie?Wait a second! .... am I not describing humans and their lives?Blending realism with surrealism, Magnolia is one of Paul Thomas Anderson's works and ,definitely, his most ambitious one.Every story is as rich and intriguing as their characters. Stories that are harmoniously told, and embellished with Aimee Mann's heavenly soundtrack. The result is a three-hour epic mosaic devoid of any moment of boredom.I think Donnie Smith's story, William H. Macy's character, is the most profound and the richest one. Nevertheless, it's also the most poorly told one, comparing it to the others. It could have been explored more. I wish I was as invested in it as I respected it after it ended.Also, the movie could have been less on exposition in terms of characters a little bit more. Because I think what I've seen from the fantastic acting and the masterful use of symbolism are more than enough to make everything clear.That being said, these issues are almost indiscernible, and it was difficult for me to notice them.Magnolia is not my favorite PTA film, but hands down it's the most entertaining one despite its long runtime.(9/10)",
      "review_date": "2018-08-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Idk what to say. I hate it but I liked it. I enjoyed the ride. The movie was very well written and coherent all the way up to the end and it isn't until you've invested 2hr 30min. of your life that you realize it was all for naught. All youIdk what to say. I hate it but I liked it. I enjoyed the ride. The movie was very well written and coherent all the way up to the end and it isn't until you've invested 2hr 30min. of your life that you realize it was all for naught. All you can think about is 3 hours for that... It was at an 8 and could have been higher with an \"identity\" ending but it is what it is.",
      "review_date": "2020-01-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The 2nd greatest film ever. The most ambitious direction and story ever. The best cast every assembled with Cruise standing out.",
      "review_date": "2007-07-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My favorite movie! I was entraped in the first opening seconds and it honestly did not let go until it all ended. On top of that my investment of time was rewarded by a truly unforgettable climax. Everyone of the actors in this movie are at My favorite movie! I was entraped in the first opening seconds and it honestly did not let go until it all ended. On top of that my investment of time was rewarded by a truly unforgettable climax. Everyone of the actors in this movie are at the top of their game. I can watch this over and over again, and each time there is something new to ponder about.",
      "review_date": "2006-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Mesmerizing movie. It's hard to choose a favourite performance but for now it's Julianne Moore. She doesn't portray her character in a sentimental fashion, which would be typical for the situation her character's in.Mesmerizing movie. It's hard to choose a favourite performance but for now it's Julianne Moore. She doesn't portray her character in a sentimental fashion, which would be typical for the situation her character's in. instead, her behaviour is erratic, almost farcical, which makes her grief all the more devastating. Shame she never got nominated for an Oscar or Golden Globe.",
      "review_date": "2007-06-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Riveting film with brilliant ensemble!",
      "review_date": "2008-08-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I noticed most of the zero's on here dismiss Magnolia as a boring or artsy film people enjoy because it makes them feel smart. Magnolia makes you feel smart because it IS smart. In fact, P.T. Anderson's shattering of narrative I noticed most of the zero's on here dismiss Magnolia as a boring or artsy film people enjoy because it makes them feel smart. Magnolia makes you feel smart because it IS smart. In fact, P.T. Anderson's shattering of narrative convention is the most unique undertaking since Citizen Kane. I won't ruin the ending, but I will say that different aspects of the film, from the characters to the themes, have already started to converge, making the ending acceptable. Some character studies are boring and have an unwarranted reputation, but not here. If your smart enough and want to invest some time towards wrapping your head around this one, you'll be amazed.",
      "review_date": "2009-07-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Definately of the best films in the history of the cinema. at first i was slightly confused by the entire thing, especially the ending, but i thought about it for weeks, and i realized that i don't have to understand the wild ending, if Definately of the best films in the history of the cinema. at first i was slightly confused by the entire thing, especially the ending, but i thought about it for weeks, and i realized that i don't have to understand the wild ending, if a film makes me think about it for a week, it is amazing. I just came to except that the ending was a biblical referance which kind of brought everyone back to reality. amazing!!!",
      "review_date": "2005-12-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best films in the last 10 years.",
      "review_date": "2005-09-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Jaw droppingly awesome. John C. Reily was phenomenal in his goodie too shoes cop role.",
      "review_date": "2007-12-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My favorite movie ever. A beautiful, bold and downright astonishing exploration of a group of realistic and convoluted characters with so many interlocking themes, similarities and events you could fill a book. Incredible acting, an My favorite movie ever. A beautiful, bold and downright astonishing exploration of a group of realistic and convoluted characters with so many interlocking themes, similarities and events you could fill a book. Incredible acting, an ingenious and entrancing ending sequence, praiseworthy direction, a wonderful script and original songs by the terrific Aimee Mann all bolster this into a hypnotic masterpiece. One thing I will say, though, is that you need to watch this film when you have 3 free hours and nothing on your mind. Let it suck you in... if you are not paying attention, or if you are overthinking, you will hate it.",
      "review_date": "2008-06-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's the film I've seen the most and I find new details every time. It's absolutely great.",
      "review_date": "2006-11-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A miracle. I couldn't believe what I was watching. Every single scene is absolute magic. This movie touched me in ways I could never expect, and I wished it would never end. The cast is flawless, the cinematography is amazing, and most A miracle. I couldn't believe what I was watching. Every single scene is absolute magic. This movie touched me in ways I could never expect, and I wished it would never end. The cast is flawless, the cinematography is amazing, and most importantly, the script and directing are just cinematic perfection. Hands down.",
      "review_date": "2006-03-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Through a series of coincidences, opportunities, human action, shared environment and divine intervention, this stories colludes and get involved themselves. These human lives that confronts each other daily and raises an unfogerttable Through a series of coincidences, opportunities, human action, shared environment and divine intervention, this stories colludes and get involved themselves. These human lives that confronts each other daily and raises an unfogerttable climax are the field of this study of characters. Some of this characters are searching forgiveness, some of them are searching escape. Some get better realtionships and others are exposed. \"Magnolia\" is a mosaic of American life through a series of comic and pathetic vignettes. Its a portrait of a lonely town, sometimes even a love letter. Its a personal search of the elements hidden in a crisis. Its a story about fix things. And its awesome.",
      "review_date": "2006-09-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is too good to be true. although it is a bit confusing, it kept me glued. the acting is the best i've ever seem in a movie. i rave and rave to everyone i know about this movie. i may put this dvd in a glass case and lock it This movie is too good to be true. although it is a bit confusing, it kept me glued. the acting is the best i've ever seem in a movie. i rave and rave to everyone i know about this movie. i may put this dvd in a glass case and lock it up.......that's how much this movie means to me.",
      "review_date": "2007-02-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was speechless after watching this film lately. I heard good things about it and never had the chance to watch it. At first I thought it felt like experienmental film. Then I realized this film wasn't the conventional single-story I was speechless after watching this film lately. I heard good things about it and never had the chance to watch it. At first I thought it felt like experienmental film. Then I realized this film wasn't the conventional single-story driven film that an average hollywood films portray. It was expressing life as a community. Well, a community of a small group. This LIFE felt CHAOS from start to end. To smile it off at the bitter facts of life it decided to throw in the frogs.",
      "review_date": "2008-01-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "By far the best movie of 1999. Writer and director Paul Thomas Anderson has given birth to a true timeless masterpiece.",
      "review_date": "2005-12-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "How the coincidence and chance links in just 24 hours lives of people who have´nt nothing in common via the remorse, love and guilt. The rain of frogs of climatic sequence is surreal and for antology.",
      "review_date": "2019-03-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Magnolia is a drama that takes almost 3 hours. The drama in which 10 storylines that develop very slowly, but intersect in general in the final 20 minutes. Great cast, good acting of all the main characters and great ending. But 3 hours ofMagnolia is a drama that takes almost 3 hours. The drama in which 10 storylines that develop very slowly, but intersect in general in the final 20 minutes. Great cast, good acting of all the main characters and great ending. But 3 hours of timing, this is a lot, the dynamics of the plot in the middle of the film subsides.",
      "review_date": "2022-01-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is one of these intersecting lives stories, with a bunch of LA characters struggling with various woes and heartaches.  The main theme seems to be the pains and anxieties that lie behind the smiling successes of show business.  TheThis is one of these intersecting lives stories, with a bunch of LA characters struggling with various woes and heartaches.  The main theme seems to be the pains and anxieties that lie behind the smiling successes of show business.  The narrative focuses mostly on one TV program, a quiz show in which kids become heroes by besting adults.  The characters include a washed up star of this show, the current star of the show, a kid who suffers the horrible humiliation of pissing in his pants on national television, the current host of the show and his cocaine addict daughter, a Hollywood bigshot who is dying of cancer, his messed-up wife, the hospice nurse who is caring for him, his estranged son, a macho inspirational speaker (Tom Cruise, putting on a great show), and a lonely, well-intentioned cop.  It definitely is not flawless.  The dialogue is often lame and consists of people getting very emotional and cursing non-stop.  Julianne Moore's talents are wasted in a pathetic role.  The film could be accused of trying too hard to pluck on one's heart strings.  But it is hard for me to dislike a movie that held my attention for 3 hours and then ends with thousands of frogs falling from the sky and causing all kinds of havoc.  Oh, and it is very well put-together, with fine acting and editing.  It is pretty amazing that writer-director Anderson was only 28 when he made this.",
      "review_date": "2022-08-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Three hours of experimental movie.Scenes from six to seven groups of people who have different cultures not related to each other run parallel.In each of them settings, language, talk, cultures differs.\nAfter two hours viewer can still notThree hours of experimental movie.Scenes from six to seven groups of people who have different cultures not related to each other run parallel.In each of them settings, language, talk, cultures differs.After two hours viewer can still not set the relation  between them.In each group fake, deception love, hate, psychopathy are emphasized.Among all maybe only relation and dialogues between police officer Jim, and Claudia is interesting.Claudia is a drug user. One day while listening loud music at home after her fight with her visiting father. Police officer Jim comes to her house after her neighbors complain and an unexpected relation starts.",
      "review_date": "2021-06-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I thought PTA couldn't possibly surpass his achievement in Boogie Nights, but Magnolia has proved me wrong, and I couldn't be happier.Treating forgiveness and past through various subplots, Magnolia is one of the most narratively-ambitiousI thought PTA couldn't possibly surpass his achievement in Boogie Nights, but Magnolia has proved me wrong, and I couldn't be happier.Treating forgiveness and past through various subplots, Magnolia is one of the most narratively-ambitious films I recall watching, with a neverending cast, hipnotic camera work (which mutates through the film, alongside its dramatic tone) and a OUTSTANDING screenplay.The \"frog\" moment is probably my favourite scene from PTA's whole filmography.",
      "review_date": "2022-03-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie, which really reminds Altman, is a good characters exploration and development showing a Paul Thomas Anderson getting better movie after movie. Some people complains that the movie is too long and a lot of scenes could be cut. AndThis movie, which really reminds Altman, is a good characters exploration and development showing a Paul Thomas Anderson getting better movie after movie. Some people complains that the movie is too long and a lot of scenes could be cut. And it may be so. But there is something actractive in Magnolia and the cathartic ending contribute to make this movie an interesting (even if not perfect and sometimes boring) cinematic experience.",
      "review_date": "2021-11-03",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 94,
  "genres": [
    "Drama"
  ]
}