{
  "title": "Office Space",
  "rating": 6.7,
  "release_date": "1999-02-19",
  "summary": "A comedy about the angst of suburban twenty-somethings in modern office life.",
  "critic_reviews": [
    "An extremely funny white-collar satire filled with enough delightfully askew characters to pack a boardroom and the bright talent to do them justice, the picture should strike an achingly familiar chord with 9-to-5ers the world over.",
    "Bristling with shrewd observation, inspired humor and all-around smarts, Office Space is a winner about a guy who's beginning to feel like a loser.",
    "Imagine a live-action version of the \"Dilbert\" comic strip with a touch of Hal Hartley's deadpan absurdism, and you're ready for the frequently uproarious \"Office Space.\"",
    "Mike Judge’s live-action directorial debut not only whittles the high-strung festering soul of ‘90s Orthodox Corporationism down to the quick and quintessential but wraps its veins around his fingers and flosses our teeth.",
    "For the most part, the film is brilliant.",
    "Its characters and its nowheresville setting are uncannily realized... It's not a cartoon in any sense, but an honest-to-God movie with some fine, understated acting and a human heart.",
    "Office Space's pleasures don't really depend on plot. It's pretty much what a Dilbert feature should look like.",
    "Office Space is so enjoyable that you wish it were even better...Once the scheme to bilk Initech is set in motion, the off-kilter humor flattens into a take-this-job-and-shove-it thing, and the ending seems pooped-out.",
    "A surprisingly good-natured comedy.",
    "The storyline is something of a hodge-podge but what the narrative lacks in honing and straight-ahead storytelling it more than makes up for with well-aimed barbs and acutely focused observations...this funny, funny satire gets us where we live.",
    "The movie's dialogue is smart. It doesn't just chug along making plot points.",
    "Jennifer Aniston...doesn't have much screen time, but in playing this slightly insecure, affable young woman, she does her best film acting to date.",
    "In a surprise move, the creator of \"Beavis and Butt-Head\" has made a laid-back, even subtle comedy that generally favors mischievous ironies over outlandish jokes.",
    "A knowing, somewhat slight, often hilarious sendup of cubicle culture.",
    "I could love it only as far as it let me. Although the movie has hilarious moments throughout, its thematic thinness is writ fairly large on the big screen.",
    "It's on the verge of being really good...his narrative peters out without a decent payoff. It's a testament to the rage and anxieties that he has brilliantly tapped into that he can't get away with a subdued conflagration and a lame twist at the end.",
    "It fails to sustain its comic momentum or high energy level. The first half is fresh and funny, but it doesn't last.",
    "What began as discomfiting satire soon devolves into silly farce. By the time Friends star Jennifer Aniston pops up as a waitress-cum-love-interest (quite a stretch for her), it's a sure sign we're back within the smug confines of the Tinseltown formula flick.",
    "There are plenty of good sight gags here, and anyone who can work the phrase \"ass clown\" into a script is all right with me.",
    "Until the story diverges from a similar agenda, the gags about the daily grind and what happens when a drone forgets how to be submissive make for beautifully low-key satire, and the caricatures of office types seem clever.",
    "Even if it doesn't up live to its inspired beginning, Mike Judge scores something with all the marks of a workplace cult classic with his first big-screen, live-action outing.",
    "At its shambling best, Office Space is like a bracing break at the coffee machine. Some horrible Monday, why not cut work to see it?",
    "Feels cramped and underimagined. I think Judge is capable of making an inspired live-action comedy, but next time he'll have to remember to do what he does in his animated ones--keep the madness popping.",
    "It has the loose-jointed feel of a bunch of sketches packed together into a narrative that doesn't gather much momentum. Its conspiratorial eager beavers are so undeveloped that they could hardly even be called types. You don't care for a second what happens to them."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Fed up with his mundane office job Peter Gibbons decides to neglect his job, finally ask out the waitress he has fancied for years and hatch an ill-conceived get rich quick scheme. Of course it doesn't exactly go according to plan....Fed up with his mundane office job Peter Gibbons decides to neglect his job, finally ask out the waitress he has fancied for years and hatch an ill-conceived get rich quick scheme. Of course it doesn't exactly go according to plan....\r Strangely overlooked upon its release word of mouth and the subsequent DVD release have seen Office Space become a cult comedy classic. Anyone that has gone through the day to day monotony of working life will quickly sympathise with Gibbons, played in brilliant understated fashion by Ron Livingston. The supporting cast from his irritating boss, to laid back next door neighbour, to stapler obsessed work colleague are all equally as good making for one of the funniest movies of the 90's.",
      "review_date": "2013-08-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A clever, sharp parody of office workers with a brilliant script and funny performances. It's a film that's very under the radar, as it lacks all the raunchy essences of films like 'Hangover', 'American Pie', and 'Knocked Up' for it to beA clever, sharp parody of office workers with a brilliant script and funny performances. It's a film that's very under the radar, as it lacks all the raunchy essences of films like 'Hangover', 'American Pie', and 'Knocked Up' for it to be marketed efficiently and easily at the same time. But if you give it a try, it's one of the funniest movies you're like to see, if you're an IT worker.",
      "review_date": "2014-06-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A classic, a movie you can watch over 30 times and still enjoy it every single time. This movie is already a cult classic and I guarantee people will still love it 20 years from now.",
      "review_date": "2010-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The scene where they go apesh*t on the fax machine is absolutely priceless...",
      "review_date": "2012-11-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It lacks the requisite edge to fully realise all of its satirical ambitions, but \"Office Space\" is nonetheless a sarcastic, engaging and underrated glimpse into the life of American office workers at the turn of the millennium, featuring aIt lacks the requisite edge to fully realise all of its satirical ambitions, but \"Office Space\" is nonetheless a sarcastic, engaging and underrated glimpse into the life of American office workers at the turn of the millennium, featuring a well-crafted storyline and well-timed jokes, bolstered by a perfectly-cast ensemble of straight men and women - with Ron Livingston an appealing and understated everyman lead - to outright oddballs - especially Bill Lumbergh and Milton, two of modern movies' most memorable and laugh-out-loud comedic creations.",
      "review_date": "2015-04-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "office space is hilarious smart gags, likable characters and has a relatable premise one of my favorites!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "review_date": "2015-05-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Office before The Office, this is the best satire of working life ever made. Despite being almost 20 years old, it hasn't aged a day. Highly recommended.",
      "review_date": "2017-05-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great character building and the acting is very good.   It loses it's momentum a little in the middle but is an outstanding movie and is one of the funniest movies ever.",
      "review_date": "2012-05-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Cult classic that if you havn't seen it yet, you may live in a hole. Very easy plot but the characters make the roles memorable. A mundane life is left behind for discovery-something we all wish we could do at one time or another. \"Damn itCult classic that if you havn't seen it yet, you may live in a hole. Very easy plot but the characters make the roles memorable. A mundane life is left behind for discovery-something we all wish we could do at one time or another. \"Damn it feels good to be a gangster.......\"",
      "review_date": "2012-07-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ummm.. Yeah if you could go ahead and give this movie a 10, as it is one of the most underrated and underappreciated movies of all-time, that would be greaat.....",
      "review_date": "2013-03-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of my favorite comedies of all-time. So re-watchable and Ron Livingston, Stephen Root as Milton, and Gary Cole nail it. Mike Judge made a perfect modern comedy.",
      "review_date": "2016-06-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Nice movie, now might be considered one of the cult movies - had many fun things in it and maybe if I would have watched it around beginning of noughties, I might enjoy it even more. Either way it was still enjoyable with plenty of classicNice movie, now might be considered one of the cult movies - had many fun things in it and maybe if I would have watched it around beginning of noughties, I might enjoy it even more. Either way it was still enjoyable with plenty of classic scenes in it.",
      "review_date": "2016-11-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Yeah.. um.. I believe that this movie is awesome so yeah thanks milton",
      "review_date": "2011-03-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is stale and bland, which doesn't make it entertaining at all. The humor is dry, often making for boring moments. Half funny, at the best moments.",
      "review_date": "2013-12-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is sheer genius. Hilarious. One of my favourite movies ever.",
      "review_date": "2007-04-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I have never met a human being who did not find this movie hilarious. It's fantastic, and it's already a classic. Every reviewer whose score wasn't in the green is a moron. Comparing this movie to Bartleby the Scrivener is one I have never met a human being who did not find this movie hilarious. It's fantastic, and it's already a classic. Every reviewer whose score wasn't in the green is a moron. Comparing this movie to Bartleby the Scrivener is one of the most sickening, insulting things I have ever heard in my life. And as a compliment, no less. Don't read these reviews, ask people, they will all tell you that this movie is an amazing comedy.",
      "review_date": "2006-10-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great movie. Anyone who has ever worked for a big company will especially appreciate this movie. There are so many scenes in this movie that I find myself quoting to friends. Watch the movie, odds are you will love it.",
      "review_date": "2006-03-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Hilarious and on the topic. Probably one of the best movies of all time. Warning: people who don't have cubicle/office jobs won't find it (as) funny.",
      "review_date": "2005-10-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Having worked for a few large corporates in my time, I could relate to so much in this movie! from everything to the stupid \"motivational\" / \"mission statement\" banners that get put up in offices to the multitudenous forms of office Having worked for a few large corporates in my time, I could relate to so much in this movie! from everything to the stupid \"motivational\" / \"mission statement\" banners that get put up in offices to the multitudenous forms of office double-speak. This will become a cult classic (if it has not already)!",
      "review_date": "2006-07-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Hilarious!",
      "review_date": "2005-11-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a hilarious movie with a laugh-out-loud plot.",
      "review_date": "2006-03-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Netflix bought this film to my attention, and I am now in debt to them, Office Space hits all the right notes by offering a hilarious yet realistic insight into the typical 9-5 job, through repetition. There is always that person in the jobNetflix bought this film to my attention, and I am now in debt to them, Office Space hits all the right notes by offering a hilarious yet realistic insight into the typical 9-5 job, through repetition. There is always that person in the job who takes it too seriously, the other one who thinks they are the greatest thing to happen to the place since it began, and of course the ones that dream outside of the place everyday, the ones who simply don't want to be there.\rPeter (Ron Livingstone) falls into the last category, a yes-man who often thinks up scenarios outside of his office cubicle, what if he won one million dollars, why does he continue to do as he is told?\rWhen he agrees to a form of hypnotic therapy, a tragic mishap leaves him still in half-hypnosis, he sees a new outlook and a new found sense of calm, and the confidence to do what he has always wanted, nothing.\rHis honesty pays off to an extent, and the underlying message within the film shines through, not necessarily be honest down to the point of full admittance, but be who you should be, its a look at just how executive management can come with various scare tactics.\rThe highlights of the film are the repetitive devices used throughout the film, especially the role of vice-president Bill, played in excellent fashion by Gary Cole, or Milton, the mumbling employee, who is just hilarious to listen to at every turn, played by Stephen Root.\rThe messages ringing true are not to accept something menial if you believe it to be so. The genius of the film is its simple premise of disgruntled office workers, always wanting to establish themselves as something better, but the prospect of continuing money and a sense of security leaves many too comfortable and afraid of change, therefore accepting their position. Jennifer Aniston also stars as another bored employee, but of a restaurant that Peter and his friends often visit.\rThe slow pace of the film benefits greatly to the story and to develop characters that are reminiscent of real life situations and people. An underrated and brilliant comedy that is relatable and true, right down to the point where we all want to throw it in the bosses face.",
      "review_date": "2013-06-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Office Space was a pretty good comedy overall. Its portrayal of office life is funny and, throughout, it is pretty funny. It is never uproariously funny, but the humor it goes for often times works pretty well. The acting is fine as a wholeOffice Space was a pretty good comedy overall. Its portrayal of office life is funny and, throughout, it is pretty funny. It is never uproariously funny, but the humor it goes for often times works pretty well. The acting is fine as a whole and the story is interesting. However, something just feels like it is missing. It is hard to put my finger on it, but I was left slightly underwhelmed. I was entertained and the movie was just fine, but there was a part of me that felt like there was something that was not there that should have been there. I guess my problem with the film is that it felt relatively safe. It was not extraordinary in any way and was content just being some movie rather than going for more. While fine, I doubt this one will be one I remember in great detail. Just feels run-of-the-mill.",
      "review_date": "2014-06-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "More of an entertainment movie than one that teaches you anything. There were some comic elements in the movie but pretty mild comedy. The acting was great though by everyone.",
      "review_date": "2016-10-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What the hell is wrong with critics ! This is an absolute classic from back in the day that is still relevant as ever ! I read someone complaining about the writing in the second half ?!?!?   Great movie great characters",
      "review_date": "2021-08-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Directed by \"King of the Hill\" creator, Mike Judge, \"Office Space\" is a pretty funny comedy about the dreaded life within a cubicle. Ron Livingston does a swell job portraying the likeable character Peter Gibbons, and Gary Cole does anDirected by \"King of the Hill\" creator, Mike Judge, \"Office Space\" is a pretty funny comedy about the dreaded life within a cubicle. Ron Livingston does a swell job portraying the likeable character Peter Gibbons, and Gary Cole does an excellent job playing the subtly villainous Bill Lumbergh. Oh and of course you can't forget, the classic character, Milton. Overall, \"Office Space\" is a fairly amusing trip.",
      "review_date": "2012-11-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Office Space is sometimes funny, and has an interesting storyline. But the best part of Office Space is its spot-on accuracy of portraying life inside the cubicle.",
      "review_date": "2014-03-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This wickedly funny movie seems to present an awful lot of wish fulfilment for anyone who's ever worked in an office, as Ron Livingston does everything you want to do at your job but can't.  The humour is dry and the individual's charactersThis wickedly funny movie seems to present an awful lot of wish fulfilment for anyone who's ever worked in an office, as Ron Livingston does everything you want to do at your job but can't.  The humour is dry and the individual's characters quirks present fun caricatures of some of the types you might come across in an average office, while the movie does a great job of conveying the frustration and futility of modern office life with lots of quotable moments--there's a reason this movie has produced expressions so ubiquitous I didn't even know they were from this movie (\"goddamn right Bob\") as well as a popular meme.  Very funny, clever film.",
      "review_date": "2015-03-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I personally would have liked the film to have been a tad longer, however that said it is an excellent film. The cinematography and direction are both rock solid, the cast helped by great characters do wonderful jobs, alongside Friends andI personally would have liked the film to have been a tad longer, however that said it is an excellent film. The cinematography and direction are both rock solid, the cast helped by great characters do wonderful jobs, alongside Friends and The Iron Giant Office Space is one of the better projects and roles Jennifer Aniston appeared in and the story is very interesting and well paced.But it is the humour and writing where Office Space really soars. Consistently the writing and humour in Office Space is hilarious yet surrealistically truthful as well. Also this is a film that for me gets better and better every time I feel, I find something new to admire and to smile and laugh at each time.Overall, Office Space is a great comedy. 9/10 Bethany Cox",
      "review_date": "2022-03-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "tons of mutual things to connect with the audience..Office Space\n\nJudge's mockery on the mundane life is frankly not that funny as he might think. It is loosely placed and poorly edited with awkward silences in mid sequences that justtons of mutual things to connect with the audience..Office SpaceJudge's mockery on the mundane life is frankly not that funny as he might think. It is loosely placed and poorly edited with awkward silences in mid sequences that just doesn't fit. The concept is something to ponder about but beyond that it barely moves forward on terms of storytelling. And as far as the irritation and the frustration that it has to communicate, it does that easily and smoothly and the primary reason to that is that there are tons of mutual things to connect with the audience. And since it practically depicts, your mundane life and mocks over it, there are tiny notions and typical sketchy gags that you can thoroughly enjoy.The narration is sloppy and not at all gripping, it has a lot to say but it probably found itself obliged to draw a laugh out of each scene that resulted into a big misconceived misconception about corporate world. Livingston isn't hilarious, his eyes doesn't speak the laziness that its character demands and neither is Aniston in her A game on supporting him. The other cast holds on to their one-dimensional acts and draws out few chuckles every now and then. It doesn't take itself seriously in its initial stages and when it wants you to take things seriously in the final act, it gets kind of difficult to shift the tone.Judge has the heart in the right place and that enthusiasm is what fuels this somewhat dim witted script and makes it worth the while. The conversations are pragmatic but the execution of it could have been a lot better. Judge feels vulnerable behind the screen and you can practically see him sweat, there is no ease in storytelling, it makes you uncomfortable at times. Office Space has a good satirical message to convey to its audience, buy personally I prefer the meal perfectly cooked and not just contain mouthwatering ingredients.",
      "review_date": "2018-11-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I have watched this movie a dozen times and will probably watch it a dozen more...top notch in every regard.",
      "review_date": "2018-07-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This probably has to be one of the better comedy movies I've seen in a while, all the cast do a good job for what they're given and the dialogue which they give is always good and it doesn't feel poorly given out. Also, Peter (Ron Livingston)This probably has to be one of the better comedy movies I've seen in a while, all the cast do a good job for what they're given and the dialogue which they give is always good and it doesn't feel poorly given out. Also, Peter (Ron Livingston) and Milton (Stephen Root) made me laugh from start to finish with how they act throughout this movie and they also do a really good job for what they're given, so does the rest of the cast in this brilliant movie. Overall, I'd honestly say its worth the watch if you're wanting to watch a really funny comedy movie this is the one for you to watch, I'd honestly recommend it.",
      "review_date": "2020-04-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is and will always be a classic. The humour is sometimes a bit bland but that doesn't diminish the greatness of this film.",
      "review_date": "2022-08-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie got me at the perfect time, just starting working my first true \"office\" job and it is still very relatable to this day.",
      "review_date": "2022-06-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Mike Judge's Office Space is a movie that describes what office workers feel like at work. And the Gary Cole performance is one of his best.",
      "review_date": "2022-06-21",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 60,
  "genres": [
    "Comedy",
    "Romance",
    "Crime"
  ]
}