{
  "title": "Princess Mononoke",
  "rating": 8.8,
  "release_date": "1999-10-29",
  "summary": "The mythological tale of a war between encroaching civilization and the beast gods of the forest.  (Miramax)",
  "critic_reviews": [
    "One of the most visually inventive films I have ever seen.",
    "Its breadth, profundity, and stunningly rendered vision make idealism seem renewed and breathtaking again.",
    "Has the effect of making the average Disney film look like just another toy story.",
    "A big movie for the ages, full to the brim with sympathy, imagination and sheer visual delight.",
    "A landmark feat of Japanese animation from the acknowledged master of the genre.",
    "Amore satisfying use of the medium would be difficult to imagine.",
    "Rarely does any film, animated or otherwise, immerse you in such a vivid landscape and engage your senses so strongly.",
    "The majestic pageant of images - no sylvan landscape has been this indelibly, dimensionally alive - is inextricably welded to the multifold spiritual / ecological questions about the future that Miyazaki is contemplating.",
    "A visually stunning film.",
    "Like a lot of anime, it's overlong and gets way too metaphysical at the end, but ultimately, this is a Princess worth worshipping.",
    "A dazzling movie, gorgeous to look at, involving on both emotional and intellectual levels, and often thrilling.",
    "Exceedingly imaginative, beautifully realized animated epic adventure.",
    "The film's storytelling and heartfelt pantheism are both impressive.",
    "Opinionated magic and mayhem",
    "The beauty and scale of Miyazaki's vision shines through.",
    "Complex, superbly rendered, and wildly eccentric anime-even by Miyazaki's own standards.",
    "A film for the young at heart and those who still appreciate honor, valor, love, and the earth.",
    "A must-see for animation fans.",
    "More thoughtful and varied than the average Hollywood cartoon.",
    "In theme and technique, it pushes the boundaries of animation and opens up new and imaginative possibilities.",
    "A rare spectacle on the big screen.",
    "It's Miyazaki's use of sound--and silence--that takes your breath away",
    "Much more mythic and risk-taking than the usual Hollywood product.",
    "Its imagery is never less than breathtakingly beautiful, and is occasionally truly awesome",
    "While Mononoke is often gorgeous to look at and has a far more sophisticated story than most Japanese animated features, it still feels overlong and dramatically unengaging.",
    "A Zeitgeist potpourri, strung with late-20th-century fear and anxiety.",
    "A thing of beauty and imagination.",
    "As spectacular as it is dense and as dense as it is colorful and as colorful as it is meaningless and as meaningless as it is long.",
    "Wacky, vividly conceived but mundanely executed cartoon fantasy."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "An amazing film. The story and the characters just blew me away.",
      "review_date": "2009-08-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "OK, its great. But damn its not that easy to follow. Its never truly clear exactly whats going on, but you do get the jist of thing. Great voice acting, and truly one of the finest animations ever - there were several scenes id consider to OK, its great. But damn its not that easy to follow. Its never truly clear exactly whats going on, but you do get the jist of thing. Great voice acting, and truly one of the finest animations ever - there were several scenes id consider to be classed...(read more) as Art - incredible detail, beautiful landscapes etc. Im a complete newbie to animated movies that are neither Disney nor the incredible South Park movie, so forgive my lack of love for the plot/style, but id certainly recommend others to watch this.",
      "review_date": "2008-08-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Brilliant. I love this movie. Everything from the story, to all the animations and characters were superb.",
      "review_date": "2005-10-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Completely outstanding - it is easily one of the very best films of the 90's.",
      "review_date": "2006-04-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Several years after falling in love with anime, I decided to watch this to see if it lived up to the hype. After watching this, I fell in love with anime again. Although several years old the animation has hardly dated, the plot is Several years after falling in love with anime, I decided to watch this to see if it lived up to the hype. After watching this, I fell in love with anime again. Although several years old the animation has hardly dated, the plot is excellent, the characters are memorable. I gave this film to a younger cousin, she loved it. Princess Mononoke is one of, if not THE, best movie I have EVER seen. EVER.",
      "review_date": "2007-02-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This charming mythology and visual classic pits an environmentally despoiling mankind against the natural order. The real enemy is not man's greed but the polarization on both sides that leads each to hate the other - a lesson more This charming mythology and visual classic pits an environmentally despoiling mankind against the natural order. The real enemy is not man's greed but the polarization on both sides that leads each to hate the other - a lesson more should heed. A little drawn out, and the inevitable conclusion that nature bats last is reached, but all in all a non-judgemental and lovingly crafted work.",
      "review_date": "2006-01-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was an excellent animation. why are some newspaper critics too stupid to realize this? I would have puta ten for this one. The only reason i gave it a nine is because I found some of the characters to be a little too odd to my liking This was an excellent animation. why are some newspaper critics too stupid to realize this? I would have puta ten for this one. The only reason i gave it a nine is because I found some of the characters to be a little too odd to my liking (the god of the forest and the boars were strange)",
      "review_date": "2006-02-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is one of those films in which it's so good, that at the end you wish for another installment; a sequel, however you know there can't be one, for it would ruin the film's good name. Sheer visual beauty (lush greens of This is one of those films in which it's so good, that at the end you wish for another installment; a sequel, however you know there can't be one, for it would ruin the film's good name. Sheer visual beauty (lush greens of open, gusty fields and vast mountains that surpass imagination) meets an epic soundtrack the brings tears to one's eyes (a melody played throughout the movie which will stick in your psyche for years as you endlessly hum the adventurous tune to yourself and an ending piano number that, after hearing the song I previously described, might just make you burst into tears, as it casts a feeling of overwhelming spirituality that truly remains with you for a long time) In the end, the movie is about love, hatred, death, friendship, rivalry, happiness, anger, glee, sorrow, and being a human being. However, overall, it's about being alive. I never thought an animated film, let alone an anime, could be so purely great. If this isn't Oscar material, I have no clue in hell nor space what is. -Scott L.",
      "review_date": "2007-11-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Amazing film, why the mediocre critic reviews? I'd put this up with and maybe beyond spirited away.",
      "review_date": "2010-01-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Princess Mononoke\" is simply a masterpiece. The characters have the capacity to develop itself into any type; romance, action, horror, and so on. The story is simply linear but very symbolistic in diverse ways. It's a definite must-watch.",
      "review_date": "2011-09-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is the best ever",
      "review_date": "2008-12-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Princess Mononoke is one of Miyazaki's most violent movies. The film's great animation and easy messaging work in it's favor, but dull pacing ultimately makes Princess Mononoke harder to enjoy than some of Gibili's other works.",
      "review_date": "2014-06-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Has the usual problems of Japanese animated films (incoherent) along with the usual pluses (good animation).",
      "review_date": "2019-04-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I would go as far to say that Princess Mononoke is as perfect a film as one could ever make.  Miyazaki has created an experience that is visually and emotionally arresting.  Each frame of this film could be sold as a painting, it's just thatI would go as far to say that Princess Mononoke is as perfect a film as one could ever make.  Miyazaki has created an experience that is visually and emotionally arresting.  Each frame of this film could be sold as a painting, it's just that beautiful.  Miyazaki's message of tolerance, self-control, and finding harmony with our surroundings is equally beautiful  the amazing thing about Princess Mononoke's narrative is that there is no concrete antagonist; you could find something relatable and lovable about every character drawn to the screen.  The performances delivered by the voice actors  for the Japanese and English versions- are both top notch.\r This is a film that will survive the test of time due to its visual and thematic majesty, and each of these beautifully realized properties work together to make an experience that is easy to get lost in again and again.  Everyone should give this film a watch, it offers so much more to an audience than just escapism; it serves to delight as much as it does teach.",
      "review_date": "2013-04-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Anyone who says this is overlong, or that they hate it for being overlong, obviously was just paying too much attention to the length of the film and not to the film. This is probably - no, this IS - one of the best films ever made in the Anyone who says this is overlong, or that they hate it for being overlong, obviously was just paying too much attention to the length of the film and not to the film. This is probably - no, this IS - one of the best films ever made in the history of cinema, animated or live-action, along with his other masterpiece, Spirited Away. Princess Mononoke is so lush, and engaging, and it just captures you and doesn't let you go. It's a wondrous tale of MAN vs. EARTH, told spectacularly. This film hardly deserves a much less rating than Spirited Away. In fact, this film is better! It's only about 10 minutes longer than Spirited Away, so the critics can all go shove it. This deserves at least a 97 on the Metacritic score. All this movie's fans know that it is perfect, and all the critics giving it less than a - sayyyy - 95, are wrong.",
      "review_date": "2007-04-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The only animated epic I can think of that perfects human drama and the evils of industrialisation. An absolutely wonderful film that gives you goosebumps whenever you watch it a second time. It may even some viewers cry. This is not a kidsThe only animated epic I can think of that perfects human drama and the evils of industrialisation. An absolutely wonderful film that gives you goosebumps whenever you watch it a second time. It may even some viewers cry. This is not a kids movie, and Princess Mononoke shows that animation can tell stories that are impossible to tell through live action film. In case anybody is interested, this is also the movie (among others) that inspired James Cameron's AVATAR, especially the main story.\r In fact, AVATAR is basically a remake of this. Personally, this is the superior movie and I will remember it longer than that $237 million budgeted movie.",
      "review_date": "2013-03-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Hayao Miyazaki's first japanese animation debut in america to ever make such a grand classic like Princess Mononoke.",
      "review_date": "2010-10-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great art design with some beautiful pictures. The story is not a good vs. bad klischee plot but offers various characters, all having their own reasonable motivations. Soundtrack is also great work. Still it lacks something to be truly aGreat art design with some beautiful pictures. The story is not a good vs. bad klischee plot but offers various characters, all having their own reasonable motivations. Soundtrack is also great work. Still it lacks something to be truly a 10/10 movie.",
      "review_date": "2013-03-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's a masterpiece, I basically grew up with that movie and so I have listened to it many many times both in English and Japanese. If you like anime you need to watch this.",
      "review_date": "2013-07-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Indisputably (in my opinion) Ghibli's true masterpiece.  Spirited Away is slightly overrated, but this is vastly underrated.  The story keeps going at a decent pace, but never feels forced.  The characters almost all experience some sort ofIndisputably (in my opinion) Ghibli's true masterpiece.  Spirited Away is slightly overrated, but this is vastly underrated.  The story keeps going at a decent pace, but never feels forced.  The characters almost all experience some sort of development over the course of the film.  Also, the animation surpasses even Studio Ghibli's awesome standards.  The scenery is beautiful, and the near-apocalyptic climax is one of the most 'epic' scenes I have ever seen in any film.  Unless you truly hate all of anime, Studio Ghibli, nature, wolves and film, this will take your breath away.  I fail to see how it could be improved.  Do not let the length put you off.",
      "review_date": "2013-03-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Princess Mononoke\" is simply a masterpiece. I have watched it 3 times and I'm sure I'll watch many times more. why the mediocre critic reviews? I say mediocre because it is the best animation I've ever seen and I have seen lots of them.",
      "review_date": "2013-09-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is Miyazaki's most intelligent and mature story.\r The characters are incredibly realistic, the nature-depicting art is beautiful as always, and there are multiple themes going on. This is an anti-war film, a environmental film, a filmThis is Miyazaki's most intelligent and mature story.\r The characters are incredibly realistic, the nature-depicting art is beautiful as always, and there are multiple themes going on. This is an anti-war film, a environmental film, a film about life and death, a film about love and hatred, and a love story, all in one. This is not a film to miss.",
      "review_date": "2015-04-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is my most favorite anime movie of all time!!! This movie is amazing and is absolutely gorgeous!",
      "review_date": "2018-09-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Miyazaki's most gore piece that's actually rather for adults, I would say it's Studio Ghibli's darkest story and without a doubt their top 3 animations of all time",
      "review_date": "2020-03-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Maybe I was spoiled by the hype around the movie, but I failed to enjoy it and I still think it's not one of Miyazaki's best works. The best thing about the film is the fantastic music by Joe Hisaishi - 10 out of 10 for the score. Maybe I was spoiled by the hype around the movie, but I failed to enjoy it and I still think it's not one of Miyazaki's best works. The best thing about the film is the fantastic music by Joe Hisaishi - 10 out of 10 for the score. The animation is beautiful as well, but not outstanding when compared to other works. The violence depicted (cutting of arms and the like) does not seem to serve any purpose but means that it's not suitable for children, which is sad, because they might enjoy it more. The story and the characters are bland. The storytelling is careless at best. Many plot lines are dropped and never readopted. One example of this is the hero's love interest who gives him a pendant as he is forced to leave. She is never mentioned again. Character's motives aren't explored and seldom a character reflects on his deeds. I often read that it's great that the film does not try to answer the question of which characters are good or evil, but this aggravates the problem. It's also the explanation why many of the character's decision seem so indiscriminate. The film's pacing doesn't help here, as it is so slow to leave much time for thinking about all the gaps in the story. In conclusion: A beautiful picture with promising topic and setting which is ruined by sub-par story-telling and characters.",
      "review_date": "2010-01-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Slow, repetitive, longer than needed, and I didn't find any story aspect that could make me forget its awful rhythm. Artistically, meaning draw and music specially, it's great, but for me it's just an empty movie. Beautiful, but withoutSlow, repetitive, longer than needed, and I didn't find any story aspect that could make me forget its awful rhythm. Artistically, meaning draw and music specially, it's great, but for me it's just an empty movie. Beautiful, but without anything to tell. Yeah, ok, it has that ecological and respect between cultures topic on it, but it has been done thousands of times before and after this movie with better results. I may give it a second chance, but I don't think it was just a bad day.",
      "review_date": "2011-07-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What the hell is wrong with the world. This was possibly the worst movie I've ehehever seen. I watched the whole thing on a friends suggestion, and I must say, it was the worst choice my friend had ever made. I hated it immensely, I What the hell is wrong with the world. This was possibly the worst movie I've ehehever seen. I watched the whole thing on a friends suggestion, and I must say, it was the worst choice my friend had ever made. I hated it immensely, I know some people liked it, and I guess that's fine for all Asians and anime fans, but over all, it's horrible. And I wish I could rate it less then a 0.",
      "review_date": "2008-07-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I hated this movie, it was so hard to get through.",
      "review_date": "2006-10-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I bought this movie because I saw a friend in school with a graphic novel about it. I think this movie introduced me to Japanese animation and I still think it is the best of it's kind and much better than most mainstream movies out these. ItI bought this movie because I saw a friend in school with a graphic novel about it. I think this movie introduced me to Japanese animation and I still think it is the best of it's kind and much better than most mainstream movies out these. It is better not to spoil anything but trust me almost anyone with an open mind to anime films will love this movie.",
      "review_date": "2010-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Princess Mononoke is just a dull, completely unbelievable and surprisingly disgusting animated picture that simply surplus Ghibli's filmography, which titles are even more breathtaking that this one.",
      "review_date": "2017-03-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie follows what is essentially an isekai protagonist rather than the actually interesting Mononoke. Not even the brilliant animation can save the uninteresting story.",
      "review_date": "2020-07-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe film was just awesome. It really subverted my expectations a lot. When you hear the word \"princess\", you don't think of a lady or a film as tough as this one. The conflict was one of the best I've ever seen: not black and white, but both sides had colliding interests and refused to settle without violence. It's refreshing to see an anime with two amazing female characters oppose each other like this. Other animes have a different approach towards women. The \"main character\" doesn't matter much, which is also nice to see, because it's not the one heroic dude who saves the day. They did not fall for any clichés here. From the beginning, where the MC walks into a battle with no music and an ordinary setting, to the end, where he does not end up with the pretty girl he flirted with. My only complaint is that the ending is kind of gross and confusing.",
      "review_date": "2022-04-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A great film, but no where near as good as Nausicaa of the Valley of the Wind, upon which Monoke is kid of based.",
      "review_date": "2008-01-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A great miyazaki film, the only problem was the dub kinda sucked, so to fix this, watch it in japanese with english subtitles",
      "review_date": "2009-03-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The critics who gave this most excellent film low scores show their abysmally low intelligences in doing so. Just read the reviews. It's as if Disney paid them off. This transcends the anime genre. Except for the unusual concepts and The critics who gave this most excellent film low scores show their abysmally low intelligences in doing so. Just read the reviews. It's as if Disney paid them off. This transcends the anime genre. Except for the unusual concepts and cultures, it hardly seems foreign at all. Not that I am saying it is like anything Disney puts out. This story actually has depth, morality, tragedy, things which American animators consitantly flunk with. And as one critic said, it avoids the failings of most nature v. man tales-- that is, there is no black and white in this story, and there is no good and evil. I found only one character that I was capable of completely disliking That brings me to the voice acting. So often when films are dubbed, especially anime, the product becomes painful to listen to. But, thankfully, Miramax went all out. It's not that they put out the money to hire big stars, it's that they took the time to find actors who could understand their respective characters, and voice them appropriately. Disney comparisons are unavoidable, but only because Disney owns the American animation market. If Japan can send us more films like this, Disney may be in trouble.",
      "review_date": "2002-08-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Of all of Miyazaki's amazing works, I'd have to say this is one of my favorites. The music, artwork, story-everything is amazing. And the whole overall feel of the film is amazing.",
      "review_date": "2007-01-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In a time when \"epic\" just means \"long,\" Princess Mononoke reminds us what that word really means. Here is a bold movie with no villains, only flawed people who often do as many vile things as good. For once we have a film with character In a time when \"epic\" just means \"long,\" Princess Mononoke reminds us what that word really means. Here is a bold movie with no villains, only flawed people who often do as many vile things as good. For once we have a film with character development, but one that also recognizes something more important than character development: seeing people as more than one dimensional right now, before they change. The magic of the film's world is as foreign to the American mind as its language, and is thoroughly rewarding to experience. There is blood, there is suffering, and even death in this movie, yet I would share it with my children. Like Walt Disney, Hayao Miyazaki does not shelter audiences from horror. He is smart enough to frame it, to educate and to evoke. The animation is gorgeous, and the soundtrack is not only thoroughly moving, but sounds authentic to the fantasy world. This is a long animated feature that earns ever half hour of its time in your DVD player.",
      "review_date": "2007-02-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I though this was an amazing movie. I've literally watched it tens of times and still love it. I've noticed that the people who don't like it/give it low scores are the ones who don't seem to understand Japanese culture I though this was an amazing movie. I've literally watched it tens of times and still love it. I've noticed that the people who don't like it/give it low scores are the ones who don't seem to understand Japanese culture and the whole idea of even the forest gods. Simply have an open mind when watching this movie; you'll find that it's quite good, and had lots of detail.",
      "review_date": "2009-10-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Stupid american teens who pretend to be grown ups and reject this movie because it's animated are just idiotic!This is the most mature animation i have ever seen and the stupid youth doesn't have the education to realize this is a Stupid american teens who pretend to be grown ups and reject this movie because it's animated are just idiotic!This is the most mature animation i have ever seen and the stupid youth doesn't have the education to realize this is a powerful film full of meseages not thrown at your face,calling the plot week just because they are used to stupid american teen movies with \"clever\" suspense or just because they are bored to read the subtitles!How can anyone call this incomprehensable?How can anyone reject it because it's an animation or because the animation has gotten old?What's your favorite movie anyway,Butterfly effect?",
      "review_date": "2009-07-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is one of the single most amazing animated movies ever created, if not the greatest movie ever created. Why it has a 76 on metacritic is BEYOND ME..some critics need to get over the awful bias that CARTOONS and ANIME are completely different.",
      "review_date": "2010-01-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I don't have to say anything. Go watch it for yourself. You'll see what I mean.",
      "review_date": "2010-01-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I like this movie very much great animation/sound/voice/music but the ending was not very good but other than that i think this movie was the best i seen.",
      "review_date": "2006-07-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "visually stunning faboulous story. loved it, loved it, loved it. i look foward to anything from these creators",
      "review_date": "2008-12-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The biggest wow! ever.",
      "review_date": "2005-12-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Princess Mononoke is an epic piece of animation about greedy human capitalism and its consequent destruction of flora and fauna. The main character is against extremes of opinions and therefore tries to fight for a symbiotic balance betweenPrincess Mononoke is an epic piece of animation about greedy human capitalism and its consequent destruction of flora and fauna. The main character is against extremes of opinions and therefore tries to fight for a symbiotic balance between humans and the world of the forest, for all beings ought to work together in a world of peace and respect, rather than to exploit and kill one another. This is not a children's movie because it is quite brutal and scary at times. However, there is also fun, cuteness, feminism, and no boredom throughout the movie. Very recommended.",
      "review_date": "2011-02-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Hayao Miyazaki rocks! With its epic story and breathtaking visuals, Princess Mononoke is a landmark in the world of animation. See it in High Definition.",
      "review_date": "2011-02-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "While not quite as good as Miyazaki's other works, Princess Mononoke is still very excellent and fantastic. Animation is, as expected for a Miyazaki film, is very, very good, and the plot is very interesting and well-written.",
      "review_date": "2012-02-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Definitely best anime movie of all time. So much symbolism and path crossed of such that can not be touched by any other movie. This is a movie that will make you want to watch every anime out there.",
      "review_date": "2012-02-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An outstanding achievement by Hayao Miyazaki. Clearly shows connection between humans and nature, the importance of preserving life. Spectacular visuals, wonderful soundtrack, and beautiful story make it an all time classic in anime films,An outstanding achievement by Hayao Miyazaki. Clearly shows connection between humans and nature, the importance of preserving life. Spectacular visuals, wonderful soundtrack, and beautiful story make it an all time classic in anime films, and a must-see.",
      "review_date": "2012-01-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Extraordinary film from Hayao Miyazaki. I love the way Miyazaki is able to blend tender, peaceful moments in between the chaos of all the fighting. My favorite is the scene where **** is too weak to chew his food so San feeds him like aExtraordinary film from Hayao Miyazaki. I love the way Miyazaki is able to blend tender, peaceful moments in between the chaos of all the fighting. My favorite is the scene where **** is too weak to chew his food so San feeds him like a mother wolf feeding here cubs.",
      "review_date": "2012-02-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "As usual with studio Ghibli, i thoroughly enjoyed this movie and have watched it several times over. While critics believe it not up to par with spirited away, i totally disagree. All studio Ghibli movies are on par with one another exceptAs usual with studio Ghibli, i thoroughly enjoyed this movie and have watched it several times over. While critics believe it not up to par with spirited away, i totally disagree. All studio Ghibli movies are on par with one another except for 'Tales from Earthsea'. This movie, like the others, is a blend of Japanese 'Anime' and the traditional Western Animation cultures. It's a beautiful movie, with stunning character depths, a fantastic story which takes you in and drowns you in a beautiful blend of stunning landscapes, fearful monsters while underneath bearing resemblance to real world issues, as is with all Studio Ghibli movies. I explicitly recommend this movie to EVERYONE. Studio Ghibli is without fail one of the greatest production studios out there, and if you love one movie, you will love them all.",
      "review_date": "2012-04-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Someone doesn't even have to like anime to have to like Princess Mononoke. One watch and they'll be hooked. For Princess Mononoke is a gift to film lovers of all kind and deservedly one of the best films of the '90s.",
      "review_date": "2012-05-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not enough words to explain how i feel about this film. Everything works together, mainly the score and emotional impact of the film. A mixture of old Japanese culture and folklore mixed with modern problems, this film gets a point across in style.",
      "review_date": "2012-06-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This Is One Of The Best Movies Of All Time!\rThe Animation Style And Writing Is Unforgetable! One Of Ghibli's Best Works!",
      "review_date": "2012-05-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Cool as s**t! Brutal acts of deviance, vivid showcases of violence and some serious blood all founded upon a deeply rooted stance on the epidemic of hatefulness. I would write a longer review, but this one is truly epic in the actualCool as s**t! Brutal acts of deviance, vivid showcases of violence and some serious blood all founded upon a deeply rooted stance on the epidemic of hatefulness. I would write a longer review, but this one is truly epic in the actual definition. It is a long sweeping powerhouse of a story that has it all. Love, hate, viciousness, deceit, redemption, victory, failure, relief, passion, soul, kindness, drama, action, suspense, reflection, joy, sadness, adventure and heart. Princess Mononoke is an experience.",
      "review_date": "2012-11-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Another masterpiece from Hayao Miyazaki. Princess Mononoke is one of the greatest animation movies I've ever seen. The story is excellent and the characters are perfectly thought out. And the music in this movie is as ever brilliant in aAnother masterpiece from Hayao Miyazaki. Princess Mononoke is one of the greatest animation movies I've ever seen. The story is excellent and the characters are perfectly thought out. And the music in this movie is as ever brilliant in a Miyazaki film. A true experience to watch.",
      "review_date": "2013-07-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "For me this is my favorite animation movie of all time, I saw it when I was still a child and it shocked me.\rUnlike other animation movies, it has a very original plot. The settings are also very uncommon and the drawings are awesome, anFor me this is my favorite animation movie of all time, I saw it when I was still a child and it shocked me.\rUnlike other animation movies, it has a very original plot. The settings are also very uncommon and the drawings are awesome, an authentic masterpiece.\rThe characters are very special, every character has her own personality and behavior, whit lots of references to the real world nowadays. It’s not the generic movie with the good guys and the bad guys, more mature story line than the majority of animation movies.\rThe timing is perfect, whit the correct amount of action scenes, funny moments and the progression of story.",
      "review_date": "2014-02-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of Miyazaki's most notable films. The music and animation come together almost perfectly, albeit with the exception of the lack of fluidity in motion. It makes one have a deeper sense of the many good and bad ways humans affect theOne of Miyazaki's most notable films. The music and animation come together almost perfectly, albeit with the exception of the lack of fluidity in motion. It makes one have a deeper sense of the many good and bad ways humans affect the planet. (Sounds cheesy, I know.) I would complain about the dialogue and bad voice acting, but that is to be expected with a movie originally written and animated in a different language.",
      "review_date": "2013-01-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A masterpiece of its time. The story is deep, the visuals amazing, and the characters really make it all come together. There is great symbolism and there's a solid message throughout the movie, whilst there still being action and humorA masterpiece of its time. The story is deep, the visuals amazing, and the characters really make it all come together. There is great symbolism and there's a solid message throughout the movie, whilst there still being action and humor surrounding the dark atmosphere that the movie creates. It's a dark tale enveloped by gods and demons that help move the story along and provide substance to the movie as a whole. It is long and can be considered hard to get through (based on the negative reviews on this site), but sticking with it will provide with an enjoyable experience overall.",
      "review_date": "2013-01-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is Miyazaki's best movie in my humble opinion. I love how all the characters have noble intentions and it is never about good versus evil. You see things from all sides and perspectives. I have watched this movie so many times and neverThis is Miyazaki's best movie in my humble opinion. I love how all the characters have noble intentions and it is never about good versus evil. You see things from all sides and perspectives. I have watched this movie so many times and never grow tired of it. Beautiful to look at and an epic score as well. I can't wait until this comes out on Bluray.",
      "review_date": "2013-02-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Princess Mononoke is without a doubt Miyazaki's best work. It has all the creativity of Spirited Away along with a far more mature and compelling plot line. The animation is beautiful, the music is uplifting, and the characters are allPrincess Mononoke is without a doubt Miyazaki's best work. It has all the creativity of Spirited Away along with a far more mature and compelling plot line. The animation is beautiful, the music is uplifting, and the characters are all memorable. If you like films, do yourself a favor and watch this movie.",
      "review_date": "2013-06-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the most beautiful stories about nature,friendship and war! Great story, superb soundtrack, fun characters and amazing visuals, makes Princess Mononoke a MUST-WATCH!",
      "review_date": "2016-04-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One The Greatest Films Of ALL Time! Just Stunning!\rThe Most Visually Inventive Film I Have Ever Seen!",
      "review_date": "2013-03-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great movie!\r In my honest opinion is the best film that director Hayao Miyazaki has done, excellent story with well done writing, fluid and graceful animation with wonderful character designs, great action scenes and colorful backgroundsGreat movie!\r In my honest opinion is the best film that director Hayao Miyazaki has done, excellent story with well done writing, fluid and graceful animation with wonderful character designs, great action scenes and colorful backgrounds and great soundtrack... there is a lot of work putted in the development of this movie, I can't imagine what was going through the mind of Miyasaki but I can tell he was in love with this story.\r If there is one complaint I have is with the ending, is not bad but is rather weak compared with the rest of the movie, but maybe it was meant to be that way. Princess Mononoke is just a great movie... I highly recommend this one if you haven't watched it.",
      "review_date": "2014-06-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis is one of Miyazaki's best works by far. The imagery is beautiful, and often times filled with gore, and the story is genius. This film shows Miyazaki can tackle a PG-13 movie and be triumphant.",
      "review_date": "2013-03-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Amazing movie from Studio Ghibli. Miyadzaki genius in all its power. Wonderful, but rough tale of friendship, love, hatred, and full of ancient Japanese magic. I didn't put 10 mark because the plot is sometimes is kinda weird. Same as HowlsAmazing movie from Studio Ghibli. Miyadzaki genius in all its power. Wonderful, but rough tale of friendship, love, hatred, and full of ancient Japanese magic. I didn't put 10 mark because the plot is sometimes is kinda weird. Same as Howls Moving Castle.",
      "review_date": "2015-09-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nIf you have looked at my account you may have noticed that I have this fondness for anime films, I just want to so that I'm again not a huge anime fan, but I do enjoy some anime once in a while. It's a very impressive art form, and is demonstrated very well in this film. The art style in this feature is some of the best one will ever see, the forest is a beauty look at, the village is well structured design that fits very well; of course. The animation is a bit behind compared to what studio Ghibli makes today, but is barely a difference because any film made by them is always great to look at. Now about the main cast of characters, they're well done, but I can say that at certain scenes they don't really work well with the scene. Such parts like when they first meet, the ending to that is not that good: \"go away\" she says, it's like not much thought went into that part. Of course since this is by a children's movie company, there's going to be some themes. This one talks about nature mostly, and is fortunately not shoved into your face like some would. Along with great animation there's also a great feeling of scale, this is categorized as an epic after all. The size and scope of this film makes it seem much more; for lack of a better word, epic. Also there's some very fine good action, even bits that seem very graphic, and further adds to the atmosphere. In the end, probably one of the best animated films out there, and I also think this is also in the shadow of better films like spirited away. But should still be looked at.",
      "review_date": "2013-05-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Visually, Princess Mononoke shines right off the bat. The design and movement of the demonic boar god is among the most impressive bits of animation I've come across. In addition to the fluid and gorgeous animation, the action is done so wellVisually, Princess Mononoke shines right off the bat. The design and movement of the demonic boar god is among the most impressive bits of animation I've come across. In addition to the fluid and gorgeous animation, the action is done so well it will immediately pull you in. And we will witness several more sequences of this caliber before the end.\r Fortunately, it’s beauty and action are merely the outer shell of it’s brilliance. The most impressive aspect of Princess Mononoke is its ability to display each side of every conflict  and how well it all ties in with the movie’s core theme: Man Vs. Nature. We understand what both the people of Iron Town and the inhabitants of the great forest fight for and why. We sympathize and even root for both sides to win. Even Jigo  the main antagonist  is given clear motivation for his actions, not to mention a likable personality.\rWhen speaking of the characters in Princess Mononoke, it has to be mentioned how great the performances are in the English dub. Best are Minnie Driver as Lady Eboshi, Keith David as Okkoto and Billy Bob Thornton as Jigo.\r Our hero  is one of the reasons why this story works as well as it does. He is our viewing platform. We observe everything through his perspective and follow his ideals since he is our hero. He is neutral  so we become neutral. If he would have been fighting solely on one side, the film’s ultimate message; man & nature needs to function more cohabit-ably together, or all will perish  would have differed greatly.\r In the end I'll simply say that Princess Mononoke is one of the greatest animated movies ever made. I urge anyone and everyone to watch this movie and see for yourselves what a gem it is\r Full review: http://kenikkiscorner.blogspot.se/2013/06/anime-movie-review-princess-mononoke.html",
      "review_date": "2013-06-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Absolutely out this world! this epic movie is a league on its own, with depth and laudable cause. Masterpiece! A real movie will this one should be awesome, in fact we saw some of the concept in a recent version of Snow White...!",
      "review_date": "2013-08-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe best part of the film is how the characters are written, they act like real people. Complications occur only because of the consequences of other's actions, which, to an extent, are justified. Another good thing is the subtle environmental message, it isn't hammered in like most North American films. Rather this Japanese anime shows us that we are supposed to draw our own conclusions about the environment. The animation is fluid, very well done, and the character designs, not just for the humans, look great. Also the backgrounds are phenomenal and spectacular to look at. This film would not work if it wasn't animated, it really uses its medium to the full extent.",
      "review_date": "2013-08-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Criticism of man's impact on nature and how society is corrupted. It is amazing how we see animations dealing with such serious issues and even though the film is from 1999, it is so current.",
      "review_date": "2020-12-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Visually this film is an artistic masterpiece. The conflict of Nature vs. Innovation has often been used but it has never had the proper moral. If you are looking for a snapshot of Miyazaki you cannot pick a better film than this.",
      "review_date": "2014-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What makes \"Princess Mononoke\" so good, is the fact that it is entirely original. The story, the characters, the creatures, the world - director/writer Hayao Miyazaki has made all of it with such certainty and wit that I fail to describe. TheWhat makes \"Princess Mononoke\" so good, is the fact that it is entirely original. The story, the characters, the creatures, the world - director/writer Hayao Miyazaki has made all of it with such certainty and wit that I fail to describe. The spirit and the emotion of the film are as good as the visual style and music. Altogether, I'd say that \"Princess Mononoke\" is definitely a must-watch.",
      "review_date": "2014-06-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It is my favorite Studio Ghibli movie and I was lucky to be able to watch it in cinema. Actually it was also my first Ghibli movie and I just watched it with a friend because he recommend it. It was an amazing experience as it had a greatIt is my favorite Studio Ghibli movie and I was lucky to be able to watch it in cinema. Actually it was also my first Ghibli movie and I just watched it with a friend because he recommend it. It was an amazing experience as it had a great story with depth, characters that are well written, of cause the Studio Ghibli animations and an awesome soundtrack that I see as one of the best in animation. Lets start at the beginning: Hayao Miyazaki and Studio Ghibli were amazing. They produced animated movies that are considered masterpieces back then. The track record includes a lot of the best Japanese if not worldwide made ones. Today they have a few weaker movies in the line up but no catastrophes. The story is set in an unspecified year of the Muromachi period also know as Ashikga period in Japan which lasted from 1336 to 1573. The Emishi people who are original inhabitants of Japan (Like the Ainu) struggled with the Ashikaga government and are in hiding after they were driven off. A secluded and hidden village (No not Ninjas) of the Emishi is attacked by a demon. **** who is the last of heir of their rulers manages to kill him after a peaceful solution was not possible. With his last strength the demon wounded Ashikaga’s arm and cursed him. The curse will grow with time and kill him but also gives him more power at the price of fastening the process. The villages female shaman explains this to him and that the demon was originally a nature god and not a demon. He has to leave the village and could never return but may find a cure in the West were the demon came from. This is the set up of the story and the start of an epic adventure. It is an amazing story. There is so much depth and motives. Nature vs man, different world views and philosophies, heritage, conflicts and interests. You can watch it just for the story or analyze the motives, developments and actions of the characters. Then there is the atmosphere that won me over immediately. No other Ghibli movie worked this well and there is a lot of competition. The next strengths are the characters. All have believable motives, develop thorough the story and have great interactions. There is no simple good vs evil here. It has my favorite cast with ****, Lady Eboshi, San, Jigo, Moro and Hii. Also all the minor characters are good too. The depth and clear motives improve an already great movie. You always know why the characters act this way and what motivates them. The art style and animations were amazing back then as it is a staple of Ghibli movies. The soundtrack is a masterpieces and one of the best I have heard. Joe Hisaishi is a true master in his field and this has so many good tracks. The voice actors are a bit uneven depending on the chosen language. The original Japanese voice actor are amazing, the English ones are a bit weaker but definitely not garbage and the German are really good ( I am a native German speaker). Overall this is a masterpieces and one of my favorite movies. I fully recommend it and see it as timeless classic.",
      "review_date": "2021-11-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I hadn't seen this film since I was a kid and now having watched it again, I enjoyed a lot more as an adult.I love how it wastes no time and after 30 minutes, the movie has already established so much about this world and it's characters.I hadn't seen this film since I was a kid and now having watched it again, I enjoyed a lot more as an adult.I love how it wastes no time and after 30 minutes, the movie has already established so much about this world and it's characters.Needless to say the animation is stunning as well is the music, it really captures the tone of the film. This has always been the only Studio Ghibli film I'd seen but I'll be sure to watch a few more after this one.",
      "review_date": "2021-12-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Princess Mononoke is beautiful movie with an environmental story that is both subtle and engaging. the acting is great backing up well written characters and the animation is amazing highlighting the merits of hand drawn animation. i love thePrincess Mononoke is beautiful movie with an environmental story that is both subtle and engaging. the acting is great backing up well written characters and the animation is amazing highlighting the merits of hand drawn animation. i love the design  choices and it makes the world feel alive which i'm certain was the film makers intention. i highly recommend this film it was just brilliant though i will say it's not for very young children (and you won't believe how many times i've herd that parents have bought it for their kids on the ground that it's animated)",
      "review_date": "2015-01-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Princess Mononoke is a wildly inventive fable that explores the tensions between the human and natural worlds.  Our main character **** remains resolutely in the middle of the two female leads, the Lady Eboshi and Princess Mononoke, whichPrincess Mononoke is a wildly inventive fable that explores the tensions between the human and natural worlds.  Our main character **** remains resolutely in the middle of the two female leads, the Lady Eboshi and Princess Mononoke, which forces the viewer to assess both sides of the conflict for their merits and problems.  Other reviews have said that its message is easy or straightfowrad, but I think it's incredibly complex--both the forest and the ironworks seem to be granted an essential right to exist, and it feels like the impossible goal is to find a way for them to exist together peacefully.  These problems aren't presented moralistically, however, as our main character stumbles into this complex situation as part of an already-engaging plot, and the various story elements are gracefully brought together into one essential conflict.\r The characters and their problems are well-rounded, as Miyazaki makes excellent use of the movie's long runtime to develop the protagonists.  Everything is, of course, gorgeously animated.  The animal gods in particular are beautiful and inventively portrayed; the way the animals' speech is animated is especially engaging.  The many action and battle scenes as well are skilfully done, so that the action is both fast-paced and followable.\r Overall, I was incredibly impressed by this movie and I'm sure I'll watch it again to try to tease out more of the problems.  This movie gives a lot of thought to the essential and complex problems of humans and human society, and it urges viewers to consider these problems as well.  A smart, beautiful, and thought-provoking film.",
      "review_date": "2015-03-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a classical animated film that goes into history. Perfect. Studio Ghibli gave a try to the old Japanese stories, the old warriors and tribes, and the old mythology, and it did it just perfectly. The animation is excellent, the actionThis is a classical animated film that goes into history. Perfect. Studio Ghibli gave a try to the old Japanese stories, the old warriors and tribes, and the old mythology, and it did it just perfectly. The animation is excellent, the action scenes are very well made, and the story, although cliched about some things, is incredibly original and impressive, given how many things they were able to put inside a single movie, and do everything about them so right. Nothing drags or is boring here. For the animation lovers, or even good movies lovers, watch it.",
      "review_date": "2015-06-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nHayao Miyazaki is my hero and Princess Mononoke is basically his masterpiece. I've watched it at least twice before but I think this is the first time that its messages and overall beauty really sank in. It's so beautiful and complex that you will have a hard time finding a movie to rival it.\r This world is centered on nature – on gods, on spirits and demons, and most importantly on the forest. When **** the protagonist, is infected with a curse of hate he must leave his village and seek the cure, but instead he finds himself in the middle of a war that is much bigger than himself. \"See what you can see with eyes unclouded by hate.\" And that's exactly what he tries to do.\rPrincess Mononoke has an intricate storyline with multi-dimensional characters. Take Lady Eboshi. She has saved these women from working in brothels and houses the lepers and gave them a better place to live and to work, but she also has some intentions that are in line with greed and involve much death. We have to take the good with the bad in each character to see who they truly are. \"The world is cursed, but still you find reasons to keep living.\"\r As an outsider of IronTown and its problems, **** is able to come and serve as somewhat of a peacemaker, trying to save the forest but protecting everyone fighting as well. He has seen hatred and it consumes him and doesn't want it anywhere it doesn't have to be. **** also finds a friend (and love interest?) in San – our very own Princess Mononoke. He would not have survived in this environment without her. She saved his life and in a way he saves hers as well.\r The centerpiece of this war and fighting is the Forest Spirit. He protects the forest and \"The forest spirit gives life and takes life away. Life and death are his alone.\" He saves ****'s life from the bullet wound so **** must carry on living. Lady Eboshi finally succeeds in taking the Forest Spirit's head, but doing so simultaneously kills many things and destroys the forest. He was its protector but he can't live without a head. San and **** have to return the head so all of the Spirit's madness will stop, but he doesn't return back to life. He slips away into the lake. \"The great Forest Spirit is dead now.\" \"Never. He's life itself.\"\r The forest regrows right before their eyes and everyone must start anew – perhaps a life without hate. San and **** have had their curses lifted, but **** still can't return home. Not after what he's seen. They love each other and that's what the Forest Spirit is all about. This experience can only enlighten everyone it involved and hope for a life without as much greed and hatred.\r Princess Mononoke not only has a deeply fulfilling and amazing storyline, the animation and detail in every scene and every frame is breathtaking. It's all hand-drawn and I can't recall a movie that is more beautiful in every sense of the world. Truly a masterpiece.",
      "review_date": "2015-06-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A really great film.  The animation is beautiful, the story is great, and and the soundtrack is good too.  I'm giving it an eight mainly because I watched the dubbed version, which is painfully average ( compared to most dub's, which areA really great film.  The animation is beautiful, the story is great, and and the soundtrack is good too.  I'm giving it an eight mainly because I watched the dubbed version, which is painfully average ( compared to most dub's, which are usually terrible), and the character's seemed a bit one-dimensional to me, especially **** (The dub doesn't help)",
      "review_date": "2015-09-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Princess Mononoke\" is undoubtedly another gem of the Japanese animation Studio Ghibli. The story itself is very good, the characters and the message it conveys is powerful.",
      "review_date": "2018-01-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Princess Mononoke is one of the best animated movies I have seen in a long time, and is up there with Studio Ghibli's best along with Spirited Away. I will say I am probably biased, as I am a huge Studio Ghibli fan, and love all of theirPrincess Mononoke is one of the best animated movies I have seen in a long time, and is up there with Studio Ghibli's best along with Spirited Away. I will say I am probably biased, as I am a huge Studio Ghibli fan, and love all of their films, I even like Cat Returns, which along with PomPoko is considered as one of the weaker Ghibli efforts. The animation in Princess Mononoke is absolutely stunning, with rich detailed backgrounds and brilliant character animation. The image of the Stag actually made my jaw drop. The music is fantastic as well, and although environmentalism is a subject matter very difficult to get right, what the filmmakers succeeded in doing was making a highly intriguing story that was not only original but succeeded in not being preachy at all. The film is also helped by the high calibre vocal talents of Minnie Driver, Claire Danes, Billy Bob Thornton et al (voicing quite remarkable characters) and a strong script. True, some of the images like the Demon Worm, may frighten younger viewers, but it is fair to say they were very powerful. All in all, Princess Mononoke is breathtaking and I recommend it highly. 10/10 Bethany Cox",
      "review_date": "2022-03-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I personally enjoyed it very much. But honestly it's difficult for me to find a movie that I don't enjoy. I'm basically the whore of animated movies. Sure the movie is longer than most want it to be but the movie was paced well around it.I personally enjoyed it very much. But honestly it's difficult for me to find a movie that I don't enjoy. I'm basically the whore of animated movies. Sure the movie is longer than most want it to be but the movie was paced well around it. Sure the movie could have been quicker or slower but if they did that then so many loose ends would be left. And as for those who can't understand why he doesn't return to his village. It's one of their rules once you leave you are no longer allowed to return and his \"love\" interest is his younger sister who wished him goodbye forever. Sure the arrowhead didn't have much significance to the story but why should it, in the end it was a gift for the wolf girl because he cares for her and much like his sister wanted her to be safe even if they never met again, or met as enemies.\r Yes the movie had no villain but that's the point life doesn't have a villain that's all based on perspective the movie shows you the good of both sides so that you can see and understand that there is no villain they are simply humans trying to live and survive in the changing world. I know that the wolf girl \"loves\" the main guy (I can't remember their name). Their relationship wasn't really romantic in the slightest sure he said some things here and there but she didn't really do much beside protect and look after him according to her debts and the spirits. I think they have a deep and true admiration for one another but I personally wouldn't call it love.\r Aside from some personal preferences here and there I loved it. I'd watch it again.",
      "review_date": "2015-07-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Definitely one of the most overrated Ghibli films, Princess Mononoke is a nice movie with an amazing soundtrack and multi-dimensional characters.  However the plot suffers from being too uneven, with so many things going on I felt that theDefinitely one of the most overrated Ghibli films, Princess Mononoke is a nice movie with an amazing soundtrack and multi-dimensional characters.  However the plot suffers from being too uneven, with so many things going on I felt that the film struggled to stay grounded.  It is the opposite to films like The Secret World of Arriety where there isn't much plot at all, Mononoke simply has too much plot in my opinion.",
      "review_date": "2015-08-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Stunning hand-drawn animation, vast creativity, an abundance of charcterization, Princess Mononoke possess it all. It has an extremely dark atmosphere that was absolutley neccessay towards the plot that involves a war with dark spirits andStunning hand-drawn animation, vast creativity, an abundance of charcterization, Princess Mononoke possess it all. It has an extremely dark atmosphere that was absolutley neccessay towards the plot that involves a war with dark spirits and raging animals that all create some sort of symbolism. This is Hayao Miyazaki's first PG-13 film and he delivered us a direction that can be opinionated as an R-rated film with it's darkness and bloodiness. This is one of my favorite anime masterpieces, right below the fantastic \"Spirited Away.\"\r Rating: 10/10\r A+ = 10\rA = 9\rA- = 8\rB+ = 7\rB = 6\rB- = 5\rC+ = 4\rC = 3\rC- = 2.5\rD+ = 2\rD = 1.5\rD- = 1\rF = 0",
      "review_date": "2016-07-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Personally for me, its just only the BEST animated movie on Earth. Hayao Miyazaki is a great director and this is his masterpiece. And **** and San\" is the greatest track i´ve ever heard. 100%",
      "review_date": "2016-08-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The most mature opus of Hayao Miyazaki. The ecological plot, the dialogues a-la Shakespeare and the accidental/impossible love story makes it a mandatory. Not for children.",
      "review_date": "2017-01-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The computer FX and the visuals of the story is just anything you could write if Ghibli hadn't done this. But I love both Princess Mononoke and Spirited Away at the same time. I love getting inspirations everywhere and films like this, it'sThe computer FX and the visuals of the story is just anything you could write if Ghibli hadn't done this. But I love both Princess Mononoke and Spirited Away at the same time. I love getting inspirations everywhere and films like this, it's where it'll get me to do my own style of animation. Anyone who will really be upcoming filmmakers, the Japanese dosen't mind using their style of animation, I love Hayao Miyazaki.",
      "review_date": "2016-10-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Transported to a mystical land of mountain gods and samurais, incredible artistry allows total and utter immersion into a familiar struggle of man vs. nature. Miyazaki yet again provides morally flawed characters so that no obvious individualTransported to a mystical land of mountain gods and samurais, incredible artistry allows total and utter immersion into a familiar struggle of man vs. nature. Miyazaki yet again provides morally flawed characters so that no obvious individual villain can be identified yet it is clear that peace is the ultimate goal. This film would be a ten if it not for an ending which feels unjustifiably rushed after such an astonishingly gorgeous build up. Without a doubt one of Ghibli's finest and a shining example of unique story telling that could have only come from this studio.",
      "review_date": "2017-02-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Princess Mononoke is one of the best Ghibli movies. It's an epic tale, set in a vast world with memorable moments and characters in it. Overall, an amazing film, even if you think you might not enjoy Japanese animation, you should still givePrincess Mononoke is one of the best Ghibli movies. It's an epic tale, set in a vast world with memorable moments and characters in it. Overall, an amazing film, even if you think you might not enjoy Japanese animation, you should still give Studio Ghibli movies like Princess Mononoke, Spirited Away or My Neighbor Totoro a try.",
      "review_date": "2018-02-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best Visuals. Best Score. Great Voice Acting. Great Story. The Cream. That Sugar. The Richness. That Top Note. That's a 10. Will probably watch this once a year until I die.",
      "review_date": "2017-08-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "AndrewR, shut up. Nothing is wrong with the world, you're the one that made the world horrible. Idiot.",
      "review_date": "2021-10-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My personal favorite Hayao Miyazaki film, I highly recommend it if you enjoy his other movies such as spirited away.",
      "review_date": "2018-03-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film has a variety of complex themes (which are intertwined in their own way), yet you never feel overwhelmed. It creates it own world in which the plot takes place. The plot is the human vs. nature type of story. However, it shows bothThis film has a variety of complex themes (which are intertwined in their own way), yet you never feel overwhelmed. It creates it own world in which the plot takes place. The plot is the human vs. nature type of story. However, it shows both sides of the story and is left to the bias of the viewer to decide which side they're on rather than forcing you to take nature's side which is something a lot of those movies do. It has great voice acting and the animation is stunning. It is very inventive and subtle and never fails to amaze. This film is highly recommended.",
      "review_date": "2018-04-01",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 129,
  "genres": [
    "Adventure",
    "Fantasy",
    "Animation"
  ]
}