{
  "title": "The Insider",
  "rating": 8.4,
  "release_date": "1999-11-05",
  "genre": [
    "Biography",
    "Drama",
    "Thriller"
  ],
  "summary": "This is the true story of Jeffrey Wigand (Crowe), the tobacco executive-turned-whistleblower and his relationship with \"60 Minutes\" producer Lowell Bergman (Pacino).",
  "critic_reviews": [
    "May be the best movie of the year.",
    "A marvelous ensemble cast and all the visceral impact and moment-to-moment tension of a fine thriller, together with the distinctive visual style of an art film.",
    "Excellent acting, a stirring screenplay, and crisply intelligent directing make this fact-based movie a great human drama as well as a riveting and revealing look at crucially important social issues.",
    "It's a terrific movie -- intelligent, magnificently acted, highly compelling as a thriller, and downright scary in its implications for the corporate-run world of the new millennium.",
    "A dead-on tale of corporate power, courage, cowardice and how we live.",
    "Is still sleek, gripping entertainment with a raw-nerved, changeable camera style that helps to amplify its meaning.",
    "The viewer almost has to be a journalist--or a good editor--to sniff out the meat under all the fat.",
    "Almost cagily creating understated drama from high-stakes reality.",
    "A well-orchestrated nightmare that keeps you on edge until the very end.",
    "For two hours and 35 minutes it is absolutely riveting.",
    "A big, overlong, and rather unwieldy piece of storytelling, but the story it has to tell is so vital that it cuts through all the dramaturgical muddiness. It's a terrific muckraking melodrama--it will get people fuming.",
    "Has the glorious look and immaculate technique we expect from Mann, along with a wealth of superb secondary performances.",
    "Reveals a chilling reality: how hard it is to tell a simple truth when big business doesn't want it told.",
    "Power to absorb, entertain and anger.",
    "At its best, hard-hitting grown-up cinema (rare these days) and a movie blessed with a villain (Big Tobacco) for which all gloves can be removed and heaved into the next county.",
    "This is a first-class muckraking melodrama: an admirable picture.",
    "A big, bold movie that gets at undeniable truths about the way no one, no matter how powerful, is immune from manipulation.",
    "Earnest, smart, handsome, well-acted and made with mastery.",
    "May be pumped-up, but it's rarely boring",
    "The final product is great populist entertainment and may even leave audiences with a feeling of comfort, however fleeting, in the knowledge that corrupt corporations don't always win",
    "It's great that this movie exists.",
    "Overall, a solid piece of film that not only entertains but also educates.",
    "A meticulously assembled dramatization of a grossly controversial moment in TV history.",
    "A good but far from great movie because it portrays truth telling in America as far more imperiled than it is.",
    "Pacino and Crowe are at their best, but the supporting cast also shines.",
    "Tells an important story about a story that might never have been told at all.",
    "Few American directors drive this wedge between mind and gut as masterfully as Michael Mann.",
    "A beautifully shot, well-acted movie that manages to make a complicated, real-life story without much drama feel like a thriller.",
    "An exciting dramatization of the strange events that marked the turning of the legal tide against Big Tobacco, and a particularly dark moment in the annals of CBS News.",
    "The insider's view of celebrity in The Insider grabs the spotlight from the real story of Wigand's courage.",
    "A borderline pretentious, overly inflated picture.",
    "A big, dark juggernaut of a movie about a big, dark juggernaut of a subject.",
    "It's all a little too polished, a little too smug to be ranked up there as one of the great journalism films."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Genius.",
      "review_date": "2006-08-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "My all time favorite film. Mann truly has crafted a masterpiece so brisk bold and utterly electrifying. Pacino and Crowe both give great oscar winning potrayles especially Pacino. The film serves you the truth raw and tantalizing. The plot My all time favorite film. Mann truly has crafted a masterpiece so brisk bold and utterly electrifying. Pacino and Crowe both give great oscar winning potrayles especially Pacino. The film serves you the truth raw and tantalizing. The plot is one of the most intelligent of our generation giving all the characters a slick and open world to work in. I would highly reccommend this to everyone especially fans of Manns work.",
      "review_date": "2009-06-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "You don't need to be an Einstein to know that Russel Crowe is a brilliant actor. If want to see an acing genius then do watch this movie. Overall a well made movie which keeps you at the edge of your seats and brilliant cast. A must watch forYou don't need to be an Einstein to know that Russel Crowe is a brilliant actor. If want to see an acing genius then do watch this movie. Overall a well made movie which keeps you at the edge of your seats and brilliant cast. A must watch for those who appreciate good acting.",
      "review_date": "2012-05-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Man is this ever a thrilling film. Fueled by great performances from Al Pacino and Russell Crowe, The Insider is an undeniably thrilling experience that is bolstered by the fact that it is based on a true story. The story is really well toldMan is this ever a thrilling film. Fueled by great performances from Al Pacino and Russell Crowe, The Insider is an undeniably thrilling experience that is bolstered by the fact that it is based on a true story. The story is really well told thanks to a good script and good direction as always from Michael Mann. The cinematography is also good here, which is a nice plus, as well as the very convincing makeup on Crowe. However, aside from Crowe's acting, the real star here is undeniably Mann and his ability to create satisfying thrills. Throughout, you are on the edge of your seat awaiting what will happen next and that really makes for an exciting and enjoyable experience. The length is always fine and while it slows down at times, it never really drags like films that hit the 2:30 mark sometimes do. As a whole, The Insider is an exciting film with great direction and acting that really meets expectations.",
      "review_date": "2014-07-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Don't let the seemingly ho-hum narrative fool you - \"The Insider\" is a hair-raising testament to the amount of tension Michael Mann can conjure out of thin air and place on a haunting cinematographic landscape.",
      "review_date": "2015-02-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "the insider is on my top 10 best movies i have ever seen  it totally took me by surprise when i saw the average rating on IMDB and Meta-score and the 7 Oscars nominations and didn't win anything  but i took the chance to watch in since it hasthe insider is on my top 10 best movies i have ever seen  it totally took me by surprise when i saw the average rating on IMDB and Meta-score and the 7 Oscars nominations and didn't win anything  but i took the chance to watch in since it has Russell Crowe and the fact that is based on true story  and i'm glad i took that chance  the movie was awesome  the script was well-written  the even was believable and i loved the performance by everyone in this movie from Al Pacino down to Colm Feore and Russell Crowe did a spectacular performance being what he is a nervous person with big ego as he going from being rich to absolutely nothing  i just love it.",
      "review_date": "2013-04-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The insider is the most inteligent thriller i´ve ever seen.\rMann and Roth´s Screenplay is unbelievable.\rCrowe´s performance is probably the most adequate for interprate Jeffrey Wigand\rPacino gave another magnificent performance.",
      "review_date": "2015-06-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Sorry for the translation.\r Long live newspapers, journalists hooray, hooray the free press. Why? Because a\r\n\r\nfree press is the mirror of the nation, citizens are reflected in it. The\r\n\r\njournalists free from the constraints of so-calledSorry for the translation.\r Long live newspapers, journalists hooray, hooray the free press. Why? Because a\r free press is the mirror of the nation, citizens are reflected in it. The\r journalists free from the constraints of so-called big powers, are educators.\r A piece of news, politics, can be told in a thousand ways. The\r question is - I am a journalist when I write, I hide behind my writing, or are\r in front of it and so proud of? My words are fertile for my readers? Help young people to think? Help solve a problem? In short, they help to grow? People always deserve the best respect. This is democracy and that is why our fathers died. For this\r ideal still die. I will take up this discussion further, talking about my\r Italy. And now within the film.\r When the truth \"produces\" welfare, that is the feel good in physical terms,\r of a community, even frighteningly shaky financial empires. The bearer of\r Truth, however, always has a price, sometimes very high, in terms\r economic and psychophysical. But if you are lucky enough to share your truth with a\r decent man, of sound principles, that truth produces pain is shared, this\r sharing improves decision-making skills and translating them into voluntary acts\r determined. This is what happens to the two main protagonists of the film. The first\r is a scientist, dr. Jeffrey Wigand (R. Crowe), put out the door by Brown &\r Williamson company that produces cigarettes. The second is Lowell Bergman (A.\r Pacino), one of the leaders of the popular journalism program \"60\r Minutes \"on CBS. Lowell and Wigand will create, with their conscious choices, to\r one of the most famous investigations and follow U.S. and beyond. This investigation\r will lead the multinational \"blondes\" to pay a very heavy compensation for\r damage (diseases and deaths) caused by tobacco. Wigand reveals on live television that the\r His company adds chemicals that create dependency. Consequences of this\r are, of course, more sales and higher revenues. But what will the price\r pay for the two protagonists? What will become of peace, economic security,\r\n\r\nmarriage? What role will the wives? There is freedom of information\r\n\r\ngeneral? The strong powers, political, economic, influencing what information? A\r\n\r\nmany millions of dollars compensation amounts required by 50 states, the\r\n\r\ntobacco companies? Michael Mann, director and screenwriter Eric Roth\r\n\r\n(Forrest Gump) gives us a gem. For an Italian, Dante Spinotti, was entrusted with the\r\n\r\nphoto of the film. One last thing: \"Seven nominations and no statue. Why?  These are movies that you mark, leave an indelible mark on your soul. In\r\n\r\nschools, these films must enter the front door. You should discuss\r\n\r\ncompare, clarify any doubts. The words hurt and sometimes fatal. The\r\n\r\nlanguage, a body so small, it produces infinite damage. Words fly, writings\r\n\r\nremain. \"Verba volant, scripta manent.\" Careful what you write.\r\n\r\nGood Ciak!",
      "review_date": "2010-09-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is incredible. Pacino, Crowe, and Plummer all deliver incredible performances, each with their own array of pulse pounding verbal exchanges. I love movies of this genre, and The Insider delivers harder than any comparable movieThis movie is incredible. Pacino, Crowe, and Plummer all deliver incredible performances, each with their own array of pulse pounding verbal exchanges. I love movies of this genre, and The Insider delivers harder than any comparable movie I've seen in years, maybe ever. I'm so glad I decided to pick up an old flick and give it a watch. If you haven't seen it, it's definitely worth the cost of the rental.",
      "review_date": "2014-08-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Insider is a well written and acted true-story drama. Micheal Mann instills the picture with his trademark style but over-length and a lack of real danger mar the proceedings somewhat. Also, it seems like an exercise in futility: Yes,The Insider is a well written and acted true-story drama. Micheal Mann instills the picture with his trademark style but over-length and a lack of real danger mar the proceedings somewhat. Also, it seems like an exercise in futility: Yes, smoking is bad for your health and addictive... Do smokers care? No, so what's the ultimate point?",
      "review_date": "2012-11-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don't know. I kind of see why it has such great ratings - I mean it has great actors and the acting really is great, plus the story in itself is interesting too also. But I feel that the movie is streched out and gets boring at times. AtI don't know. I kind of see why it has such great ratings - I mean it has great actors and the acting really is great, plus the story in itself is interesting too also. But I feel that the movie is streched out and gets boring at times. At times nothing that important really happen. The movie should have been an hour less long and should have a faster pace in evolvement of what happens, then it might get much better. Here I can rate acting at 9 and the story at 7, but as a whole, the movie just does not speak to me and that is why it gets a lower mark",
      "review_date": "2016-11-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the most socially and politcally important films of the last decade. It is a \"twofer;\" a scathing expose of the tobacco industry and of the media industry. A must see for any thinking person.",
      "review_date": "2006-01-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great performances by Pacino, Crowe, and Venora. Great cinematography, sound, editing, and score. Poorly paced down the stretch.",
      "review_date": "2007-03-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Good show, but takes itself too seriously. It is not possible to dehumanize tobacco companies without disrespecting their customers. Philip Seymor Hoffman would have been better in the role played by Russell Crowe, who was made up to look Good show, but takes itself too seriously. It is not possible to dehumanize tobacco companies without disrespecting their customers. Philip Seymor Hoffman would have been better in the role played by Russell Crowe, who was made up to look like, yup, Philip Seymor Hoffman.",
      "review_date": "2007-08-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Excellent film by Michael Mann with great performances, writing and direction.",
      "review_date": "2020-01-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Insider is one hell of a movie. It is moving, stirring, and beautifully shot in the process. It features two incredible performances from Crowe and Pacino, and crisp direction by Michael Mann. It is a little bit overlong, but the story isThe Insider is one hell of a movie. It is moving, stirring, and beautifully shot in the process. It features two incredible performances from Crowe and Pacino, and crisp direction by Michael Mann. It is a little bit overlong, but the story is riveting nonetheless. The film genuinely shows how whistleblowers are treated in the US (i.e. Edward Snowden) and also subtly criticizes the way corporations run the media, and the country.",
      "review_date": "2016-06-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "your objection's been recorded..The Insider\n\nThe vulnerability and the intensity that is at stake in here is conveyed accurately which helps the audience connect with in its first few minutes. The adaptation is smart if not gripping andyour objection's been recorded..The InsiderThe vulnerability and the intensity that is at stake in here is conveyed accurately which helps the audience connect with in its first few minutes. The adaptation is smart if not gripping and well edited for the most part of the drama is drawn out from the conversation that resonates too much practicality which helps the feature keep it grounded. Michael Mann is no short on execution and is not only supported but celebrated with the help of amazing cinematography and brilliant background score. The feature scores on high pitches through performance and the strength of the star cast like Russell Crowe, Al Pacino, Philip Baker Hall and Christopher Plummer. The Insider is a typical informative feature that is not only accurate but is entertaining and electrifying too that keeps the audience engaged through its 157 minutes of runtime where one cannot not be moved by these pragmatic characters.",
      "review_date": "2018-05-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Excellent thrillerThis film tells the attempts of Jeffrey Wigand to report on investigative journalism program \"60 Minutes\" the dangerous practices of the tobacco company he worked for. Based on real facts, was directed by Michael Mann andExcellent thrillerThis film tells the attempts of Jeffrey Wigand to report on investigative journalism program \"60 Minutes\" the dangerous practices of the tobacco company he worked for. Based on real facts, was directed by Michael Mann and has Russell Crowe, Al Pacino and Christopher Plummer in the lead roles.Its a high quality film, with a good cast and interpretations. The performances of Al Pacino and Crowe are particularly worthy of congratulations, with both actors managing to give substance and soul to their characters. Crowe even stayed some time near the real Dr. Wigand in order to observe his ways, gestures and behavior, which only shows the quality of this actor and the professionalism of his work. The film has a great script, written by Eric Roth and Michael Mann. The story is engaging and \"grab\" the audience from beginning to end. The photograph of the film is also interesting, using light and shadow to thicken or lighten the suspense. Undoubtedly, one of most interesting films of the turn of millennium.",
      "review_date": "2018-02-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》》■》■》■》■》■》■》■》■》■》",
      "review_date": "2021-06-07",
      "source": "metacritic"
    }
  ],
  "num_reviews": 52
}