{
    "rating": 5.3,
    "release_date": "2021-09-17",
    "num_reviews": 87,
    "genres": [
        "English"
    ],
    "summary": "In the treacherous frontier city of Samurai Town, a ruthless bank robber (Nicolas Cage) is sprung from jail by a wealthy warlord, The Governor (Bill Moseley), whose adopted granddaughter Bernice (Sofia Boutella) has run away. Strapped into a leather suit that will self-destruct within five days if he doesn't find the missing girl, the bandit sets off on a journey to find the young woman -- and his own path to redemption.",
    "reviews": [
        {
            "content": "Rating: 5/10. 52/100",
            "review_date": "2023-04-20",
            "source": "rt"
        },
        {
            "content": "very good movie    exciting",
            "review_date": "2023-04-10",
            "source": "rt"
        },
        {
            "content": "Overall, this is a wild, odd and confusing film. Visually, the film is stunning to look at, and it's highly evident that the filmmakers have gone out strong with their set designs, costumes and quantity of extras. Nicolas Cage is once again Nicolas Cage, but the plot is such a mess that by the end, I was still asking myself what on earth was going on with this film and what is it all about? It's a film that ultimately feels incomplete, with lots of gaps relating to its story. As for the film's genre, is it a western? A ghost story? A samurai film? No, people, it's a Nic Cage film!",
            "review_date": "2023-01-04",
            "source": "rt"
        },
        {
            "content": "Most ridiculous movie I have ever seen. Terrible acting and even worse writing and directing. Is Nicholas Cage getting desperate for money?",
            "review_date": "2022-12-30",
            "source": "rt"
        },
        {
            "content": "Deeply weird but never the least bit interesting.",
            "review_date": "2022-12-05",
            "source": "rt"
        },
        {
            "content": "It's like Shudder is trying to replicate the batshit craziness of Japanese horror in the visuals.  It boarders on \"Robo Geisha\" strange.  There are some unlikable characters and the pacing can go to a dead stop in the middle.  But I like batshit crazy when it's done well and looks cool.  This does it well.  Plus, I doubt this would be as cool without Nicolas Cage.  It's fucked up fun, worth checking out.",
            "review_date": "2022-10-11",
            "source": "rt"
        },
        {
            "content": "I terribad mix-up of Chihiro and the witches and some 80s c-rated action flick by someone on drugs...This isn't even good for casual viewing...I love Cage, cause I remember him from all the roles where they didn't (unsuccesfully imo) cast him as an action hero, but rather as the really great normal actor that he is...This movie is clearly just a paycheck for him...",
            "review_date": "2022-09-25",
            "source": "rt"
        },
        {
            "content": "MOvie poo poo doo doo ahh cut be like",
            "review_date": "2022-08-19",
            "source": "rt"
        },
        {
            "content": "Talk about a gonzo flick! This is the kind of madness that Sion Sono does soo well. It's a huge mishmash of post-apocalyptic craziness. If you want to see Nic Cage get his nuts blown off (thanks to an Escape From New York style gimmick) and scream maniacally at wasteland mutants, this may be for you. I don't understand this having such low ratings... Is this just due to the expectations and taste differences between Eastern and Western audiences?",
            "review_date": "2022-07-19",
            "source": "rt"
        },
        {
            "content": "We've seen Cage do similar roles where he has to fight his way through situations and there's usually blood and gore, and while this movie does have a unique landscape and a different kind of setup, it still doesn't make it an enjoyable film",
            "review_date": "2022-06-09",
            "source": "rt"
        },
        {
            "content": "extremly bad, not even Cage can hold this movie up",
            "review_date": "2022-05-01",
            "source": "rt"
        },
        {
            "content": "Nicholas Cage is too good and actor to be in a movie this bad",
            "review_date": "2022-04-29",
            "source": "rt"
        },
        {
            "content": "Just, Why??\nI don't usually bother with reviews but people must be warned about this. Time would be better spent anywhere else.",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "Another weird Nic Cage movie. But this one's pretty good.",
            "review_date": "2022-04-07",
            "source": "rt"
        },
        {
            "content": "Abstrakcyjnie inny, zaskakujący. Świat przepełniony dziwacznymi zwyczajami, które potrafią u widza w przyjemny sposób pobudzić znajome, specyficzne odczucia",
            "review_date": "2022-04-02",
            "source": "rt"
        },
        {
            "content": "It's extremely messy and all over the place. A lot of really cool things in the movie: really liked the theme of letting go of one's past mistakes, the imagery, and the way the movie is so very Japanese and so very American at the same time. Still, it's a movie that is a bit more fun to talk about and think about than to actually watch.\nP.S. After writing the review I learned that the movie was originally supposed to be shot in Mexico as a spaghetti Western with an English-speaking cast, but they changed it to a movie with samurais and Japanese actors because of Sion Sono's health problems. That explains so much of why it doesn't really work and always seems a little off.",
            "review_date": "2022-02-12",
            "source": "rt"
        },
        {
            "content": "Among the stupidest movies I’ve ever seen. Bad acting, incomprehensible story, extremely pointless and just altogether unnecessary. The trailer made it look MUCH more interesting than it actually was",
            "review_date": "2022-01-30",
            "source": "rt"
        },
        {
            "content": "Boring to the core. Nice soundtrack though...",
            "review_date": "2022-01-29",
            "source": "rt"
        },
        {
            "content": "I made it past him getting the suite on and that was too painfull to continue. Obvious things don't make sense, cuffed hands, nuts sqeezed by a cotton garment, filthy hands and body, but his beard, it's perfect.\n\nShameful effort for a movie.",
            "review_date": "2022-01-28",
            "source": "rt"
        },
        {
            "content": "Sorry Nick, not this time. \"Mandy\" was awesome, but trying to outdo that is just plain stupid. This is just plain stupid. The soundtrack is woeful as well ( Mateo C and you umpteen fake accounts ).",
            "review_date": "2022-01-28",
            "source": "rt"
        },
        {
            "content": "Visually it looks excellent from beginning to end; colorful, sharp, precise.  Something else it has going for it is a bit of unique charm.  Not an entirely deep or original story but entertaining for the reasons stated above, among others.",
            "review_date": "2022-01-23",
            "source": "rt"
        },
        {
            "content": "One of the worst movies ever.\nThe director is trying to mimic style of movies such as Mad Max but fails miserably in every aspect.\nIt was unbearable to watch.",
            "review_date": "2022-01-19",
            "source": "rt"
        },
        {
            "content": "Overacting Cage cannot save it",
            "review_date": "2022-01-03",
            "source": "rt"
        },
        {
            "content": "I had to stop. I couldn't keep watching. Felt like they tried to recreate the magic of Mandy but missed the mark horribly.",
            "review_date": "2021-12-24",
            "source": "rt"
        },
        {
            "content": "Solid Crap bad movie. acting was bad. worst movie ever. no clue what I just watched",
            "review_date": "2021-12-11",
            "source": "rt"
        },
        {
            "content": "what a weird movie. totally up Nic Cage's alley. he's still as awful as ever & this movie wasn't doing him or anyone else any favors. do not recommend.",
            "review_date": "2021-12-05",
            "source": "rt"
        },
        {
            "content": "Showed up for Nic Cage but ended up turning off this unwatchable mess of a film. The cinematography while lavish conveys little of actual substance, and the dialog is insufferable.",
            "review_date": "2021-11-29",
            "source": "rt"
        },
        {
            "content": "Movie Rating:   2/10",
            "review_date": "2021-11-28",
            "source": "rt"
        },
        {
            "content": "This movie is a low budget apocalyptic fantasy by someone who had to film in Japan, incidentally. It looks like the director only saw stills from previous movies like Fido, Six String Samurai, Cherry, A Man and His Dog, and Mad Max Fury Road. It's utterly amateur and pointlessly artsy without any coherent detail, while also featuring miserable dialog. The writing is high school shlock. Nicholas Cage doesn't help much with his whore-like makeup.",
            "review_date": "2021-11-26",
            "source": "rt"
        },
        {
            "content": "Awful, how did Sono go from Cold Fish to this mess",
            "review_date": "2021-11-26",
            "source": "rt"
        },
        {
            "content": "Thought the movie would be good because Nicolas Cage is in it...WRONGO!   Stay far away from this awful waste of time.",
            "review_date": "2021-11-24",
            "source": "rt"
        },
        {
            "content": "So go with me on this.\n\nAfter a prison bus crashed into a truck filled with nuclear waste, a big chunk of Japan was written off and is a lawless wasteland, with one town – Samurai Town — being ruled by The Governor (Bill Moseley) who has a harem of so-called granddaughters as his slaves. All around his small town is what they call the Ghostland, a place where the radiated scum of the Earth live and die and kill. When Bernice (Sofia Boutella, Gazelle from Kingsmen: The Secret Service and Jaylah from Star Trek Beyond), one of the granddaughters, goes missing The Governor makes it Hero's (Nicholas Cage, again the California Kinski of weird roles in stranger movies) job to rescue her.\n\n\n\nThrough movie fate, Hero's old partner was Psycho (Nick Cassavetes), a man who will fill anyone in his way and was the cause of the accident which destroyed most of Japan. And then one of his balls explodes.\n\nYes, Prisoners of the Ghostland isn't your normal movie. It's directed by Sion Sono, who also made Suicide Club, Tokyo Tribe, Why Don't You Play In Hell?, Tag and so many more wild movies over the past few years.\n\nSono has called Wild at Heart his favorite Nicolas Cage movie and one of his inspirations while saying that Cage was \"The easiest person I ever worked with, brought me back from the dead.\"  That's because the film was delayed a year after the director had a heart attack.\n\nAs for Cage, he's referred to this as the wildest movie he's ever made. My jury is out on that one, but this movie looks, feels and acts as odd as its star and trust me, I wouldn't have it any other way. A gang of mutants against angry women and Cage with a sword, one arm and one testicle? I know what side I'm on.",
            "review_date": "2021-11-21",
            "source": "rt"
        },
        {
            "content": "I Could barely sit Through it, Boring Mind numbing and soon,I just wanted it to end\nI Was dying to know what idiot paid to have This Crap Made Uuuugh",
            "review_date": "2021-11-19",
            "source": "rt"
        },
        {
            "content": "An experimental film that makes no sense.",
            "review_date": "2021-11-18",
            "source": "rt"
        },
        {
            "content": "Prisoners of the Ghostland ...a film by Sion Sono starring Nicolas Cage...equal parts post apocalypse, zombies, samurai, westerns, kink, the plotline form escape from new york, boredom, and at least one musical number...this is what happens when a director spins a wheel of madness and has no concept of what a bad idea would be.   Is there a good story? no.  Is it entertaining? sometimes.  When it lands its a visual masterpiece (a sword fight to time in the bottle) but most of the time it feels like someone showing you 5 minutes of a random anime.   So you get lots of beautiful cherry blossoms, moving hu-mannequins, and Nicholas Cage running around holding a testicle.  it is not for most viewers but if you start you may have a tough time looking away.  For me it's more weird than good...2 stars out of 5 (yet I am glad I watched)",
            "review_date": "2021-11-13",
            "source": "rt"
        },
        {
            "content": "Normally I really enjoy Nick Cage films and odd stories.   This one simply lacked everything.   It was a boring train wreck and for the first time watching a Cage on-screen scream rant I said to myself \"Totally ridiculas, just shut the hell up!\"    Would not recommend unless you're in the mood to waste time and add disappointment to your evening.",
            "review_date": "2021-11-11",
            "source": "rt"
        },
        {
            "content": "I cannot remember the last time I gave up on a movie, but this movie succeeded in making me press the 'Off' button. No coherent story, Nic Cage weirder than ever. Such a noisy, boring jumble of nonsense.",
            "review_date": "2021-11-11",
            "source": "rt"
        },
        {
            "content": "Gun Shy meets Mad Max meets Zardoz in a shockingly dreadful mashup with all the direction skills of Fellini having a seriously bad day. I lost the will to live after thirty minutes.",
            "review_date": "2021-11-08",
            "source": "rt"
        },
        {
            "content": "Honestly, wtf. One of the greats in one of the worst films ever made.",
            "review_date": "2021-11-07",
            "source": "rt"
        },
        {
            "content": "waste of time, to weird and senseless",
            "review_date": "2021-11-05",
            "source": "rt"
        },
        {
            "content": "Some interesting imagery, and Cage is always a good time. But it was a bit of a slog in the theater.",
            "review_date": "2021-11-05",
            "source": "rt"
        },
        {
            "content": "achieves the distinction of being one of only 2 movies ive ever wanted to walk out of-- embarrassment being the only thing keeping me stuck in my chair.   sitting in a dentist's chair waiting for an impending root canal would be more pleasant. keep in mind the producer saw this in its entirety and said \"good. thats a wrap folks. well done.\" this to me just leaves my jaw agape.  i wont even talk about the horrendus display by the \"actors\" in this visual and auditory disaster.  im guessing it was a favor for mr cages new wife to include her friends in the movie.  but hey, the movie cast was diverse. and shows us that asians do exist in the world, which i had no idea was the case before. so lets give them a half a star for that.",
            "review_date": "2021-11-04",
            "source": "rt"
        },
        {
            "content": "Cowboys. Samurai. Mad Max. Nic Cage. \nTotally gonzo bonkers in the best of ways. Fans of directors like Satoshi Kon or Takeshi Miike will be right at home here.",
            "review_date": "2021-11-02",
            "source": "rt"
        },
        {
            "content": "Nic don't need no gym. He lifts scripts.",
            "review_date": "2021-10-26",
            "source": "rt"
        },
        {
            "content": "There are cheesy bad movies and then there is this.  There should be a law banning such shite from being made and distributed.  i should be punished for watching this crap.",
            "review_date": "2021-10-25",
            "source": "rt"
        },
        {
            "content": "does nicholas cage need money? And never ending stream of bad movies.\nThis one is hard to understand. No emotional involvement into the story.\nNicholas read the script first for get about the money they offer . Your image is on the block.",
            "review_date": "2021-10-21",
            "source": "rt"
        },
        {
            "content": "very bad. I did not like it at all",
            "review_date": "2021-10-19",
            "source": "rt"
        },
        {
            "content": "Batshit crazy and deranged. Think about (in absolute casual order) Tarantino remaking Robert Rodriguez remaking George Miller then remaking samurai z-movies. Add Nicolas Cage with a perennial grin on his face and a testicle in his hand and you're still far from surprises.",
            "review_date": "2021-10-16",
            "source": "rt"
        },
        {
            "content": "Visually, Prisoners is pretty cool. But it's bizarro hodge-podge otherwise. Cage is out to find the governor's daughter in a suit with mini bombs over his arms, neck and testicles.",
            "review_date": "2021-10-14",
            "source": "rt"
        },
        {
            "content": "I can't believe Nicholas Cage was in this tripe. This movie is more like some psycho's fevered drug induced dream. Makes no sense at all. Even the good actors do a horrible job. I don't understand why anyone would waste time making crap like this, or how they even got the funding. C'mon Nick, do you really need the money that bad? I'd rather send you money than to see you stoop so low. I also can't believe Rotten Tomatoes gave this over 60%! Someone there must be on drugs.",
            "review_date": "2021-10-13",
            "source": "rt"
        },
        {
            "content": "What did I just witness with my own two eyes? This isn't a normal typical movie. It feels like everybody in this movie was high or drunk or possibly even both. I didn't like it at all. It was funny at least but in the dumb funny kind of way. I know what this movie was attempting to be like a crazy rescue superhero movie but it failed horribly unfortunately. Nic cage is funny as always and he has the best line of the movie which I will not spoil but it has something to do with blowing up something. If you've seen the movie you'll understand what I mean. In the end I like the crazy ideas they have but it could've been done differently if they had better writers and director. It's absurd but kinda funny but the bad funny. I'll most likely forget about this movie in about 20 minutes.",
            "review_date": "2021-10-12",
            "source": "rt"
        },
        {
            "content": "If you wanted Nicolas Cage in a samurai post apocalyptic setting with a B-movie budget, look no further and prepared to be disappointed... because its Nicolas cage in a samurai post apocalyptic setting with a B-movie budget. The only surprise this movie offers (spoiler) someones nut get blown off, haven't seen that done too many times, not that I needed it.",
            "review_date": "2021-10-12",
            "source": "rt"
        },
        {
            "content": "Crazy cage in a bonkers film. If you enjoy that kind of thing, this will work for an hour and a half.",
            "review_date": "2021-10-11",
            "source": "rt"
        },
        {
            "content": "By far one on the stupidiest movies of all time, made even worse by Nicolas Cage´s presence",
            "review_date": "2021-10-10",
            "source": "rt"
        },
        {
            "content": "What did I just witness with my own two eyes? This isn't a normal typical movie. It feels like everybody in this movie was high or drunk or possibly even both. I didn't like it at all. It was funny at least but in the dumb funny kind of way. I know what this movie was attempting to be like a crazy rescue superhero movie but it failed horribly unfortunately. Nic cage is funny as always and he has the best line of the movie which I will not spoil but it has something to do with blowing up something. If you've seen the movie you'll understand what I mean. In the end I like the crazy ideas they have but it could've been done differently if they had better writers and director. It's absurd but kinda funny but the bad funny. I'll most likely forget about this movie in about 20 minutes.",
            "review_date": "2021-10-08",
            "source": "rt"
        },
        {
            "content": "Even though I was a little disappointed, I still couldn't fully dislike the movie.  It's not always able to live up to the lunacy it promises, and the acting from some the minor characters is questionable, but the world is so bizarre and fascinating, and the Cage's and Mosley's enthusiasm is undeniably compelling.  It's a movie with future cult potential that won't please everyone, but I liked the positives too much to let the shortcomings ruin my enjoyment.",
            "review_date": "2021-10-03",
            "source": "rt"
        },
        {
            "content": "5 Star if you understand the symbolism. Incredible acting.\n\nSadly won't fit the taste of most people -- they just want super powers and explosions.",
            "review_date": "2021-10-03",
            "source": "rt"
        },
        {
            "content": "I would have liked to have seen this movie and several others on this list, but Jeff Bezos doesn't have enough money and my Prime membership just isn't enough for him to show any decent movies for free.  Sorry to have affect the overall rating of this movie, but I had to get that off my chest.",
            "review_date": "2021-10-01",
            "source": "rt"
        },
        {
            "content": "\"strange\" is the only word that qualifies this movie. director did a very vague work, but rich in details",
            "review_date": "2021-10-01",
            "source": "rt"
        },
        {
            "content": "One of the absolute worst movies I've ever \"tried\" to watch. I stress \"tried\" (in quotes) because I couldn't finish it even though I made it 2/3rds of the way through. Its Ishtar level of bad. No, scratch that. It makes Ishtar feel like a 5 star Epic.",
            "review_date": "2021-09-30",
            "source": "rt"
        },
        {
            "content": "There was a ton going on but at the same time not enough happening if that makes sense 2.1",
            "review_date": "2021-09-30",
            "source": "rt"
        },
        {
            "content": "Nicholas Cage is EXCELLENT, as usual. But he can't save this film.  People are trying to stop a disaster by pulling on the hands of a town clock with a rope.  (Can you say \"morons\"?)\nThere is a bank that has tons of money, so it gets robbed, even though this is an apocalyptic world where money is of no value to anyone. \nThe Japanese girls are all cute. But how they wound up in the American West is a real riddle. (Maybe they could base a movie on it, huh?(\nI think the big problem is the director had no clear vision of what he wanted, so he wandered from scene to scene (Like someone in a place called \"Ghostland\" maybe?)\nThe photography is excellent. The costumes are excellent. The town is excellent. The premise for the film is excellent. There just isn't enough logical narrative to hold it all together. It kind of looked like a Steampunk Convention where everybody was drunk. \nBut Nicholas Cage still did a fine job. He's a great actor, but there just isn't much here for him to work with.  (He was excellent in the movie \"Pig\" as well, but just like this one, there wasn't much narrative material for him to support his efforts.)",
            "review_date": "2021-09-25",
            "source": "rt"
        },
        {
            "content": "where do i start ummmm wtf did i just watch lol im hoping this guy was aiming for crazy over the top camp but he fails and make a very messy  trainwreck samurai, cowboy, post apocalypse with some anime influence  put in a blender and comes out like what the heck was that head scratching thing is it . bad acting yep is here im sure he was aiming for crazy camp fun but was way off but hey it was very interesting to see this mess of a acid trip he was on",
            "review_date": "2021-09-25",
            "source": "rt"
        },
        {
            "content": "All questions.  I'll give this my best shot: this is about a hardened criminal (Nicolas Cage) in Japan.  He has been captured and presented with a deal for his freedom from the Governor (Bill Moseley): put on a bodysuit with explosive devices a la The Suicide Squad and bring back the Governor's granddaughter (Sofia Boutella).  This will be a challenge because she has gone to the Ghostland, which is a place that nobody can leave once they enter.  So this is one that made me excited.  The trailers looked to be over-the-top, and they even put on a quote from Cage on the poster: \"The wildest movie I've ever made.\"  Armed with excitement, I bought my ticket with friends.  Boy was I disappointed.  I want to say that I made an earnest effort with this, and I was on board for the setup.  Bill Moseley is doing his best Colonel Sanders impression, and he lays down all the rules, firmly establishing the running clock involved and the dire consequences if not met.  Even though I couldn't tell what to make of where this movie was headed, I was here for the premise and the tone.  Then the story proceeds to aimlessly drift for the next hour.  I thought we were about to get into a time-sensitive action thriller that would keep the tension taut, and I don't understand why they emphasize the countdown if they never planned to follow through with it.  Once we get to the Ghostland, it just stops making sense.  It is weird for the sake of being weird, and you can only show me so much random imagery before I start to grow numb to it.  I don't know if this is a positive or a negative, but they don't explain how any of this works.  Sure, they'll take a break in the middle to give you a literal slide show on what happened in the past, but they never establish any rules to this world, so there are no stakes.  No stakes mean no reason to care, and I don't blame the entire row in front of me in the theater for bailing at the hour mark.  I just wanted a crazy Nicolas Cage action movie, but any action is few and far between.  In fact, I would even go to say that Cage is underutilized in this movie.  This random samurai (Tak Sakaguchi) is given more to work with than Cage, and it's not a lot.  I was thankful that Cage was there since he is doing his standard wide-eyed performance, which was enough to keep me awake.  The writing and the pacing make Prisoners of the Ghostland D.O.A.",
            "review_date": "2021-09-24",
            "source": "rt"
        },
        {
            "content": "I now know what it feels like to drop acid…..",
            "review_date": "2021-09-23",
            "source": "rt"
        },
        {
            "content": "When you're on laced shrooms and bad LSD at a Burning Man festival in a Japanese desert. That was director Sion Sono's vision, and he did not disappoint putting it on film.\n\nHowever, having actors-turned-wannabe-writers Aaron Hendry and Reza Sixo Safai with barely to no writing experience come up with this screenplay, was wackadoodle. I got annoyed with the number of production companies displayed in the opening credits, you'd think at least one would've invested in a seasoned writer to at least look over the final script. Safi and Hendry wrote a bunch of incoherent, convoluted, plot-hole and technical-issue riddled nonsense.\n\nThe 103 min runtime, sub-par pacing, and many long dragged out and unnecessary scenes, made this film seem like it was 3+ hours long.\n\nLuckily, with Sono's directing and Sohei Tanikawa's near-perfect cinematography, the eye-candy sets, crazy costumes and props, and stunning visuals kept me hooked. The score was fitting and on point. The casting and performances were excellent, especially Nicolas Cage (who this role was made for) and Sofia Boutella.\n\nIt's a shame no one babysat the writers, as this could've easily been a cult classic. But as is, I'm thinking this would've been a much better music video backdrop for Pink Floyd or Metallica album. It's a very generous 6/10 from me.",
            "review_date": "2021-09-23",
            "source": "rt"
        },
        {
            "content": "Just Don't waste your time with this movie.",
            "review_date": "2021-09-22",
            "source": "rt"
        },
        {
            "content": "I really do not know what to say! This movie is GARGBAGE!",
            "review_date": "2021-09-22",
            "source": "rt"
        },
        {
            "content": "Rating: A-\n\n\"Prisoners of the Ghostland is everything a film starring Nicolas Cage is expected of being. Possessing technical attributes of making the biggest Hollywood studios shamelessly hide with envy, Sion Sono's movie is as illogical, absurd, ridiculous, stupid, and insanely entertaining as I hoped it would be. By mixing up dozens of distinct genres, the straightforward premise gets sucked into a world of total anarchy, where samurais, cowboys, nuclear explosions, modern cars, and much more collide to surround an otherwise simple narrative with nonsensically hilarious storylines and awesome action sequences. Sofia Boutella and Bill Moseley help Cage tackle this chaos, but the latter is the absolute standout due to his remarkable experience in crazy films. Despite it occasionally crossing the line and becoming too much for me to manage - it becomes seriously confusing - as long as the viewers are well-prepared to accept every jaw-dropping new development, fun is guaranteed with this brilliant satire.\"",
            "review_date": "2021-09-21",
            "source": "rt"
        },
        {
            "content": "I thought this was insanely fun, and really beautiful and weird to look at.  The storyline is incomprehensible at times, but there are some hilarious lines, and the overacting worked in context for me.",
            "review_date": "2021-09-21",
            "source": "rt"
        },
        {
            "content": "This film is not for everyone, by no stretch of the imagination. But if this is the film for you, it is hands down the craziest Nicolas Cage movie ever made. Im not sure how to describe it, a Japanese Arthouse Fantasy Western? The trailer for the movie makes it seem as if its a balls to the wall action flick. It is not that at all. While we do get some great fight scenes, this is more of a slow, mythical, almost dream like adventure. If you want some nice Cageplotation, I would highly recommend this movie. There is a scene so crazy in this movie, my jaw dropped to the floor...",
            "review_date": "2021-09-21",
            "source": "rt"
        },
        {
            "content": "WTF?! More like a dystopian acid-trip than a real movie! The story is incredibly week, and despite the elaborate costumes and choreographed fight scenes, it has a very unpolished low-budget feel to it... likely trying to chase an old '70s western movie vibe. It doesn't work at all.",
            "review_date": "2021-09-21",
            "source": "rt"
        },
        {
            "content": "Terrible. Half baked story. Great setup, no second act and terrible 3rd act. I still don't understand how Nik Cage makes his choices, going from PIG to this. LOL",
            "review_date": "2021-09-21",
            "source": "rt"
        },
        {
            "content": "Im a super Nicholas Cage fan..... This is quite possible the worst movie ive seen in the past 11 years.",
            "review_date": "2021-09-21",
            "source": "rt"
        },
        {
            "content": "If Sergio Leone had taken one of his scripts, had a Japanese writer tweak it up, hired Japanese cast and crew, then put Nicolas Cage in the Clint Eastwood role, this would be the result. As far as I know, it's the first Post Apocalyptic-Samurai-Western movie, with zombies. It's self-awarely fantastic and silly.\n\nThe story, a classic quest, could be told with pilgrims, knights, samurai, cowboy drifters or death row inmates. This is a bizarre and visually compelling treatment, with interwoven noh drama, perhaps Greek chorus, narrating the back stories. Beautifully executed, great individual performances, and an altogether fresh look at a story thousands of years old. It's what you go to the movies for.",
            "review_date": "2021-09-20",
            "source": "rt"
        },
        {
            "content": "I thoroughly enjoyed this most recent Nick Cage film. It was gore filled, a great nod to kabuki noh style plays. I really enjoyed the symbolism and the dreamlike style was reministent of othe films I enjoy such as Imaginarium of Dr. Parnassus.",
            "review_date": "2021-09-20",
            "source": "rt"
        },
        {
            "content": "I love Nicholas Cage and weird Japanese movie but this is just horrible! Don't be deceived by the trailer like me.",
            "review_date": "2021-09-19",
            "source": "rt"
        },
        {
            "content": "Strange post-apocalyptic that makes you wonder what is going on, so weird? Is this from a manga? What are the cowboy hats gun, weird musical dance & outfit all about? Surely for prisoners of the strange-land that you can't escape... Half way I want my $ back",
            "review_date": "2021-09-19",
            "source": "rt"
        },
        {
            "content": "This movie tries so hard to be surreal and relevant, but misses the mark. Some interesting bits, but you get the sense of it early on and from then on, it's  just sn incoherent slog. We sped through much of the film. Yawn.",
            "review_date": "2021-09-19",
            "source": "rt"
        },
        {
            "content": "Cowboys and Samurais in the post apocalypse are badass.",
            "review_date": "2021-09-19",
            "source": "rt"
        },
        {
            "content": "‘Prisoners of the Ghostland' is a Bonkers, Neon Drenched Post-Apocalyptic Western",
            "review_date": "2021-09-19",
            "source": "rt"
        },
        {
            "content": "Words cannot do justice to how bad this film is. A discount Mad Max on acid is the only description that comes to mind. Nicholas Cage's wooden acting and painfully obvious hair dye just put the finishing touches on it. In mitigation, the dialogue is so awful that noone alive could do anything with it. As an example, I present the actual line he comes out with when threatened: \"I'll Karate chop you\". You have been warned.",
            "review_date": "2021-09-18",
            "source": "rt"
        },
        {
            "content": "I can get behind full on art house, or on the flip side a fully coherent story, but this film tries to balance in both and it fails horribly. Very poor directing, which leads to poor acting (although we do get the wacky and wild eyed Cage but it felt out of place and forced) and some god awful slow parts that led to some people walking out and some falling asleep around me. I do study martial arts but am no master, and feel confident I could’ve easily choreographed all the fight scenes at a much more entertaining level. It all just felt so flimsy, clumsy, and downright dumb. There were some beautiful looking set pieces that just became bogged down by poor use. I do like Nicolas Cages’s late game acting pursuits and respect him for taking on all these obscure, fascinating, wild movie roles. However this mess of a movie is no Mandy, and could easily be passed over and forgotten, falling into that realm of worst movies ever made. ",
            "review_date": "2021-09-18",
            "source": "rt"
        },
        {
            "content": "Sono and Cage fan but this is unintelligible, uninvolving, and unreedemable. Sono misfires completely.",
            "review_date": "2021-09-17",
            "source": "rt"
        },
        {
            "content": "If 'Pig' was a step forward for Nicolas Cage? 'Prisoners of the Ghostland' is a step too many back.",
            "review_date": "2021-09-17",
            "source": "rt"
        },
        {
            "content": "This was without a doubt the worst movie I have ever seen!",
            "review_date": "2021-09-17",
            "source": "rt"
        },
        {
            "content": "I do not know how anybody can like this, it is as awful as it gets. The single other comment above this one. I do not know what the guy that left that comment was smoking. It is literally one of the worst movies I have seen in my life.",
            "review_date": "2021-09-17",
            "source": "rt"
        }
    ]
}