{
    "rating": 6.1,
    "release_date": "2021-05-13",
    "num_reviews": 79,
    "genres": [
        "Hindi"
    ],
    "summary": "RADHE: The Most Wanted Bhai is an adrenaline-pumping action entertainer. The story revolves around the rampant usage of drugs in our society and how the youth is getting destroyed in the bargain. The protagonist of the film \"RADHE\" is a smart and tough cop with a kind heart and witty personality. He usually likes to do things his way to get justice restored in society. How far RADHE goes to bring justice, clean the streets from drugs to save the youth and to restore peace in society forms the crux of the story.",
    "reviews": [
        {
            "content": "It was below average but ok film salman sir was good it can be great but below average movie",
            "review_date": "2022-10-15",
            "source": "rt"
        },
        {
            "content": "It's just another salman khan movie with poor story line, unwanted action scene, bakwas recreation of song and illogical concepts.",
            "review_date": "2022-10-07",
            "source": "rt"
        },
        {
            "content": "ONE OF THE AWFULLY GOOD MOVIES EVER MADE BY BOLLYWOOD'S DON SALMAN!",
            "review_date": "2022-08-04",
            "source": "rt"
        },
        {
            "content": "Hugely disappointing. Wasn't expecting much, but didn't come close to that expectation either. Poor CGI, same old formula, sad dialogue and some really unrealistic story writing.",
            "review_date": "2022-06-09",
            "source": "rt"
        },
        {
            "content": "Just another generic and formulaic Salman Khan vehicle which does not work. The action scenes were illogical, the dialogue was bad and the humor was cheesy. Add into the mix the bad music and constantly changing tone. Skip it.",
            "review_date": "2022-02-11",
            "source": "rt"
        },
        {
            "content": "Fantastic movie radhe\nSalman Khan is megastar of bollywood",
            "review_date": "2021-09-12",
            "source": "rt"
        },
        {
            "content": "The first half of the movie was amazing it was clear that salman did try his best...it was somehow gripping but after the second half everything was rushed to the climax and the action sequences in other scenes were so good but why  the climax was so rubbish...Randeep Hooda did a great job disha was good but not needed songs were good Jackie sir did not have a major role but he did made me smile with his presence pliz people don't follow these boycott bollywood bullshit bcoz when it's salman it's not going to work it became a huge success on ott though I'm not a big fan of bhai but I know his fan following",
            "review_date": "2021-08-20",
            "source": "rt"
        },
        {
            "content": "My eyes! My eyes!\n\nWhat was that? OMG! \nPeople of earth,\nI am an alien from the planet Zeta Articulate I.\nI lost my eyes after watching this on our Galaxy Cable.\nI demand my eyes back or else we are coming...\nWe'll take all your planet's resources!\nYou don't deserve such luxury since what you watch is this.",
            "review_date": "2021-08-08",
            "source": "rt"
        },
        {
            "content": "Salman Khan has never cared to make a content driven film since ages , he proved the same once again with radhe. Mindless Hero worship movie from 1990s bollywood . Released in 2021 with 2000s CGI .\nBad movie. Don't waste ur time",
            "review_date": "2021-07-16",
            "source": "rt"
        },
        {
            "content": "Same salman bhai type movie a middle aged with a salman body,a hot actress whose impact is just negligible,creepy dance steps and what not.\nYou can waste your money if you wamt",
            "review_date": "2021-07-01",
            "source": "rt"
        },
        {
            "content": "The only thing good about Radhe is its short runtime of 1 hour 49 minutes. This is the kind of film that can give a person brain damage in these already torrid times. If you want to save yourself from this atrocious torture that not even the most ardent Salman Khan fan deserves, you should steer clear of this film. Instead, go and watch Tanmay Bhatt's commentary on Pakistani Uber drivers and their exchanges with their customers on YouTube. It will be a much better investment of your time.",
            "review_date": "2021-06-20",
            "source": "rt"
        },
        {
            "content": "I wish I can get my time back. Don't try to make sense of the movie. Action sequences are dull & numb. Pathetic use of CGI to make Salman look young. Disha Patani & Randeep Hooda didn't have much to save the film. \nFor such movies; negative ratings should be allowed.",
            "review_date": "2021-06-15",
            "source": "rt"
        },
        {
            "content": "Movies are based on genres. We should not expect something like Titanic when watching Fast & Furious. Salman makes movies for fans and he was brilliant to create a new genre for his loyal fans. This is why Radhe became a blockbuster and still keep going. This movie has all the elements that Salman fans want. For example world class action, comedy, heroism and an escape from the everyday life to relax and enjoy a good time with family. The sharp editing has made the film better but NY-VFXwaala did a rush job. Well, understanding the lockdown and restrictions the movie had to suddenly face, the team did a great job overall.",
            "review_date": "2021-06-01",
            "source": "rt"
        },
        {
            "content": "Radhe consists of nearly all the elements you would expect in a Salman Khan Film. (Action , Romance and a bit of Comedy). To me , it does not feel like a bollywood film.\n\nComing from a family of OG bollywood fans from the early 2000s, i can say that it felt like a hollywood film. I could easily tell that it has been remaked by the directors from an american film. \n\nIn terms of acting, the actors were superb as always. Salman Khan being a hero alongside the Living Legend Jackie Shroff. The villains were.... well... villainous and pure evil.\n\nThe storyline was really gripping and emotional at some times. As this relates to a real life society like today, we can relate this movie to how we live today. The storyline had a very long buildup which hyped up the climax. Unfortunately, the climax was rushed and didnt feel exciting which is the main reason why i have given Radhe a 3.5 star rating.\n\nA traditional bollywood film features songs which should be really popular for the OG bollywood fans. These songs are absolutely terrible and the only song which was decent was the title track. \n\nOverall, this film is worthy of a maximum 3 star rating due to its gripping storyline but rushed climax and terrible songs.\n\nI do not recommend this for OG bollywood fans but I DO recommend this for Violence and Action lovers!",
            "review_date": "2021-05-31",
            "source": "rt"
        },
        {
            "content": "Waste of time, there is no entertainment or any story. \n\nI think the entire movie team of this movie was just sucking up to Salman and his ego/stupid bhai image.\nMany of the scenes were cringey as F.\nI'm irritated at myself for watching this piece of crap.",
            "review_date": "2021-05-30",
            "source": "rt"
        },
        {
            "content": "Mind numbingly stupid!",
            "review_date": "2021-05-29",
            "source": "rt"
        },
        {
            "content": "Outstanding,  well made for fans",
            "review_date": "2021-05-27",
            "source": "rt"
        },
        {
            "content": "Nice movie.....Whatch this movie everyone...",
            "review_date": "2021-05-27",
            "source": "rt"
        },
        {
            "content": "Randeep you should not have signed this movie I am your big fan I did not expected you would sign such shit movie",
            "review_date": "2021-05-26",
            "source": "rt"
        },
        {
            "content": "Radhe movie is very educational for the young generation. Most gangster movies only show violence that are related to drug dealings but this movie has actually revealed the end consumers of these harmful un-prescribed drugs which is our youth. With all the negative reviews Radhe movie is definitely acting as an exorcism on the corrupted minds of the addicts.",
            "review_date": "2021-05-26",
            "source": "rt"
        },
        {
            "content": "Mindless movie, disastrous",
            "review_date": "2021-05-26",
            "source": "rt"
        },
        {
            "content": "This is the only Salman Khan movie I have or will ever watch. Regretting watching this one too. A lesson on incoherence.",
            "review_date": "2021-05-26",
            "source": "rt"
        },
        {
            "content": "Such a  special movie Mazza aa gya",
            "review_date": "2021-05-26",
            "source": "rt"
        },
        {
            "content": "Bakwas at its epitome. What a crappy movie. From dialogues to acting, everything is simply shitty. Utter waste of money and time. The only good thing about the movie was having Randeep starring in it.",
            "review_date": "2021-05-25",
            "source": "rt"
        },
        {
            "content": "Worst Movie ever!!!!!",
            "review_date": "2021-05-23",
            "source": "rt"
        },
        {
            "content": "Best movie . Radhe ❤️",
            "review_date": "2021-05-23",
            "source": "rt"
        },
        {
            "content": "Worst movie of the year.  Please don't waste your precious time in this nonsense drama",
            "review_date": "2021-05-23",
            "source": "rt"
        },
        {
            "content": "Waste of time. Just cringe scenes and action stunts",
            "review_date": "2021-05-23",
            "source": "rt"
        },
        {
            "content": "Too much violence in this movie ,",
            "review_date": "2021-05-23",
            "source": "rt"
        },
        {
            "content": "I'm not saying that this movie is torture but the worst thing of this movie is absolutely the poor acting. I don't know what to say. I'm not a critic but we all can feel that the acting skills of every actors except Randeep Hooda is very poor. What a bad direction, you will feel that if you will watch. The story, ha ha, I don't think that there is any story in the movie. But you may can enjoy its songs. Its ending is poor. If you will watch this movie you should take away your brain to enjoy this. You'll definitely know if you will watch it. 100% bogus. Watch \"The Outlaws\" instead of this garbage.",
            "review_date": "2021-05-22",
            "source": "rt"
        },
        {
            "content": "Rip physics, action is like bhojpuri movie,",
            "review_date": "2021-05-22",
            "source": "rt"
        },
        {
            "content": "Recommend! Good lesson for people who give up easily",
            "review_date": "2021-05-22",
            "source": "rt"
        },
        {
            "content": "It was a very boring movie, except Randeep Hooda, every other actors acting seem too unnatural. This movie had picked the topic of drugs among teenager but instead of addressing that issue, this movie was focusing more on salman khan's body and disha patani's figure. Disha patani's role literally gave the feel that the writer had to add her role in this movie under salman khan's request and her acting was terrible on top of it. The romantic scene between salman khan and disha patani was full of cringe and disgust. I literally felt my taste was wasted after watching this movie. Jackie shroff's acting and role was also terrible. I recommend not to watch this movie as it will disappoint you",
            "review_date": "2021-05-21",
            "source": "rt"
        },
        {
            "content": "It sucks it has no story but just hero who can do whatever he want it's not worth watching",
            "review_date": "2021-05-21",
            "source": "rt"
        },
        {
            "content": "Stupid movie. Waste of time. Even if it was the same old stuff that salman does I have seen him doing it better before. This one had bad songs, boring predictable plot and stupid stunts.",
            "review_date": "2021-05-20",
            "source": "rt"
        },
        {
            "content": "Nonsense, no brainer, typical faltu movie from Salman",
            "review_date": "2021-05-20",
            "source": "rt"
        },
        {
            "content": "a anime on the same story would be better",
            "review_date": "2021-05-20",
            "source": "rt"
        },
        {
            "content": "I think while coming on set prabhu deva forgot script at home..it was very difficult for me to give even half star..it was like salman bhoi just wanted to come on screen on Eid.. making movie was not the intention..",
            "review_date": "2021-05-20",
            "source": "rt"
        },
        {
            "content": "Leave your expectations aside and watch!!",
            "review_date": "2021-05-20",
            "source": "rt"
        },
        {
            "content": "Worst ever movie of salman",
            "review_date": "2021-05-19",
            "source": "rt"
        },
        {
            "content": "There is no acting at all (apart from Randeep Hooda). I hope others learn acting! God, what a waste of time.",
            "review_date": "2021-05-19",
            "source": "rt"
        },
        {
            "content": "If I was given one word to rate this movie, I'll use ILLOGICAL.",
            "review_date": "2021-05-19",
            "source": "rt"
        },
        {
            "content": "Overacting. Defying laws of physics , Salman was hyper swift in the first scene and then got iron man body in the end.. \n\nWas just unbearable, watched the movie in 30 min just in a hope overacting and excitement of being super hero subsides ..\n\nWatch it at ur own risk..",
            "review_date": "2021-05-19",
            "source": "rt"
        },
        {
            "content": "Worst movie ever seen and ever made in the history of india 😭😭😭😭😭",
            "review_date": "2021-05-19",
            "source": "rt"
        },
        {
            "content": "Superb Movie... Loved it... !",
            "review_date": "2021-05-19",
            "source": "rt"
        },
        {
            "content": "Blugbuster 🔥🔥🔥🔥🔥",
            "review_date": "2021-05-19",
            "source": "rt"
        },
        {
            "content": "It is a great movie to watch with your family. Full of action and comedy. The movie has a very positive message for the youth. Emotional scenes could be added more. Red chilies could do better VFX. Most of the negative reviews are just withdrawl syndrome of hate addicts.",
            "review_date": "2021-05-18",
            "source": "rt"
        },
        {
            "content": "the storyline of this movie is very good. And the songs in this movie are also good. The acting of Salman Khan, Randeep Hooda, Gautam Gulati and Lota is too good but the entry and last 10 min movie scene I don't like it.",
            "review_date": "2021-05-18",
            "source": "rt"
        },
        {
            "content": "Garbage! Very poor story and disaster acting.",
            "review_date": "2021-05-18",
            "source": "rt"
        },
        {
            "content": "New variant of Corona Virus - RADHE\n\nThere is no need to be feared of Corona Virus because the most contagious virus of all time 'Radhe' is here. Cringe all the time. Only Randeep Hooda's acting is convincing, else the idiotic action scenes and the unnecessary style is trash. I was waiting for a single moment in the film when I would think that yes, there is something in this film, even if its one scene. But, how can a Prabhudeva directed, Salman Khan starrer movie have a good scene (Exception - Wanted). Even the dubbing is not done correctly, lip sync is not proper. Disha Patani doesnt play any significance in the movie, as always she's there just for her glamour. Salman Khan's movies usually have good songs with good choreography but this movie doesnt have that as well. In a nutshell, dont watch it.",
            "review_date": "2021-05-18",
            "source": "rt"
        },
        {
            "content": "Worst movie, \nBad acting, bad script, bad songs. Waste of money and time",
            "review_date": "2021-05-18",
            "source": "rt"
        },
        {
            "content": "Salman Khan film was always a insane hero type typical Bollywood movie which is understandable for Salman Khan fans which are more than in billions through out the world so being a Salman Khan I liked it very much.",
            "review_date": "2021-05-18",
            "source": "rt"
        },
        {
            "content": "Couldn't really understand why they continue making this kind of film in today's time.\nIt's bringing down the standard of India Cinema. Bollywood is loosing it's credibility day by day because of this kind of film and acting.",
            "review_date": "2021-05-18",
            "source": "rt"
        },
        {
            "content": "I wonder what film makers are upto..Holy shit!!!!! Please stop making such dreadful movies. It's a crime to make such movies",
            "review_date": "2021-05-18",
            "source": "rt"
        },
        {
            "content": "I want to give negative rating to this movie but unfortunately there is no option. Bakwaas hain. Don't waste your time and money.",
            "review_date": "2021-05-18",
            "source": "rt"
        },
        {
            "content": "Best movie Salman megastar good entertainment movie",
            "review_date": "2021-05-18",
            "source": "rt"
        },
        {
            "content": "Worst movie ... isn't worth it to watch...you should not waste you money...I watch this movie today...and my experience is so bad with raadhe",
            "review_date": "2021-05-18",
            "source": "rt"
        },
        {
            "content": "omg im dying its so bad also I dont like his lips",
            "review_date": "2021-05-17",
            "source": "rt"
        },
        {
            "content": "Editing of this movie was very crisp. Having a fast paced plot the movie won't bore you at all. The runtime is shorter than other Salman Khan films. The sequence and flow of the movie is totally unpredictable which will keep you at the edge of your seat. Most of the negative reviews are coming from drug addicts that this movie has shed light on. Hope these trollers recover from addiction and get well soon.  The VFX could be better but the action is very well directed. Jackie Shroff adds comedy reliefs which will make you laugh as well. Overall money well spent!",
            "review_date": "2021-05-17",
            "source": "rt"
        },
        {
            "content": "Very enjoyable movie!",
            "review_date": "2021-05-17",
            "source": "rt"
        },
        {
            "content": "The movie was very educational",
            "review_date": "2021-05-16",
            "source": "rt"
        },
        {
            "content": "Nothing special or new in this movie. It was salman khan aal over and overall highly illogical movie. Action sequences were making no sense and same thing applies for timing of the songs as well. Music and songs were also very bad. \nOver all pretty bad quality movie even a b rated web series has better quality than this movie",
            "review_date": "2021-05-16",
            "source": "rt"
        },
        {
            "content": "'Radhe: Your Most Wanted Bhai' is yet another dumbfounding atrocious formulaic action thriller from brand Salman Khan.",
            "review_date": "2021-05-16",
            "source": "rt"
        },
        {
            "content": "Just to know that I didn't want to give any star to this 2 hour long torture",
            "review_date": "2021-05-16",
            "source": "rt"
        },
        {
            "content": "good movie please watch",
            "review_date": "2021-05-16",
            "source": "rt"
        },
        {
            "content": "This moive is amazing great action fast paced moive amazing villains and salman Khan looks superb,  dont listen to people saying it's bad because even they tgem self know they are lying",
            "review_date": "2021-05-15",
            "source": "rt"
        },
        {
            "content": "People Will Need To Take Double Dose Of Vaccine After Surviving This Movie( Or Whatever It's Called).",
            "review_date": "2021-05-15",
            "source": "rt"
        },
        {
            "content": "There was no story, just fighting and violence.",
            "review_date": "2021-05-14",
            "source": "rt"
        },
        {
            "content": "Now this old man should stop acting. Specially stop acting with girls of her grand daughters age.",
            "review_date": "2021-05-14",
            "source": "rt"
        },
        {
            "content": "one of the worst production by salman khan..",
            "review_date": "2021-05-14",
            "source": "rt"
        },
        {
            "content": "Movie \" Radhe\" is collection of poor content and cheap acting of Salman Khan. Investing time and money to watch this movie is a pain and will feel regret in the end",
            "review_date": "2021-05-14",
            "source": "rt"
        },
        {
            "content": "bad, sad & pathetic, this actor should quit acting.",
            "review_date": "2021-05-14",
            "source": "rt"
        },
        {
            "content": "Good movie worth watching",
            "review_date": "2021-05-14",
            "source": "rt"
        },
        {
            "content": "Everything is good, salman bhai fighting awesome,but very poor story",
            "review_date": "2021-05-14",
            "source": "rt"
        },
        {
            "content": "No story, No plot, what only good in movie is randeep hooda's role. Otherwise wrost movie, what we expect from salmaan",
            "review_date": "2021-05-13",
            "source": "rt"
        },
        {
            "content": "Blockbuster full entertainer paisa vasool movie must watch with family",
            "review_date": "2021-05-13",
            "source": "rt"
        },
        {
            "content": "One time watch. Slight overacting by Salman Khan as usual.",
            "review_date": "2021-05-13",
            "source": "rt"
        },
        {
            "content": "blockbuster movie of the year",
            "review_date": "2021-05-13",
            "source": "rt"
        },
        {
            "content": "Worst movie of the year...showing realme phones and taking selfie with those mobile phones and riding being human bike... Do they think we are idiots.... Not a single effort in Story play... Just a ludicrous movie... 👎👎👎👎👎",
            "review_date": "2021-05-13",
            "source": "rt"
        }
    ]
}