{
    "rating": 9.5,
    "release_date": "2021-10-01",
    "num_reviews": 37,
    "genres": [
        "Hindi"
    ],
    "summary": "The life of Sardar Udham Singh.",
    "reviews": [
        {
            "content": "The last 30 minutes takes this film to another level..........showing the slaughter of people who gathered to celebrate their holy day baisaiki.",
            "review_date": "2022-08-21",
            "source": "rt"
        },
        {
            "content": "Impactful. Brings to light the painful event in India's history",
            "review_date": "2022-08-19",
            "source": "rt"
        },
        {
            "content": "Quite interesting: it opens our eyes on what England did in India ....",
            "review_date": "2022-08-16",
            "source": "rt"
        },
        {
            "content": "One of the best historical biopic films coming out of India. Especially the last hour of the film really broke my heart. Superb film!!",
            "review_date": "2022-07-31",
            "source": "rt"
        },
        {
            "content": "Technically masterpiece! The production design, cinematography and the music was top notch, The recreation of that time and the story of back and forth between incident It was brilliant, The assasination and further politics and the incidents roadway, The Court room scene was insane and the whole british pov the general's perspective were amazingly showcased and the ending it was just Shattering,made me numb, Overall it was a great movie",
            "review_date": "2022-07-15",
            "source": "rt"
        },
        {
            "content": "LET THE WORLD KNOW THAT I AM A \"REVOLUTIONARY\"\nMasterpiece................\nI have no other words to describe this movie ..............\nActually I want to say something you can only kill a person you cannot kill his ideologies, his belief, his thought .................\nThat what I get this from the film like he done something he truly believe and the director just show the perspective of Sardar Udham Singh ............\nLike Shoojit Sircar found the way to tell the stories that can add value from history in our life\n.................from this file we can understand that Truth can be delayed ,can be manipulated, can be suppressed but cannot be erase, it should always find its way through Someone or other can find the truth and then they find a way to tell the whole world.",
            "review_date": "2022-06-21",
            "source": "rt"
        },
        {
            "content": "Movie held together by a strong performance from Vicky and an intense plot.",
            "review_date": "2022-06-09",
            "source": "rt"
        },
        {
            "content": "Unsettling but powerful film. Well-made.",
            "review_date": "2022-03-04",
            "source": "rt"
        },
        {
            "content": "If you are a Indian so you have to watch about our freedom fighters and true being human and true patriot. This movie is blow the mind and give you a such daramic expirence",
            "review_date": "2022-02-15",
            "source": "rt"
        },
        {
            "content": "After watching it, you'll accept that it should not worth even my free time.",
            "review_date": "2022-01-26",
            "source": "rt"
        },
        {
            "content": "It is one of the greatest creation of the OTT The movie is a biopic of our great freedom fighter Sardar Udham Singh.  The direction of the movie is just too good. Cinematography and act performed by each actor in the movie is admirable.\nThis movie is not just a movie but an experience.\nMust watch when you want to live in the moment or want feel the tension during that era.",
            "review_date": "2022-01-11",
            "source": "rt"
        },
        {
            "content": "I liked the way the entire cast and true kept things as real as possible. It was really heartbreaking to watch the attrocities done by britishers on indians again, but this is what should be done to keep people like kangana ranaut in check about the original indian freedom struggle",
            "review_date": "2021-12-13",
            "source": "rt"
        },
        {
            "content": "Excellently exceptional movie ! Hats off to Vicky and Shoojit !!",
            "review_date": "2021-11-22",
            "source": "rt"
        },
        {
            "content": "Soojit and Vicky, take a bow. This is how a movie should be made. There will be fools expecting these type of movies to be entertaining but they also didn't like Dil Se, so it's out of their league.\n\nThe story is well crafted. The shock seeing the massacre in Jalianwala Bagh, was quite appropriately done by Vicky Kaushal. Any one would be speechless. \n\nThe cinematography was brilliant. The portraiture of British thoughts about the incident was well defined. Where few thoughts it was needed, others thought otherwise. \n\nIn short, must watch. Specially for our typical Bolkywood directors. Learn movie making please.",
            "review_date": "2021-11-20",
            "source": "rt"
        },
        {
            "content": "Greatly highlights the sacrifice made by Sardar Udham. Highlights the facts and conditions that we Indians face during the time of before independence. Great movie with great direction.",
            "review_date": "2021-11-14",
            "source": "rt"
        },
        {
            "content": "Awesome movie!!! This movie shows what we(punjabis) pay for independence.",
            "review_date": "2021-11-13",
            "source": "rt"
        },
        {
            "content": "It's not biography feeling a revenge",
            "review_date": "2021-11-10",
            "source": "rt"
        },
        {
            "content": "This is the first patriotic movie that made me cry. This movie touched my heart very deeply.",
            "review_date": "2021-11-06",
            "source": "rt"
        },
        {
            "content": "A must watch movie and witness the horrors of 1913 Jallianwala bagh Amritsar",
            "review_date": "2021-11-01",
            "source": "rt"
        },
        {
            "content": "A well made movie with decent production. It falls short by being first and foremost political and trying to push a narrative rather than being an engrossing movie. It is very long and moves at an incredibly slow pace, jumping backwards and forewords in time intermittently. Pretty decent acting though.",
            "review_date": "2021-11-01",
            "source": "rt"
        },
        {
            "content": "Th best 15, horrifying  minutes, about the cruelty of the British! How he capture this so genuinely is Oscar-worthy!  And this guy is already an Oscar winner, if given a chance.",
            "review_date": "2021-10-30",
            "source": "rt"
        },
        {
            "content": "Very well crafted movie. We can actually see that the freedom fighters are not depicted as some kind of messiah but they are portrayed as a real human who has will to do something for there country and this is the soul of the whole film. Character building of Sardar Udham Singh is very well written and played as well. Background score perfectly complement the intense situations. And if you cried several times during the film then it's normal because film was so perfect and real to pull your emotions out.",
            "review_date": "2021-10-29",
            "source": "rt"
        },
        {
            "content": "The world and our new generation must know what our ancestors suffered. The Britishers must feel guily for the worngdoing of their ancestors. We must teach our kids and our fellow citizens about the wrongdoings of the britishers. Our history is being whitewashed, we read in our books about various goods briteshers done for this country. At that time many enjoying slavery, they felt proud to serve englishmen, things still same many of our politicians and others still same as past, bootlicking...",
            "review_date": "2021-10-29",
            "source": "rt"
        },
        {
            "content": "Exceptional movie... a Must Watch....",
            "review_date": "2021-10-29",
            "source": "rt"
        },
        {
            "content": "After long time Bollywood made such movie\nGreat impactful periodic movie",
            "review_date": "2021-10-28",
            "source": "rt"
        },
        {
            "content": "I literally cried at the end , this is the truth, Indian's never forget their enemies. They hunt them down.",
            "review_date": "2021-10-27",
            "source": "rt"
        },
        {
            "content": "The movie was a masterpiece from cinematography, music, direction, casting, and story writing everything was on point at first I felt it was too long but after watching the whole story I realized the movie was needed to long as it shows and makes you feel about how the people must have felt. This movie leaves you in the middle of the massacre at the end you will feel it",
            "review_date": "2021-10-25",
            "source": "rt"
        },
        {
            "content": "Movies like \"Sardar Udham\" come every once in a generation. This is by no means an easy movie to watch, but it is immensely well made and acted. The story is well written and every scene serves a purpose. The movie wastes no time with genre tropes and gives pertinent information in the right way. Usually, when stories are told out of order, I don't always like the choice, but in this movie, it works perfectly. Most of the movie plays out like an espionage thriller with lots of intrigue surrounding the main character.  That portion of the film is a reminder that slow-paced is not the same thing as boring because I was gripped and interested throughout. While all of that is still excellent, it is in the last hour of the film that I truly will not forget anytime soon. The film goes the distance by depicting brutal but realistic violence in this last act and it is extremely difficult to watch. It isn't necessarily a film I would recommend people watch for entertainment, but it is one of the most powerful movies of 2021 and made a true impact on me. I hope this movie gets the attention it deserves, it is a brilliant work made with care and intense levels of authenticity. All in all, anyone who believes in the power of cinema cannot miss this one.",
            "review_date": "2021-10-24",
            "source": "rt"
        },
        {
            "content": "Subtle, poignant.. a must-watch!",
            "review_date": "2021-10-24",
            "source": "rt"
        },
        {
            "content": "It's not a movie, its reality best shown. I felt the pain people might have suffered for some acts by British power during their rule. People should at least watch it once.",
            "review_date": "2021-10-24",
            "source": "rt"
        },
        {
            "content": "By far the best Bollywood movie of 2021 with great cinematography, visual effects, plot and the depiction of the raw presentation of the real incident. No more additional melodrama and emotional scenes. The film stick to the plot and story and show as it is in a raw which grabs the audience attention till the last.",
            "review_date": "2021-10-24",
            "source": "rt"
        },
        {
            "content": "One of the most important story which the world and Indians must know and thanks to the team of SARDAR UDHAM it has been immortalized forever in this incredible, incredible movie. A must watch a hundred times and deserves l the accolades it gets. Even if it doesn't get an Oscar, It won't fade the brilliance of this movie in my mind ever. Thank you, Vicky Kaushal. Thank you, Shoojit Sircar, Thank you, Avik Mukhopadhyay, Thank you, Team SARDAR UDHAM.",
            "review_date": "2021-10-23",
            "source": "rt"
        },
        {
            "content": "Awesome Movie, Acting, Direction all are up to the mark",
            "review_date": "2021-10-22",
            "source": "rt"
        },
        {
            "content": "Indian answer to Schindlers list!",
            "review_date": "2021-10-22",
            "source": "rt"
        },
        {
            "content": "'Sardar Udham' is an undeniably wholesome and poignant cinematic recreation of a significant chapter of Indian history.",
            "review_date": "2021-10-19",
            "source": "rt"
        },
        {
            "content": "The movie portrayed the tyranny of British colonial rule in India. The best part is flawless acting and great cinematography.",
            "review_date": "2021-10-17",
            "source": "rt"
        },
        {
            "content": "Best movie of 2021 so far ",
            "review_date": "2021-10-17",
            "source": "rt"
        }
    ]
}