{
    "rating": 7.9,
    "release_date": "2021-07-16",
    "num_reviews": 550,
    "genres": [
        "Kids&family",
        "Comedy",
        "Adventure",
        "Fantasy"
    ],
    "summary": "When LeBron James and his young son Dom are trapped in a digital space by a rogue A.I., LeBron must get them home safe by leading Bugs, Lola Bunny and the whole gang of notoriously undisciplined Looney Tunes to victory over the A.I.'s digitized champions on the court: a powered-up roster of professional basketball stars as you've never seen them before. It's Tunes versus Goons in the highest-stakes challenge of his life, that will redefine LeBron's bond with his son and shine a light on the power of being yourself.",
    "reviews": [
        {
            "content": "All over the place lacking all the magic.",
            "review_date": "2023-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, such a letdown. The premise was...good and bad. I loved the concept of them playing a video game version of basketball to allow for all the style points and such, but the whole Al G Rhythm was just dumb. I still don't really understand what the villain's motivation was. LeBron James can't act, and that's OK. I wouldn't have expected him to, but I thought Michael Jordan's performance worked better for two reasons: 1) a simpler plot, and 2) he didn't try to over act. \n\nJust...too much of it didn't work. The villain's main player who could stop time. When he, himself, could reverse time? Um, why doesn't he just keep doing that? And he controls everything, why does he have to stick to his bargain? He cheats throughout anyway? Just doesn't work. But it was fun, I guess. The first one was better.",
            "review_date": "2023-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly entertaining despite the shoddy beginning and premise. No less looney, but no Michael Jordan Jam either.",
            "review_date": "2023-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is not too bad. A few good moments in film.",
            "review_date": "2023-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loony, funny, entertaining, good movie overall. Personally really liked symbiose with other WB \"universes\", especially with Rick and Morty.",
            "review_date": "2023-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the loony tunes! They are so funny. Lebron was cool in this. Also the guy from fortnite ",
            "review_date": "2023-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though it doesn't match up to the original, this is a new embark and this is the space jam of this generation.",
            "review_date": "2023-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie I liked when I first watched it. But after a rewatch it's just a shallow narrative and badly written movie. The movie does not care about making a good movie because they just wanna play basketball. Also Lebron is a horrible father and very unlikeable in this film and his acting is not very good. Over all a movie I would not recommend to you guys. Over all a really shallow terribly made movie.",
            "review_date": "2023-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Space Jam: A New Legacy is more of an advertisement for HBO Max than a film.",
            "review_date": "2023-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Way for WB to show off. \nLeBron.. Just stick to basket and not acting.",
            "review_date": "2023-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The animation is amazing and honestly beautiful however I wouldn't say that Le Bron James is the best actor and will most definitely won't win any awards for it but I would say it's a good family movie with a pretty solid message about family. I wouldn't recommend it unless you wanted to pass the time",
            "review_date": "2023-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Ready Player One' for kids, and at the same time 'HOW DO YOU DO, FELLOW KIDS?': The Movie.\nTruly horrible in every aspect, from its cookie-cutter plot to cardboard characters and completely unwarranted fan service. The (2D) animated sections did call back to a time in which a movie like this could've worked without turning it into the corporate travesty it became.",
            "review_date": "2023-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my honest review. I am not lying. This movie is life changing. I am a new man. seeing LeBron reconnect with his son brought a joyful tear to mine eyes. y'on know that farmer? Dw he's not in this movie. if you don't wanna see him don't watch JAWS. BUT YEAH THIS MOVIE IS GREAT AND I WOULD SELL MY LEFT heart TO watch it for the first time again. I cam forever grateful for my eyes for letting watch this movie. I love you Lebron and I know u love me and miss me (this is Lebrun's son). Just so you know im very happy that this movie has been made I would never not watch it even to save the world. you would think there would be a word limit on this review but google knows anyone could praise this movie for hours on end and they cannot limit their happy fans. please give LeBron and bugs bunny an Oscar or Tony or whatever award they give to actors. I love you Hebron (dad). ur cool. - OCSAR",
            "review_date": "2023-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good flim great actors and funny times hope there is a 3 one great job",
            "review_date": "2023-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Starts slow but gets better on the back half of the movie.",
            "review_date": "2023-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LeBron James should be banned from acting forever. He's horrendous",
            "review_date": "2023-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its not that the first movie was a masterpiece but it was clearly geared for the audience to have fun and played with the timelessness of MJ's image at the time for kids. Space Jam 2, however, felt like one huge ad, it wasnt there to show kids fun, it was there to show kids what to tell their parents to buy. WB over inserted itself. It certainly didnt help LeBron was busy sticking his feet in his mouth multiple times over social and international issues at the time, exposing his morals were bought and paid for rather than earnest, and tarnishing his image as a figure children should look up to.",
            "review_date": "2023-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's absolutely horrendous but very fun",
            "review_date": "2023-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So outlandishly bad that it demands to be watched through till the end, if only to see where its rock bottom truly lies. This new iteration of the 90's nostalgia cannon featuring Michael Jordan lacks all the original's wit and charm. Instead, it chooses to substitute those elements with product placement and IP crossover elements that cheapen the film immensely while doing a lousy job of distracting from how poor the plot elements are throughout the film's much too long runtime. The entire film seems like one big, self-initiated pat on the back for Warner Brothers as they finally find a way to cash in on their every property simultaneously. It didn't work for Spielberg in Ready Player One, it certainly doesn't pay off for director Malcolm D. Lee either. It's also a self-indulgent showcase for Lebron James, who's acting is atrocious throughout, in a way that it never was for Jordan. The whole thing winds up feeling more than a little masturbatory. It's a love note written to Lebron James and Warner Brothers, written by Lebron James and Warner Brothers, and featuring Lebron James and Warner Brothers.",
            "review_date": "2023-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst movie I've watched in a long time. Three of my friends have watched it as well and agree.",
            "review_date": "2023-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Felt like a long ad, with low stakes. Just a cash in on nostalgia and basketball fans.",
            "review_date": "2023-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I Loved that movie, i Had the greatest time watching it for the First time, the whole Game, the only gripe i Had is that Doms Charakters from the Goonsquad didn't get a better ending, i thought those Guys we're pretty cool and unique chars and the Scene after Back to the bucket really Made me Like them.",
            "review_date": "2023-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's odd that it's this bad.  It seems like with a big studio and a big name like Lebron you could easily make a fun and enjoyable movie.  I just find it interesting that the movie struggles so much.",
            "review_date": "2023-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was great my kids and I loved it",
            "review_date": "2023-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed this one with my family as we thought it was entertaining and a good basketball story with the Looney tunes squad and brings in several of today's basketball stars to the screen. I thought it also introduced the next generation to each of the characters that we grew up with in the Mel Blanc days of Saturday morning Looney tunes cartoons. I thought the audio volume was terrible between the speaking parts & the sound effects or maybe it was just on my system, but it bouncing around from quiet to very loud.",
            "review_date": "2023-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Keeping an open mind like all looney tune shows, mixed with imagination, is what makes this movie so worth it. Lebron and cast also creates a healthy balance to the zany antics the Looney Tunes have over the movie! Loved the comedy. Looney Tunes never disappoint!",
            "review_date": "2023-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really liked Bugs Bunny and LeBron James doing the rabbit season and duck season posters.",
            "review_date": "2023-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love first Space Jame but this? This is joke. I am going to the cinema for Joke (no comedy)? I am so sad of this ):",
            "review_date": "2022-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This may not be that great of a movie, but it is also not as bad as people make it out to be. Honestly i had so much fun in the theater that it ultimately made up for it. And at least it doesn't make nearly as many mistakes as the original.",
            "review_date": "2022-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved the first one, it was a big part of my childhood. But this one wasn’t necessary ",
            "review_date": "2022-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They destroyed a legacy with a advert hidden behind a film",
            "review_date": "2022-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is great because you will love this movie!!",
            "review_date": "2022-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It mostly felt like a lot of build up to something a little more disappointing still has some good moments and a waste of my time but a little more to do this film justice\n6/10",
            "review_date": "2022-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really hate that new film I really like the old film",
            "review_date": "2022-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of The Best Movies Ever Made",
            "review_date": "2022-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Again, another movie throwing pop culture references at you every second.",
            "review_date": "2022-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "James didn't flop one time. Completely unbelievable.",
            "review_date": "2022-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original was way better\nMan, the first movie is a CLASSIC. Morgan Freeman and Tim Robbins give the performances of their careers in this groundbreaking, Oscar-nominated film. But then the second one was just a bunch of cartoons playing basketball\n- I'm not too thrilled about the direction this franchise is headed",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a hardcore looney tunes fan and a basketball player, I was really hyped for the newest movie of the space jam franchise, due to the over 2 decades wait for it. When I went to watch it for the first time in cinemas, I thought it was amazing, however, after its digital release I bought it on DVD AND rewatched it. Afterward I realised that\nSpace jam: A new legacy is NOT worth rewatching! 2/5",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dissapointing. The first Space Jam is a million times better than the second one",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Utter tosh. A shameless branding exercise for Lebron. Tried but failed to sleep through it...",
            "review_date": "2022-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was abit better than the first movie but when I keep hearing lebron james scream alot on the movie it makes me want to scream too.",
            "review_date": "2022-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty much a Big Advertisement for Warner Brothers",
            "review_date": "2022-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was aight, i liked the part where lebron said \"it's space jam: a new legacy'in time\" and then space jam: a new legacy'ed all over",
            "review_date": "2022-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hate Lebron, his story was terrible. But I love the looney tunes and very much enjoyed them. Big fan of the original, but not of this one.",
            "review_date": "2022-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "La (not great actor or in the top 10 greatest basketball  players of all time) bron James",
            "review_date": "2022-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why just why the original was way better",
            "review_date": "2022-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Had some hopes for this film but it fell flat on its face.",
            "review_date": "2022-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not as good as the first Space Jam. Also, LeBron James acted poorly. Warner Bros. also did shameless promotion of properties it owns.",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It looked like it was for people who grew up with the original film. Yet they tried target kids. Huge mess….",
            "review_date": "2022-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The actors are great and opening scene is solid, but lacks good CGI,  story, and purpose",
            "review_date": "2022-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible. Waste of time compared to the original.",
            "review_date": "2022-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Are you kidding me why was this even made truly embarrassingly awful why would you cast a basketball player that clearly didn't know how to act leave others alone just because they are good at sports doesn't mean they can be good actors Lebron James knows better after all I used to be a fan of basketball and lakers were my favorite team next to the thunder this film not only ruins the reputation of lebron james it ruins the reputation of his team his teammates would be ashamed of him even his basketball playing is lame he dribbles in a way as if he thinks there is an earthquake and that he is so anxcious it's like a parody of itself it reminded me of a bewildered and attacked Sherlock Holmes and dr watson in the Will Farrell remake when the bees were attacking them and they were just shooting out of controll it was just painful to sit through and none of it is helped by the looney tunes charachters like they are just there for trying to bring nostalgia perhaps a role like this should be handed to Dwayne Johnson only he can do both acting and sportsmanship after all he was a proffesional wrestler and even at one point in his early life a football champion he would even play basketball better than lebron does in fact I wasn't even a fan of the original space jam and the more I think I now feel like it's just a poor attempt to bring the classic looney tunes back to the screen and it fails and this does worse and speaking of the looney tune charachters the voice acting of them is just horrendous it was like they were parodying the original voices of the charachters back in the classic era it's so laughable even the late Mel Blanc would laugh and spit on it he would be offended to see his own voiced charachters thrown on screen like this it is soo bad it feels like an insult to the original looney tunes just like how they just made the recent Tom and Jerry film that didn't have the charm of the old cartoon this and the latest Tom and Jerry movie are both failed attempts to bring two of the classic cartoons of the Hollywood golden age to screen and the only recent film that did bring the golden age back with the charm and magic was David finchers mank and now wee need a reshooting of the old cartoons well we won't get it as far as I know at the moment and even if one tries they need to think better just like in the 2000s when they made sequels to the old 40s and 50s Disney classics and even a new Tom and Jerry series called Tom and Jerry tales but now the Disney classics are remade to live action and it all fails as well this is no exception the director nor the crew don't seem to try and they did it all poorly resulting a boring and face palming experience of bad dialogue and poorly filmed dribbling scenes it was litteraly a chore to sit through I wanted my time back and I wasted it shame on you lebron for not using your playing skills 0.5/10",
            "review_date": "2022-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although the Looney Tunes are amazing cartoon characters, this movie is just embarrassingly bad and is a burden on the original Space Jam.",
            "review_date": "2022-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is good. The CGI is very advanced and nice looking.  The characters were  nicely designed and that was something new added to the film, but the over all the plot of the movie is exactly the same as the original only the villain, and the place the plot is happening are different. It wasn't something fresh and new it was just like a copy. Also the references to the other movies and cartoons were fun to see in the background and also spot and recognize. The jokes were funny but my personal favorite is the Michel Jordan/Michel B. Jordan. Over all it's a nice movie to watch with children with all the colors, but if you want to feel nostalgic just watch the original.",
            "review_date": "2022-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've said it before: I'm a Looney Tunes fan, so I might be generous with the stars, but aside from the B-Plot and the stereotypical villain this movie is a lot of fun, and it's cool to see a lot of different WB characters crossover (even if it is just a Multiversus ad).",
            "review_date": "2022-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LeBron James probably won't win any acting awards, but this is an entertaining all-ages movie with solid animation, a positive message for kids, and fun cameos for older viewers",
            "review_date": "2022-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film lacked any kind of charm,  the plot wasn't at all interesting,  the acting was mediocre,  the only worth while thing about this movie was seeing the cameos. Hopefully won't see LeBron James terrible acting skills again.",
            "review_date": "2022-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a huge movie fan, I loved seeing the amount of licenses being used by Warner Bros. The new take on the basketball video game makes it interesting for both Lebron and the tunes to adapt to. It's a movie that will put a smile on your face for sure.",
            "review_date": "2022-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overall, this was horrendous! the acting and plot is all over the place.  The acting from everyone was subpar but most importantly Watching Lebron's piss poor attempt at conveying any semblance of emotion felt like I wanted to rip my eyes out.  On the other hand, seeing all the characters from looney tunes was quite nostalgic, which is what the stars are only for.  Most of these reviewers either have not seen the first one ( an absolute classic) or are just unauthentic and fabricated by the industry.",
            "review_date": "2022-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LOL, the funniest 01 hour: and 55 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Making million sequels of the first film is waste of time.",
            "review_date": "2022-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I literally created a rotten tomatoes account to leave this review",
            "review_date": "2022-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An ok movie that passes the time and is enjoyable. Lebron James's acting is ok for his first movie. The movie is sometimes very corny and cringy. The movie is at times very predictable. However, it does have some decent humour and is enjoyable to watch.",
            "review_date": "2022-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly Not 26% but a solid Wb's rollercoaster ride, The story's decent but the algo thing was bad, The Music was brilliant and The visuals were a colorfull delight the cgi and animation was a piece of art. The references from whole wb property was insanely awesome and the game was entertaining and the ending with bugs it was amazing, Overall its a colorfully entertaining and an awesome sequel.",
            "review_date": "2022-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very funny and Interesting movie, but the plot was too messy",
            "review_date": "2022-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring movie. It is very terrible.",
            "review_date": "2022-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a Terrible Movie.",
            "review_date": "2022-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's worth exactly one watch.\n \nReasons to watch:\n1. If you're a basketball fan\n2. If you are a millennial and want to see a Space Jam movie that's made for the modern era basketball fan.\n3. If you have kids.\n \nAny or all of these are reasons to watch the movie.\n \nReasons to never watch this movie again:\n1. It's a cash grab (like the original)\n2. It failed to be the cultural staple that it's predecessor was. Heck... it isn't even THAT relevant to modern era basketball culture. \"Monstars\" remains in the Basketball fan lexicon... \"Goon Squad\" isn't.\n3. You can just tell it was written by committee. Everything from the pro-tech message, the villian algo-rhythm, Lola Bunny being redesigned... it's as though it were written for just this one moment, which is unsurprising, but it definitely dated itself.",
            "review_date": "2022-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "anyone who gave anything other than a 1 star is a pandering fool. this movie was awful. nothing but a huge commercial and disgusting acting by a narcissistic moron. why was this movie ever made omg just terrible. ",
            "review_date": "2022-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was so good and so funny",
            "review_date": "2022-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watch this only if you want to revisit old favorites from WB, primarily the Looney Tunes. Movie feels a little stretched and story could've been better for sure. Giving it 3/5, which I see more as 6/10 because it does bring back a lot of memories and can be quite entertaining at times.",
            "review_date": "2022-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked the sequence were they say let's get looney and it's classic Looney Tunes shenanigans",
            "review_date": "2022-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "michael jordan comes back with a vengeance and revitalizes his acting career in this all time classic.",
            "review_date": "2022-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just watch this with my free HBO preview. ABSOLUTELY TERRIBLE! DON'T WASTE YOUR TIME! ",
            "review_date": "2022-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A blatant money grab with a weaker NBA star. The only times I laughed was all the shots taken at LeBrons expense. If I wasn't already sick when I was watching this, it may have made me vomit. Other than that, it was alright.",
            "review_date": "2022-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie made me so sad. there was only one minute of screen time for marvin the martian. i had loved his appearances in the beginning, and had expected more, but he didn't show up and it was extremely disappointing. i do not care about the rest of the movie, this destroyed me.",
            "review_date": "2022-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was so bad I wanted to throw up. I give this movie a negative 5... The original Space jam Movie is the best movie of all time",
            "review_date": "2022-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Space Jam - A New Legacy:\n4 / 10",
            "review_date": "2022-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is exactly what you think, a silly fun kids' movie with a great moral at the end. I'm not even a basketball fan and it was great fun to watch.",
            "review_date": "2022-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Am insult to the original LeBrons  role felt so forced it was like he didn't even want to be in the movie and on top of everything it was a sequel riddled with plot holes should've been  a lot better watched once never watching again",
            "review_date": "2022-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is not as bad as I thought. 😳",
            "review_date": "2022-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LeBron James attempted to take on the mantle of Michael Jordan's footsteps to star in what was supposed to be a wacky and wild universe of basketball plus Looney Toon favourites that sadly ended up with rather disappointing and disastrous result.\n\nOnly Don Cheadle shines throughout the film.",
            "review_date": "2022-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great message for the kids. Only adults didn't like the movie. The movie isn't for adults though.",
            "review_date": "2022-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really wanted to love this movie but i didn't it was just a bad movie i kinda like it.i really loved some things about it don't give me wrong but i was just mad it was bad i loved ALL the reference of movies that was fun to see the looney tunes in different movie.i love the basketball game but when we get to it its way to long.the acting dear god the acting is really bad lerbron sucks at acting its funny and awkward.the first one is fine.i really don't like how this movie is 2 hours it makes sense for does movie but that's kinda dumb.the movie is funny really funny for how bad it is the son is really dumb because people lifes are at risk and he just wants to say who cares yeah hes very dumb.the looney tunes are fun kinda they are written flat for me and when james is in tune world he is very bad at acting there.i really hate and love it like bugs bunny dies(sike)then he comes back alive that's how they now this movie is bad.its very bad it has a little bit of good things but its a 4/10 i don't like it.CGI is very great i really like only on 1 character i think it looks wired on the girl bunny its wired.",
            "review_date": "2022-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Being a Laker fan, I had to see this film and no, its not like the original with Micheal Jordan, but there is a lot of fun and winks especially for NBA fans. And I do admit, it's kind of a flex for WB and their IP but I didn't mind. I enjoyed the nods at the old Superman/Batman animated series as well as the Rick and Morty. While it can be a bit goofy, the plot was fun and there was a great moral lesson at the end of the film. I had a great time and good fun watching. I highly recommend this movie to any NBA fan. I give it a B",
            "review_date": "2022-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There were some funny scenes, but it was hard to follow. And not because of its complex storyline but because it's really really boring.",
            "review_date": "2022-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A couple small fun moments, but this had all the poor choices of the original with none of the charm. \nPlus how does the Toon Squad win, when they are against digitalized players designed to be perfect and a rigged scoring system... if the good guys must win, make it believable.",
            "review_date": "2022-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible movie, would not recommend",
            "review_date": "2022-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only good thing about this movie is the animation, and the looney tunes are great too!",
            "review_date": "2022-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Space Jam A New Legacy is one of the most corporate pandering movies I've ever seen myself i do not recommend",
            "review_date": "2022-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible remake to the original",
            "review_date": "2022-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie had very few funny parts and beginning ruins anything that the ending could have been.  Seems like a cash grab and advertising for all of their movies.",
            "review_date": "2022-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, this was bad.  Remakes don't always live up to the originals, and this one may not take that title away from \"One Missed Call\" or \"Cabin Fever\", but this is literally one of the worst remakes in movie making history.",
            "review_date": "2022-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the most accurate that the Rotten Tomatoes Stars have ever been. \"Meh, it passed the time\" is the perfect way to describe this movie. It was kind of fun for the most part, but it wasn't intelligent. I never expected it to be a very smart movie, but even then its story could've been ironed out a little more. While the first movie was one big shoe commercial, this movie is just one big Warner Bros. promotion. It was hard to look at when it got to the actual basketball part, as it was just nothing but a CGI conglomerate. It made for a decently fun time, kids would probably love it, but I'll bet that no one will be talking about it soon after.",
            "review_date": "2022-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Filled with great animation and references to WB properties, A New Legacy is fun for the whole family to enjoy, even if it doesn't quite live up to its predecessor.",
            "review_date": "2022-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Where's basketball..?",
            "review_date": "2022-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "nice getaway for a bit",
            "review_date": "2022-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lots of critics and my friend hated it, but I thought it was entertaining. Even though I don't like LeBron James, it was still fun to watch him in this movie once. With \"not\" even a basket ball game at the end, it was very, very cheesy. But I did like all the Warner Brothers cameos from the Matrix to Harry Potter. Great nostalgic moments. I also liked the different style animations theme they put for the cartoon characters even though they toned down Lola Bunny like a lot. If you want a cheesy movie to watch like Tom and Jerry, give this a try if you are in the something goofy. But don't expected it to be like the Original, which was way better.",
            "review_date": "2022-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this is the worst film i ever seen, i don't want to rewatch something like this in the future, this film is only a bad copy of the first space jam.",
            "review_date": "2022-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LeBron James worked hard to be the greatest and he's not about to let his son Dom be a slacker. Instead of basketball, Dom only wants to be a video game designer. WB's new computer algorithm Al G. Rhythm (Don Cheadle) wants to use LeBron's popularity to dominate the social media space. After LeBron rejects the offer, Al G. Rhythm kidnaps LeBron and Dom into the computer world. LeBron has to play a basketball game to win freedom for himself and his son. LeBron is sent to Tune World where he finds a lonely Bugs Bunny.\n\nLeBron is a functional actor and I like the older style Looney Tunes cartoon world. I love the Michael B. Jordan bit. I like some bits in this movie but it's way too long and too much of this is below par. The best part of this movie is Bugs Bunny in his Looney Tunes world and then they go off to various franchises to search for the rest of his friends. I like all of that. I like the animation style. Quite frankly, an animated LeBron James allows him off the hook for his acting. His voice is unique and works well for animation. Turning him in cartoon is a good thing. He doesn't have to act. He should stay a cartoon until he wins the game.\n\nHis son Dom is a big problem. He's a brat. The excuse is that he gets enticed by Al G. Rhythm but it's a sorry excuse. At no point is he concerned about being in a computer simulation or about his father. The solution lies in Al turning Dom into a monster. When LeBron has his big emotional speech, Dom can slowly turn back into a boy looking to hug his father. That is much better characterization and progression in his story arc.\n\nFinally, this movie is hella busy and way too long. It is almost two hours long. The game is almost an hour long. They need to cut out at least fifteen minutes if not more. There is so much chaotic action that the long game section grows tiresome. People are excusing this for being a kids movie. Some of these references are going right over those kids' heads. They are not going to get A Clockwork Orange. For people who get all the references, this is bad for them. For kids who don't get the references, there's no point to it. This movie has fun bits. I love the Looney Tunes animation section. I don't like them digitized into computer animated. The plot is bad simplistic writing. The father son conflict could have been done better. This is way too long and that pushed me over the edge.",
            "review_date": "2022-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am not sure what was worse, the poor acting, the grade-schooler script or the fact that it was a two hour infomercial for LeBron James. The plot was very poorly written. Do not waste your time on this one!",
            "review_date": "2022-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Space Jam: A New Legacy is an entertaining sequel.  Because it came more than a decade later, it had way better graphics and special effects. The flashy, almost psychedelic visuals can be over the top though. The plot is simple with a moral lesson about family relationship and acceptance. The Looney Tunes characters are funnier here than in the first movie. They were also given an upgrade from 2D to 3D animation in the latter part of the movie. Some people might not like Warner Brothers' shameless branding, but I love how they featured some of their most well-loved movie characters from different fandoms. As expected, the basketball games were wacky and hilarious. It's understandable that LeBron James' acting was bland because he's not really an actor. But Don Cheadle was terrific as the main villain. I also like how they included Sonequa Martin-Green from The Walking Dead, because she's a fine actress. This sequel may not be as innovative as its predecessor, but for me, it's funnier and the visuals are way better. I think kids and LeBron's fans will enjoy it the most.",
            "review_date": "2022-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How can anyone have anything good to say about this movie, Mr. James did the worst acting job I can think of....literally.  No B or C or straight to $1 bin movie is as bad as this.  The Loony Toons make this a two star, but I have no clue how anyone can give this anything other than a three stars.  Waste of time, and only reason I came here to review it was that the streaming service said it was an 80% on Rotten Tomato, was there some inside shenanigans?  And why so many one line (both + and -) reviews?  I have the feeling this was some social campaign, and I got stuck watching a HORRIBLE movie.  Thanks internet, take my advise and pass on this movie....  Choice of a kick in the crotch or watch this, I will ask for the kick in the crotch next time.",
            "review_date": "2022-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The relentless references to other WarnerBros properties made this tedious and annoying to watch. Strip all this away and it'd be a decent follow up to the original, with some fun to be had with the Looney Tunes (at least in the classic 2D parts). But overall it ended up feeling too much like corporate showreel.",
            "review_date": "2022-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one got dogged on a lot, but it really makes no sense. It's better than the original in every conceivable way. Sure, LeBron ain't getting an Oscar any time soon, but he's no worse than Jordan. And this one has a plot that is fun and at least makes more sense. And yes, the ending may be a cheap stunt at showing off owned properties, but that didn't stop me from enjoying the hell out of it. When I can see King Kong, Gremlins and Scooby Doo line up to watch the Looney Toons play a basketball game, you think I'm NOT going to have a good time...?!",
            "review_date": "2022-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's not nearly as good as the first one ",
            "review_date": "2022-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don’t watch if u want to keep your sanity ",
            "review_date": "2022-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's trying to be politically correct by casting a whole cast of people of colour. And it almost seems like they Focus more on that then actual movie making. That does sound very racist but it's true I love black actors and actresses I love Indian actors and actresses infact I love everyone equally.  We're just doing something to make a political stance and ruining something that could have been good is pointless. Then again the original is not going to be stored in the Smithsonian it was just average entertaining as a kid that's about it,it's not one of the films I've re watched ever. This version was painful",
            "review_date": "2022-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's space jam so haters if your reading this, you guys aren't people that I love. Y'all are horrible people for hating lebron, lola bunny's bunny look, everything 😡 Y'all aren't people 😠 I enjoy this movie and I'm a huge lebron james fan ❤ I give it 100 out of 100 ❤❤",
            "review_date": "2022-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn’t see the first movie and only half here. Enjoyed lebron , the premise and of course the Loney tunes characters. ",
            "review_date": "2022-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best of LeBron James!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! LOL",
            "review_date": "2021-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Corny, nowhere near as good as the original",
            "review_date": "2021-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After a few minutes, you clearly realize: 1) LeBron has not the same personality as Jordan; 2) the initial premise is even more absurd than in the first Space Jam; 3) trying to create a heart-feeling plot diminishes great part of the comedy; 4) great part of the Looney Tunes characters are denaturalized and out of their element. I have not finished the movie, but the perspectives didn't stimulate me to continue.",
            "review_date": "2021-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I very love Zendaya as Lola Bunny & Lebron James!",
            "review_date": "2021-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought the movie was stupid.",
            "review_date": "2021-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original Space Jam is obviously an advertisement, sure, but it still top lines as a Looney Tunes movie. This, above all else, feels like a motion billboard for HBO Max with a runtime that overstays its welcome by about a half-hour.\n\nWarner Bros seems to have used this as an opportunity to chase what makes Fortnite a fun experience but by being entirely hands-off it takes away from what gives that game its sandbox magic. Added to that, the story in Space Jam: A New Legacy is straight up Hook. A villainous character kidnaps the child of its adversary and pretends to support their interests to turn them against their father. LeBron James is Peter Pan and Bugs Bunny is Rufio.\n\nIt's not entirely surprising, considering both the director and cinematographer left due to creative differences with the studio after filming had already begun - one could assume they wanted to be creative - and roughly thirty people ended up touching the script. Another case of \"too many cooks,\" it's so over-saturated that it became bland. Mixing every color of paint will end up neutral no matter how much heavily contrasted neon accents it.\n\nGratuitous background usage of Hollywood Boulevard-esque takes on characters when you're inside of WB's IP universe is one thing but who are some of these old gag references for? Why is there a U Can't Touch this break? Was that from a draft of the Tony Hawk or Jackie Chan sequels that never came to fruition almost thirty years ago?\n\nI do appreciate the Friday Night Lights reference, so props to that, but I'm also thirty-six.\n\nLooney Tunes has a history of referencing older media but what's happened here is more like Family Guy's \"This reminds me of...\" breakouts rather than reverence and homage to things that, at one point, were contemporaries of Looney Tunes. Their brand-loyalty was also self-aware, making fun of themselves instead of looking at the WB water tower and placing their hand over their hearts, which is how I saw the characters in this movie.\n\nSpace Jam: A New Legacy could have successfully tapped into nostalgia with sincerity and heart but its rehashed and half-hearted story, off-the-mark references, and gluttony of \"Hey look at this show! And this movie!\" end up resulting in more of a brick than a slam dunk.",
            "review_date": "2021-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had a bad feeling about this movie being bad. I wish I was wrong",
            "review_date": "2021-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you like advertising and commercials you'll love this movie",
            "review_date": "2021-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a pretty cool sequel.",
            "review_date": "2021-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A mediocre movie, it copies directly from the original and feels empty, without any joke or chemistry.",
            "review_date": "2021-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LeFlop James' acting is pretty bad in this one. On a serious note though, this could have been a great movie but there was nothing interesting whatsoever about the father-son dynamic.",
            "review_date": "2021-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Doesn't know anything about tech. It is a flippant fantasy. Original Space Jam worked because it didn't try to play on things that were fantasized about. Sitting here fantasizing about computer tech. Complete insult to my profession. What could they have done to make this movie better, perhaps the aliens from the first one left tech behind that created did some crazy bs. Worse than spy movies swiping around on a touch screen.",
            "review_date": "2021-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really really love it ",
            "review_date": "2021-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The visual was perfect\nlove how they upgrade all Tunesquad",
            "review_date": "2021-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A huge commercial that the less it serves to pass the time, although lost in the own rules of its universe, you do not want more than to see only the Looney Toones, unfortunately there is little of that.",
            "review_date": "2021-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Movie is so Good that I Bought The Dvd",
            "review_date": "2021-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Meh... this movie isn't terrible, but it's not good either. I felt literally nothing watching it. It's just meh.",
            "review_date": "2021-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Move over Tom and Jerry! LeBron James and Bugs Bunny are the real players.",
            "review_date": "2021-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible movie and even worse it the commie that ponders to China which is a horrible actor is in it. There is only one space jam and it has Michael Jordan in it. LeBron can't carry Jordan's jock strap.",
            "review_date": "2021-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is possibly one of the worst every things ever done. I am sad. I am bored. What a waste of opportunity. But again, acting is a craft, and when your lead can't act, everything else suffers. Oh and this was suppose to be about looney toons and basketball right...or at least it use to be.",
            "review_date": "2021-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When I first heard this movie was being made I got excited. About a week before it came out I pulled out the original space jam to watch with my kids with with plans to watch this together also. What a disappointment A New Legacy was. Lebron was so so bad. This man needs to get people around him that will tell him no, don't do it. Jordan wasn't the best actir either but at least he had charisma on screen. Even Don Cheadle couldn't save this.",
            "review_date": "2021-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "La mope is always passive aggressive and building his brand. He can play ball.  Acting, politics and a thing else is just for the cash.",
            "review_date": "2021-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst movie of the year. Unfortunately I can't give zero stars",
            "review_date": "2021-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The two most common critiques of this movie I see are \"LeBron's acting ruins the movie.\" and \"How can LeBron be pulled into a server? It makes no sense.\" Must I remind you how Michael Jordan made it to Looney Tune land in Space Jam? He was pulled into a golf hole. It's significantly more realistic that somebody's conscious is transmitted digitally than being pulled into Looney Tune land through a golf hole. Since when did realism dictate whether a children's movie is good or not? Secondly, yes, LeBron's acting is mediocre, but so was Michaels. In fact, I would argue that Michael's acting was even worse. People are letting nostalgia and bias blind them from another fun movie, that doesn't quite capture what made Space Jam so memorable, but makes a good effort and comes close.",
            "review_date": "2021-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Space jam: a new legacy\n\nBefore seeing this, I'd already heard about how it was reviewed badly, most probably why I decided to see the 1998 movie first so I could see how much it tanked in comparison. But, surprisingly, I enjoyed this way more than the first movie💀. Definitely not without its flaws, but it had a more simplistic and consistent plot compared to the first movie. It isn't a sequel that was needed, but since it's been made, it's not a sequel that shouldn't exist. LeBron James is also a better actor than Michael Jordan.",
            "review_date": "2021-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The main star of the movie was consistently Money. How much money can WB show off. Lebron James Sr. was overhyped in his acting ability. Space Jam was the Red Carpet for Michael Jordan back into the NBA after losing his dad. Space Jam 2 was the Red Carpet for advertisements and WB to show off it's money. The animation was good, but the reasons for their explanations were off-putting or just all around confusing and unneeded.",
            "review_date": "2021-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Repetitive and tacky. Catering to the masses to glorify James",
            "review_date": "2021-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was the first movie that I saw in theaters since Jumanji: The Next Level. It contains a lot of cameos, references and characters based on other Warner Bros. properties. This is a really great film and it has a combination of live-action, animation and GCI.",
            "review_date": "2021-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Warner Bros. spent $150 Million on this showcase circle jerk disguised as a film. In better hands (and not as many writers) Space Jam: A New Legacy could have been a smart satire that wasn't, at times, an assault on the senses. Yet here we are.",
            "review_date": "2021-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible. A massive 2 hr 30 min ad for Warner Bros. A massive waste of time. I wish I could un-see everything I did see.",
            "review_date": "2021-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is actually terrible. Don't waste your time. It feels like a huge commercial with an exorbitant amount of product placement and just terrible writing. I would say it's on the level of the emoji movie. Just an embarrassment to cinema in general.",
            "review_date": "2021-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was a pile of garbage from trailer to credits. It's funny how they try to blame \" pandemic- era\" for the severe drop in attendances after the first week. 31mil opening week to a 69% drop the next week. Hahaha.So what people were okay to go to the theaters but a week later the pandemic stopped them from returning or new people showing up? Yeah good try .That 69% drop in one week just means people saw this horrible waste and word got out that it was a waste of time and money. James being the 100% reason why. MJ was a positive role model that everyone from fans to people that hated sports could respect. He was the greatest there ever was and will be. His charisma and likability made that movie wonderful. He never built himself up, gave respect to his teammates and fans, and never actes like he was anything other than a player in a team. Unlike LeBron.. James is a joke. Couldn't act to save his life. Arrogant. Egotistical.Over paid joke. It's said to think this generation of kids have such a bomb to call theirs, but atleast they can re watch the better original.",
            "review_date": "2021-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Barely a movie, Don Cheedle gettin money",
            "review_date": "2021-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you are watching Space Jam you kind of know what you are getting into.  This is an ok story, but tries very hard to pull at some heart string which in the end just becomes annoying.  The storyline is predictable and stupid, but that isn't why you watch this film.  You watch it to experience the Loony Tunes.  And that you get a chance to do.",
            "review_date": "2021-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the worst sequel I've ever seen. None of the magic or heart of the original. What a disaster.",
            "review_date": "2021-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first but better than expected. The plot was interesting and the message even better. Longer than it needed to be and corny at times. (65%)",
            "review_date": "2021-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bland, Cash-grab with nothing to take away from.",
            "review_date": "2021-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That was awesome! It was best basketball battle and best easter eggs with TV show and movies!!!",
            "review_date": "2021-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Chungus tho 😳\n\n31 Jul 2021",
            "review_date": "2021-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dunno what critics are talking about, I liked this movie.",
            "review_date": "2021-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Space Jam The Second",
            "review_date": "2021-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Completely awful! From Labron's flat acting to questionable inclusions. This movie is terrible! Especially looking at all the fuss they made over Pepe la pue and Lola bunny yet had the utter tone deaf obliviousness to include THE DROOGS from A Clock Work Orange! Hypocrite much!!!",
            "review_date": "2021-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a great movie. LeBron James doesn’t come across as a credible actor. Most of the jokes are not funny.",
            "review_date": "2021-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i hate space jam 1 and 2 they both sucks and i agree with the nostalgia critic said it's evil corporate crap and what McDonald's and toys and clothes and towels and feeding kids with stupid merchandise with moneybags and the looney tunes are annoying  and no micheal Jordan  the basketball star player and what we got micheal b Jordan really also don cheadle really and warner bros never hires  lebron actual family and we actors this movie sucks with nostalgia critic and the angry video game nerd  hates bugs and spacejam but  the critic himself love looney tunes and basketball oh i forgot no pepe le pew",
            "review_date": "2021-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My rating: 29% \"Space Jam: A New Legacy is visually appealing, but is ultimately bogged down by forgettable performances, unfunny humour, and an abundance of Warner Bros property advertising.\"",
            "review_date": "2021-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow this movie was boring. The only time I actually laughed was at that Michael B. Jordan joke, other than that, it was a chore to watch this movie. Also the acting was not good, and funny enough it wasn't even Lebron James' fault.",
            "review_date": "2021-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The sequel to the famous sports comedy Space Jam, but this time it's basketball player LeBron James who enlists the Looney Tunes to win a basketball game against the avatars led by a deceitful artificial intelligence named Al-G Rhythm and rescue his kidnapped son from a Warner Bros.-themed virtual multiverse. To be fair, the incredibly predictable plot is not very innovative and is actually rather cliché, but as a movie lover, the Warner Bros property references and Easter eggs were the most entertaining part of the movie, because there are so many of them. The use of each of the Looney Tunes was very brief and it feels the movie is just a big commercial for the production company. Very good graphics!",
            "review_date": "2021-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While there are other more enjoyable films this year gave us, Space Jam A New Legacy is still a nice fun movie with a few funny moments.",
            "review_date": "2021-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lebron James is just an awful, coward of a human being. He has no appeal, unless of course you're a mindless PC automaton that likes him because you're a willful tool of the establishment. At any rate, a film with this guy was ridiculous in idea, and now we see also ridiculous in execution. Ugh this is awful.",
            "review_date": "2021-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe Space Jam, New Legacy is a disaster, but they bring us a fun basketball game for everyone, especially when you see the amazing world of warner",
            "review_date": "2021-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can I call it a remake? While its truth that Warner Bros need a new way of earning. \nHow come Disney's earning is rising, they don't mind to have new characters. WB still using their old school classic. \nBack to the movie, is a family movie with pass level.",
            "review_date": "2021-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Something is wrong here. How can the audience score be so high when so many of the reviews are bad?",
            "review_date": "2021-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It’s like they tried to make the worst film possible, and somehow have succeeded in doing so - the fact they were aware of that makes it so much worse and soulless. At least some good actors like Cheadle, Howery, Silverman Yeun got some decent paycheques, (and honestly Cheadle elevates the film every time he’s on screen), but wow. This is so beyond bad. ",
            "review_date": "2021-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A big disappointment.\nThis movie was such a mess but so entertaining.\nright off the bat Ill say the best thing is Don as Al G but the movie itself is literally just a giant commercial for their other films. This movie cant go 5 minutes without  a reference to another movie. theres Austin powers, harry potter, DC superman, wonder man, iron giant, king kong, etc. Theres also references too Game of thrones and Matrix even though they are rated R and this is a PG film. My next problem is that this isn't even basketball. Its literally videogame. All in general its a terrible but entertaining movie. I guess you can say its a \"so bad its good' movie.",
            "review_date": "2021-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like this movie, but I understand why people don't like it. It's way better than The Paw Patrol Movie of course.",
            "review_date": "2021-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This \"movie\" wasn't actually a movie at all. It was just an hour and half of references to various WB properties. (seriously, Family Guy would be embarrassed to do this many references in a row, they introduce each Looney Tunes as shot-for-shot remakes of scenes from other movies)\nShould've called it \"Warner Bros Owns Every Property in the World: Featuring Space Jam\"\nDon't waste your time unless you want to see 90 minute advertisement for HBO Max while some Space Jam knockoff happens in between verbatim references",
            "review_date": "2021-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow! Simply fantastic. \nLots of people will review this from an adults perspective. I saw this movie with my kids in the movie theatre and it took me right back to being 8 years old. I loved every minute on this movie and would recommend to anyone!!!",
            "review_date": "2021-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie sucks Lebron’s acting sucks and the loony tunes get only like 15 minutes of story time in the movie.",
            "review_date": "2021-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "couldn't even finish it. LeBron is one of the greats, but he isn't the GOAT. this movies was an air ball.",
            "review_date": "2021-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Half a star because I couldn’t give less. Terrible movie!!! ",
            "review_date": "2021-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good nostalgic movie that uses a like of Warner properties. ",
            "review_date": "2021-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Refuse to watch it. Spacjam the original is a masterpiece and a work of art compared to this. Its just a money grab... sorry warner. Its a no from me.",
            "review_date": "2021-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's an \"ok\" movie. Of course, viewers already had in mind what would happen. But, the first movie is still the best in the franchise.",
            "review_date": "2021-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is some sick obsession with remaking or adding sequels to movies that on their own were fine on their own, a shallow and somehow even more campy version of its predecessor, Lebron's acting is uninspiring even more so than Shaq or MJ, with the movie's main attraction being nostalgic and featuring a big superstar it falls short with dry acting and even worse animation.",
            "review_date": "2021-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lebron James may not receive awards for \"best actor\" but \"Space Jam: A New Legacy\" tries its very best to get too silly with its hilarious humor even if it uses overuses many IP portfolios from Warner Bros.",
            "review_date": "2021-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Offensive for the spectator",
            "review_date": "2021-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Space Jam: A New Legacy was such an amazing and awesome movie. Fun and entertaining for the whole family and action packed. We loved that movie so much and definitely a must see.",
            "review_date": "2021-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "DO NOT LET YOUR KIDS WATCH THIS MOVIE! Some movies are harmful for children due to adult content, vulgarity, etc. This movie is arguably even worse for them because of how willfully stupid it is! If you let your kids watch something this stupid you risk making them as stupid as this movie. DO NOT LET YOUR KIDS WATCH THIS MOVIE!",
            "review_date": "2021-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I give it 10/10 because I love how lola bunny become a strong character and I love how Lebron James meet Bungs Bunny in Tunes World.",
            "review_date": "2021-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Space Jam, a new legend plays humor. Those who wonder how movie studios develop movie ideas, there may be an answer. This movie really visits Warner Brothers movie studios & meeting room. Also, the movie 'remembers' the first Space Jam from 1996.\n\nCharter drawing styles change different parts of the movie. Also, movie law is found inside. Great movie to go watch, this isn't only for kids. Watch original English version is best.\nVisiting different movies is a nice  Who Framed Roger Rabbit reference can be detected. Even Disney references and many more found.  Will we see the next Space Jam movie ?\nMovie has potential even for that.",
            "review_date": "2021-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fun that's all.i wanted. that's what I got",
            "review_date": "2021-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic! Better then first Space Jam! Everyone hates it though!!!!!",
            "review_date": "2021-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I found this to be an incredibly long movie, but that's at least half my fault. I went to see it at a drive-in theater with our 2-year-old in tow because the place had a playground and a business model of showing a kid's movie first and then an adult movie past when they would likely fall asleep. It worked for about 30 minutes, but then I learned that I was supposed to keep the car engine running or else the a/c would kill my battery. The car died and managed to play sound out of the radio for about 10 more minutes before we were stuck listening to the last ~hour of the movie through a distant speaker while we sweat in the car and the kid became fussy. Granted, I had went into this expecting a brisk experience since the first Space Jam had came in under 90 minutes; I didn't know this was almost 2 hours long when we started. Anyway, Bron's acting was no better than Jordan's was but there was a lot more obfuscation available with the improvements in animation over the last 25 years. There was far less comedy and I didn't like any of the videogame aspect at all; they treated this like a remake rather than a sequel, but didn't respect the original enough to realize what had worked well the first time. It wasn't a complete waste of time, and it wasn't the worst sequel to a beloved original I've seen (that would be Zoolander 2), but the room for improvement was massive here.",
            "review_date": "2021-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was sadly not on board with this film as a few others are. Not only was it unnecessary, but it felt like a product placement of warners licenses then just a loony tunes nba film to sell toys and merchandise. To be honest, the loony tunes were the best part of the film. Villian was weak, Lebrons acting was so blank. And the fact they had to make them 3D is just a spit on 2D animation. If you're into cringe references and jokes. This is for you.",
            "review_date": "2021-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring. Bloated, and takes itself too seriously. This new Space Jam is leaving no legacy.",
            "review_date": "2021-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has a lot of characters that are just there to promote their digital platform that could have added a little to the story. Not to mention boring story, bad jokes and bad acting.",
            "review_date": "2021-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This review contains spoilers.\nI have neither grown up nor idolized the first chapter back in 1996. And indeed, I already knew that I would not see the new Zootopia.\nBut if there is one thing that has kept me away from the film until then, besides the Italian language, it is the bad reviews given to the film. And after having seen it in the original language, I will tell you, many are absolutely justified.\nThe film features a MASSIVE presentation of the brands held by Warner in sometimes suffocating and blatantly propagandistic quantities. It is not that I did not appreciate the cameos, for heaven's sake, but they are just cameos without real substance and usefulness.\nSpeaking instead of the plot, it is in fact the first space Jam, with only small tricks such as the fact that this time it is the ptotagonist who is looking for the Looney Tunes and not vice versa. Tricks, however, that give more meaning to the plot. But let's not deny that the father-son relationship is one of the most predictable and clichéd things I've ever seen in similar contexts: there is no outlet for originality or deviation. Moreover, the near-death of Bugs does not work, since we are talking about immortal brands.\nThe acting skills leave a lot to be desired: LeBron is clearly seen that he is not an actor and his expressions are plastic.\nThe jokes are funny, but only in part: some are based on pop culture that has already aged or will soon get old.\nBut now let's move on to the more positive sides of the film: the animations are spectacular and brilliantly mix live action, 2D animation and CGI. I also have to say that I really admire the Looney Tunes design in CGI and honestly I would have liked to see them more like that.\nThe references in the middle are great and for the most part funny.\nMy take on this film is almost identical to Sherlock Gnomes: both are undoubtedly bad films, but they have redeeming qualities that make for decent experiences.\nIn general, the film has poor writing, acting skills that define skill is overkill, and a noticeable cash back on Warner products\nBUT\nnevertheless, it is fun and the animations are among the best seen in recent years.\nIf you are a fan of the former, you will surely love it. And that was all Warner cared about.\nWith top animations but mundane and weak story, Space Jam: A New Legacy is okay",
            "review_date": "2021-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I adored this movie with my whole entire heart! That last half a star was only left out because I am well aware a lot of my love for this movie is nostalgia fueled. But, if you are a fellow lover of Looney Tunes, this is a stellar movie to watch. Even if you aren't, it's still a ton of fun! The movie itself looks wonderful- all of the colors, animation, and CGI are beautifully done. The soundtrack of the movie is insanely good, pulling you into the movie, setting the correct mood, and overall just being a collection of really good songs I could not help but have on repeat weeks after watching the movie. Considering who the main cast consists of, its inevitable that there's a few not-so-well acted scenes, but those take up barely any time compared to a lot of the other really good scenes. The humor is also great! I died of laughter, and could still list them out laughing if I weren't trying to keep this review spoiler-free. Overall, go watch it! You, your kids, your family, your friends- it's great for all!",
            "review_date": "2021-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Do yourself a favor and watch something better. Like The Room by Tommy Wiseau.",
            "review_date": "2021-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1h 55 mins of pure and shameless product placement, just awful. Save yourselves about 2 hours of your life and go watch another thing.",
            "review_date": "2021-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really enjoyed watching this movie with my son he liked this movie as well we  would go see it again.",
            "review_date": "2021-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The beginning was boring. The ending was the best. Wish Michael Jordan came out.",
            "review_date": "2021-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was just one 90min product placement the for Warner Brothers.  It felt like the worst aspects of Wreck-It Ralph 2 we're just made into one big movie....if you could even call it a movie.  The only good thing I can say about it is that the sound design isn't awful.",
            "review_date": "2021-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lazy story, just flashy cartoon characters with simple one liners. So, Space Jam 2 is the joke of an attempt to cash in on a name and give the audience nothi g in return.",
            "review_date": "2021-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lousy anthropomorphic characters from the past, and the current biggest A-hole in the NBA, perfect combination for a crap movie.",
            "review_date": "2021-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While bad, they tried. This was less a Space Jam movie and more a Warner Bros love letter to itself.",
            "review_date": "2021-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wah wah... not good for anyone older than 12",
            "review_date": "2021-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies I've seen in a long, long time.  The message of \"be yourself\" or \"be who you want to be\" as a 10, 11, 12 yr old kid is terrible.",
            "review_date": "2021-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pathetic. Doesn’t hold a candle to the first Space Jam. Another loss for lebron. ",
            "review_date": "2021-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent movie with a good plot but really it was just a big commercial for all of WB’s properties. Still good though. ",
            "review_date": "2021-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not nearly as good as the first. they did things to make you not care and it just didn't work. ",
            "review_date": "2021-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie for young kids, and even for their grandparents.",
            "review_date": "2021-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didnt like the movie at all",
            "review_date": "2021-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its like Lebron James and Warner bros jerked each other off and what ever landed on the sheet was jammed into this movie. The terrible combination of Lebron trying to prove he's as iconic as Michael Jordan and Warner Bros trying to convince everyone they are as good as Disney ended with me losing respect for both of them.",
            "review_date": "2021-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a glorified vanity project from a studio and an athlete who neither respects the property they were handling nor the audience it was intended for.",
            "review_date": "2021-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Time changes but Bugs never changes",
            "review_date": "2021-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yet another attempt to pass off LeBron as somehow being like MJ.  Here's a hint LB, if you are constantly comparing yourself to MJ - you aren't MJ.",
            "review_date": "2021-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WHY...was this movie made in the first place..",
            "review_date": "2021-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not sure why this is getting such hate. The movie is fun and entertaining and not at all the bad movie that people are claiming it is. Too many characters to count which all work out nicely. Fun and entertaining to the end.",
            "review_date": "2021-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i have to give it a 1/2 star only because it won't allow me to rate this crappy pointless unentertaining crap movie a 0...LeBron's acting was straight trash and i'm glad i didn't actually pay any money by not seeing this movie because i watched it on HBO MAX and LeBron should stick to playing basketball and never act again",
            "review_date": "2021-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The script could use some work, but the message this movie gives and what LeBron has to go through to learn it makes it worth watching, as are many of the WB cameos and Easter eggs. So basically, it's almost better than the original.",
            "review_date": "2021-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didnt like the thought of Lebron being in this movie, nor am I a fan of his. There IS a LOT of advertisement throughout the movie, but the movie wasnt so bad. After this movie, I gained respect for him. He is paving his own way, and I dont think you can ask for more. I gave it a 4 out of 5 simply for that fact. I would recommend seeing it. Hope you enjoy it!",
            "review_date": "2021-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "terrible live action, cartoon part was great, script written well but poorly executed ",
            "review_date": "2021-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a waste of time, honestly.",
            "review_date": "2021-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is not as enjoyable as Space Jam1. It is over packed with all WB characters but no adventure. I expected to see more basketball for example. The villain is overacting the whole movie. The only fun part for me when Micheal B Jordan appears.  Maybe it's fun for kids.",
            "review_date": "2021-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a missed opportunity for fun and with access to so much WB IP this movie smacks of being killed in committee. Parts seemed not at all suitable for kids (the Mad Max scene and the clown from IT spring to mind) but my major issue is how formulaic and boring it was. I think my kids laughed once and that's a maybe. It was a movie length ad very poorly made.",
            "review_date": "2021-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A decent and fun time for the kiddies whose eyes widen with joy every time they see an animated cartoon and two hours too long for the rest of the audience. I wasn't a huge fan of the first Space Jam but Space Jam: A New Legacy only worsens my previous opinion, the voice actors of main Looney Tunes icons being the few positive aspects of the film. Lebron James is a beast on the court but needed to bring more character to the film. It is not the most horrible movie to exist but it is definitely forgettable.",
            "review_date": "2021-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I went to the theater to see it and I excepted funnier based off the trailer. was not as good as the first one. ",
            "review_date": "2021-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daughter didn’t like it, it was boring for her.",
            "review_date": "2021-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie was action packed and held my 6yr and 9yr old grandsons attention. The movie had a great message of love and never giving up",
            "review_date": "2021-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved the Looney tunes but first part of movie sucked.",
            "review_date": "2021-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun movie that the whole family enjoyed.",
            "review_date": "2021-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The sequel is okay to watch twice as first, but I don't think it's as good as the original Space Jam.",
            "review_date": "2021-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lebron James worse actor of all time no joke.",
            "review_date": "2021-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun for kids and lots of nostalgia for adults.",
            "review_date": "2021-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Space Jam: A New Legacy\" attempts to add layers to its otherwise simple story with a deeper plot, but ultimately distracts itself with its overuse of available intellectual properties and flashy visual effects.\n\n-Movies DECODED (YouTube)",
            "review_date": "2021-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though entertaining with its many gags and gimmicks, the film contains an unsettling amount of both racial and cartoon stereotypes, that audiences may feel uncomfortable with witnessing. Regardless, the movie is uninspired, though will likely entertain its target audience.",
            "review_date": "2021-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would never watch this movie again it was not a good movie. Lebron acting was horrible and the story line was not that good. The only character i liked in the movie was bugs bunny and he is a cartoon charter. I will give them one star for trying. The first space jam was way better I would go watch the first one if I where you.",
            "review_date": "2021-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cool Basketball Game For Looney Tunes ",
            "review_date": "2021-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like this movie because of LeBron James he is my favorite basketball player. and the reason I don't like\nthis movie is because some things don't make \nsense even if this movie has a lot of special effects\nit does not make it a good movie. and one of the \nPart I like is the scene with Rick and Morty. but this\nmovie is at least watchable.",
            "review_date": "2021-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's very rare that I would agree with critics on a seriously bad movie but I'm stunned on how 80% of the audience thought this was worth their 2 minutes to watch because this movie was just a shallow infomercial catalog of the Looney Tunes and yet another woeful attempt of LeBron James mirroring himself to Michael Jordan which he will never be anything remotely close to achieving. As far as the movie goes, it feels forced and takes itself too seriously, which makes it a bore to watch. At least the original Space Jam 25 years ago knew it was gonna be a cheesy flick so it had a comedic charm to it, something that is obviously missing from the sequel. It's so bad that not even China wanted any part of it and LeBron did all that kowtowing to that country only for his movie to get rejected by it. It couldn't have happened to a better person.",
            "review_date": "2021-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing too amazing but with stellar animation and a neat cast of characters, space jam 2 is a good time with family.",
            "review_date": "2021-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Warner Bros. went all the way with this movie. I loved it.",
            "review_date": "2021-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Grand kids loved it!",
            "review_date": "2021-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Do you know movies bad when your kid asks you to get out of the movie theater",
            "review_date": "2021-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was funny and very entertaining.",
            "review_date": "2021-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a movie that's meant to be funny I didn't find it very funny they should have never called it space jam as it is nothing like the original.",
            "review_date": "2021-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All of the IPs in the world can't save this travesty, and the movie knows it. If anything, it elevates Jordan's \"Toon Squad\" and the \"Mon-stars of \"Moron Mountain\" to legendary new heights, proving once and for all that no one can ever be like Mike.",
            "review_date": "2021-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched this with my kids and had so much fun! Very entertaining from beginning to end. Definitely a family favorite!",
            "review_date": "2021-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not remotely as good as the first one. ",
            "review_date": "2021-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "𝘚𝘱𝘢𝘤𝘦 𝘑𝘢𝘮: 𝘈 𝘕𝘦𝘸 𝘓𝘦𝘨𝘢𝘤𝘺 is far from a success, but isn't as bad as people are saying. The plot? Dumpster fire. The acting? Meh, and Lebron James was as bad as we would expect. What made me give such a high score to a movie that my dad claims assaulted him was how fun it was to watch. I loved all the easter eggs to other Warner Bros films and the original 𝘚𝘱𝘢𝘤𝘦 𝘑𝘢𝘮! The effects were pretty awesome and the movie was creative if you don't focus on the unoriginal plot. Even though the opening credits is the best part, 𝘚𝘱𝘢𝘤𝘦 𝘑𝘢𝘮: 𝘈 𝘕𝘦𝘸 𝘓𝘦𝘨𝘢𝘤𝘺 isn't that bad, and is actually quite fun if you don't take it seriously.",
            "review_date": "2021-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Space Jam : A new legacy (C-) Critics were wayyyy to hard on this film. It is a good time and honestly one of the better family films I have seen for a bit. In my opinion about as the original.. that one just has nostalgia. It's not amazing.... But not awful either.",
            "review_date": "2021-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awful acting, stupid plot. Just trying to cash in on the old film and merch.",
            "review_date": "2021-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is literally a 2 hour warner bros commercial, they simply used this \"Movie\" to promote each and every product that they offer.",
            "review_date": "2021-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just like some most actors aren't meant to be athletes, most athletes aren't meant to be actors.  Sorry LeBron James...stick with playing ball.  That said, \"Space Jam: A New Legacy\" is really only good for one thing: Promoting it's star.  This film is little mire than out and out hero worship.  Every few minutes someone mentions how James is the greatest athlete on the planet.  Was this adulation in his contract?  All  that aside, the plot is really bad. Bugs Bunny and the rest of the Looney Toons have none of the wit and humor that made them a childhood favorite.  But, alas, they are only there to use the Space Jam name and to reap praise upon its star. Pretty much a waste of decent animation.",
            "review_date": "2021-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a bad movie, not a great movie. Just have fun with it.",
            "review_date": "2021-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The one star is for Don Cheadle. This movie blows chunks. Lebron is a peanut.",
            "review_date": "2021-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good characters, but it has some questionable language. All in all it was a good movie and the kids enjoyed it.",
            "review_date": "2021-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is more enjoyable than critics say it is. But there are two problems: its emphasis on world building, and its whiney Siri-type villain",
            "review_date": "2021-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "About half way in I turned off the television",
            "review_date": "2021-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The bar was set so low from it's predecessor that I came into this film quite unenthusiastically.\n\nAptly named \"A New Legacy\" this film is clearly a G rated product intended for parents to take their children to see. The plot is structured around classic familial themes and leans heavily on a \"video game\" premise to cater to the smart-phone generation. However it's also disturbingly obsessed with flaunting WB's many owned IP's.\n\nI don't know if drowning the audience in referential humor and cameos was the way to go but I guess you can argue WB literally is the only company that has the right to do it, so why not?\n\nA lot of reviewers argue it diminishes and pushes back the Loony Tunes cast but if you actually watch the film it's pretty obvious they don't. Bugs and friends are constantly asserting their personality and putting their own whacky or zany context on other IPs. I would even argue they play a bigger role than the original where Roadrunner didn't even get screen time on the court.\n\nI think the only huge missed opportunity of the project was not making Bill Murray the main antagonist (Al-G Rhythm), that would've been golden.\n\nSpace Jam: A New Legacy is good enough, it's visually engaging (classic 2D animation is great and the 3D is up to industry standards), the story is a serviceable family themed narrative and it's at least interesting to see the Loony Tunes cast trounce around in the world of WB owned IPs.",
            "review_date": "2021-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was kind of disappointed and felt that it could’ve been better. I know it’s a kids movie, therefore very cheesy, but there are so many kids movies out there that are excellent. This wasn’t it. ",
            "review_date": "2021-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the original, but still good and worth a watch.",
            "review_date": "2021-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "space jam a new legacy is worth a watch but in comparison to its predecessor its a crying same\n\n- the story- the story was quite lacklustre not bad necessarily but its clear the spent way more time and money on including pop cultural references rather than developing the story properly. the stories main issue is that it focuses on getting the loony toons in pop cultural situation like Lola in wonder woman and Taz with Rick and Morty, if they had just left them all in toon town this would give more time for a better more well fleshed out story.\n\n-characters- the main villain Don Cheadle as al g rithim  was one of the few good characters, as a villain he was a cartoon villain but had more depth than the main character of LeBron who was in fact a bland character, there's very little reason to care past basic human decency matter of fact i sort of hated him at the start he was a cantankerous old fart of a father who was pushing his own dream on to his kids despite him living his own dreams. the loony toons again were boring not being loony in any real extent till the end of the film.  \n\n-over all- despite the overall negativity of what i just wrote would still watch it if its on any steam services on the near future. while the story was bland it wasn't bad there was a reason for it to happen in universe and the rogue AI element was done well, in addition to that none of the loony toons acted out of character for there character it just expects you to have seen the original cartoons. I would say if you have some extra change and you have a while to spare its worth a watch but don't go out of your way to see it.",
            "review_date": "2021-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I LIKE THE MOVIE  JUST THE BEGGINING WAS KIND ODD  BUT OVERALL GOOD",
            "review_date": "2021-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stick with the MJ version.  That guy had it right.  LeBron wasted your money.  MJ was the right man for the job in the original!!!",
            "review_date": "2021-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was bad. And by bad, I mean BAD. This move does not live up to the original at all.",
            "review_date": "2021-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "About as terrible a movie could get, can't beat the 90's original. Lebron doesn't have the Jordan magic.",
            "review_date": "2021-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really? Could they have found a worst lead actor in the world. Horrid everything, especially want's his name... ",
            "review_date": "2021-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All over the place... but not in a good way. Not funny, really boring.",
            "review_date": "2021-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a perfect family movie!!",
            "review_date": "2021-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent movie trying to lead good morals. 82%",
            "review_date": "2021-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyed it way more than I thought I would. First of all, the story makes sense. The acting is way better compared to the first one. There were some inspired moments in it came to few choices like getting the gang back together and the choice to make that part a 2D animated sequence. Later on in the movie, The 3D look of the looney tunes was also perfect & the fan service with all the Warner Bros. IPs wasn't intrusive at all but instead added a layer of enjoyment to the final game & best of all It made sense on why it was the way it was. The final match is just a spectacle to watch & enjoyable in every facet.  I really enjoyed the movie & hope there is a sequel down the road.",
            "review_date": "2021-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot is incredibly lazy and they should've just titled the movie \"Warner Brothers.\"",
            "review_date": "2021-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If lebron wasnt such a terrible human being IRL it wouldve have been so cringy",
            "review_date": "2021-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I definitely enjoyed this movie. It has some great moments becuase there are bunch of my favorite looney toon's characters, but story of this movie is very shallow and short. Lebron James acting is OK in this movie though.",
            "review_date": "2021-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you are looking for a nostalgic nod to the past then don't waste your time..... The original was nothing to brag about but this one truly sucks....",
            "review_date": "2021-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Space Jam a new legacy is probably one of the most disappointing movies of this year. \nThe movie tries too hard to give the viewer a serious plot, that nobody cares about, between James and his family problems with his boah Dom. This two get trapped on a digital space, by an evil rouge named Al-G, who has an evil plane for Mr. James. For reasons that don´t make sense at all, they´re going to play a basketball game against Ai-G, so LeBron will team up with the Looney Tunes gang.\nThe film didn´t offer anything new, everything is so cliché and predictable, the jokes are not funny, the final game it´s not exiting at all, actually LeBron and the Looney Tunes got no change against the Ai-G team, the Goon Squad (Ai-G´s team) teammates got incredible abilities , but for some reason they just use them like one time and despite the fact, the movie got the change to use other WB characters, like the Iron Giant or the mask, to make things a little bit interesting, the only use they gave them, was to be background ornaments.\nI don't understand why they even bothered, the first Space Jam movie wasn´t great (In my opinion) but, at least the people behind the film, knew what it was doing, it was a simple plot, and in a new Legacy they complicate the plot, they though that, just for the fact the movie will have popular WB characters (In the background), the film will be a succeed, but I gotta say that, despite the film is 2 hours long, it´s not a super boring movie.\nBut well it´s just my opinion.",
            "review_date": "2021-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LeBron James has zero charisma. Looney Toones are the best part.",
            "review_date": "2021-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Space Jam 2 is meh. It passes the time and it wasn't the worst thing I could have watched, however, it's the fact that it is literally a commercial for Warner Bros that makes it pretty pathetic. Not to mention Don Cheadle was in Ocean's 11 so how?",
            "review_date": "2021-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We loved it.. laughed a lot",
            "review_date": "2021-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a boring film with not much heart to it. The comedy doesn't always hit and some poor acting. Lebron is fine but story isn't good and the films basketball is horrible.",
            "review_date": "2021-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LeBrick should stick to flopping",
            "review_date": "2021-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just a bad movie, nothing like the first one.",
            "review_date": "2021-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not sure who this is for, some jokes land, while most don't, kids probably won't recognize Mad Max or Austin powers, and while yes it is looney tunes, it just doesn't have that charm that even the First Space Jam had, Watch the original movies.",
            "review_date": "2021-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great kids movie but also entertaining for the parents!",
            "review_date": "2021-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie with an awesome message for all parents to hear and a fascinating movie that captures the minds of most/all kids!",
            "review_date": "2021-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This two stars are only about the amazing visuals in this movie and the Easter eggs. What happened with me in this movie is that its good visuals distract you about the bad movie it is, and other thing that distract you from the bad movie this is are the Easter eggs.",
            "review_date": "2021-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From the sublime, to er, well, Bugs Bunny. Back in 1996, I remember being enthralled by Space Jam when I watched it on VHS. I was only six, and hadn't had the pleasure of seeing Who Framed Roger Rabbit (1988). Somewhat shamefully, I still haven't. But Space Jam was lunacy at its best, using Michael Jordan at the height of his powers to launch a film alongside the Looney Tunes. So why the need for a sequel twenty five years on? Well, twenty minutes into Space Jam: A New Legacy, the answer is obvious. ££££££££ for Warner Brothers. It may as well be called Warner Brothers: A New Legacy. It's a two hour advert for the company. LeBron James is the NBA star at the centre of it, and to be fair to him he does a perfectly fine job as the star, losing his son to baddie Don Cheadle inside the 'serververse' inside WB studio headquarters. Mad enough for you yet? At almost two hours, SJ2 is way too long, considering the attention span of the age group it's mainly aimed at, and it takes around twenty minutes to see a Tune on screen. Thankfully, once the Tunes are introduced, the film does pick up, it's fun just to see them on screen and some of them remain as amusing as ever. As we travel through various WB worlds to track down some of the tunes, including Matrix world, Harry Potter world, Metropolis (yes, really) one begs the question are Warner Brothers on the brink of some horrific collapse we don't know about? Or is it just crass commercialism of the highest order? We all know the answer. For the kids there is plenty to enjoy; presumably the plot that centres around a video game designed by James' son is to attract the millions of youngsters who spend all their free time glued to screens. But I did laugh several times; there's an excellent gag involving Michael Jordan towards the end that makes it almost worth it, and LeBron James certainly convinces you that he cares for his family, and that the reason behind all the mayhem is family. I believed that in a way you simply don't when Vin Diesel tries to persuade you of the same thing in the Fast & Furious films (that I'm a big fan of I might add). So it's pointless, it's crass almost beyond belief in its monetary ambitions, but there's enough in it that held both mine and my three year olds attention for two hours. Just.",
            "review_date": "2021-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie was fun, but L. James lacks the personality of M Jordan.",
            "review_date": "2021-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I although it was going to be bad without  MJ but yhey pull it off.  Nice story line, funny and entertaining",
            "review_date": "2021-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too confusing. More adults would understand the humor.",
            "review_date": "2021-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like that it was a family movie",
            "review_date": "2021-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "meh the movie was kinda good but it wasnt that good as the first space jam movie warner bros kept showing off they're properties they own so i give this movie a 3/10 the plot wasn't that good",
            "review_date": "2021-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked it, funny movie, love it. I recommend it, but it's not and will never be great as the original movie, this is only fun and animated modern version of movie original. I like animated movies , and wanted to watch it and I am glad to watch this movie, I liked the original ...",
            "review_date": "2021-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite Don Cheadle's best efforts, this movie only succeeded in being a 2 hour commercial for Warner Bros. various franchises.",
            "review_date": "2021-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "boring and no heart until the end but doesn't seem authentic considering how to characters are in this movie this movie is dog",
            "review_date": "2021-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is nostalgia mixed with current day special effects. LeBron is trying to save his son in a weird live action remake of Space Jam. The looney tunes effect is enough to keep you through the whole movie. I would say overall this is a 3.2/10.",
            "review_date": "2021-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Looney Tunes feel sidelined in there own movie to make way for a formulaic and predictable family drama plot that proves not all athletes are actors.",
            "review_date": "2021-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "love this movie basketball movies are awesome. ",
            "review_date": "2021-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Family Movie! The kids loved it! Jokes and references for the entire family.",
            "review_date": "2021-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don’t have much reference for space jam. But this movie really strokes James ego. ",
            "review_date": "2021-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wasn't really a fan of the original...until I saw this one.",
            "review_date": "2021-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I expected not only the dispute, but also the interaction of the WB universe with the game!\nI think there was a little lack of that!\nThe crowd was just an unimportant background!\nAs for Leblon James I thought he played a good role because he never acted in a movie!",
            "review_date": "2021-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie was okay.\n\nThis was a movie that continued to speak about importance of family.\n\nLebron wanted to be a good father and they constantly brought it up.",
            "review_date": "2021-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "IM JUST GOING TO SAY SOMETHINGS JUST NEED TO STAY ORIGINAL. BUT THE MOVIE WAS GOOD!! KIDS LOVED IT..THATS ALL THAT MATTERS",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lots of cartoon character cameos and humor.",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I went in with low expectations. Was way better than I expected. My 6yo and I enjoyed it immensely. Better than the 1st one.",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As an adult viewer it was okay. The grandchildren loved it ages 10 & 8.",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Story was good. But it felt like a cheap movie just trying to make millions off of product sales. No real commitment from actors or directors.",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wish there was a negative rating on this one - wow was it horrible!!  Felt like it was a WB promo movie reel.  LeBron should stick to basketball as his acting skills were terrible - and even though it was the whole story line just hated seeing a father treat his son like that. Loved the first one but of course Michael Jordan was a much more likable person - LeBron just isn't likable as all you see are his rants about political issues (that he clearly doesn't understand) or personal comments about how great he is - both of which you never saw Michael do.",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know what's worse, Lebron's acting skills or the overwhelming pieces of pop-culture cameos and references being forcefully shoved to fit into this movie alone",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie was great and seating was good.",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If cancer could be a movie this would be it",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought it was cute. It was definitely made for the kids of this new generation while paying homage to old Space Jam and WB entities. I'm not used to seeing Don Cheadle as a bad guy, but he was great Al G. Rithm! Definitely a movie the whole family can enjoy.",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked it so much but I wish Michael Jordan had only had one cameo.",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bugs bunny is a better actor than LeBron. The plot revolves around LeBron building another super team and leaving his fans again. LeBron is the goat at leaving g his fans.",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A little predictable, but still good. It was good to see old cartoon characters in the background during the game.",
            "review_date": "2021-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolut stupid movie. The „game\" is absolute crap and James is the opposite of an actor.",
            "review_date": "2021-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ready player one rip off and just too \"woke\"",
            "review_date": "2021-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It’s was fun watching it all for Comedy",
            "review_date": "2021-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Phenomenal film for all ages! Ignore the so called \"Critics\"!!!  The audience's opinion is the only critique that MATTERS!!!!  100% Fresh!",
            "review_date": "2021-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn’t like it at all. They should of kept the same story like and the first one. ",
            "review_date": "2021-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a fun movie!  Im surprised that I liked it so much. Stunning and bright visuals, very creative.  I only went to take the kids, and wound up enjoying it myself.  Plus, watching LeBron acting was great—he did a fantastic job.",
            "review_date": "2021-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was horrible all around, yes the original was cheesy, bad acting, but this was worse.",
            "review_date": "2021-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Plot is too often used in other movies. LeBron just doesn't have an interesting enough story, personally, to improve the narrative. Movie never should have been made in the first place. ",
            "review_date": "2021-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh my lord, first one was not great. This one is just awful. 79% fresh rating on this is comical..",
            "review_date": "2021-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really fun movie! I don't know why everyone's giving it such a low score. I think people just have fun hating anything LeBron does.\n\nIt's fun, is solid visually and the storyline's decent (could've been better, but also not horrible). There are certainly a few plugs for various things by both LeBron and Warner Bros in the movie, but I don't think they feel ridiculously unnecessary or out of place (ok, maybe the Nike swoosh in the ground was lol). \n\nOverall though, good film for the family. I just don't know if kids today really care about Looney Tunes. Is that show even still around for them to know the characters?",
            "review_date": "2021-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice attempt, bad execution.",
            "review_date": "2021-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great comedy/cartoon movie for the whole family",
            "review_date": "2021-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once again, LeBron falls short of Jordan's success.  The movie was horrible and got less of an audience than an NBA game - which is saying something.  I'm sure it will do better in China.",
            "review_date": "2021-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bad just plain bad. Its ashame as this could of been good. Labron James is terrible to match his real life persona. This guy should stick to basketball and stay away from movie and politics because he doesnt have the brain power to hold up",
            "review_date": "2021-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heard all sorts of bad things about the movie but none of them were true. It was enjoyable, family friendly and had excellent animation. LeBron isn't much of an actor but neither was MJ. Definitely worth a watch.",
            "review_date": "2021-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed it. It was awesome to see ALL characters that Warner Bros owns as the audience. Lebron is not Jordan. But if you let that go and don't take it so seriously, it is very enjoyable!!! I would watch it again",
            "review_date": "2021-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Space Jam 2 may possibly be entertaining if you are watching this with children, but if you are a fan of the first Space Jam and think this film will do as well, you would be wrong. Space Jam: A New Legacy does provide an funny and witty storyline mainly for the children, but the film fails to provide the fun, action and basketball that fans of the original film enjoyed.",
            "review_date": "2021-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lebron James sucks at acting",
            "review_date": "2021-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolute waste of time.  It's basically a 90 minute commercial for Warner Brothers.  LeBron James needs to give up his acting career.  The story is humorless and plodding.",
            "review_date": "2021-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ok doesn't live up to the original",
            "review_date": "2021-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It enjoyable. The movie not good at all, but I can say that I enjoyed a few bits in it. I think they did a good job at introducing Looney Toons to the new generation as this movie is intended for them",
            "review_date": "2021-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was full of action, brilliantly done. Had a great storyline between Lebron and his son. It wasnt all fun and games, but the message came through loud and clear. Allowed for good conversation with 10 year old grandson about being himself.",
            "review_date": "2021-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is way overhated",
            "review_date": "2021-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Michael is likeable and has charm. This guy.... this guy lacks all that Jordan has",
            "review_date": "2021-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie gave me cancer.",
            "review_date": "2021-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First off.. lebron is a terrible excuse for a roll model. Second.. he's a terrible actor.. This could have been a good continuation.",
            "review_date": "2021-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If I could give less stars I would. Terrible movie. Lebron is no where near the level of MJ.  Michael is and always will be the GOAT. MJs movie was better and so was his game. My kids lost interest in first 30 mins and they had no idea who Lebron is. 😂😂😂",
            "review_date": "2021-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story line was interesting and it was visually dynamic enough to keep the attention of the kids, but the original movie was still the best one. I will say, this was a good way to marry classic cartoon characters and their antics, with technology and gaming concepts of the present day. There was a little of something for those of us older and familiar with all the classic Warner Brother's toons as well as content contemporary enough to capture the interest of the younger gamer set. I also liked the message of encouraging kids to be their own person rather than trying to force them onto a path of a parent's choosing.",
            "review_date": "2021-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The concept is dope! I love the technology aspect & the moral of story! However, The writer needs tutoring for the speed of the timeline and the lingo/lines in the movie because it’s easy to get lost. ",
            "review_date": "2021-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of worst movies ever made",
            "review_date": "2021-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wile E. Coyote chasing Road Runner in a Mad Max: Fury Road world. This is the type of crazy stuff that you can see in the new Space Jam movie, and it was just too much for me. Yes, the majority of the film is equal to the original as the mixing of the mediums mostly worked, some characters are memorable and the plot is even better this time around, but the product placements and on-the-nose marketing tactics employed here by Warners in order to promote their HBO Max streaming service were just shameless.",
            "review_date": "2021-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great modern day space jam movie!! Lebron touching on some necessary lessons regarding the relationships between parents and their child. While the movie isn't some well written masterpiece, there is plenty of fun and Easter eggs to make this an enjoyable experience for kids of all ages! A family movie!",
            "review_date": "2021-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am honestly pretty sure this is the worst movie I've ever seen in my life!",
            "review_date": "2021-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super funny but basic storyline great moovie",
            "review_date": "2021-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well this wasn't half as bad as the critics say. Sure it's a very dumb movie, but hey, it's a kids movie! If I were a kid, I'm sure I'd enjoy it a lot (despite the fact there are a lot, and I mean A LOT of cameos and references kids today won't get but will keep adults trying to identify every character in the background). It has very good 2D and 3D animation and that's enough to entertain any kid. Also it's great this film pays tribute to the golden age of traditional animation.\nWe, animation fans, will never get a movie as good as Who framed Roger Rabbit again, or at least we haven't in all these years, but watching Bugs and friends on the big screen takes me back to my childhood every time. On the other hand, I agree this is like a big ad for Lebron, but I don't care that much, I guess It could have been any basketball player, we all know no one could fill Michael Jordan shoes in this one. I'm no critic, but as a final consumer let me tell you this is a very enjoyable kids movie.",
            "review_date": "2021-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "lebron James is terrible.",
            "review_date": "2021-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If LeBron wasn't in it maybe it would be better. Unfortunately he is and never gets good.",
            "review_date": "2021-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Somehow took the better actor (Lebron over MJ) and turned him into an overbearing terrible father. And we are supposed to care about him? Also, they made the basketball game way too effect heavy and you just don't care about the Goon Squad. The original aliens had personality. Where was the Space Jam theme? Music in the movie was lacking quality.",
            "review_date": "2021-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They made a Space Jam movie that not only didn't take place in space, but doesn't capitalize on the NBA talent they have or do any justice to the Loose Tunes.\n\nI hyped it up to watch with my son, and will have to do some work to regain his trust when it comes to hyping movies up.",
            "review_date": "2021-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original Space Jam wasn't a great film, but this one makes it look like a masterpiece.  The Looney Tunes just aren't funny anymore.  WB has tweaked their animated characters so much that they're not really laugh-out-loud funny anymore.  I did think that Don Cheadle made for a pretty good villain, but LeBron James absolutely does not have the charm that Michael Jordan did.  Overall, an oKay time filler but don't think it's good enough for repeated viewings.",
            "review_date": "2021-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It had some funny one-liners and was okay overall, but definitely not as good as the original. Too techy. The Michael B. Jordan cameo was funny.",
            "review_date": "2021-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When the Looney Tunes are allowed to be Looney there are some genuine laughs. But really stupid (not looney) story. The best I can say is it's not terrible.",
            "review_date": "2021-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really just a poor remake of the original. To be honest I’m not sure why they remade this movie in the first place.",
            "review_date": "2021-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "full of nostalgic moments, but Lebron mediocre acting skills, along with a silly story hurts the movie",
            "review_date": "2021-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lebron has no acting skills and Michael Jordan did a much better space jam movie. Lebrons real family should play his family not actors.",
            "review_date": "2021-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good family movie, and really funny.",
            "review_date": "2021-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lot less fun and more stupid than the previous, Bron should stick to playing ball.",
            "review_date": "2021-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was fun to see all the Disney and Toon characters.",
            "review_date": "2021-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Where are the Looney Tunes we love? It seems that whoever wrote this never saw the cartoon or knows the characters. It doesn't feel like themselves. This is just a long commercial to buy an HBO subscription. The plot is not convincing, the excess of additional characters adds nothing to the story and is very disappointing to watch. Enemies don't even have a justification for being there!, Where did they come from?, Why do they have those powers?, What do they contribute to the story?, Nothing!. Also, where is Pepe le Pew? Why did the last basket not give points for style? Only a bunch of bad decisions.",
            "review_date": "2021-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie but I’m nostalgic and loved the original. Kids loved it !",
            "review_date": "2021-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great for kids My nieces enjoyed  it",
            "review_date": "2021-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "movie not as good as first one .. LeBron not as good as MJ either",
            "review_date": "2021-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I mean, whatever, I had so much fun watching it, LeBron looked he was having fun making it",
            "review_date": "2021-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely horrible.",
            "review_date": "2021-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked the moral story about letting the kid be himself and not try so hard to fill his dad's shoes. Great special effects!!",
            "review_date": "2021-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I came into this film with hopes of a new adventure that was entertaining. The film attempts to engage you by creating a plot meant for the family, but it falls flat and simply turns to a bore. The Tunes were sold short and WB shoved other IP's as an attempt to not forget everything else that there is but for the Tunes.  Jame's acting was difficult to watch, and the actor that plays the son does a much better job at acting than James himself. Highly recommend to not waste your time, or brain cells.",
            "review_date": "2021-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible movie!  Kept waiting for it to start being good, then the end credits rolled.",
            "review_date": "2021-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie was great. I still like the original one better, but my daughter and I enjoyed it.",
            "review_date": "2021-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's ok for a commercial.",
            "review_date": "2021-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's what it's supposed to be, a good movie for the family.  Is it great? No, but there is some heart and charm in this film.",
            "review_date": "2021-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely was a cash grab, but it was a cash grab I ended up enjoying, even at some points more than the original.",
            "review_date": "2021-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have 4 kids and have seen my fair share of kids shows... The plot, directing, animation and acting was awful.  Haven't been this disappointed in a kids movie since Never ending story 2",
            "review_date": "2021-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought it was one of the most fun movies I have seen since Smokey and the Bandit!! Loved seeing all the Warner brothers characters and especially enjoyed seeing the female basketball stars.",
            "review_date": "2021-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very enjoyable film, There's some great cameos and it's funny. ",
            "review_date": "2021-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a really fun, I enjoyed it. So did my daughter. Not a big fan of Lebron but he did good as an actor better than any athlete that can act.",
            "review_date": "2021-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i swear to god if you pay to watch this movie, congratulations, you just  booked yourself into a 2 hour sleep session. You are going to cry from all of the yawning, and have an amazing sleep while all of the background noise is going on. Have fun./",
            "review_date": "2021-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must watch Lebron James Movie",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing. Better than the original.",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A TEN YEAR OLD WOULDN'T LIKE THIS, IT WOULD BE BELOW THEIR LEVEL OF INTELIGENCE.  LEBRON MUST BE EMBARESSED TO BE PORTREYED AS AN IDIOT.  NOT WORTH EVEN RATING AS THE ZERO IT IS!",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was very entertaining and it was nice to finally get a new installment to the Space Jam franchise. The Looney Tunes are just as I remember them (except for Lola Bunny). *spoilers* The plot point of Bugs Bunny missing his friends is so heart breaking and sad, but it works great. I wish it was focused on a bit more, but sadly it doesn't. Lebron was also a cheesy actor, and that's really just because he is a NBA player not an actor. Overall this is an entertaining movie to watch on family movie night, and adults should go into it with expectations of it being cheesy and for kids just like the original. It's a kids movie at it's core and therefore it acts like it.",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story seems lost in a conga line of WB properties that distracted the narrative. It tried hard to be Ready Player One but was not executed properly. Poor Lola, remade into a less feminine and non love interest of Bugs.",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I took my Grandson because he wanted to go and he really enjoyed it.",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a boring movie.   Which is worse than a bad movie.   I did not laugh once throughout the entire movie.   James' acting was awful.    The acting in general was bad and Don a header must have done this movie as a way to meet Lebron because he mailed it in.    Save your money and go see anything else.",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My 4 year old really liked this movie. This was the first time we have taken him to the theater. The movie was action packed and kept his interest while being fun for adults as well.",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LeBron James should \"shut up and dribble\"...period!",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Looks very good the characters are a bit cringe but funny and it's very entertaining and enjoyable",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun reboot with a heartwarming message for the lastest generation. Comparisons with the original are hard to avoid for someone who came up with the MJ Space Jam, but the latest film's reliance on product placement and using every character they have the rights to (something done very well in Lego Batman by the way) ended up being very tired and distracted from the strong professional talent casted for the film.",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After 20 minutes I just wanted to leave the theatre as quick as possible. Lebron do what you can do better stay away from movies please",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a funny movie some of the lines were a little corny but overall awesome movie",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite the nostalgia thrown at us throughout the movie it was still horribly written. They tried to appease the original fans of Space Jam (1996) by throwing the characters we know and love from that era but delivered horribly written dialogue and story pacing. ",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For the first 45 minutes I thought this was a commercial for Prozac, and boy I wish it was cuz I needed some after the movie finished. They don't even make Lola bunny sexy in it, super hard to jack off too, but I persevered. During the second half of the movie I thought it was about computer viruses, baked outta my mind the whole movie and it still blew harder than Jenna Jamison. I had to go to get eye surgery after the movie cuz I saw so much bullshit. God bless",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was very Kool..& the movie place was very relaxing & clean so that's a 10+",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this movie was sort of bland and full of cliche dialogues. For the first hour or so of the film it sort of felt forced with the references and the plot was cheesy, it felt like it was trying to be like the original Space Jam. Seems like the target audience was solely for children and not for the masses.",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very cute and clever. My 7 & 10 year olds loved it as did their dad and I. Great family movie event. Go see it!",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My Granddaughter Who is 6 Loved it and So Did I :)\n\nShe even got up end the end and danced with the movies Music.\nGreat scenes",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not quite as good as Space Jam, but a fun movie that 90s kids will enjoy watching with their children",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually looks better than the first one, but somehow not as un as the first one. I watched with my son who is a fan of Looney Tunes, even he said afterward, the other one is much better Dad.",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie full of fun and laughter. If you are a Looney Tune fan, young or old, you will love it! Graphics were awesome! We want the DVD when it comes out!",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really liked it! it was entertaining and funny. :) ",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the worst movie I have seen in a long time.",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I gave it a four because my kids liked it and the people who was in it but it’s not for adults so I just give it that much",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tried watching this movie with my wife and daughter but every couple minutes this guy would show up on-screen claiming he's the King and would start pleasuring himself. Can't believe this made it passed editing.",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was exactly as expected, super cheesy. There were enough references to keep me entertained but enough slap humor and silly comedy for my six year old to laugh out loud.",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why professional critics feel it necessary to savage a film that isn't for them is beyond me. It's not amazing, but it's not NEARLY as bad as they're saying. A watch of the original brings Lebron's effort and comedic timing into focus and highlights how much of a part nostalgia plays in our enjoyment of the Original.",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Poor acting, but sweet messaging",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yeah just kinda nothing like the original they ruined the monstars with a video game version of the players so you may be disappointed because in the original they really did a good job with the monstars but don cheedle is the best part of the movie he was the only good actor but give Lebron props he is at least a better actor than MJ ",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This has to be one of the worst movies I’ve seen. Horrible acting!!! Terrible plot that wasn’t in space. Our 7yr old, about 45 min in, said he was bored and the moved dragged slower that listening to nails on a chalkboard.",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've seen worse. I liked how part of the film said \"Hey look at all the amazing IP we own!\" I'm not a huge sports fan but you can enjoy this simple movie for what it is, and I would say it is on par with the first.",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie might not be the benchmark for children's cinema, but it provides a good enough story and a cast of colorful characters to make this movie enjoyable for all ages.",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I did not have high hopes for this movie at all, was pleasantly surprise by how good it was and very funny",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie made me feel like watching sequels and reboots are just a waste of time",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "made me a fan of Lebron",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think it was a movie where almost nothing went right",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Has good jokes and funny cameos. And that's it.",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed this movie. As having grown up with the original space jam I think this movie collides a lot of the old school with new school. The looney tunes are still bringing joy and laughter to the new generation with sarcastic remarks and extreme jokes. Lebron did great in this movie and the collision of multiple worlds brought it all together. Truly a new experience of space jam #GOTEAMLOONEYTUNES",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My 5-year old wanted to watch so I went with him but we both fell asleep 😴 halfway through the movie.",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you are seriously that critical on a movie about the looney tunes playing basketball... I don't know what to say. It was fine for what I was expecting.",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too long for it’s own good. Even kids will be left bored.",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although it lagged a bit in the beginning,  the end was fun.",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sub par acting. Not enough animation to keep kids interested in it.",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Acting was lacking\nMusic was lacking\nKids enjoyed it none the less but still not the original as far as how well it was put together compared to the original was",
            "review_date": "2021-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was entertaining, there was nothing that made it special but it's an Ok movie.",
            "review_date": "2021-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "liked the whole format and story line",
            "review_date": "2021-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don Cheadle is the only positive.",
            "review_date": "2021-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some very funny moments, great for kids. My 11 yo daughter had to be dragged along, but she ended up loving it.",
            "review_date": "2021-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A dull unfunny mess that seemed more interested in advertising other WB properties then having this be a decent film on its own.  The original Space Jam was nothing that great but it at least had some fun.  This just copied the basic framework from Michael Jordan's film and leeched everything out.  Stick with the original...",
            "review_date": "2021-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "terrible, don’t watch",
            "review_date": "2021-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a Looney Tunes movie for kids, better than the original Space Jam (I'm not blinded by nostalgia like other viewers, the film only had a Bill Murray cameo to offer for entertainment value and completely wastes the Roger Rabbit aesthetic.) This sequel isn't great, yes it is still an advertisement for other Warner Bros. properties, just like The LEGO Movie, Ready Player One, and other films before it, but like those, it's seductive in it's bizarre presentation style. It's funny, most importantly pertaining, and it respects the Looney Tunes brand by featuring an ACTUAL cartoon segment of the film that feels like Looney Tunes! It's definitely still got problems, but I still enjoyed it even at two hours. It's more for adults than kids with it's referential humor though. It's a surreal see-it-to-believe-it situation. That's all, folks. 6/10.",
            "review_date": "2021-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't look directly at it, you'll go blind!",
            "review_date": "2021-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only positive feedback I can give this movie is that it’s visual effects were attractive enough to keep a child’s attention. I while I won’t waste my time commenting on the poor casting (what sensible mind follows Bill Murray and Wayne Knight with this…?), i should mention that the Father-son journey shed a much-needed light on the film and provided viewers with a happy ending. However, the antagonist, Al G. Rhythm and his story seemed a product of necessity rather than genuine creativity. I was done with the movie minutes after he showed up, and found myself longing for the cute aliens we all fell in love with in the original.",
            "review_date": "2021-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely doesn’t live up to its predecessor, but it was a decent family movie.",
            "review_date": "2021-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Space Jam movie is hilarious and a movie the entire family can enjoy! As parent I liked it because it delivered a very important message to parents about accepting and respecting their children's dreams.",
            "review_date": "2021-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The kids wanted to watch it so we made the popcorn and all sat down for a fun, family night of movie going. Within thirty minutes the kids were bored and asked to be excused; that about describes the experience. It seemed like a slow and meandering commercial advertising all of Warner Brother's properties.",
            "review_date": "2021-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow was it bad. Generally poor acting and a very predictable story line that isn't very engaging",
            "review_date": "2021-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just another horrible and politically correct version of a classic, don't waste your time on it",
            "review_date": "2021-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was not bad at all! People were being way too harsh with this movie. The whole thing comes together in the end and there are some good jokes!",
            "review_date": "2021-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My 4 year old wouldnt sit down she hated that we saw the ad for paw patrol and the movie wasnt the paw patrol movie. Sucks that I spent the money and she didnt get into it. I think they needed to add in the cartoon characters earlier we were pretty far into the movie and they still werent on yet I that would have changed her interest in the movie.",
            "review_date": "2021-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original Space Jam was a huge part of my childhood and so I was really hyped for this one. No movie has ever disappointed me so much in my life. It felt like they tried way too hard. The original fully knew what kind of movie it was and it made it fun. This movie on the other hand was full of jokes that fell flat and the plot was just way to weird for a space jam movie. This movie will be great for the younger kids who have never seen the original. But for the people who have seen the original like me it's disappointing.",
            "review_date": "2021-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not anywhere as bad as I had heard.  Pretty fun.",
            "review_date": "2021-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I dont know how anyone could possibly enjoy this movie. The original was good, this is far from it. The Graphics, storyline and acting were horrible.",
            "review_date": "2021-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Straight up awful. The movie was poorly developed and straight up fell flat",
            "review_date": "2021-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Doesn’t even deserve half of star what a waste of time ",
            "review_date": "2021-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie was really boring, the last 20 min was more entertaining. I guess my expectations were higher since I was expecting something similar to the first version but with better visual quality due to the new technologies. I will always choose the first version 100 times more. In addition, MJ is the real star and makes the original version more entertaining and fun.",
            "review_date": "2021-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie cld have been shorter. Seemed to drag on and on. Good story, just cld have been shorter",
            "review_date": "2021-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really liked the film having never seen the original and not having a clue about basketball or even who James was.  I appreciated the wonderful effects of making the tunes characters interacting with the humans and even come into the real world towards the end. it was fantastic to see bugs and friends in a sequel, hopefully they might make a third.",
            "review_date": "2021-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok for what it was. People keep saying lighten up it was a kids movie. Nope it is a story to parents about being bad parents. It is pure nostalgia and it isn't half as funny as first in but has the story message the first one didn't.",
            "review_date": "2021-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "His universe made up of the Looney Tunes visiting \"Warner-verse\" seemed to be intriguing, too bad the studio execs were more interested in how this movie would pay off in clothing, toys, marketing etc.\nBecause, even for children, a cause-and-consequence explanation would be good for the characters' \"own\" motivations and for Lebron James' participation not to be in the foreground, in the background with a mere father-son family drama.",
            "review_date": "2021-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was just a copy of the original space jam. Was expecting more",
            "review_date": "2021-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a great movie! It gives a great positive look for black men and their families. His wife was accurate to to his real wife’s skin color and her hair was natural. They didn’t slap a wig on her head and that was fantastic! As a black person, it was good for many reasons on top of the hard work the animators have done. It looked great!",
            "review_date": "2021-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lazy writing, terrible acting. Absolute waste of money to sit through and to produce.",
            "review_date": "2021-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked the whole movie",
            "review_date": "2021-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a fun ride with good laughs. It needs to be nothing more nothing left. Its a movie for fans and family's to get to relive a classic with a modern spin. Btw wile-coyote MVP",
            "review_date": "2021-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Def an upgrade to the first Space Jam. The storyline is simple but that only makes it more fun. The jokes are on point and they are so many cameos center stage and in the background. ",
            "review_date": "2021-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My 9 year old grandson loved it",
            "review_date": "2021-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seemed like the same as the old Space Jam with better graphics...",
            "review_date": "2021-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This sequel far surpasses the previous one in special effects, giving us well-achieved moments, the plot is too simple and they do not give it the necessary time to develop, the goon squad is sad, there is never a development, but the villain is fine, the Acting is better than the previous movie, and I liked how they united the Warner universes; it's fun and entertains you for the minutes it lasts.",
            "review_date": "2021-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most non-heartfelt movies I have ever seen.  I will give Don Cheadle a pass for making this movie but no one else deserves a pass!!!  My kids are no longer in my will after making me watch this movie.",
            "review_date": "2021-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very well done! I went because my 10 year old wanted to see it and I was hooked within the first 2 minutes of the movie! I'm making the rest of my family go see it on Sunday!",
            "review_date": "2021-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst remake of a movie i have ever seen. Le Bron James didn't make it any better either. I couldn't wait for the film to finish to leave.",
            "review_date": "2021-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overly silly and sometimes boring for adults. That being said, the younger audience has enough here to keep their interest. It's way to long to hold the complete attention of children, but still an innocent and enjoyable film for the whole family. 6.5/10",
            "review_date": "2021-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice story with a good message.",
            "review_date": "2021-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Space Jam forgot the rules but not forgot the funny. PS:(The film with the best cameos in 2021) 7/10",
            "review_date": "2021-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "6 thumbs down!  Desperate attempt at entertainment.  Cramming every Warner Bros. character ever created into one movie is proof that the lead actor and the storyline werent enough to keep viewers engaged. Skip this one no matter how much your kids beg.",
            "review_date": "2021-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun Sequel to the First movie from 1996",
            "review_date": "2021-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie A Masterpiece thanks to it's clever writing witty jokes and brilliant characters that are faithful to cartoon. an instant classic.",
            "review_date": "2021-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some movies should not be remade, or done into a sequel, or whatever the heck this was supposed to be. LeBron James tried his best, but his best was not good enough. It just wasn't good. I can't put my finger on anything in specific that wasn't good - the whole movie itself just wasn't good",
            "review_date": "2021-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must see for 90s kids and their children!",
            "review_date": "2021-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know that Lebron's acting is not good, the animation is great, but also, the movie shows us something that is a bit difficult to explain, but that we can feel in our hearts",
            "review_date": "2021-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible!  I’d give it a zero if I could. This one made the original really look good and classic, and LeBron copying aka trying to be like Jordan is far from happening in every way.  Worse idea ever and hard to believe someone gave this stupid movie a green light.  Save $$$ folks!",
            "review_date": "2021-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original was campy and fun and no one took themselves seriously; you got lost in the silliness. However this is nothing more than straining IP through the wringer hoping for more of those nostalgia bucks without providing anything for itself, James was a bad choice for this role- BAD.",
            "review_date": "2021-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was just good silly fun! It has a good message for kids funny jokes for all some cartoon cameos and jokes for the adults also. As long as you go into this movie with a light heart and don't be so stuffy i think anyone can enjoy it.",
            "review_date": "2021-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun, fast paced new take and an enjoyable watch.\n\nI grew up in the 90s so I have a biased opinion and impossible to top the MJ before there was a \"serververse\" but still recommended for anyone in the new generations.",
            "review_date": "2021-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I took my two sons to see this and they enjoyed it",
            "review_date": "2021-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "being a 31 year old who has seen the original space jam multiple times throughout my entire life, this new space jam was like eating a pepperoni pizza lunchable but instead of pepperoni, they used gummy worms and instead of pizza sauce, they used silly puddy. wasn't good at all.",
            "review_date": "2021-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a great flash from the past!",
            "review_date": "2021-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a little slow in the beginning",
            "review_date": "2021-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Space Jam 2 is in (Theaters and HBO Max) is a hard film to review.   The screenplay is wonky - with old movie references (many of which are R rated or adult skewing films...Matrix, Casablanca, Fury Road, and Training Day)  My 11 and 13 year old found it funny (but were aided by knowing some of the references from Simpson parodies the films (as opposed to the films themselves).   The looney tunes stuff mostly worked. Lebron struggled but it was hard to tell whether it was a lack of acting talent (he has been fine in minor roles in the past) or the fact the screenplay makes him mostly a pill for most of the film.  The movie fails to use the idea of the Warnervese well (except for the crowd at the big game) and I think pulling from that IP catalog would have worked better for the goon squad (II) than what they ended up with animal/nba hybrids.  The film is super flashy (and those with epilepsy should avoid it).  For me it was a 2 1/2 out of 5 but my kids would rate it slightly higher. I would note that really young kids (under 4) were struggling in the theater and the film seems aimed slightly older.",
            "review_date": "2021-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never saw the first movie. My mother wanted to take my sister to something fun. We were still looking for fun when it was over. What a mess.",
            "review_date": "2021-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once the nostalgia wore off, I left feeling like there was no direction except to jam as many brand plugs in as possible and a cheesy message about parenting. Also it's a ripoff of Hook",
            "review_date": "2021-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie should not of been made. Bomb bomb bomb",
            "review_date": "2021-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie was good but just a little too long! My 9-year old grandson loved it!",
            "review_date": "2021-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Warning! Watch while baked as a cookie. 5 stars",
            "review_date": "2021-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I may be a die hard fan of the original Space Jam movie, but by no means does that mean the new one is bad. At first, I was worried that WB was going to completely erase the original Space Jam from our canonical universe, but they didn't. If anything, the Space Jam universe was expanded - and it works!\n\nHats off to Lebron and Bugs! I loved the chemistry Lebron had with the Toons and you can just tell how much fun he had making this movie, which is the whole point of Space Jam to begin with. You just need to have fun with it, not take it seriously, and it ends up being great. Yes, we get it. The movies are a huge marketing campaign. You know what? Who cares? I hope to see a new Space Jam movie in another 25 years! Let it be the century for Space Jam, WB.",
            "review_date": "2021-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. very modern and not old. Have a great shot of what Warner Brothers has produced over the years. killer jerseys!!!!",
            "review_date": "2021-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting fresh take on an old property ",
            "review_date": "2021-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Save your money on this one as it's a dud!  LeBronda cannot act, he's stiff as a corpse.  If you want to see the Looney Tunes play basketball, watch the original.",
            "review_date": "2021-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "References for kids, parents & grandparents. A fun movie.  Don Cheadle & LeBron were great!",
            "review_date": "2021-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than anticipated. Paid homage to the original and added new flavor.",
            "review_date": "2021-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun sequel! Corny, but in a good way!",
            "review_date": "2021-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though the acting was terrible, I've pretty much enjoyed it. I loved the references of the other movies and shows, and the 2D to CGI transformation was OK. This is better than the original, I guess?",
            "review_date": "2021-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its meh movie, it gives us good memories of our childhood and the main reason to watch the movie its the Looney Tunes.",
            "review_date": "2021-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Half of the movie is just an ego project for LeBron and Warner Brothers. The morals and message to the movie are sloppy at best. The only bright spots are when the tunes characters take over.",
            "review_date": "2021-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie was terrible… LeBron is 1 of the 10 Best players of All Time, and he is Super smart, and will be a Great businessman, but he’s also SO desperate to be compared to MJ on and off the court, and it will never happen. The Space Jam was a Classic, and this was not. LeBron was a cartoon practically the entire movie, and it takes away.",
            "review_date": "2021-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Twenty-five plus years ago some advertising executives thought it would be entertaining to mix a famous basketball star with some cartoon characters to sell shoes. Apparently this concept was \"good\" enough to make a movie. Now, take that concept, age it 25 years, throw in a ridiculously large budget, use a plot from any 80's family sitcom and then tie it all together with images of every property license WB has at its disposal and put them ALL on the screen at the same time. That list of points is literally the experience of watching this \"movie.\" It's not a movie, but it's not really a commercial either because most properties displayed don't really have anything in production at the moment. To further complicate things, Looney Toons are not even popular with children at the moment let alone the majority of the properties displayed in the movie's background. This means that the movie fails at capturing children's attention and there is not enough nostalgia to keep adults' attention. This is just a mess through and through.",
            "review_date": "2021-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Space Jam sequel is a complete chaos. The concept of the movie is great; however, the execution is terrible. I give it a one star rating because it has excellent cameos and excellent animation.",
            "review_date": "2021-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great family movie, especially for the kids.",
            "review_date": "2021-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think that the original space jam was better than this but this was still decent. the original was better because it was all focused on basketball and this one stepped a little too far away from that.",
            "review_date": "2021-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie was so funny I laughed the whole time my son and my husband also enjoyed it we loved the story line the graphics just everything we would definitely see it again.",
            "review_date": "2021-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing like the original, no charm, just adds.",
            "review_date": "2021-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just not for me,, script was bad, and not remotely funny.",
            "review_date": "2021-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WELCOME TO THE SPACE JAM! Just like the original. Only better. Lebron may not be the best actor at times but he still gives a memorable performance. Don Cheadle however basically steals the show. Of course like he said. King Kong ain't got nothing on me! We also get the return of familiar faces such as Bugs Bunny, Daffy Duck, Lola Bunny(voiced by Zendaya), and so many more. I hope they make Space Jam 3. I hear they're going with a new approach. Something about Dwayne Johnson and Wrestling",
            "review_date": "2021-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fine. It was just fine. The start was fairly slow, but then there were some fun cameos; the storyline was a bit fractured, but the animation was quite good. Really, it was just a wash at the end of the day. A somewhat boring wash.",
            "review_date": "2021-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LeBron at his worst. Reminds the viewer of his 2011 collapse. I wish the Matrix or JJ Berea could have prevented LeBron from showing up to this movie as they prevented LeBron from showing up in the 4th quarter of the NBA finals. ",
            "review_date": "2021-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A complete waste of a movie! The original is always better!",
            "review_date": "2021-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not funny, but not offensively bad I guess…",
            "review_date": "2021-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Had a lot of fun watching this movie with my family! Would definitely recommend for families with kids!",
            "review_date": "2021-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though there are a few cuss words like \" what's in the matrix hell\", but to me I appreciate the acting, The animation, and comedy",
            "review_date": "2021-08-02",
            "source": "rt",
            "lang": "en"
        }
    ]
}