{
    "rating": 8.8,
    "release_date": "2021-04-23",
    "num_reviews": 10,
    "genres": [
        "Kids&family",
        "Comedy",
        "Adventure",
        "Animation",
        "Action",
        "Sci-fi"
    ],
    "summary": "Young Katie Mitchell embarks on a road trip with her proud parents, younger brother and beloved dog to start her first year at film school. But their plans to bond as a family soon get interrupted when the world's electronic devices come to life to stage an uprising. With help from two friendly robots, the Mitchells must now come together to save one another -- and the planet -- from the new technological revolution.",
    "reviews": [
        {
            "content": "It Is Nothing More Than A Rip-Off Of \"Next Gen\" and \"An Emoji Movie: Machinemageddon\". and The Characters are also Going on Dangerous Road Trips!",
            "review_date": "2023-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "71%. Not a huge fan of robot movies. They just are so absurd that I often don't enjoy them as much. This film is very out there. 2 on rewatch scale",
            "review_date": "2023-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible animation, heartfelt story, high-octane action scenes, if I had to describe it with one word, it would be \"Masterpiece\".",
            "review_date": "2023-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is fresh and this is the best animation since spiderverse.",
            "review_date": "2023-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I LOV THE MOVIE GUYSS!!😭 love the cinematography, the details, characters, and the flow of the story. this never fails me to laugh and cry. this type of movie I wanna watch before i die.",
            "review_date": "2023-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An obnoxious, cliché-driven memefest that also happens to be the most visually stunning film I've seen in the past few years. No amount of generic Pixar-style tear-jerking monologue can stop this film from being anything short of incredibly memorable.",
            "review_date": "2023-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply awesome hilarious family movie. Watched it several times and laughed every time",
            "review_date": "2023-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of my favorite movies. Fun, clever, and fantastic animation and pacing. The first time we watched it we had to pause the movie a few times because we were laughing so hard. The voice cast really shines, and the main message is one I think a lot of people can relate to.",
            "review_date": "2023-03-11",
            "source": "rt",
            "lang": "en"
        }
    ]
}