{
  "title": "Batman & Robin",
  "rating": 5.8,
  "release_date": "1997-06-20",
  "summary": "Batman, Robin and new crime fighting comrade Batgirl face Gotham City's deadliest threat yet when cold-hearted Mr. Freeze and venomous Poison Ivy team for some lethal mischief.  (Warner Bros.)",
  "critic_reviews": [
    "Joel Schumacher, director and ringmaster, piles on the flashy showmanship and keeps the film as big, bold, noisy and mindlessly overwhelming as possible.",
    "There's something almost maniacally heroic about packaging the fourth sequel of a superhero action series without resorting to the old standbys of good writing, capable acting or inspired directing.",
    "Unfortunately, the charming Batfamily can't stay in their cave indefinitely; they've got to go out and fight crime. And that's where this elaborately high-style production from Batman Forever director Joel Schumacher hits an iceberg.",
    "Batman & Robin, like the first three films in the series, is wonderful to look at, and has nothing authentic at its core.",
    "This film, which places yet another actor in the batsuit, has all the necessary hallmarks of a sorry sequel -- pointless, plodding plotting; asinine action; clueless, comatose characterization; and dumb dialogue.",
    "It's the lightest of the Batman movies, the most cartoony, the dumbest and the least ambitious. But it holds the audience's attention, brings on a few laughs and never really gets boring.",
    "George Clooney looks great in a cape, but this fourth installment in the series has invested so much capital in razzle-dazzle special effects that it hardly matters whose head is under the pointy-eared helmet.",
    "Unfortunately, the operative word is bland, as the newcomers don't add much to the formula, leaving it to their nemeses to enliven the proceedings. Narrative drive and humor are also in short supply, which creates a serious sagsag in the middle when the novelty of the fresh components has mostly worn off.",
    "There's so much happening in the movie that it feels like nothing is happening at all. Which leaves you free to gaze, slack-jawed, on the true glory of Batman & Robin -- its fabulously color-coded set design.",
    "It's a gee-whiz kiddie movie imagined by pervy grown-ups who get a giggle out of mixing bloodless fight scenes with close-ups of rubber-wrapped butts and baskets.",
    "It has none of the minor virtues of Schumacher's other films. It looks bad: cluttered surfaces, production design reminiscent of overblown Broadway musicals, editing too fast for the eye to catch up, poor staging of fast action.",
    "Screenwriter Akiva Goldsman has written quips, not characters and Joel Schumacher still seems miscast as a Bat-action director: he stages the mayhem confusingly and the comedy too broadly.",
    "Clooney's stiff cornball delivery and tendency to smile during the most tragic moments bring this as close to the cartoonish Batman television series of the 1960s as any of the movies have come.",
    "The current Bat cycle was already tired when Schumacher replaced Tim Burton behind the camera on \"Batman Forever.\" This chapter -- so action-packed, yet so insufferably dull -- makes it clear that there's nowhere else to go.",
    "Batman & Robin fails to engage the spirit of Batman, Robin, or decent marketing in general, and instead ends up as a limp, excruciatingly shallow knockoff that leaves viewers cringing at the unavoidable one-liners that make up the better part of the script.",
    "It's clear that writer Akiva Goldsman and director Joel Schumacher are bereft of ideas and using the MTV clutter as a cover-up.",
    "The fourth installment in the Batman franchise is one long head-splitting exercise in clueless cacophony that makes you feel as though you're being held hostage in some haywire Planet Hollywood while sonic booms pummel your auditory canal.",
    "Lacking most kinds of inspiration and geared to undemanding minds, this project is so overloaded with hardware and stunts, it's a relief to have it over.",
    "Clooney fails to make much of an impression as The Batman, but to make an impression amongst all the garish theatrics, he would pretty much have to shout his dialogue in rhyming verse, backwards.",
    "Like a wounded yeti, Batman & Robin drags itself through icicle-heavy sets, dry-ice fog and choking jungle vines, before dying in a frozen heap. Unfortunately, that demise occurs about 20 minutes into the movie, which leaves you in the cold for approximately 106 minutes.",
    "Campy costumes can't disguise the incoherent plot, confused performances and lame script that send this star vehicle spiralling downward."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Ah, classic Batman, before they went and made him all moody and miserable. This is a GREAT movie. You gotta wonder why they didn't keep George Clooney in the role. At least he would've added a bit of humour to the role. Some people said thisAh, classic Batman, before they went and made him all moody and miserable. This is a GREAT movie. You gotta wonder why they didn't keep George Clooney in the role. At least he would've added a bit of humour to the role. Some people said this was rubbish cos the bat suit had nipples. Eh... makes sense. Humans have nipples people. And sometimes they protrude thru clothes. Do any of you even watch Baywatch?? Best villain ever alert. IT'S F**KING ARNIE!!! He's a baddie for the first time since The Terminator here. Always more believable as a villain. For those pining for a bit of Bane... he's also in this! And he gets killed so it's the new one that looks dumb as he's magically brought back to life. They did the same with Joker, Two Face, Cat woman. This is the real deal folks. Accept no substitutes.",
      "review_date": "2013-02-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The only actor among all of them with the chin to play the title role and he gets it horribly wrong.",
      "review_date": "2008-04-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I gave this a one only because Robin still seems pretty much in place. Other than that, everything with the movie is wrong. George Clooney is cast as Batman, and believe me, he is one of the last people you ever need to get into that suit. I gave this a one only because Robin still seems pretty much in place. Other than that, everything with the movie is wrong. George Clooney is cast as Batman, and believe me, he is one of the last people you ever need to get into that suit. George Clooney is about as fit to play Batman as Hulk Hogan would be to play The Flash. It just doesn't make sense. When you watch him perform both Bruce and Batman feel like cliche Clooney performances. Alicia Silverstone as Batgirl could probably work, but so much of the lines and delivery (along with sound effects) in this movie are so horrible that we'll never know. I also think Uma Thurman playing Poison Ivy could work, but again, whoever told her to deliver her lines with that rollercoaster pitch was out of their mind. Arnold Schwarzeneggar playing Mr. Freeze is very easily the most inaccurate portrayal of any character in history. It may also be the corniest as well. Mr. Freeze is supposed to be an intricate character, a man with real emotions and feelings that he was robbed of. He was not supposed to be a bumbling fool who uses horrible freeze related puns. The only goddamn thing that stayed very good in this movie was Alfred, and he had the least time in this film than any of the others!",
      "review_date": "2008-01-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A total loss. No redeeming qualities. Thank goodness for \"Batman Begins\".",
      "review_date": "2005-09-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A terrible sequel, just terrible! even Batman Forever (which sucked) was way better than this ludicrous joke for a sequel.",
      "review_date": "2009-08-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the most disappointing movies of all time. George Clooney is a great actor, but a sucky choice for Batman. Lame effects and dialouge, and yet, being the Batman fanatic that I am, I still watch this. It's still a terrible movie, One of the most disappointing movies of all time. George Clooney is a great actor, but a sucky choice for Batman. Lame effects and dialouge, and yet, being the Batman fanatic that I am, I still watch this. It's still a terrible movie, and it's way to colorful and happy and corny, yet I still watch this. Once Batman Begins comes out on DVD though, this is outta here.",
      "review_date": "2005-09-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I am the biggest fan of the Dark Knight, but I HATE this film... campiest film you will ever see, and all of the puns will make you groan. Everything is much too flashy, not dark at all. I still don't understand why the franchise ever I am the biggest fan of the Dark Knight, but I HATE this film... campiest film you will ever see, and all of the puns will make you groan. Everything is much too flashy, not dark at all. I still don't understand why the franchise ever swerved towards being 'family' movies... Batman is meant to be a mature, adult film- thank GOD Batman Begins breathed new life into Batman films again. AVOID at all costs, if you value your sanity.",
      "review_date": "2006-09-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This has gotta be the worst comic movie ever. I absolutely hate it. Good thing X-men brought this franchise back with some decency.",
      "review_date": "2008-02-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Joel Schumacher's 2 Batman films...Batman Forever and Batman & Robin! Man Batman Forever was better than this. I kinda liked it. But not a'lot.",
      "review_date": "2009-07-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Quite possibly the worst movie ever made. Theres NOTHING good about it. Every actor does a horrible job, the script and dialogue is terrible, and most of all, the jokes make you want to kill yourself.",
      "review_date": "2009-07-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the worst superhero movies to date. Someone should tell Joel Schumacher that ice skates, bat-credit cards, nipple suits, homoerotic statues, and neon lit thugs don't make a good movie.",
      "review_date": "2007-08-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is the worst movie ever made. The costumes look like something you wear at Halloween. The acting in \"The Fear 2\" is better. I've rather see Power Rangers then this again. Joel schumacher can't do anything.",
      "review_date": "2009-03-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is terrible but is a massive guilty pleasure. This whole film is just stupid fun. The only real problem I have with this movie is the 2 hour run time. Other than that, it is a stupid, fun 90s action superhero film with Batnips andThis movie is terrible but is a massive guilty pleasure. This whole film is just stupid fun. The only real problem I have with this movie is the 2 hour run time. Other than that, it is a stupid, fun 90s action superhero film with Batnips and Arnold Schwarzenegger one liners.",
      "review_date": "2015-08-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Classic 90s cheese rented it back in the day and I do appreciate the concept just a shame Clooney did terrible in the part.",
      "review_date": "2020-07-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What I learned from \"Batman & Robin\" is that...1) Joel Schumacher is a useless director.2) Batman has lost its face and originality (Seriously, Bat credit card?)3) I must preach the people to NEVER watch this piece of mess.",
      "review_date": "2011-09-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Acting is way too over the top, dialogue is annoying as hell especially the ice puns, the costumes are ridiculous, the script seems like it was written by a 3 year old. Ivy wants Mr.Freeze to freeze the world and than give it to the plants!Acting is way too over the top, dialogue is annoying as hell especially the ice puns, the costumes are ridiculous, the script seems like it was written by a 3 year old. Ivy wants Mr.Freeze to freeze the world and than give it to the plants! See what I mean? The music is good and that's what saves it from a zero.",
      "review_date": "2011-04-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The second worst superhero movie of all time, would be first but Catwoman exists. George Clooney is terrible as Batman even worse than Val Kilmer. Even worse they tried to make it humourous, and it didn't work. Bat card. Need I say more? ThisThe second worst superhero movie of all time, would be first but Catwoman exists. George Clooney is terrible as Batman even worse than Val Kilmer. Even worse they tried to make it humourous, and it didn't work. Bat card. Need I say more? This is one of the worst movies I have ever seen and almost as bad as Catwoman.",
      "review_date": "2013-08-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Batman and Robin, with no doubt whatsoever, plunges the Batman franchise into an abyss with the help of one of the worst directors of all time. Complete with a ridiculously predictable plot, cheesy dialogue, homoerotic scenes that exposeBatman and Robin, with no doubt whatsoever, plunges the Batman franchise into an abyss with the help of one of the worst directors of all time. Complete with a ridiculously predictable plot, cheesy dialogue, homoerotic scenes that expose various superheroes' 'special' parts and deconstruction of intelligent villains to monsters who grunt and roar, Batman and Robin is an utterly abysmal piece of **** that left the Batman franchise in shambles, only leaving Christopher Nolan to stitch it back up again. To say that it is a cretinous affair would be a colossal understatement - for in my eyes, this is not just the worst superhero film of all-time, but the worst film of all-time, period (maybe a close tie with The Last Airbender).",
      "review_date": "2012-12-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Now starring George Clooney as the first title \"hero\" (as Chris O'Donnell reprises his role as the second), BATMAN & ROBIN is flawed on so many levels: For starters, it makes BATMAN FOREVER, in its mediocrity, look like THE DARK KNIGHT.Now starring George Clooney as the first title \"hero\" (as Chris O'Donnell reprises his role as the second), BATMAN & ROBIN is flawed on so many levels: For starters, it makes BATMAN FOREVER, in its mediocrity, look like THE DARK KNIGHT. Second of all, Uma Thurman, for her role as Poison Ivy, uses the exact (exact!) tactics that Michelle Pfeiffer used for her role as Catwoman in BATMAN RETURNS, and those tactics are surely no longer sexy at all. Third, Arnold Schwarzenegger was poorly, poorly miscast for the role of Mr. Freeze, and it makes him look like a terrible actor--the stupid punning he does throughout the film makes him look even more terrible. Also, BATMAN & ROBIN was Warner Bros.'s idea to veer the \"Batman\" films into a \"family movie\" zone. I found it ridiculous that to make it into a family film, they decided they should make the action sequences look corny rather than smooth, and to add in a bunch of childish humor spoken by Robin. In addition to that, George Clooney, Chris O'Donnell, Arnold Schwarzenegger, Uma Thurman, and Alicia Silverstone need some serious lobotomies. Even if some of their careers are alive again today, this film murdered their acting careers, and I feel so much pity. I could go on and on, but the bottom line, if I hadn't made it clear enough yet, is do not see this film. It is ridiculously stupid and unimaginably terrible.",
      "review_date": "2011-09-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "superheroes don't get credit cards!!!",
      "review_date": "2010-10-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a disgrace!!! Joel should be ashamed of himself for creating this!!! Luckily, there's Burton's Batman and Batman Returns as well as Nolan's Batman franchise.",
      "review_date": "2011-07-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is garbage. It is suspect, but watchable, to members of the audience under six or seven. Anyone older than that will absolutely hate it.\r Sorry George Clooney, but **** THIS MOVIE.",
      "review_date": "2012-06-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A terrible fourth installment including dreadful puns and crazy props. The action wasn't too bad but overall it is a humiliating attempt at a decent movie. Joel Schumacher also \"commited suicide\" with his casting choices.",
      "review_date": "2013-07-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Unfortunately for batman & robin, Its just too cartonish and poorly, poorly written to even enjoy, Its full of the most Un realistic scenes ever as well has the most ridiculous superhero costumes ever put on film.",
      "review_date": "2014-03-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Awful movie. It's made even worse by the fact that George Clooney could have been a good Batman if he had been given a decent script. Instead, the resulting film is trash. And one other thing, why in hell would anyone think it would be a goodAwful movie. It's made even worse by the fact that George Clooney could have been a good Batman if he had been given a decent script. Instead, the resulting film is trash. And one other thing, why in hell would anyone think it would be a good idea to put nipples on the Batsuit?",
      "review_date": "2010-08-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This may not be the best Batman movie ever but it is a good one, the main reason people don't like this is because it's not as dark as some of the other Batman movies out there, it reminds me of that really old Batman TV show from the 60's soThis may not be the best Batman movie ever but it is a good one, the main reason people don't like this is because it's not as dark as some of the other Batman movies out there, it reminds me of that really old Batman TV show from the 60's so it's pretty cheesy, all in all it's a good movie from beginning to end.",
      "review_date": "2011-02-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In an attempt to make Batman & Robin look and feel like a casual, lightweight movie, Schumacher inadvertently creates a prodution so, in lack of better words, downright lame, itâ",
      "review_date": "2010-11-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I loved this movie... when i was 6. i watched it again the other day and realized how horrible it really was, and the sad part is that is could have been really good if not for the script and director, Cloony had a lot of potential to be I loved this movie... when i was 6. i watched it again the other day and realized how horrible it really was, and the sad part is that is could have been really good if not for the script and director, Cloony had a lot of potential to be batman, he's a talented actor and has the looks, but whoever thought up the story and lines completely missed the mark. batman is just the type of character who needs to be taken seriously. i mean come on who would dress up as a bat and fight bad guys, its either adam west sillyness or serious action, there can't be an in between.",
      "review_date": "2009-08-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "THis movie is so awful you'll be wondering how the hell Warner Brothers green-lit the project. The answer is this: money. The only reason this exists is because Warner Brothers believed this would make tons of cash from all the \"dumb\"THis movie is so awful you'll be wondering how the hell Warner Brothers green-lit the project. The answer is this: money. The only reason this exists is because Warner Brothers believed this would make tons of cash from all the \"dumb\" moviegoers. Well, they didn't realise that people were smarter than that and managed to stay well away from this turkey when bad word-of-mouth erupted shortly after the \"movie's\" release.\r Arnold Schwarzenegger can't act. I can't say it in a clearer way' he just, can't, act!!! In fact nobody in this disaster movie can act properly for a superhero movie. George Clooney single-handedly killed the Batman franchise, until it would be resurrected by Christopher Nolan, who managed to make The Dark Knight Trilogy, which is better than the series Batman and Robin is a part of.\r These movies started off well when Tim Burton made the first and second one, but Batman and Robin was so ordinary that all hope for the future of the franchise seemed lost, until Batman and Robin confirmed that all hope was lost for the Batman series. Thank god The Dark Knight Trilogy saved Batman from embarrassing himself any further.\r Don't watch this movie. It is HORRIBLE!!!! It's like an intentionally made comedy gone wrong, completely wrong. Avoid at all costs.",
      "review_date": "2012-11-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Need I say anything? Batman and Robin is a dull, uninspired, insulting, and ridiculous take on the character. Had Batman Begins not come out, this movie would continue to leave a bad stench to the Batman franchise in Hollywood.",
      "review_date": "2013-07-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An abysmal joke of a Batman movie. The tone is as far removed from the comics and the Tim Burton movies as physically possible. One can say that the movie is a throwback to the campy 60's Batman TV show but even if that is the intention, itAn abysmal joke of a Batman movie. The tone is as far removed from the comics and the Tim Burton movies as physically possible. One can say that the movie is a throwback to the campy 60's Batman TV show but even if that is the intention, it still does not save the movie from failure. Some sets are well designed but the overuse of neon lighting becomes ridiculous. The movie plays out more as a parody than the 4th Batman movie. Gadgets are ludicrous (batskates), the humor is terrible (batman's credit card) and the actors are miscast (Arnie as Mr. Freeze). Speaking of actors, performances are cringeworthy and the dialogue is inexcusably awful. A complete misfire.",
      "review_date": "2011-07-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Holy crappy movie Batman!! Batman Forever at least had a good cast. Clooney has made this movie up with some great acting in other movies I wonder if he still has nightmares?",
      "review_date": "2011-05-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Mr. Freeze: \"What killed the Dinosaurs? THE ICE AGE!\" -  \"Tonight, hell freezes over!\" - \"Ice to see you!\" -  \"You're not sending ME to the COOLER!\" -  \"In this universe, there's only one absolute... everything freezes!\" - \"Let's kick someMr. Freeze: \"What killed the Dinosaurs? THE ICE AGE!\" -  \"Tonight, hell freezes over!\" - \"Ice to see you!\" -  \"You're not sending ME to the COOLER!\" -  \"In this universe, there's only one absolute... everything freezes!\" - \"Let's kick some ice!\" - \"The Ice Man cometh!\" - \"Tonight's forecast... a freeze is coming!\"",
      "review_date": "2011-08-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This Has to be one of the overall worst movies ever created with ridiculas costumes horrible action sequences, and a Cliche Plot Batman and Robin Fails on every level there is othing reedeming about this god aful piece of garbage film",
      "review_date": "2011-08-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The WORST movie I have ever seen! I hate this film. It's utter crap. I'm an Arnold fan, but my god, how many cheesy lines did they want to give him. Clooney looked like a fool in the Bat suit. Uma Thurman is the only saving grace but not evenThe WORST movie I have ever seen! I hate this film. It's utter crap. I'm an Arnold fan, but my god, how many cheesy lines did they want to give him. Clooney looked like a fool in the Bat suit. Uma Thurman is the only saving grace but not even she can save it",
      "review_date": "2011-09-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Simply dreadful. The worst superhero movie ever made. In fact, studies have shown that if you watch Nolan's Batman Begins or The Dark Knight and this back to back, you're in serious danger of getting the Bends and should consult the nearestSimply dreadful. The worst superhero movie ever made. In fact, studies have shown that if you watch Nolan's Batman Begins or The Dark Knight and this back to back, you're in serious danger of getting the Bends and should consult the nearest doctor. And to the people saying \"Oh you guys just don't like this because you're a depressing goth who wants darkness everywhere\". **** you, go inflict your elitist and prejudiced personality on someone else. Whether you want to admit it or not, Batman IS rooted in darkness and savagery - for example, his parents were killed for one thing, how light hearted is that? And for the people defending the film saying its so good its bad - yes, that's true. It is hilarious to watch - but that's because its unintentionally hilarious. I'm not supposed to be laughing at how pathetically awful the acting is, but I am. Just because its hilarious doesn't change the fact it is an awful script.",
      "review_date": "2012-08-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I have to admit, when this came out i was atleast 7 yrs old, and i thought this movie was amazing. NOW this has to be one of the gayest movies i've ever seen. Like i never realized all of close ups of batman and robin's crotch and ass, and iI have to admit, when this came out i was atleast 7 yrs old, and i thought this movie was amazing. NOW this has to be one of the gayest movies i've ever seen. Like i never realized all of close ups of batman and robin's crotch and ass, and i also didnt realize the added nipples until today. Like really, you know a film is bad when the whole cast wants to pretend it never happened.",
      "review_date": "2012-05-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One Horrible piece of Crap",
      "review_date": "2012-07-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was a very poor movie. The performances are abominations, the sets are ridiculous, and the dialogue is downright lame. Batman fans, skip this one.",
      "review_date": "2012-07-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Batman and Robin is an unsightly mess of over indulgence: a clunky carnival of camp that rings back to the most embarrassing skeletons in the closets of Batman",
      "review_date": "2012-07-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Absolute worst Batman movie ever. I'd even prefer watching the cheesy movie/show with Adam West over this one. This movie put me to sleep, I did not enjoy any of it at all. After two really great movies directed by Tim Burton, Joel SchumacherAbsolute worst Batman movie ever. I'd even prefer watching the cheesy movie/show with Adam West over this one. This movie put me to sleep, I did not enjoy any of it at all. After two really great movies directed by Tim Burton, Joel Schumacher was instructed by Warner Bros to make a less-dark, kid-friendly version of Batman for the next installment due to pressure from parental groups. While Batman in the comics is supposed to be somewhat dark since he chose the symbol of the bat to instill fear into the hearts of criminals he encounters, I wouldn't have a problem with a lighter version of Batman per se, however, this movie was the most boring movie I've ever seen (with the possible exceptions of Mortal Combat and the 4th Pirates of the Caribbean movie). Unlike Batman Forever which was saved by Jim Carry, this movie did not entertain me at all and the characters and acting was really boring. Most other bad movies have at least some redeeming quality, however I can think of none for this one so I'm giving it a 0/10. Do yourself a favor, watch the Tim Burton ones, then the one with Jim Carry and then the series reboot from Batman Begins and on, just skip this one you're not missing anything if you do",
      "review_date": "2012-12-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "How I'll describe this film? Is just a bucket of colors, filled with zooms in nipples, crotches and butts, boring dialogues and a few homo-erotic lines, making this film the reason of end of the world.",
      "review_date": "2012-10-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is an absolutely dreadful exploitation of the Batman franchise. The actor portraying the caped crusader has been different the last three films and each actor has screwed up the role worse than the last.",
      "review_date": "2012-11-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "i loved it as a kid now it looks horrible but it still enjoyble\r...........................................................................................................................................................",
      "review_date": "2012-12-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "By for the worst movie i have ever seen. Bat nipples!!!",
      "review_date": "2013-05-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the worst comic book movies of all time.  Joel Schumacher killed the Batman franchise in the 90's with this piece of garbage.  I mean seriously Bat nipples.",
      "review_date": "2013-07-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Oi... I think Joel Schumacher can be a good director. Falling Down (1993) is one of my favorite movies, but oh my God, what the hell happened?\r This movie is much more entertaining than \"Batman Forever\", but for the exact wrong reasons.Oi... I think Joel Schumacher can be a good director. Falling Down (1993) is one of my favorite movies, but oh my God, what the hell happened?\r This movie is much more entertaining than \"Batman Forever\", but for the exact wrong reasons. George Clooney barely speaks like Batman, Chris O'Donnell & Arnold Schwarzenegger are both annoying, and Uma Thruman & Alicia Silverstone are kinda just there. It's the worst Batman movie ever...",
      "review_date": "2015-06-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Few films out there are really \"worthy\" of a 0 star rating, the kind of movie that is either completely devoid of quality or the quality is so buried deep in the earth it isn't even worth mentioning, Batman and Robin is one of thoseFew films out there are really \"worthy\" of a 0 star rating, the kind of movie that is either completely devoid of quality or the quality is so buried deep in the earth it isn't even worth mentioning, Batman and Robin is one of those impossibilities. Whenever I hear that this movie is \"fun\" or \"enjoyable\" because it's campy or funny or some other crap, I want to blow my ears off. Let me ask you people, THIS, this is the movie you want to say is your guilty pleasure, an irritating, complete rape of the Dark Knight mythology, a film that is so campy that even Adam West would face palm himself. This isn't a film that is so bad it's funny, it isn't even entertaining, all I see when I see this film is countless error after error after error that defies all logic of both film making and Batman, what I see is something that is inexcusable, a complete, wasted idea, that both alienates newcomers to the greatest superhero of all time and destroys the fans who know and love it's source material. It's not as if that Joel Schumacher didn't get Batman, oh no, he got it, but he has a destructive, seething hatred for it and all the fans who suffered through his last (admittedly not extremely) bad Batman film. It's insulting, not to just a fan base, but to film itself, why, because the people who make their films should have at least some respect for it and what it does for others, does this film, no, it understands why we love it, and punishes you for it, this is one of the absolute worst, and when people say it's their guilty pleasure, that it's harmless \"fun\", and campy good nature, it makes me seethe with rage to know that this unholy abomination, has won it's battle in trying to prove it can quite literally, trick people into liking it, F***... You... Movie...",
      "review_date": "2013-12-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Just... terrible. Batman Forever was a lot worse than the first two movies but this.. this is just.... insulting for Batman! I mean it was ment to be nothing like the other Batman moviesm totally directed towards children but it even failedJust... terrible. Batman Forever was a lot worse than the first two movies but this.. this is just.... insulting for Batman! I mean it was ment to be nothing like the other Batman moviesm totally directed towards children but it even failed at that. You can always watch it as a Batman parody if you like... I can't even look at the cover..",
      "review_date": "2014-05-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "[EDITED ON 12/16/2016!] I know Batman & Robin attempts to go somewhere with the previous installments, but Joel Schumacher makes it so that this film acts more like a blend of previous films that were criticized terribly bad it was funny to[EDITED ON 12/16/2016!] I know Batman & Robin attempts to go somewhere with the previous installments, but Joel Schumacher makes it so that this film acts more like a blend of previous films that were criticized terribly bad it was funny to laugh at them the first time we see it instead of improving the simple mistakes that Batman Forever did.",
      "review_date": "2015-12-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nSeeing because of not seeing is maybe the ultimate riddle of life. In the end, it's just another perspective of countless perspectives, but nevertheless, it's a riddle that's intriguing. The absence of sight can mean two different things; one meaning, is that there is nothing to see around one's presence, and the other meaning is that regardless of anything to see the ability to see is impossible. The second meaning seems defunct, because if the self can't see then that has to mean there's nothing present around the self to be seen. So anti is predicated on sight, meaning the absence of sight is the inability of anti.This makes the dynamic into seeing because of the inability of anti, or the inability of ability. Batman & Robin thus becomes the ability to see because of the impossibility of ability, which obviously makes no sense. An ability is action, or movement. And therefore Batman & Robin's story of the Wayne Manor dynamics is the action of sight because of the impossibility of action, which naturally still makes no sense. On its own, the impossibility of action is apparent balance; just impossibility means error because of the presence of impossibility. When however a reason becomes apparent, the presence of impossibility gets balanced. Where trouble enters the story is when reason itself gets duplicated, and thus another presence is required for balance.The latter action has to exist, because it's the means to justifying the presence of logic. The very presence of logic is the problem. Without the presence of logic, the impossibility of impossibility is still a problem, but of course the opposite is yet another problem.Because of sight, the presence of problem is rational. If problem is presence, the balance is seeing being caused. Label problem as X, seeing as Y, and the cause of seeing as Z. The presence of X causes Z, and Z causes Y. X is reason of Z. Z is reason of Y. X is reason of Y. Problem is duplicated reason, and therefore sight is a divided loyalty between different reasons.In the world of Batman & Robin - arguably the best Batman film so far, and if not the best then second to Batman Forever - the action of seeing has different reasons. Reason is anti, making different reasons the means to peace.",
      "review_date": "2017-06-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ah, classic Batman, before they went and made him all moody and miserable. This is a GREAT movie. You gotta wonder why they didn't keep George Clooney in the role. At least he would've added a bit of humour to the role. Some people said thisAh, classic Batman, before they went and made him all moody and miserable. This is a GREAT movie. You gotta wonder why they didn't keep George Clooney in the role. At least he would've added a bit of humour to the role. Some people said this was rubbish cos the bat suit had nipples",
      "review_date": "2021-01-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film isn't that bad at all compared to what people have said. I mean sure, Arnold playing the character may have been a bit  silly / childish in a way, but I think it kind of adds charm to it as the film kind of mixes in with serious andThis film isn't that bad at all compared to what people have said. I mean sure, Arnold playing the character may have been a bit  silly / childish in a way, but I think it kind of adds charm to it as the film kind of mixes in with serious and not so serious with Mr. Freeze.\r The film is actually pretty good and enjoyable to watch, George Clooney did a pretty good job playing the role, and so did everyone else. The special effects / CG was good enough for 1997, it could had been a little bit better but still good none the less. The fighting choreography was fairly good as well so I dont really know why everyone dislikes this so much. It's not the best 10/10 movie of the year Batman film of all time. But it's still enjoyable and worth watching.",
      "review_date": "2014-05-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is a masterpiece. The actions scenes are extremely exciting and realistic, the new bat-suit makes George Clooney the most attractive Batman ever. And best of all, the humor in this movie is somehow BETTER than the 1966 Batman movie.",
      "review_date": "2014-12-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Through its mindless fun, Batman and Robin masterfully brings humor, color and emotional weight to a gloomy and joyless character with gleefully over-the-top performances from Uma Thurman and Arnold Schwarzenegger while containing theThrough its mindless fun, Batman and Robin masterfully brings humor, color and emotional weight to a gloomy and joyless character with gleefully over-the-top performances from Uma Thurman and Arnold Schwarzenegger while containing the amusement of a comical George Clooney. The film gets extra points for its abundance of Dutch angles.",
      "review_date": "2020-05-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "[5/8 Batman Marathon]\rBatman & Robin [1997]\r\r\nThere's a reason why this is one of the most reviled movies of cinema history. There's just too many notes in here that went so wrong, that I just can't jot it down here. It's awful. Beyond[5/8 Batman Marathon]\rBatman & Robin [1997]\r There's a reason why this is one of the most reviled movies of cinema history. There's just too many notes in here that went so wrong, that I just can't jot it down here. It's awful. Beyond awful. Here's my verdict in this movie, and I'm going to quote it from Mr. Freeze with the Schwarzenegger voice: THE ICE MAN COMETH!",
      "review_date": "2012-08-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Don't get me wrong this movie is bad,really bad but it's the best experience I've had watching a film with a friend with it's hilarious acting,dumb plot and goofy visuals,It's a must watch if you're with a friend.",
      "review_date": "2016-02-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I can occasionally appreciate Joel Schumacher as a director - Tigerland was a good character-driven war drama, Phonebooth a decent thriller, even Batman Forever had a quirky, flamboyant charm about it. Batman & Robin, on the other hand, is aI can occasionally appreciate Joel Schumacher as a director - Tigerland was a good character-driven war drama, Phonebooth a decent thriller, even Batman Forever had a quirky, flamboyant charm about it. Batman & Robin, on the other hand, is a pretty shoddy film. The \"franchise killer\" as it's been dubbed, is a whole new level of campiness and bad acting, with a dire joke-laden script and cartoonish action and sound effects. I can understand Schumacher wanting to cheer the Batman franchise up a bit after Tim Burton's Goth-tastic tenure, but this film goes above and beyond adding a lighter touch to proceedings, often bordering on parody. George Clooney, playing the new Bruce Wayne/Batman, has a permanent expression of pained embarrassment on his face, Arnold Schwarzenegger's Mr Freeze is comical (mostly due to the abundance of ice-based quips he's forced to spout) and Uma Thurman's performance as Poison Ivy is so bad and lacking in emotion that she looks like she's reading cue cards. Chris O'Donnell is just about pasaible reprising his role as Dick Grayson/Robin, and newcomer Alicia Silverstone makes no impact at all as Barbara Wilson/Batgirl. The only cast member who gives any performance of note is the ever-brilliant Michael Gough, reprising for the fourth time his role of Alfred, Bruce Wayne's wise and loyal butler, though the emotional impact of Alfred being at death's door is somewhat ruined by the fact that Gough has to share the majority of his screen-time with Clooney. The film's set pieces are largely unremarkable, excepting the quite gripping bike chase between Dick, Barbara and a gang of street thugs, and the film's visually impressive finale where Mr Freeze quite literally puts Gotham city \"on ice\". Batman & Robin isn't a superhero film, it's a joke. It's so over-the-top and unintentionally funny, in fact, that for all of its faults (and there are many), you can get a perverse kind of pleasure out of watching it. There are films that are so bad they're good. This isn't one of them, but it is nearly at the stage where it's so bad it's acceptable, at least as a comedy film. I can screenings of Batman & Robin being held in the not too distant future where people really indulge in its awfulness. Can you imagine a room full of people wearing their bat-nipples and quoting Arnie's terrible puns in time with the film? I can, and surprisingly enough, that doesn't scare me - in fact it sounds quite fun. Not bad for a film that claims to be a superhero movie, but in fact resembles something between an extravagant  toy commercial and one of the lesser Carry On films.",
      "review_date": "2012-02-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Probably one of the worst big budget movies I have ever seen. AVOID THIS MOVIE. If you want good Batman movies watch Christopher Nolan's or Tim Burton's take, their both aesthetically pleasing than this waste of space on the movie rentalProbably one of the worst big budget movies I have ever seen. AVOID THIS MOVIE. If you want good Batman movies watch Christopher Nolan's or Tim Burton's take, their both aesthetically pleasing than this waste of space on the movie rental shelf (or Netflix queue). I give it a one merely because of the awful lines that are hilarious, but you can still miss the film just watch this  http://www.youtube.com/watch?v=SRH-Ywpz1_I",
      "review_date": "2012-01-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I really hate Batman & Robin (not the Dynamic Duo, just the floppy Joel Schumacher movie). If it weren't for the Governator, maybe Mr. Freeze should've been singing the blues in his flawless acting career rather than freezing Gotham City. II really hate Batman & Robin (not the Dynamic Duo, just the floppy Joel Schumacher movie). If it weren't for the Governator, maybe Mr. Freeze should've been singing the blues in his flawless acting career rather than freezing Gotham City. I thought this was my favorite movie in the Batman trilogy, but then I started laughing at Bane. How ugly is Bane and Poison Ivy (her lusty voice just sounded like a Bayonetta cliche). Alicia Silverstone looks worse as Batgirl. I thought Catwoman is the better hero than Batgirl. I like to see Poison Ivy and Harley Quinn naked in bikinis. The acting is terrible, the script doesn't make any sense, and totally unnecessary for a Batman sequel. But I enjoyed half of the movie, So I'll rent it because it's one of those superhero movies that's so bad, it's good.",
      "review_date": "2013-01-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This Batman movie is basically mocking itself by even existing. With stupidity and awful acting and a stupid villain who was horribly miscast along with weak action you have a spoof of a great superhero. But it is worse because it is twiceThis Batman movie is basically mocking itself by even existing. With stupidity and awful acting and a stupid villain who was horribly miscast along with weak action you have a spoof of a great superhero. But it is worse because it is twice the mockery of itself. I give this movie 5%.",
      "review_date": "2012-07-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gay as f**k, with no real congruity, Batman & Robin is a piece of s**t. Schumacher ruined the series with this gay bull***t that he added just because he is gay",
      "review_date": "2013-08-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The deep messages expressed within this film are handled with such care and accuracy that it puts The Godfather to shame. It is a well thought out film with lovable characters, an engaging story, and a tone akin to The Dark Knight trilogy. ItThe deep messages expressed within this film are handled with such care and accuracy that it puts The Godfather to shame. It is a well thought out film with lovable characters, an engaging story, and a tone akin to The Dark Knight trilogy. It cannot be missed.",
      "review_date": "2016-06-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Batman and Robin was hated so much because of all the emo goth kids who thought Batman's roots were in moody, melodramatic darkness. Couldn't be farther from the truth. B&R was a throwback to the glory days of campy comic book Batman and Robin was hated so much because of all the emo goth kids who thought Batman's roots were in moody, melodramatic darkness. Couldn't be farther from the truth. B&R was a throwback to the glory days of campy comic book silliness, back before he turned into an angst-filled goth magnet of muddled special effects sequences. Of course all the kids who think The Dark Knight is the greatest comic book movie ever to grace the screen are too young to realize that.",
      "review_date": "2009-06-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Oh Come on people, just because its bad doesnt mean its not entertaining.If you look at tis as a parody its hilarious.Now I know Joel Shumacher didn't make this as a comedy but after watching The Dark Knight its good to get back to the campyOh Come on people, just because its bad doesnt mean its not entertaining.If you look at tis as a parody its hilarious.Now I know Joel Shumacher didn't make this as a comedy but after watching The Dark Knight its good to get back to the campy fell of the Adam West t.v. show.And honestly go back and watch some of the show and then watch the opening with the ice skates.Joel Shumacher knew what he wanted to do and he did it.He returned the campiness from the darkness of the previous movies (especially Batman Returns).Looking at it from that perspective and also knowing the movie was made for kids(look at all the batman toys that came out that summer).It's a very fun movie ....maybe not in keeping with the true dark tone as such masterpieces as \"The Dark Knight Returns\" by Frank Miller or \"The Killing Joke\" by Alan Moore, but a fun ride none the less.And to all those who cant se the fun...I give you the ''COLD SHOULDER\".",
      "review_date": "2010-08-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a really great movie to me. Uma Thurman as poison ivy was a magnificent casting choice in my opinion. Arnold as Mr.freeze was also a good casting choice also. Robin and batgirl were good. George Clooney as batman was also pretty good",
      "review_date": "2016-01-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Batman and Robin is so awful its good. It is up there with Troll 2 and The Room. If you're longing for a good hard laugh, go watch it, preferably with friends who can point and laugh at Batman and Robin's nipple suits with you.",
      "review_date": "2012-07-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Everything about this movie is wrong, plain and simple. Everything. One may argue that it is a movie for kids to which I respond by saying that it doesn't even show respect to a 3 year old! I do like Michael Gough as Alfred so I have toEverything about this movie is wrong, plain and simple. Everything. One may argue that it is a movie for kids to which I respond by saying that it doesn't even show respect to a 3 year old! I do like Michael Gough as Alfred so I have to respect the fact that he remained in the series and felt its decline.",
      "review_date": "2011-02-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "this is the best film i ever saw! i really don't understand why the critics are so bad... well, so many jealous people;) ...............................................................................",
      "review_date": "2012-04-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Batman & Robin gets a bad rap.Everyone wants the Batman series to be dark and intense like the Nolan movies or gothic like the Burton movies. But take a look back at the early comic books or the 1960's TV show. Batman wasn't just for adults,Batman & Robin gets a bad rap.Everyone wants the Batman series to be dark and intense like the Nolan movies or gothic like the Burton movies. But take a look back at the early comic books or the 1960's TV show. Batman wasn't just for adults, it was made for kids too. So yes, the Power Ranger-esque dialogue and fighting won't satisfy anyone above 13 years old, but it delighted my 6 year daughter for whom the Nolan movies are boring and the Burton movies too dark. Let the kids have their fun, dammit!",
      "review_date": "2013-11-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Before i started writing this review, this week i watched all 4 classic batman movies released between 1989 and 1997 and I just finished this one 20 minutes ago and i really loved it.  The movie was good, cast was made of golden people likeBefore i started writing this review, this week i watched all 4 classic batman movies released between 1989 and 1997 and I just finished this one 20 minutes ago and i really loved it.  The movie was good, cast was made of golden people like Clooney, Thurman and Schwarzenegger. I really did not understand why no one did loved this one as much as i did. Action was fine, The scenario was excellent. But i read the critics for this movie in wikipedia and believe me, some people even think that this movie has some homosexual content in it, just because it shows the a** of Batman and Robin when they equip their armor...\rIt was a really good adventure if you ask me and i really enjoyed it. The only disliked thing i didn't like in this movie was some overrated one-liner cliche jokes of Schwarzenegger which if you ask me, was still ok, but sometimes was not necessary. If you are not among people who watches movies just to kill them, i think you will enjoy and won't regret this one.",
      "review_date": "2011-08-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI can not tear at this movie any more than it has already been destroyed. The plot is silly, Clooney is a ridiculous Batman, Robin's whiney, too many one-liners from Schwarzenegger, the characters are bland, and it's overall really bad. But this time watching through i noticed how terrible and cartoonish a lot of the special effects are. Although I must say that it is so stupid and bad, that I find it absolutely hilarious unlike Batman Forever which I think was supposed to be more intentionally funny. Watch it for some good times with a movie that's so bad, it's good.",
      "review_date": "2013-08-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I have to give credit where credit is due and say that Joel Schumacher sure did break the mold for Batman movies in the sense that he must have felt that Batman deserved to be put down a peg or two and with this in mind he set out to make aI have to give credit where credit is due and say that Joel Schumacher sure did break the mold for Batman movies in the sense that he must have felt that Batman deserved to be put down a peg or two and with this in mind he set out to make a horrendous pile of trash that even rivals Catwoman for worst super hero movie. If you are still considering watching this then I instead suggest that you buy the DVD and then smash/burn it so that no other poor soul will have to experience this abomination. If you are willing to sacrifice yourself and your money for the good of one poor soul then you may just be a better Batman than George Clooney!",
      "review_date": "2013-09-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Batman & Robin may be bad, but I like to think of it as a guilty pleasure. You watch it sometimes, and think afterwards, \"Damn, what a bad movie this was. So, maybe in a couple months I'll re-watch it?\"",
      "review_date": "2013-09-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not a great movie at all, its a definite step down from Burton's original Batman and even from Batman Forever. Its campy as hell, the acting is way too over the top and cheesy (though I enjoyed Arnold's Mr.Freeze) and the script seems like itNot a great movie at all, its a definite step down from Burton's original Batman and even from Batman Forever. Its campy as hell, the acting is way too over the top and cheesy (though I enjoyed Arnold's Mr.Freeze) and the script seems like it could have been written by a kindergartner. Batman and Robin is just not a great movie, this was merely a cash grab to sell toys and it definitely shows.",
      "review_date": "2016-11-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Director Joel Schumacher has a few tricks up his selves behind the camera, apparently the whole concept of this film is to sell toys. Schumacher's other batman movie ('Batman Forever') was  entertaining with a comedic sidekick villain JimDirector Joel Schumacher has a few tricks up his selves behind the camera, apparently the whole concept of this film is to sell toys. Schumacher's other batman movie ('Batman Forever') was  entertaining with a comedic sidekick villain Jim Carey's little one liners. The dumbest thing we have to watch is George Clooney  being batman, who does nothing in the film that are just worth watching. When  Screenwriter Akiva Goldsman making Batman like able he is actually unlike able by letting Clooney be \"Clooney\"  meanwhile Arnold's funny one liners are ruining this film. With a dumb story a dumb cast this movie is a parody of the film batman. Grade C-",
      "review_date": "2015-03-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I laughed during the whole movie--because it was so miserably hilarious at attempting to be serious. All though it was all fun and games laughing at this steaming turd on my TV, I would be angered and slighted if I paid for a movieI laughed during the whole movie--because it was so miserably hilarious at attempting to be serious. All though it was all fun and games laughing at this steaming turd on my TV, I would be angered and slighted if I paid for a movie ticket--but considering how bad even the previews were, I wouldn't be that stupid to see it in theaters.",
      "review_date": "2014-11-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There is not one redeeming quality in this film. The acting is way over the top, the premise is nonsensical, the characters are useless, the action sucks, the visuals hurt the eyes, and the puns are just unbearable. However, I wouldn't beThere is not one redeeming quality in this film. The acting is way over the top, the premise is nonsensical, the characters are useless, the action sucks, the visuals hurt the eyes, and the puns are just unbearable. However, I wouldn't be lying if I said this was a guilty pleasure film of mine.",
      "review_date": "2014-12-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Batman and Robin is directed by Joel Schumacher and stars George Clooney, Chris O'Donnel, Uma Therman, and Alicia Silverstone. Batman and Robin has a reputation for being one of the worst movies ever made next to the Room and Plan 9 fromBatman and Robin is directed by Joel Schumacher and stars George Clooney, Chris O'Donnel, Uma Therman, and Alicia Silverstone. Batman and Robin has a reputation for being one of the worst movies ever made next to the Room and Plan 9 from outer space. It took the character of Batman and changed him to a overly cheesy one. Speaking of cheesy, that's exactly what the acting is like. The acting is if you took Adam Sandler and multiplied it by 1,000. The movie is overly silly and is to campy, especially from what Tim Burton's Batman showed us. If this were a comedy, this movie would get a 10/10. But unfortunately, that is not the case. 1/10",
      "review_date": "2015-05-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "NOTHING GOOD about this movie!  AWFUL! HORRENDOUS! ONE OF THE WORST MOVIES OF ALL TIME AND ONE OF IF NOT THE WORST SUPERHERO MOVIE OF ALL TIME. THANKS FOR NOTHING SHUCMACHER",
      "review_date": "2015-05-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Piece of **** of movie that is **** gay and very cheezy.The acting is A **** JOKE! **** BATMAN AND ROBIN! The only awesome BATMAN movies are Tim Burton's 1989 Batman and Christopher Nolan's Batman trilogy.",
      "review_date": "2015-08-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Where do I begin? Well first of all this movie has none of the dark tone that was left in \"Batman Forever\". It feels like the Adam West Batman only not fun. The combination of villains makes no sense! Ice and plants just do not mix! The plotWhere do I begin? Well first of all this movie has none of the dark tone that was left in \"Batman Forever\". It feels like the Adam West Batman only not fun. The combination of villains makes no sense! Ice and plants just do not mix! The plot is just so dumb! The writing is really awkward. Most of the choices of actors had real potential, but they just bombed! The costumes are over the top. They make the actors look like action figures. Heck, this whole movie feels like a toy commercial. A really dumb, annoying, colorful commercial. Then we come to the anatomically correct Batsuits and Bat credit card. NO COMMENT. There are only two things I like in this movie, surprisingly. I personally like MOST of the music score. Then of course, I love Arnold Schwarzenegger's performance as Mr. Freeze. He's just so funny! Overall, this movie is my least favorite thing to watch in the whole world. If you liked it, then watch it for as long as you want. No one is stopping you.",
      "review_date": "2015-10-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Batman and robin is terrible. It's sad they left burton's dark tone for this goofy, childish, unfunny movie with a stupid plot. Also mr freeze's puns make it even worse!",
      "review_date": "2016-08-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Batman and Robin is the best movie of all time only stupid retarded kids would it is stupid this movie better than the movies and supehero movies in the universe hi mr freeze I Batman.  You should watch this movie right now and pay me moneyBatman and Robin is the best movie of all time only stupid retarded kids would it is stupid this movie better than the movies and supehero movies in the universe hi mr freeze I Batman.  You should watch this movie right now and pay me moneyPay me money Pay me money pay me money",
      "review_date": "2017-12-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "After two great Batman films, Tim Burton had left the series for good. It was now up to Joel Schumacher to mach up with the same level as the previous two films. The result is not bad, but doesnt match up to 'Batman' and 'Batman Returns'. IfAfter two great Batman films, Tim Burton had left the series for good. It was now up to Joel Schumacher to mach up with the same level as the previous two films. The result is not bad, but doesnt match up to 'Batman' and 'Batman Returns'. If you have never seen this movie before, it is still allright, but i would suggest to skip the previous two films, or even better, 'The Dark Knight Trilogy\"!",
      "review_date": "2018-01-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Is Batman & Robin one of the worst movies ever? No, not really. Is it terrible? Oh, hell yeah. It sucks. You've heard the criticisms already: Ice puns, bat-nipples, too cartoony, etc.I agree with these criticisms, but why don't I call thisIs Batman & Robin one of the worst movies ever? No, not really. Is it terrible? Oh, hell yeah. It sucks. You've heard the criticisms already: Ice puns, bat-nipples, too cartoony, etc.I agree with these criticisms, but why don't I call this one of the worst movies ever? Well, without giving away spoilers, around the last third of the film, Bruce Wayne and Alfred are just talking to each other. They even mention how they view each other as father and son! That's never been done before in any of the previous Batman films. It adds a little more human emotion to Bruce that we didn't get up to that point.Still, everything else in the movie stinks.",
      "review_date": "2018-03-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is the end of \"Batman\" franchise, started by Tim Burton and continued by Joel Schumacher throughout the nineties. This time, Schumacher directed an almost entirely new cast, headed by George Clooney (as the black knight), ArnoldThis film is the end of \"Batman\" franchise, started by Tim Burton and continued by Joel Schumacher throughout the nineties. This time, Schumacher directed an almost entirely new cast, headed by George Clooney (as the black knight), Arnold Schwarzenegger (as Mr. Freeze), Chris O'Donnell (in the role of Robin) and Uma Thurman (as Poison Ivy). An star-cast that could, in fact, have ensured the success of this film, but that was completely prevented from doing so by an incompetent director and a script that would have better utility serving as toilet paper.In fact, the Batman franchise, that this movie puts an end (finally), started badly with \"Batman\" (1989) but only managed to worsen constantly, in a dizzying descent to the dustbin of the Seventh Art. This film is beyond comprehension and good taste: the meager existing humor moments are regrettable, the scenarios are absurd, the costumes missed any attempt of realism, the picture is rather amateurish and the actor's interpretation seems confused and superficial, with each actor playing alone, according his own criteria. At this point, it lacked a firm director who could do the work better.In my opinion, its not by chance that the franchise ended. It was the best thing to do because it began under bad premises and all that is born crooked rarely straightens. Nevertheless, these films continued, for almost ten years, to be a spot on Batman's figure, excommunicating it from cinema until 2005, the year of his more than deserved rehabilitation, with \"Batman Begins\". In addition to these losses, the franchise also marked negatively the understanding of the audience regarding cinematographic comic-book adaptations, but this brand passed quickly thanks to the interesting (some better than others) adaptations made since the year 2000. For all these reasons, and especially for \"Bat-fans\", the end of this franchise was especially expected, although perhaps not left many good memories.",
      "review_date": "2018-02-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Batman & Robin, directed by Joel Schumacher, is the story of Batman's quest to save Gotham from Mr. freeze. I HATE this movie. The performances are atrocious, and the direction is awful.",
      "review_date": "2018-03-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great movie,a real hero classic. But,the movie really makes me wanna poke my eyes out when it shows bat a** , bat boobs and...bat nipples ? xD",
      "review_date": "2018-07-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I’ll give it credit, at least it knew what it wanted to be. A goofy, very goofy, movie. For that I won’t give it a zero...",
      "review_date": "2019-03-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Absolutely the worst Batman film ever, really hated most parts of the movie, too many \"Ice\" puns, too kid friendly, and too much weirdness. Batman 1989 and Batman Returns will always be the best batman films",
      "review_date": "2020-04-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Batman and Robin is the perfect example of how not to make a comic book film. This film is so horrendous that it enraged not only hardcore fans of the caped crusader, but the entire human race.",
      "review_date": "2019-06-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A ton of fun to watch and laugh at it.Arnold is either having the time of his life or suffering through the worst experience ever and either way I love him in this.\n\nThis movie's bad. Really bad. But I'm so glad it exists.\nI can't imagineA ton of fun to watch and laugh at it.Arnold is either having the time of his life or suffering through the worst experience ever and either way I love him in this.This movie's bad. Really bad. But I'm so glad it exists.I can't imagine living in a world without the disasterpiece that is Batman & Robin.",
      "review_date": "2020-09-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "DESTROY BATMAN'S CHARACTEREverything about this movie is wrong.Very but very bad storyline,acting and BATMAN.Complete Trash.One Of The WORST Movies I Ever Watched.",
      "review_date": "2019-10-19",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 121,
  "genres": [
    "Action",
    "Sci-Fi",
    "Crime"
  ]
}