{
    "title": "L.A. Confidential",
    "rating": 8.6,
    "release_date": "1997-09-19",
    "genre": [
        "Drama",
        "Mystery",
        "Thriller",
        "Crime"
    ],
    "summary": "Based on James Ellroy's novel about the movie industry, corrupt cops, tabloid journalism, gangsters and sexual obsessions of every stripe, L.A. Confidential is set in 1950's Los Angeles.",
    "critic_reviews": [
        "A movie bull's-eye: noir with an attitude, a thriller packing punches. It gives up its evil secrets with a smile.",
        "A juicy noir stew of amorality that's the best thing since \"Chinatown.\"",
        "A tough, gorgeous, vastly entertaining throwback to the Hollywood that did things right. As such, it enthusiastically breaks most rules of studio filmmaking today.",
        "An irresistible treat with enough narrative twists and memorable characters for a half-dozen films.",
        "L.A. Confidential, with an exceptional ensemble cast directed by Curtis Hanson from James Ellroy's densely plotted novel, looks to be the definitive noir for this particular time and place.",
        "He's (Hanson) never before generated the kind of heat inside a picture--and out of it--that he has with L.A. Confidential.",
        "One of the best crime dramas to come along in years.",
        "Seductive and beautiful, cynical and twisted, and one of the best films of the year.",
        "There are so many things to enjoy here.",
        "As the story unfolds, carefully and elaborately, what develops is not just a remarkably intricate crime tale but a brilliant and compassionate story of people who struggle to rise above their flawed nature. This may be the best movie of the year; it's definitely one of the greatest crime films of all time.",
        "Voluptuously engrossing.",
        "You have to pay close attention to follow the double-crossing intricacies of the plot, but the reward for your work is dark and dirty fun.",
        "See L.A. Confidential. Be astonished at discovering anew how very, very satisfying movies can still be. And how fine that can feel.",
        "This movie restores genre elements to a level of potency that's disturbing, satisfying, and rare as hell.",
        "This sleek adaptation of James Ellroy's dauntingly complex novel has the black-and-white tabloid soul of an old \"Confidential\" magazine.",
        "Lately, it seems that film noir has become the province of independent productions. As a result, it's refreshing to see a big-budget, studio effort of this sort that does nearly everything right.",
        "Hanson delivers something ever rarer in film culture, not a new film noir but an old-fashioned total movie, somehow of a single piece.",
        "That rare mainstream cop thriller that refuses to telegraph its outcome in the first 15 minutes or, for much of its running time, to tell you how to feel about its protagonists.",
        "A movie of shadows and half lights, the best approximation of the old black-and-white noir look anyone has yet managed on color stock.",
        "Full of period locations, costumes, and one very clever Lana Turner gag, it's easy to see why Ellroy is so pleased with the film.",
        "A glamorous, alluring entertainment that revels in the artifice of Hollywood while exposing its corrupt heart, L.A. Confidential pays stylish homage to some of the great film noirs of the distant and recent past.",
        "\"The Big Sleep\" and \"The Maltese Falcon\" echo loudly throughout.",
        "The story is so complicated that the movie can't quite make it clear, but the picture has impressive energy and high-intensity performances from Kevin Spacey, Danny DeVito, and Guy Pearce.",
        "A movie that refuses to kick into gear until it's far too late.",
        "Director Curtis Hanson keeps the hugely complicated story zooming along the boulevard of broken dreams without losing sight of the details that make the trip worthwhile."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "This is the best movie all the time! I don't kidding. I saw this movie about ten times and I always enjoy it. If you don't see it, you must watch it! I hope you like too.",
            "review_date": "2012-07-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nWith it's brilliant pacing and neo-noir crime drama elements. L.A.\rConfidential stands one of the best crime films ever made. The\rincredible thing about this movie is acting,seems like every actor is\rliving the character they are in. Russel Crowe just stands out as the\rtough cop and a man who hates women beaters,rapers and killers.His\rvoice tone through the entire movie helps building his character,the\rother great aspect as anti-political. Kevin Spacey ,what could i say\r,he is just awesome,his turn as a likable and smart Sgt really gives\rthe plot a go-ahead.Especially the scene where with James Crowell. Guy\rPearce ,just nailed the character of Ed Exley.His transformation from a\rfame-lover and political smart officer to a real justice seeking man is\rvery good. Kim Basinger ,she is just beautiful and clever.she doesn't\rlook so aged and her charm and acting deserved the academy. Every other\rsupporting actor Danny DeVito,James Cromwell and David Strathairn are\rall good. Under Curtis Hanson's brilliant direction and Curtis Hanson\rBrian Helgeland's cleverly adapted screenplay from the novel of same\rname is quite interesting. Overall,this is a thrilling and one of the\rbest neo-noir drama film with unexpected and great twists.",
            "review_date": "2013-12-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Awesome film. Great acting, directing, and wow, I was left guessing all the way until the end. Not many flaws I can think of and certainly worthy of all the praise it has received. Brilliant.",
            "review_date": "2014-01-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Strongly written and acted, this film is an instant classic.",
            "review_date": "2013-03-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "L.A. Confidential is a superb noir classic with a stylish atmosphere that makes L.A. Confidential smoother then jazz. This noir classic is a thrill ride that is one of the greatest films of all time.",
            "review_date": "2013-03-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Absorbing, tangled mystery case of police corruption. Remarkable epoc screenplay located in L.A in 5o´s supported by outstanding, strong casting; particullarly Kim Basinger in the role of a femme fatale. Shall not miss it.",
            "review_date": "2017-05-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Although Kim Basinger's performance was good, it was not Oscar worthy.  The film, on the other hand was worthy of its nomination.  Kudos to the casting director for hitting the \"actor to character\" spot on.  This film holds your attentionAlthough Kim Basinger's performance was good, it was not Oscar worthy.  The film, on the other hand was worthy of its nomination.  Kudos to the casting director for hitting the \"actor to character\" spot on.  This film holds your attention until the end and leaves you with a feeling that you might have misjudged the characters.",
            "review_date": "2011-02-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "L.A. Confidential perfectly captures the dark and dirty world of a 1950s pulp-noir. The film, as is often the case with noir, is all about contrast - whether it's the contrast between sun-kissed villas and dingy slum interiors, or theL.A. Confidential perfectly captures the dark and dirty world of a 1950s pulp-noir. The film, as is often the case with noir, is all about contrast - whether it's the contrast between sun-kissed villas and dingy slum interiors, or the contrast between a cop following the law to the letter and another bending the rules to get the job done, or even the contrast between steamy romance and brutal violence. The various plot-lines that run parallel to each other feel episodic, but all are engaging and build to an immensely satisfying conclusion.The performances across the board are strong,but of particular note are Guy Pearce's by-the-book lead protagonist, Kevin Spacey's celebrity super-cop and James Cromwell's formidable police chief - they cast make the already excellent script shine. You have all the usual noir hallmarks - the femme-fatale (Basinger), the quick-talking, smart-ass reporter (DeVito), dirty criminals and even dirtier cops, yet L.A. Confidential still manages to be creative. For instance, few films that I can think of put such a focus on the public face of a police force - the maintenance of a media machine that is required to keep the authorities looking like the good guys. The film is nigh-on flawless, and a joy to watch.",
            "review_date": "2011-10-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "L.A. Confidential is a startling, beautiful police drama that is flawless except for one aspect. Its characters escape tragedy far too often and easily, but that is a small flaw, and it is overshadowed by the power of the performances theL.A. Confidential is a startling, beautiful police drama that is flawless except for one aspect. Its characters escape tragedy far too often and easily, but that is a small flaw, and it is overshadowed by the power of the performances the actors give.",
            "review_date": "2012-11-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the greatest crime thrillers, 'L.A. Confidential' is a flawless film with the direction, acting, cinematography, and script to support it. It defeats 'Titanic' numerous times over, and it never gets tiresome. This should have swept theOne of the greatest crime thrillers, 'L.A. Confidential' is a flawless film with the direction, acting, cinematography, and script to support it. It defeats 'Titanic' numerous times over, and it never gets tiresome. This should have swept the Oscars, unfortunately 'Titanic' was sad enough for people to love it.",
            "review_date": "2014-06-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "L.A. Confidential was an awesome movie. Slow, but picks up quick like it does for Pulp Fiction, and ends up turning into the second Godfather or Goodfellas or something.",
            "review_date": "2014-09-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nMore than almost any other crime thriller I've seen, L.A. Confidential invites audience investment, leading us along, convincing us we've got an idea of where it's headed before revealing a card that was there the whole time. I was riveted by this story, active in trying to figure out where the mystery was headed and thunderstruck by a shocking third act denouement.",
            "review_date": "2020-03-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "L.A. Confidential can be attributed to perhaps the best stage of Hollywood cinema (beautiful 90s). There is a smart plot, a great cast, a good soundtrack and camera work. One of the most striking examples of noir. A well-conveyed historicalL.A. Confidential can be attributed to perhaps the best stage of Hollywood cinema (beautiful 90s). There is a smart plot, a great cast, a good soundtrack and camera work. One of the most striking examples of noir. A well-conveyed historical era. Clearly the best film of Curtis Hanson's career.",
            "review_date": "2021-05-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "And to think Titanic won the best picture Oscar over this.A multi-faceted film that combines journalism, sex, police, hollywood & gangsters in this smart, well-paced classic.A must see.",
            "review_date": "2021-01-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"L.A Confidential\" is not JUST a gangster movie. It's one that's cheerfully paced yet cynically written, where the three main characters compete against each other with beautiful state-of-art cinematography.",
            "review_date": "2011-12-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "L.A. Confidential may be one of the few book adaptations that holds up (The Girl With The Dragon Tattoo does too) and despite its very loose adaptation it is flawlessly executed with standout performances from the likes of Kevin Spacey andL.A. Confidential may be one of the few book adaptations that holds up (The Girl With The Dragon Tattoo does too) and despite its very loose adaptation it is flawlessly executed with standout performances from the likes of Kevin Spacey and James Cromwell. However the film really belongs to Guy Pearce's Ed Exley who is the by the book character everyone loves to hate. This may be an oversimplification on my part but his performance is flawless, invoking all the emotions, especially as he reminisces about the death of his father in a gripping scene between him and Spacey's Jack Vincennes (whose answer to why he became a cop is brilliant). At its best LA Confidential is a film of two halves but each episode is cleverly put together with each character shining. The film embraces the period, including the obsession with noir and pulp to great effect with Kim Basinger bringing to life the role of the Femme Fatale as she effortlessly manipulates those she sees while also showing her vulnerable side during her scenes with Russell Crowe's Bud White (A career highlight). The story follows the brutal murders of the staff and customers of a late night coffee shop called the Nite Owl. However a plot that starts out simple frays off into multiple sub plots that are equally intriguing and cleverly put together providing one of the most intelligent look at the inner workings of a police station and the people we trust to solve our crime (The game L.A. Noire tries to do the same but falls flat). The film is a exhilarating tale of corruption, murder, sex and general wrong-doing that shows that there is no black and white, only shades of grey. Its everything a perfect noir should be and more. A timeless classic.",
            "review_date": "2011-10-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A masterpiece, combining a complex storyline with an amazing cast. A must see for all movie fans. The twist at the end will definetly make you want to watch it again to see what you missed. Remains one of my favorite films.",
            "review_date": "2011-03-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Best plot, best acting, especially Russell Crowe and Kevin Spacey.",
            "review_date": "2009-07-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This film is the true definition of a blockbuster, that met and exceeded every expectation. L.A. Confidential is loaded with star power and filmed in a style of films thirty years it's senior. Based on a true story, Three L.A. Detectives,This film is the true definition of a blockbuster, that met and exceeded every expectation. L.A. Confidential is loaded with star power and filmed in a style of films thirty years it's senior. Based on a true story, Three L.A. Detectives, with different reputations and personalities, team up to solve a brutal murder that involves one of their own. The film is loaded with twists and turns that will lead you down many different paths and thanks to the quality of the acting, it's all believable. Just how good was this movie? In 1998, it received NINE Academy nominations, one of the highest number of nominations ever. L.A. Confidential also put Russell Crowe on the map. This film is an extremely exciting 'who done it' mystery that will leave you on the edge of your seat and begging for more. The story is top notch, the acting is just about as good as it gets, and you will be hard pressed to find a better mystery. I can't possibly recommend this film enough!",
            "review_date": "2013-02-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Crime thriller. Delicious feast of a movie, beautifully shot, top-notch acting, interesting plot, sharp script. Like a three course meal with your favourite main, you'll want to choose it again, even when you remember the whole thing, it'sCrime thriller. Delicious feast of a movie, beautifully shot, top-notch acting, interesting plot, sharp script. Like a three course meal with your favourite main, you'll want to choose it again, even when you remember the whole thing, it's just better than most of the alternatives so you'll go back to it over the years and then you'll appreciate those little touches you'd forgotten about. If you haven't seen it for a while it's one of the best to take round the block again.",
            "review_date": "2016-08-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Popcorn flick done right; though regrettably with some of the sentimentality intact.",
            "review_date": "2008-07-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I go look on other film databases, especially IMDb, L.A Confidential is underrated. It kind of reminded me of Pulp Fiction because of its billboard, but really, this is better than Tarantino's piece. Pulp Fiction was an amazing movie, I go look on other film databases, especially IMDb, L.A Confidential is underrated. It kind of reminded me of Pulp Fiction because of its billboard, but really, this is better than Tarantino's piece. Pulp Fiction was an amazing movie, the third greatest movie of the decade, but LA is the second best because of how well Guy Hamilton portrays the story. And obviously Goodfellas is in first, this crime epic is must see.",
            "review_date": "2008-11-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The cast does a fine job but I think the real gem here is the storytelling. There are so many moving pieces and the writers do such a great job at keeping you guessing until the end. It's a very well told story and it managed to capture andThe cast does a fine job but I think the real gem here is the storytelling. There are so many moving pieces and the writers do such a great job at keeping you guessing until the end. It's a very well told story and it managed to capture and keep my interest throughout.",
            "review_date": "2018-11-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Maybe its just me but nearly every single character in the movie came across as a phony. L.A Confidential is nothing more than a standard cop show you see every day on T.V.",
            "review_date": "2015-01-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great detective-like storyline with some twists. Perfect cast and well-written characters. Atmosphere similar to recent \"Gangster Squad\" and video game \"LA Noire\", so if you liked one of those, you must watch this!",
            "review_date": "2013-09-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not as good as I expected. I had a fairly good time though. Kevin Spacey as always nailed it. The others did good too, especially Basinger. Crowe's character provided some amusing scenes. The characters were better done than the plot.",
            "review_date": "2013-03-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "L.A. Confidential is a well-made drama that may get a little dry and stale at parts, but immediately picks up the action again and delivers an Oscar-worthy scene that keeps you engaged, so you decide to watch it until the end.",
            "review_date": "2013-09-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "When I saw this movie in 1997, these glowing reviews had preceded it, along with comparisons to the movie Chinatown.  After seeing it, I thought that surely these critics and readers must have been on some powerful drug, or were so desperateWhen I saw this movie in 1997, these glowing reviews had preceded it, along with comparisons to the movie Chinatown.  After seeing it, I thought that surely these critics and readers must have been on some powerful drug, or were so desperate for a movie that had any kind of a story, they were willing to call it a masterpiece.  I recently viewed it again, hoping I might have overlooked something or other.  Would that I had.  This big sprawling mess of a movie is no better now than it was then.  What in the world all the hoopla was about is a mystery.  One  thing about it was the continued urge of the days directors to have \"homages' to other movies and directors, a nitwit idea started in the 60s.  The reason this was fairly new is because the directors that  preceded them were too busy inventing the movies to indulge in  \": homages\"",
            "review_date": "2016-09-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A true masterpiece. The main characters' arcs are incredible, and so are the performances by everyone in the cast. Screenplay, score, ending... everything in it is remarkable.",
            "review_date": "2021-05-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "the book was excellent, and it is always quite challenging to do the movie of the same level, but the author did it perfectly and the film is just awesome",
            "review_date": "2021-10-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not alot of movies deserve a 10. Chinatown (this movie is compared to LA several times) does.It doesn't have the same mood and technical/directing brilliance that Chinatown has, but it comes very close..The book by Ellroy is brilliant Not alot of movies deserve a 10. Chinatown (this movie is compared to LA several times) does.It doesn't have the same mood and technical/directing brilliance that Chinatown has, but it comes very close..The book by Ellroy is brilliant very suitable for moviescripting. Now please make a movie of his magnum opus: the cold six thousand!! And can't give a bigger complement to the director... you're the man for the job.",
            "review_date": "2007-10-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A fairly impressive crime drama with good performances and writing and gripping story.",
            "review_date": "2019-07-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The best thing about this film is the plot. But because it's just a film adaption of James Ellroy's novel I won't give bonus points for that. A bit too slow sometimes but they've got a good cast and a nice 50's feeling. Story is still theThe best thing about this film is the plot. But because it's just a film adaption of James Ellroy's novel I won't give bonus points for that. A bit too slow sometimes but they've got a good cast and a nice 50's feeling. Story is still the best, however.",
            "review_date": "2012-08-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Crooked cops. The mystery and allure of Hollywood in the '50s. Death, double-crossing, and secret alliances. Paparazzi waiting to get that one breakthrough picture. These are just some of the elements that make Curtis Hanson's L.A.Crooked cops. The mystery and allure of Hollywood in the '50s. Death, double-crossing, and secret alliances. Paparazzi waiting to get that one breakthrough picture. These are just some of the elements that make Curtis Hanson's L.A. Confidential one of the most exhilarating noir thrillers to reach the screen in recent memory. With a script that pays homage to the films of the '40s and '50s and may remind some viewers of the likes of Chinatown, L.A. Confidential proves that every period piece thriller doesn't have to go the way of Mulholland Falls.\r It's 1953, and the City of Angels is in the grip of an unprecedented wave of violence. Cops on the take turn their backs on crimes. The jailing of a major mob boss leaves a vacuum of power that leads to a turf war. Then comes the Night Owl Massacre, where six victims (including an ex-cop) are brutally gunned down at the Night Owl Café. The police begin routine investigations, but it quickly becomes apparent that this is no ordinary multiple homicide.\r The difference between L.A. Confidential and numerous other, more routine films of the genre begins with the script. Smart, insightful, and consistently engaging, Hanson and Brian Helgeland's faithful adaptation of James Ellroy's novel is a real treat for anyone who views film as a medium for both art and entertainment. The movie is filled with small twists and turns, but not so many that the plot becomes difficult to swallow or to follow. The subplots - and there are several - are as well-developed as the main story, and the supporting characters are presented as more than mere colorful misfits decorating the background.\r Atmosphere is another of L.A. Confidential's strengths. This is Technicolor noir - a film made in color that has black-and-white sensibilities. Like Devil in a Blue Dress, this movie proves that multi- hued film stock does not automatically hamstring such a production. And, while the Los Angeles of L.A. Confidential may not accurately reflect the real city during the '50s, it nevertheless represents what we expect Hollywood to have been like, from the glitzy buildings to the cool-but-beautiful femme fatales and the sure-handed, silent men.\r The three leads give strong performances. Spacey's Jack is cocky and confident, Crowe's Bud is brimming with tightly-controlled anger, and Pearce's Ed is caught between his towering ambition and his desire to do the right thing. It's interesting to note that two of the three main actors in this distinctly American tale are Australian. Despite having appeared opposite Denzel Washington in Virtuosity, Crowe is best known for roles in the likes of Proof and Romper Stomper. Pearce's big break came when he cross-dressed in The Adventures of Priscilla, Queen of the Desert. It's worth noting that both actors have perfected their American accents to the point where it's virtually impossible to detect a down under twang. Meanwhile, the supporting performers include James Cromwell as the chief of police, Kim Basinger as the woman torn between Ed and Bud, and David Strathairn as a high-class pimp.\r It takes L.A. Confidential nearly two and one-half hours to spin its tale, but the time passes remarkably quickly. There's hardly a wasted moment in the entire movie, and director Hanson (whose previous credits include The Hand that Rocks the Cradle and The River Wild) maintains tight control of every scene. Lately, it seems that film noir has become the province of independent productions. As a result, it's refreshing to see a big-budget, studio effort of this sort that does nearly everything right. L.A. Confidential is likely to be one of the best offerings of the early Autumn.",
            "review_date": "2015-05-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "When I got the attention of L.A. Confidential, I immediately realise that it's directed by Curtis Hanson, the same guy who directed The Hand That Rocks the Cradle. It had some big stars in this like Kevin Spacey, Russell Crowe, Guy Pearce,When I got the attention of L.A. Confidential, I immediately realise that it's directed by Curtis Hanson, the same guy who directed The Hand That Rocks the Cradle. It had some big stars in this like Kevin Spacey, Russell Crowe, Guy Pearce, Kim Basinger and Danny DeVito. It had a good story about three police officers and detectives investigating the \"Nite Owl case\" and other stuff. Kevin Spacey is Det. Sgt. Jack Vincennes who moonlights as a technical advisor on Badge of Honor, a popular TV police drama series. He is also providing Sid Hudgens, publisher of the Hush-Hush tabloid magazine. Russell Crowe is Officer Wendell \"Bud\" White who is in love with Lynn Bracken and he investigates the Nite Owl case where his partner is killed. Guy Pearce is Det. Lt. Edmund \"Ed\" Exley who is investigating the Nite Owl case. His father is murdered by a man who Exley nicknames \"Rollo Tomasi\". I kinda like the part where the police and criminals are fighting at \"Bloody Christmas\". The story is great and well written and it is faithful to the novel which is based on by James Ellroy. Kim Basinger is really good as Lynn Bracken, the directing style is immense when something goes wrong and the police are on the crime investigation and the cinematography is great. I know I say that quite a lot but what can I say? They immense. As much I loved it for it's story, directing, editing, art design and cinematography and everything about this. L.A. Confidential is a impeccable neo-noir crime film filled with characters, mystery and beautifully crafted set pieces. If you guys haven't seen it then I will definitely recommend you watch it. It is very good, really fantastic and very Hush-Hush.",
            "review_date": "2019-03-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It is not a great police movie IS the police movie. The characters they are very successful. There is not compared with other movie, except Touch of evil. Magnificent!",
            "review_date": "2017-04-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "come to los angeles..L.A. ConfidentialA well set out webs of sub-plots that is ready to flip on cue with some awe-struck moments and brilliant performances, L.A. Confidential is that rare crime-drama that puts spotlight on scary issues.",
            "review_date": "2018-01-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This film is an excellent cinematic tribute, paying homage, in a way, not only to the golden age of American cinema, but also to cinema noir, with a style that largely resembles the stylized and gloomy look of these films, but devoid ofThis film is an excellent cinematic tribute, paying homage, in a way, not only to the golden age of American cinema, but also to cinema noir, with a style that largely resembles the stylized and gloomy look of these films, but devoid of shadows and something dark that characterizes them. The film is now a little forgotten, or at least I haven't seen it so much on TV specialized movie channels... but the fact is that it is a remarkable work of cinema, won two Oscars (Best Actress, for Kim Basinger, and Best Adapted Screenplay) and received nominations for seven more statuettes (Best Film, Best Director, Best Cinematography, Best Art Direction, Best Editing, Best Sound and Best Soundtrack). It was, in fact, the great film of 1997, even better than \"Titanic\".The film takes place in the golden years of Hollywood: shortly after the arrest of the biggest mobster in the city, the police seem determined to prevent the formation of new crime syndicates, but gradually the rot and corruption of the police force itself becomes evident. Among them, three policemen stand out, for different reasons: the brutal Bud White, the self-centered Jack Vincennes and the determined and incorruptible Ed Exley. Each of them, alone and in his own way, finds himself investigating the same crime: the death of a policeman in a massacre that took place inside a restaurant, and his eventual relationship with a mobster who runs a deal of luxury call-girls, surgically operated to resemble cinema stars.I loved this movie, in all its engaging ways. The script is extraordinary and develops in a wonderful way, giving each of the characters the time to develop, even some that would otherwise be relegated to an amorphous background. As in a good film noir, women are not as innocent as they appear, and the police are far from being the heroes. There are no one-sided characters, they all have a rich dark core, which the script takes as much advantage as it can.The cast is truly colossal and is full of big names. Kevin Spacey achieves, with this film, one of his best works as an actor, at least for me, and the same can be said of Kim Basinger, in a somber character that reminds us of one of the most wronged and forgotten actresses of the golden age of Hollywood : Veronica Lake. Did the Oscar given to Basinger this year also end up being, indirectly, a posthumous prize for this great actress, whom Hollywood devoured, but never esteemed or honored? In addition to these two actors, the film also features an excellent work by two Australian actors, Russel Crowe and Guy Pearce, both at the best level, and a great Danny De Vito, in an amoral and delightfully hypocritical character. James Cromwell was equally excellent in his role.Technically, the film is full of value and quality, starting with grandiose cinematography, which avoids falling into the commonplace of noir films and fills the screen with color and light, capturing the Californian sun and the beauty of the city in its rich colors. The filming locations chosen for the recordings are excellent and their judicious use helped the film to fit the period and the context in an impeccable way. The sets and costumes, as well as the automobiles that were used, help a lot in creating an environment and a clear temporal notion, and are magnificent on the screen. The soundtrack, in charge of Jerry Goldsmith, is impeccable and appears at the right time.",
            "review_date": "2021-04-18",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 66
}