{
    "title": "Mortal Kombat: Annihilation",
    "rating": 8.0,
    "release_date": "1997-11-21",
    "genre": [
        "Action",
        "Adventure",
        "Sci-Fi",
        "Thriller",
        "Fantasy"
    ],
    "summary": "In defiance of the Elder Gods, the evil Outworlders are back to wreak hell on Earth. Earth's last hope is the mighty Liu Kang and his explosive fighting friends. They're all that stand between life…and annihilation! (New Line)",
    "critic_reviews": [
        "But the most stimulating, satisfying aspect of this action fantasy is the theme music.",
        "Its dazzling special effects make its combatants flip and fly, spin and soar, all the while punching and kicking each other like jackhammers, only to leave viewers utterly unmoved.",
        "Pic consists largely of choppily edited fight scenes (usually involving somersaults and back flips) combined with various computer graphic effects.",
        "It would miss the point to complain that the plot is nonsensical drivel peopled by paper-thin characters and a paucity of ideas.",
        "This tedious hodgepodge of martial-arts mayhem, bogus mysticism and computer-generated special effects doesn't even pretend to have a plot.",
        "Fragmented and monotonous, without a semblance of the gymnastic cleverness that at least made the first Mortal Kombat film into watchable trash, Mortal Kombat Annihilation is as debased as movies come.",
        "This film has no story, no characters, and no coherence.",
        "Here's the lowdown on the latest chapter in Mortal Kombat: deadly dull.",
        "The movie is nothing more than a perpetual chain of elaborately choreographed (by returning star Robin Shou) fight sequences that mix live-action foregrounds with complexly layered digital effects and are linked together by the most flimsy and laughable of plot elements.",
        "It's cynical and it's depressing, and I would lock a child in a room before I'd show him Mortal Kombat: Annihilation."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "I fully enjoyed the first mortal kombat. However I prefer this one to the first. MK2 gets rights into the action,\rthere are more characters and the action scenes are expertly directed. The music is also as excellent in this sequel as it wasI fully enjoyed the first mortal kombat. However I prefer this one to the first. MK2 gets rights into the action,\rthere are more characters and the action scenes are expertly directed. The music is also as excellent in this sequel as it was in the original. This is one of the best martial arts movies I've seen and it is 100% faithful to the video game. This sequel has more intensity than the first and that is what makes it so enjoyable.",
            "review_date": "2015-05-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I like how 5 guys can come up with a story that any 6th grader could have come up with in their head. This sequel was just shallow. Still, it's not the worse movie I've ever seen, but it is definitely one of the weakest movie I like how 5 guys can come up with a story that any 6th grader could have come up with in their head. This sequel was just shallow. Still, it's not the worse movie I've ever seen, but it is definitely one of the weakest movie adaptations of a video game (nothing beats Street Fighter, even though it was entertaining for all the wrong reasons).",
            "review_date": "2009-03-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Don't go into it expecting anything other than a reboot that maybe isn't as good as previous entries, and you'll be good.Overall, I can tell that a lot of effort and love went into  and I have to appreciate that. 8/10",
            "review_date": "2021-04-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I'll get this out of the way early, the movie sucked.\rHowever, it is a little endearing. The plot is questionable and the writing is terrible. The acting however, is not that bad and the fight scenes are great. The music is amazing. As forI'll get this out of the way early, the movie sucked.\rHowever, it is a little endearing. The plot is questionable and the writing is terrible. The acting however, is not that bad and the fight scenes are great. The music is amazing. As for plot, since when in the Ps2 era did MK have a good plot?\rThe special effects are great until they're not.(Good Sub-Zero's Ice, Bad- Kung-Fu fighting Dragons(Don't ask...))\rThis movie is enjoyable though, if you watch it for the fights and fan-service.\r7 out of 10",
            "review_date": "2014-10-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Its absoloutly horrible. In fact it's so bad... its funny and entertaining. I would give it a 0 if I didn't spend the whole movie laughing. I'm really torn between giving it a zero for sucking and a six for making me laugh so hard. I thinkIts absoloutly horrible. In fact it's so bad... its funny and entertaining. I would give it a 0 if I didn't spend the whole movie laughing. I'm really torn between giving it a zero for sucking and a six for making me laugh so hard. I think I'll flip a coin.",
            "review_date": "2010-09-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This was the greatest movie ever made.",
            "review_date": "2007-06-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I'll give it 1 because it's **** FUNNY !!\rOMG the effects, i cried from laughter... BEST MOVIE EVERRRR !\rI bet the positive reviews are people who laugh all the way until the ending and they think it's a comedy movie about Mortal Kombat....",
            "review_date": "2015-03-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"Mortal Kombat: Annihilation\" is just terrible. It's like watching a PG-13 version of sesame street, where they all fight with poor effects rather than to talk out. Don't, just don't waste your time on this.",
            "review_date": "2011-10-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "What the heck are you guys even talking about? I thought this was a great action movie. You do realize it's a martial arts movie based on a friggin video game, right? The martial arts scenes (most of the point of the film) were What the heck are you guys even talking about? I thought this was a great action movie. You do realize it's a martial arts movie based on a friggin video game, right? The martial arts scenes (most of the point of the film) were excellent. The choreographer did one of the best jobs I've seen in a m.a.'s movie in a long time. They actually got actors that could fight, instead of \"pretty faces\" like in the first edition (a movie which I also liked). The new Sonja Blade (Sandra Hess - Beastmaster 3) was much better than the first. To say a movie based on a video game has no \"plot\"...oy...talk about the wrong line of thinking going in to a movie.",
            "review_date": "2006-05-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The first Mortal Kombat was already a cheesy martial arts movie. This sequel is even cheesier. We get goofier performances, worse dialog, and uglier special effects. The plot goes into a bunch of mystical mumbo jumbo. It tries to go granderThe first Mortal Kombat was already a cheesy martial arts movie. This sequel is even cheesier. We get goofier performances, worse dialog, and uglier special effects. The plot goes into a bunch of mystical mumbo jumbo. It tries to go grander in scale than it's predecessor, but it all just leads to poorer writing.\r We still get the entertaining fights though. The movie definitely doubles down on the fan service. Just like the first movie it's strength is in watching the game characters fight each other with over-the-top action. These fights are backed up by an awesome soundtrack.\r It tries to go bigger than it's predecessor and ends up falling short as a result. It also gets quite a bit cheesier. However when it's focusing on the first movie's strengths (cheesy martial arts action with fan favorite MK characters) it's still pretty entertaining. The expanded roster of characters taken from the games still makes it worth a watch for fans of the series and of the first movie. The lack of R-rated fatalities is still a disappointing non-inclusion, but no more so than it was in the first. Overall the movie just isn't as good this time around.",
            "review_date": "2016-07-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Horrible,just horrible,as a MK fan i should give this movie a o...............................but the music is good and its kinda cool to see the all the characters in a movie!",
            "review_date": "2011-04-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Beyond awful. Crap acting, script, effects, and action. Everything in this movie fails. One of the worst films I've every seen. Awful, awful, awful, awful!",
            "review_date": "2011-04-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The first Mortal Kombat movie made a lot of money, why not make another one? Mortal Kombat: Annihilation is exactly why you don't make another one.",
            "review_date": "2012-02-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "With no Paul W.S. Anderson and no returning cast (just Robin Shou), I watched Annihilation and I think it's one of the worst video game movies or sequels I've ever saw. New Line just subsequently alienated the sequel into a circus filled withWith no Paul W.S. Anderson and no returning cast (just Robin Shou), I watched Annihilation and I think it's one of the worst video game movies or sequels I've ever saw. New Line just subsequently alienated the sequel into a circus filled with bad acting, a terrible script, and a useful excuse of putting my favorite characters from Mortal Kombat II (Kitana and Mileena) into nothing but prostitutes. Don't buy it, matter of fact, don't rent it on Blu-Ray. I should really stick to the original Kombat and maybe soon Warner Bros. could find a way to reboot the Mortal Kombat franchise and turn it into an R-rated format because the game series is rated M for Mature, so why not bring on the fatalities.",
            "review_date": "2012-10-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "this is a terrible movie so much that the actor that plays as johnny cage told his agent to kill him off thats how bad this movie is its hard to believe that they could make a crap version of mortal kombat 1 its like throwing up on a polishedthis is a terrible movie so much that the actor that plays as johnny cage told his agent to kill him off thats how bad this movie is its hard to believe that they could make a crap version of mortal kombat 1 its like throwing up on a polished turd the only reason i give this movie a one cause its a whole lot of fun to make cracks at this movie and to see how not to make a movie.",
            "review_date": "2011-12-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Annihilation has a much darker tone than the first film, which I appreciate, but it doesn't necessarily work. Despite the attempts to make a more serious Mortal Kombat film, It actually came off even cheesier and more comedic than the firstAnnihilation has a much darker tone than the first film, which I appreciate, but it doesn't necessarily work. Despite the attempts to make a more serious Mortal Kombat film, It actually came off even cheesier and more comedic than the first one. And recasting virtually every role made absolutely zero sense. The cast is what made the first film so good in the first place.",
            "review_date": "2020-06-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Quite possibly one of the worst sequels ever to be released in theaters, Mortal Kombat: Annihilation literally Destroyed All Expectations, the plot makes no sense, and they literally tried to cram inIn almost every single one of theQuite possibly one of the worst sequels ever to be released in theaters, Mortal Kombat: Annihilation literally Destroyed All Expectations, the plot makes no sense, and they literally tried to cram inIn almost every single one of the characters from both the games Mortal Kombat II and MK3 without giving them sufficient screen-time nor development, aside from that, the film suffers from bad recasting and acting, lackluster fight scenes, cheap production values, and some of the worst CGI ever to assault cinema screens. My advice: stick to the original, and avoid this at all cost.",
            "review_date": "2012-03-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "While I do give this movie some credit for trying to remain loyal to the games, it kind of get lost in trying to do too much and not doing anything significant to explain a thing to the audience. Even a die-hard MK fan as myself had to go WTFWhile I do give this movie some credit for trying to remain loyal to the games, it kind of get lost in trying to do too much and not doing anything significant to explain a thing to the audience. Even a die-hard MK fan as myself had to go WTF when watch this movie. Overall: An extremely poor example of a movie that just seems to be there to milk the franchise for all its worth. Not to mention the extremely BAD \"acting.\" Almost makes the Street Fighter movie look like Shakespeare.",
            "review_date": "2013-02-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Why oh why was this made the way it was? First off why was most of the original cast replaced by worse actors. Then why add a myriad of characters only to give them minutes of screen time and finally why clump them together in non-impressiveWhy oh why was this made the way it was? First off why was most of the original cast replaced by worse actors. Then why add a myriad of characters only to give them minutes of screen time and finally why clump them together in non-impressive action sequences. This film should really have been made to measure the original.",
            "review_date": "2016-08-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I cannot believe how many fake positive scores there are.  This has some of the worst CGI and acting in a professionally made movie, ever.  The plot is simply a group of scenes that were stapled together to fill in the time between terribleI cannot believe how many fake positive scores there are.  This has some of the worst CGI and acting in a professionally made movie, ever.  The plot is simply a group of scenes that were stapled together to fill in the time between terrible fight scenes that are either jump cuts to cover up those that cannot fight, or terrible directing with moronic moves that were all about looking cool instead regardless of how silly they were.  Anyone claiming this is good is lying, plain and simple.  Watch for youself and return to vote.",
            "review_date": "2021-04-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Just barely misses out as one of those \"so-bad, it's good\" movies. The acting is cringingly bad, the costumes are terrible, the special effects are god awful, the action scenes are boring, the story is bad, absolutely no character is likable,Just barely misses out as one of those \"so-bad, it's good\" movies. The acting is cringingly bad, the costumes are terrible, the special effects are god awful, the action scenes are boring, the story is bad, absolutely no character is likable, not even Sub-Zero. and turning into one of the most controversially goriest gaming franchises of all time into a PG-13 movie is an extreme disappointment. This movie is a disgrace to the Mortal Kombat franchise and proof that NO video games should ever be made into movies, because even the best concepts get screwed up by Hollywood.\r The music is decent at least, earning it 1 point.",
            "review_date": "2016-05-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a direct continuation from the first movie. You only need to see the first few scenes to get all warning signs. They replaced many actors immediately (or the others left in terror;-). Raiden is the most apparent example. Its like youThis is a direct continuation from the first movie. You only need to see the first few scenes to get all warning signs. They replaced many actors immediately (or the others left in terror;-). Raiden is the most apparent example. Its like you replaced Dirk Nowitzki with Bernie Sanders without any remarks (Visually not Basketball related. I must admit that this idea would be interesting in real life). Then there is the story and acting. While the former movie got the right balance of seriousness and taking itself not too serious, this movie fails. There are a lot of scenes / stuff that should be engaging. But it is pointless, an under-performance or unintentionally hilarious. I don't blame the actors. Even the best actors /actress cant get much out of an awful script or a bad role. What troubles me the most are the sparks of good ideas in this movie. With adaptations and improvements you could make a better or even good movie out of the setting and some ideas. Then there are the fights. While I admit that the final confrontation is engaging the total performance is disappointing. It is sadly not even “So bad that it is good”. That would at least improve the rating. Overall I would not rewatch and forget that this movie exist. The best I got out of it was the idea to let Dirk Nowitzki play Basketball against Bernie Sanders (and his team?). This has more potential than this movie;-).",
            "review_date": "2020-02-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I can remember being a kid and watching the first MK movie, I watched this movie with high expectations,..well I knew there was something wrong with the movie immediately, the movie opens with horrid cg effects, and a lot of the original castI can remember being a kid and watching the first MK movie, I watched this movie with high expectations,..well I knew there was something wrong with the movie immediately, the movie opens with horrid cg effects, and a lot of the original cast has been replaced, with less qualified actors for the roles, and along the way to the end of the movie the effects are laughable at best, this movie is a slap in the face to  the viewers of the first movie, and the first movie had it's faults, but I feel it had a point of quality that it would not drop below ...now you ask me what is this movie good for? ...well as a chapter in the series of Mortal Kombat it fails [in my opinion] but in some ways this movie is good... Ahem well a good example of a movie thats so bad it's good lol,  if you want a good laugh watch it with friends I laughed at the choppy effects, silly dialog, and the less then passable [some times over the top] [and under the top at times] acting, most all the raiden bits make me laugh.",
            "review_date": "2016-09-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie was pretty **** even back in the days it was first released - i would give it 4/10 then. What a waste... My first 0 on imdb goes to a movie based on one of my favourite series. Worst MK product.",
            "review_date": "2015-06-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A complete letdown compared to the first MK film, most of the film is either Raiden talking or fighting, that's all it is 90% of the time, I can't go anymore considering I watched both of them after each other!",
            "review_date": "2015-04-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Mortal Kombat Annihilation is embarrassingly awful with some of the most amateur acting, special effects, dialogue and plot ( that is also filled with inconsistencies.) the only thing positive i can mention is that the film has a goodMortal Kombat Annihilation is embarrassingly awful with some of the most amateur acting, special effects, dialogue and plot ( that is also filled with inconsistencies.) the only thing positive i can mention is that the film has a good soundtrack other than that it is one of the worst films i have ever seen.",
            "review_date": "2015-11-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nWhat can can one possibly enjoy from this.\r Kitana: Mother, you are alive!\r Sindel: Too bad you will be dead!\r If the dialogue isn't ad enough, this film completely killed the lore and intrigue of the first film. Within the first five minutes they just go ahead and kill one of the beloved main characters of the first film. I think I could choreograph better action and the special effects are the worst that have ever existed. There is literally a  scene where both the protagonist and the antagonist turn into claymation dragons that fight each other. Robot Chicken has higher quality stop motion animation than this movie. All the actors from the beginning were strapped to wires, as everyone is just unrealistic flying and punching through the air in a way that would only make Joel Schumacher proud. Ten minutes in and you want the film to end. I'm surprised I sat through the whole thing. I can honestly say this is the worst video game to film adaptation. Uwe Boll needs to step up his game if he wants to claim the title.",
            "review_date": "2015-06-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The big problem with the movie is there are far to many characters probably because they jumped to Mortal Kombat 3 in the game sequence skipping game 2. So while there are a number of characters in game 3 they incorporate a few game 2The big problem with the movie is there are far to many characters probably because they jumped to Mortal Kombat 3 in the game sequence skipping game 2. So while there are a number of characters in game 3 they incorporate a few game 2 characters as well. In order to provide screen time for all the characters they jump from one scene to the next without any real logical connection between them. Just too much was going on had they extended it (possibly made 2 films) and given it a bit of story and provided a bit of character development like the first movie rather than just a bunch of fight sequences to showcase all the characters it could have been good instead of the mess that was actually provided.",
            "review_date": "2016-07-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "When you make a video game movie, you try to make it better then the games or just about the same. But this movie is like THE exact same thing as the movie. I mean it has a good story line but it is exactly like the games. 4/10",
            "review_date": "2016-11-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "HorrendousWith horrifically bad CGI, Overly goofy performances, and unbearably cheesy dialogue, Mortal Kombat: Annihilation is laughably awful to the one billionth degree.",
            "review_date": "2019-12-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Mortal Kombat: Annihilation.  Is it Mortal Kombat?  After the cool first part, it's sad to see this.  And now in order.  1. Characters that are needed for the background such as Rain and Sheeva.  They say several replicas for the entire filmMortal Kombat: Annihilation.  Is it Mortal Kombat?  After the cool first part, it's sad to see this.  And now in order.  1. Characters that are needed for the background such as Rain and Sheeva.  They say several replicas for the entire film and die.  2. Animal nature.  Why did Liu Kang need to look for Nightwolf?  Complete 3 challenges?  About which the plot forgets.  Learn to discover the animal essence in yourself?  What for?  To growl and scratch Shao Kahn for one minute.  3. 6 days for which the Earth should be destroyed pass suspiciously quickly.  There was a feeling that only one day had passed.  The positives in this film are fighting scenes and music.  Everything else is unfortunately very weak.",
            "review_date": "2020-04-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not too bad... it had some cool fight scenes. I enjoyed it for what it is.",
            "review_date": "2007-02-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The most time-wasting movie that i watched.Can your face still be in perfect shape when you get hit by a steel hatchet in the face?",
            "review_date": "2008-03-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The soundtrack was awesome. The movie, not so much. Buy the soundtrack.",
            "review_date": "2005-11-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I wouldn't nessecarily say I was dissapointed with this movie, but I was remotley surpised how truly awful it was. Lame acting, characters, effects, need I go on?",
            "review_date": "2005-10-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Why all the bad reviews? I found this movie entertaining, even though it isn't as good as the first.",
            "review_date": "2006-02-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It is one of the worst movies I have ever seen! It makes the first movie (which was a masterpiece) a joke. Just watch the first one (its better).",
            "review_date": "2009-10-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I had heard this was horrible, but my sanity was simply annihilated as I watched this on TV. Bad acting, terrible fight scenes, and the plot makes no sense. Characters just randomly show up and fight random characters. The first one was I had heard this was horrible, but my sanity was simply annihilated as I watched this on TV. Bad acting, terrible fight scenes, and the plot makes no sense. Characters just randomly show up and fight random characters. The first one was actually pretty decent, but they really should have left it alone after that.",
            "review_date": "2009-07-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "When I watch this movie I try to think why it's so bad but I cant pick a reason why. The acting is par and the fighting is par. It doesn't offer anything different form the first film.",
            "review_date": "2006-10-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Absolute Trash. The only thing this film annihilates is your sanity. If you can find it on VHS, feel free to use it as a door stop, plate or makeshift ironing board.",
            "review_date": "2006-08-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The only good actress... quit. She noticed that the first one was crap! This one was even bigger CRAP! Without Sonya from the Part one. This had horrible acting like part one. But its still O.k to watch on Spike TV.",
            "review_date": "2007-06-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Mortal Kombat: Annihilation, that's pretty much the description of this sequel, it annihilated the opportunity of New Line ever doing another Mortal Kombat movie, i really liked the first Mortal Kombat movie, but i did not like this one Mortal Kombat: Annihilation, that's pretty much the description of this sequel, it annihilated the opportunity of New Line ever doing another Mortal Kombat movie, i really liked the first Mortal Kombat movie, but i did not like this one as much as i liked the first one, what went wrong with this one was that almost everyone of the original cast has been replaced except for Robin Shou as Liu Kang and Talisa Soto as Kitana, the costumes were terrible, the special effects were vomit, the dialogue was absolutely cheesy, the fights were not as good as the fights in the first MK movie and there were too many characters jumping in and out, bottomline: the original Mortal Kombat movie is an excellent masterpiece, but the sequel Mortal Kombat: Annihilation is a waste of time.",
            "review_date": "2008-10-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Hi, if you want to watch mortal kombat, watch the first one because it is so much better this garbage they call a sequel. even if it is faithful to the video game that i played when i was 10, the whole film is brought down by terribly cheesy Hi, if you want to watch mortal kombat, watch the first one because it is so much better this garbage they call a sequel. even if it is faithful to the video game that i played when i was 10, the whole film is brought down by terribly cheesy and outdated visual effects, corny dialouge, annoying characters, and a terrible script.",
            "review_date": "2009-08-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The first Mortal Kombat movie was probably one of the first above average movies based on videogames but this one...... avoid at all costs if its on tv or something and there is nothing on MAYBE watch it while doing something else soundtrack The first Mortal Kombat movie was probably one of the first above average movies based on videogames but this one...... avoid at all costs if its on tv or something and there is nothing on MAYBE watch it while doing something else soundtrack is pretty good though maybe just have it on in the background to listen to the music IF you like Techno as much as im badmouthing this movie I really cant give it a zero your movie doesnt even the right to be called a movie if it gets a zero from me. You might be fine with it if your really interested in seeing where the kombatants ended up after Mortal Kombat of course this has NOTHING to do with that at all so maybe you wont.",
            "review_date": "2005-11-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Imagine that, if after buying the MK: Annihialation DVD, that you open the case, however instead of finding a disc, you opened up Pandora's Box, which in turn sent millions of acidious, flesh-eating parasites straight for your genital Imagine that, if after buying the MK: Annihialation DVD, that you open the case, however instead of finding a disc, you opened up Pandora's Box, which in turn sent millions of acidious, flesh-eating parasites straight for your genital area. I would have said this about this sad lump of dying termite queens even if I weren't disappointed. And I was disapointed; I'd choose a lifelong career drowning puppies than watch this movie again.",
            "review_date": "2005-11-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A very bad movie at all levels even though in my opinion is a little- but only a little- better than the first which was pretty awful itself... From bad acting to ridiculous special effects the experience turns into un unbearable torment... A very bad movie at all levels even though in my opinion is a little- but only a little- better than the first which was pretty awful itself... From bad acting to ridiculous special effects the experience turns into un unbearable torment... This is definitely the movie you should be looking forward... to avoid!",
            "review_date": "2008-11-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I completely understand liking this movie in Guilty pleasure kind of way (even though I don´t really like to use that word, you should be able to like what you like even if the rest of the world hates it) but it´s just not for me.",
            "review_date": "2021-11-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nIt is just worst, The story after prequel was set but the execution didn't land The overuse of Worst Cgi although great music but it was a bad experience, while watching it felt like when is this gonna end, The new characters from game jax,milena and subzero,scorpion reunited was good, The villian's plan to conquor and the twist at the end of raiden was good but it didn't made impact, The change in actors at start made the gang worst and plus the johnny's killing making the group small and from then the kitana's kidnap and the mother cringe meme matrial entry and the villain's invading earth resulting in quest to stop him with the 3 seperate journeys of raiden's god quest and jax,sonya's just quest and the lui's quest to find kitana it was good at paper but bad in pacing of movie, The rematch of scorpio and subzero was good although the other fights were okay but didn't felt as awesome as prequel, The ending twist was predictable and the dragon fight was just unneccessarily bad but the music was awesome,Overall it was a cringe and cheesy fest and a bad sequel.",
            "review_date": "2022-07-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Mortal kombat annihilltion doesn’t feel like a mortal kombat movie rayden looks like a **** cobra Kai student kabal and Stryker were said to be defeated even though not being in the movie the cyborgs look like samurai Kahn kills rain overMortal kombat annihilltion doesn’t feel like a mortal kombat movie rayden looks like a **** cobra Kai student kabal and Stryker were said to be defeated even though not being in the movie the cyborgs look like samurai Kahn kills rain over ermac the cgi monsters look like something the asylum made I did like mileena looks like kitana but they are not the same actors so I’m still un happy but sadly this is a mortal kombat movie so I can’t rank it lower than a 3 maybe I’ll make a bigger review on my YouTube channel Treeckoarsenel",
            "review_date": "2022-06-07",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 63
}