{
  "title": "The Game",
  "rating": 8.5,
  "release_date": "1997-09-12",
  "genre": [
    "Action",
    "Adventure",
    "Mystery",
    "Thriller"
  ],
  "summary": "There are no rules in ?the game.? And that will make life very difficult for Nicholas Van Orton (Douglas), a successful businessman who is always in control. Van Orton lives a well-ordered life, until an unexpected birthday gift from his brother destroys it all.  (Universal)",
  "critic_reviews": [
    "This is not a movie that can bear much postgame scrutiny. The minute you begin to question one element of the plot, gaping holes of logic appear throughout.",
    "The movie's thriller elements are given an additional gloss by the skill of the technical credits, and the wicked wit of the dialogue.",
    "An intensely exciting puzzle-gimmick thriller, the kind of movie that lets you know from the start that it's slyly aware of its own absurdity.",
    "It's formulaic, yet edgy. It's predictable, yet full of surprises. How far you get through this tall tale of a thriller before you give up and howl is a matter of personal taste.",
    "As it's unspooling on screen, the film is hugely entertaining, but there are several significant plot holes that grow wider the more closely they're investigated.",
    "At times The Game is frustrating to watch, but that's just a measure of how well Fincher succeeds in putting us in his hero's shoes.",
    "The disappointing ending aside, there is much to enjoy in The Game, a creation with a sheen so highly burnished that sometimes you feel you must look away.",
    "On the surface, The Game is an unusually imaginative thriller that bends its offbeat plot into so many twists that you actually have to pay attention - something few Hollywood movies demand nowadays - to understand its evolution and enjoy the multiple payoffs at the end.",
    "The film itself is limited by the material's nature as a brainy exercise and by its narrow focus; individual response will depend upon how tantalized one is by puzzles and games, as well as upon how off-putting one finds the central character, who is center-stage throughout.",
    "Mr. Douglas, who delivers a new shade of cruel elegance each time he plays another urbane monster, is the ideal star for this vigorously contrived thriller.",
    "This sort of flick can be fun, and there are moments here when it is, when a suddenly shifting perspective tosses us for a dizzying loop. Then again, there's such a thing as too much fun and too many moments -- at over two hours, this particular game meanders on way past its welcome.",
    "It's a stylish, cleverly plotted, perpetually unpredictable film with another electric (albeit brief) performance from Penn. So why is it so unaffecting?",
    "It's a cut above the throng of mindless, purported thrillers in which explosions and gun battles replace even rudimentary story telling.",
    "Fincher is still working on the assumption that he has better things to do than entertain an audience. Which would be fine if he weren't drawn to such schlocky material.",
    "In The Game, Fincher pulls back from the total gross-out but sustains a tone of aggravated anxiety. Hitchcock could have done this material and still made its perversities pleasurable.",
    "It also has wild plot holes and requires an almost inhuman suspension of disbelief, but it's still a fun ride up to a point.",
    "By any fair standard, this lushly produced film is a long, bumpy ride to a major letdown.",
    "What emerges is a very poor man's North by Northwest without much moral nuance and a decreasing number of thrills.",
    "Certainly handsome, well made and for most of its running time gripping, the film ultimately turns into a $60-odd-million piffle."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "The Game is a smart psychological thriller. Michael Douglas plays Nicholas and he receives an unusual\rbirthday present from his brother Conrad. Shortly after he sees him odd events start happening to him.\rHe doesn't know why the events areThe Game is a smart psychological thriller. Michael Douglas plays Nicholas and he receives an unusual\rbirthday present from his brother Conrad. Shortly after he sees him odd events start happening to him.\rHe doesn't know why the events are happening but apparently it's part of the game. To uncover the\robject of the game defeats it's purpose. Overall a tightly wound thriller from the director of Fight Club,\rDavid Fincher.",
      "review_date": "2014-07-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A wonderful break from the norm. The Game takes the viewer through a world where nothing is certain, and executes it quite well. Whether if it's the action, the thrill, the mystery, or even the drama, The Game is guaranteed to give you a goodA wonderful break from the norm. The Game takes the viewer through a world where nothing is certain, and executes it quite well. Whether if it's the action, the thrill, the mystery, or even the drama, The Game is guaranteed to give you a good experience. The idea behind this movie was well-thought and portrayed expertly, along with superb acting. However I still wish that this whole movie had much more meaning, it seems absent from the previous thought put into it in the end. But nonetheless, The Game, in my opinion, is a must-see. And do not let the critics tell you otherwise.",
      "review_date": "2012-01-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is one of the most clever thriller you´ll see in the last 30 years.Get some chocolat, skittles, soda and go for it.",
      "review_date": "2018-04-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great movie of a real **** rich guy getting his comeuppance.  We get to see him change as his life is slowly taken away from him.  Great acting by Michael Douglas.  I don't buy a lot of DVDs but this one is a keeper.",
      "review_date": "2015-11-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I gave this movie a 9 instead of a 10 because once you see it you can't get that same experience ever again, but that first experience is so good.  This film is the epitome of \"edge of your seat\" viewing.  You'll be guessing until the momentI gave this movie a 9 instead of a 10 because once you see it you can't get that same experience ever again, but that first experience is so good.  This film is the epitome of \"edge of your seat\" viewing.  You'll be guessing until the moment you see the credits!",
      "review_date": "2013-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Game is a smart, thrilling, and completely underrated movie that should be more renown than it is. The very thought through \"game\" is creepy and unexpecting with thrills and near death experiences at almost every corner. The acting isThe Game is a smart, thrilling, and completely underrated movie that should be more renown than it is. The very thought through \"game\" is creepy and unexpecting with thrills and near death experiences at almost every corner. The acting is amazing; this is one of Michael Douglas's best roles ever. Despite it not being very popular, The Game will blow your mind and have you thinking differently about life.",
      "review_date": "2013-03-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The opening scenes of \"The Game'' show Michael Douglas as a rich man in obsessive control of his life. The movie seems to be about how he is reduced to humility and humanity--or maybe that's just a trick on him. The movie is like a controlThe opening scenes of \"The Game'' show Michael Douglas as a rich man in obsessive control of his life. The movie seems to be about how he is reduced to humility and humanity--or maybe that's just a trick on him. The movie is like a control freak's worst nightmare. The Douglas character, named Nicholas Van Orton, is surrounded by employees who are almost paralyzed by his rigid demands on them. \"I have an Elizabeth on line three,'' says one secretary, and then a second later adds, \"Your wife, sir.'' \"I know,'' he says coldly. We have the feeling that if the second secretary had not spoken, he would have replied, \"Elizabeth who?'' His underlings are in no-win situations. It is, in fact, his ex-wife; at age 48, Van Orton lives alone in the vast mansion where his father committed suicide at the same age. His birthday evening consists of eating a cheeseburger served on a silver tray and watching CNN.\r Of course many of the physical details of what happens to him are implausible or even impossible, but so what? The events are believable in the sense that events can be believed in a nightmare: You can hardly worry about how a horror has been engineered when you're trapped inside it.\r \"The Game,'' written by John Brancato and Michael Ferris, is David Fincher's first film since \"Seven,\" and projects the same sense of events being controlled by invisible manipulation. This time, though, there's an additional element: Van Orton is being broken down and reassembled like the victim of some cosmic EST program. And it is unclear, to him and to us, whether the Game is on the level of a fraud, or perhaps spinning out of control.\r The movie's thriller elements are given an additional gloss by the skill of the technical credits, and the wicked wit of the dialogue. When Van Orton's brother asks, \"Don't you think of me anymore?'' he shoots back, \"Not since family week at rehab.'' And when his ex-wife asks if he had a nice birthday, he answers, \"Does Rose Kennedy have a black dress?'' The film's dark look, its preference for shadows, recalls \"Seven'' and also Fincher's \"Alien 3.\" The big screen reveals secrets and details in dark corners; on video, they may disappear into the murk. Like \"Seven,'' the plotting is ingenious and intelligent, and although we think we know the arc of the film (egotist is reduced to greater humility and understanding of himself), it doesn't progress in a docile, predictable way; for one thing, there is the real possibility that the Game is not an ego-reduction program, but a death plot.\r Douglas is the right actor for the role. He can play smart, he can play cold, and he can play angry. He is also subtle enough that he never arrives at an emotional plateau before the film does, and never overplays the process of his inner change. Indeed, one of the refreshing things about the film is that it stays true to its paranoid vision right up until what seems like the very end--and then beyond it, so that by the time the real ending arrives, it's not the payoff and release as much as a final macabre twist of the knife.",
      "review_date": "2015-04-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is the kind of movie i always love seeing, an incredibly smart thriller. I always love when movies move me mentally or maybe even physically, this is a movie that messes with you, when you're watching this movie it makes you paranoidThis is the kind of movie i always love seeing, an incredibly smart thriller. I always love when movies move me mentally or maybe even physically, this is a movie that messes with you, when you're watching this movie it makes you paranoid just like the leading man Van Orton, which is a rare feat, it's a special experience which i always love. Movies like The Truman show, The Prestige, Shutter Island, A Beautiful Mind, and Black Swan, are some of my favorite movies, what they have in common with The Game is that they all move the audience mentally and maybe even physically, they mess with you, which is a movie experience i like or even dislike when it's done incredibly well. This is one of them. It's executed so well it made me paranoid whilst watching and maybe the occasional nightmare. (I had a nightmare i was put in The Game, as well)\rPhenomenal.\r The Game is an incredibly intense psychological thriller.",
      "review_date": "2016-05-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Dangerous games.This film tells how Nicholas Van Orton, a smug and cold millionaire, enters a bizarre and unique game that promises to play with his life. But when the game starts and Nicholas sees the twisted and perverse way unfolds,Dangerous games.This film tells how Nicholas Van Orton, a smug and cold millionaire, enters a bizarre and unique game that promises to play with his life. But when the game starts and Nicholas sees the twisted and perverse way unfolds, things start getting out of control. Directed by David Fincher (director of the film \"Seven\"), features Michael Douglas as protagonist.The truly wealthy have always had a reputation for being arrogant people, cold, impersonal, smug and only concerned about themselves and their business. Nicholas Van Orton was like that, even disregarding his own brother. And it is from him that Nicholas receives a different birthday gift: participation in a game organized by a mysterious company that everyone seems to know but about which nothing is said nowhere. Intrigued but afraid, Nicholas boards the game without real sense of where he is in, which says a lot about the personality of some rich people. The film will thicken up gradually, leaving the audience in anticipation and securing it constantly. It is an addictive movie where Douglas shows all its value and can brilliantly interpret your character. All this makes this film an excellent thriller, perhaps one of the best of the late twentieth century.",
      "review_date": "2018-02-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of my favorite movies! Crafted beautifully and is extremely thrilling even though the premise is simple.",
      "review_date": "2020-01-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Game is 1 of My favorite movies, I love doing movie and pizza night With my friends and when I put this movie in and the end comes everybody is always shocked like I was. I am really good at figuring out the endings of most movies withinThe Game is 1 of My favorite movies, I love doing movie and pizza night With my friends and when I put this movie in and the end comes everybody is always shocked like I was. I am really good at figuring out the endings of most movies within the first 30 minutes of the movie but not this movie. I was completely blown away & shocked with the ending it’s an amazing movie Michael Douglas was superb in it. This movie is full of twists and turns like a roller coaster I highly recommend it if I could give it 20 stars ⭐️  I definitely would",
      "review_date": "2020-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Higuyfugigihhjjbjbugjgjgjgjgjgugugugufyrutdtuttegufyjgyigfyigugiguguguguggujgjgjgjgjgugugugugugugigugugguugigoss",
      "review_date": "2021-05-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》",
      "review_date": "2021-06-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》",
      "review_date": "2021-06-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If you want to make thrillers, watch The Game three times: watch it once for the love of a good movie, watch it a second time to study how its plot twists are organized, and watch it a third for one of the best collections of dream-like If you want to make thrillers, watch The Game three times: watch it once for the love of a good movie, watch it a second time to study how its plot twists are organized, and watch it a third for one of the best collections of dream-like scenes in modern film. The Game is a smart, capable thriller that earns its slick, dark appearance. It's cast is at first competent and quickly grows into a universally interesting group of faces. The plot is layered in a great execution of a wonderfully novel premise: how much of this horror story is the game? The Game earns every inch that it takes, and while it is far-fetched, you can't sit down to watch a movie about an organization that uses conspiracies and mobs of actors to infiltrate and ruin your entire life without suspending disbelief. The Game deserves that suspension, thanks to superb suspense.",
      "review_date": "2007-04-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Game is one of the best films with Michael Douglas. Saspence manages to hold on until the end of the film, and it 's also worth noting attention to detail. Great thriller, I recommend.",
      "review_date": "2019-10-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "●●●●●●■■■■■●●●●●●¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡..........................,,,,,,,,,,???????,,,,,,,,:::::",
      "review_date": "2021-05-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "********************************************************》》》》》》》》》》》》》》》》》》》》》》》》》》",
      "review_date": "2021-07-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The game is a movie for people that like to keep thinking. Fincher manages to make the audience paranoid to what and who are actually a part of this crazy \"game\". It manages to tap into the same fiction that made Total Recall a success whileThe game is a movie for people that like to keep thinking. Fincher manages to make the audience paranoid to what and who are actually a part of this crazy \"game\". It manages to tap into the same fiction that made Total Recall a success while replacing the sci-fi parts with real world craziness, as well as some of the most subtle character development I've seen in a long time. However, it is impossible to reveal any specifics without spoiling some part of story, which would be a shame to any first time viewer.If you enjoyed movies like Total Recall, Inception, The Matrix, or even Truman Show, give this movie a shot. The Game will stick with you for a while for all of the right reasons.",
      "review_date": "2011-03-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Don't just watch it. Think about it. Wonder about everything. Is that really happening? Or is it the game? It really keeps you EXTREMELY curious. It won't disappoint you, I promise.",
      "review_date": "2013-06-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "As they taking their shot at the classic \"man-on-the-run\" psychological thriller, David Fincher succeeds beautifully in leading the audience through an endless series of twists and turns, and Michael Douglas delivers his most inspired filmicAs they taking their shot at the classic \"man-on-the-run\" psychological thriller, David Fincher succeeds beautifully in leading the audience through an endless series of twists and turns, and Michael Douglas delivers his most inspired filmic performance since \"Wall Street.\"",
      "review_date": "2015-04-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nAmong the tests that Nicholas is asked to take when he interviews at CRS is the MMPI. This is the Minnesota Multiphasic Personality Inventory which is one of the most commonly used personality tests in mental health. The test is used by trained professionals to assist in identifying personality structure and psychopathology.",
      "review_date": "2020-01-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is just...what. Talk about a crazy movie that really, truly makes you think. Michael Douglas was awesome in the lead role and Fincher dominated as director. The ending was a little strange and felt unfitting for the rest of the movie,This is just...what. Talk about a crazy movie that really, truly makes you think. Michael Douglas was awesome in the lead role and Fincher dominated as director. The ending was a little strange and felt unfitting for the rest of the movie, but all in all, a very good film that really has you on the edge of your seat.",
      "review_date": "2013-06-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Un film audacieux et bien étrange, toujours à la limite de la suspension d'incrédulité et comme souvent avec ce genre de scénario qui sort le lapin du chapeau à la toute fin, le second visionnage (et les suivants...) sont très différents duUn film audacieux et bien étrange, toujours à la limite de la suspension d'incrédulité et comme souvent avec ce genre de scénario qui sort le lapin du chapeau à la toute fin, le second visionnage (et les suivants...) sont très différents du premier : on regarde d'un oeil critique, neuf, on cherche les rouages et les contradictions pour mieux démonter ce mécanisme d'horlogerie bizzaroïde qui fonctionne comme un jeu de dominos...A y regarder ainsi de plus près, ça ne tient évidemment pas debout : trop compliqué à organiser et mettre en oeuvre et pourtant, la machination diabolique est malgré tout bien huilée et on lui accorde à notre grand dam le bénéfice du doute.Car après tout, The Game est plus qu'un \"jeu\" paranoïaque, il est surtout une thérapie pour un homme névrosé qui a perdu toute empathie à l'égard du monde qui l'entoure, à commencer par ses proches.Michael Douglas excelle à restituer cette \"guérison\", cette sorte de catharsis endiablée ; il s'agit certainement de son meilleur rôle ou l'un de ses meilleurs, à tout le moins. David Fincher très à l'aise dans sa narration du complot et du \"jeu\" dispense une mise en scène élégante et maîtrisée, appuyée par une photographie des plus soignées.La subtile et quasi-hypnotique musique participe également à cette \"étrange thérapie\" tandis que d'habiles retours en arrière sous forme de réminiscences permettent de creuser la psychologie du personnage pour lequel le spectateur éprouve une véritable... empathie.Superbe film qui se révèle aussi étonnant qu'il peut être drôle, ironique et d'une fascinante humanité à la fois.",
      "review_date": "2017-04-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nWish I could give it a 10, because the first 2 acts are marvelous. The subtle incline to weird niche game to **** crazy is so great , and god damn Michael Douglas is amazing. The massive flaw is when he washes up in what I assume to be Mexico. The movie wastes so much potential and becomes a very contrived. How do you plan for Douglas not to go crazy and just start blasting people ? The gun might be fake , but that just makes the stakes so much lower. The ending is so disappointing and it leaves a sour taste in my mouth because I really loved the first few acts. It makes the entire movie feel pointless , and I get that he becomes a “better person “ because he “has fun” now but that is so wack compared to a story that actually had stakes, and god damn if the movie ended with him falling off the building it would have been a 10, but nope need that Hollywood happy ending. The first few acts still make me give this an 8 just because how great it is. Recommendation, just turn the movie off when he jumps off okay.",
      "review_date": "2021-07-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "In a dark, dangerous San Francisco lives Nicholas Van Orten (Michael Douglas), a very rich businessman and a total loner. He doesn’t come across as pathetic, but as rather as stern and cold, and blatantly unhappy despite the lap of luxury inIn a dark, dangerous San Francisco lives Nicholas Van Orten (Michael Douglas), a very rich businessman and a total loner. He doesn’t come across as pathetic, but as rather as stern and cold, and blatantly unhappy despite the lap of luxury in which he lives. Sensing Nicholas’ unhappiness, Nicholas’ wild and über ostentatious brother Conrad (Sean Penn) appears and presents Nicholas a birthday gift, a gift that is sure to add some excitement to Nicholas life, and lift him out of the depressive fog that he carries around everywhere.\r Along the way we learn some little bits of information about Nicholas’ life, but not much, which is nice because his past doesn’t really seem to matter anyway. Fincher takes the character and forces him to deal strictly with the present time. All past regrets, misdeeds, and sins fall away when you are literally fighting for your life.\r Conrad’s gift is a game. A set of real life, role-playing scenarios designed and executed by a company alleged called CRS. We don’t know what CRS is, and neither does Nicholas, so when bizarre happenings start to occur, such as the nightly news anchor breaking character and speaking directly to Nicholas in his living room, Nicholas cannot tell what is really happening. Is this part of the game? Or am I hallucinating?\r Soon the puppet masters at CRS crank up the intensity of the events. There are numerous attempts on Nicholas’ life. At one point he wakes up in Mexico after having been buried alive in an underground tomb. The occurrences are so extreme, that as an audience, we are just as confused as Nicholas. It is real? Or is it a game? It is impossible to tell, and this is what makes this film so much fun to watch.\r The world that CRS tailors to its clients is very cool and well put together. Even though Nicholas is told distinctly that the CRS game will begin, and it is not until after he is told this that strange and dangerous things start to happen, we are still unsure if it’s game or reality. Fincher is essentially blurring our understanding of the common philosophical conventions of cause and effect.\r The Game is a good thriller, and an entertaining watch. The production value of the film is excellent. It projects on screen in dark, shadowy tones, mixed with diverse textures setting one scene to next to a another composed completely different. The film is full of interesting settings from Nicholas’ mansion, to a Mexican border town, to meetings in coffee shops, to cabins in the woods, but despite the actual events taking place being very entertaining to watch, the film never really establishes what truth it is trying to convey. The ending is disappointing. We are not left with any kind of substantial meaning.\r The CRS experience is meant to be a massive, over-the-top shock to the nervous system. This shock forces one, Nicholas in this case, to decide whether he wants to fight to stay alive, or let go and die. Maybe we are supposed to take the hint and choose to live now, even though we don’t have CRS to break us out of our depression and lethargy, as individuals, or as a whole society. But this might be pushing the limits of interpretation. Despite the absence of the deeper themes, such as investigating the pointlessness of existence as in Fight Club, or the proving the worthlessness of humanity as in Seven, The Game is still great watch. Once the film ends, it doesn’t linger for days in the front of your mind like the best thrillers, but while your watching it you’ll be on the edge of your seat, never knowing what it going to happen next.",
      "review_date": "2014-02-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Michael Douglas delivers a superb performance in what ends up being a great thriller with all kinds of twists and turns.  It's crafty, it's dark, it's genius.  It's Ocean's Eleven without Vegas lights and all the smiles whose ace in the holeMichael Douglas delivers a superb performance in what ends up being a great thriller with all kinds of twists and turns.  It's crafty, it's dark, it's genius.  It's Ocean's Eleven without Vegas lights and all the smiles whose ace in the hole ends up being a lesson in how those who grow up with entitlement often have little or no idea of reality for a majority of people around the world  and what happens when that reality is forced sharply onto one of those privileged few.",
      "review_date": "2013-09-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●÷,÷,÷,÷,÷,÷,÷,÷,÷,÷,÷,÷,÷,÷,,+.+.+.+.+.+.+.=.=.=.=.=.,,,",
      "review_date": "2021-06-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "We all enjoy playing games whether they are board games, computer games, video games, crossword puzzles, chess, Chinese checkers one-way or another we all enjoy a good game. However, enjoyment is not enough for us we need to challengeWe all enjoy playing games whether they are board games, computer games, video games, crossword puzzles, chess, Chinese checkers one-way or another we all enjoy a good game. However, enjoyment is not enough for us we need to challenge ourselves further, step up the game so to speak, so we push our limits to try new games we know nothing about   and try to master them.  Each time we play, we get better and better until soon enough no one can beat us. So what do you do when you stop playing the game and the game starts playing you? David Fincher's \"The Game\" is a brilliant and ingenious mind teaser that takes peoples love for gaming to a completely new and terrifying level. So when you are playing a game ask yourself one very important. Are you playing it or is it playing you?   David Fincher is a master at toying with peoples minds at creating a complex and dark story weaved around the deep confines of the human mind, Fincher does not wimp out on you, he does not hold anything back he does not give into mainstream Hollywood. No, Fincher creates stories that are so dark an depraved that  only a fan of David Lynch, Stanley Kubrick or Tim Burton even could  stand the  full frontal brutality of Lynch's determination, hey maybe even some mainstream audiences members could handle his films I've meet a few who can.  David  Fincher's second homage to the noir genre \"The Game\" is not one of his most focused efforts or even one of his best but  what it is is one of the  biggest mind games you will ever be apart of. I liked the clammy, macabre feel of this film I liked how it bathed in bleached out colors or complete and utter darkness to bring out the full effect of the films story. It is a good film, no a great film with a fantastic story that works, and a premise that is more believable than preposterous.   \"The Game\" is a masterful film, a brilliant example of feverish essence in dark filmmaking, what undoes all the excellent work in this film is an ending so fluffy it makes you feel extremely cheated; it completely unravels all the extreme tension set up by the first two acts. It insults you that you spent 1hr.55 min and then the ending does not live up to the films story or even talent in it.  I will say this in its favor it did do an excellent job of keeping me involved and intrigued and this film was saved from its terrible ending by first-rate performances, eerie atmosphere and sharp direction from David Fincher. \"The Game\" is enjoyable and menacing ride that may run out of steam it does not let you down form the beginning until the end.   Michael Douglas is a fantastic actor he has given some of the greatest performances I have ever seen his most well know is as Gordon Gekko (His Oscar winning role.)  In Oliver Stone's \"Wall Streetâ",
      "review_date": "2010-08-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Unfortunately, i accidentally saw the ending before the movie. This will probably result in an unfair review, but it's inevitable.\r It's not among David Fincher's best work, but still pretty great in its own right. The story may not be veryUnfortunately, i accidentally saw the ending before the movie. This will probably result in an unfair review, but it's inevitable.\r It's not among David Fincher's best work, but still pretty great in its own right. The story may not be very original, but its execution is very good. The performances are very competent and effective.\r if you're a fan of David Fincher, or of mystery & suspense movies in general, watch it.",
      "review_date": "2014-02-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Game is a fun movie from David Fincher. It's not particularly revelatory or masterful, but it does have the requisite thrills and spills for an entertaining night's viewing.",
      "review_date": "2013-04-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The game is the first movie that i watched and didn't know what to think of it, i honestly don't have any idea whether to feel bad,angry or missleaded so you won't find a conclusion here but basically it goes like this:\rthis review is aThe game is the first movie that i watched and didn't know what to think of it, i honestly don't have any idea whether to feel bad,angry or missleaded so you won't find a conclusion here but basically it goes like this:\rthis review is a giant spoiler, so don't read it if you haven't watched the movie yet, thank you, goodbye.\rthe title of the movie is a giant spoiler so you shouldn't take the movie seriously but somehow David Fincher was able to force you to believe that the events is real and that's talent ladies and gentlemen whether you like it or not but think about it this way,\rif the movie was a game then thinking about it will raise alot questions, flaws and plot mistakes,\rfor example, if all the pullets that been used in the movie are fake then how can you explain the damages that the pullets makes, rubber pullets is a good answer, but the handgun that been used by Michael Douglas that he took from the private detective was able to flat a tire and that's no rubber pullets.\ralso they locked him up with taxi cap and throw him in the sea, what if he couldn't swim or didn't remember that he had the handle to open the car window, he'd be dead.\rand they drugged him and put him inside a coffin in Mexico city, what if he was robbed and killed in his way to the united states ? they wouldn't be able to do anything about it,\rand last what if he jumped 5 feet to the right, he would be dead, because it's totally stupid that he jumped right into that mark.\rand i can go on and on and on about it, but you get my point, it's a movie that have more plot mistakes than The Dark Knight Rises and Man of Steel combined.\rbut my average rating goes for three reasons, the movie isn't boring at all, it actually interesting and keep you guessing and intense the entire time,\rand two David Fincher force you to believe that it's real even though he spoiled it earlier,\rand three because i want to recommend to everyone, but don't over think about it like i did, because i have no life, just kidding, enjoy it.",
      "review_date": "2014-01-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Having read the book first I was hopeful for this movie. Michael Douglas seemed a good selection for the main role and I thought his performance was solid. The book unfortunately did not seem to cross over to the film enough. that is not toHaving read the book first I was hopeful for this movie. Michael Douglas seemed a good selection for the main role and I thought his performance was solid. The book unfortunately did not seem to cross over to the film enough. that is not to say that key bits were missed or the film was not true to the text. It was just that I did not feel that the film fleshed out the book enough. Some of the key moments where people are brought into the story seemed to be better paced in the book and a bit rushed in the film.\rThe plot of the book is an intriguiging one and it is kept whole by the film. Douglas plays a rich business man, very self obsessed and not really caring for anyone around him. His kind of unstable/wacky/do anything once brother gives him a random birthday present. A Game... I won't explain too much incase I spoil the film but its an interesting tale.\rThe film just did not add any real tension for me. I can't put my finger on why. I think it was maybe a character portrayal thing or the pacing of the film. In the book I genuinely felt for the character and the way the Game affected those involved.  You may say knowing the plot may spoil it but sometimes knowing what is coming can Add tension and it just felt flat.\rI would say its worth a watch but I would not say to seek it out.",
      "review_date": "2013-05-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Game is a well made Fincher film, however suffers from what most films did in the 90s, defying the span of logic by plugging the plot-holes with those 'it just so happens' moments.",
      "review_date": "2016-06-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Game is making an attempt to confuse the audience and it invited the viewer to consider whether the main character is actually part of a crazy game (which he has payed for) or whether he is being deceived. The movie is at firstThe Game is making an attempt to confuse the audience and it invited the viewer to consider whether the main character is actually part of a crazy game (which he has payed for) or whether he is being deceived. The movie is at first challenging (which is awesome) and throughout it you will ask yourself whether he is still participating in the game or in something else. It sounds like a great movie indeed!\r However, the Game is a relatively mediocre movie for one main reason! It doesn't make any sense and it is therefore far from logical. The story is full of gaps and holes...It is true that a movie doesn't have to be logical and make perfectly sense, but the Game is trying soooo hard to be a 'smart' movie. At first it appears that it is...That is until you realise that the Game isn't even making an attempt to explain and bind together the strings of the plot. If the game had allocated 6-10 minuted in the end for this purpose, it could have been a real brainteaser and earned itself at least 7.5.\r Overall it is a decent movie but it is NOT the smart/well thought out movie it is trying to be, this is due to the above-mentioned!",
      "review_date": "2014-06-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "'The Game': Absurdly Inspired.\r You have to hand it to David Fincher, whose elegant direction made a 10 out of \"Seven.\" He performs a similar transformation on \"The Game,\" a mystery thriller that is -- depending on your perspective --'The Game': Absurdly Inspired.\r You have to hand it to David Fincher, whose elegant direction made a 10 out of \"Seven.\" He performs a similar transformation on \"The Game,\" a mystery thriller that is -- depending on your perspective -- creatively challenging or just plain wacko.\r With Michael Douglas in the lead, it’s no surprise that the story stands squarely in the Hollywood character workshop for super-yuppies. As Nicholas Van Orton, he’s a San Francisco investment banker worth millions, whose human relationships are less than liquid. He’s divorced. He’s only occasionally in touch with his kid brother, Conrad (Sean Penn), who has his share of behavioral problems. And thanks to repetitive flashbacks, we learn that, as a child, Nicholas witnessed his 48-year-old father leap to his death. Nicholas lives alone with his father’s housekeeper (Carroll Baker) in a castle-cum-prison of a home. It’s clearly time for this ’90s Scrooge to get in touch with his inner bile and learn valuable lessons about himself and people.\r When Nicholas turns 48, his brother gives him a one-of-a-kind birthday present: a gift certificate for CRS, or Consumer Recreation Services. But when Nicholas shows up to CRS’s glass tower office to claim his good time, he’s submitted to a physical exam, and a barrage of questionnaires about his financial status, personal history and hobbies. He’s even asked to provide responses to pictures. (\"Woops,\" says our control freak, looking at a car flying off a cliff.)\r Exasperated by the rigorous tests, Nicholas is further mortified to learn that his \"application\" to CRS has been rejected. And yet, signs come up that indicate maybe he is in the game -- whatever that may be.\r Did CNN newsman Daniel Schorr just mention his name on the airwaves? Did that waitress (Deborah Van Unger) purposely spill drinks all over him? And why -- when the waitress is fired on the spot -- does an anonymous waiter slip Nicholas a note which says \"Don’t let her get away\"? Nicholas is drawn inexorably into a dangerous game where the rules are not apparent, and where he can never tell if he’s being put through a gag or his life is in danger.\r \"The Game,\" written by John Brancato and Michael Ferris, is an elaborately constructed crock. But it plays enjoyable, postmodern footsie with the paranoia-infused thrillers of the 1970s, such as \"Three Days of the Condor\" and \"The Parallax View.\" It’s formulaic, yet edgy. It’s predictable, yet full of surprises. How far you get through this tall tale of a thriller before you give up and howl is a matter of personal taste. But there’s much pleasure in Fincher’s intricate color schemes, his rich sense of decor, his ability to sustain suspense over long periods of time and his sense of humor. And frankly, no one plays a jaded Master of the Universe better than Douglas. There’s something compelling about watching what will happen to him, whether you’re rooting for his redemption or hoping against hope that he’ll hang himself with one of those silk ties.",
      "review_date": "2016-04-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What to give the man who has everything? The idea of creating a Hitchcock-style suspense plot looked good from the surface; the intention was good even though the plot is not entirely perfect. What is appreciated is that the film manages toWhat to give the man who has everything? The idea of creating a Hitchcock-style suspense plot looked good from the surface; the intention was good even though the plot is not entirely perfect. What is appreciated is that the film manages to keep the viewer's attention. For a weekend evening.",
      "review_date": "2021-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I use the word \"bratty\" for the way it is endorsed, there is no thrill if there is no empathy.The Game\n\nFincher's bratty film is in no way near the genre it claims for. Not thrilling, nor mysterious, no drama. The only possible way it wouldI use the word \"bratty\" for the way it is endorsed, there is no thrill if there is no empathy.The GameFincher's bratty film is in no way near the genre it claims for. Not thrilling, nor mysterious, no drama. The only possible way it would fall under the section \"crime\" is if we arrest it for forging the documents on applying it under those above mentioned genres. That was way too harsh. So I should take some heat off and put someone worthy on the stand. And it is not the director David Fincher. He shouldn't be blamed at all. I wouldn't even call it his choice. And instead it is the writer whose desperate pointless venture of creating a mind bending experience for the viewers fails repeatedly in the film.And it grows annoying to be honest, after a while. The eye opening revelations are hair pulling disasters where the predictability is just a cherry on top. Where the only thing sad above the fact that Fincher has to keep all this mess togethers, is that someone talented as Michael Douglas has to go through the banal set of rules for The Game.Mostly, I find people around me gushing over the nail biting climax and to be honest I don't mind the old flip and turn show. I couldn't care less. No matter how much hard Christopher McQuarrie tries in Mission Impossible: Fallout, he could barely draw out a nod from me. But that is only because we know that those fireworks won't ever glorify your night. The real crux is on how clean and precise you are on spiraling out the web of lies. Especially a film like this that has to keep its audience in the dark all the time. And that is why I love the first act of the film, it is properly polished, beautifully edited and smartly directed. The obvious things never go loud and if they do, they are intended to be.",
      "review_date": "2019-09-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Game is quite a thrill seeking ride directed by David Fincher. For as entertaining as it is, it still comes with pitfalls. Exactly how all these things that happen in the movie could done so precisely is baffling. Maybe Fincher wanted itThe Game is quite a thrill seeking ride directed by David Fincher. For as entertaining as it is, it still comes with pitfalls. Exactly how all these things that happen in the movie could done so precisely is baffling. Maybe Fincher wanted it to be like this but at the end of the film I still felt like this was all to good to be true.60/100",
      "review_date": "2018-10-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie starts very weak, but ends very strong. You just have to accept that the game makes no sense and that it's totally dependant on things no one could possibly predict or control. Once you accept that, it's a lot of fun to just goThis movie starts very weak, but ends very strong. You just have to accept that the game makes no sense and that it's totally dependant on things no one could possibly predict or control. Once you accept that, it's a lot of fun to just go along with this film.As I mentioned earlier, the first half (and maybe a bit more) isn't the best. Becuase there's apparently only so much you can do with the premise of an alternate reality game gone too far, it becomes pretty repetitive very quickly. However, once Michael Douglass wakes up in Mexico, the film picks up again and becomes better than ever.It's not one of David Fincher's best movies (in fact, I would say it's his weakest film, not counting Alien 3), but his direction is so good and the thrid act so bonkers that I have to reccomend it.",
      "review_date": "2020-09-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "La trama avanza con lentitud; sin embargo, tiene mucha tensión y la actuación de Michael Douglas es excelente. ¡TOTALMENTE RECOMENDABLE!",
      "review_date": "2021-04-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is one of the most disappointing films I've ever watched. So much potential and promise, but at the end of the day, this is nothing but an average flick. It has great ideas, but poor execution, especially the ending.",
      "review_date": "2020-09-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don't know how it's possible to make a movie so interesting and with such a horrible ending.",
      "review_date": "2021-07-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Roger Ebert once wrote a review for a movie North, and he wrote \"I hated this movie. Hated hated hated hated hated this movie\" and that's exactly what my reaction to David Fincher's The Game, 2 hours and 8 minutes movie opens with a powerfulRoger Ebert once wrote a review for a movie North, and he wrote \"I hated this movie. Hated hated hated hated hated this movie\" and that's exactly what my reaction to David Fincher's The Game, 2 hours and 8 minutes movie opens with a powerful scene then the movie continue to Michael Douglas got a message that get him into his brother's game and it turn out to be not what he's expecting, gunshot, slam, punching, hiding, wrecking, running, screaming, it's a hell of an intense experience, towards the end everything was reveal, and it's really, for me, The Stupidest And Dumbest Plot Twist In Movie I've Ever Watch, it's an insult, me as an audience watching the whole goddamn thing just for that, The Game was a waste of an amazing and terrific performance by all the cast, great and intense build up for the most stupid conclusions ever.",
      "review_date": "2021-12-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Game is a smart, thrilling, and completely underrated movie that should be more renown than it is. The very thought through \"The Game\" is creepy and unexpecting with thrills and near death experiences at almost every corner. The acting isThe Game is a smart, thrilling, and completely underrated movie that should be more renown than it is. The very thought through \"The Game\" is creepy and unexpecting with thrills and near death experiences at almost every corner. The acting is impeccable; this is one of Michael Douglas's best roles. The Game takes the viewer through a world where nothing is certain, and executes it quite well. Whether if it's the action, the thrill, the mystery, or even the drama, The Game is guaranteed to give you an exceptional viewing experience. The idea behind this movie was well-thought and portrayed expertly, along with superb acting. The Game, in my opinion, is a must-see.",
      "review_date": "2021-08-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What an exercise.  I can appreciate a movie that keeps me thinking, this was no exception.  When I had it all figured out, it flipped again.  I was not disappointed by the time invested in watching this film. While some parts are a bit of aWhat an exercise.  I can appreciate a movie that keeps me thinking, this was no exception.  When I had it all figured out, it flipped again.  I was not disappointed by the time invested in watching this film. While some parts are a bit of a reach for reality, it is good entertainment.",
      "review_date": "2022-01-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is so well-crafted, the Fincher effect, a lot of details in every frame. This is one of the most interesting thriller.",
      "review_date": "2022-06-24",
      "source": "metacritic"
    }
  ],
  "num_reviews": 66
}