{
  "title": "Titanic",
  "rating": 8.4,
  "release_date": "1997-12-19",
  "genre": [
    "Drama",
    "Romance"
  ],
  "summary": "A fictional romantic tale of a rich girl (Winslet) and a poor bohemian boy (DiCaprio) who meet on the ill-fated voyage of the 'unsinkable' ship.",
  "critic_reviews": [
    "You don't just watch Titanic, you experience it.",
    "It leaves the port of enterprise and arrives on the far shore of art.",
    "It is flawlessly crafted, intelligently constructed, strongly acted and spellbinding.",
    "Titanic floods you with elemental passion in a way that invites comparison with the original movie spectacles of D.W. Griffith.",
    "A huge, thrilling three-and-a-quarter-hour experience that unerringly lures viewers into the beauty and heartbreak of its lost world.",
    "His (Cameron) movie may not be perfect, but visually and viscerally, it pretty well is.",
    "A film that sweeps us away into a world of spectacle, beauty and excitement, a realm of fantasy unimaginable without the movies.",
    "Narratively, Titanic is a masterwork of big-canvas storytelling, broad enough to entrance and entertain yet precise and delicate enough to educate and illuminate.",
    "The title represents size and power, speed and hubris -- the very things the ship has come to stand for and the things that Cameron has restored to the cinema with grand, generous style.",
    "It's quite possible that Titanic is one of the greatest romantic epics ever filmed.",
    "Will take you by surprise as a romantic, fast-paced, entertaining spectacle that deserves to earn back every penny spent to produce it.",
    "A spectacular demonstration of what modern technology can contribute to dramatic storytelling.",
    "One hell of a movie.",
    "That the familiar story of the Titanic disaster is told with suspense is not as surprising as Cameron's clear-headed balance of truth and fiction, spectacle and tragedy.",
    "The true allure of Titanic is its invitation to swoon at a scale of epic moviemaking that is all but obsolete.",
    "It's a powerfully ersatz experience, but at least it's powerful. There's a lot to like here: At three hours and 14 minutes, the film takes longer to watch than the Titanic took to sink.",
    "Like the doomed vessel from which it takes its tale, Cameron's film is a behemoth, svelte, streamlined, and not the least bit ponderous.",
    "The first half drags a bit, but the adventure scenes are exciting and the visual effects are as dazzling as Hollywood's most advanced technology can make them. Focusing as much on time and memory as on danger and disaster, it's an epic with a heart.",
    "Titanic is awesome even when it's awful -- you can't take your eyes off the extraordinary thing.",
    "Titanic is a big-budget spectacle and director Cameron brings it off with high-tech bravura, placing us aboard the ship in real time.",
    "Cameron captures the majesty, the tragedy, the fury and the futility of the event in a way that supersedes his trivial attempts to melodramatize it.",
    "It's both the shortest 3 1/2 hours you'll ever spend at the movies and spectacle of such magnitude that it's hard to imagine feeling you didn't get your time and money's worth.",
    "This movie should have blown us out of the water. Instead we catch ourselves occasionally thinking the unpardonable thought: \"OK, sink already.\"",
    "The last hour of Titanic is huge and staggering, but there's no horror in it. No gravity, either. Entrusted with one of the century's monumental stories, Cameron can present it only as a crying shame. And that's a crying shame.",
    "Cameron has never been known for his dialogue, but Titanic carries some stinkers that wouldn't make the final draft of a \"Days of Our Lives\" script.",
    "Ultimately, Titanic will sail or sink not on its budget but on its merits as drama and spectacle. The regretful verdict here: Dead in the water.",
    "No amount of excellent period costuming and brilliant set decoration can substitute for a good story and decent acting.",
    "What audiences end up with word-wise is a hackneyed, completely derivative copy of old Hollywood romances, a movie that reeks of phoniness and lacks even minimal originality.",
    "Cameron manhandles the real story, scavenging it for his own puny narrative purposes. It's a film made with boorish confidence and zero sensitivity, big and dumb and hulking."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Titanic is the movie which really made me respect James Cameron as a film maker. He had made excellent movies before such as Terminator 1 and 2, True Lies, and Aliens, but Titanic is really different. Here he offers excellent and believableTitanic is the movie which really made me respect James Cameron as a film maker. He had made excellent movies before such as Terminator 1 and 2, True Lies, and Aliens, but Titanic is really different. Here he offers excellent and believable characters, stunning visuals and a compelling story. This movie is truly a 10!",
      "review_date": "2010-11-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I can't believe some people don't like this film. It is timeless, I have seen it at least 15 times and would gladly watch it another 30 (I probably will). One of the rare movies that can make me cry every time. However, it is not I can't believe some people don't like this film. It is timeless, I have seen it at least 15 times and would gladly watch it another 30 (I probably will). One of the rare movies that can make me cry every time. However, it is not the \"I'll never let go\" part that sets me off...it's the old people cuddling in bed and the mother reading one last story to her children..because you know then that they have lost all hope. Truly beautiful.",
      "review_date": "2007-01-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Beautiful movie....\r This movie is the greatest in Romantic genre.\r Perfect movie by James Cameroon.\r Perfect acting by  Leonardo DiCaprio, Kate Winslet",
      "review_date": "2014-06-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "to all you people who claim its bad, only because you dont like romance or that it wasn't actiony enough for you: dont comment on how good a movie it is if you cant stand apart from personal opinion. its a damn good movie and even if to all you people who claim its bad, only because you dont like romance or that it wasn't actiony enough for you: dont comment on how good a movie it is if you cant stand apart from personal opinion. its a damn good movie and even if you don't like romance or epic 11 TIME OSCAR WINNERS -may i point out-you have to admit its amazing. i love it and will always love it.",
      "review_date": "2008-01-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is by far the best movie ever made! he acting is amazing and the effects are perfect and the score is lifealtering. you will cry your heart out! the movie will change your life. after seeing it, i was numb and cried every time someone This is by far the best movie ever made! he acting is amazing and the effects are perfect and the score is lifealtering. you will cry your heart out! the movie will change your life. after seeing it, i was numb and cried every time someone even mentioned titanic....... and i am a 14 year old boy! best movie ever!",
      "review_date": "2008-01-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is the best movie ever. Those who say that it's horrible, are just people without feelings. If you are sentimental, you love love stories, you will definetily will love this movie. Kate ands Leonardo are just great. The whole movie This is the best movie ever. Those who say that it's horrible, are just people without feelings. If you are sentimental, you love love stories, you will definetily will love this movie. Kate ands Leonardo are just great. The whole movie is great. The best of all times.",
      "review_date": "2008-04-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Why do people hate this movie? Because they are flawed, they are jealous about how a movie like Titanic can be this perfect.Universally acclaimed and adored, perfect box office record, Oscar-sweep, all time hit soundtrack and the wholeWhy do people hate this movie? Because they are flawed, they are jealous about how a movie like Titanic can be this perfect.Universally acclaimed and adored, perfect box office record, Oscar-sweep, all time hit soundtrack and the whole phenomenal. Titanic haters will always be remembered as loser, or they are just emotionally retarded.",
      "review_date": "2020-05-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One Of The Saddest Movies Ever MadeTitanic is absolutely beautiful from start to finish.",
      "review_date": "2019-06-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If director James Cameron had concentrated on his thesis -- that the sailing of the Titanic basically marked the transition from 19th Century ideas of classism to 20th Century notions of egalitarianism -- and had ignored the boring loveIf director James Cameron had concentrated on his thesis -- that the sailing of the Titanic basically marked the transition from 19th Century ideas of classism to 20th Century notions of egalitarianism -- and had ignored the boring love story, this could have been a far more impactful feature.",
      "review_date": "2021-09-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I can't believe some people don't like this film.Titanic is best movie that I saw in my lifetime. With the wonderful artist Leonardo DiCaprio and Kate Winselt, I love them.",
      "review_date": "2018-11-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Ordinary and and utterly predictable piece of storytelling. Special effects are great but that doesn't make up for this bloated and dull movie.How it won the best picture oscar is anyones guess.",
      "review_date": "2020-12-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It is a very boring movie I fell asleep watching it and the truth is that it is not enjoyable at all and the \"action\" scenes are very pathetic",
      "review_date": "2023-01-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "does anyone ACTUALLY remember this movie lol, total chick flick... PASS. gave it a three because at least it had a little \"something something\" for the guys heh",
      "review_date": "2023-02-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The special effects and the intense tragedy of the sinking ship are well told, the romantic cut and paste story is cheese. Titanic is a good movie for sure but does show more than any other that its not the best movies that make the most money.",
      "review_date": "2011-10-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Unbelievable movie. I think everybody should go back to when he first watched this movie and no judge after watching it several times . Great love story that cannot be repeated in any other movie!",
      "review_date": "2012-12-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Titanic , the best romance I saw in my life , but for \" Passengers\" , which DiCaprio and Winslet good boys , but a remembered romance agerridos roamed where a cruise ship was about to sink and those dead passengers by the frozen water of theTitanic , the best romance I saw in my life , but for \" Passengers\" , which DiCaprio and Winslet good boys , but a remembered romance agerridos roamed where a cruise ship was about to sink and those dead passengers by the frozen water of the Atlantic , but I think if you cease to be Chris Pratt and Jennifer Lawrence fail to strike wing romance that will have space and I want to see , but this movie is incredible .",
      "review_date": "2015-12-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Titanic has stunning visual effects and wonderful acting from the versatile cast. Dicaprio, Winslet, Zane and\rBates give brilliant performances. The movie has action, drama, romance, and suspense. There's nothing\rmore that a filmgoer could ask for.",
      "review_date": "2014-07-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie was a good makeing. It really explains true love. But it also makes you think twice before getting on a ship or a boat in the icey waters.",
      "review_date": "2008-10-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A friend asked me, Will the movie look exactly the same as 1997s version? . I spontaneously told him, Well, the ship will still be sinking. Ha ha",
      "review_date": "2012-06-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's not that great of a movie, but Titanic caught in the eye-popping excitement during the last bit of minutes of the movie. Sometimes, it may or may not be worth seeing the entire movie.",
      "review_date": "2015-12-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The main reason everybody likes this movie is because of the last 30 minutes where the boat sinks, it's awesome but that means the rest of the movie is irrelevant. Leonardo Di Caprio and Kate Winslet are a terrible couple and the onlyThe main reason everybody likes this movie is because of the last 30 minutes where the boat sinks, it's awesome but that means the rest of the movie is irrelevant. Leonardo Di Caprio and Kate Winslet are a terrible couple and the only chemistry is between the ship and the iceberg.",
      "review_date": "2013-08-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "to fans of James Cameron, what could possibly go wrong? its an awesome movie of all time.",
      "review_date": "2010-10-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I remember watching this movie on VHS when it first came out and my sisters and I watched it twice in the first day we owned. A must see romance movie and suprisingly rather good.",
      "review_date": "2013-06-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nTitanic: an epic masterpiece of cinema to say the least. Not to mention THE MOVIE people love to hate, because for whatever reason pretentious people can't stand the idea that the greatest film can also be the most popular. Titanic is my favorite movie of all time, and in my modest opinion the best movie ever made. The acting regardless of what people say is brilliant. Leo and Kate have excellent chemistry and were both perfect choices for their roles. Billy Zane plays a perfect high class villain. And, who could forget the tender and touching performance of the late Gloria Stuart. The movie is historically accurate to the last detail (up to that point) and if you disagree, you don't know the titanic yourself. James Cameron had the top titanic historians on set at all times, as well as early 20th century etiquette experts training 150 permanent extras on behavior and mannerisms. Not to mention the brilliant set pieces and cinematography! The full sized set of the ship was the icing, and not a dollar of his record breaking budget was misspent. From the eerie opening dive scene, to the sunny days at sea meeting the characters, to the captivating and dramatic sinking scene, and of course the famous ending kiss atop the grand staircase, titanic is an experience. An experience of love, greed, class separation, dreams, loss, and closure: things that the audience can still relate to 100 years after the origina of the film. You aren't human if you didn't shed a tear at this film, because like it or not it's hear wrenching. All in all, this film is beautiful. Despite what you may think, it won 11 Oscars for a reason, and is a must see for film for people of all ages (after all, it's been my favorite film since I was 3).",
      "review_date": "2013-04-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Titanic is easily James Cameron's best movie, and it earns this with flying colors. The movie is beautifully shot, frame-by-frame, paying careful attention to detail; Leo and Kate's performances are some of cinema's most memorable; and theTitanic is easily James Cameron's best movie, and it earns this with flying colors. The movie is beautifully shot, frame-by-frame, paying careful attention to detail; Leo and Kate's performances are some of cinema's most memorable; and the musical score is mesmerizing. With some of the most memorable lines in cinematic history and true beauty, Titanic deserves its Best Picture Oscar entirely.",
      "review_date": "2014-03-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nTitanic is one of those movies that touches you, it is a great romance movie that possibly everyone had a love at first sight, it's has great scenes of action and some 18+ scenes as well. Overall a great movie that is also the 2nd best selling movie and with a witness telling her story",
      "review_date": "2013-10-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Overall just amazing even today. Really isn't that many movies that captured me like this one. The older you get, the more I feel you enjoy it. Soundtrack, Characters, Story, etc. Worth it. Starts out a little slow but picks up later.",
      "review_date": "2019-07-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"Based on the tragedy that spawned thousands of heartbreaking true stories, comes this fake one.\"It's time to decide: was it insensitive and somewhat cheap of James Cameron to throw two made-up passengers who fall in love onto the ship? Or\"Based on the tragedy that spawned thousands of heartbreaking true stories, comes this fake one.\"It's time to decide: was it insensitive and somewhat cheap of James Cameron to throw two made-up passengers who fall in love onto the ship? Or did these two characters offer the audience an anchor to hold onto as we are guided through the dreadful events of April 15th, 1912? Without a doubt, the latter. The fictional story of Jack and Rose never distracts from the tragic true story, it cinematically enhances it. We never ever miss the bigger picture.First of all, just look at this film. The resplendent wonder of the film's set design, both interior and exterior, places you right on board. It looks and feels the part. And when the inevitable disaster strikes, Cameron grabs onto you and drags you through each painful moment in striking detail. The sinking of the Titanic is brought to life with exquisite attention to detail and astonishing visual effects. It makes for the greatest disaster scenes in any movie I've seen.However, a Roland Emmerich or Michael Bay film this is not, as Cameron never allows the spectacle to distract us from the agony of it. Watching the Titanic being destroyed is not fun or, in its broadest sense, exciting - it's intensely distressing. Unlike most disaster films, it never feels like we're watching a crowd of extras on a film set flailing around. The lead up to the iceberg strike engages you so convincingly in the period, such that each person in front of the camera has been imbued with rich character. And when the ship sinks, it genuinely shocks you to see them go. For a good part of the sinking, Jack and Rose's fictional plight is quite sensibly placed to one side, giving us time to reflect on the truth and how it would have felt to be aboard the ship that horrifying night.So aside from its sweeping spectacle and moving depiction of real-life tragedy, what does the story of Jack and Rose bring to the table? In spite of how persuasive the film is, one must remember - it's ultimately a work of fiction, not a documentary. Like any period drama, it is an interpretation of how society worked at the time. Jack and Rose, as well as being beautifully played by DiCaprio and Winslet, are incredibly well crafted. They are a window into a much more subtle form of racism, which is still prevalent today. It's called class, and in the latter half of the movie, it becomes a tool with which to decide who lives and who dies.Titanic has pretty much anything you can ask for. It's a romance; it's a disaster movie; it's an action film; it's got a sense of humour and wit; it's a period drama; it's a tragedy. Summed up, Titanic is about as perfect a cinematic experience as you're ever likely to get.",
      "review_date": "2017-11-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is simply beautiful. It was well written and had great actors in it and most of all it captures the audience watching it. It is long, however it's definitely worth every minute of it. I'm likely a little biased since my birthday isThis movie is simply beautiful. It was well written and had great actors in it and most of all it captures the audience watching it. It is long, however it's definitely worth every minute of it. I'm likely a little biased since my birthday is April 14, the same day that it crashed, but trying to be as little biased as possible I would have to recommend this movie to anybody looking for a good movie to watch. It's definitely a classic and will go down in history as a great movie.",
      "review_date": "2014-11-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Titanic gives audiences around the nation a hope that love can be found anywhere, even on a sinking ship.  In the film Titanic we follow the love story between two characters who go by the name of Rose and Jack.  The discover love in a placeTitanic gives audiences around the nation a hope that love can be found anywhere, even on a sinking ship.  In the film Titanic we follow the love story between two characters who go by the name of Rose and Jack.  The discover love in a place that many people would not think you could.  Their love is tested when the Titanic hits an ice berg.  The director of Titanic is James Cameron and based on his past film you can guess that Titanic will be a film to remember.  Cameron's dedication to the film shows through the finished product of the film.  He studied the Titanic for many months before he started writing this film because he wanted the audience to feel as though they were sailing on the ship with Rose and Jack.  He achieves this goal making audiences feel fully emerged in the whole story.  Titanic is rate PG-13 and I strongly advise children under the age 13 to go to the movie with a parent because there are some nude scenes and fowl language.  This film can be seen by both male and female because it has an adventurous side and a romantic side.  I would strongly advise seeing this movie because it leaves you with a feeling of hope and completion.  I enjoyed the movie and would defiantly go and see it again. James Cameron has once again made a classic movie that will go down in history.",
      "review_date": "2014-12-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A mostly unqualified triumph for James Cameron, who offers a dizzying blend of spectacular visuals and old-fashioned melodrama. It is truly his best film and one of my favorite movies of all time. I'm gonna give Titanic an A+.",
      "review_date": "2018-05-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Absolutely a piece of art. I don't really don't mind why people are going to say this film is the worst ever made etc.. blaming graphics effects.. or the main plot.. while with no doubts it is extremely emotional and full of love.. it's notAbsolutely a piece of art. I don't really don't mind why people are going to say this film is the worst ever made etc.. blaming graphics effects.. or the main plot.. while with no doubts it is extremely emotional and full of love.. it's not such common to look at one love story with such emphaty, basically this film won't never die.",
      "review_date": "2019-03-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was magnificent woooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooow",
      "review_date": "2019-05-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a great movie.. Actually my favorite movie.. After watching this movie my favorite director is James Cameron, my favorite actor is Leonardo Dicaprio, my favorite song is My heart will go on and my favorite singer is Céline Dion.. ThisThis is a great movie.. Actually my favorite movie.. After watching this movie my favorite director is James Cameron, my favorite actor is Leonardo Dicaprio, my favorite song is My heart will go on and my favorite singer is Céline Dion.. This is a perfect movie.. Romantic, emotional, dramatic.. Its direction, visual effects, story telling, screenplay, story and cast is great.. This is my all time favorite movie.. Really love it.. I can watch this movie anytime.. in any mood... And one more thing kate Winslet is looking damn gorgeous in this movie...",
      "review_date": "2020-03-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Titanic is an achievement of incredible practical effects, and it manages to be a three hour long movie that doesn't have much filler or feel its length. The love story may be cliche and the historical accuracy may not be 100%, but the filmTitanic is an achievement of incredible practical effects, and it manages to be a three hour long movie that doesn't have much filler or feel its length. The love story may be cliche and the historical accuracy may not be 100%, but the film still has some surprises up its sleve.",
      "review_date": "2021-03-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Titanic is a movie merging two characters coming from completely different social backgrounds on the ill-fated ship. I don't understand why lots of people didn't like this movie. Q: Why is it such a \"sappy\" love story?A: It's a trick used toTitanic is a movie merging two characters coming from completely different social backgrounds on the ill-fated ship. I don't understand why lots of people didn't like this movie. Q: Why is it such a \"sappy\" love story?A: It's a trick used to make us love the main characters, so that when one of them dies, we feel sadness for all the other people that died with the ship.Q: Why such a terrible script?A: Seriously? It's brilliantly written. In fact, it closely has some of the aspects that the blockbuster \"Inception\" contains. You have to look closer than the dialogue and the actions of the story. Writing a screenplay is a very hard job. You have to symbolize with almost everything. You have to feel what the characters are feeling and how they would react to certain situations. Plus, there it has a pretty big plot behind it (you've got the heart of the ocean, the painting, the whistle, the hair pin, etc) that has to be weaved together... and this can be a VERY messy process that takes a LONG time to clean up. It's a slap in the face when someone says your work, in which you worked five years on, is horrible.Q: Why the best picture?A: Come on, it was the 90's. In that decade, picture wasn't that great considering it was VHS. And when they talk about best picture, they don't just talk about how HD the film is. They talk about the colors, the cinematography, the lighting, etc.Q: Why the cheesy dialogue?A: Okay, try writing a play right now. What would you say if you were in water BELOW FREEZING and you knew you were going to die. What would you say to your lover? It's not cheesy, and it's not dumb. It's well thought out. I have to go through my written dialogue many times before it seems right. The dialogue also has to move the story forward, which is what happened in the film. Q: Wow, there's no action before the sinking. Why?A: What if Titanic was written differently? Maybe it introduces a thief on the ship who tries to kill everyone on board, and actually knocked the captain off the ship and drove it into the iceberg? It would be completely stupid. It doesn't follow history. Now, I know Jack and Rose are both fictitious characters, but there were many people on board the ship that had relationships. It's not like they knew the Titanic was going to sink and broke up so that it wasn't as depressing...I'd just like to say that lots of people under-rate Titanic because it's a romance. Come on, there's actually a penis joke during a dinner scene. People are way to picky. You wanted to see a film of a ship sinking, and that's what you got. I give this film a 9/10.",
      "review_date": "2011-11-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A silly unrealistic and inaccurate sappy love story. I never really have understood why it is so critically acclaimed. Luckily critics and people have seen this fact to (with it's scores that dropped on rotten tomatoes after it wasA silly unrealistic and inaccurate sappy love story. I never really have understood why it is so critically acclaimed. Luckily critics and people have seen this fact to (with it's scores that dropped on rotten tomatoes after it was re-released in 3D). A lot of people say that this film features a \"classic\" love story but there's nothing \"classic\" about it. Star-crossed lovers that couldn't ever be together due to society and a tragic ending resulting the death of one of them. Sound a bit familiar? it should. No, not every aspect of Titanic is horrible. It's visually amazing for one but that's its sole redeeming quality for me. I'm sorry but this did NOT deserve best picture.",
      "review_date": "2013-02-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What a romantic and sad but bombastic peace of drama this movie is. Sometimes it just all comes together and you are taken away ti a different world by a movie and this is a perfect example of that. Di caprio's best movie for me. He's soWhat a romantic and sad but bombastic peace of drama this movie is. Sometimes it just all comes together and you are taken away ti a different world by a movie and this is a perfect example of that. Di caprio's best movie for me. He's so perfectly made for the part of young guy who feels true love for the first time and the drama that splashes it all away in the end. The finale of the movie shows us  the most sad image ever shown BY FAR (of 2 old people holding on 2 each other coz they lose the fight with he water first))is just emotional perfection. Awesome peace of history-telling. SEE IT!",
      "review_date": "2012-08-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A very slightly blandish story. Just slightly, but James Cameron's \"Titanic\" still remains one of his best efforts with the help of some strong film-making.",
      "review_date": "2015-06-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Maybe the most overrated movie ever.  Special effects meet a dopey screenplay and bad acting.  The plot:  Kate Winslet's boyfriend gets her the biggest diamond in the world, and takes her to NYC in the biggest stateroom in the biggest oceanMaybe the most overrated movie ever.  Special effects meet a dopey screenplay and bad acting.  The plot:  Kate Winslet's boyfriend gets her the biggest diamond in the world, and takes her to NYC in the biggest stateroom in the biggest ocean liner in the world.  She pays him back by banging a guy from steerage in front of all his friends.  What a trollop.  The only disappointment is that this cheap whore didn't go down with the boat.  Love story?  Only if you think a cheating tramp is a heroine.",
      "review_date": "2015-04-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "James Cameron's 1997 movie epic garnered instant acclaim upon release, grossed over 1 billion dollars at the box office (Avatar would beat this record over a decade later) and was given the dubious honor of being the most expensive productionJames Cameron's 1997 movie epic garnered instant acclaim upon release, grossed over 1 billion dollars at the box office (Avatar would beat this record over a decade later) and was given the dubious honor of being the most expensive production of all time. The plot tells of a poor steerage passenger named Jack Dawson who forms a romantic relationship with first class passenger Rose DeWitt Bukater onboard the \"unsinkable\" RMS Titanic. The film focuses mainly on the relationship between the duo up until the point the great ship strikes an iceberg and sinks rapidly, transforming it into a typical big budget summer blockbuster that tries to be more than just popcorn entertainment. The acting is decent, with Leonardo DiCaprio and Kate Winslet giving dramatic performances that are fueled by the romance between the two. Billy Zane is also good as Cal Hockley, a wealthy tycoon who plans to marry Rose. Overall, the film is good but one major complaint must be addressed. I think that the film uses one of the greatest tragedies in history to its advantage just a bit too much. Of course, Cameron had been on dives to the real wreck of the actual ship himself during filming and was very much moved by it, but his feelings and emotions towards the events are not portrayed very well on film. As is typical with many Hollywood epics, a small proportion of the what happens during the sinking is historically inaccurate but apart from that it leaves an overwhelming sense of grief upon you. Actually, that grief may be the reason why the film has received so much backlash in recent years, because the first time you see it, men and women will get teary-eyed in the end, but after a number of times it just isn't the same and you wish you were seeing it for the first time instead. All in all, a masterpiece as a standalone disaster film but a tad disappointing as a historically accurate Titanic film. If you wish to see a factual version, the 1958 film A Night to Remember may be more your cup of tea.",
      "review_date": "2011-04-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "this movie is THE BEST FILM IN THE HISTORY OF MOTION PICTURES. oh and stephen B, feel free to hit me up so i can beat your faggot ass to pieces for disrespecting the best movie of all time. man up or shut the fuck up you faggot nobody.",
      "review_date": "2009-09-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The story of the Titanic is well known and so the backing plot will not come as a surprise. However the Writers thought that they had to MAKE a story to make the film. This consisted in a Terrible Love story, Weak characters and a stupid runThe story of the Titanic is well known and so the backing plot will not come as a surprise. However the Writers thought that they had to MAKE a story to make the film. This consisted in a Terrible Love story, Weak characters and a stupid run time. The performances, cinematography and special effects were good. But the character development was rubbish and I really did not get emotional involved with anyone. There was no real suspense which I know can be done in a film like this if the characters get under your skin. I would have prefered to stay more with the people who were left to die rather than see the film through the eyes of the Gentry aboard the HMS Titanic. The scene with Rose and Jack and the painting... What was the point? did we need to have it other than just to make it news worthy. I cannot believe that this film grossed as much as it did. People went Back to see it. Was there something they missed? Maybe they went back to search for a plot but that went down with the ship.",
      "review_date": "2013-05-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Wonderful.",
      "review_date": "2012-10-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Titanic is considered the best movie of the all time. i see why they have a great titanic, actors, director and a biutiful history of the most biutiful transatlantic ha ever see the world.",
      "review_date": "2013-04-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The 3D doesn't matter. I mean it's the best that your going to get from post conversion but it's nothing special. What's special is this masterpiece back on the big screen where it belongs. If I had the money to blow I could watch this 3 hourThe 3D doesn't matter. I mean it's the best that your going to get from post conversion but it's nothing special. What's special is this masterpiece back on the big screen where it belongs. If I had the money to blow I could watch this 3 hour picture perfect film over and over again. The sound and the big screen are enough. If you haven't seen it in theaters watch it before it's gone!",
      "review_date": "2012-04-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A heart throbbing movie with enchanting music and amazing effects. The storyline was near perfect  and was tear-jerking for many of its viewers. James Cameron rarely disappoints his audience.",
      "review_date": "2013-03-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Cameron's disaster-to-come love story is as original as they come but overall is overrated and over hyped. It is visually impressive (Again, James Cameron) but when it comes to love stories, it tends to weigh on after the first hour. TitanicCameron's disaster-to-come love story is as original as they come but overall is overrated and over hyped. It is visually impressive (Again, James Cameron) but when it comes to love stories, it tends to weigh on after the first hour. Titanic has three hours attached to it. Are they worthwhile? That's up to you as a viewer because everyone's viewpoint is different. For me, this film rests as an above average love story with spectacular visuals.",
      "review_date": "2015-06-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "i love james camerons creativity in avatar and  titanic . james cameron makes a movie while finding the real titanic it builds up to an adventure  . and the fact the boat is sinking thats  the best part of all",
      "review_date": "2014-03-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Okay, now to be honest, this movie is fine but the mistakes or crap were:\r1. Leonardo DiCaprio and Kate Winslet make an awful couple.\r2. Some parts were boring.\r\nThe only thing I like is the Ship R.M.S. Titanic sinking but I hate to see aOkay, now to be honest, this movie is fine but the mistakes or crap were:\r1. Leonardo DiCaprio and Kate Winslet make an awful couple.\r2. Some parts were boring.\rThe only thing I like is the Ship R.M.S. Titanic sinking but I hate to see a lot of people died. The lines were okay. The graphics are great, especially in 3D. The characters were kinda dumb (except for the real people: Captain Smith, Officers, John Jacob Astor, etc.) but dumb cause of awful couple.",
      "review_date": "2015-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "C'mon let's be honest, some years has passed ever since this came out, we can all agree on one thing: this movie is bad, like really bad, and boring, and meaningless, and makes no sense, but now it's on our pop culture, so whatever",
      "review_date": "2015-08-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Beautiful poor girl betrothed to a cruel rich man, heard that before.  Falls in love with poor but exciting boy her age, hear that before.  They all sail to America on the big, new Titanic, how lucky can you get.  It's the love blossoming andBeautiful poor girl betrothed to a cruel rich man, heard that before.  Falls in love with poor but exciting boy her age, hear that before.  They all sail to America on the big, new Titanic, how lucky can you get.  It's the love blossoming and the disaster that make the movie.  And we discover all of this because of a salvaging crew looking for a mega valuable jewel that was in the Titanic's safe.  It's fiction of course, so it's really great.  The rich guy makes for a great villain so we are rooting for the 2 kids to find true love.  I have this DVD in my collection.",
      "review_date": "2015-11-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Titanic is a romantic disaster film that suits everyone's needs. Titanic has amazing action and special effects. I recommend watching this movie for many reasons. 10/10",
      "review_date": "2016-01-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Honestly, I think this is James Cameron's masterpiece!!!  It's unforgettable, it's interesting, it does not have a dull moment!!  The love story is brilliant, and the 2nd half of the movie has all the tension and intensity I love!!!",
      "review_date": "2016-03-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "From a technical perspective this is a flawless film - in other respects however, it mostly fails through having a flat and predictably cheesy love story - a complete and almost insulting waste of the real life tragedy as a source material.From a technical perspective this is a flawless film - in other respects however, it mostly fails through having a flat and predictably cheesy love story - a complete and almost insulting waste of the real life tragedy as a source material. Mostly exists to show off the effects in it's end-sequence - but that's 100+ minutes of your life you're wasting watching Jack and Rose to see effects that would end up being dated in a few years.",
      "review_date": "2017-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of my favorite movies ever if you didn’t watch it you didn’t watch movies at all",
      "review_date": "2019-10-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie generally sucked. It is the most overrated movie of all time next to Frozen, Toy Story 3 and The Social Network. The script, acting, love story and characters are all complete garbage. The visuals and Titanic sinking part are kindaThis movie generally sucked. It is the most overrated movie of all time next to Frozen, Toy Story 3 and The Social Network. The script, acting, love story and characters are all complete garbage. The visuals and Titanic sinking part are kinda cool though. Stay away from this movie. And why did it win 11 oscars?!",
      "review_date": "2015-03-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Far too long, Really drags on the film as long as it can until it can go no more. I enjoyed the film ,dont get me wrong, but the runtime killed me in the end. Acting was ok but no where near as impressive as the film's special effects.",
      "review_date": "2011-12-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Titanic is an epic movie!!! It's the best film ever made and Leo Dicaprio is always perfect. James Cameron is the best film director ever!!\rAfter 16 years, Titanic is still a masterpiece and an unforgettable film. I am sure that in theTitanic is an epic movie!!! It's the best film ever made and Leo Dicaprio is always perfect. James Cameron is the best film director ever!!\rAfter 16 years, Titanic is still a masterpiece and an unforgettable film. I am sure that in the future, people will still admire Titanic. A HUGE well done to the cast and the crew!!!",
      "review_date": "2013-08-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Excellent film. One of the best movies ever. The plot is interesting, very entertaining, the person who sees clearly enjoys it. Many people who have seen it do not get tired of seeing it again. A good cast. Pretty recommended.",
      "review_date": "2014-01-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "11 Oscars? Why? While James Cameron's \"Titanic\" certainly delivers as a visual feast and a breakthrough in set design, it is bogged down by a predictable love story without anything new brought to the tired formula. The real stories of the11 Oscars? Why? While James Cameron's \"Titanic\" certainly delivers as a visual feast and a breakthrough in set design, it is bogged down by a predictable love story without anything new brought to the tired formula. The real stories of the real people and real heroism on board the ship are shamelessly ignored, and sometimes offensively twisted, in the film's portrayal of the Titanic's First Officer, Lieutenant William Murdoch. So offensively in fact, the film's production staff had to apologise to the entire town where Murdoch grew up. What's worse, is that this film has become synonymous with the real story of the Titanic. So, a real story of Human sacrifice, heroism, bravery and selflessness in the face of impending death has been supplanted by a third-rate teeny-bopper love story. Great.",
      "review_date": "2012-06-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Oh do I hate this movie!!! Why did it have to center on a sappy love story? And why so formulaic? And why such a terrible script? And why such over the top and upfront heartbreak? AND WHY BEST PICTURE???",
      "review_date": "2011-09-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Titanic is a 1997 film directed by James Cameron who brought us classics such as The Abyss, Aliens and The Terminator... He also brought us True Lies but that film was so bad it's unbelievable.... TITANIC has a fairly decent story but theTitanic is a 1997 film directed by James Cameron who brought us classics such as The Abyss, Aliens and The Terminator... He also brought us True Lies but that film was so bad it's unbelievable.... TITANIC has a fairly decent story but the acting from Billy Zane and Leonardo DiCaprio is ridiculous and spoils the film. The only good acting done in this film is by Kate Winslet and to me she looks beautiful and is the only good part of this film but the rest sort of spoils it and I don't like Leonardo DiCaprio anyway as an actor and to be honest the only film of his I've seen which I liked is The Quick and the Dead (1995). Of course Leonardo DiCaprio's character in Titanic dies at the end and we are meant to feel sorry for him and is so unbelievable. Of course this film is obvious, predictable until the end when you think all of the ships people will die then you think Leonardo DiCaprio and Kate Winslet will survive and only one does. Titanic has some romance, nudity and is more of an adventure film than anything that I hope stays sunk and never gets a sequel which I doubt it because this film was bad enough.  Also watch out for Bill Paxton as he makes an appearance in Titanic if only short but even he couldn't save this film from sinking.",
      "review_date": "2020-04-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "After all these years, I regret contributing to Titanic's box office. Horrible story and characters. And is it just me, or does James Cameron just has to have sex in (almost) all of his movies? I think this movie deserves a 0, but I'm givingAfter all these years, I regret contributing to Titanic's box office. Horrible story and characters. And is it just me, or does James Cameron just has to have sex in (almost) all of his movies? I think this movie deserves a 0, but I'm giving it a passing grade of 6 only becuase of: 1. 90s nostolgia 2. Great acting by Billy Zane, the only good actor in the movie 3. I admit, I love the song sung by Celine Dion",
      "review_date": "2010-10-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "James, James, James. Why did you have to be the one to direct this **** on the face of America. Titanic is a romanticisation of the Titanic tragedy. Kate and Leo do a relatively good job acting, but that's because they're the only thingJames, James, James. Why did you have to be the one to direct this **** on the face of America. Titanic is a romanticisation of the Titanic tragedy. Kate and Leo do a relatively good job acting, but that's because they're the only thing saving the movie from sinking on the review charts like the Titanic. I mean, I respect James and all, but this movie was the god-damn black sheep of them.",
      "review_date": "2011-08-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Es una pelicula clasica y muy buena,su guion,historia,trama ETC,estan muy buenos,se merece un 10 de 10 y un 100 de 100,la recomiendo para que la vean.",
      "review_date": "2013-06-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"Titanic\" has its glorious pictures, but director James Cameron forcefully brings tears to the audience with its cheesy dialogue and the overwhelming sole focus on the chemistry between the two main characters.",
      "review_date": "2011-09-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Muzak for the eyes. Tedious, vacuous, schmaltz.",
      "review_date": "2005-11-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Worst movie ever made. Were it not for Kate Winslet being naked for a couple of minutes, I'd have gouged my eyes out. There probably would have been a class-action lawsuit against James Cameron because his movie caused blindness due to Worst movie ever made. Were it not for Kate Winslet being naked for a couple of minutes, I'd have gouged my eyes out. There probably would have been a class-action lawsuit against James Cameron because his movie caused blindness due to eye-gouging had Kate Winslet not been naked. It's a bullshit romance. Go watch Rambo or something if you want to see a real movie. You know, one where there's no character development and shit gets blown up because it's awesome.",
      "review_date": "2007-07-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "one of the best movies of all time, titanic made me cry everytime i watch it",
      "review_date": "2022-02-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Along with Braveheart and Forrest Gump, one of the worst Oscar winners of all time. Pure turgid drivel. A chick flick for the mentally defective.",
      "review_date": "2009-07-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I would have given it about a 5 as it is an average try-hard hollywood blockbuster but the fact that you see Kate Winslet's horrible naked body makes it a zero.",
      "review_date": "2008-06-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I once watched a trailer for titanic it was the most autistic gay piece of crap movie trailer there for the movie sucks i repeat the movie sucks. Also all of You haters who say i can not write a review on a movie i have not seen screw you toI once watched a trailer for titanic it was the most autistic gay piece of crap movie trailer there for the movie sucks i repeat the movie sucks. Also all of You haters who say i can not write a review on a movie i have not seen screw you to hell because titanic is crap. 0/10",
      "review_date": "2016-07-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Horriable movie its a porn movie with that moment with jack humping roses so apporate for me i lost my child hood. This movie is for mastorbaters and bet you agree with me too. It had good humor too not the movie but this review.",
      "review_date": "2018-01-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The idea that this was a better film than \"L.A. Confidential\" or the nominated \"Boogie Nights\" or \"The Sweet Hereafter\" is plain silly. But watching \"Titanic\" again for the first time in a few years, I was struck by how much of it does work. The idea that this was a better film than \"L.A. Confidential\" or the nominated \"Boogie Nights\" or \"The Sweet Hereafter\" is plain silly. But watching \"Titanic\" again for the first time in a few years, I was struck by how much of it does work. Unfortunately what does work is hampered at every turn by what doesn't. James Cameron doesn't let the British shine (this is an American movie) and he can't resist the urge to do those cutesy references to the era of the film (and aren't we all so clever looking back knowing who Picasso is while the benighted fools aboard think he's doomed to be a starving artist?). Yet what works is the film's romance, as cornball and contrived as it may be. Far from Leonardo DiCaprio's best performance (that would be as Howard Hughes in the far, far superior \"The Aviator\"), Kate Winslet keeps the film afloat on her shoulders and provides a compelling reason to watch \"Titanic\" even as it sinks (literally). And remember how fashionable it was to say in 1997 that you only liked the last hour of it when all the 'cool' special effects take over? Regretfully there isn't enough heat in those dramatic closing scenes and the direction feels off for that material. But as the 1990s was the decade of the period piece winning the Best Picture prize (\"American Beauty\" and \"Silence of the Lambs\" notwithstanding), this predictably swept the Oscars that year. It's a decent, occasionally overwrought film that sold more tickets and ran for longer than it deserved to. But as a Best Picture winner, it's sandwiched in between one of the 1990s best films, \"The English Patient\" and the delightfully romantic \"Shakespeare in Love\". Those two are deserving of every second they ask of the viewer.",
      "review_date": "2006-10-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The wettest and most hyped movie of all time.",
      "review_date": "2006-06-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "There's Great, Good, Okay, Bad, and Terrible when it comes to movies, This one is somewhere between okay and bad, don't mean to be sexist, but many girls and women tend to see movies for other things than what they are, in this There's Great, Good, Okay, Bad, and Terrible when it comes to movies, This one is somewhere between okay and bad, don't mean to be sexist, but many girls and women tend to see movies for other things than what they are, in this case, pretty boy leonardo decaprio in a 4 hour softcore porno, same idea with brokeback mountain , imagine a stupid chick flick that takes a 5/10, now put homsexual romance in it, goldmine.",
      "review_date": "2008-07-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Not all that bad, but definately not worth the 600 million at the box office and the 13 oscars. The film was very entertaining and visually stunning, but the romantic aspects of the film seemed both cliche and fabricated. It was pretty much Not all that bad, but definately not worth the 600 million at the box office and the 13 oscars. The film was very entertaining and visually stunning, but the romantic aspects of the film seemed both cliche and fabricated. It was pretty much Romeo and Juliet mixed with Lady and the Tramp. But the ending was amazing and gorgeous to look at. A lot like Pearl Harbor, i was disappointed that hollywood could take horrible disaster and turn it into a mediocre romance flick. Ultimately entertaining, but left a whole lot to be desired!",
      "review_date": "2005-12-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Mr. Cameron started his career by establishing himself as a great science-fiction writer/director, able to simultaneously be exciting and smart. He delievered on that promise with the two \"Terminator\" films and the completely awesome Mr. Cameron started his career by establishing himself as a great science-fiction writer/director, able to simultaneously be exciting and smart. He delievered on that promise with the two \"Terminator\" films and the completely awesome \"Aliens\". In fact, in some jurisdictions, not liking \"Aliens\" is considered a criminal act. However, having proved his talent at greatness, he decided to switch gears and try sucking for a change. And so we have... this... abomination. Gone are the great writing and pacing that anchored his previous sci-fi outings, instead replaced with a laughable script, incessant repetition and miscasting galore. There are no characters, just cardboard cutouts. The historic mistakes are mind-boggling. Even composer James Horner turns in a huge pile of cliched, faux-\"romantic\" gloop, all the more travesty if you remember he did the rousing score of \"Aliens\". Yes, the SFX is good and probably the only part of the film I will ever find anything positive to say. I have no idea why the director abandoned the niche he was most successful in for another where he fails. The final impression: \"I say we take off and nuke the entire site from orbit\".",
      "review_date": "2008-12-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don't get all the hate for this film, sure i hated leornado di'caprio in this film, i thought he was a weak lead, would have preffered someone like say Brad Pitt or johnny depp, and the romace is a little boyish at time, but you I don't get all the hate for this film, sure i hated leornado di'caprio in this film, i thought he was a weak lead, would have preffered someone like say Brad Pitt or johnny depp, and the romace is a little boyish at time, but you can't deny the cinematography excellence of this film, still haven't been matched till this day.",
      "review_date": "2008-09-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A solid movie, but no doubt one of the most overrated movies of all time. If you have a male friend that loves this film, dig further for evidence of his actual masulinity.",
      "review_date": "2009-08-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If you like disaster films, this is the film for you. But if you dont like to see love in a disaster film, just leave this one alone.",
      "review_date": "2008-12-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I can't tell bad things with this movie, it's very expensive movie... a thriller, a perfect... I wonder why others still don't like this movie... I like this a lot that AVATAR, it's perfect, it's excellent...",
      "review_date": "2010-09-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "he number of times in this unbelievably badly-written script that the two [lead characters] refer to each other by name was an indication of just how dramatically the script lacked anything more interesting for the actors to say.Also,he number of times in this unbelievably badly-written script that the two [lead characters] refer to each other by name was an indication of just how dramatically the script lacked anything more interesting for the actors to say.Also, filmmaker Robert Altman called it \"the most dreadful piece of work I've ever seen in my entire life",
      "review_date": "2011-05-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This will always be the greatest film of all time. This heartbreakingly-beautiful & sad classic, nothing short of a masterpiece, was a triumph for James Cameron (he directed Terminator 1 & 2, & Avatar). Avatar surpassed this in terms ofThis will always be the greatest film of all time. This heartbreakingly-beautiful & sad classic, nothing short of a masterpiece, was a triumph for James Cameron (he directed Terminator 1 & 2, & Avatar). Avatar surpassed this in terms of grossing only 12 years later (he really IS the king of the world). It is nothing short of late 20th century film-making's magnum opus. I cried at least four times in the movie after seeing it once. I cried when Rose went up from the lifeboat to get Jack, that was beautiful. I also cried when Jack died after hypothermia in the freezing water, when Jack sunk right into the water sent tears to my eyes right away. I cried when the band played \"Nearer, My God, To Thee\" on violin, because I thought it was beautiful. I also cried during \"The Dream\", the final scene of Titanic, because that showed how Titanic could have been the ship of dreams. & it was. It really was. Until it sunk on that fateful day. It is truly insulting that critics could be lousy & mean enough to only let this movie get a 74. It should have AT LEAST a 100.",
      "review_date": "2010-11-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of those films that stay embedded on our culture.\rI loved, love and always will love this movie.\rIt's amazing from start to finish. A great ride for everyone :)",
      "review_date": "2014-02-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "IT IS 2011 ALMOST LIKE TEN YEARS OR MORE SINCE THEY MADE THIS FILM AND EVERYTIME I WATCH IT I ENJOYED IT AND FEEL AS IF I WATCH IT THE DAY OF ITS RELEASE, I love titanic!!!!",
      "review_date": "2011-04-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "James Cameron did an excellent job at directing the film. DiCaprio and Winslet showed their amusing chemistry extremely well. Cinematography was great. The script was great. And the special effects used in breaking the ship in half wasJames Cameron did an excellent job at directing the film. DiCaprio and Winslet showed their amusing chemistry extremely well. Cinematography was great. The script was great. And the special effects used in breaking the ship in half was absolutely awesome. It can definitely match \"Gone With The Wind\" as one of the best romantic films of all time. Really fantastic...",
      "review_date": "2013-09-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "When I first saw Titanic, I was star struck. This movie is incredible. The technology is ace!!!! Leo DiCaprio 's acting is just the best he has ever been. He proves he can take on any major role. All the characters did a fantastic job. YouWhen I first saw Titanic, I was star struck. This movie is incredible. The technology is ace!!!! Leo DiCaprio 's acting is just the best he has ever been. He proves he can take on any major role. All the characters did a fantastic job. You will see that it is a long movie but it's worth it trust me. You and your family will enjoy this but be aware there are some nudity in it with the drawing scene, the car scene, and the beginning when they show the photo of her wearing the diamond. Some violence when Rose and Hockley have a fight, and when she spits.  but other than that it is a fantastic movie. Sit down and enjoy the titanic ride.",
      "review_date": "2011-08-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "for those of you who make it seem like it is a horrible movie because its slow, then shame on you, because it really is a true story, and you make it seem like it wasn't a true story, but a dumbass made up story. if you are going to burn afor those of you who make it seem like it is a horrible movie because its slow, then shame on you, because it really is a true story, and you make it seem like it wasn't a true story, but a dumbass made up story. if you are going to burn a titanic movie, then review one of the animated titanic movies. and i will admit that i myself don't especially love this movie. but it is NOT i repeat NOT A CHICK FLICK. it is a historicaly accurate movie that puts the emotion and heart wrenching events in world history. if you hate this movie because it seems like a piece of **** chick flick, then shame on you. SHAME ON YOU!!!!!!!!!!!!!!!",
      "review_date": "2011-06-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Titanic...WOW!!  I think this movie should be ranked in the top 5 movies of all time. Maybe top 3. James Cameron takes a historic event and makes it a blockbuster film. This grand film really keeps you hooked. Yeah, some visuals might lack,Titanic...WOW!!  I think this movie should be ranked in the top 5 movies of all time. Maybe top 3. James Cameron takes a historic event and makes it a blockbuster film. This grand film really keeps you hooked. Yeah, some visuals might lack, but I enjoyed the movie anyhow.",
      "review_date": "2011-11-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An achievement in visual filmmaking and a textbook case of overestimation.  This film undeservedly cleaned up 1997's Academy Awards, due mostly to poor telecasts of prior ceremonies and bowing to public pressure.  In reality, this movieAn achievement in visual filmmaking and a textbook case of overestimation.  This film undeservedly cleaned up 1997's Academy Awards, due mostly to poor telecasts of prior ceremonies and bowing to public pressure.  In reality, this movie deserved every technical award it could muster, and not a single one more.   Picked up a best picture award over the much superior film L.A. Confidential.  A good film with great visuals, but does not rank among the great films of our time.",
      "review_date": "2012-04-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the greats of our time--in terms of dramatic tragedy, disaster and direction. James Cameron largely took the romantic path of this unparalleled tragedy. The romanticism can be easily criticized; however, it makes this film and storyOne of the greats of our time--in terms of dramatic tragedy, disaster and direction. James Cameron largely took the romantic path of this unparalleled tragedy. The romanticism can be easily criticized; however, it makes this film and story much more cohesive.",
      "review_date": "2014-09-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I think it goes without saying that this movie's accomplishment to compel you is amazing. Epic on every level and is a force to be reckoned  with. A towering achievement that will forever be remembered in cinema.",
      "review_date": "2012-03-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Cannot really understand how can anyone give this movie a negative review. Loved it, was extremely touched by the movie and I believe it may be the most touching and romantic movie ever made. 10/10",
      "review_date": "2012-04-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The best movie I saw in my whole life.Leonardo DiCaprio,Kate Winslet,Billy Zane,etc.James Cameron also it's a great director.The suicide scene of one of the crew was awesome.The screenplay too.I wait to see Avatar in 3-D.",
      "review_date": "2012-10-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A true cinematic  masterpiece",
      "review_date": "2012-12-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I love to hate this movie. I hate to love this movie. Titanic, is without question, long and doesn't get interesting until about 90 minutes into the movie. As much as i hate the song \"My heart will go on\" and on...and on...This didn't deserveI love to hate this movie. I hate to love this movie. Titanic, is without question, long and doesn't get interesting until about 90 minutes into the movie. As much as i hate the song \"My heart will go on\" and on...and on...This didn't deserve best picture. It is by far not a classic. Still, this is a groundbreaking movie and should be crowned as a glorious movie, by all means, yes. I know why people hate it as well as love it.  I go back and forth between loving and hating it with a passion. No idea why. The effects are just...un-freakin-believably good. I felt as if I was there. The lines are often cheesy, but...you do have to remember, you can't just have a movie about Titanic that spands 3 hours. That is why it is a love story. I'm not one for romance anyways. So, I understand if you think it's the greatest movie ever. I also understand if you think it's the worst. In some ways, I would love to give this movie a 3 a be done with it. But, I'm forgetting, that there is something special to this movie. Kate Winslet is great. I didn't like Leo Dicaprio, but again, the whole Jack character annoyed the hell out of me. Cameron, please DO NOT write movies.",
      "review_date": "2012-12-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "My personally favorite movie, James Cameron proves he doesn't just create badass films with Robots. He went for a more romantic take this time and he succeeded. Titanic is probably one of the only movies who will make the people weep and giveMy personally favorite movie, James Cameron proves he doesn't just create badass films with Robots. He went for a more romantic take this time and he succeeded. Titanic is probably one of the only movies who will make the people weep and give us characters we will actually care about. Although lengthy, the character development was wonderfully paced so it really feels alot shorter, well for me at least. It is a must see for everyone, even though romantic dramas aren't for everyone.",
      "review_date": "2013-05-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is one of those movies that when you look at it do not you forget it and will always remember him as one of the best movie you've ever seen the film as everyone knows speaks of the sinking of the Titanic, but James Cameron tries toThis movie is one of those movies that when you look at it do not you forget it and will always remember him as one of the best movie you've ever seen the film as everyone knows speaks of the sinking of the Titanic, but James Cameron tries to make the lighter moment by telling the love story between Jack (Leonardo DiCaprio), an artist who lodges in the third class, and Rose (Kate Winslet), a seventeen year old girl from middle class family with a mother who has already planned a life and his wealthy fiancé Caledon \"Cal\" Hackley (Billy Zane). This film I've seen it many times and every time I feel an incredible feeling, it is precisely for this reason that Titanic is a masterpiece, because as many films do not ever get tired of seeing him always and every time you feel the same emotion as if it were the first time personally I can not even find a flaw in the film, I think the points that make a moving film Titanic and that leaves its mark are: the soundtrack by James Horner, the song My Heart Will Go On Celine Dion, dazzling special effects  photography Russell Carpenter and the incredible interpretation of Kate Winslet. Unfortunately, the Cinema today has had many changes compared to what it once was, most of the movies they make today are trash films, Cinema today's needs instead of movies like Titanic, one of a kind and that will leave a mark in the heart and mind. Winner of 11 Academy Awards in 1998 (all deserved): Best Film, Best Director, Best Cinematography, Best Production Design, Best Special Effects, Best Original Score, Best Song, Best Editing, Best Sound, Best Sound Editing and Best Costume Design, I conclude saying that Titanic is a masterpiece and is one of the best films ever made.",
      "review_date": "2013-05-30",
      "source": "metacritic"
    }
  ],
  "num_reviews": 129
}