{
    "title": "Baahubali 2: The Conclusion",
    "rating": 8.4,
    "release_date": "2017-04-28",
    "genre": [
        "Action",
        "Adventure",
        "Drama",
        "Fantasy"
    ],
    "summary": "The long-awaited sequel to Baahubali: The Beginning, one of the top-grossing Indian epic historical fantasy films of all-time, the conclusion picks up again with our hero Shivudu (Prabhas), as he comes to terms with his legacy and the responsibility placed on him by this knowledge. Shivudu's quest aims to find the answer to the questionThe long-awaited sequel to Baahubali: The Beginning, one of the top-grossing Indian epic historical fantasy films of all-time, the conclusion picks up again with our hero Shivudu (Prabhas), as he comes to terms with his legacy and the responsibility placed on him by this knowledge. Shivudu's quest aims to find the answer to the question that's been plaguing fans of the franchise for years: why did Kattappa kill Baahubali?… Expand",
    "critic_reviews": [
        "It's loud, it's gory, and there are musical numbers. Behold, the first great summer film is here, and it's a three-hour-long action-adventure about a leader whose heroic deeds make Conan the Barbarian look like a wimp.",
        "This production’s triumph is the room it’s granted Rajamouli to head into the fields and dream up endlessly expressive ways to frame bodies in motion."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "The greatest gift from S Rajamaouli to the world.You will not feel that you wasted your money. Its a treat to watch such a great movie.Enjoy its made for you.",
            "review_date": "2018-03-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "MAHENDRA BAAHUBALIIII IS BACK! More amazing than before and more amazing than ever. This movie is the next generation of bollywood movies and can be an excellent franchise if the fantastic S. S. Rajamouli allows it. Not only has he carriedMAHENDRA BAAHUBALIIII IS BACK! More amazing than before and more amazing than ever. This movie is the next generation of bollywood movies and can be an excellent franchise if the fantastic S. S. Rajamouli allows it. Not only has he carried the great name Baahubali to greatness but has carried it to legendary new heights. 10/10! S. S. R. is not only legend but a new rising King of bollywood movies.",
            "review_date": "2017-08-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Wonderful dramatic and what a great movie with one of the best visual effects. There is a lot of improvisation in the VFX compared to part 1. Although with a normal story the director still makes it look great",
            "review_date": "2017-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This part is more prequel than sequel because initially the story traces the origins of Baahubali’s father, who was originally meant to be the King of Mahishmati. It also delves on the love-story between Amarendra and Devasena(AnushkaThis part is more prequel than sequel because initially the story traces the origins of Baahubali’s father, who was originally meant to be the King of Mahishmati. It also delves on the love-story between Amarendra and Devasena(Anushka Shetty), who is mother of Mahendra Baahubali(Prabhas in a dual role.)  Moview is awsome",
            "review_date": "2017-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I paid over $24 to watch this movie in theaters, and it was absolutely worth it. Although it becomes somewhat predictable once it is revealed why Kattappa killed Baahubali, it is still great.",
            "review_date": "2017-05-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "another fantastic storytelling. as its preceding, this is more energetic and filling effects.story is good, effects are superb.cast and direction are high level.\nthe question, which preceding part left us too curious, answer you got here.another fantastic storytelling. as its preceding, this is more energetic and filling effects.story is good, effects are superb.cast and direction are high level.the question, which preceding part left us too curious, answer you got here.hope for another part will be there.",
            "review_date": "2018-12-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "So when this movie came I had requested my parents to let me watch it. And when I say request, I mean really, a lot. I had seen the prequel in the theatre and had been waiting for this movie to come out ever since. It got delayed by a year.So when this movie came I had requested my parents to let me watch it. And when I say request, I mean really, a lot. I had seen the prequel in the theatre and had been waiting for this movie to come out ever since. It got delayed by a year. At first I was mad because the Baahubali: The Beginning said 2016 in the end, and the year was already going too bad. But finally it came in 2017, so I guess that makes it better.And just like Baahubali: The Beginning, this one also felt legendary. Not like a cheap sequel the way successful movies make, but an actual conclusion we had all been hoping for. The question as to why Katappa killed Baahubali was answered in the most spectacular way possible. We finally got to see how Baahubali met Devasena and why he was banished from Mahishmati. The action scenes were even better than the previous movie, and it concluded without any sequel baiting.I see why there are so many negative reviews over here. This movie can only be truly enjoyed in a theatre. It won't have the same impact when being watched on a TV or phone. It needs a huge audience to cheer, a perfect environment to be absorbed and the satisfaction we get after we spend a good amount of money to watch a movie.I am really hoping this saga has come to an end. They should not make more movies unless it is really necessary. We already have the perfect duology and having more than what we need will only ruin its image which we obviously don't wish to see. This movie deserves the same love as we give to all our ancient scriptures, because that is the vision which SS Rajamouli had while making this, and it's very much apparent when we watch this movie.",
            "review_date": "2021-04-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Awesome movie Awesome Awesome!!!Better than the previous one Visual feast for the audiences",
            "review_date": "2020-08-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nNice film..great cinematography!! Fantastic direction, Rana, Anushka , Tammanah and everybody did their best... but one disappointment that is Prabhas' acting.. I can easily give full marks but can't because:- Tbh,Prabhas must be more accurate enough (that's why he didn't get any award for film) .. Prabhas has no clarity in his speech while saying dialogue.. Improvement requires for Prabhas over here.. No promising acting level.. I also noticed in Bahubali 1 also.. Also except Prabhas, everything was nicely done.. jai SSR !!",
            "review_date": "2022-06-20",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 11
}