{
  "title": "Death Note",
  "rating": 3.1,
  "release_date": "2017-08-25",
  "genre": [
    "Action",
    "Adventure",
    "Drama",
    "Mystery",
    "Thriller",
    "Fantasy",
    "Horror",
    "Crime"
  ],
  "summary": "A high school student comes across a supernatural notebook, realizing it holds within it a great power; if the owner inscribes someone's name into it while picturing their face, he or she will die. Intoxicated with his new godlike abilities, the young man begins to kill those he deems unworthy of life. [Netflix]",
  "critic_reviews": [
    "Wingard’s Death Note moves like a bullet and doles out practical gore and overheated melodrama in equal measure.",
    "What’s frustrating is that with better lead performers and a tighter script, Wingard could have made a great adaptation. Instead it settles when it should have soared.",
    "Whereas the more grounded scenes of Death Note anchor a startlingly bloody fantasy of power run amok, the scenes that fixate on super powers and code-busting seldom manage to rise above the realm of serviceable YA fiction.",
    "Perhaps stifled by the cultural and commercial clout of its source material (a multimedia juggernaut of books, movies, television shows and a stage musical), Death Note feels rushed and constricted.",
    "The result is perversely watchable, which puts it a cut above the average inane wannabe franchise-starter. With no likable characters or internal suspense to keep it in check, Wingard’s direction sputters out into a cloud of slickness and pastiche.",
    "What Wingard has delivered is a fitfully entertaining, clearly compromised hybrid of action, horror and science-fiction.",
    "The whole thing feels like the pilot episode of a third-rate comic-book vigilante TV show.",
    "The movie never quite reckons with just how twisted a concept it’s peddling, and that’s easily the scariest thing about it.",
    "Rather than relying on amplifying typical genre conventions, Wingard methodically lays the foundation to set up this particular Death Note adaptation for a potential sequel, but the outcome is more deliberate than inspired.",
    "The only reason to take such a uniquely Japanese story and transplant it to Seattle is to explore how its thorny moral questions might inspire different answers in an American context, so for this retread to all but reduce America to its whiteness indicates an absence of context more than anything else. It’s the most glaring symptom of a film that utterly fails to investigate its premise.",
    "Wingard’s film is an incoherent mess of tones and styles, confused character motives, and murky narratives.",
    "In adapting Death Note for a presumably American audience, Wingard loses the whole of its identity, and never finds a different one with which to replace it.",
    "Several of the changes to Tsugumi Ohba and Takeshi Obata’s brilliant manga have already been widely reported, including the whitewashing of the entire project by relocating it from Japan to Seattle, but those are just the symptoms of a greater disease known as complete creative bankruptcy.",
    "The new horror-thriller is cheesy, asinine, convoluted and ludicrous. On the plus side, if your eyeballs need a vigorous workout, this will have them rolling nonstop."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "The movie broke all the characters from the anime and made them into worse versions. As a movie it failed to deliver the actual moral of the story in a good way. Summed up the movie was a gore-turn-on-fiesta for the two main characters.",
      "review_date": "2017-08-25"
    },
    {
      "review_title": null,
      "content": "You know, I had the smallest of hopes for this movie. However, it just ruined everything what made Death Note great. Pacing is too fast, Characters aren't likeable or people you can sympathise with unlike the manga, and it's just a mess, butYou know, I had the smallest of hopes for this movie. However, it just ruined everything what made Death Note great. Pacing is too fast, Characters aren't likeable or people you can sympathise with unlike the manga, and it's just a mess, but I am not going to lie; it was an entertaining film to watch. It was cool seeing how the setting was adapted into an american highschool, and William DaFoe was a great casting choice for the film. Talent is certainly there, the actors are just let down greatly by the writers. Effects are pretty nice as well. Otherwise, it's a painfully medicore attempt at trying to \"adapt\" and westernise a great Manga/Anime series, simillar to what Ghost in the Shell was back in March. The film certainly had potential - and could have been great. But, that's where it failed.",
      "review_date": "2017-08-25"
    },
    {
      "review_title": null,
      "content": "It's worth a watch, but its logical inconsistencies may turn off fans of the original. It's not The Last Airbender or Dragonball Evolution levels of bad, but it does dumb down some of its source material to fit the 101 minute running time.It's worth a watch, but its logical inconsistencies may turn off fans of the original. It's not The Last Airbender or Dragonball Evolution levels of bad, but it does dumb down some of its source material to fit the 101 minute running time....Part of the original's strength was that, although supernatural elements existed, there were clearly defined rules, and every move the leads took was intelligently calculated. These rules are changed in this adaptation somewhat, most notably, a specified cause of death now needs only to be \"physically possible.\" By that logic, why doesn't Light just make one of his victims draw an exact copy of L's face and name? For some reason, this never occurs to Light, probably because he too has been dumbed down. What made him so interesting in the series, in addition to possessing a genius level intellect, was that he was a model student; not someone you'd suspect of serial murder. Here, they made him into a troublemaker from the start, and he makes idiotic mistakes like openly reading and talking about the notebook in public places. Heart attack is not the default cause of death as in the anime, resulting in an unnecessarily gory film. Misa wasn't a strong character in the source material, and I have no idea why they tried to make her a pseudo Lady Macbeth here. It's almost as if she's making Light do these things, rather than focusing on his descent to evil....The setting change didn't bother me, because the story of Death Note could have happened anywhere. The characters, however, are often so different from the originals that I wonder why they bothered keeping their names. The real stars of the film are William Dafoe as Ryuk, (he's perfect in anything sinister to cartoony levels,) and Keith Stanfield as L, (he captures the air of his source character remarkably well.) The real problem is the short run time, which forces the plot to move at breakneck pace, and does not allow for the methodic intellectual chess game between Light and L. There's enough here to make me believe the actors could have made this shine through, but not with 1 hour 40 minutes. Instead of sequel baiting, perhaps more focus should have been placed on creating a better film....All that said, I was still able to enjoy myself watching this film, and that's because the concept is really good. What happens when a teenager is given the power to kill? At the very least, we get an answer to that question when the power falls to a cringy punk. As you might expect by the run time, it starts going bad for him pretty fast. The effects were decent, though more practical effects for Ryuk would have been appreciated. The music was hit or miss. I think if they slapped another hour on to really develop these characters and the plot, or cut Mia's character entirely, we could have had a better film, but as is, it's passable. Average.",
      "review_date": "2017-08-25"
    },
    {
      "review_title": null,
      "content": "The issue with Netflix's death note is its failure to turn death note into a prime time basic television Teen audience show. The movie feels like this type of show which would run for a couple of seasons crammed into an almost two hour movie.The issue with Netflix's death note is its failure to turn death note into a prime time basic television Teen audience show. The movie feels like this type of show which would run for a couple of seasons crammed into an almost two hour movie. You will feel all of the hour and forty six minutes as this movie has nothing to keep you enthralled. No sides to pick. The movie doesn't know if it wants light to be the ultimate evil or good and doesn't give you any other side to root for if you find the anwser yourself. light has no charisma or strong motivation, he does not captivate. In the original series Death note, light has the strongest charisma and clear and defined motivation. This gave viewers a chance to either be hypnotized or completely turned off by him. There is none of that in this movie. Light is said to be very bright multiple times but is never shown to be bright outside of math problems or doing homework for other kids which ends up with him getting caught and getting sent to detention (not very bright). So the movie lacks any genius plans or long thought out killings for the viewer to follow and figure out or be suprised by. This in turn creates another issue for the opposing force of L. L is never given any challenge or run around to solve and so his character is weakened because his defining factor,his supreme intelligence is lost as his quirks of eating candy,sitting positions, and matter of fact social awkwardness actually define him and so he is seen as a Weirdo who makes pretty obvious conclusions and is quick to anger instead of the cool and calm super genius who is going toe to toe with Kira. Misa or Mia in this movie is a step up from her air headed idol self to a cheerleader who is more of the i cheer cause i want to and smoke cigarettes while doing it type than the typical pretty and popular. I believe this character would have been more interesting as the main character. Mia is introduced to the death note by light and becomes addicted to the power of it. pushing light to do more killings and then working killings on her own. I think her power craze would make for a more interesting story then the typical western issue of tap dancing between morality with power. Finally Ryuk is the saving grace of this movie. A perfect adaption, ryuk's love for carnage, apples, and unclear motivations or loyalties shine through perfectly. Ryuk is for the most part hidden in shadow or unfocused lens but when shown his CGI is very well done. I hope this isn't the last we see of His live action character because he could be wonderful in better mediums. In summary, Netflix's death note is a shallow adaption of one of the greatest Suspense Thrillers in the world, with a weak main character in light who's addition to the plot seems to be the name connection to the original character, the naming of the villain Kira, and a very weak challenge for L to figure out. Weak and misused side characters and no one to root for, Watch this movie for ryuk and some interesting aesthetics, otherwise there is nothing here for even a boring rainy afternoon.",
      "review_date": "2017-08-25"
    },
    {
      "review_title": null,
      "content": "My wife left me.    :(",
      "review_date": "2017-09-03"
    },
    {
      "review_title": null,
      "content": "This film is far less awful than the flood of incensed fan reviews suggests; that's not to say it's very good, or even holds a candle to the source material (which I loved). It's seriously hurt by a 90 minute runtime which makes the storyThis film is far less awful than the flood of incensed fan reviews suggests; that's not to say it's very good, or even holds a candle to the source material (which I loved). It's seriously hurt by a 90 minute runtime which makes the story almost incomprehensible, and a script that's trying way too hard to be \"American teen movie\". Netflix's Death Note isn't completely without its moments though! There's some great performances (Ryuk and L mostly), and stylistically it's definitely cool. Ultimately, just another entertaining but forgettable popcorn movie, with a frustrating amount of wasted potential.",
      "review_date": "2017-08-28"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nBottom line, this movie needed to be a miniseries and not rushed into roughly an hour and a half movie.   The pacing was too fast and it doesn't allow you to really connect with any of the characters in the movie.  Another problem I had with this adaptation, which is what most people will point out is that they fundamentally changed the core attributes of the characters that they adapted from the anime series.  For instance, Light was smart, but he wasn't genius level smart like he was in the anime series.  He also wasn't very confident and the way they approached being \"Kira\" was completely different.  Light, in the anime series, was all about creating and being the god of this new world order where crime will essentially be eliminated, and nothing and no one would stand in the way of that.  This Light, just didn't have the stomach for it.  Not to mention, Light, in the series, was the epitome of what every man wish they were, and every woman wished they were with.  Light. in this movie, was remarkably average; even down to the reason for why he continuing to use the Death Note and pursued this life as Kira, all to impress a girl (Mia).  What really made the anime series shine though, was the way Light and L danced a mental tango where Light was trying to either find a way to eliminate L or convince L that he wasn't Kira and L trying to get L to slip up so to confirm his suspicions that Light was Kira.  In this movie, not so much; L confronts Light at a gelato shop, where he breaks Light to into letting it slip that he was Kira.  This movie would have been better served if they cast a better Light, and didn't write him as such an unconfident wussy.  Also, in the series, Ryuk and Lights relationship wasn't as adversarial as it was in this movie.  In the series, Light and Ryuk was there for some side commentary and answer any questions that Light may have had in regards to the Death Note.  In the movie, they really didn't like each other.  Ryuk was the true star of this movie and because they played the relationship the way they did, his screen time was pretty limited. All in all, it's going to upset fans of the original anime series.  To the point where they will flat out give this a \"0\" because of those differences.   I think if you come in, never seeing the anime series, you'll find this movie to be remarkably average.  That's why it's getting the oh so average score of a \"5\".",
      "review_date": "2017-08-25"
    },
    {
      "review_title": null,
      "content": "The cultural phenomenon known as \"Death Note\" is a lot of material to try to turn into an hour and forty minute movie. So what we end up with is a film that goes for cheap thrills instead of a truly satisfying adaptation. You aren't going toThe cultural phenomenon known as \"Death Note\" is a lot of material to try to turn into an hour and forty minute movie. So what we end up with is a film that goes for cheap thrills instead of a truly satisfying adaptation. You aren't going to get all of the well thought out twists and turns, shocking reveals, or deep looks at the characters and morals of the story. You will get treated to some gory kills and surprising sense of humor though. This is the kind of thing that is sure to break the hearts of longtime Death Note fans, likely regardless of how much of an open mind they have going into this. The movie's baffling tone and angst-driven teenage romance are just likely to turn of those who have not experienced the manga/anime.Adam Wingard seems to be content with almost parodying the source material. Rather than focusing on twisted, complex characters and the dark motives of it's lead character the movie is perfectly content to have us laugh at everything going on. I could deal with a more self-aware style that's willing to poke some fun at itself, but I can't tell if a lot of the humor was intentional or not. Is the movie actually trying to not take itself seriously, or failing miserably at delivering tension and thrills? Regardless of which is the case, the movie is funny for all of the wrong reasons. The more action-packed conclusion the film has does lead to a nice little twist though. So there is some payoff in the end.While Wingard can't carry the story or tone necessary to keep things afloat, he does deliver some visuals. The gore is ridiculously over-the-top, adding to that possibly unintentional comedic feeling the movie has, but it's still pretty entertaining to watch. Ryuk looks great and his scenes carry a cool mix of creepy and playful. Probably the thing from the anime and manga that the movie gets the most right. I also have to praise the casting. Nat Wolff, Lakeith Stanfield, and Willem Dafoe are pretty great in their roles as Light, L, and Ryuk respectively even if they aren't playing the same versions of the characters many of us know from the source material. Stanfield even manages to nail some of L's mannerisms. We also have Shea Whigham in a nice and very likable supporting role to help back things up.In the end though the strong cast can't make up for the lackluster writing. This also just isn't a good adaptation of the source material. It's a bad movie, but it's a watchable bad movie. When all is said and done I couldn't tell if I was laughing with it or at it, but it still managed to make me like a few of these characters who are basically originals despite having the recognizable names. I don't recommend watching it. Especially not if you are a fan of the real Death Note story. You won't be bored if you do decide to check it out. Just disappointed. There's so much more that could have been done here and better.4.5/10",
      "review_date": "2017-08-25"
    },
    {
      "review_title": null,
      "content": "These bunch of 0 scores are ridiculous. Objectively speaking, the only issue with this movie is the acting of the main character. It is a bit weird, but it is decent.  Everything else about the production seems good to me: special effects,These bunch of 0 scores are ridiculous. Objectively speaking, the only issue with this movie is the acting of the main character. It is a bit weird, but it is decent.  Everything else about the production seems good to me: special effects, gore, photography,  camera angles, slow motion.  People are just pissed about the adaptation (and the movie is based on the anime, it is not an adaptation) because they wanted something more similar to the anime. And because of that they are looking for excuses to tear the movie apart. The main character here has a different personality (he is not a villain like in the anime) and some other things about the base story are changed, but it is still pretty good, interesting and entertaining.  I liked L and Ryuk a lot.  Characters were interesting and well developed.  I would have liked a little bit more of strategy fight among the antagonists. I think the movie did a good job preserving the core aspects of the original work while bringing something different, american-style.",
      "review_date": "2017-09-04"
    },
    {
      "review_title": null,
      "content": "I felt the movie rushing to cover all of the anime materials and failing at all of them. Have to admit it was a good effort but a bad idea to put such a deep story into a movie. When I say \"good effort\" I mean average actors, dialogs andI felt the movie rushing to cover all of the anime materials and failing at all of them. Have to admit it was a good effort but a bad idea to put such a deep story into a movie. When I say \"good effort\" I mean average actors, dialogs and direction but not awful.",
      "review_date": "2017-08-31"
    },
    {
      "review_title": null,
      "content": "For somebody who has never seen the Anime version of the film I found it quite amusing. I enjoy movies where we get to watch somebody play god. Willem Dafoe portrayal of Ryuk was as usual awesome for a bad guy with his voice. As far as theFor somebody who has never seen the Anime version of the film I found it quite amusing. I enjoy movies where we get to watch somebody play god. Willem Dafoe portrayal of Ryuk was as usual awesome for a bad guy with his voice. As far as the protagonist and his girlfriends love story was concerned, typical. The ending I did not care for, as it left a bunch of open ended questions.  However I enjoyed watching it, the mystery, the fantasy, the lore, I enjoyed it all and that is why I am giving it a high score. I also like most movies Dafoe plays the villain.",
      "review_date": "2017-09-09"
    },
    {
      "review_title": null,
      "content": "It started good for me, but went down after 30 min... Qualley is beautiful and good but jeez... it started nicely done...why?",
      "review_date": "2019-12-20"
    },
    {
      "review_title": null,
      "content": "The worst movie ever after watching the the series..Don't know why these idiots made such kind of movie...They should have copied the whole context..So it would be more pleasant.",
      "review_date": "2020-01-29"
    },
    {
      "review_title": null,
      "content": "As with most American adaptations of anime, they completely missed the mark on what makes Death Note interesting. The anime had (at least for it's first half) an extremely tense game of cat and mouse being played by characters that wereAs with most American adaptations of anime, they completely missed the mark on what makes Death Note interesting. The anime had (at least for it's first half) an extremely tense game of cat and mouse being played by characters that were incredibly intelligent and purposeful in their actions. This movie was a couple of boys that were kinda angry at each other yelling for a little bit, while Ryuk went from a sinister trickster into some sort of horror movie knock off demon. Definitely skip this unless you're super curious how much they could have possibly missed the mark on this.",
      "review_date": "2017-08-25"
    },
    {
      "review_title": null,
      "content": "Expecting a movie with a run time of less than 10% of the source material while still expecting 100% of the story is not only asinine, but inequitable (note this is the issue with most reviews under 5). The team led by Adam Wingard showed aExpecting a movie with a run time of less than 10% of the source material while still expecting 100% of the story is not only asinine, but inequitable (note this is the issue with most reviews under 5). The team led by Adam Wingard showed a considerate and attentive effort on reducing a complex story reliant on long term character development down to a short 1.5 hours. The real tragedy here is not that the story failed to be a copy and paste effort from its Japanese material, but instead that this adaptation was not expanded into an episodic series. I would have loved to see more of Willem Dafoe as Ryuk and to see a more subtle progression of Light turning towards Kira, but cuts and alterations to the story needed to be made in order to create a coherent and enjoyable movie. Hardcore fans will only enjoy scoffing at the inconsistencies from the anime or manga, but if you enjoyed Death Note casually years ago or are unfamiliar with the source material, then I would suggest giving this film a shot. Don't let the fanatics sway you away because this American version of a Japanese manga doesn't unrealistically follow the source material religiously. Not the greatest film, but it is certainly nowhere near the Dragonball Evolution levels the current rating suggests.",
      "review_date": "2017-08-26"
    },
    {
      "review_title": null,
      "content": "I'm familiar with the source material and think credit should be given to this movie considering the audience it's catering to and the running time. As a Netflix show success means lots of repeat viewings by all types of viewers and I thinkI'm familiar with the source material and think credit should be given to this movie considering the audience it's catering to and the running time. As a Netflix show success means lots of repeat viewings by all types of viewers and I think it makes for an entertaining 100 minutes that you can watch on a Saturday with friends.Even the Death Note creators approve of it for what it is.",
      "review_date": "2017-08-26"
    },
    {
      "review_title": null,
      "content": "Après le manga et plusieurs adaptations japonaises au cinéma, le fameux Death Note part aux USA pour un nouveau film qui voit et revoit à sa manière les évènements du cahier de la mort. Une nouvelle adaptation qui démarre fort bien ma foi,Après le manga et plusieurs adaptations japonaises au cinéma, le fameux Death Note part aux USA pour un nouveau film qui voit et revoit à sa manière les évènements du cahier de la mort. Une nouvelle adaptation qui démarre fort bien ma foi, puis se prend les pieds dans le tapis alors que les rebondissements se succèdent, de plus en plus incohérents...Je me demande pour ceux ou celles qui ne sauraient rien de cette histoire étrange, n'ayant rien lu ni rien vu s'ils entravent quoi que ce soit à ce bordel géant qui survient dans le dernier tiers du film. La fin du manga est d'ailleurs assez foutraque à cet égard mais ce n'est pas aussi aberrant en comparaison de ce scénario qu'ils ont écrit à trois : ils n'ont pas dû s'y retrouver eux-mêmes, ceci expliquant cela dans doute !Notons néanmoins que la réalisation est de bonne facture et qu'on ne s'ennuie pas le moins du monde, y compris dans la confusion très ambiante. Côté distribution, le petit gars se débrouille bien, de même que sa jolie copine (on dirait une petite soeur d'Eva Green !) mais pourquoi \"L\" est -il devenu un homme de couleur qui vit au Japon (?) se téléporte à Seattle et devine tout plus vite que la lumière...? c'est n'importe quoi.Bref, quel regrettable manque de rigueur ici et on préfèrera de loin les adaptations japonaises, bien plus claires et maîtrisées que ce Death Note américain, et c'est décidément bien dommage, car le sujet en lui-même reste toujours aussi fascinant.",
      "review_date": "2019-12-01"
    },
    {
      "review_title": null,
      "content": "As an adaption of Death Note, it's a 1/10. As a film taken on its own, it's just a mediocre Tween Romantic Thriller with a Death Note skin. Some of the ideas this film presents are interesting taken in abstract, but it's definitely avoidableAs an adaption of Death Note, it's a 1/10. As a film taken on its own, it's just a mediocre Tween Romantic Thriller with a Death Note skin. Some of the ideas this film presents are interesting taken in abstract, but it's definitely avoidable as a whole.",
      "review_date": "2017-11-15"
    },
    {
      "review_title": null,
      "content": "Some parts are okay, some parts are cringy and some parts are awful -- really awful. I did enjoy watching it, but I couldn't deal with the fast pace and the weird relationship in this adaption of Death Note. A series might have been a lot better.",
      "review_date": "2017-08-26"
    },
    {
      "review_title": null,
      "content": "A little different from the anime and little fast paced, but it had to be done so it would work as a movie, but still a good movie. Hope there will be a second movie.",
      "review_date": "2017-08-27"
    },
    {
      "review_title": null,
      "content": "This movie is sadly and painfully casual in almost all aspects of it. It has to many tags such as: Mystery, Horror, Adventure etc. which a lot of those is not! The directing style is also clumsy and nothing out of the ordinary. A lot of thirdThis movie is sadly and painfully casual in almost all aspects of it. It has to many tags such as: Mystery, Horror, Adventure etc. which a lot of those is not! The directing style is also clumsy and nothing out of the ordinary. A lot of third person shots from Ryuk's perspective, when he is not even there and it's useless. I didn't feel like the movie had pacing issues or dragging with the story, everything happened and unfolded right away, which was a god thing considering that it became boring pretty fast. The actors performance was almost the whole time exaggerated and broke off the little immersion the movie had. It wasn't very fun to watch neither entertaining. Also the 80's-90's styled music felt too forced and didn't fir at all the movie's environment and it's dark vibe. But the visual effects really looked good so credit is due there. Every single decision in the movie felt without consequence despite it's dramatic ending, which you could foresee almost from the intrigue. Also the plot was awfully simple, and louzy, but at least it wasn't cheesy. There is no humor in the movie which concludes to the fact that it takes it's self to seriously. There is a stable conclusion at the end, but it's just not enough to save the movie. So overall it's a painfully average movie, with almost every single main element being fundamentally flawed and broken. And my average rating is for the movie aspects only and not even considering the Manga on which is based on, and the accuracy of it, because then it would be a much lower rating.",
      "review_date": "2018-09-19"
    },
    {
      "review_title": null,
      "content": "Quite disappointed by the movie, there are some aspects of Light's personality that definitely are not form original character, making him look ridiculous and annoying. I liked Mia though, she had an interesting development through the film.Quite disappointed by the movie, there are some aspects of Light's personality that definitely are not form original character, making him look ridiculous and annoying. I liked Mia though, she had an interesting development through the film. L... I better don't talk about such a parody of original character, being just another annoying child. In resume, one can end up enjoying the film, but it's far away from the anime or manga and accept weird decisions, hope they fix them in next movie if there is one.",
      "review_date": "2017-08-27"
    },
    {
      "review_title": null,
      "content": "Im not entirely sure people know what \"adaptation\" actually means. Movie didnt deserve so much hate reviews . Despite some flaws in the plot, im still looking forward for a sequel.",
      "review_date": "2017-09-05"
    },
    {
      "review_title": null,
      "content": "While the reputation is not as bad as critics and fans made it out to be, as someone that has not seen the anime, it's interesting but it has a ton of bad ideas! For one the pacing is rushed where it felt that the writers had to shove a tonWhile the reputation is not as bad as critics and fans made it out to be, as someone that has not seen the anime, it's interesting but it has a ton of bad ideas! For one the pacing is rushed where it felt that the writers had to shove a ton of episodes in an hour and a half runtime, while also dragging and it feels like it is a lot longer than it should be. Not to mention that the main romance between Light and Mia feels forced and unnatural and all to conventional for the movie's own good. Hell having the romance being the central part of the movie instead of the titular book itself and the cat-and-mouse game between Light and L is honestly the worst decision they could have done. And with dialogue that is over-written and constantly on-the-nose it comes off as laughable as putting 80s soft-rock in integral scenes in the movie, especially towards the end with laughable uses of Chicago and Air Supply!There are some good here. Willam Dafoe as Ryuk and Lakeith Stanfield as L are good here, there is a few stylish shots and lighting that is alright, the gory death scenes are fun, and the soundtrack by Atticus and Leopold Ross does add a bit to the movie's atmosphere, but the movie has some serious issues with the movie's foundation that really on it's own just does not work. I doubt that the anime is like this, in fact I feel that the romance is a movie only idea, and really this might have been the best Netflix could have hoped for when making a Death Note movie based on the anime's premise alone.If there is one thing that the movie does right, it is getting my curiosity for the anime to peak and I do want to check it out. Unfortunately to see how superb the original is!",
      "review_date": "2017-08-28"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nIt was an OK movie, but it really wasn't Death Note at all. I understand how a reboot works, but the main characters were too different (not related to one being a white american or black) from the original ones. - Kira is not the perfect student in his school that gets a notebook that makes him think that he's a god.- L is not really weird and thinkative like he should be. Instead, he's more emotional and jittery.It's like another story in the world of Death Note. It's like... they just gave up to get a wider and younger audience to like the movie. They will think \"Oh, Kira is awesome, he thought all that in the end\" but we will know that Kiran and L were a lot more awesome in the anime.Still, L's acting was pretty good. Kira felt like... just a spoiled child ranting.",
      "review_date": "2017-08-28"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nSe pasaron el anime por el colo, la película estuvo entretenida además mia estaba super buena, ella era el propio lyght y lyght era un retrasado, el no era lyght. ryuoh estaba hecho con Paint.",
      "review_date": "2017-08-25"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI am going to start out by saying I have not watched the anime but know of it.  With that being said I enjoyed the movie but it did leave me asking more question then I had to start with like why does L know how to use the death note.  Why leave the movie in a cliffhanger.  why was it everything rushed would have like it to a little more played out.  overall i rate this a C+.  Think about this movie as a pg 13 verson of final destination.",
      "review_date": "2017-09-27"
    },
    {
      "review_title": null,
      "content": "I liked it. Get over it. When critics and fans say they hated the new Death Note, I feel they set their expectations too high. The movie dared to be different, even from the casting choice. If you don't like action packed, cheesy and anI liked it. Get over it. When critics and fans say they hated the new Death Note, I feel they set their expectations too high. The movie dared to be different, even from the casting choice. If you don't like action packed, cheesy and an original interpretation of Death Note, this is not for you. Death note has many adaptions and it is time for fans to accept a different, at times cheesy in terms of acting but unique movie. And I feel people will understand it more in the years to come. I loved the original Death Note and enjoyed this movie too.Pros: The twist is interesting. It takes liberties with the rules. L and Ryuk are amazing in this, and the actor for L clearly understood the character. There are new intense moments that give this movie a unique style.Cons: It is short, so the story is a bit rushed. Very cheesy and some scenes are either ironically or unironically played for laughs. Nat Wolff as L is a decent actor, and a lot of the lines are filled with a lot of cursing but if you accept what this movie is and what the NEW characters are trying to be, you'll accept it.Death Note (Manga and Anime) and Death Note (2017) are very different mediums. Go in with an open mind. Everyone automatically hates the 2017 version, if you go in hating it, then what's the point of watching it? Give yourself a new perspective on a movie that already has a majority consensus, you wouldn't be adding anything new to the table.",
      "review_date": "2017-09-04"
    },
    {
      "review_title": null,
      "content": "Film animesiyle hiçbir alakası yok akıl oyunları karakterler hikaye nerdeyse hiç uymuyor hiçbir bekletiniz yoksa izlenebilir ortalama üstü bir film.ehh yani işte çokda birşey beklemeyin",
      "review_date": "2017-08-27"
    },
    {
      "review_title": null,
      "content": "A great movie, plus a bad adaptation. It is very different from the anime, but it has its ups and downs, the anime is very intelligent and very intellectual, the movie, no...",
      "review_date": "2017-10-18"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \ndürüst olmak gerekirse film bok gibi ama bok diyecem boka yazık olur sırf bu film yüzünden netflix kullanmayı bıraktım aq netflix demişki \"bakın çok sevdiğiniz manga ve animenin içine edicez\" demişler abi ana karakter zeki karı kızla işi olmayan bir elemandı bunda gitmişler mal am hayali kuran birine dönüştü ulan orijinal light mezarında ters döndü aq aynı şekilde L de öyle abi L denen adamı zenci yapmak kimin fikriydi amk he bide belki bu boka devam eder belki diye önemli karakterleri öldürtmediler amk hee bide ryuk sen hadi animede en azından sempatik biriydin bir tarzı vardı ulan filmdeki katıksız orospu çocuğu aq misayı mia yapmışlar bide hayır bide mianın ikinci kira olmasıda komik light:aaa bak mia bu deftere adı yazılan ölüyo mia:hadi sikişelim bu filmi onaylayanın yapanın yönetmenin netflixin hepsini zenci siksin amin",
      "review_date": "2021-08-07"
    },
    {
      "review_title": null,
      "content": "Horrible and despicable. Honestly, I don't think the people who made this even watched the original Death Note.",
      "review_date": "2021-01-17"
    },
    {
      "review_title": null,
      "content": "Netflix had to ruin a good anime",
      "review_date": "2021-01-04"
    },
    {
      "review_title": null,
      "content": "Se a métrica de avaliação desse filme, fosse ele ser mais um escolar americano genérico, ele poderia merecer até um 6, mas não, a proposta desse filme é adaptar uma obra investigativa que já existe, já é consolidada, e é considerada uma dasSe a métrica de avaliação desse filme, fosse ele ser mais um escolar americano genérico, ele poderia merecer até um 6, mas não, a proposta desse filme é adaptar uma obra investigativa que já existe, já é consolidada, e é considerada uma das melhores do gênero Seinen, então ele merece ser avaliado a partir disso, e dessa perspectiva, o filme parece uma sátira do original, onde está recheado de estereótipos escolares americanos, com os personagens principais tendo o mesmo nome do original, mas com as personalidades completamente opostas, isto parecendo uma piada de mal gosto do roteiro com a cara do público que é fã do original",
      "review_date": "2021-05-14"
    },
    {
      "review_title": null,
      "content": "a really bad adaptation, a poor history, is a disrespect to the characters and the essence of the original material.",
      "review_date": "2021-12-29"
    },
    {
      "review_title": null,
      "content": "Аниме было довольно неплохим, а фильм ужасен. Лайт в нем тупой, цель Рюка не ясна, кира никак тетрадь не прячет, эл истеричка хотя в аниме он был спокойным и очень умным детективом.Аниме было довольно неплохим, а фильм ужасен. Лайт в нем тупой, цель Рюка не ясна, кира никак тетрадь не прячет, эл истеричка хотя в аниме он был спокойным и очень умным детективом.",
      "review_date": "2022-01-30"
    },
    {
      "review_title": null,
      "content": "Hot Garbage. So many inconsistencies in the story writing. Please watch the anime instead. Please watch the anime instead. Please watch the anime instead. Please watch the anime instead. Please watch the anime instead. Please watch the animeHot Garbage. So many inconsistencies in the story writing. Please watch the anime instead. Please watch the anime instead. Please watch the anime instead. Please watch the anime instead. Please watch the anime instead. Please watch the anime instead. Please watch the anime instead. Please watch the anime instead. Please watch the anime instead. Please watch the anime instead. Please watch the anime instead.",
      "review_date": "2022-02-06"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nOh boy where do i start?, There are so many things wrong with this movie i cant even begin to tell you about my frustration. The movie in no way properly follows the anime. There are rules of the death note that were changed in the movie like the fact that only the death note keeper can see a death god when in fact anyone who touches it should of been able to see ryuk. The characters in the movie are not even the same race as the anime. And yes i know they arent japanese but for Fu*** sakes why did they make L a African american? I'm not racists but cmon! They barely show ryuk at all in the movie probably because Netflix has a poor CGI budget or whatever. Most of the story is stretched out for no reason in a ton of boring scenes that lead to nothing but a small 2 minutes of dialogue. I wont even bother reviewing the rest of the movie because its all pointless, the movie sucks end of story and is not even worthy of having the Death Note name.",
      "review_date": "2017-08-25"
    },
    {
      "review_title": null,
      "content": "Absolute garbage. I do appreciate that they tried to take many ideas from the animé. They get the basic concepts correct, but the changes to the plot of the source material are unforgivable. Some of the changes were made to create completelyAbsolute garbage. I do appreciate that they tried to take many ideas from the animé. They get the basic concepts correct, but the changes to the plot of the source material are unforgivable. Some of the changes were made to create completely unnecessary plot twists which were vastly different from the animé, and ended up being your standard horror clichés. Ryuk was also a lot different from the animé and manga despite being the single element that remained mostly intact. In the animé he acted like he didn't care about what happened with the Death Note, and that made him even more likable as a character. In this film he's portrayed as having sinister urges for how he uses the Death Note, as if he was actually a demon or some kind of evil entity. Ryuk seemed far more neutral towards everything on the show.Light acts like an irrational dunce compared to his criminal mastermind version from the show. Misa, or \"Mia\" in the film, is much more sadistic and conniving than in the animé. Even L has a personality change, but most of his mannerisms remain the same. He too lets his emotions run wild, which is a huge departure from his cold and calculating nature on the show. This is mostly the result of an overly elaborate plot twist that is such a sharp deviation from the source material it makes you wonder if the director even watched the whole series. They also continue to cram in needlessly complicated plot devices that have no place or purpose in a supernatural detective story. On top of that, they keep ripping off various other horror films, and it feels like more of a horror film than a detective story. This is probably their greatest sin of all because it utterly destroys the tone that made the animé so unique to watch. It just becomes another disposable American horror movie which is definitely not what Death Note should have been like.This was easily the worst live-action adaptation of Death Note, and possibly the worst live-action adaptation of any animé period. I didn't think it could get much worse after Ghost In The Shell, but Netflix had to prove me wrong. Hollywood seriously needs to leave animé alone forever.",
      "review_date": "2018-11-25"
    },
    {
      "review_title": null,
      "content": "This movie was just an awful adaptation. Light's and L's characters are just terrible and tries to hard to play their roles. Ryuk is kept in the dark for some reason like we don't already know what he looks like.The deathnote isn't being usedThis movie was just an awful adaptation. Light's and L's characters are just terrible and tries to hard to play their roles. Ryuk is kept in the dark for some reason like we don't already know what he looks like.The deathnote isn't being used correctly, in the anime anyone who even touches a small piece of paper from the notebook could see the shinigami who originally owned it, not in this movie though, and he barely uses the note to kill them in a way that makes it traceable, all the heart attacks in the anime make the police force think someone is intentionally killing criminals but in this movie he uses decapitation, stabbing,and other ways to kill the criminals but to make kira known to the world light makes criminals write Kira on their cell walls like a **** moron. Mia has the mindset of kira more than light himself does in this movie. In short this movie is a weak adaptation to the anime/manga.",
      "review_date": "2017-08-25"
    },
    {
      "review_title": null,
      "content": "It could have been decent but wasn't. Poor adaptation which turned the characters into cardboard. Suspension of belief is one thing but the characters need to react to situations with some degree of authenticity. The acting was shockinglyIt could have been decent but wasn't. Poor adaptation which turned the characters into cardboard. Suspension of belief is one thing but the characters need to react to situations with some degree of authenticity. The acting was shockingly bad. The director has to take the blame for that. Very poor.",
      "review_date": "2020-05-05"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nDeath Note starts with a simple premise, what if you discovered a book that could kill anyone by writing their name in it as long as you know their face? Sadly, this is not a horror movie. I am actually not quite sure what it is trying to be. It mixes together action and horror with a touch of mystery. But, the worst offender is that no one bothered to watch the movie to check for inconsistencies in anything. The entire movie just feels like an inconsistent mess to me.Right from the beginning, there is a huge inconsistency. The Light Turner we are presented with is not a killer. In the first moments of the film, he stands up for himself only to get beaten up and abandoned by the person he protected. Moments later, he and the girl he protected, Mia, are teaming up to kill people. This feels completely out of character since Mia completely ignores him after he saves her and walks away with I think the guy who punched him in the face only reinforce the fact that Light would probably refuse to listen to Mia at all. The fact that Light was scared **** by the use of the Death Note makes it seem like he would not be using it any further and would turn it over to his father or back to Ryuk just to get it away from him.Other inconsistencies include not needing to know Watari's real name to control him. Apparently his business card that probably says Watari instead of an alias on it is enough. Everyone draws absurd conclusions super fast (example will come below).On top of that, our ace investigator in L is someone who loses his cool very quickly and easily and feels more like a stereotypical black teen than a great detective. We also never really see him do much detective work. All he tried to do is draw out Kira by appearing on television and then assuming that Kira needed a name and a face to kill. I do not know how he reached that conclusion along with many others that he makes.The unbelievable plot then makes matters worse. The Death Note can make the impossible possible, which takes out a lot of the suspense. On top of that, everyone seems to know what will happen next. Light, L, Mia, and James (Light's father) all draw absurd conclusions from random tiny things that makes you wonder how it happened. For example, James says he knew Light was the killer when the first victim was the person who killed Light's mom. The problem is we see Light use it before. We have evidence others have used the Death Note before. The climax and ending further cheapens it by showing that Light manipulated everything for like the last forty minutes. In the end, Ryuk's role makes this film seem like a cheap horror movie where people are tempted by the supernatural power of an object that he then takes back and gives it to another. Except in this case, the motivation for them to use it makes no sense. Mia and Ryuk both manipulate Light into using the Death Note, but for someone who is so scared of it, he seems to have no issues using it. He never really gives into the temptation of it. He just does it because someone else asked him to.Next, the choice of actors baffles me. A lot of the lines seem poorly executed and falls flat. It lacks emotion. Light's lines feels almost tone deaf at times and it doesn't fit him considering how he should be emotionally involved in everything. Yet, it never feels this way. His delivery is just poorly done. Everyone feels like they are reading off a script and super monotone. Even Ryuk, who is often praised by others feels the same because all he has is one dreading voice and nothing more.",
      "review_date": "2017-08-26"
    },
    {
      "review_title": null,
      "content": "Wow, wtf happened with this movie? Death Note is one of the greatest anime/manga of all time, so why was such a terrible live-action version ever green-lit? I knew this film was an epic fail the moment that Light screamed like a little girlWow, wtf happened with this movie? Death Note is one of the greatest anime/manga of all time, so why was such a terrible live-action version ever green-lit? I knew this film was an epic fail the moment that Light screamed like a little girl at the sight of Ryuk. That scene was both depressingly painful and unintentionally hilarious to watch. Almost EVERY decision Light and L make in this movie are completely out of character from their anime counterparts and stupid beyond reason. Mia is essentially the exact opposite of her original version, instead of a light-hearted goth girl we get a psychotic cheerleader, ugh. The characters, the style, the plot, the intensity of the cat-and-mouse game, basically everything that made the anime so great is ruined in this film. Some of the death scenes are absurdly over-the-top as if the director just binge-watched the entire Final Destination series and thought the same formula would work here. Unfortunately Death Note is even worse than those films. The 80's music only makes it feel even cheesier, as they try to mimic Donnie Darko as well and still end up with a trashy teen horror flick. The movie even breaks the very rules of the Death Note itself. This isn't only a bad anime adaptation, it's just a bad movie period. Cringy dialogue, lame action set-pieces, terrible movie logic, and worst of all Ryuk is hardly even in it! Willem Dafoe is actually a good choice for Ryuk but he's portrayed as some kind of maniacal puppet-master, which is NOT what he ever was in the show. Do yourself a favor and skip this hot mess.",
      "review_date": "2020-06-29"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nAbsolute **** Death note is one of the best manga/anime ever and Netflix make it American and turn it into a teenage love story with stupid characters with no development and don’t use their brains.L is one of my favourite characters ever and in this he is a stupid, irrational character who needs a reason to eat sugar.Missing the best scenes from the anime. POTATO CHIP!!    Tennis match   Naomi suicide scene   Ls death   Near and Mello don’t exist  misa misa is changed to Mia who doesn’t have a death note or  the shinigami eye which isn’t even mentioned and the relationship between misa and light is changed to a teenage romance instead of light using her for his own personal gain and lights dad is still a police detective but doesn’t die and the family is changed as light has no mom and no sister. L and light are both **** retards and light never denies being Kira ( which he called himself ) and ends in a chase through Seattle - not Tokyo- and a **** chase, the two intellectual characters who fight with their minds and outsmart each other, now run around the streets mindlessly with l carrying a gun.I swear this **** should be deleted from my mind forever. Actually offended by how **** this is and can’t understand why this was ever made the Japanese have already made multiple films and a live action tv series so this is unnecessary and just ruins the name of death noteI need a **** lie down now",
      "review_date": "2020-10-29"
    },
    {
      "review_title": null,
      "content": "Si le tienen algo de aprecio al anime, por favor no vean esta película, lo convierte todo un desastre. Los personajes son 1000 veces mas estúpidos, la trama es cambiada por completo y no tiene sentido, la actuación es pésima, el desarrolo enSi le tienen algo de aprecio al anime, por favor no vean esta película, lo convierte todo un desastre. Los personajes son 1000 veces mas estúpidos, la trama es cambiada por completo y no tiene sentido, la actuación es pésima, el desarrolo en la película es forzado y antinatural, no se adapta nada bien de la fuente original tanto del anime como del manga, le agrega un montón de clichés que no añade lo más mínimo a la historia. Sin duda, un gran error del calibre de Dragon Ball Evolution",
      "review_date": "2017-08-25"
    },
    {
      "review_title": null,
      "content": "as an Adaptation this was the worst...destroys the Traits of the characters, follows the Death Note's Story very poorly and its simply cliche after cliche... now if this was just an alternative take on Death note...then its even worst....whyas an Adaptation this was the worst...destroys the Traits of the characters, follows the Death Note's Story very poorly and its simply cliche after cliche... now if this was just an alternative take on Death note...then its even worst....why not improve on the story make it better do something awesome and memorable...but Nope...they went on the route of \"lets make an inferior version\" this was awful guys...it was bad for a Death note fan, bad for a Death note enthusiast and I imagine for someone that knows nothing from Death note...this was Horrible.",
      "review_date": "2017-08-26"
    },
    {
      "review_title": null,
      "content": "I really wanted this to be good but sadly it's not. I could go over why the changes to Light's character ultimately hurt the adaptation but most of that has already been pointed out. The thing that really made this almost unwatchable to me isI really wanted this to be good but sadly it's not. I could go over why the changes to Light's character ultimately hurt the adaptation but most of that has already been pointed out. The thing that really made this almost unwatchable to me is the direction of making the film into a Final Destination experience with the deaths. Even if you are going to go the final destination route, which is horrible for a Death Note adaptation, at least make the deaths creative and unique. The death note could add to deaths when it comes to people being controlled but they didn't even go this direction...",
      "review_date": "2017-08-25"
    },
    {
      "review_title": null,
      "content": "The movie is bad in almost every way. It's like your in the middle of a movie after the first minute and the characters aren't introduced or well made. As an adaption it's even worse. It's ok to create a movie with the idea of the Death Note,The movie is bad in almost every way. It's like your in the middle of a movie after the first minute and the characters aren't introduced or well made. As an adaption it's even worse. It's ok to create a movie with the idea of the Death Note, but recreating everything besides the names of some characters is not enough. They tried to recreate some of the best manga moments within the script though, but it didn't made much sense without the thinking process.",
      "review_date": "2017-08-26"
    },
    {
      "review_title": null,
      "content": "Can all anime viewers back off?! for me and i believe people like me(who doesn't knows anime) can enjoy this movie a lot: it has action, not boring at all. so i like if it's different from anime and my advice don't listen stupid comments:Can all anime viewers back off?! for me and i believe people like me(who doesn't knows anime) can enjoy this movie a lot: it has action, not boring at all. so i like if it's different from anime and my advice don't listen stupid comments: just watch! one think i didn't like was THE END of movie, guessing will have second part or something.....",
      "review_date": "2017-08-27"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nBad as a movie, even worse as an adaptation. Except for the first name of the characters, and the Death Note itself, nothing else connects the movie with the manga/anime. The way Light was represented was awful. The development of the plot was bad. Light controlled Watari using just Watari as his name? Ryuk chose Light cause... He's not interesting, he doesn't have a motivation, he just reacts to everything! To a notebook falling from the sky, to a bullying situation, etc.",
      "review_date": "2017-08-25"
    },
    {
      "review_title": null,
      "content": "This movie dont have nothing like the anime or manga, so if you want to see a good live action of a manga, this isn´t the movie. The unic good of this movie is that: \"L\" act a little similary like the ones that we can see in the anime orThis movie dont have nothing like the anime or manga, so if you want to see a good live action of a manga, this isn´t the movie. The unic good of this movie is that: \"L\" act a little similary like the ones that we can see in the anime or manga. The next thing that I am goin to say is not racism, but why \"L\" is black, I dont want to offend anybody but, why? (this is not very important because I think that Keith Stanfield had do a fantastic job(mayby the unic good of this movie), i just say that because \"L\" in the manga and anime have a pale skin and I just want to emphasize it). Ligth is a fool, he is maybe the thing that I more hated of this movie, why I said that?, without reasons shares the information with Missa, sorry with \"MIA\", that is ridiculous, is not justificated, he do it because yes. My conclussion is: This movie maybe can like to some people but for the lovers of the manga, anime ore both, I seriously dont recomend to see it, The only thing i liked of this movie was the way to act of Keith Stanfield the more is totally a trash",
      "review_date": "2017-08-25"
    },
    {
      "review_title": null,
      "content": "It is terrible and it does not remotely resemble the anime or manga. An adaptation that ruins the good name of the manga by weakening all the important traits that made it unique and interesting. Don't waste your time. The best thing anyoneIt is terrible and it does not remotely resemble the anime or manga. An adaptation that ruins the good name of the manga by weakening all the important traits that made it unique and interesting. Don't waste your time. The best thing anyone can do is not watch it so that the makers can take a loss and never make anything again.",
      "review_date": "2017-08-25"
    },
    {
      "review_title": null,
      "content": "Death Note Evolution. Good sequel to Dragon Ball Evolution. Horrible movie overall. This movie has no connection to the original series. Except death note and names.",
      "review_date": "2017-08-27"
    },
    {
      "review_title": null,
      "content": "I loved the anime but Netflix killed it with western actors! Where is their political correctness?!",
      "review_date": "2020-07-01"
    },
    {
      "review_title": null,
      "content": "Terrible overacted remake of the Japanese cult classic it's just bad really really bad.",
      "review_date": "2020-07-12"
    },
    {
      "review_title": null,
      "content": "Filme totalmente infiel ao anime ou ao mangá, a sensação que eu tenho ao ver o filme é que o diretor teve preguiça de ver o anime e viu so um resumo na internet",
      "review_date": "2020-09-09"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nEsta película fue mi primera intención para ver anime, pero fue decepcionante, los mismos clichés de todas las películas de netflix, a veces el chico era tonto y otras veces sí usaba su cerebro. ¿En serio le contarías a alguien ese secreto sólo porque te gusta? Tuvo muy buena producción, pero fue aburrida y muy exagerada en sus actuaciones (original y doblaje). Pero luego decidí ver el anime, y no tenía nada que ver con esto, es casi todo lo contrario, tiene más profundidad en las historias, todos hacen algo por un por qué, se usan mejor a los personajes (o a la mayoría). Esta película dejó muy mal a los que querían empezar a ver el anime :/",
      "review_date": "2020-11-02"
    },
    {
      "review_title": null,
      "content": "I'm super happy to see more attempts at bringing manga/anime to life with real budgets and actors who can break into the character. This case would only be referring to Ryuk, which is not even close to enough to make this \"movie\" worth aI'm super happy to see more attempts at bringing manga/anime to life with real budgets and actors who can break into the character. This case would only be referring to Ryuk, which is not even close to enough to make this \"movie\" worth a single viewing. Cause the joy of the possible has only served to disenfranchise fans of the source material for any and all such adaptations to date. Death Note stands out even in this crowd, maybe ESPECIALLY in this crowd of recent western attempts at live action manga portrayals. Take away character depth, plot, linear progression of the small bit that was retained and you have this warm fart....",
      "review_date": "2020-11-10"
    },
    {
      "review_title": null,
      "content": "'Death Note' is by no means a bad movie, it simply takes the story in a different direction than the Anime series it's based upon. Although this interpretation isn't as gripping or engaging as the original battle of wits between the'Death Note' is by no means a bad movie, it simply takes the story in a different direction than the Anime series it's based upon. Although this interpretation isn't as gripping or engaging as the original battle of wits between the questionably moral protagonist and his ultimate antagonist it is still an entertaining experience that is at least treating some aspects of the source material with respect. Acting was actually quite good but the wrong portrayal of the main character is inexcusable.",
      "review_date": "2017-08-26"
    },
    {
      "review_title": null,
      "content": "It is not a bad movie, its just an average one. Light is quite bad at times, but sometimes also really decent. L's acting on the other hand is good. Yes, the pace is way too fast, they had no time to develop some story lines, but they sureIt is not a bad movie, its just an average one. Light is quite bad at times, but sometimes also really decent. L's acting on the other hand is good. Yes, the pace is way too fast, they had no time to develop some story lines, but they sure will if there is a sequel (and due to a different ending than in the anime I hope there is one). A lot of relationships are underdeveloped, the main character's dad for example had only one proper conversation with him, so there is very little depth in it to make us really understand his actions, rather than just justifying them with \"he is his father and he cares about him\" etc. But overall its a good B movie, no need for all the hate.",
      "review_date": "2017-08-26"
    },
    {
      "review_title": null,
      "content": "Death note is an adaptation of the famous manga and anime, and while its source material is way better than this movie, I found myself enjoying this cinematic outing. The script was rushed, yes, mainly in the beginning, but it wrapped upDeath note is an adaptation of the famous manga and anime, and while its source material is way better than this movie, I found myself enjoying this cinematic outing. The script was rushed, yes, mainly in the beginning, but it wrapped up pretty nicely in the end. I also thought that it was a good idea to try and update the story for western audiences, you need to try and call people's attention and I think they did that very well. Overall I liked the film, it's not perfect and I knew they would take a lot of liberties, but it was very enjoyable and the direction by Adam wingard is amazing!",
      "review_date": "2017-08-25"
    },
    {
      "review_title": null,
      "content": "Top notch super natural film. Overcomes the niche Japanese comic it was based on, translates well into a film for both Western film audiences and Asian alike.",
      "review_date": "2017-08-25"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI enjoyed it, yes the pacing was a little to fast. They jammed so much into one movie, it was a bit frustrating at times. Them changing the story up a a bit was refreshing. I am a fan of the original anime and Japanese live actions, so I know what I am talking about. The ending makes me want more, and I hope more are made. But i agree with others, it should be a series not movies, it would have more time to develop. Also stop complaining about light being white, its an american adaptation, also L was really good as well. I had low expectation for him but he was great. Dafoe is daman, not much more to be said. Also i would score higher, if they kept the potato chip scene, lol.",
      "review_date": "2017-08-25"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nótimo... foda-se se e diferente do anime.............................................................................................................................................................................................................................................",
      "review_date": "2017-08-25"
    },
    {
      "review_title": null,
      "content": "Light is not a stupid little boy motivated by love. He is a genius motivated by his pride and his delusion that he can save the world. The director, Adam Wingard, missed the entire **** point of the story!!!",
      "review_date": "2017-09-08"
    },
    {
      "review_title": null,
      "content": "Just an idiotic attempt by a lazy director. IF he truly want originality, he would not have sponge off an excellent anime of such pedigree and script his own movie. All the dumping down and changes make this into a mediocre movie that is notJust an idiotic attempt by a lazy director. IF he truly want originality, he would not have sponge off an excellent anime of such pedigree and script his own movie. All the dumping down and changes make this into a mediocre movie that is not worth even 2 mins of anyone's time.",
      "review_date": "2017-08-30"
    },
    {
      "review_title": null,
      "content": "I’ve never seen the original anime so can’t compare the two,  but based on its merits this live action movie is strong - high concept, likeable leads, satisfying narrative, engaging and definitely better than the meta score would suggest.I’ve never seen the original anime so can’t compare the two,  but based on its merits this live action movie is strong - high concept, likeable leads, satisfying narrative, engaging and definitely better than the meta score would suggest. Damn Willem Dafoe does a delicious demon! Great performance.",
      "review_date": "2020-02-08"
    },
    {
      "review_title": null,
      "content": "The production quality is high, the directing is even good, actors tried hard, but mother of god the script is awful. I have no idea how producers let such script to go into life. I have no issues with moving the action to US, I have noThe production quality is high, the directing is even good, actors tried hard, but mother of god the script is awful. I have no idea how producers let such script to go into life. I have no issues with moving the action to US, I have no problem with multiculturalism, but so many plot holes, so much material was thrown away that the movie has a feeling of superbike riding through traffic of New York! Lots of potential but pain to watch...",
      "review_date": "2017-08-27"
    },
    {
      "review_title": null,
      "content": "The only redeeming thing about this movie is Willem Dafoe as Ryuk. Everything else is trash. They ruined the source material and white washed it far too much.",
      "review_date": "2017-08-30"
    },
    {
      "review_title": null,
      "content": "There are two major things that cause Death Note to fail as an adaptation. The first of which is that everyone in it is an impulsive idiot. Did the characters have to be the super geniuses they were in the anime? No of course not but theThere are two major things that cause Death Note to fail as an adaptation. The first of which is that everyone in it is an impulsive idiot. Did the characters have to be the super geniuses they were in the anime? No of course not but the characters in this are so dumb they're essentially lobotomized versions of the originals. The second issue is despite accelerating the pacing greatly from the source material the film still is somehow unable to keep your interest. It fails in every way to be captivating because the characters motivations are under-baked and shallow. The only change that's vaguely interesting is a more diverse use of the Death Note than in the anime which allowed Adam Wingard to show off that he still can pull off gorey.",
      "review_date": "2017-09-01"
    },
    {
      "review_title": null,
      "content": "That's a total disgrace for the actual anime series. Not a single good dialogue, characters without any consistency, Light is not even bright, not to mention a criminal mastermind, and is not very into saving the world - rather impress aThat's a total disgrace for the actual anime series. Not a single good dialogue, characters without any consistency, Light is not even bright, not to mention a criminal mastermind, and is not very into saving the world - rather impress a girl. I'm giving it a 3, because Willem Dafoe was a good pick.",
      "review_date": "2017-08-27"
    },
    {
      "review_title": null,
      "content": "Rushed yet restricted, Netflix's \"Death Note\" is a terrible adaptation of the manga series. The real world implications are under-explored, the twists are rushed through, the compelling psychological battle between L and Light isRushed yet restricted, Netflix's \"Death Note\" is a terrible adaptation of the manga series. The real world implications are under-explored, the twists are rushed through, the compelling psychological battle between L and Light is non-existent, the side characters are poorly written, the cinematography looks cheap, the soundtrack is intrusive, the ending is abrupt, there are plenty of plot holes, the acting is wooden, and the list goes on.",
      "review_date": "2017-09-27"
    },
    {
      "review_title": null,
      "content": "Literally turned a master piece into hot headed teen drama. Characters was largely misrepresented, and the plot feels rushed. The producers missed the whole point of the original animation.",
      "review_date": "2017-08-26"
    },
    {
      "review_title": null,
      "content": "This is one of the worst pieces of **** I've seen in my life, it doesn't only ****s on absolutely everything the Manga and Anime created, but it also sucks as a film as well.The directing, photography, script, and acting is horrible... TheThis is one of the worst pieces of **** I've seen in my life, it doesn't only ****s on absolutely everything the Manga and Anime created, but it also sucks as a film as well.The directing, photography, script, and acting is horrible... The film uses cheap ridiculous comedy awfully mixed with extreme violence and very mediocre characters.This film is not bad, is not a poor adaptation... This film is utter **** and is the worst adaptation I've seen of an anime, even worse or equal to Dragon Ball Evolution.",
      "review_date": "2017-08-27"
    },
    {
      "review_title": null,
      "content": "First off, I want to say that I really really am rooting for Netflix to start putting out some quality movies - but I think the company is so anxious to produce something noteworthy (beyond some of their excellent tv series) that they keepFirst off, I want to say that I really really am rooting for Netflix to start putting out some quality movies - but I think the company is so anxious to produce something noteworthy (beyond some of their excellent tv series) that they keep green lighting total junk.  Secondly, I have never seen the source material that this adaptation is based on so I can't judge the content of this flick against the original.  However, this movie is simply god awful dumb all on its own.  Between the porcupine/Joker demon with a Deadpool attitude and the truly irritating candy crunching \"L\"....I couldn't find a reason to sit through the whole mess. I simply did not care what happened to the two annoying lead characters (Light and Misa) or want to find out their fate at the end of the movie.  I found them whiny and unsympathetic and provided my own \"Kira\" execution by turning the tv off. At the beginning, with a heavy nod to the Final Destination franchise with the manner the first two deaths occurred, - Death Note had remote potential to be fun.  However,  after the first 10 minutes of this confused mixture of genres that really doesn't know what it wants to be - any possibility of an interesting plot was lost.  This movie should be a hard pass for anyone who reads this review.",
      "review_date": "2017-08-25"
    },
    {
      "review_title": null,
      "content": "I just don't know what the hell the producers were thinking, I could not stand till the end, I know it is a free adaptation but ffs they took out everything that was perfect and replaced with garbage",
      "review_date": "2017-08-27"
    },
    {
      "review_title": null,
      "content": "Wow. Just. Wow. I heard this movie was bad and thought what the hell, I'll go into it like I did with Cloverfield Paradox (a really dumb movie) and just have a fun time. That worked with CP, but holy hell was Death Note a bad movie. Now IWow. Just. Wow. I heard this movie was bad and thought what the hell, I'll go into it like I did with Cloverfield Paradox (a really dumb movie) and just have a fun time. That worked with CP, but holy hell was Death Note a bad movie. Now I don't expect everything to be like the anime. There are some things from the show that would only work in an anime (such as Misa's personality and the potato chip scene), but changing Light and L the way they did was a bad choice. I'm sure a lot of people are going to get mad that they made L black. I get that, but didn't really care as L's ethnicity was never an important part of the show and the show takes place in America. The changes that did piss me off were how stupid, emotional, and irrational they made those two main characters. In the show, L and Light are brilliant and watching their cat and mouse games play out is what makes this show so much fun to watch. L is also subtitle. In the show, L eventually introduces himself to Light and even invites him into the investigation. He's smart and knows that he can get to know him better even though he only thinks it's a 5% chance that Light is Kira. There's a scene in the show where L \"interrogates\" Light by playing a game of tennis without saying hardly a word. That's the subtlety that made the show great. In the movie, L confronts Light pretty early on and tells him that he knows he's Kira. Light doesn't even deny this. They get into a shouting match and L starts knocking things off of the table.I'm going to stop myself here because I want to give my 2 cents on the movie as it stands on it's own. Without ever seeing the anime, you're still going to hate this movie. It looks like it was directed by drunk teenagers that happened to have a decent budget (though they clearly did not spend that money on good actors). It felt like there were scenes that were supposed to be in the movie, but the editors forgot to add them. For example there's this scene where Ryuk tells Light that he told him to give up the note, \"but [Light] didn't listen\". The problem with that scene is that that discussion never happened. There is a scene in the beginning where Ryuk tells Light how to get rid of the book, but in that scene he's pretty much encouraging him to use it. This happens a lot, but I don't want to spoil the movie. This movie is filled with plot holes and inconsistencies. It's frustrating to watch. Don't watch this movie even out of curiosity. It's hands down one of the worse movies I've ever seen in my life. The only redeeming quality this movie has is that William Defoe as Ryuk was **** brilliant. He nails that character so well. In fact, they handled his character pretty well. They changed a lot about him from the anime, but some of it was better for the movie. The problem is that they don't explore the character at all. The closest they get is a warning in the note that \"He's not your pet. He's not your friend. Don't trust Ryuk\". Nothing ever comes from that. The show actually doesn't obsess over the killings from the death note. Sure Light uses it, but most of the deaths are mostly heart attacks (that's how the person dies if you don't specify) and the whole show is about exploring morality, right and wrong, and who gets to makes those judgments. I thought this show was going to ditch that and just be a gory horror film. That would have been better than trying to do both. The thing that made the show so good is that it kept surprising you because the writers were intelligent and came up with things that blew you away. This show just didn't have the talent to pull that off so it's in between the two and it just doesn't work.Save yourself and avoid this movie like the plague.",
      "review_date": "2018-10-19"
    },
    {
      "review_title": null,
      "content": "This live adaptation of Death Note is considered to be one of the worst live adaptations based on a beloved anime ever made. Everything in this movie is so poorly executed that the directing, writing, and the performances actually affectedThis live adaptation of Death Note is considered to be one of the worst live adaptations based on a beloved anime ever made. Everything in this movie is so poorly executed that the directing, writing, and the performances actually affected the movie's quality. I thought that Adam Wingard can pull that off, but it seems that he has a hard time adapting it. Overall, this movie was awful. Luckily since this movie is on Netflix, we can able to watch this movie for free instead wasting our hard earned dollars seeing this atrocious adaptation of a movie at the box office.",
      "review_date": "2017-08-27"
    },
    {
      "review_title": null,
      "content": "\"I think it's very sad, actually. I only mention it, because that would make you over 18. If you were to beat me up, which I'm sure you could, it would be child abuse\".lol what?\n\nThe only good thing that came out of this disaster is people\"I think it's very sad, actually. I only mention it, because that would make you over 18. If you were to beat me up, which I'm sure you could, it would be child abuse\".lol what?The only good thing that came out of this disaster is people are now remembering how awesome the original was. Every issue I had with this film has already been said by many, so no point repeating things you heard countless times by now.",
      "review_date": "2017-09-17"
    },
    {
      "review_title": null,
      "content": "What trash. Being a big fan of the anime I was skeptical of the film to begin with but was willing to give the movie a chance. First of all why in the hell is the movie in Seattle? The characters are nothing alike the anime and thereWhat trash. Being a big fan of the anime I was skeptical of the film to begin with but was willing to give the movie a chance. First of all why in the hell is the movie in Seattle? The characters are nothing alike the anime and there personalities are all wrong and of course the white washing and L being black. I only got 45 minutes in and that's because my brother was with me and I saw enough to know. The acting is complete trash. Willem Dafoe is good as Ryuk as it's only bright spot. This movie is almost unwatchable . It seemed like they watched a 5 minute analysis video and made the movie.",
      "review_date": "2017-08-25"
    },
    {
      "review_title": null,
      "content": "I could not even get to the middle of the movie, it is really bad. They took what it is considered one of the best Animes of all the times, and delivered a horrible movie, bad actors, losing personalities, Really bad",
      "review_date": "2017-09-01"
    },
    {
      "review_title": null,
      "content": "It's one of the worst movies I've ever watched. People who made it, just wanted to earn some cash. They didn't liked source material or even understand it. Movie tries it's best to resemble manga/anime, but it do this in the worst wayIt's one of the worst movies I've ever watched. People who made it, just wanted to earn some cash. They didn't liked source material or even understand it. Movie tries it's best to resemble manga/anime, but it do this in the worst way possible:- Ryuk eats Apples, but he's an dumb **** making everything as some sort of a game. - Deathnote has rules, but different ones - new rules are stupid.- Light is shown as smarter than other kids, but it acts like a total moron.- L is eating sweats, and sits in his unusual pose, but that's it. He's a different and boring character.- FBI agents are dying by signing the list by chief, but it's totally inconsistent with the plot.There's no good thing about this movie. It's the worst HDR content on Netflix. Actually it's a plain SDR content that's in HDR container.If you liked original manga or anime, then stay away from this movie. If you haven't seen anime, then do that. This movie needs to be quickly forgotten.",
      "review_date": "2017-08-29"
    },
    {
      "review_title": null,
      "content": "the worst movie with db evolution, **** american films based in anime and videogames. Don`t waste your time watching this movie, hopefully someday adapt as deserves.",
      "review_date": "2017-08-29"
    },
    {
      "review_title": null,
      "content": "This adaptation of death note are awful, remember me a dragon ball evoluction, I dont care the color of the actors but if you Want make adaptation with the same caracteres of manga, you will try do the same personalities and actions of theThis adaptation of death note are awful, remember me a dragon ball evoluction, I dont care the color of the actors but if you Want make adaptation with the same caracteres of manga, you will try do the same personalities and actions of the caracteres at the original, if you could try something new, you cold have create another story with other characters in the same universe, in witch your original story unfolds without runing the original characters / story of the manga, White a awful adaptation and awful performances and awful script.",
      "review_date": "2017-08-25"
    },
    {
      "review_title": null,
      "content": "There’s really no reason for this movie- there’s almost nothing other than the actual note book and a death god that makes it death note. It would of been much better if they scrapped it and simply made a movie based on Death Note. Light isThere’s really no reason for this movie- there’s almost nothing other than the actual note book and a death god that makes it death note. It would of been much better if they scrapped it and simply made a movie based on Death Note. Light is completely different, Mikasa is Mia and she is completely different. It’s just not Death Note in any sense of the story. With that established on to the review. The tone is a mess. It starts out with a very “high school” tone and this diminishes the dialectic of the movie’s discussion of justice.  Then it goes over to the tone of a cheap sci-fi movie where we learn a bunch of random rules that aren’t that useful in the end.   Light gains sympathy as a character through his mistakes and his “average white kid”-ness which is quite the opposite of the Japanese Light who gains respect by being a genius. There are moments when Mia and Light are screaming in a hallway at school about the book and it is just cringe high school bull **** Ryuk looks like a 90s Power Rangers villain and is generally flat.  The best performance is and the best written character is L by far because, like the anime, he gets your respect with his thoughts and actions.  But there is huge problem with his character. Here is yet another issue the movie is entirely too emotional and does not even try to scratch your brain.  Death Note should not be about chase sequences and should not be an action movie.  It works for You’re Next and the Guest (other movies directed by Adam Wingard) but it does not work for Death Note.",
      "review_date": "2017-08-26"
    },
    {
      "review_title": null,
      "content": "This was absolutely horrible and it should have never existed, because it has ZERO ambition: this adaptation does not want money, does not want fame, does not want glory or wish posterity. It doesn't point at the public who doesn't know theThis was absolutely horrible and it should have never existed, because it has ZERO ambition: this adaptation does not want money, does not want fame, does not want glory or wish posterity. It doesn't point at the public who doesn't know the manga or the anime, and obviously it doesn't point to the fans. The only intention of this film was wasting money.",
      "review_date": "2017-08-26"
    },
    {
      "review_title": null,
      "content": "UMA BOSTA COMPLETA QUE NÃO SEGUE O MANGÁ EM MERDA NENHUMA. MAIS UMA PROVA DO QUE EU SEMPRE DIGO: LIVE ACTIONS DE ANIMES NUNCA DARÃO CERTO, SEMPRE SERÃO UMA BOSTA ASSIM COMO DRAGON BALL EVOLUTION.",
      "review_date": "2017-08-29"
    },
    {
      "review_title": null,
      "content": "Es mala, para cualquier fan del manga o anime es un insulto, no tiene ni una pequeña parte del anime y para los que no conozcan nada sobre Death Note y este fue su primer contacto con la serie, no piense ni por un minuto que la seria anime seEs mala, para cualquier fan del manga o anime es un insulto, no tiene ni una pequeña parte del anime y para los que no conozcan nada sobre Death Note y este fue su primer contacto con la serie, no piense ni por un minuto que la seria anime se parece a esta basura.",
      "review_date": "2017-09-13"
    },
    {
      "review_title": null,
      "content": "Lo peor que he visto en Netflix en mi vida... no esperaba que Netflix hiciera peliculas clase D y menos con un guion y film tan horrendos, no merece tener el nombre de la historia original.",
      "review_date": "2017-08-28"
    },
    {
      "review_title": null,
      "content": "The worst adaptation I've ever seen.We present the main character without regard to his internal conflicts and the virtues that led him to become kira, characters poorly developed and terrible performance.The morbidity presented in theThe worst adaptation I've ever seen.We present the main character without regard to his internal conflicts and the virtues that led him to become kira, characters poorly developed and terrible performance.The morbidity presented in the deaths was unnecessary.",
      "review_date": "2017-08-26"
    },
    {
      "review_title": null,
      "content": "This shouldn't be released . everything was too bad. actors .story line. and the L actor Is the worst !! even light his acting was bad and his face impression when shinigami appears .. I don't know corny scene .",
      "review_date": "2017-08-26"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nOkay, where to start with this. Take in consideration that, while I'm a fan of the original, I was expecting a revamp of sorts. At least the psychological warfare between two geniuses who held extreme points about what Justice is.This is NOT what you find here.The characters are sloppy: Light only uses the DN to get his dreamgirl and then for the **** of it. There's no debate about what's fair and who decides fate. He's not a genius, not even clever and for the most part of the movie he's manipulated by everyone until the last 10 minutes of the movie for reasons I still don't get.L, oh my God L. He's sloppy, childish and emotional. He faces the public and acts so irrational it's funny until you realize he is just another boring character.Mia/Misa is... smart. At least she tried, but she's so ready to betray Light -Just as Light, so there's that- it's infuriating.The ENTIRE PLOT hold itself on a contradiction: The rule is you must know the name and the face of someone for the DN to work, right?And Watari's real name isn't Watari. So who can explain me why the Death Note worked while using a fake name to order Watari to get L's real name if the Death Note STILL killed Watari after using the alias and not the real name?What's the point?!That makes L lose control. The pace of the movie is wonky: Guy gets book, gets girl, tries DN  on bully, kills two people, JUMP INTO THE FUTURE WHEN KIRA ROSE IN POWER, and skips for... a month? A year?And L appears.It's a terrible movie.The main conflict from the original is absent and if you are looking for something good to watch, go see the anime.Don't waste time here",
      "review_date": "2017-08-26"
    },
    {
      "review_title": null,
      "content": "I wish I had written my own name in that book because I am now going to suffer for the rest of my life with haunted memories of this film. \"L's\" **** are sweeter than the ending to this film.",
      "review_date": "2017-08-27"
    },
    {
      "review_title": null,
      "content": "The protagonist couldn't be further from the source material. In the original show, Light Yagami is depicted as a brilliant and popular student whose goal evolves to encompass ridding the world of evil. His environment encourages a GodThe protagonist couldn't be further from the source material. In the original show, Light Yagami is depicted as a brilliant and popular student whose goal evolves to encompass ridding the world of evil. His environment encourages a God Complex, and he comes to believe his vision over reality.In the Netflix version, the protagonist is Light Turner and plays on stereotypes of what a \"nerd\" is to America. His relationship with the female lead abruptly grows over the duration of a few minutes, and, boom, they're now in love despite Turner presenting himself as the most unlikable character in the show. The actor playing Light Turner genuinely sucks at the role and brings the viewer out of what is meant to be Death Note's immersive experience.Furthermore, although William Dafoe would've been perfect as Riuk, whoever designed his costume completely butchered the original look. The jump scares involving him aren't effective and fall flat to the point of being completely unnecessary. The way gore is presented leaves this Death Note feeling like a cheesy attempt to portray a story with dark themes, and the world's characters themselves act like complete morons.No. Don't watch this; watch the original version, and wait for someone to make a better adaptation that doesn't hit every trope possible.",
      "review_date": "2017-09-02"
    },
    {
      "review_title": null,
      "content": "Glorified Twilight-esque film student adaptation of a modern classic. Picture this, if you will;Light meets Ryuk for the first time in a disturbingly silent, deathly environment (imagine a vast scaled surround soundscape, like say, a vastGlorified Twilight-esque film student adaptation of a modern classic. Picture this, if you will;Light meets Ryuk for the first time in a disturbingly silent, deathly environment (imagine a vast scaled surround soundscape, like say, a vast empty train station, where one would easily be triggered by even the littlest of sounds) and feels disturbed for a minute, kind of like the main character Jack from The Shining. Now that would be a chilling opening for the playfully strange character of Ryuk to enter; \"Shall we begin?\"THAT would be a spine tinglingly interesting adaptation that would not only be as compelling as say the jump scene in 'Seven', or, say, a Joker scene, but it would also vaguely showcase a fictional demonstration of a topic as foggy and difficult to pin down as mental illness (which Light may or may not have). You just don't get that here.What a shame. I mean c'mon, we can agree that the comparison to the original material is pretty slim and just feels plain hollow. Yes, I can imagine it took a lot of time to produce the end product (lighting, music, death sequences, costume and make-up  - all of which provide an interesting, modern punk + emo style of storytelling), but let's agree that from the perspective of someone who has probably never heard of the death note franchise, their is little to nada that will captivate the general viewer. I understand that their has been a lot changed due to this been an adaptation and I am ok with some  (not all) of them.The script just lacks the beauty of anything memorable. L's character feels too hurried and isn't given enough justice to really shine and have the viewer care about him. Ryuk just flat out disappoints when compared with everything that made us grow to love him - charm, wit. You would be right in saying that he was initially scary in the manga&anime, but he later became a strangely enjoyable, comforting voice of pessimism overtime and that was done in a very deliberate way. In this, he's kind of a mess. Also the dialogue here lacks almost everything that makes the original so intriguing and thought-provoking. The scenes are too rushed and have no time to breathe.Although we all really appreciate the effort, we just can't accept this as a piece of art that could draw in new fans and I don't think I'm in the minority on this one. I still think Scott Derrickson (director of Sinister) should have taken part in this project, at least in setting up the 'suspenseful' scenes. I hate to say it but I thinkits safe to say that this is could will be referred to as a TV movie at best.3/10",
      "review_date": "2017-08-27"
    },
    {
      "review_title": null,
      "content": "I am still in disbelief that Netflix somehow made one of the best manga/anime of the 00s a wholly unwatchable insulting piece of cinematic garbage. 5000 words isn't enough to properly convey not just my disappointment in their adaptation ofI am still in disbelief that Netflix somehow made one of the best manga/anime of the 00s a wholly unwatchable insulting piece of cinematic garbage. 5000 words isn't enough to properly convey not just my disappointment in their adaptation of the narrative, plot, and characters. Netflix basically did their own thing and—like Iron Fist—it sucks.",
      "review_date": "2017-08-26"
    },
    {
      "review_title": null,
      "content": "Tão ruim quanto Dragonball Evolution, tentando pregar o estilo teen/americanizado de Hollywood, uma decepção: direção horrível, enredo ruim e cheio de erros, atuações nível amador exceção ryuk, áudio simplesmente sem sentido... umaTão ruim quanto Dragonball Evolution, tentando pregar o estilo teen/americanizado de Hollywood, uma decepção: direção horrível, enredo ruim e cheio de erros, atuações nível amador exceção ryuk, áudio simplesmente sem sentido... uma continuação disso seria um desrespeito, Netflix por favor exclua essa vergonha e comece de novo!!!",
      "review_date": "2017-08-26"
    },
    {
      "review_title": null,
      "content": "This movie is an insult to the geniality of Death Note’s original anime and manga. They changed all the story, and gave us the whitewashing as a bonus. THIS MOVIE IS A SHAME.",
      "review_date": "2017-08-26"
    },
    {
      "review_title": null,
      "content": "By even considering watching this movie you have already wasted far too much time on it. The adaption doesn't even deserve to use the name \"Death Note\". The characters have been utterly destroyed, with the exception of Keith Stanfield (whoBy even considering watching this movie you have already wasted far too much time on it. The adaption doesn't even deserve to use the name \"Death Note\". The characters have been utterly destroyed, with the exception of Keith Stanfield (who appears to be making the best he can out of a poorly written, off-brand L) the actors are utterly dreadful and downright amateur, and the source material seems to have been completely ignored beyond perhaps the uttering of \"So you write names in a notebook to kill people? Cool, let's do that. What? No I don't care about the story, let me just steal the names.\"In short, avoid this movie like the plague. It is not worth a single second of anyone's time.",
      "review_date": "2017-08-26"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nConvirtieron a Light en un cobarde e inútil que hace todo lo que le dice la novia y solo está interesado en acostarse con ella impresionándola con la libreta... Solo tomaron la idea de la libreta, cambiaron la personalidad de todos los personajes y lo convirtieron en un cliché gringo, con muertes tipo destino final. El anime tiene una temática seria e interesante, esta película fue escrita por una adolescente.",
      "review_date": "2017-08-26"
    }
  ],
  "num_reviews": 114
}