{
  "title": "Dunkirk",
  "rating": 8.3,
  "release_date": "2017-07-21",
  "genre": [
    "Action",
    "Drama",
    "History",
    "Thriller",
    "War"
  ],
  "summary": "Dunkirk opens as hundreds of thousands of British and Allied troops are surrounded by enemy forces. Trapped on the beach with their backs to the sea they face an impossible situation as the enemy closes in. [Warner Bros.]",
  "critic_reviews": [
    "Although Dunkirk is not as labyrinthine as Nolan’s “Memento” (2000) or “Inception” (2010), its strike rate upon our senses is rarely in doubt, and there is a beautiful justice in watching it end, as it has to, in flames. Land, sea, air, and, finally, fire: the elements are complete, honor is salvaged, and the men who were lost scrape home.",
    "The surpassing accomplishment of Dunkirk is to make us feel an almost literal fusion with its story. It's not so much that we've seen a splendid movie, though we have, but as if we've been taken inside a historic event, become wholly immersed in something real and alive.",
    "Seldom has a film so eloquently captured the craziness, brutality and arbitrariness of war. Dunkirk just might be Nolan’s masterpiece.",
    "Technically awe-inspiring, narratively inventive and thematically complex, Dunkirk reinvigorates its genre with a war movie that is both harrowing and smart.",
    "Dunkirk is a tour de force of cinematic craft and technique, but one that is unambiguously in the service of a sober, sincere, profoundly moral story that closes the distance between yesterday’s fights and today’s.",
    "Dunkirk isn’t comfortable to watch; it never relents or relaxes. At the same time, it’s impossible to look away from it.",
    "Nolan maintains gut-wrenching suspense throughout by cross-cutting between the various characters and their plights. I’d go so far to say that Dunkirk could easily serve as its own master class in the art of film editing. Add to that an absolutely terrifyingly discordant score from Hans Zimmer and the result is, well, a bona fide classic.",
    "In Dunkirk, an astonishing evocation of a crucial event during the first year of World War II, Christopher Nolan has created something new in the annals of war films—an intimate epic.",
    "Dunkirk is extraordinary not just because it’s ambitious and beautifully executed, but because Nolan, who both wrote and directed it, has put so much care into its emotional details—and has asked so much of, and trusted, his actors.",
    "It’s one of the best war films ever made, distinct in its look, in its approach and in the effect it has on viewers. There are movies — they are rare — that lift you out of your present circumstances and immerse you so fully in another experience that you watch in a state of jaw-dropped awe. Dunkirk is that kind of movie.",
    "Dunkirk succeeds spectacularly both emotionally and visually.",
    "By minimalizing his loftier techniques and tendencies of the past with brusque pacing and grand photography, Nolan has assembled the leanest and most impassioned film of his career.",
    "Dunkirk is a great movie, both an old-time inspirational war epic and at the same time very much a Christopher Nolan movie.",
    "Dunkirk is a landmark with the resonant force of an enduring screen classic.",
    "The director's technical mastery finally transcends craft to become art and, as a result, this is his best film to date.",
    "The swift-moving, pulse-pounding Dunkirk reveals its filmmaker at his most nimble, supple, and simple.",
    "Nolan has crafted a tight, gripping, deeply involving and unforgettable film that ranks about the best war movies of the decade.",
    "There may be money on the screen, but cash alone can’t guarantee this kind of pulsating, cinematic magic, delivered by a director at the height of his powers, mustering the very best at their craft.",
    "Nolan fully embraces the power of visual storytelling in Dunkirk.",
    "This is what audiences want from a Nolan movie, of course, as a master of the fantastic leaves his mark on historical events for the first time.",
    "Dunkirk is a staggering feat of filmmaking, as Nolan's fans are accustomed. Van Hoytema's cinematography conveys death trap closeness even with IMAX cameras on a vast beach. Hans Zimmer again proves himself a masterfully dramatic composer, turning violins into the sound of spiraling aircraft. The performances are solid as such Nolan's vision requires, including pop star Harry Styles briefly.",
    "Dunkirk is an impressionist masterpiece. These are not the first words you expect to see applied to a giant-budgeted summer entertainment made by one of the industry's most dependably commercial big-name directors. But this is a war film like few others, one that may employ a large and expensive canvas but that conveys the whole through isolated, brilliantly realized, often private moments more than via sheer spectacle, although that is here too.",
    "Haunting, thrilling and emotional, Dunkirk is a prestige pic with guts and glory that demands multiple views. Especially in IMAX.",
    "Christopher Nolan’s astonishing new film...is a work of heart-hammering intensity and grandeur that demands to be seen on the best and biggest screen within reach. But its spectacle doesn’t stop at the recreations of Second World War combat.  Like all great war films, it’s every bit as transfixing up close.",
    "A spare, propulsive, ever-intensifying combat thriller, Nolan's history lesson is both a rousing celebration of solidarity and the tensest beach-set film since Jaws.",
    "This is visceral, big-budget filmmaking that can be called Art. It’s also, hands down, the best motion picture of the year so far.",
    "This is a powerful, superbly crafted film with a story to tell, avoiding war porn in favour of something desolate and apocalyptic, a beachscape of shame, littered with soldiers zombified with defeat, a grimly male world with hardly any women on screen. It is Nolan’s best film so far.",
    "There have been countless films this summer that have engaged in endless spectacle but Dunkirk is the rare blockbuster that will leave a bruise.",
    "Few movies have so palpably conveyed the sheer isolation of fear, and the extent to which history is often made by people who are just trying to survive it — few movies have so vividly illustrated that one man can only do as much for his country as a country can do for one of its men.",
    "Great directors make great movies. And with Dunkirk, Christopher Nolan has made his second masterpiece, thrilling history retold, remembered and relished.",
    "It is hard to imagine a better tribute to this victory of survival than Nolan’s spare, stunning, extraordinarily ambitious film.",
    "It takes everything Nolan does well and everything he doesn’t, everything he fights against and everything he embraces, everything great and terrible about him, and streamlines it, focuses it, until it’s pure Nolan, straight into your veins. It’s the most Christopher Nolan film imaginable. It also might just be his best one.",
    "Nolan has crafted a film that’s sensational in every sense of the word; it aims for both the heart and the head, to be sure, but arrives there via the central nervous system.",
    "Dunkirk is a monumental, unconventional, and frequently stunning war movie.",
    "Christopher Nolan’s terrific new film, Dunkirk, is powered by an engine of combusting contradictions: it’s at once minimalist and maximalist, cynical and dopey, a big-boy white elephant art film that is actually a lean and mean suspense set-piece machine.",
    "Dunkirk wants us to sense what made this moment so pivotal without reducing it to an individual tale. And at that, it succeeds richly.",
    "Let other directors play with toy soldiers and computer effects. This is big-time, old-school filmmaking. Dunkirk isn’t overdone. It’s simply done epically...But it’s also human. It has room for small acts of heroism, of kindness, of forgiveness. And for a single, simple important, timeless message of resilience: Take what comes. Do what you can. Never surrender.",
    "Taken as a whole, Dunkirk invites comparisons to the works of Kubrick and Spielberg, but it’s neither as scalding as “Full Metal Jacket” nor as clear-eyed, as aware of war’s terrible randomness, as “Saving Private Ryan.” Instead, a streak of honest sentiment, earned under the most hellish of circumstances, courses through this movie and provides it with spine and a soul.",
    "Although Dunkirk is technically a war film, its tone and style are those of a high-octane thriller. For his most serious-minded film to date, Christopher Nolan has employed all the weapons in his arsenal to craft something that, despite the Oscar-unfriendly July release date, will almost certainly be remembered when the Best Picture nominations are handed out.",
    "Nolan fractures the narrative so that it loops back on itself — we see the events from the perspective of different characters and from different chronological vantage points, though the story coheres by movie’s end.",
    "This is a movie of vision and integrity made on an epic scale, a series of propositions dramatized with machinery, bodies, seawater and fire. It deserves to be seen and argued about. They don't make them like this anymore. Never did, really.",
    "Dunkirk is also one of the best-scored films in recent memory, and Hans Zimmer’s music plays as important a role as any character. With shades of Edward Elgar’s Enigma Variations, the melodies are glorious, yet Zimmer also creates an instrumental ticking-clock soundtrack that’s a propulsive force in the action scenes.",
    "It is engaging, it is intense, it is beautifully shot and it thrusts viewers credibly into the horrifying action from the very first frame -- and doesn't relent until the very last. This being Nolan, he also overcomplicates what is essentially a fairly simple story.",
    "The action is the attraction. If that means some of the film feels a little distant and chilly, it’s in the admirable service of avoiding simplistic drama or easy sentiment.",
    "It’s a gripping addition to the canon of war on film that is definitely worthy of attention, and some of the images are electrifying.",
    "Dunkirk satisfies as a brisk, gripping survival story. At only 107 minutes, it’s also astonishingly short in an era when most movies needlessly run on long beyond the two-hour mark.",
    "With a bare minimum of dialogue, and a brutal maximum of scenes depicting near-drowning situations in and around Dunkirk, France, in late May and early June 1940, Christopher Nolan’s Dunkirk is a unique waterboarding of a film experience.",
    "With tighter scripting, this’d be a masterpiece. As is? Christopher Nolan has produced a damn-fine picture that goes against most of what his catalog has become renowned for in a good, streamlined way.",
    "What Nolan plus IMAX can do is go big. Spitfire swerving, boat tippings, men dropping to the sand as planes scream by — it doesn’t get any better. That first shot of men on a street in a shower of paper on which their deaths are foretold — brilliant. Somewhere inside the mess that is Dunkirk is a terrific linear movie.",
    "Dunkirk would have been even better, though, if any of the characters seemed as fully realized as the aerial and naval warfare. Without that, it works best as pure sensory experience; incredible visuals, intense battles. In the rare quiet moments, we’re invited to observe an unusual instrument featured in Hans Zimmer’s score: The ticking of a clock, a reminder that while Nolan can change the march of time, his heroes cannot.",
    "Dunkirk, with its scaled-to-be-a-masterpiece visual grandiosity, aims to be an epic of the spirit, but there is something weirdly underpowered about it. It’s a series of riveting tableaux, but the human center is lacking.",
    "A constant movement unmoored from all but the present moment (however porously “present” is defined here) pushes Nolan forward as a visual stylist and suspense-crafter — lots of portent in the images of armies and crafts, plenty of faith in his actors to look concerned or outright distressed — as it stalls out Dunkirk in most other respects.",
    "In devoting so much time to the dull, counterproductive mechanics of the action assembly, Dunkirk dispenses with nearly all other elements of drama."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "I have seen a surprising amount of great blockbuster films this year but none of them has been like Dunkirk. Giving a 10/10 to Dunkirk isn't enough. It's another flawless masterpiece from Nolan and such a unique experience. Easily the bestI have seen a surprising amount of great blockbuster films this year but none of them has been like Dunkirk. Giving a 10/10 to Dunkirk isn't enough. It's another flawless masterpiece from Nolan and such a unique experience. Easily the best movie I've seen all year and among the best films I've seen that were made in the last 17 years.",
      "review_date": "2017-07-25"
    },
    {
      "review_title": null,
      "content": "Unquestionably a very good film and worth seeing, but doesn't live up to the hype. Many people knock the lack of characterization but I had no problem with that, it is plot driven and a conscious statement about the smallness of individualsUnquestionably a very good film and worth seeing, but doesn't live up to the hype. Many people knock the lack of characterization but I had no problem with that, it is plot driven and a conscious statement about the smallness of individuals in a the largest war ever fought. Starts strong with a sense of immersion in the moment but becomes needlessly complex and distant as it goes on. An IMAX war film about 400,000 soldiers trapped by the Nazis is by definition a spectacle, but it never looks like more than a few hundred people are on screen at one time, and the climactic scene has what looks like a few dozen boats. I never thought I would say this, but this movie could have benefited from some gratuitous CGI to give it a feeling of scale. Instead the IMAX screen is filled with mostly empty beach. It feels intense for a handful of people but hardly epic. Spielberg may have had the same number of extras to work with, but he put them all on the screen at the same time and conveyed the immensity of the struggle. In my opinion Spielberg is best as an action cinematographer, he could never have made Memento. But Dunkirk shows Nolan is too cold and abstract to make an epic. Dunkirk was a small film with a lot of empty space on the screen. Patton was 70mm and balanced intense small scenes with battle scenes that used the expanded screen space to purposefully convey the epic scale of war as a human activity. Dunkirk is a smart and meaningful film, but misses the mark at being something greater due to an overly complex structure that adds nothing to the experience and poor use of screen space to depict a genuinely epic event from real life modern history.",
      "review_date": "2017-07-25"
    },
    {
      "review_title": null,
      "content": "Nolan gives us a war film that works not because of characters, but by atmosphere and an incredible sound design.  You learn nothing about any of the characters here, but for what Nolan was going for it makes perfect sense.  You feel likeNolan gives us a war film that works not because of characters, but by atmosphere and an incredible sound design.  You learn nothing about any of the characters here, but for what Nolan was going for it makes perfect sense.  You feel like you're there with these men and Hans Zimmer's score is breathtaking.  Overall Dunkirk marks a familiar, yet new kind of Nolan film.  You see his finger prints all over it especially the finale, but to go with such little dialogue is foreign to him, he still nailed it.  A",
      "review_date": "2017-07-21"
    },
    {
      "review_title": null,
      "content": "It's hard to find words for just how amazing Dunkirk is. It's one of my favorite pieces of history adapted into just a phenomenal feature film. The best part about the movie, in my opinion, was the score. Mr. Zimmer you have done it countlessIt's hard to find words for just how amazing Dunkirk is. It's one of my favorite pieces of history adapted into just a phenomenal feature film. The best part about the movie, in my opinion, was the score. Mr. Zimmer you have done it countless times throughout your fabled career, and I think Dunkirk may be your best score yet. The acting was top notch. It was refreshing to see a war film from a very different perspective. This was about about survival and living to fight another day. The different perspectives of our main characters all made me feel like I was right there with them. What amazing film. Oscar for sure.",
      "review_date": "2017-07-24"
    },
    {
      "review_title": null,
      "content": "booooring movie... I really don't understand what people see so good. Confusing and simplistic plot. Shallow characters. Want a good war movie goes see until the last man, because this is a noolan hype and nothing anymore",
      "review_date": "2017-07-30"
    },
    {
      "review_title": null,
      "content": "Dunkirk is many things: it's a technical masterpiece--cinematography, sound, and its clock-ticking score; it's an intense thrill ride that feels like it is never going to stop; it's a brilliant innovation in regards to the way it tells itsDunkirk is many things: it's a technical masterpiece--cinematography, sound, and its clock-ticking score; it's an intense thrill ride that feels like it is never going to stop; it's a brilliant innovation in regards to the way it tells its story; and it's a heart-wrenching journey into the psyches of the countless troops who are trapped in war and just want to go home. Any movie would be considered great if its director did one of these things, and Nolan does them all. It's a film that requires you to think in order that you can feel.",
      "review_date": "2017-07-21"
    },
    {
      "review_title": null,
      "content": "Dunkirk is a masterpiece of cinematography, acting, writing, score and editing. This is easily one of Christopher Nolan's greatest films and one of the greatest war films of all time.",
      "review_date": "2017-07-21"
    },
    {
      "review_title": null,
      "content": "IMAX fully recommended, extremely intense movie from the beginnning till the end, the sound effect and score is masterpiece. Big applause for Nolan, 'cause he succesfully blow my mind!",
      "review_date": "2017-07-21"
    },
    {
      "review_title": null,
      "content": "Incredible film!!! I viewed it in IMAX and it took movie watching almost to a whole new level. A roller coaster ride from start to finish, I was mesmerized and choked up all at the same time. Demonstrates the horror of war as well as anyIncredible film!!! I viewed it in IMAX and it took movie watching almost to a whole new level. A roller coaster ride from start to finish, I was mesmerized and choked up all at the same time. Demonstrates the horror of war as well as any other war movie classic by putting you right in the middle of it. I see that some critics/viewers criticize the film for lack of dialog...I just think that makes it more real since everything was all happening so quickly during this event on so many levels that most involved were probably just in a state of shock. Technically everything about this film is amazing and the soundtrack took my breath away. Highly recommend this movie!",
      "review_date": "2017-07-26"
    },
    {
      "review_title": null,
      "content": "Best movie of the year! This suspenseful thriller Dunkirk, will bring some hard ware home, come award season! Best Picture, Score and Director! Thing is, Nolan never ceases to disapoint in his films, and best of all this is an intense historyBest movie of the year! This suspenseful thriller Dunkirk, will bring some hard ware home, come award season! Best Picture, Score and Director! Thing is, Nolan never ceases to disapoint in his films, and best of all this is an intense history lesson! Tom Hardy wears masks so good and the cast were all aces. This movie will have one picking up history books after you leave the theater!",
      "review_date": "2017-07-21"
    },
    {
      "review_title": null,
      "content": "Found the movie quite boring, and it was hard to follow sometimes, specifically with the pilots. Dunno how this movie is rating so well honestly. Been awhile since I found a movie so dull, I'd rather watch Wonder Woman again and that movie was meh.",
      "review_date": "2017-07-30"
    },
    {
      "review_title": null,
      "content": "I watched the movie last night and still i'm having that rare feeling when you wish the movie lasted longer...first and foremost - there is no a single CGI scene in the epic war movie ! All is real and all is breathtaking ! Next is music -I watched the movie last night and still i'm having that rare feeling when you wish the movie lasted longer...first and foremost - there is no a single CGI scene in the epic war movie ! All is real and all is breathtaking ! Next is music - that Zimmer guy simply won't miss a second to ease the grip, he pushes suspense scenes (and the whole movie is one big suspense scene) close to the edge...this movie is the best Nolan so far, there is no excuse to miss it !",
      "review_date": "2017-07-22"
    },
    {
      "review_title": null,
      "content": "Awesome movie, and very intense from the beginning until the end. Dunkirk is a well-crafted film by a great director. The story might confuse some, but it's brilliant in my opinion. The score is intense, and fits well with every scene in the movie.",
      "review_date": "2017-07-26"
    },
    {
      "review_title": null,
      "content": "Christopher Nolan has done it again with Dunkirk. So intense and pulse bounding I was shaking after I left the theater. One note it would be realistic if it was rated r with blood but it's amazing with a war movie that's all about theChristopher Nolan has done it again with Dunkirk. So intense and pulse bounding I was shaking after I left the theater. One note it would be realistic if it was rated r with blood but it's amazing with a war movie that's all about the meaning,\"War\". Nothing else. No time to talk about each character, just get into each character is wasting time, these men need to go home and escape. THIS IS A WAR MOVIE.",
      "review_date": "2017-07-25"
    },
    {
      "review_title": null,
      "content": "Great thrilling action and pulsing soundtrack. Unlike any war movie I've ever seen.See in IMAX!  I don't get the complaint that it lacks human emotion, it just presents it differently then people are used to.",
      "review_date": "2017-07-22"
    },
    {
      "review_title": null,
      "content": "Mr. Nolan has shown that details are not always elaboration, sometimes it's just a few strikes from a paintbrush of an artist that explains the whole world.",
      "review_date": "2017-07-23"
    },
    {
      "review_title": null,
      "content": "A masterpiece. Dunkirk is a thrilling, haunting picture of sound and cinematography. With little to no character development, and mostly drowned out dialogue, this movie is truly a spectacle of action, drama and at times, horror. Such anA masterpiece. Dunkirk is a thrilling, haunting picture of sound and cinematography. With little to no character development, and mostly drowned out dialogue, this movie is truly a spectacle of action, drama and at times, horror. Such an intense take on war has never been filmed before, and hasn’t had me so immersed in the cinema for many years. Christopher Nolan has once again created a film that has you drawing for breath by the end.",
      "review_date": "2017-07-21"
    },
    {
      "review_title": null,
      "content": "Pretty much every film that Christopher Nolan makes is a flat-out masterpiece as far as I'm concerned, and I'm more than happy to say that this film is no different! In fact, I think that this just may be the best war film I've ever seenPretty much every film that Christopher Nolan makes is a flat-out masterpiece as far as I'm concerned, and I'm more than happy to say that this film is no different! In fact, I think that this just may be the best war film I've ever seen (sorry to say it, but step aside 'Saving Private Ryan'). I honestly can't remember another as suspenseful or one that got my heart pounding and gave me goosebumps as much as this one did! From the very opening scene to the film's final moments, it never lets up, giving us an intense and nonstop look at the epic and historical moments and events that unfold throughout the film. The three-way narrative structure (land, sea, and air) is handled seamlessly, and the imagery/cinematography, sound, actors, etc. made this an all-around fantastic and unforgettable experience that fully immersed me in this great and historic moment in history, plain and simple! Overall, not only is this hands down the best film of the summer, but it's well on its way to maintaining its status as my favorite film all year long most likely! Mr. Nolan sir, you never cease to blow me away!",
      "review_date": "2017-07-22"
    },
    {
      "review_title": null,
      "content": "Underwhelming. For me that's the only word can describe this movie. I saw this movie with my 73 year old father in law and we both had the same reaction to this movie. We really wanted to like it. We both love great  war movies. This movieUnderwhelming. For me that's the only word can describe this movie. I saw this movie with my 73 year old father in law and we both had the same reaction to this movie. We really wanted to like it. We both love great  war movies. This movie was beautiful to watch, especially in IMAX.  The first 10 minutes or so was pretty good. After that, no real substance. No character development. Virtually no dialogue. It was so difficult to really care about any of the characters. Tom Hardy's character was pretty good, but still no depth. The timeline is a bit odd, but I didn't feel that it added anything to the movie. Nothing like Memento, my favorite Nolan movie.   The movie seemed so much longer than than the 107 minutes that it was. Pacing was awful. I have no idea how it gets so many 100 scores.",
      "review_date": "2017-08-04"
    },
    {
      "review_title": null,
      "content": "Hands down the movie of the year. Incredibly intense, powerful, and moving, and packs an amazing amount of stuff into a lean 100-minute runtime (doubly impressive considering how little dialogue there is). Massive props to Christopher NolanHands down the movie of the year. Incredibly intense, powerful, and moving, and packs an amazing amount of stuff into a lean 100-minute runtime (doubly impressive considering how little dialogue there is). Massive props to Christopher Nolan for making a WW2 movie with an authentically British cast instead of doing the obnoxious modern forced-diversity thing, and for focusing on the courage and heroism of the Brits instead of demonizing German soldiers like Spielberg did in Saving Private Ryan.For my money this is hands down the best WW2 movie I've ever seen, even better than Mel's Hacksaw Ridge last year. If there's any justice this will take Best Picture at the Oscars.",
      "review_date": "2017-07-25"
    },
    {
      "review_title": null,
      "content": "How? How is this getting the 10/10's? Four of us saw this together - age ranging from 21 to 47, and all disliked it. The first few minutes are good, but after that - what a complete bore-fest. No characters that you care about, or gravitateHow? How is this getting the 10/10's? Four of us saw this together - age ranging from 21 to 47, and all disliked it. The first few minutes are good, but after that - what a complete bore-fest. No characters that you care about, or gravitate to. No real story; 3 separate stories that are disjointedly strung together, but are worse for wear by the added time-jumps. The relentless score that literally wears you down. No blood (I'm not one for the gratuitous slo-mo violence of Hacksaw Ridge - far preferred the documentary feel of Saving Private Ryan), but no blood, when they have just been blown up by a bomb, pulled me straight out of the film.We all felt like it was 4 hours long, as the shots seemed to all look the same, repeating, over and over again. This is the first time in my life where I TRULY feel like the reviews have been bought. I reckon the studio executives watched it and thought \"How the hell is this going to appeal to a wide audience? We better buy some amazing reviews, or we'll never get our money back.\"",
      "review_date": "2017-07-22"
    },
    {
      "review_title": null,
      "content": "I pride myself on my judgement of movies and Metacritic nearly never fails me, yet it did this time. I am blown away by the \"professional\" critic reviews. It just does not make sense and I find myself sitting here wondering what is wrong withI pride myself on my judgement of movies and Metacritic nearly never fails me, yet it did this time. I am blown away by the \"professional\" critic reviews. It just does not make sense and I find myself sitting here wondering what is wrong with everyone. The other reviews below consistent question of \"was this the same movie I watched?\" ring so true. It was plain bad, and I cannot for the life of me understand why the \"critics\" thought it good. Were they paid off? Were they caught up in the Nolan hype? There were so many fallacies and inconsistencies in this movie that I do not want to cover them all, but I really felt the need to say... Please do not waste your money if you are an intelligent, analytical, deep, perceptive adult... This movie is not for you. If you are a teenage boy or someone who just needs to turn their brain off for two hours and watch stuff happen in front of them, this movie may be for you. It is not a logically executed, well written, or intellectually / emotionally stimulating movie. It is shallow, dry, and poor from start to finish. War is hell, and this movie did not have the emotional capacity or grit to show that reality.",
      "review_date": "2017-07-28"
    },
    {
      "review_title": null,
      "content": "The film creates this bleak engrossing apocalyptic world that leaves you spell bound for 100 mins.  In the end it's a film about heroism without the blood and guts of all other war movies.",
      "review_date": "2017-07-21"
    },
    {
      "review_title": null,
      "content": "Obviously I missed something here, a lot in fact.  I found this film to be boring, annoying (the highly intrusive score didn't help on that account) and, considering the potential of the material, strangely limp and lifeless.",
      "review_date": "2017-07-30"
    },
    {
      "review_title": null,
      "content": "Flyers drift into the streets dropped from above urging the Allies to surrender after they had been absolutely decimated instead many soldiers literally wiped their ass with it.*Let us begin with the way the story is shown by directorFlyers drift into the streets dropped from above urging the Allies to surrender after they had been absolutely decimated instead many soldiers literally wiped their ass with it.*Let us begin with the way the story is shown by director Christopher Nolan which is simply incredible and gives way to the imagination of what was coming for the British and French army. Dunkirk gives this eerie feel to the elephant in the room; Hitler & the axis powers who are not shown on screen but leaves any viewer with some historical knowledge aware the Germans are looming over 400,000 soldiers who nervously wait hat in hand for their fate, all Hitler has to do is snap to cease the existence of Britain as we know it on the jaws of Dunkirk. Instead of taking the typical Hollywood route Nolan focuses on the evacuation, the imagery, the sheer enormity of the task at hand and leaves towering figures such as the likes of Churchill (who recently had his own terribly inaccurate biopic told for the tenth time) as merely a mention – this is a soldier’s story, a people’s story.Hans Zimmer brings back renditions of the Dark Knight with the soundtrack piercing into your eardrums as the skies roar above with the spray of spitfire bullets hitting the Luftwaffe like rattling drums. One cannot help but feel nervous and uncomfortable with the soundtrack and in a movie depicting such a terrible event and time there is nothing more fitting.Dunkirk makes you feel as small and helpless as every soldier felt that fateful day and effortlessly avoids pitfalls nearly every war movie makes to glorify the victory while hammering home the evil of Nazi Germany which takes away from the big picture that ALL war is evil. In war sides survive, nobody wins and seeing it depicted in ways like this goes along way for showing the humanity of one side to the other – imagine propaganda films in the early 1940’s showed a little more of that! Right in the cockpit is how one feels during one of several intense Dogfight scenes as we are kept up close. Just as impressive is historical accuracy keeping inline with what occurred as the real heroes of the RAF fought off the Luftwaffe much further away from the beach to allow the evacuations to even be a possibility and we stay focused on the evacuation not the full scale war.Tom Hardy who can do no wrong lately (fresh from Taboo - go see it!) is the all-star in stellar cast who once again blends in effortlessly to the picture instead of controlling it and this movies momentum builds as every actor keeps stride. As a period piece it is important a movie looks the part and aside from the colouring of the dropped leaflets Dunkirk is absolutely on point from uniform, to locations to planes all of this attention to small details will keep the harshest historians happy.Action is directed very smartly and replaces blood and guts with that distant feel and imagination asked of the viewer again and again. Darkly mesmerising is the only way to describe in my eyes the early bombing scene as a soldier cowers on the beach as each bomb hits, bam, bam, bam, boom till a soldier disappears near him and you are left to think of the horror laying just off screen, not see it.In closing go see this movie and when your children are of age show them movies like this and let them understand what happened all these years ago. It is hard to imagine that this really was one of the major turning points of the war and has given way for you and me to be where we are right now. No one knows exactly why Hitler chose to not annihilate the British Army and hold back for three days some even believe he wanted peace with Britain but whatever occurred many sacrifices where made at Dunkirk and it is the job of every film maker and company to do these sorts of films justice (we’re all sick of Hollywood bs) and I can gladly say this certainly was a Victory.5/5 pounds*historical fact leaflets dropped made good toilet paper for soldiers something we all take for granted now ",
      "review_date": "2017-07-25"
    },
    {
      "review_title": null,
      "content": "Is this even possible for a movie to score this high nowadays because I believe Dunkirk broke the record for possibly best movie of the year if other movies being released on this year aren't as powerful or memorable as this movie right here.Is this even possible for a movie to score this high nowadays because I believe Dunkirk broke the record for possibly best movie of the year if other movies being released on this year aren't as powerful or memorable as this movie right here. No seriously, how am I supposed to find flaws in this amazingly-made movie? This remark on history is stronger and more powerful than I thought it would be.",
      "review_date": "2017-07-21"
    },
    {
      "review_title": null,
      "content": "If you want a 2-hour long extended version of its trailers, go see Dunkirk. If you have seen even one of them, you have already seen this movie. It is so dull and uninteresting that the best thing about this one is that it is not 2,5 hoursIf you want a 2-hour long extended version of its trailers, go see Dunkirk. If you have seen even one of them, you have already seen this movie. It is so dull and uninteresting that the best thing about this one is that it is not 2,5 hours like Nolan's other movies. It really fails on every level: it does not entertain (even the intended 'suspense' scenes are so cliché that they are a pain to sit through), it does not appeal to your senses (even Hans Zimmer's score is bad), it does not give you any sense of relief or achievement, nor does it paint a cruel and realistic picture about the horrors of war. If you want the story of Dunkirk, go with any of the documentaries, and forget about The Overrated Movie of the Century.",
      "review_date": "2017-07-25"
    },
    {
      "review_title": null,
      "content": "Dunkirk engages the audience from the first scene. The soldiers of the British army are being directed by their comrades to the beach at Dunkirk. Thousands of soldiers are lining up with great dignity to patiently await their rescue.Dunkirk engages the audience from the first scene. The soldiers of the British army are being directed by their comrades to the beach at Dunkirk. Thousands of soldiers are lining up with great dignity to patiently await their rescue. Churchill has requisitioned civilian boats to pick them up.So, you ask with great anxiety about the result of the herculean effort to rescue and deliver the soldiers to Britain, did Harry Styles survive to the end of the movie? My answer is: go and see. The visual display,  the persistent and exciting percussion of the musical score, the booming zooms of the aircraft, bombs, gun fire, and other sounds of war immediately brought me to the beach at Dunkirk while my gut rumbled and vibrated in my seat. I became a soldier on that beach, a Spitfire pilot, and an officer of the Royal British Army. I felt excitement, desperation, patience, forgiveness, sacrifice, empathy, the thrill of the rescue effort, and the possible consequential joy of being able to go home. This movie is an artistically delivered rendition of what it means to be a soldier, a sailor, and an officer. Will you be rescued? Will the support of the Royal Air Force be enough to get you off that beach and back into your family kitchen at home? I urge you to experience what I felt in watching Dunkirk. It's a movie that dramatically emphasizes the importance of persistence, strategy, and humanity in the war against impossibility. Ten fingers.﻿",
      "review_date": "2017-07-25"
    },
    {
      "review_title": null,
      "content": "Nolan's best movie, a crazy and incredibly tense ride through one of the turning point of WWII, put together in an almost silent way (very few dialogue in this movie)Incredible movie, incredible soundtrack as well",
      "review_date": "2017-07-21"
    },
    {
      "review_title": null,
      "content": "While visually impressive, I found Dunkirk to be a mix of boredom and confusion. There is three different timelines that converge which only makes it confusing, and does not add weight to any of the scenes. It's difficult to tell any of theWhile visually impressive, I found Dunkirk to be a mix of boredom and confusion. There is three different timelines that converge which only makes it confusing, and does not add weight to any of the scenes. It's difficult to tell any of the characters apart, especially with very limited dialog. I'm not sure people love this movie so much, it's a pretty forgettable war movie.",
      "review_date": "2017-07-23"
    },
    {
      "review_title": null,
      "content": "This is an experience like no other. Powerful imagery and emotional symbolism made one almost weep, because the scope of this war-epic is phenomenally crafted. It’s a dark film for sure, but it serves as a glimpse of light over and over, withThis is an experience like no other. Powerful imagery and emotional symbolism made one almost weep, because the scope of this war-epic is phenomenally crafted. It’s a dark film for sure, but it serves as a glimpse of light over and over, with a forever returning theme of truthfulness to humanity. This, combined with the realism and empathetic feel to the setting that C Nolan masterfully has achieved – will make even the dullest being emotional.Dunkirk is very different from Nolan’s previous achievements, mainly due to the very lack of character inside through dialogs. But, amazingly, we can still relate and understand their thinking through the surreal events and clever filmmaking. The scope is real. You feel the seriousness. You feel trapped, just like the young soldiers. This is done almost without any dialogs. The silence between the characters says it all. The ones that stand out from the pack of men are Commander Bolton, Mr. Dawson and Tommy; this is where most of the focus lies and where we get most character depth. The non-linear structure helped with this, it almost trapped the audience in a loop with different perspectives on the event of Dunkirk. And the whole movie is all about the event, not the specific characters. You feel like you’re in it so you care for the situation and the characters, even though you might not remember their names fully. All of this is very rare and not often seen on film. It really works in the film’s favor, and yes even more inside to characters could never hurt a film like this one. But this isn’t a flaw in this film. To relate to characters in this extent with so little talking – is an Oscar-worthy achievement.To follow these characters in Dunkirk is an exhausting and adrenaline-packed experience with realistic action that you will not question. The realism is stunningly shaped. It might be one of my most surreal film experiences ever. Hans Zimmer’s score boosted the experience by tenfold, it got this “ticking” feel to it, almost like a heart beating faster and faster throughout the film – Zimmer is a propulsive force that never stops to amaze. The camerawork is just as stunning; you fly like an aircraft and feel the full gravity of the situation! It’s a smooth, stylish and artistic direction from C Nolan and ‘Interstellar’ cinematographer Hoyte Van Hoytema.Some minor flaws do exist. The action is at a few places very identical as to what already has been seen in previous scenes, so it took the “wow-feel” down a bit. Some individuals will without any doubt attack the “too realistic” WW2 feel, because it’s not bold enough for them. But to create this movie isn’t about being bold. It’s about creating something real. And it is, very!It’s an epic experience filled with realism but also small acts of heroism, kindness and forgiveness. Dunkirk is as action-packed as ‘Mad Max: Fury Road’, and stunningly realistic as ‘Saving Private Ryan’ but with a bigger slam to it. It reveals the true nature of war, the men behind it and what the bigger picture of it can be.Dunkirk is a visual and emotional experience that will take the gasp out of you. Period.Personal rating: 92/100 Critical rating: 96/100",
      "review_date": "2017-07-21"
    },
    {
      "review_title": null,
      "content": "Christopher Nolan has surpassed himself with what I can almost say is a masterpiece. Even with its little dialogue, I found myself captivated from the time the movie started till the credits rolled. With the visuals, acting, and raw realism,Christopher Nolan has surpassed himself with what I can almost say is a masterpiece. Even with its little dialogue, I found myself captivated from the time the movie started till the credits rolled. With the visuals, acting, and raw realism, 'Dunkirk' may be one of the best, if not the best, film of 2017.",
      "review_date": "2017-07-21"
    },
    {
      "review_title": null,
      "content": "\"Dunkirk\" earns the title of \"masterpiece\". It's a masterclass in suspense, a history lesson, and an inspiring story of heroism all rolled into one perfect package. See it on the biggest screen possible.",
      "review_date": "2017-07-21"
    },
    {
      "review_title": null,
      "content": "Even worse than expected.  There was no doubt the jackass critics herd perennially on auto pilot would laud praise upon a noble little known true war story put on screen by a massively over-rated pompous director because they all sensed itEven worse than expected.  There was no doubt the jackass critics herd perennially on auto pilot would laud praise upon a noble little known true war story put on screen by a massively over-rated pompous director because they all sensed it must be important purely based on the subject and pedigree.  They in their utter dishonesty and phony pretentious lack of any shred of integrity assume in order to be perceived as serious and smart must heap praise on something like this.  Venture to say, no matter what Christopher Nolan came out with the praise would be the same near unanimous nonsense it is.  They didn't see the actual movie.  They only saw the pretense.  For the last time:  subject matter is not primarily what you are reviewing idiots, the way it is executed is.Here's why it's not only not the great movie they exclaim, but a pretty bad movie!  There is no plot nor any character development, and there is no true suspense precisely because of this!  You can't be on the edge of your seat no matter what the action on screen if you are not invested in the characters.  This is an uninspired, stodgy, overly reverent trudge through a historic event with no invention working to transform such into a movie.  Hollywood movies are supposed to entertain.  Hey, that goes for whatever the content and no matter the tone.  If you want a dry history lesson on the event, go read a text book or watch a documentary (and nearly any fathomable documentary on this battle would be more interesting).Just imagine had James Cameron's \"Titanic\" not invented the fictional core love story and characters both modern day and past for that story in favor of pure, straight documented, totally accurate depiction of the historic event?  It would not resonate as the epic Hollywood classic it became in short time.  And it's not as though they blew off the historical accuracy which was painstakingly recreated in nearly every detail.  It's that Cameron understands what movies should be for the audience, not just himself.  The characters here are puppets whether real or imagined.  The spare acting caught on screen is devoid of performance which while realistic is dull and it's not the cast's fault.  There's no script!  Kenneth Branagh tries, but sorry a watery eye in one close up and looking up for a few seconds in alarm of coming doom is not all there is to acting.  If it is, then anyone can do the job on cue and to effect as professional actors must do.  Worse still, like his last lame pretentious effort \"Interstellar\", the sound mix is AWFUL again!  The freaking dialogue is mixed too low to the sound effects and even more so to the music!  It's bad enough these actors have mumbled hard to understand heavily accented deliveries, but to then self indulgently attempt to be more \"real\" by making the decision to compromise intelligibility is just plain asinine.  It's unprofessional.  It's downright incompetent!  Music is artificial to begin with, so his illogical argument last time about being more real to life experience is again just a fallacy here!The staged big screen aerial dog fight footage is how this movie initially seemed to showcase itself in advertising and is about the only worthy of attention aspect of the entire production.  So a few real flying shots of vintage WWII fighter planes from some unique angles with unnoticeable not overdone CGI is worth sitting bored out of your mind for two hours?  Ah, no.A-lister Nolan is a moviemaker who cares about the audience and the entertainment value he is delivering, but he is gravely mistaken in his efforts.  No question he is highly intelligent, creative in general, a scholar of cinema history, and understands all the technical mechanics of filmmaking as well or better than anyone.  What he is not is an artist who delivers genuine emotion.  That's what great movies and great art in general is truly about.  Nolan is a very cerebral writer/director not unlike say Kubrick who also fell short on emotion in all his work.  However, Kubrick was such a genius and brilliant designer of mind bending psychological exploration that the lack of emotion in his art is acceptable as the canvases are overflowing with inspiration as it is just on an intellectual and aesthetic level.  Nolan is only a pale imitation of that (though granted a better poser than say PT Anderson, another retro junkie also falling for old gimmicks of the medium over good storytelling).  The truth is he hasn't made any great films, only a few good ones, and the rest are all pretentious mediocre bores.  The only good thing about this thing is that surprisingly it is not overlong as is the stupid trend.  That's because the story is thin to begin with and padded out for running time.  If you must still go see it, go digital.  The film prints are literally half the resolution and quickly damaged by today's uncaring theaters!  Mr. Nolan the luddite is delusional in his denial of reality.  Passé tech 70mm is a hoax now!",
      "review_date": "2017-07-31"
    },
    {
      "review_title": null,
      "content": "Dunkirk is a viceral masterpiece. The lack of character development and narrative is essential for inferencing the sheer scale of the situation. This isn't a story about individuals... this is a story about a narrowly avoided catastrophicDunkirk is a viceral masterpiece. The lack of character development and narrative is essential for inferencing the sheer scale of the situation. This isn't a story about individuals... this is a story about a narrowly avoided catastrophic military disaster. It is the chronology that is pure genius, although we should be accustomed to that with Christopher Nolan's work - and the music & sound design is awesome; barrages of deafening gunfire and plane fly-overs are followed almost immediately by near-silent expanses of hopelessness. Has to be seen in IMAX to be fully appreciated.",
      "review_date": "2017-07-24"
    },
    {
      "review_title": null,
      "content": "Do war movies need to have a script ?.......YES. Do war movies have to have characters ?......Yes again.....\"Dunkirk\" has neither script nor characters and as a result you rapidly lose interest in what becomes of any of the individuals weDo war movies need to have a script ?.......YES. Do war movies have to have characters ?......Yes again.....\"Dunkirk\" has neither script nor characters and as a result you rapidly lose interest in what becomes of any of the individuals we encounter because you never bond with them. In fact after a while they just seem very unlucky in their various attempts to get away!) This is a very cold film about an amazing event. Nolan seems far more interested in showing what bungled mess the Dunkirk experience was. He depicts the whole thing as futile, messy and basically more ANNOYING than anything else i.e., what a bunch of Losers! The result is a sort of yuppie take on WW2. And a rather desperate tossing in of Churchill's \"We shall never surrender\" speech in the final moments of the film doesn't make up for this film's fatal wrongheaded approach to its subject.",
      "review_date": "2017-07-29"
    },
    {
      "review_title": null,
      "content": "I've never given a movie such a low score but I have to this time to help lower the ridiculous overall score. While I appreciate this movie not going over the top, it just doesn't suck me into the story like other war movies. There is zeroI've never given a movie such a low score but I have to this time to help lower the ridiculous overall score. While I appreciate this movie not going over the top, it just doesn't suck me into the story like other war movies. There is zero blood. It shows a guy getting bombed and he remains in one piece. The score was good but all it did was make everyone anxious. I know Zimmer wanted to create a sense of urgency since the film is about an evacuation but even the most simple, boring things, the music is going off the rails trying to rise up some suspense. It WILL drive you nuts. Take the music out of this movie and there's probably 20 minutes or less of dialogue and you're left with the most boring movie ever. I could give it a 5 but honestly I would never watch this twice. I don't know a single name of any of the characters. There's zero development once so ever so why give a crap about any of them. You can barely understand them also. Hacksaw Ridge was too Hollywood and too over the top but at least it was entertaining. This movie's only positive notes is the bone-chilling sound of German fighters about to dive bomb the soldiers. Nolan isn't a bad director but he's a terrible story teller. All of his movies are vague and confusing.",
      "review_date": "2017-07-22"
    },
    {
      "review_title": null,
      "content": "Nothing of substance. A tremendous waste of time and money. I am beyond flabbergasted on how the \"Nolan\" fanboys can defend such a mess of a movie. Pretentious af.",
      "review_date": "2017-07-23"
    },
    {
      "review_title": null,
      "content": "Probably one of the worst movies I've seen. The only thing stopping me from walking out was hope that it would get better - it didn't.I am dumbfounded how this even gets remotely close to an 9.0/10 average here and imdb. (Botted votes?Probably one of the worst movies I've seen. The only thing stopping me from walking out was hope that it would get better - it didn't.I am dumbfounded how this even gets remotely close to an 9.0/10 average here and imdb. (Botted votes? Bribery?) Firstly the plot is empty, bland, boring, uneventful - I could go on all day...The character development is abysmal - non-existent. You feel detached the whole film except for the first minute (which are excellent bar the annoying background title text) and then it goes straight off the cliff into the dump. I was excited and enthralled expecting an amazingly engaging film - boy was I WRONG.Even watching Tom hardy blast away with his 10% accuracy is uninspiringly dull.The only good points are 'decent' cinematography(the best of which being the colours and contrasts which i actually enjoyed in some brief scenes), good sound effects, soundtrack is nice but overused and repetitive.In essence the film over-utilises cinematography and sound to form it's basis while leaving the lacklustre story and characters to support it instead of the opposite i.e developing a strong plot line and delving into the depth and breadth of characters while letting the cinematography and sound support them.Don't waste your time or money on this cash grab. 2/10 AT BEST!",
      "review_date": "2017-07-21"
    },
    {
      "review_title": null,
      "content": "It is a good movie, but it could have been so much more. First off, roughly 900 vessels were involved in the Dunkirk evacuation and about 10 are shown. I understand not wanting to use excessive CGI, but it really detracts from what should beIt is a good movie, but it could have been so much more. First off, roughly 900 vessels were involved in the Dunkirk evacuation and about 10 are shown. I understand not wanting to use excessive CGI, but it really detracts from what should be a turning point in the film. Numbers like 400,000 men are bandied about in the film, but all of 500 men are actually shown, even from a distance. Furthermore, Nolan sacrifices character depth and any kind of backstory - even going so far as to have most of the characters pretty much nameless - in order to showcase his artistic vision. The upshot is that I found it difficult to emotionally invest in any of the characters. Whilst his gritty portrayal is beautiful and it has its moving moments, of which the opening scene is particularly memorable, in general the film fails to capture the scale of Dunkirk and at the same time manages to underwhelm in character development. It isn't a bad film, but it is often boring and what really sucks is the squandered potential it had.",
      "review_date": "2017-07-22"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nit is the best movie of this sdecade and to the comment of numcrun 2 , rex reed is only jealous, nothing else, you know if you are so intelligent, then you have to be a director, ( and i suppose, that your movie would have a a rating of 10(metacritic-critics rating) and would have no content contrary to this movie, which is the next Platoon, Apocalpyse Now, Full metal jacket of our generation. If you would have read Joseph Conrad's book, you would no longer write such comments(as also the other jealous guys here).",
      "review_date": "2017-07-21"
    },
    {
      "review_title": null,
      "content": "Are there 2 different versions of this movie? The movie that all the \"experts\" are raving about is not the one I saw. Have they all lost a bet to Christopher Nolan or is there blackmail involved? What showed at my theater was not much moreAre there 2 different versions of this movie? The movie that all the \"experts\" are raving about is not the one I saw. Have they all lost a bet to Christopher Nolan or is there blackmail involved? What showed at my theater was not much more than a glorified movie of the week. There is almost no dialogue, and what little there is is drowned out by the soundtrack which tells us it's not important in the first place. There is no plot, no character development, no acting, confusing characters, and time jerks from dead of night to simultaneous broad daylight. There is no audience connection or identification with the characters or situation. Granted, this is a critical episode in a World War, but the movie is filmed as \"a day in the life.\" The \"experts\" claim the acting is fabulous, but there is no acting. Tom Hardy sits in the cramped cockpit of a plane with his face covered by a mask the entire time. 400,000 soldiers are stranded on the beach, and we see maybe 500. There is supposed to be a massive rescue flotilla and we see maybe 12 boats. The \"experts\" describe the movie as \"avant garde\" and a \"masterpiece\". What I saw was \"meh\". Although I found it difficult at times to watch, \"Saving Private Ryan\" was a war movie with intensity, plot, and characters. \"Dunkirk\" doesn't come close. And what is \"The Mole?\"",
      "review_date": "2017-07-21"
    },
    {
      "review_title": null,
      "content": "After many reviews I was looking forward to seeing the film but came out feeling rather dissapointed. It was dull, uninspiring and had no tension that really grabs and pulls you towards the film with further interest. I felt so detached fromAfter many reviews I was looking forward to seeing the film but came out feeling rather dissapointed. It was dull, uninspiring and had no tension that really grabs and pulls you towards the film with further interest. I felt so detached from the film, I don't know where the good reviews are coming from, are we talking about the same movie here?The big actors in this film dissapoint because there is hardly any acting. Tom Hardy sits in a cockpit for the entire film (everyone could do that) and can't hit a barndoor with a machine gun, I can only see 2 eyes and a forehead.. At the end his plane runs out of fuel, hovers in the air but he seems to fly on forever. Cillian Murphy mumbles and walks around on a tugboat from time to time. There is no character development or interesting dialogue that makes you feel involved/connected and caring about the troops and their misery. Hardly any signs of fatigue, broken nerves/ shattered spirits and wounded men (except for a few men on stretchers). These scenes do not make me think that I wouldn't like to be in someone's shoes being stuck on a beach, not knowing what's coming next. The possibility of death/ becoming a prisoner or saved by a rescue operation, seeing so many struggles on a beach you can't imagine how you will get picked up..The beach in the film is very(!) clean (with some dead soldiers that's really impressive) and there seems to be no sign of chaos, fatigue, fear or despair. There is absolutely no equipment scattered over the beach that looks close to a scrapyard, no trash, discarded gear and no abandoned vehicles etc. About 3 to 400.000 soldiers were saved but I saw 500-750 in the film (they all looked the same btw, hair and face), also I saw 10 to 15 boats TOPS. More than 900 boats took part in this operation over the course of 9 days and that's a fact. The smaller boats were used to carry men off the beach and put them on bigger steamers/boats, didn't see that. This film could have improved significantly with an extra 30 minutes at the beginning of the film. Brief fighting/retreating around Dunkirk showing the peril, discussions in Churchill's HQ about the situation in France and trying to save the troops against staggering odds. Such dialogue could have made it gripping, showing wht was at stake in that part of the war. Show me how everyone in England came together with everything they had that could float, trying to save the troops. Tom Hardy would be better placed trying to hold off the Germans and surrender at the end when he knows many troops are saved. In real life many thousands and injured who could not be saved were sacrificed and stayed behind In to keep the Germans away. A dejected Murphy waits on a beach to be rescued, that role could have suited him. The dogfights were rather dull.I was confused because of the jarring cuts in time and the shift (too fast) between the 3 characters.  I can't believe some positive reviews here \"intense\", \"great acting\", \"best war film\" Someone even commented they couldn't find flaws, in the first 5 minutes by looking at the housing in the background and the tiling, didn't look like 1940. Look at the background when they filmed the beach from the sea, modern housing and lights, streetlamps, shipping containers and crains.Can't understand why Christopher Nolan couldn't just make a straightforward, linnear warfilm that tells a gripping (true)story without all this fancy colouring and artistic filming. I went to see this film for it's story and not for the way it was filmed, coloured or making many switches from one time to another. It doesn't focus on anything in particular except for rescue.I wish these (expert) reviewers watched some documentary's like the world at war that really grips you and then watch the film again. Heck, even look on google for Dunkirk equipment and such. Steven Spielberg should have made this as Nolan would film Saving private Ryan with no casualties and no dialogue.  Wouldn't want to see the film again.",
      "review_date": "2017-07-22"
    },
    {
      "review_title": null,
      "content": "The IMAX version, at least, is fully endorsed by the International Earplug Association. If you don't have tinnitus before you see this overrated disaster movie, you will when you walk out. Abusively, gratuitously loud, with a soundtrackThe IMAX version, at least, is fully endorsed by the International Earplug Association. If you don't have tinnitus before you see this overrated disaster movie, you will when you walk out. Abusively, gratuitously loud, with a soundtrack designed to loosen your internal organs from your skeletal frame. I might have liked this movie but I couldn't tell; it's impossible to appreciate anything else about Dunkirk when your fillings are being vibrated out of your teeth. I suppose the point was to bludgeon me into knowing that war is hell, but somehow Spielberg managed to convey this with considerably more weight without causing me actual physical pain. Overwhelming the senses is apparently the film industry's way of creating a unique theatrical experience. If so, it's inducing me to the opposite: perhaps if I'd waited to watch at home with some control over my viewing experience I'd have appreciated it more.",
      "review_date": "2017-07-22"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nTerrible script, unsympathetic characters, confusing plot sequences and corny story lines. Silliest bit is when soldiers try to stop their boat sinking by covering up the bullet holes with their hands; they only abandon ship when the hull is completely inundated with water. This is just completely ridiculous. Everything gets blown up around the central characters, who get out of a lot of narrow scrapes in a series of  sinking ships (I lost count in the end). They survive intact and unscathed, barring their blackened faces - a bit like Wile E Coyote in the Road Runner cartoons. The flotilla coming to the rescue looked like it was a handful of boats, so one of the most remarkable incidents of the war, the rescue of the British Expeditionary Force from the Nazis, comes across as an anti-climax. Trawler segment with Mark Rylance could have come straight out of the send-up in the recent comedy Their Finest (a much better film). I can only assume that the director has spent so much time making dumb action movies based on comic books he's completely lost his touch when it comes to creating engaging characters and plausible stories. There wasn't much of a script and the little dialogue was hard to make out. No wonder (spoiler alert) nobody spotted the French soldier earlier - as hardly anyone was saying anything! I'm not a scholar but the film seemed to overdo conflict between Brits and French, overlooking the fact that (according to Wikipedia), 139,000 French troops were evacuated from Dunkirk. I'd be interested in reading a historian's perspective.",
      "review_date": "2017-07-30"
    },
    {
      "review_title": null,
      "content": "The film is nothing more than a DVD release story line.  Very poor showing for something that was hyped by \"professional\" reviews.  If you are expecting an epic war movie (which i believe the true story line could show) then you will beThe film is nothing more than a DVD release story line.  Very poor showing for something that was hyped by \"professional\" reviews.  If you are expecting an epic war movie (which i believe the true story line could show) then you will be disappointed.  Some big name actors do not perform, largely down to the poor directing.  Save yourself the cinema ticket.",
      "review_date": "2017-07-21"
    },
    {
      "review_title": null,
      "content": "I'm sorry, this movie was a piece of crap. There's no story, barely any dialogue, no character development, but it does have big AUDIO SCORE THAT BLASTS SO LOUD YOUR WANT TO SCREAM. There were apprx 25 people at the showing I just saw here inI'm sorry, this movie was a piece of crap. There's no story, barely any dialogue, no character development, but it does have big AUDIO SCORE THAT BLASTS SO LOUD YOUR WANT TO SCREAM. There were apprx 25 people at the showing I just saw here in Los Angeles and over the course of the 90 mins... 4 people WALKED OUT.",
      "review_date": "2017-07-22"
    },
    {
      "review_title": null,
      "content": "Here's a short guide how to win an academy award: Step 1) Make a movie about the second World War (because nobody ever had *that* idea) Step 2) ???, Step 3: Profit.",
      "review_date": "2017-07-23"
    },
    {
      "review_title": null,
      "content": "After reading the reviews, I had high expectations for this film, but in the end was completely underwhelmed. It wasn't bad, but certainly not as good as what I had expected.  Overall, I found the fractured way the story was told, dialogueAfter reading the reviews, I had high expectations for this film, but in the end was completely underwhelmed. It wasn't bad, but certainly not as good as what I had expected.  Overall, I found the fractured way the story was told, dialogue that I couldn't always decipher and an on-going struggle (this was probably just me) to figure out who was who (many of the characters were similar looking to me) took away from my overall enjoyment of this film.",
      "review_date": "2017-07-21"
    },
    {
      "review_title": null,
      "content": "Don't believe the hype. I saw it in Imax and a lot of the dialogue was indecipherable (Rex Reed makes the same point). There is surprisingly little dialogue and a lot of unnecessary time shifting. There are some decent action scenes sure, butDon't believe the hype. I saw it in Imax and a lot of the dialogue was indecipherable (Rex Reed makes the same point). There is surprisingly little dialogue and a lot of unnecessary time shifting. There are some decent action scenes sure, but the plot is a bit thin (yes I know it's a true story) and it's just OK overall. Rex Reed's review very closely matched my own views.",
      "review_date": "2017-07-21"
    },
    {
      "review_title": null,
      "content": "This is a film about Nolan, but not about war. Operator work and sound are very good, but the story is very boring, and the characters are not interesting.Dunkirk is the worst film of Nolan. Better once again review the \"Saving Private Ryan\"",
      "review_date": "2017-07-21"
    },
    {
      "review_title": null,
      "content": "Like if the history channel had an unlimited budget to make a historical recreation.  There are no characters - the people are just scenery.  There's not much story or plot.  It's epic and beautifully shot, but I genuinely feel it's beingLike if the history channel had an unlimited budget to make a historical recreation.  There are no characters - the people are just scenery.  There's not much story or plot.  It's epic and beautifully shot, but I genuinely feel it's being overrated.  As a film, it's sort of dull.  As a historical recreation, it's solid.",
      "review_date": "2017-07-21"
    },
    {
      "review_title": null,
      "content": "WORST movie Nolan has made wtf happened. Repeating the same event from different angles over and over. Annoying. Bad.",
      "review_date": "2022-10-04"
    },
    {
      "review_title": null,
      "content": "Great survival (war) film with amazing cinematography. There is no denying how tense the film is and the amount of practical effects that went with it. However, I dont think this is Nolan's best work nor ranks as one of the best war films. IGreat survival (war) film with amazing cinematography. There is no denying how tense the film is and the amount of practical effects that went with it. However, I dont think this is Nolan's best work nor ranks as one of the best war films. I agree with most people that the story is rather bland and doesn't quite work because the scale is shrunk to a minature size. What most people seem to overlook is that the evacuation occurred over 5 days, with most soldiers saved actually by the actualy navy, but the creative choice in this film does not seem to capture this enough, instead spends more time on characters that at the end serve really little and I dont think you will necessarily get much following them at all - I rather Nolan just spent the entire film looking at different people in the process.",
      "review_date": "2017-08-18"
    },
    {
      "review_title": null,
      "content": "Dunkirk is a good movie which produced by the top notches.But it uses the cheapest trick to raise heartbeat, increase the feeling of suspension and tension in its audience; it is nothing but using a repetitive pulsive sound which is a lotDunkirk is a good movie which produced by the top notches.But it uses the cheapest trick to raise heartbeat, increase the feeling of suspension and tension in its audience; it is nothing but using a repetitive pulsive sound which is a lot like heartbeats. It runs through the whole movie long without any stop except when it turns to a clock ticking sound on some occasions or stops for some seconds in the train cabin to make you feel it's safe now.After the movie, you might feel exhausted or hyped and I think that's why.",
      "review_date": "2018-10-10"
    },
    {
      "review_title": null,
      "content": "My most anticipated movie of the year, and man, it did not disappoint. Dunkirk is Christopher Nolan at his best. This is a bleak, gripping, and exciting war movie that kept me glued to my seat for the entire runtime. Harry Styles,My most anticipated movie of the year, and man, it did not disappoint. Dunkirk is Christopher Nolan at his best. This is a bleak, gripping, and exciting war movie that kept me glued to my seat for the entire runtime. Harry Styles, surprisingly is fantastic in this movie. A lot of people were worried when he was casted into the role, but as the eyes of the audience, he works incredibly well. The rest of the ensemble are great as well; Tom Hardy and Mark Rylance being the two standouts, but nobody lags in this. While Styles is first in the cast listing, there's no main character per se, rather it's about all of the Allied who fought for their lives. There is very little dialogue in this movie; the plot advances by subtle visual and audio cues, the timing of the shots, and the brilliant score done once again by Hans Zimmer. On top of nailing the atmosphere of a barren war zone, Dunkirk's action is on point. It's not as exciting as Saving Private Ryan or Glory, but it still offers the same emotional impact as the two. Your heart will drop when you hear the machine gun of an enemy plane in the distance. My only real issue with this movie is, while the character of the Allied is engaging, and I cared enough about each of them, their characters aren't interesting on their own. All they have is personalities, and that's it; no backstory, no intrigue. But as I said, Dunkirk is about the troops as a group, so I could easily overlook this. Overall, Dunkirk is an exceptional entry in Nolan's filmography.  Exciting, engaging, and edge-of-your-seat suspenseful, it's the best war film of the modern era, and one of the best of the year so far.Dunkirk gets a 10/10",
      "review_date": "2017-10-17"
    },
    {
      "review_title": null,
      "content": "----------------------------------7.3/10-----------------------------------",
      "review_date": "2021-12-30"
    },
    {
      "review_title": null,
      "content": "This is a great movie, and all its fails make up for its beautiful perspectives. The different people show the different perspective and jobs during the war. Even the actors do a perfect job of portraying the people who they are. However,This is a great movie, and all its fails make up for its beautiful perspectives. The different people show the different perspective and jobs during the war. Even the actors do a perfect job of portraying the people who they are. However, even though it may be confusing at first, Dunkirk really does win one of the best movies this year.",
      "review_date": "2017-11-27"
    },
    {
      "review_title": null,
      "content": "A true masterpiece by Christopher Nolan, the best movie of the year so far and easily one of the best movies I've ever seen. Visualizing the horror of war without actually showing it. A truly awesome must see movie.",
      "review_date": "2017-08-15"
    },
    {
      "review_title": null,
      "content": "The movie was good. But it does not live up to the hype. They will tell you that it was shot with IMAX cameras and what not. But it doesn't really look stunning on the IMAX screen. Besides that, the audio reproduced very well the sounds oneThe movie was good. But it does not live up to the hype. They will tell you that it was shot with IMAX cameras and what not. But it doesn't really look stunning on the IMAX screen. Besides that, the audio reproduced very well the sounds one hears in a war quite well. That unfortunately does not work very well, when you want to hear and understand what people are saying. I was able to understand what was going on for the most part, even though I missed a good part of what people were saying. It was too loud and just not worth the money - I was hoping to see some good cinematography.",
      "review_date": "2017-07-30"
    },
    {
      "review_title": null,
      "content": "I have no comments to make about this movie, I just want to use the 75 character minimum limit for reviews.",
      "review_date": "2018-01-23"
    },
    {
      "review_title": null,
      "content": "Excellent movie. Everything it wants to do it executes it perfectly! The tension created by the music is enormous. The multiple point of view technique contributes to enhance the spectator experience. I got very emotional at the end,Excellent movie. Everything it wants to do it executes it perfectly! The tension created by the music is enormous. The multiple point of view technique contributes to enhance the spectator experience. I got very emotional at the end, specially with the Spitfire ode reaching its peak.Excellent music, minimalist dialogues, direction, photography and ability to transmite the fear and pesimism of the dunkirk english troops. Just perfect.",
      "review_date": "2017-08-02"
    },
    {
      "review_title": null,
      "content": "One of the most dramatic episodes of WW2 narrated masterfully, with a relentless rhythm that narrates exciting battles from air, land and sea; supported by a outstanding photofraphy, and an overwhelming, dynamic score composed by Hans Zimmer.One of the most dramatic episodes of WW2 narrated masterfully, with a relentless rhythm that narrates exciting battles from air, land and sea; supported by a outstanding photofraphy, and an overwhelming, dynamic score composed by Hans Zimmer. One of best war movies of ever. Rush.",
      "review_date": "2017-08-01"
    },
    {
      "review_title": null,
      "content": "I usually don't like the director Christopher Nolan, his films are very long and dark, plus go on in repetitive themes to show how flashy and smart he is. I was looking forward to Dunkirk, because it would be an interesting turn of his filmsI usually don't like the director Christopher Nolan, his films are very long and dark, plus go on in repetitive themes to show how flashy and smart he is. I was looking forward to Dunkirk, because it would be an interesting turn of his films and would give him acclaim. I feel that this was partially for Oscar bait, but who cares when you have a film like this. It's so intense and realistic, because it follows the feeling of the British soldiers themselves, not everyone in the war, but the events really happening. We don't need to know about what the Germans looked like, the characters reactions and actions to prevent the attacks and to save their own lives really shows what war is like. Many people don't appreciate the sophistication in this film, for Nolan has included a realistic amount of violence and a smart way to play with time. Very impressed how he jumped from the silly Interstellar to an accurate portrayal of Dunkirk. Beautifully shot, and don't listen to the haters about the film itself or about the history. Great movie.",
      "review_date": "2017-08-05"
    },
    {
      "review_title": null,
      "content": "A wonderfully visceral masterpiece of visual storytelling, told with complete, relenting intensity. The sound design work in particular is masterful - it's loud, fear-inducing and probably louder than the battle itself was.",
      "review_date": "2017-11-18"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nIts fantastic. A complete masterpiece, which makes you feel tense, and static, and nervous, making you want to see more and more,and to see more things about the story and the characters, which are fantastic! from a bunch of soldiers in a beach, to a soldier in an airplane defending innocent peoplle, it manages to keep you entertained for 1 hour and 46 minutes. Plus, mentioning the ending is crucial, as the scene in which Tom Hardy gets off his plane, burns it, and just stands there, waiting for his fate, it is just such a powerful scene, that makes you feel like watching a Dark Night film. In summary, Christopher Nolan is a master, definitley every film he makes is destined to greatness, but it still continues to surprise us. This film is amazing, it doesnt bores you for a second, and until it ends, you feel greatness itself growing through your body, and the way the three stories combine is just magical! With a great cast of actors (Tom Hardy, Mark Rylance, Kenneth Branagh...) that make the experience even better, Dunkirk, makes up a great set for the big screen. \"10 / 10\".",
      "review_date": "2017-08-01"
    },
    {
      "review_title": null,
      "content": "A heart pounding movie made possible by Hanz Zimmer's tense background score and Nolan's tight script. The movie perfectly conveys the claustrophobic atmosphere of the story.",
      "review_date": "2017-08-04"
    },
    {
      "review_title": null,
      "content": "Dunkirk is a WWII film about the drama of Operation Dynamo. But it is actually a film about wartime courage, and even more importantly, it is about wartime fear. Not just average fear, but the kind of fear that shocks every nerve in theDunkirk is a WWII film about the drama of Operation Dynamo. But it is actually a film about wartime courage, and even more importantly, it is about wartime fear. Not just average fear, but the kind of fear that shocks every nerve in the system and threatens to cancel out reality, replacing normalcy with an absurd void; the kind of fear that comes dive bombing out of the sky with a screaming terror that can deafen the ears and jar the soul.The stars of this film are unknown actors, in keeping with the notion of the unknown soldier, the anonymous young men who were fed like fodder into a faceless, wartime death machine. They are young men with nondescript features, strangely bearing a resemblance to each other, as if they were all related to each other—brothers, sons, and cousins—all facing a grim reaper who cares nothing for their hopes, dreams, and aspirations, and who robs them of their individuality as well as their future. The movie casting does not draw attention to the fact that smaller, supporting roles are filled with big-time names. As you watch the film, a certain familiarity starts to clue you in. Is that Kenneth Branagh? Benedict Cumberbatch? Tom Hardy? Mark Rylance? They are hiding under officers' naval uniforms and aviation gear. They do not want to steal the spotlight from the cast that is playing the most important role in the film—the anonymous soldier on the beach who falls into a crumpled-up heap every time the German dive bombers make another sweep across the sky. This is the eternal essence of war—horror, desperation, hopelessness, and death.Mark Rylance is the quiet, bland, and unassuming Mr. Dawson, one of the civilians who has in May of 1940  answered a frantic call from prime minister Winston Churchill. Hundreds of thousands of Allied soldiers are stranded on the French shore of Dunkirk, surrounded by the Germans, and they are close but yet so far from the White Cliffs of Dover and home. Churchill has ordered the requisitioning of small fishing boats, launches, pleasure craft and yachts to make the treacherous journey across the English Channel and take on as many soldiers as they can possibly fit in their modest vessels. (Many of the boats were requisitioned by the British Navy and were manned by experienced personnel; some were helmed by the private owners.) These vessels could navigate the shallow waters that the large military warships could not. The small boats, known as the Little Ships of Dunkirk, comprised about 850 private boats that sailed from Ramsgate, England to Dunkirk. Mr. Dawson, a private civilian, is among them, and the bravery of this and other insignificant sea captains like him is fiercely heroic and yet strangely unremarkable. The private citizens who volunteered are just average people doing what they have to do. Mr. Dawson has nerves of steel, and he is determined and uncannily courageous; nothing can force him to turn back. Although this is not intended to be a feel-good movie, the epic sight of hundreds of watercraft emerging from the mists of the sea to effectively rescue 338,000 men trapped on a WWII beach is nothing less than cinematic history. Director Christopher Nolan has made a WWII movie like no other.",
      "review_date": "2017-09-04"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nFrom the opening scene until the end there is a sense of excitement and uncertainty of what will come next. This is orchestrated through fantastic writing and cinematography by Christopher Nolan, and the amazing score of powerful bass notes and a constant ticking of a watch that was gifted from Nolan to the genius composer Hans Zimmer. An amazing job was done to leave audiences on the edge of their seat, creating a sense of uncertainty of what was going to happen next. This was done through the score and direction, but ultimately the film's performers are what stole the show, especially Hardy who gives one of his greatest performances even when you are only able to see his eyes for the majority of it. One of Nolan's best and I highly recommend it to everyone who is in to the genre, and into amazing climactic stories!",
      "review_date": "2017-08-06"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nHonestly, when I first left the movie theater after watching Dunkirk, I thought it was not really a great movie, especially not from somebody like Christopher Nolan. Over the course of a night of good sleep and one not-too-busy day with a lot of thinking, I've changed my mind. Although I still don't consider it his best movie - not even his second- or third-best one - I do see the \"Nolan-touch\" in it, which is always a good thing. Let me explain.The most important point to eventually change my mind was how great of a war movie Dunkirk is. Not a movie, a war movie. I like that the main Characters didn't get introduced too much, nor got a big background story. Over time, they don't develop like you would expect from a typical modern movie. They just happen to be the 'chosen ones' for the movie, among 400,000 other men with just the same fate. I feel like this gives the whole war setting a much more authentic and believable touch to it, because nobody speaks of 'heroes'. They're all just soldiers. Another thing I enjoyed were the intersections of some of the sub-plots. The parallel events created a sense of unity in the main plot which brings me to a side of the movie that I didn't like. The idea of having three sub-plots happening over three different time periods is good, but the way it is introduced isn't. The only hint we get as to how long each sub-plot plays out and where it begins and ends is right at the beginning of the movie, when there are three shots, introducing the perspectives air, land and sea. In each shot, a time period is stated. One week for land, one day for the sea and one hour for the air. The only plot that has a nice pace throughout the movie is the sea. I found myself being most fascinated by the sea plot and caring the most about it. Partly also because it was the easiest to follow. While the land part happened much too quickly for the risky endeavor it really was, the air-part repeated itself 4 times with the same dogfight-scene, thus got pretty boring (and unrealistic, given the authenticity of the rest of the film) towards the end. It took me pretty long to figure out that the time-periods in the beginning indicated how long each of the three plots lasted in real life. That, combined with the three plots being shown literally parallel makes for a pretty confusing experience at times. Although Nolan has repeatedly proven to be the master of confusion in earlier movies, this time it didn't quite work for him. On the other hand, so many things did work. The scene towards the end, where the boat we follow in the \"sea\" part reveals to be one of hundreds coming to rescue the soldiers worked great. The cinematography, the sometimes dark, sometimes turquoise look of the film combined with the mind blowing sound belongs to the best audio visual cinema experiences I've ever witnessed. And most of all, the mood of war, the hopeless brutality and endeavor, the sheer insanity of that scenario works exceptionally well. What can I say, Chris Nolan just knows how to make a great movie.Over all, it's a mixed bag. The ideas Nolan put into the movie are great and show his talent as a filmmaker, but the way he ended up realizing them doesn't quite make for an entertaining movie. I see this movie as one that you truly enjoy the second time you watch it, because the first time you're busy figuring out what happens where and especially when. It's not the typical war-movie. It's not a typical movie at all. You have to in the mood for a movie that has more in common with a documentary than with a hollywood movie, but at the same time wants to be a hollywood movie (and is one, regarding sound ans visuals). Maybe it's just the wrong genre for a director like Nolan.",
      "review_date": "2017-07-28"
    },
    {
      "review_title": null,
      "content": "A graphic depiction of how war affects the lives of many who are thrown into the mix. Filming scenes were excellent & had the audience captivated. Well worth seeing !",
      "review_date": "2017-08-05"
    },
    {
      "review_title": null,
      "content": "In a summer (like others) filled with nothing  but pointless sequels and remakes (with exceptions), Cristopher Nolan (the wonderous mind of Inception and TDK Trilogy) is back to the directing chair with Dunkirk,a war movie that not onlyIn a summer (like others) filled with nothing  but pointless sequels and remakes (with exceptions), Cristopher Nolan (the wonderous mind of Inception and TDK Trilogy) is back to the directing chair with Dunkirk,a war movie that not only stands out as the best Nolan movie in a long time,but that also stands out as THE movie we needed this year. This may seem like another typical war movie with only action sequences and that's it. Dunkirk,on another hand,is not that war movie you'd expect nowadays. The story was for the most part non-stop war,with no moments where they stop to a scene that will 'calm down' the movie for a bit (ok,maybe it happens 1 or 2 times...),since most of the movie was surprisingly enjoyable,if not also intense and heart-beating at the same time. Even the music (composed once again,masterfully,by Hans Zimmer) makes the movie a non-stop living nightmare.A big orchestra gets reunion with the electronic instruments that will make you not sleep for the rest of the year (especially Supermarine,the best track out of the 'bunch'). I was also impressed by how this movie was filmed,since we don't have Wally Pfister as the Director of Photography. Same goes to the Vis...Practical Effects of the movie,sine everything in the movie was practical,from boats to planes and from water to explosions. It also paid off very well as a first time watching a movie in IMAX 70mm,since it felt as a realistic experience in that auditorium,with a BOATload of Sound Effects surrounding you everywhere (i almost had a heart attack while a gunshot came out of nowwhere). The acting was surprisingly superb. I didn't expect to like Harry Styles (?!?) as one of the main characters,while Tom Hardy is,as always,your typical Hardy in a mask. In the end,with beautiful imagery,a tense and heart-pounding story,superb acting,and a score that could be one of Zimmer's best,Dunkirk is THE DEFINITIVE Summer movie we all needed (while at the same time standing out as Nolan's best movie,if not also,of this year)",
      "review_date": "2017-09-01"
    },
    {
      "review_title": null,
      "content": "There is great beauty in the film and Nolan successfully avoids the sloppy romanticizing of war usually present in war films. But something was missing. While the film's mission seemed to focus on the individual dramas being played out in aThere is great beauty in the film and Nolan successfully avoids the sloppy romanticizing of war usually present in war films. But something was missing. While the film's mission seemed to focus on the individual dramas being played out in a commendable effort to personalize the horror of war, the evacuation itself was badly represented. One would think from viewing the film that there were a few arial dog fights and few ships sunk but otherwise an orderly evacuation. It was not. There were thousands of sorties and 16 squadrons of the Royal Air-force engaged in Operation Dynamo. The French were fiercely fighting a regard action to hold off the advancing German divisions. The sheer desperation and scale of the calamity never reaches the audience. The result a good movie with the potential to be  great movie is lost.",
      "review_date": "2017-07-28"
    },
    {
      "review_title": null,
      "content": "Very promising at the beginning but rapid sequence shifts take away any story flow and becomes tiresome. The scope of the actual Dunkirk evacuation is lost. Nevertheless, it was entertaining but could have been more.Do not see it in IMAX, theVery promising at the beginning but rapid sequence shifts take away any story flow and becomes tiresome. The scope of the actual Dunkirk evacuation is lost. Nevertheless, it was entertaining but could have been more.Do not see it in IMAX, the sound level is excessive.",
      "review_date": "2017-07-30"
    },
    {
      "review_title": null,
      "content": "Best IMAX experience so far. It's definitely one of my favorite movies this year. For a movie that has a short runtime, it packs so much stuff in it. The lack of character development and dialogue might bring in some hate but I think theBest IMAX experience so far. It's definitely one of my favorite movies this year. For a movie that has a short runtime, it packs so much stuff in it. The lack of character development and dialogue might bring in some hate but I think the film's main intention is not about the character's background. The film focuses more on the situation, and the direction with the story is absolutely brilliant in my opinion. Dunkirk is well-crafted, visually stunning, and intense.",
      "review_date": "2017-07-27"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nPotte makes this movie great.Dunkirk is a great and amazing war movie.Nolan has an amazingly realistic painting of the evacuation of Confederate soldiers along with the best air dogfights ever released. From the pilot level, three time frames, and foretelling their own novels to the reality of the Allied evacuation of June 1940, this amazing technical ability is an entertainment that stops the heart. This is Nolan's best film to date, a stunning and thrilling masterpiece, and a great return to film.",
      "review_date": "2017-07-23"
    },
    {
      "review_title": null,
      "content": "How is it possible for critics to sit through a film and not question what they are seeing that makes zero sense. Wearing a life jacket in water will keep one from sinking. Not according to Christopher Nolan . We see ,as did critics ,hundredsHow is it possible for critics to sit through a film and not question what they are seeing that makes zero sense. Wearing a life jacket in water will keep one from sinking. Not according to Christopher Nolan . We see ,as did critics ,hundreds of soldiers under water wearing life vests. That in of its self is an impossibility. There were also scenes that went fron day to night,back to day. This happened more times to count.Why do people feel the need to agree with todays critics instead of THINKING for themselves.",
      "review_date": "2017-12-26"
    },
    {
      "review_title": null,
      "content": "so boring.no story. no character. if it was for another director i vote 6 but for nolan it was awful. mr nolan, i suggest you to watch your previous movies again so you understand why this one disappoints us.differences always cant be good.so boring.no story. no character. if it was for another director i vote 6 but for nolan it was awful. mr nolan, i suggest you to watch your previous movies again so you understand why this one disappoints us.differences always cant be good.at least not in this one.",
      "review_date": "2018-03-11"
    },
    {
      "review_title": null,
      "content": "I think Dunkirk might be the most intense film this year, and definitely Nolan's most intense work. The sound design is incredible, and the cinematography is beautiful and striking. When you go in to see this movie, don't expect it to be likeI think Dunkirk might be the most intense film this year, and definitely Nolan's most intense work. The sound design is incredible, and the cinematography is beautiful and striking. When you go in to see this movie, don't expect it to be like Saving Private Ryan because that film focuses on the brutality of war. Dunkirk focuses more on survival and desperation. Dunkirk is very different compared to other war movies in my opinion. This film will be a strong contender for the Oscars. Probably for Best Picture and Best Sound Mixing.",
      "review_date": "2017-07-23"
    },
    {
      "review_title": null,
      "content": "This movie is kickass. It does an incredible job in its first opening minutes introducing you to what you are about to experience and then doesn't let up till the closing act. Relentless is the word. And Harrowing. A gorgeous piece ofThis movie is kickass. It does an incredible job in its first opening minutes introducing you to what you are about to experience and then doesn't let up till the closing act. Relentless is the word. And Harrowing. A gorgeous piece of cinematic craftsmanship with clever Nolan-esque editing to boot.",
      "review_date": "2017-07-22"
    },
    {
      "review_title": null,
      "content": "This is possibly the best \"war\" movie I have ever seen in my life. This isn't an some stupid Hollywood action movie. This is a movie about sacrifice, the horrors of war, and how people react to it. It's not preachy or in your face with someThis is possibly the best \"war\" movie I have ever seen in my life. This isn't an some stupid Hollywood action movie. This is a movie about sacrifice, the horrors of war, and how people react to it. It's not preachy or in your face with some political message. It's just a story about several men and their experience around Dunkirk. Amazing film.",
      "review_date": "2017-07-22"
    },
    {
      "review_title": null,
      "content": "Beautiful movie, the visuals, the sounds, the story, everything keeps you on the edge of your seat from beginning to end. Tom hardy's acting in the movie was amazing, even though you only see his eyes most of the times and he has very fewBeautiful movie, the visuals, the sounds, the story, everything keeps you on the edge of your seat from beginning to end. Tom hardy's acting in the movie was amazing, even though you only see his eyes most of the times and he has very few lines, you can feel the intensity of his situation.",
      "review_date": "2017-07-26"
    },
    {
      "review_title": null,
      "content": "In this tenth feature-length film from director Christopher Nolan, this particular filmgoer is delivered one of the most complicated theatre-going endeavors I've had the pleasure of experiencing in recent memory. For, what I believed startedIn this tenth feature-length film from director Christopher Nolan, this particular filmgoer is delivered one of the most complicated theatre-going endeavors I've had the pleasure of experiencing in recent memory. For, what I believed started out as a seemingly by-the-numbers triptych of wartime survival that any other director could have just as easily produced, quickly and mesmerizingly contorted itself into something much more unique. Much more unconventional. Much more Nolan-esque. I won't spoil what the moment/technique is, but, boy, did this element prove me wrong and completely negate all ill feelings I had towards the first half-hour or so. Indeed, once \"Dunkirk\" shows its truly genius hand, it really takes off. From here on in, the movie becomes infinitely more interesting, immeasurably more fun to watch, and eons more rewarding than most other films one will see in the current motion picture market. This masterstroke technique -- which, again, I can't spoil here because of how simply masterful it really is -- is a testament to how intelligent Nolan treats his audience and, in that, he once again proves himself as one of the most valuable filmmakers in the game. This technique, amongst many others, (such as the beautiful performances, images, effects, and score work from Hans Zimmer) ultimately renders \"Dunkirk\" into the strong rebuke that it is. A rebuke levied against the bow of the belief that war movies are simply \"old hat,\" \"tired,\" or \"been there, done that.\" \"Hold my Earl Grey,\" says Nolan. And by God did he let us have it with this gem. I laughed, I choked up, I gasped, and I smiled from ear to ear many, many times. Truly, a cinematic experience worth seeing (in any theater, but -- honestly -- see it in a big, loud, cutting edge one) and one that I simply will not forget. Ever.",
      "review_date": "2017-07-23"
    },
    {
      "review_title": null,
      "content": "\"Home.\"You can love, hate or call him overrated all you want, but you've got to give respect to Christopher Nolan for going this old school. Nothing like cardboard props for background soldiers, inspired by the silence films era with little\"Home.\"You can love, hate or call him overrated all you want, but you've got to give respect to Christopher Nolan for going this old school. Nothing like cardboard props for background soldiers, inspired by the silence films era with little dialogue, and going full practical. The attention to details with scope and intensity making the overall experience harsh, but masterfully well made. Nolan has made something extraordinary and proven why he's the best living film maker working today. All of his movies have this grand scale to it, but never feels hollow.  Watching \"Dunkirk\" on the IMAX screen was such a overwhelming and frightening experience, but perfectly captures the terror of war those men faced. It got me pretty emotional towards the end. Gunshots sound like actual gunshots and the sound of bomber planes are like something out of a horror film. Every bullet that whizzed by made everyone in the cinema flinch (including me). It's one of the best movies I've seen so far this year. I would go as far to say it's the best war film in recent years & Nolan filmography.My ears are still ringing from it, as I couldn't hear all that well after it ended.The cinematography, the sound, writing, and direction are on so many levels of amazing. With Han Zimmer score being his best work yet. Being both phenomenal and hunting, leaving me cold at times. It's no surprise all the tense parts are through Hans score who puts weight to these difficult moments in the movie. And it's only the sound of a ticking watch. I've found new respect for Harry Styles after this. Because he actually delivered a pretty good performance. Very impressive since it's he's first role and had a lot of screen time than I expected. Same thing with Fionn Whitehead, who's plays another young solider was also fantastic. The rest of the cast like: Tom Hardy, Mark Rylance, Kenneth Branagh, and Cillian Murphy were all terrific. Not a weak performance in the movie.   Now people have been complaining about the lack of information with these characters or no real main character to feel for them. I really don't think these people understand that isn't the point of the film. You understand these characters just by actions and decisions. All of this is based on how they act in a situation. No corny or cliché dialogue. It's visual story telling at it's finest. No has time talk about their back story or how they need to get back home to their wife and kids. The time is ticking, the enemy is getting closer, and your stuck with complete strangers on foreign land. The film doesn't have protagonist and antagonist.You never see the Germans in person, just bomber planes. It makes they presence more scary and tense every time another attack happens.  Overall Rating: Please do yourself a favor and see this in IMAX. It really adds to the experience.",
      "review_date": "2017-07-26"
    },
    {
      "review_title": null,
      "content": "It was definitely worth watching in IMAX. Don't miss out on the IMAX experience, because this movie is really intense so watching it in the big screen is a must. I think some people just don't get the main intention of this film. The movie isIt was definitely worth watching in IMAX. Don't miss out on the IMAX experience, because this movie is really intense so watching it in the big screen is a must. I think some people just don't get the main intention of this film. The movie is about the situation,the lack of dialogue is not needed because the film wants you to get that immersive feeling. Visually, I think it's Nolan's best looking film right next to Interstellar thanks to the beautiful cinematography. The sound design is just amazing, and the soundtrack is great as well. I really like what Nolan did with the story which consists of three settings..the land, the sea, and the air. Some thought it was confusing, but I thought it was brilliant and well executed in the end.",
      "review_date": "2017-07-26"
    },
    {
      "review_title": null,
      "content": "Definitely deserving of praise, a realistic and sombre portrayal of war that I feel most accurately captures the mood, it knows when to go all out and when to stop thus giving a simplistic yet harrowing portrayal. Although you don't know muchDefinitely deserving of praise, a realistic and sombre portrayal of war that I feel most accurately captures the mood, it knows when to go all out and when to stop thus giving a simplistic yet harrowing portrayal. Although you don't know much about the characters backstories after following them on screen for a short while I already began rooting for them, impeccably acted even on his debut Harry Styles did a great job.Despite not being character driven some of the events are very emotional and there were a few moments where I was on the verge of tears and others where people in the cinema audibly spoke out in reaction to the events.The film was beautifully shot, it looked so real but the sound was amazing, every bullet, every shell dropping made me move closer to the edge of my seat, my heart was racing from start to finish thanks to Nolan's masterful use of tension which was aided by Hans Zimmer's powerful score. The metronomic ticking sound does not let up. One think I must say is that this film is more of a cinematic experience than a film, part of the magic will be lost on home viewings unless one has a great sound system.10/10 is the least this deserves, it was deeply patriotic yet showed the dark sides of war and how men can turn on each other. Almost every aspect of this film seemed carefully crafted and intentional. Also in some of the scenes the camera work makes this feel as though the viewer themselves is a character in the events which is impressive how a 2D film is more immersive than any 3D film I've ever seen. An audiovisual treat and a real attack on the senses, brilliant.",
      "review_date": "2017-07-22"
    },
    {
      "review_title": null,
      "content": "Didn't feel that there was any emotional weight and scale to this major WW2 event. For example when the soldier boy died the father didn't show any emotion and I never care at all about the boy. The characters or soldiers, since I don'tDidn't feel that there was any emotional weight and scale to this major WW2 event. For example when the soldier boy died the father didn't show any emotion and I never care at all about the boy. The characters or soldiers, since I don't remember anything about them, were never given enough time throughout the movie to make us care about them. I also think that there was never time throughout the movie to let us breath for a minute with all the tension and action that's happening because with all of whats going on the beach there was never a time where we never got a scene to where there was character development. However there was some good things about the movie. The movie is gorgeous to look at. The action is good and Nolan does do a good job of making you feel that your right on the beach but in my opinion its not enough to make it a great movie. If I don't care about the characters then why should I feel anything when they are finally home. Apparently according to rotten tomatoes and metacritic I was suppose to really like this movie, but for a story this big of a scale there must be some emotional weight to it in order to make it huge and epic. Overall, Dunkirk was kind of a disappointment and coming from Christopher Nolan I'm a little shock. 6/10",
      "review_date": "2017-07-30"
    },
    {
      "review_title": null,
      "content": "Masterpiece in all his nature, Nolan did it again, a beautiful and shocking film, if there are bad reviews, don't listen, there's always paid media or just haters.",
      "review_date": "2017-07-21"
    },
    {
      "review_title": null,
      "content": "Dunkirk is an incredible and authentic war film about the true story of 400,000 allied soldiers being trapped on the beaches of Northern France, surrounded by the powerful German army. As time runs out and the Germans slowly approach, theDunkirk is an incredible and authentic war film about the true story of 400,000 allied soldiers being trapped on the beaches of Northern France, surrounded by the powerful German army. As time runs out and the Germans slowly approach, the allied soldiers come closer to their fate. However what makes the story so great is the miracle that occurs shortly after; when innocent British civilians voluntarily boat over to the beaches rescuing the allied soldiers. In the end they were able to rescue over 300,000 men, making it one of the most miraculous and important moments in human history.Going into the movie you will most likely already have a basic idea of what happened. What is more important about Dunkirk is how the film uses cinematography, music, characters, and so on to interpret what actually happened. And I can confidently say that the movie executes all these elements masterfully. I had the privilege of seeing Dunkirk in true IMAX 70mm film, a first for me. It was one of the best experiences I have ever had at the cinema. My favourite moment was the opening shot; it goes from blackness to completely filling up that massive screen with crystal clear image quality. I was immediately blown away by that opening shot of the allied soldiers walking down the street. The amazing sound punched in when the first few gun shots fired off; so loud and lifelike they startled me as if I were actually there. The entire movie was shot on film and over 70 percent was done on IMAX cameras. It fits the movie perfectly as the large picture size compliments the spectacle of the beach and ocean environments. If there is one movie you should see in true IMAX 70mm film, it is this one.Christopher Nolan has done an immaculate job with depicting the war and turning it into a cinematic experience. He chose not to use blood and gore; but rather focuses on elements such as time running out, fear, and claustrophobia to emphasize how terrible the war was. This gives his film a unique tone, making it stand out when compared to other WW2 films. The cinematography is gorgeous; a lot of tracking and closeup shots are used to make you feel like you are in the horrific events with the soldiers. Specifically during boat sinking scenes; when soldiers are drowning the camera will go underwater with them and make the viewer become disoriented much like the characters are. Hans Zimmer's score is simple yet effective, using a ticking clock to emphasize that time is running out. And the other tones he uses help to effectively add to the tension of each scene. The film is also primarily shot on the exact same beach where the real events took place. Many of the original boats and planes from the war were also used for filming. And to avoid using a lot of CGI, cardboard cut outs of soldiers were used to give the illusion of a massive army on the beaches. Christopher Nolan made the movie as real as it could be, and it definitely pays off when you finally sit down to watch it. There is never one point in the movie where you will doubt its authenticity.The characters of the film take a back seat to the war, as that is what it is really about. However I still found myself quite invested in the main character's journeys throughout the movie. The movie has a unique element to it, as it actually tells 3 stories in 1; a week long story on the beaches, a day long story on the ocean, and an hour long story in the air. Each story focuses on a few key characters and we get to see how they all collide with each other at the end of the movie. So while the war itself is the main point of the movie, you will still find yourself rooting for specific characters as they are all interesting and relatable. In my opinion, Dunkirk is a masterpiece. It is a great reminder of the brave men that fought for our freedom in the war, and is a fantastic cinematic experience.",
      "review_date": "2017-07-21"
    },
    {
      "review_title": null,
      "content": "This is a masterpiece? Although the movie looks great, everything else just falls apart. I found the subplot with Rylance and Murphy to be bizarre, and does nothing for the movie. The soldiers are mostly faceless and devoid of any characterThis is a masterpiece? Although the movie looks great, everything else just falls apart. I found the subplot with Rylance and Murphy to be bizarre, and does nothing for the movie. The soldiers are mostly faceless and devoid of any character or humanity. I would like to compare this movie with 'Saving Private Ryan', but there is no comparison. 'SPR' is engaging from start to finish but this movie doesn't grab the audience at all!",
      "review_date": "2017-08-15"
    },
    {
      "review_title": null,
      "content": "I believe this film to be the greatest piece of cinema of all time. If you wish to experience,as close as is possible without being there, what battle actually feels like then I recommend you go and see this epic film. Gung-ho, it is not.I believe this film to be the greatest piece of cinema of all time. If you wish to experience,as close as is possible without being there, what battle actually feels like then I recommend you go and see this epic film. Gung-ho, it is not. Heart wrenching, it is not. Hero worship, it is not. Sensationalised blood and gore, it is not... True bravery and fear, it most definitely IS... Realistic, no other film comes close. If I had to sum it up in one word it would have to be  \"Intense\"......Europe has the audacity to be demanding Billions of pounds for the UK to leave the EU.  Show this film to those people in Brussels and it may make them stop and realise what a debt they ALL owe to Great Britain for the sacrifices it made in both wars in order to liberate the continent of Europe.",
      "review_date": "2017-07-22"
    },
    {
      "review_title": null,
      "content": "I can't understand why so many people liked this movie.  While the production values were good, they seemed to have forgotten things like a plot and character development, and maybe a little enlightening dialog.  It was very uninvolving andI can't understand why so many people liked this movie.  While the production values were good, they seemed to have forgotten things like a plot and character development, and maybe a little enlightening dialog.  It was very uninvolving and ultimately quite dull.",
      "review_date": "2018-01-27"
    },
    {
      "review_title": null,
      "content": "Way over hyped, dunkirk is a slow-paced war movie with very few intense moments. It doesn't worth the time you spend on it and that's the starting point for me for any movie. Many other war films give a better idea of what war world 2 was.",
      "review_date": "2021-04-04"
    },
    {
      "review_title": null,
      "content": "Dunkirk, Nolan's latest entry in his expansive filmography, is as powerful and important as one would expect. The story - 400,000 men stranded on the beaches of the city, with the Nazi's slowly pushing in and surrounding - makes for anDunkirk, Nolan's latest entry in his expansive filmography, is as powerful and important as one would expect. The story - 400,000 men stranded on the beaches of the city, with the Nazi's slowly pushing in and surrounding - makes for an incredibly tense thrill ride. The entire film feels like a ticking time-bomb, ready to burst in a shower of flames and death at any moment. The characters - all of whom we learn nothing about - are, surprisingly, very interesting. You automatically feel for each and every one of them, and the thought of \"lack of characterization\" never comes to mind. The realistic, gripping action rivals that of Saving Private Ryan and Band of Brothers, Hans Zimmer's score is unbelievably effective, the cinematography is breathtaking, and the direction is flawless. Dunkirk is not just a film, but an experience, and one that every history buff - and Nolan fan - must see.",
      "review_date": "2017-07-26"
    },
    {
      "review_title": null,
      "content": "Dunkirk, more like Dung-Crap! This movie looked and sounded great in I-Max. That's the end of the good. Now to the bad. This movie had no characters. I felt zero emotional connection to anyone in this movie. I didn't care if anyone lived orDunkirk, more like Dung-Crap! This movie looked and sounded great in I-Max. That's the end of the good. Now to the bad. This movie had no characters. I felt zero emotional connection to anyone in this movie. I didn't care if anyone lived or died. Mark Rylance's character was the only one who was halfway interesting. He was the only character who had a decent amount of dialogue in the film, who had a clear goal, and who made decisions. The other character that had more than 5 lines in the picture was Kenneth Branagh's. He was utterly pointless. It seemed like he was watching the movie, and his purpose was just to say a cheesy lines about \"Home\" every once in a while. Tom Hardy's character was boring, repetitive, and predictable. This movie is so messed up, it is really hard to decide who the main character is, but if I had to decide, it'd be the guy we see 1st. He is very forgettable. He looks and acts almost identical to almost everyone in the whole movie. He meets a friend while he is taking a dump. No joke. He stops and helps his new friend bury a body. And he doesn't poop the whole movie. Him and his new friend just try to escape the whole movie. That leads me to my second point: there is no plot. It's just a bunch of explosions. There's more plot in a Transformers movie. 'Poop guy' and 'bury dead body guy' just go from ship to ship trying to live. By the way, the movie is almost over before 'bury dead body guy' says anything. So these guys try to live, Kenneth Branagh stands on a dock and says things that don't matter, Mark Rylance picks up survivors in his boat, and Tom Hardy shoots other planes, while in his plane, over and over and over again, while not being seen or heard. And that's your movie. I kept waiting for the opening action sequence to be over. I kept waiting for it to slow down a little and have some exposition, but it never did. It was like I missed the beginning and just tuned into the climax of a long, humorless, silent picture. That's not to say that a movie can't be action packed and be great. U-571 is an example of a nearly non-stop, action packed, WWII movie, thrill ride. U-571 managed to have memorable and distinct characters with different purposes. U-571 had a plot with a clear goal and twists and turns. If Dunkirk could've just cut out some of the unnecessary bits, like Kenneth Branagh, and had the 1st half hour be set up and character development, then it could've been really good. But as it was, I didn't care about any of it. I kept watching English soldiers die and thinking, \"I don't care. This movie didn't make me care.\" As simple as the plot for Dunkirk was, the movie was really confusing. You'd think if you're going for an exciting, action thriller, that a simple linear plot would suffice. This movie jumps all over the timeline without giving any hint that it just made a jump in time. Christopher Nolan does a great job of jumping all over the timeline in his movie Memento. In Memento, he manages to keep things coherent and engaging. Not so here. This is just disappointing. The time jumping is completely unnecessary here. What little dialogue there is in this film is really hard to hear because of thick accents, loud explosions, masks over faces, and the music being really loud in the mix. With a really simple plot that is really hard to follow and characters with zero development or even distinguishing traits, I found myself in a really big struggle to care about what I was watching, even with incredible imagery and sound design. Yet, the whole time, the movie was telling me what I was watching was really exciting with it's music score. And that leads me to my last point: I hated the music. It pains me to say that because I usually love Hans Zimmer, especially under the direction of Christopher Nolan. There is virtually no melody in this score. It's relentless and annoying. I guess I can't blame Zimmer, considering he was just scoring to picture. Imagine watching The Dark Knight, but during the entire movie all you heard was The Joker's theme, non-stop. That's what it's like. The whole soundtrack may as well just be an air raid siren. And it's not just the music. The sound effects, as incredible as they were, were also loud, annoying, and relentless. At times, I found myself covering my ears. I thought, \"Why am I paying money to cover my ears? What I'm covering my ears to is what I paid for.\" You know what movie is better than this: all the movies I have seen this year. Valerian and The Mummy were even better. They were at least fun. The best movie I've seen this Summer is War for the Planet of the Apes, but you really need to see all the Apes pictures to get the full enjoyment out of that one. The next best is Spider-Man: Homecoming, but maybe you're not up to date with the Marvel movies. In that case, see Wonder Woman. You don't need to see the other DC movies to enjoy that one. But what ever you do, don't see Dunkirk. I beg of you not to give that garbage your support.",
      "review_date": "2017-08-03"
    },
    {
      "review_title": null,
      "content": "Over-rated, and disappointing.  The first 15 minutes were decent, and then I was almost falling asleep for the rest of the movie.  (I think I did in fact fall asleep it was so boring.)  This was advertised as some kind of super exciting warOver-rated, and disappointing.  The first 15 minutes were decent, and then I was almost falling asleep for the rest of the movie.  (I think I did in fact fall asleep it was so boring.)  This was advertised as some kind of super exciting war movie, and saving private ryan is one of my favorite movies ever, and I go and instead I get one of the most boring war movies ever.  I don't even mind if there isn't much action, but then at least give me interesting characters and story (like the Thin Red Line, also one of my favorite movies where the characters daydream in the middle of battles for minutes and minutes but you get to actually know the characters and their lives etc....great film.)  This film had a lack of compelling action, guys are pretty much just retreating and you see the same few types of shots over and over again for an hour.  I saw about 3 planes the entire movie, (the same 3 planes) and the same 100 guys, and thats about it.  I did not see a single enemy soldier in the ENTIRE FILM.  Almost NO CHARACTER even has DIALOGUE.  Almost every character is nameless and faceless, which is fine for the first 15 minutes when they are under direct diress, but at some point people will like, open their mouths and want to know things about each other and character should be revealed.  Film had weak action, with guys on boats doing nothing, and then not even any dialogue.  and the music itself should have been good if it actually matched the action on screen.  It was like hearing the great music from the Dark Knight during a foreboding moment of action when you are expecting a climax....only to see no climax, ever, throughout the entire film, repeat process for 1 hour, and that is \"Dunkirk\".  Horribly over-rated and not a very good war film being over-rated based on the directors past work.  I would rate is as one of Nolan's worst films, and the only one that...made me actually fall asleep.  Terrible writing, and the music did not match the (lack of) action.  Sub-par and a disappointment overall compared to these mindless \"great\" reviews.  It was OK, but that was about it.",
      "review_date": "2017-07-23"
    },
    {
      "review_title": null,
      "content": "The movie is so slow. Watching the trailer you would expect action scenes in the movie but there is almost none. Its all one side is attaching and the other is defending. You almost feel in the beginning the director is setting up the movieThe movie is so slow. Watching the trailer you would expect action scenes in the movie but there is almost none. Its all one side is attaching and the other is defending. You almost feel in the beginning the director is setting up the movie nice for some nice action to follow but midway through the movie you realize that nothing has happened and apparently nothing is going to happen. The movie never picks up. It just fails.",
      "review_date": "2017-07-23"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nMillions of dollars spent on a movie that can't even get the train right ... They were carriages that never saw service until at least 40 years after the event. A spitfire with endless bullets and able to cruise without an engine for mile after mile after mile, then turn around and come back again only to land on an empty beach ... with that amount of glide available, he could have turned left and gone home for tea. And where were all the thousands of troops, four hundred thousand was mentioned in the movie, about the only part in the entire thing that they got right! So where were they? What was all the money spent on? The container depot behind the beach maybe? Where was the dialogue? A boy, someones son, his other sons brother get killed by a British soldier, trying to get away from Dunkirk ... The brother says 'Oh, ok.\"The sound left a lot to be desired as well. But the thing that really bugged me, was that the buildings behind the beach were all modern! A lot of money wasted as far as I can see.",
      "review_date": "2017-07-31"
    },
    {
      "review_title": null,
      "content": "BORING. AS. HELL. The most overrated war movie of all time. I wouldn't be able to sit thru it once again even in five years from now. I don't get the insane hype.",
      "review_date": "2017-12-06"
    },
    {
      "review_title": null,
      "content": "Complementing an appropriately sombre atmosphere with visceral action (best seen in IMAX) as well as plenty of haunting imagery, Christopher Nolan’s masterful Dunkirk is an “on the moment” war film that works. The cast is universallyComplementing an appropriately sombre atmosphere with visceral action (best seen in IMAX) as well as plenty of haunting imagery, Christopher Nolan’s masterful Dunkirk is an “on the moment” war film that works. The cast is universally excellent, the tension palpable and the excellence in cinematography is unprecedented. Personally, I can see this becoming an all time classic.",
      "review_date": "2017-07-22"
    }
  ],
  "num_reviews": 153
}