{
  "title": "Fifty Shades Darker",
  "rating": 3.0,
  "release_date": "2017-02-10",
  "summary": "While Christian wrestles with his inner demons, Anastasia must confront the anger and envy of the women who came before her.",
  "critic_reviews": [
    "For all its structural and psychological deficiencies, it’s hard not to enjoy Fifty Shades Darker on its own lusciously limited terms.",
    "The movies aren't so bad they're good. They're so brilliantly bad they're genius, with Foley dutifully presenting every inane plot point while gifting us excuses to laugh.",
    "Whipping up a proper tone for the big screen versions of E.L. James’ wildly popular novels was always going to be the films’ biggest problem, and while director James Foley might not quite nail it, wily injections of humor prove to be an unexpectedly helpful addition to the kinky franchise.",
    "People are calling Fifty Shades Darker the worst movie ever made, but it’s really not that terrible. It does, however, misrepresent itself, which is true of most mainstream American films about sex. The movie’s real subject is wealth.",
    "There's a lot of inadvertently hilarious stuff in Fifty Shades Darker.",
    "Fifty Shades Darker is what you'd expect from encoring a regrettable one-night stand. Not a keeper, but nothing to gnaw off your arm about.",
    "This is one good-looking, occasionally titillating, mostly soapy and dull snooze-fest.",
    "There’s one significant problem with both Fifty Shades movies that’s impossible to ignore. Dornan is just a dud.",
    "A strange good movie, bad in every way but its effect. And it’s an effective woman’s story, not exactly believable, but with another kind of truth, a truth of the heart. If that’s not enough, it’s close.",
    "The last third of the film descends straight into a combination of \"Dynasty\" with shades of cult classic \"The Room.\" It's fantastic because it's complete and utter silly madness. Helicopter crashes! Slaps! Drinks thrown in faces! Fully clothed shower sex! A framed \"Chronicles of Riddick\" poster! All the makings of an instant cult classic.",
    "Even with an improved Dornan, the movie still belongs to Johnson, a character actress capable of making light of a movie pretending to be darker.",
    "It’s nice that the two photogenic leads are treating sex like a pleasurable activity rather than an onerous chore in this second entry, but overall, the film plays like an un-asked-for collaboration between the Hallmark and Playboy Channels.",
    "In porn, everything besides the sex scenes are just setups for the sex scenes. Here, everything feels like it’s only there to set up lavish parties or high-class adventures.",
    "Darker is strangely plotless and devoid of any real tension.",
    "It’s glossy and at times goofily funny, mostly thanks to Johnson’s subtle comic skills, but the novelty of this messy relationship is really beginning to wear off.",
    "Fifty Shades Darker is a very faithful sequel; a milquetoast continuation of a bland romance between two boring people.",
    "The awkward middle course charted by new director James Foley (Glengarry Glen Ross, House of Cards) and his cast is unsatisfying in terms of head, heart and, well, elsewhere. It’s an alleged 18-rated, adults-only filth-fest that behaves like a flustered PG.",
    "Fifty Shades Darker is a befuddling, messy erotic \"thriller\" that shifts tones faster than audiences can keep up with.",
    "Since Dornan is as dull as a catalog model anyway — he wanders through the movie like an Abercrombie searching for his Fitch — the shopping-list look of the movie makes sense. But Dakota Johnson deserves better.",
    "Sometimes sexy, sometimes campy, Fifty Shades Darker is a smorgasbord of silliness, its dopey pleasures indistinguishable from its many awkwardly melodramatic moments.",
    "This is a bad film - at times it’s nigh unwatchable - but that doesn’t matter in the grand scheme of things.",
    "A film which promises “darker” but delivers “funnier” — with some of the laughs intentional.",
    "Pulseless, perfunctory and persistently watering down its kookier instincts, Fifty Shades Darker pales in comparison to the first. You might as well call it Fifty Shades Duller.",
    "Apart from a few moments of fleeting suspense, Fifty Shades Darker resembles a Facebook feed of someone you kind of knew in high school who maybe went on to have a glamorous future, but everything seems a little bit off and contrived.",
    "Despite the nonstop banality, Johnson remains the sole source of allure: Her sleepy eyes suggest nights devoted to pleasure inconceivable to James.",
    "This is a surprisingly dull and tedious affair where nothing is even remotely plausible, the romance and the sex least of all.",
    "This is a horrible movie. Which makes it not a lot different from the first film.",
    "Leonard and Foley offer enough semi-naked sex scenes here to prove that quantity is no substitute for chemistry.",
    "It’s fifty times more boring than the first one. It is also fifty shades dumber.",
    "What makes it downright offensive are all the romance-novel flourishes that Leonard and the melodramatically inclined director James Foley, also new to the franchise, bring to glittering three-dimensional life in Fifty Shades Darker.",
    "It’s not a terribly good idea to base a movie on a book in which almost nothing happens for 500 pages, but that’s what we have here.",
    "Fifty Shades Darker takes the Dark Knight approach to franchise maintenance, taking pains to assure you that its protagonists are serious about their passions.",
    "There are a lot of negative things to be said about Fifty Shades Darker. But it does impress in one sense: The erotica lite sequel somehow manages to be worse than the stupefyingly bad \"Fifty Shades of Grey.\"",
    "Fifty Shades will make you dumber.",
    "It’s a female-driven fantasy, for sure, but that doesn’t mean it’s not toxic. And God help the poor woman who believes it.",
    "A professional with real credits, so I assume that [Mr. Foley's] not finally responsible for the ineptitude of Fifty Shades Darker, which ranges from continuity issues to unsurprisingly risible writing. There are also abrupt swings in tone, dead-end detours and flatline performances, including from Ms. Johnson.",
    "Dull at best, damaging at worst, and not worth a moment of your time.",
    "This, however, is not Mamet – it's a beast of roaring stupidity that devours everything in its path, including the veteran filmmaker.",
    "Fifty Shades Darker is very faithful to its predecessor’s vision. That is to say, it is another terrible movie with just the slightest whiff of self-awareness about how terrible it is."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "You should stay away from this utter garbage. It’s even worse than the first one. The writing, acting, directing, in a word everything in this film is uneven and awful. It feels more like a bad comedy than a romance/erotic movie.",
      "review_date": "2017-02-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Anal beads cost less than a movie ticket,    so how about all the 45y old **** housewifes buy them    instead of watching  this trash",
      "review_date": "2017-08-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What a movie disaster! Bad, really bad! Where can I start? The script: it's repetitive, with totally forced situations and ridiculous dialogues, Jamie Dornan and Dakota Johnson have chemistry and showed in other films that the two are goodWhat a movie disaster! Bad, really bad! Where can I start? The script: it's repetitive, with totally forced situations and ridiculous dialogues, Jamie Dornan and Dakota Johnson have chemistry and showed in other films that the two are good actors, but, with a script like that! How can you act well if your dialogues are so stupid? For example: how can I take seriously a movie that at one point says \"You taught me to **** she taught me how to love\"? The film is repeated again and again in terms of plot and not even the sex scenes are interesting. The movie causes absolutely nothing. The new characters lack depth and time on the screen.",
      "review_date": "2017-10-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Fifty Shades Darker\" was a horrible movie. The protagonists doing their usual things, the boring story and its forced change, of sure and no one is interested in this erotic sequel and the pure morbid it causes.",
      "review_date": "2017-12-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The only good thing is that the people are pretty and the technical stuff is fine. Everything else is terrible. It's just two people having sex and having awkward conversations.",
      "review_date": "2017-09-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Whoops, the franchise just got worse. Plot points that go nowhere, the characters still act like idiots or jerks, blah blah blah, you've heard this before.",
      "review_date": "2018-09-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I Watched this crap about 2 hours ago and already forgot whats in it except the cheesy dumb teenager sex fantasies. The plot holes are deeper than Anastasia's Vagina.",
      "review_date": "2018-07-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There's no accounting for taste! Not sure why this movie is popular, but it's not very well written, or directed. I guess this is a franchise that's here to stay, since it's cheap to make, and turns a good profit.Although for the moreThere's no accounting for taste! Not sure why this movie is popular, but it's not very well written, or directed. I guess this is a franchise that's here to stay, since it's cheap to make, and turns a good profit.Although for the more discerning viewer, I would avoid this at all costs. If you watch the trailer you'll know what it's all about, only it's a lot worse than it looks. Oh, and the reviews here scoring it a 10 are I suspect fake.",
      "review_date": "2017-02-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "THe type of movie that shouldn't exist, you don't even need to watch to know it's garbage, don't come with that **** of ''you need to watch'' no you don't, you can see the flaws in the trailer aready, stupid plot, completely empty charactersTHe type of movie that shouldn't exist, you don't even need to watch to know it's garbage, don't come with that **** of ''you need to watch'' no you don't, you can see the flaws in the trailer aready, stupid plot, completely empty characters and overral mundane, don't waste your hard worked money on this crap, go play some video games, your time will be spent way better",
      "review_date": "2017-02-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What i thought wasn't possible is possible as proven by the second installment in the terrible film franchise that explores no story and is fueled with the worst feeling of boringness within it",
      "review_date": "2017-02-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Fifty Shades Darker was more like Fifty Shades Dumb. The movie had a very unbelievable plot line and I also thought that the film was too dramatic. Fifty Shades of Grey wasn't that good so why even bother making a sequel that wasted theFifty Shades Darker was more like Fifty Shades Dumb. The movie had a very unbelievable plot line and I also thought that the film was too dramatic. Fifty Shades of Grey wasn't that good so why even bother making a sequel that wasted the talent of good actors and actresses.",
      "review_date": "2017-02-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Fifty Shades Darker is not a dramatic movie nor a thriller. Instead, it acts as a comedy, because it's 2 hours of nothing, with a crashed helicopter scene and a forbidden love (kinda, not really?) that doesn't make any sense. This movieFifty Shades Darker is not a dramatic movie nor a thriller. Instead, it acts as a comedy, because it's 2 hours of nothing, with a crashed helicopter scene and a forbidden love (kinda, not really?) that doesn't make any sense. This movie throws some of the most loveable actors (same for the director) in one of the worst performances of 2017.The only good thing (mostly decent, not good) was the soundtrack with Nicki Minaj, Zayn etc. and that's it. In the end, 'Fifty Shades Darker' is another cash-grabby sequel, that has nothing to do with the book. And don't worry, it's worse than 'Fifty Shades Of Grey'.",
      "review_date": "2017-02-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This sequel lacks any of the original's assets (I really liked it. See my review here). The narrative ended with her (Dakota Johnson) walking out on her billionaire beau (Jamie Dornan). Before long, they're back together, which leads toThis sequel lacks any of the original's assets (I really liked it. See my review here). The narrative ended with her (Dakota Johnson) walking out on her billionaire beau (Jamie Dornan). Before long, they're back together, which leads to endless intimate discussions about commitment, boundaries and other boring drivel. The dialogue is embarrassingly pedestrian (I was predicting a number of lines before they were uttered). The sex scenes lacked any eroticism (but plenty of nudity) and the S&M component was PG-rated kink. The sprinkling of suspense and disaster feel contrived and add nothing. It doesn't help that the obnoxious soundtrack pounds home the character's emotional state with often ridiculously literal lyrics. Even the scenes of opulence lack visual snap. You'd have to be a true masochist to endure this painful experience. NOTE: If you must go, stay thru the early credits to see a preview of the next one.",
      "review_date": "2017-02-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Similar to the first one in almost every way.  The film is competently shot, but wow is the story a complete bore.  This is a soap opera mixed with pop song layered sex scenes just a complete waste of time.  The last thirty minutes tried toSimilar to the first one in almost every way.  The film is competently shot, but wow is the story a complete bore.  This is a soap opera mixed with pop song layered sex scenes just a complete waste of time.  The last thirty minutes tried to concoct a story out of nowhere but it is all around laughable.  Overall a well filmed ball of nothing. D",
      "review_date": "2017-07-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Deprived of any narrative intensity or tension, Darker lowers the series' status from bad to worse, and settles for simple \"guilty pleasure\" moments and laughable plot points.",
      "review_date": "2017-03-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The only good thing about this movie is Tyler Hoechlin as Boyce Fox. And I can not even say if it was a role or a simple appearance.Give the boy more than 3 minutes on screen, three or four dialogues with Dakota and Jamie and that could saveThe only good thing about this movie is Tyler Hoechlin as Boyce Fox. And I can not even say if it was a role or a simple appearance.Give the boy more than 3 minutes on screen, three or four dialogues with Dakota and Jamie and that could save the entire movie.",
      "review_date": "2017-03-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Look what we have here. After the undeniable release of Fifty Shades of Grey, we all thought there wouldn't be a trilogy of this, but all they just want is more money (I am already aware of it being a book trilogy, but in reality, they madeLook what we have here. After the undeniable release of Fifty Shades of Grey, we all thought there wouldn't be a trilogy of this, but all they just want is more money (I am already aware of it being a book trilogy, but in reality, they made these for money) so they wouldn't just stop there. We all looked at this film to wonder if it's going to be better than its predecessor. Well, people, you're right but there just seems to be a problem in Fifty Shades Darker that isn't quite necessary whatsoever.",
      "review_date": "2017-02-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Hard to believe there can be a worse movie than the first one, but they've managed to pull through. If the first one at least had the vague 'pro' of meeting the characters (as mediocrely developed as they were), this one has nothing. It's aHard to believe there can be a worse movie than the first one, but they've managed to pull through. If the first one at least had the vague 'pro' of meeting the characters (as mediocrely developed as they were), this one has nothing. It's a shallow and boring experience from start to finish. And the only reason I assume anybody would like this, is because they can relate to some sexual desires of the characters, not at all due to the characters or the movie itself.",
      "review_date": "2017-02-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Okay, I know I am one of those people who go pay to watch “porn” in public, but for the sake of the reviews I felt like this was an important one. Who am I kidding? I love these movies with all their cheap, tacky, cheesy qualities. I’m aOkay, I know I am one of those people who go pay to watch “porn” in public, but for the sake of the reviews I felt like this was an important one. Who am I kidding? I love these movies with all their cheap, tacky, cheesy qualities. I’m a sucker for the books and the movies, even though they aren’t wonderful. So I took myself and my best friend for a girls night out the night this movie came out and reveled in all of it’s glory.I was mostly excited for this movie because I really enjoyed the second book, more-so than the first one. There was more of a story, and it was a bit more realistic given some of the qualities of the movies. We start off in this movie after Anastasia and Christian have broken up after the events in the last movie.  She is definitely not over the situation(and how hot Mr. Grey is) and is avoiding all of Christian’s attempts to win her back. Finally, they meet up at Jose’s art gallery, where he weirdly enough has photos of Ana up everywhere. Let’s be real, Christian isn’t the real creep here, Jose is. Anyway, Christian buys all of the photos and asks Ana out for dinner, to which she agrees because when Christian Grey aka Jamie Dornan asks you out to dinner, you say yes.From dinner we see them start up their relationship again, slowly at first, and then very quickly falling back into the couple they were. They attend masquerade balls together, go to dinner, fall in love, basically they do everything that normal couples do in years in a matter of a couple of weeks.Ana starts a new job at a publishing firm and we meet Jack Hyde, her new boss. He’s creepy and is supposed to be kind of an ugly, old guy, but they definitely did not stick to the script. While Eric Johnson was definitely creepy and made me uncomfortable, he wasn’t hard to look at. There are tensions between Ana and Hyde from the beginning, and even more tension between Hyde and Christian. Hyde makes it seemingly impossible to work for him and even more impossible to feel comfortable. Throughout the film we also meet Mrs. Robinson who Kim Basinger so eloquently brought to life. She was who I pictured when reading the book, and she made her on screen counterpart just as devious as she was in the book. Rita Ora was an odd choice for me as Mia, but I was pleasantly surprised by the choice. I imagined Mia with a more youthful, innocent presence.Let’s talk about sex, baby. No, but for real. Let’s talk about the sex in this movie. I don’t care what anyone says about how bad the movies are, the sex is good. At least in this one. There isn’t a lot of the BDSM that made so many people so uncomfortable and outraged in the first one. I personally was the most excited for the elevator scene, and I think it did it justice. There were some laughable intimate moments, of course the movies are kind of cheesy and not the books weren’t very well written to begin with. But I love that even in those moments, the actors don’t break character.My final thoughts, because I don’t want to give up any spoilers as usual, are on all of the lipstick they put on Dakota Johnson. I’m halfway convinced this movie was just a really long lipstick ad and I am LIVING for it. I have went as far as I can and have written down every lipstick type and shade she has on in that movie to buy. I need them all and I’m convinced that if she can wear them while being as risque and fabulous as she is, then I can wear them sitting in my office at my desk. But that could also be the part of me that thinks Dakota Johnson is the most perfect human being in the entire world. As far as a side by side comparison to the book, there were a few semi-important scenes left out, and a few things were different, but overall it stands up next to its literary counterpart pretty well. I know most people hate these movies and love to laugh at them, or do like my sister and watch them on Crappy Movie Monday, but I can’t help but love them. I will watch it again, and I will revel in its terrible glory all over again.",
      "review_date": "2017-03-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The sequel takes everything bad about the first and amplifies it. Any depth of the first is largely gone in the second, character development is null outside of the minimal development from Anna and Christian. The secondary characters are soThe sequel takes everything bad about the first and amplifies it. Any depth of the first is largely gone in the second, character development is null outside of the minimal development from Anna and Christian. The secondary characters are so forgetful that even familiar faces are little more than extras. The entirety of the script is centered around getting form point a to point b, with both of those points being sex. Anna and Christian fight, sex. Anna and Christian are happy, sex. Christian gets into a helicopter crash, sex. It seems the whole world's problems can be solved by sex in this world.The cinematography is actually pretty decent, as is the soundtrack. Unfortunately the song choices rarely make sense for the mood of the scene unlike the first.Listen, I'm not telling you to avoid this, I'm not telling you to watch it either. This is the movie equivalent of Taco Bell, it's okay to consume on occasion, but it should be avoided with any regularity.",
      "review_date": "2017-02-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Much like its predecessor, this film brings absolutely nothing of value to the table. Deprived of any real story or fundamental tension, Darker does nothing for this already struggling glorified porn franchise but make it go from bad to awfulMuch like its predecessor, this film brings absolutely nothing of value to the table. Deprived of any real story or fundamental tension, Darker does nothing for this already struggling glorified porn franchise but make it go from bad to awful the span of 118 minutes.",
      "review_date": "2017-05-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "After watching Fifty Shades Darker, I’m still not convinced of it being a love story. Sure the abusive relationship is over, but Christian still has that manipulative and possessive personality that affects Ana’s personal space. Buying Ana’sAfter watching Fifty Shades Darker, I’m still not convinced of it being a love story. Sure the abusive relationship is over, but Christian still has that manipulative and possessive personality that affects Ana’s personal space. Buying Ana’s company unexpectedly and unnecessarily transferring money to her bank account, as well as knowing her account number is downright creepy as heck. After all that, he proposes her to marry him and she said yes. My primary reaction to that is “WTAF?!” She’s going to marry some dude who stalks her a lot and just uses her to fulfill his own desires.Plus, the disappointing parts of the film is the gender-biased sex positions. No woman on top?! Not even once??!! CTFO!!! This is why I’m appalled of watching films that deal with this kind of **** After knowing more of his former submissives and childhood trauma, my opinion on Christian Grey and the book series remain the same. He is nothing but a deep-seated sadistic and goddamn conniving **** and the books deliver a misconstrued concept of romance.I won’t be surprised if it's nominated for the Golden Raspberry Awards.",
      "review_date": "2017-07-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Led by a dumb protagonist, anchored by a non-existent plot, burdened by tedious pacing, overlong, decorated with atrocious dialogue, force fed with an unfocused and uninteresting mystery, bereft of all the tension in the book (especiallyLed by a dumb protagonist, anchored by a non-existent plot, burdened by tedious pacing, overlong, decorated with atrocious dialogue, force fed with an unfocused and uninteresting mystery, bereft of all the tension in the book (especially regarding the Elena subplot), and acted with no inspiration, Fifty Shades Darker can’t even be rescued by it’s occasional bursts of unintentional humour and a decent soundtrack.",
      "review_date": "2017-07-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Why does this film exist, why have I seen it? Fifty Shades Darker is the worst film I have ever seen! The script is terrible! The characters are thinner than air, the plot is a rip off of a terrible movie so of course this film is gonna suck!Why does this film exist, why have I seen it? Fifty Shades Darker is the worst film I have ever seen! The script is terrible! The characters are thinner than air, the plot is a rip off of a terrible movie so of course this film is gonna suck! The first movie was absolutely terrible, and of course, the second film is terrible. I have not seen the first film and I will never watch it, I couldn't even finish this movie. I went to see it with a girl that I liked at the time and she kinda forced me, so that's why I saw it.",
      "review_date": "2017-10-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Where Are \"Hearts & Flowers\"?Two years ago, Universal Pictures agreed to display the preceding unreasoning erotic-romance adaptation thought up by British E. L. James, such recklessness led to a storm of dissimilar opinions between movieWhere Are \"Hearts & Flowers\"?Two years ago, Universal Pictures agreed to display the preceding unreasoning erotic-romance adaptation thought up by British E. L. James, such recklessness led to a storm of dissimilar opinions between movie critics and audience, however, and deplorably the most transcendental for the film production company, was a rotund monetary attainment, not only in its homeland but in the whole world, in part by its relentless readers and partly by its strategic launch date.Valentine's day is the picked day for releasing Jamie Dornan' and Dakota Johnson's sadomasochistic fair tale. Numerous are irrational alterations within this sequel, nonetheless, the germination of all these changes lies in its hard directional shift, as Taylor-Wood hand her director chair over to the filmmaker of some episodes of well-liked TV series, James Foley.Even though \"Fifty Shades\" wasn't well-received by most film critics, one of the most relevant swaps with the original novel was the very light but pertinent conversion in Anna's identity, the main female role. On the pages, she's fragile and more permissive; on the other hand, her effigy on screen is romantic but self-reliant, a suffragist but submissive woman, and although her mission about women's empowerment did not work, it gives something moderately axiomatic away from denigrated trilogy of James. That is probably the main conflict of the latest installment, the austere and fussy accuracy to the reference book. This time, the intrepid woman who opposed the selfsame creator has gone, foolishly, Niall Leonard, Mitchell's husband, writes and sketches empty, futile and even squalid contingencies and characters.The motion picture in question takes place ridiculously three weeks after what has happened, and I say \"ridiculous\" by unconnected and soporific distortions between the leading roles; in just three weeks, Mr. Grey suddenly forgets his firm sexual priorities to become into the authentic submissive of the storyline, in which Anastasia Steele looks more experienced, more libidinous and superficially more greedy. Fallible resolutions go on in the hands of three idle and anodyne antagonists, who covet to fracture the happy new relationship, at the same time that Grey struggles with his intrinsic shades of yesterday and today.\"Darker\", this is evidently the wrong term. Even the film opens with an involuntary self-parody about its suggestive title, are some alba roses too dark? Such name is only one tactic more in order to insinuate improving previous flaws, however, the only thing that they get is to underline them with darker ink.Leonard and Foley are a dangerous duo for the romance genre, and this should not be taken as a compliment. On this occasion, they coat it a dismal, unsatisfactory and unfounded thriller aroma; a series of circumstances poorly posed, developed and resolved. Besides, new characters inclusion is simply execrable, providing irregular performances and a limited runtime on screen for revealing their talents.Despite the unfathomable dissatisfaction I felt, there is another portion which we can praise. The first one, openly, is its protagonist. Although Johnson can't save all the footage, she does not allow her character from drowning in that sea of insipidness and boredom, on the other hand, gives it a particular empathy. Another satisfactory feature is the partial revelation of Christian's dismal past, even accompanied by flashbacks, hence he achieved a longer participation.In technical aspects, we can see major improvements within staging with regard to the previous film, with soft but amended erotic overtures, that even if they do not reach the expected level of arousal, it delivers elaborated challenges. Likewise, fireworks, masks, sex toys, parties, restaurants, Grey's remodeled penthouse and the usual Seattle aerial shots are perceived differently due to their nocturnal and attractive tones. Like its predecessor, sound support is vital both harmonizing the sensual shots and decorating fickle moments. Although the dreamlike rhythms of Legend, Sia, Swift or composer Danny Elfman do not convince for another Academy Awards nomination, they fit with complacency within artistically precious scenes.\"Darker\" destabilizes first movie spectacular expectations due to reduced chemistry of its lead actors, its poorly constructed ambitions and a series of failed elections which lose out the limited potential of James' erotic books. Grey needs to marry, forget his past and be an ordinary boyfriend, reveal his shades; Anastasia wants to be the boss of the publishing house, yearns for redeeming men with psychological problems, now he's who wants flowers and hearts and she wants to **** hard. An ex-submissive lurking, a stalker boss and a grown up lady try to end the relationship; with its dull ending, \"Darker\" insinuates becoming into a thriller of killers instead of romantic frippery that it should aspire to be.",
      "review_date": "2017-02-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I feel like the key elements for this story from the book are lost, and that reflects on the plot and overall atmosphere of the movie. If you haven't read the book you will get nothing out of this movie, and it will probably make no sense.I feel like the key elements for this story from the book are lost, and that reflects on the plot and overall atmosphere of the movie. If you haven't read the book you will get nothing out of this movie, and it will probably make no sense. They cut some parts of a story for the sake of another media, but it wasn't done as a structured story. This movie feels like a rushed porno version of the book story of Christian and Anastasia. Could have been done so much better.",
      "review_date": "2017-02-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I can't believe I'm saying this, but Fifty Shades of Grey is better than this piece of crap. The sequel to the 2014 \"hit\" is so atrociously awful that it becomes hilarious by the end.",
      "review_date": "2017-06-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's not like a hate this garbage because i am a man.It has no value except the camera work.Should we talk about the tedious plot, there's nothing to expect to happen.Oh geez this trash can't even depict pornography well.The characters areIt's not like a hate this garbage because i am a man.It has no value except the camera work.Should we talk about the tedious plot, there's nothing to expect to happen.Oh geez this trash can't even depict pornography well.The characters are boring, Christian being a psychopath and Anastasia is being her dumb self who has no reason being by Christians side.",
      "review_date": "2019-06-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was awful. Much more worser than the first movie. This movie was really boring, from start till the end. I don't recommend watching this movie.",
      "review_date": "2017-05-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I have watch the movie and read the book both are amazing. i think people should read the book and then judge the movie because If you are gonna read them you would probably like the movie too. Personally the acting of everyone was amazingI have watch the movie and read the book both are amazing. i think people should read the book and then judge the movie because If you are gonna read them you would probably like the movie too. Personally the acting of everyone was amazing and for Valentine this movie is a huge package to watch with their couples.",
      "review_date": "2017-02-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's an easy target because of the concept alone. I think what the film intends to do it does very well. Don't care if it was just me or not... liked the way the film was shot with beautiful color and expressive talent.",
      "review_date": "2017-02-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "We care not a lick for these beautiful people, nor for their future together, as teased in a glistening mini-trailer for next year’s “Fifty Shades Freed” halfway through the closing credits. Yet to find yourself rooting for their union purelyWe care not a lick for these beautiful people, nor for their future together, as teased in a glistening mini-trailer for next year’s “Fifty Shades Freed” halfway through the closing credits. Yet to find yourself rooting for their union purely because they’re both so damn hot is to realize that “Fifty Shades Darker” has worked its shallow magic on you. “I was being romantic and then you go and distract me with your kinky f—kery,” Anastasia chides Christian at one point — to which the audience can only conclude that, with all due respect to her dreams of Austen and Brontë, he’s got the better idea.",
      "review_date": "2017-02-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Really enjoyed Fifty Shades Darker?? & overall thought this 2nd in the trilogy was done nicely. It had all of the romance, emotion, suspense & of course the sex that the first one lacked. Great job with the screenplay because trying to getReally enjoyed Fifty Shades Darker?? & overall thought this 2nd in the trilogy was done nicely. It had all of the romance, emotion, suspense & of course the sex that the first one lacked. Great job with the screenplay because trying to get everything from the book into a 2 hour movie would dilute the story too much , so I understand why certain characters or stories were left out or changed. Would have maybe touched base with the psychiatrist as a character in the movie so you could truly understand how much emotional effort Christian is making to change for the better . I'm not quit sure why the critics are so harsh. Maybe they just don't understand the premise of this beautiful unique love story. Look ... this isn't supposed to be an academy award nominated movie, if you want that , then def see Lion, ( which absolutely deserves to win for best picture) . In any case , I enjoyed this movie much more then some of the critically acclaimed movies that I went to because of the critic's ratings. That's why if you ??Christian & Anastasia's love story then you will absolutely enjoy this movie. It went by fast, was a fun movie to see & like the books , I was sad it was over. I would even see it again . Def will purchase it when it comes out on DVD.",
      "review_date": "2017-02-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The first movie wasn’t spectacular, but it did have its bright moments, including a good performance from its female lead and some sly comedy. This sequel had momentum, and brought the promise of possibility.its fists with growing intensity.The first movie wasn’t spectacular, but it did have its bright moments, including a good performance from its female lead and some sly comedy. This sequel had momentum, and brought the promise of possibility.its fists with growing intensity. “If Dakota Johnson can be into this, you can too. He’s doing a shirtless plank on a pommel horse. ARE YOU NOT ENTERTAINED?”",
      "review_date": "2017-02-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Look folks, this is a guilty pleasure type of movie nothing more nothing less, it's an easy target and nothing about it is believable or realistic, and what does it matter. Do you go watch Super-Hero-Movie #4000 for its oh-so realisticLook folks, this is a guilty pleasure type of movie nothing more nothing less, it's an easy target and nothing about it is believable or realistic, and what does it matter. Do you go watch Super-Hero-Movie #4000 for its oh-so realistic depiction of daily life? Don't think so buddy. So why hold this movie to randomly high standards instead of taking it for the silly fantasy that it is. At the end of the day the acting is good and the actors can make you care about the characters, and if you're into this sort of thing you can have a good time or even laugh at the absurdity of it all, or both why not.",
      "review_date": "2017-02-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was a great movie. It has every single thing from romance to thriller. I want to keep watching it again and again. It has all the elements and emotions. The songs were great. This should definitely go for the Oscars. A Truly wonderfulThis was a great movie. It has every single thing from romance to thriller. I want to keep watching it again and again. It has all the elements and emotions. The songs were great. This should definitely go for the Oscars. A Truly wonderful romance story better than Shakespeare.",
      "review_date": "2017-02-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Loved it. I believe this movie took on different turns which made it interesting. Maybe the first love scene was a little too much of jumping in the fire but sometimes feelings are over the top. I loved it.",
      "review_date": "2017-02-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Loved the Movie and the Book. Both are amazingggggggggg.. I mean the acting was superb and the dialogues were hearttouching Couples should really watch this movie in valentine.",
      "review_date": "2017-02-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Fifty Shades Darker is a pretty decent sequel. The drama once again succeeds in entertainment for the people. The film isn't much darker and the sexual sequences in this film aren't as graphic as the first. Overall I saw myself enjoying this film.",
      "review_date": "2019-02-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The next fifty shades between an ordinary woman and a billionaire.The film was not received well as the book was. Just like the first film, it has been another below average. Might be because of its theme. Usually this kind of films doThe next fifty shades between an ordinary woman and a billionaire.The film was not received well as the book was. Just like the first film, it has been another below average. Might be because of its theme. Usually this kind of films do great business, but ratings and reviews does not praise or encourage the film. So I doubt anybody will be bored of it, which means watchable film and instead it won't be their favourite.The story continued and this time it was not based on experiment or any kind of agreement, but mutual understanding. So the billionaire Grey and Ana's erotic adventure sustains. With the small-small developments the film goes all the way to the ending. That means, those who are watching it for the selected scenes, will surely would have a nice time. But nothing was strong as any European film on the similar theme.Apart from the weak storyline, there's nothing wrong with it. As to what this film is about, it served better. That's what I say to you not to expect full storied romance-drama. As usual the actors were good and another two films to come in the 'Fifty Shades' franchise. I hope they can be better than the first two. Overall, it is only for the selected audience, but curiosity makes everybody watch it and they all pour they perspective which is flooded with average to negative. Otherwise, it is an acceptable film.6/10",
      "review_date": "2017-07-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "no rules, no punishments..Fifty Shades DarkerThe plot has a lot to offer but it lacks character development and worst of all execution which just results into dull and dry emotions and addition to that the lead actors lacks acting skills.",
      "review_date": "2018-01-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Worse is difficult...This film is the more-than-announced continuation of the Fifty Shades trilogy, and I think it's the worst of the three films. Despite the great success of the box office, in my view largely based on the previous successWorse is difficult...This film is the more-than-announced continuation of the Fifty Shades trilogy, and I think it's the worst of the three films. Despite the great success of the box office, in my view largely based on the previous success of the books by E. L. James, the film was precisely booed by both the critics and the public who paid to see it. As I did in the critique of the first film, I emphasize here that I neither read nor intend to read the original books, so I will only speak about the film, although I know that many problems related to the story told already come from the original material.After breaking up with Gray, Anastasia decides to resume with him, but under conditions. Her personality changed a lot from one film to the next. She is no longer that shy girl who is unable to break a plate that we saw in the first film. She discovered her own femininity, is more confident and dominates the situation with confidence, almost to the point of reversing sexual roles with Gray. This, in turn, seems lost and not quite sure where to step, in search of firm ground. This was what surprised me most in the story told by the film. The rest (the intrigues and jealousy involving Anastasia's boss and Gray's ex-lover, or even Leila's enigmatic appearance) does not have half the interest that this change in their personality had for me. And the film also has terrible dialogues and one of the most lurid lapses of continuity I have ever seen in cinema: the complicated lingerie that Anastasia takes to the Gray's charity party and that, already on the spot, in yet another sex scene, has mysteriously disappeared of her body, leaving only a simple lacy underwear. I almost burst out laughing. Is there anything good here? Yes, but little. The performance of the two central actors in the plot is noticeably less boring than in the first film, but, as seen earlier, the impersonality and the lack of passion and chemistry between them dominates; Marcia Gay Harden did a good performance as Christian's mother and Kim Basinger was also good at the little he had to doIt goes without saying that this film is totally inappropriate for children and teenagers, given the heavy erotic material and the language used. The film had a good budget and, therefore, good production values, starting with good photography, good scene props, satisfactory editing work and a good soundtrack, composed by Danny Elfman.",
      "review_date": "2020-02-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "'Fifty Shades Darker' pretty much retains all the problems of its prequel: long, boring, empty and repeated scenes which all say the same thing except with a different lavish product-placement filled background. But this time there is no'Fifty Shades Darker' pretty much retains all the problems of its prequel: long, boring, empty and repeated scenes which all say the same thing except with a different lavish product-placement filled background. But this time there is no mystery, and the few new characters that are presented to us are barely given any focus.This is a new problem this film has. It wastes its focus on the wrong parts. Sure, Anastasia (Dakota Johnson) and Christian (Jamie Dornan) are the main characters, but the subject of Christian's condition is so milked that they simply have nothing to talk about and instead they repeat the same subjects and conversations over and over again. Occasionally we get a sex scene, of course, but they are all the same, yet treated with such attention that we are sucked into their void. \"Take me to the red room\" - Anastasia says at some point like its a big deal. She already was there.But back to the nude scenes. I thought of counting them, but then I remembered my lazy bottom didn't bother to count the number of cuts in 'Werckmeister Harmonies', a film I gave a 10; so, out of respect (and the fact that I didn't really care, to be honest) I didn't. The number is not important. At how boring these scenes are even two are too many. And there were more; that I know. I mean, I am a 22-year-old sexual hormone-filled teenager, and I am honestly sick of seeing Dakota Johnson nude stumbling around Christian Grey's opulent apartment/mansion/castle-whatever.But back to the nude scenes again (or rather one of them). In the scene where he finally takes her to the \"infamous\" red room, yet again we are presented with a boring, safe sex scene. I mean, he's got all that stuff lying around. Is like that episode of Looney Tunes where the rat exterminator comes in, proceeds to lay out all his tools on the floor, and then only uses a tiny trap and then leaves. That was funny and this scene was too (like many scenes), but here I don't believe the humor is intentional.There are three characters which are interesting: that is Leila (Bella Heathcote), a physically harmed girl coming to take vengeance on Anastasia; Eric Johnson giving a pretty good performance as Jack Hyde, Anastasia's boss and Kim Basinger as Elena Lincoln, the woman who first exposed Christian to sado-masochism. But we barely get any focus on them. Leila only appears in three scenes: first, a brief meet with Anastasia then she goes full Batman mode watching Christian and Anastasia sleep (I am still wondering how she got into the apartment) and her 'reveal' is a huge let-down. Same can be said for the rest of the characters.In the end, I guess the reason director James Foley decided to do this, was to artificially extend the plot and to make this a trilogy. This might be a good business move, but its a shameless one when it comes to the art. Yet there were moments, minutes literally, where 'Fifty Shades Darker' peaked my interest - like the scene in which Christian shows his dark side when Anastasia meets Leila or when she is harassed by Jack. But these are way too brief and instead we get a rich and empty showcase of opulence. This film could have been more. This really is a waste.",
      "review_date": "2018-11-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What a letdown...but funny in the worst way?I saw it and yeah...I had fun, laughing I guess? For anyone who tells me that its a beautiful, love story...f*ck off. It was the cheesiest, corniest, most awkward-comedic film. But hey, it workedWhat a letdown...but funny in the worst way?I saw it and yeah...I had fun, laughing I guess? For anyone who tells me that its a beautiful, love story...f*ck off. It was the cheesiest, corniest, most awkward-comedic film. But hey, it worked for a great comedy where the jokes on the film. Seriously, the scenes were so bad you couldn't help but laugh. I think FSoG was better in the aspect to take it a bit more \"serious\" than FSD. This film completely did not give a f*ck, I was disappointed that the plots and other characters (Mrs. Robinson, Jack Hyde, Leila) were weak! It had potential to explore more of these arcs, but it didn't. It was dull and so rushed! Everything was rushed. Even the sex! I'm not expecting full-blown porn but cut the soundtrack songs out, more positions (not just mostly missionary all the time), and please bring in some foreplay. How can a movie about risqué intimacy not show good foreplay? Why does Christian always have an un-emotional face while having sex? No climax either? In the books, wasn't he always grinning (or proudly smiling) for his accomplishment in giving Ana orgasms? For getting off too? None of that...it cuts straight to the next scene. Man...and why was it so Soap-Opera-ish?I'm not going to lie, I read the trilogy once and I was like, \"whatever, this is the junk food to my brain\". It wasn't good, but whatever... it served some purpose. Did I think that it was the greatest love story? Nope. Did I think it was a great romantic story? Nope. I was honestly intrigued by the fetish that surrounds BDSM. But it turned out, that even if the sex was hot, it wasn't even portrayed properly. BDSM is a whole other level.I was walking out and a lot of the viewers said that it did poorly in capturing the book. Like sure, the sex was there, but that connectivity...intimacy... was not. It was like : fight, bang (sex). Argument, bang. Present, bang again. It was repetitive in the sense of just make-up sex all the time. Ana is annoying. She doesn't know what she wants in the film or in life. Its like she can't take Christian's dark ways and not kidding, a few seconds later she's okay with it, without any solidifying reason (unless its going down on her or sex) . I feel like FSoG (2015) attempted some direction towards a woman's viewpoint. Like Ana being \"dominant\" in the sense of negotiation and choices. In this film, I'm sorry...she comes off like a gold-digger. She comes off like the only reason she's with him is because he's rich. Its like \"I can't be with you, like this...(he gives her a gift), oh, I love you!) WTF? She tries so hard to be her own woman, but really ends up being Christian's (and not in the cute way like \"Oh, I'm his girl *googly-eyes*) I feel that FSoG (2015) did a better job in where Ana had control and it made sense. Here it's wishy-washy.Its just a mess, not sexy, everything is rushed that you don't understand the reasoning behind motives. They cut off and rushed great moments and characters that could have given the film more sense, romance and great eroticism. Yes its funny because it tries so hard to take itself serious. But that's about it.",
      "review_date": "2020-11-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's still the same bland, boring, lacklustre storytelling like its predecessor. Nothing more to be said.",
      "review_date": "2018-09-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "After watching Fifty Shades Darker, I was super-confused! 'cause it was better than Fifty Shades of Grey in somethings, and worse than it in somethings.Things that was really better than the first one are:It was really emotional, andAfter watching Fifty Shades Darker, I was super-confused! 'cause it was better than Fifty Shades of Grey in somethings, and worse than it in somethings.Things that was really better than the first one are:It was really emotional, and romantic.The performance was better than the first one.The story was more powerful, but sometimes it made no sense, and it takes us to the things that were worse than the first one:The story sometimes made no sense. Like how Leila was really a slave to Christian?And how did she enter the apartment?A lot of nonsense **** happened!Things I did not like in this movie are:Somehow the sex scenes were not erotic, and I hated that!It took everything in the novel without thinking.And the Unrated version was useless!But I liked it though!",
      "review_date": "2018-11-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis is the second movie in the trilogy of Fifty Shades of Grey. I struggled with the fact that the movie did not include many important issues in the books. But the acting of both Jamie Dornan and Dakota Johnson was believable.",
      "review_date": "2020-07-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "2nd part of the best trilogy ever. Another Biutiful story.Wanted to give it a 10 just for the joke, but we don't need that zero.",
      "review_date": "2022-06-25",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 96,
  "genres": [
    "Drama",
    "Romance"
  ]
}