{
  "title": "Guardians of the Galaxy Vol. 2",
  "rating": 7.8,
  "release_date": "2017-05-05",
  "genre": [
    "Action",
    "Adventure",
    "Sci-Fi",
    "Comedy"
  ],
  "summary": "Set to the backdrop of Awesome Mixtape #2, Marvel's Guardians of the Galaxy Vol. 2 continues the team's adventures as they traverse the outer reaches of the cosmos. The Guardians must fight to keep their newfound family together as they unravel the mysteries of Peter Quill's true parentage. Old foes become new allies and fan-favoriteSet to the backdrop of Awesome Mixtape #2, Marvel's Guardians of the Galaxy Vol. 2 continues the team's adventures as they traverse the outer reaches of the cosmos. The Guardians must fight to keep their newfound family together as they unravel the mysteries of Peter Quill's true parentage. Old foes become new allies and fan-favorite characters from the classic comics will come to our heroes' aid as the Marvel cinematic universe continues to expand.… Expand",
  "critic_reviews": [
    "The new film is more expansive, more beautiful, funnier, nuttier and — this is the most difficult trick for any comic-book movie to pull off — more touching than the first film.",
    "It’s the rare Marvel sequel that manages to expand on what came before in new and rewarding ways, while also striking its own distinct tone even as some of its narrative devices skew familiar.",
    "How many times have you read that it’s really hard to duplicate the success of the first film in a sequel? Probably more than you can remember. Well, here’s a newsflash: Guardians of the Galaxy, Vol. 2 pulls that feat off with only a little strain and a belly of genuine emotion.",
    "While Marvel metastasizes as a movie brand, the irreverent Guardians of the Galaxy franchise has become a healthy off-shoot. There’s something loose-limbed and unexpected about this series.",
    "Pratt is engagingly rascally as Quill, and Saldana brings a sassy charisma to the no-nonsense Gamora. But as might be expected, Baby Groot steals the film.",
    "Just like the first one, Guardians of the Galaxy Vol. 2 is a winning and wonderfully relatable gem of crazy.",
    "By the end of Guardians of the Galaxy Vol. 2, the audience is unlikely to feel they’ve seen anything that different from Vol. 1, but it’s clear that Gunn and company knew exactly what qualities made the first film so enjoyable, and what they needed to do to make sure this particular sequel was worth the wait.",
    "Its unthwartable tempo of quips, gags, cameos (Sly Stallone!), and loud noises rarely feels grating if only because of how loving it feels toward its characters and soundtrack, and how respectful it is toward the limits of its audience’s appetite for superheroic universe-building.",
    "Guardians Of The Galaxy Vol. 2 is the deranged Marvel disco you’d expect from a filmmaker who wants to push the limits of an otherwise rigid and structured system.",
    "Underneath Vol. 2’s sarcastic exterior, Gunn’s script has a big, bleeding heart, pinpointing the characters’ insecurities and emotional scars.",
    "The Guardians get a welcome return to the big screen, which despite many positives, fails to match the dizzying heights of the original.",
    "That sense of gooey euphoria runs through everything that’s good in Guardians of the Galaxy Vol 2.",
    "Even when the pixels threaten to overwhelm, Gunn finds refuge in his main characters. There’s plenty to enjoy here.",
    "If it’s overstuffed in the way of most sequels, well, at least it’s stuffed with good cheer.",
    "Volume 2 can claim to be bigger and better than its predecessor, although it still suffers from some of the narrative sleight-of-hand issues that kept Guardians of Galaxy from achieving greatness.",
    "It’s a sci-fi action movie that spoofs the form to strong comic effect, and yet it profits from every good thing about the genre it’s mocking. It tries to have it both ways, and it succeeds.",
    "To some degree, Guardians Of The Galaxy Vol. 2 is a more offbeat film than the original, with better gags, better (and more cartoonish) action, and more visual variety.",
    "The film at one point offers the finest sustained act of emotional storytelling to grace a Marvel Studios production.",
    "“Vol. 2” avoids many of the flaws of the first movie, and does several things notably better. It’s fun, clever and a great kick-off to the summer movie season.",
    "Like many a sequel to a slam-bang, much-liked mega-hit, Guardians of the Galaxy Vol. 2 isn’t quite as much fun, not quite as clever, not quite as fresh as the original — but it still packs a bright and shiny and sweet punch.",
    "Hanging with Quill and his mercenary space misfits is still everything you'd want in a wild summer ride.",
    "There is wit and there are explosions, and while none of them represent a step above “Guardians of the Galaxy,” neither do they impugn the memory of one of the freshest and most fun of the Marvel movies.",
    "It’s the classic example of the sequel to a really imaginative original: If the first one didn’t exist, this one would seem revolutionary. But the first one does, and Guardians of the Galaxy Vol. 2, for all its charms, will live in its shadow.",
    "The characters and their relationships are strong and the dialogue is sharp, but the whole thing feels like a minor installment in an ongoing series.",
    "Shot for shot, line and line, it’s an extravagant and witty follow-up, made with the same friendly virtuosic dazzle. Yet this time you can sense just how hard the series’ wizard of a director, James Gunn (now taking off from a script he wrote solo), is working to entertain you. Maybe a little too hard.",
    "Director and writer Gunn is a dab hand with space opera quippery and most of the set-pieces land bang on target, with collateral emotional damage to boot.",
    "James Gunn's second spin with Marvel's interplanetary misfits still entertains but this time the fun feels forced. Gone is the original's scrappy underdog spirit and a director operating like it's his only chance to make a movie.",
    "It’s smarter than most films, but not as smart as the first one. It’s funnier than most films, but not as funny as the first one. And it still probably belongs in the upper tier of Marvel movies but nowhere near as high up as the first one.",
    "Much of the material gets rehashed with slight variations...and many of the space battles have a redundant quality.",
    "Thankfully, Vol. 2 does come together in the end with a powerful emotional payoff, but that’s only after it becomes a computer-generated action-fest with the fate of the universe hanging in the balance again.",
    "The sharp comic timing and devil-may-care breeziness of the original only return intermittently, and the new film’s emphasis is on family feuds and forgiveness. It’s heavy on the feels. There are hugs.",
    "What flipped by as a funny, big-budget whimsy before takes on gravitas — daddy issues, intimacy issues, trust issues.",
    "This one's a step down from the original.",
    "Gunn decides to treat the quest for meaning seriously — a lethal move that not only leads to the noisy palaver of the climax but also undermines Chris Pratt, who likes to hold these movies at arm’s length, as it were, and to probe them for pomposity.",
    "It’s tough being a hitmaker who isn’t weighed down by corporate expectations, but for a while, Mr. Gunn does a pretty good job of keeping the whole thing reasonably fizzy, starting with an opener that winks at the audience with big bangs and slapstick.",
    "Guardians of the Galaxy Vol. 2 probably couldn’t, and definitely doesn’t, recapture the sweet and singular silliness of the original, though the new edition from Marvel Studios and Disney has its rewards.",
    "As a result of trying too hard to maintain the original's insouciant attitude, what was fresh now seems institutionalized, what was off the wall now feels carved in stone and the film's trademark irreverence has become dogma.",
    "The second \"volume\" of the open-ended franchise is simply not as charming as the original.",
    "The choice soundtrack, accompanied by the candyfloss aesthetic make for moments of fun, but it ultimately lacks the originality of the first.",
    "The characters are still fun to be around, the one-liners are still sharp...and the soundtrack is, of course, terrific. But there are only so many times you can slap on a Fleetwood Mac toe-tapper and expect it to paper over the cracks.",
    "Guardians of the Galaxy Vol. 2 plays like a second ride on a roller-coaster that was a real kick the first time around but feels very been-there/done-that now.",
    "It’s fun, though GOTG2 doesn’t have the same sense of weird urgency and point that the first film had. They’re still guarding, although the galaxy never seems in much danger.",
    "The sequel is often loud, occasionally obnoxious and so consistently convinced of its own awesomeness that it will not, it cannot, stop pointing out everything that makes it so utterly wonderful.",
    "Gunn maintains the unenviable job of giving each piece of his ensemble their due screen time to avoid making it the Peter Quill show, but the proceedings often feel manic, disjointed, and overstuffed.",
    "Vol. 2 aims to please with breathtaking set pieces that’ll convince you to delete all your old diatribes about CGI ruining the movies. But no matter how funny writer-director James Gunn wants this film to be — the one-liners move at lightspeed — too many of the punch lines are referential.",
    "It’s not the weighty emotions that drag Vol. 2 down. It’s the plot that chases its own tail and the cluttered visual palette.",
    "In striving to surprise us every minute with its seen-it-all irony, Guardians Vol. 2 is actually the surprise-spoiler of all time—our every “Wow!” or “Haha!” has been scripted in advance.",
    "It’s a rare misstep for the usually sure-footed folks behind the Marvel Cinematic Universe."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "I'm still blown away by the awesomeness of this movie. Just as fun, colorful, action-packed, visually marvelous and lough-out-loud funny as the first one. But, just like the first one, it has its dramatic moments too - ask Mary Poppins.",
      "review_date": "2017-07-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Marvel has perfected the art of making mediocre movies.Another wasted villain,forced emotional moments and forced joke at the expense of character development.Baby groot was funny initially but there is a lengthy scene which drags on andMarvel has perfected the art of making mediocre movies.Another wasted villain,forced emotional moments and forced joke at the expense of character development.Baby groot was funny initially but there is a lengthy scene which drags on and his(?) cuteness wears off.For the first 45 minutes there is literally no plot just jokes.",
      "review_date": "2017-05-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Better than the first one, it's another prove we shouldn't believe on critics' opinions. They tend to do dumb assumptions and it's commom to them to have a pre conceived opinion,",
      "review_date": "2017-05-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Imagine your friend makes a bad joke and you give him the pity laugh so he wouldn't feel like an idiot, yet he simply won't get the hint and continue with his bad jokes: Then you know exactly how watching this movie feels like... The mainImagine your friend makes a bad joke and you give him the pity laugh so he wouldn't feel like an idiot, yet he simply won't get the hint and continue with his bad jokes: Then you know exactly how watching this movie feels like... The main plot litterally starts 90 mins in: Until then we get dramatic slow walking, lots of 70s/80s music and plenty of moments that are just cringeworthy \"Hey, this guy has a funny name, let's made lame jokes about that for the next 5 minutes ...\" also let's have a Yondu, Rocket and Groot subplot that goes nowhere, just because this movie needs some extra minutes.",
      "review_date": "2017-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a solid 7. I think it's better than average, but worse than the original one. The story was freaking weird, and not in a good way. The thing that keeps this score from going more south is the solid group of actors for it, the amazingThis is a solid 7. I think it's better than average, but worse than the original one. The story was freaking weird, and not in a good way. The thing that keeps this score from going more south is the solid group of actors for it, the amazing humor, and delightful characters and their development in the story. The actual story they tried to put out was not good if you ask me.",
      "review_date": "2017-05-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Personally I didn’t think the plot held together as well as the first movie but it is still very funny in places, entertaining throughout and has a fantastic soundtrack. Baby Groot is also my new favourite character from any Marvel film!",
      "review_date": "2017-05-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is like having a second serving of a dish you didn't knew but amazed you the first time you tried. The second time around, all the flavours, ingredients, presentation, ambience, and service are as good as the first time, but thereThis movie is like having a second serving of a dish you didn't knew but amazed you the first time you tried. The second time around, all the flavours, ingredients, presentation, ambience, and service are as good as the first time, but there is just not the same magic, simply because it doesn't have the discovery again. That doesn't mean that it is bad, not at all, compared to other offers of the same type, this is leagues and bounds better, but its not the same withouth the thrill of discovering something you didn't expect to like to be tha good. Nevertheless, with great visuals, and excellent vol. 2 of music, mostly good jokes, one of the best villains (although that doesn't say much unfortunately for Marvel), this movie is a great second serving, without the unexpected delight of the new thing. For all marvel, superheroe, action, or AAA movies, this is highly recommended. If you loved or liked the first one, even more. Hope to see more of the guardians doing their thing in avengers infinity war. Keep the coming Marvel.",
      "review_date": "2017-05-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Guardians' date with the creator.The first film was the most unexpected. That was one of the most colourfull space films I have ever seen. Youthful, energetic, fantastic visuals and so the same followed in this sequel as well. Not the sameGuardians' date with the creator.The first film was the most unexpected. That was one of the most colourfull space films I have ever seen. Youthful, energetic, fantastic visuals and so the same followed in this sequel as well. Not the same good, but stood to the expectation of the first film's success. This story does not have a great adventure in the galaxy. A simple quest, but a thrilling action-adventure. Now this accidental space gang is set to meet the creator.It's time for Peter to meet his father, Ego. As he still upset with his mother's death, his encounter with his father was not as expectedly smooth. On the other side of the story, Rocket, Yandu, Baby Groot make their escape from the captivity. They all end up on the Ego's planet where the rest of the film going to take place. Being the guardians of the galaxy, their fight against the whoever threaten the safety of the universe once again tested with their strength as a team.James Gunn did it again. And I'm confident that he's going to do the same for next as well. All the actors were fantastic like the previous film. This time, little fun with little Groot. Anybody who loved the first would love it too. Being a franchise from Marvel universe, it is yet to join the 'Avengers'. So far so good. I'm now expecting one of the best of best trilogies. Bring it on the volume 3.8/10",
      "review_date": "2017-10-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I missed this film at the cinema, so finally managed to catch it now that it's out on bluray. It's awesome. Funnier and more character-driven than the first. I cared more about the ending too. I've no idea why it ranked lower critically thanI missed this film at the cinema, so finally managed to catch it now that it's out on bluray. It's awesome. Funnier and more character-driven than the first. I cared more about the ending too. I've no idea why it ranked lower critically than the first, but it doesn't really matter.If you enjoyed Guardians of the Galaxy, and haven't seen the sequel yet, I fully recommend that you do so.",
      "review_date": "2017-08-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nJames Gunn returns with the sequel to the Guardians of the Galaxy with a movie that brings back many of the things that made the original so great. Is it greater than the first though? It is hard to rank one above the other, but I still believe the first installment (in what is now going to be a trilogy) deserves the nod. Led by the continuously likable and charismatic Chris Pratt as Star-Lord, we join the Guardians on a journey across the planets and galaxies. Vol. 2 introduces many new characters such as Mantis and Peter Quill aka Star Lord's father, Ego, the latter played by Kurt Russell. The characters of Drax and Rocket were hilarious as usual, Drax especially in many scenes. We learn more of the intense relationship between the sisters Gamora and Nebula, but there were two who really stood out for me: Baby Groot and (surprisingly) Yondu. Baby Groots time on camera created many laughs, not just for his sheer cuteness, but for his interactions with the other characters. Yondu in this movie was given far more story to deal with, and it certainly paid off. It made you really care for him on an emotional level, which does sound quite unusual given he is a ravager. And last but not least, Star-Lord, and being the lead character, deserved all the attention because he was great. The movie was another great entry into the Marvel Cinematic Universe and has created more anticipation for Avengers: Infinity Wars where we will see the Avengers team up with the Guardians. Guardians of the Galaxy Vol.2 will provide more laughs, more emotion and more action for any movie viewer, led by a great director and cast.",
      "review_date": "2017-11-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "In many ways this is even better than the first film, it retains many of that film's qualities, but adds a personal sense of drama and an excellent villain to boot. BUT, and this is a major problem, the film has some fairly noticeable pacingIn many ways this is even better than the first film, it retains many of that film's qualities, but adds a personal sense of drama and an excellent villain to boot. BUT, and this is a major problem, the film has some fairly noticeable pacing issues that it spends a lot of time struggling against in the first half of the film. Outside of that, it's still excellent.",
      "review_date": "2018-01-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Guardians Vol. 2, expanding upon the recent trend of Marvel films, is a melodrama. Much like, ironically, Drax, the film is completely incapable of not outright stating what it wants you to feel at any moment. There is no nuance or subtext toGuardians Vol. 2, expanding upon the recent trend of Marvel films, is a melodrama. Much like, ironically, Drax, the film is completely incapable of not outright stating what it wants you to feel at any moment. There is no nuance or subtext to the entire film. This is frustrating as each character in the film is given an obvious \"arc\" and explicitly states out loud where they are in that arc as it progresses. As a result, the film feels as though it's \"stupid\". Or more accurately, made for international audiences who aren't familiar with American social cues. All that said, many of the scenes land. If you are a seasoned film goer or, sorry, a smart person, you may find much of the film cringe-inducing. But children, and people who find films challenging will enjoy the \"easy-listening\" approach to GOTG Vol. 2.",
      "review_date": "2017-09-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The sequel to the only Marvel film that I have loved was a prospect that I was very much looking forward to back in 2014. However, since then, Marvel films have gotten progressively more and more generic with the marks from the assembly lineThe sequel to the only Marvel film that I have loved was a prospect that I was very much looking forward to back in 2014. However, since then, Marvel films have gotten progressively more and more generic with the marks from the assembly line obstructing every image of the film. Last year's Captain America: Civil War was the first sign of trouble at Marvel studio with a made-by-committee checklist type of film that just fell flat. Doctor Strange, however, took it a step further and was a film made by both committee and focus group. The results were absolutely alarming. As such, there was no way I was rushing out to see Guardians of the Galaxy Vol. 2. Part of it was fear that the Guardians would be ruined as well, but a lot of it was low expectations as demanded by being so underwhelmed by Marvel and the superhero genre as a whole in 2016. It seemed as though superhero movies were no longer something I could enjoy like everybody else with jokes I did not find funny and plots that were hardly worth my time. Fortunately, Guardians Vol. 2 somewhat changed that.I say somewhat because this film is still littered with issues. The original was defined by its raw and unexpected parent-driven emotion, its sense of family, constant jokes, interesting worlds and planets, music from the 80s, and more. This film has all of that, but slightly worse. It lacks the originality and inspiration found in the original on these fronts, even while possessing the most inspiration and daring found in the Marvel Cinematic Universe right now. This film tosses in neon (akin to Drive or other neon-lit favorites) and barren landscapes (akin to Mad Max: Fury Road) to the mix after the moviegoer surveys received by Marvel advised them to include both due to how \"in\" both were at the moment. Blended with the rehashing and fan service from the original, the film certainly feels like a film that was made to be pleasing, but not challenging or unique. It is a conveyor belt film like Marvel's other recent output, but it is by way of director James Gunn. With a light hearted energy where the film knows how stupid it all is, the film somehow sticks the landing and is like a slightly shinier and more precisely put together piece from that very same conveyor belt.Yet, though it sticks the landing, the film's writing does still often leave a lot to be desired. One of the most egregious missteps comes in the very beginning. Dropping us into a situation where the Guardians face off with some monster to protect batteries at the behest of a race of people known as the Sovereign people, the film then introduces us to the high priestess of those people, Ayesha (Elizabeth Debicki). With her first words being forced exposition about who the Sovereign people are even though the Guardians should already know that, the film not just tips its hand that these people will keep popping up, but it is a line of dialogue that adds nothing to the story and never comes into play in any meaningful way. They hired the Guardians to defend this battery and then encounter them throughout the film. Leave it at that. There is no defined need to explain who they are because it is nothing but unneeded exposition and in-your-face foreshadowing.The film's in-your-face foreshadow is only foreshadowed by this awful moment of exposition, however. Once introduced to Peter's (Chris Pratt) father, Ego (Kurt Russell), we are bombarded by Gamora (Zoe Saldana) immediately warning Peter that he may not be all good. After wanting him to find his father, she immediately jumps past the honeymoon period and alerts the audience that there is more to Ego than may immediately meet the eye. Through not-so-subtle repeated mentions of secrets held by Ego and some mystery regarding whether or not he is everything he claims to be, the film continuously hints at a big twist and reveal that is forthcoming. By the time it arrives, Gunn plays it as if it were a twist even if it had been spelled out and fully outlined by the time it is finally revealed. Instead of a shock, it becomes a situation where the audience just waits for Peter and the Guardians to finally wake up and realize that Ego is not good. Though the reveal is quite nice with the mountain of bodies, the film's shock and surprise reveal about who the true antagonist is about as secretive and subtle as James Gunn coming out and saying that Ego is bad at the very beginning of the movie. Naming him Ego is also a major clue here, particularly with his cliche demands of the world.This cliched demand to destroy the world and make it in his own image is one of the film's many cliches that really do hold it back, as is often the case with superhero films, particularly Marvel ones. Though handed a compelling villain, the film largely does not take advantage of him and instead just turns him into another \"destroy the world\" villain, which is a shame. As is often the case, the film also has a \"love conquers all\" message that kills him.",
      "review_date": "2017-06-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Definitely better than the first part, with a superlative Drax and a pretty pretty Baby Groot. Rooker and his Jondu reminds us his great character anti-hero on The Walking Dead, and we are so happy for it.Fantastic Guardians of the Galaxy Vol. 2",
      "review_date": "2017-05-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The humor in this movie is unrelenting. Almost to its own detriment, but it still manages to pack in a lot of heart. While the first was fresh and exciting, this digs deeper into its characters. No simple feat, considering how much is goingThe humor in this movie is unrelenting. Almost to its own detriment, but it still manages to pack in a lot of heart. While the first was fresh and exciting, this digs deeper into its characters. No simple feat, considering how much is going on. It makes new favorites of old characters( and some new ) and while the some things may put off some, the sum of its parts is something to be admired.",
      "review_date": "2017-05-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don't understand the negative critic reviews and it shows to me why review publications have lost sight and credibility. So much better than the first movie and well worth seeing. The story might be slightly weaker with a little moreI don't understand the negative critic reviews and it shows to me why review publications have lost sight and credibility. So much better than the first movie and well worth seeing. The story might be slightly weaker with a little more unnecessary guff but it makes up for it with a lot more heart, humour and just making the characters much more likeable. They didn't even overdo baby Groot which I was worried they would",
      "review_date": "2017-05-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Well progressed and fun ridden sequel that benefits from strong fun performances and a shift in focus from its previous from becoming a family to being about family with new characters and the joy of revisiting the old ones and adorable babyWell progressed and fun ridden sequel that benefits from strong fun performances and a shift in focus from its previous from becoming a family to being about family with new characters and the joy of revisiting the old ones and adorable baby groot who is not over done along with  stunning visual at its helm conforming to a fun family friendly comedy marvel sci-fi flick",
      "review_date": "2017-05-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis movie surprised me. I was expecting it to be worse than the original (as sequels generally are), but I'd say it was at the very least just as good. Lots of ugly crying towards the end there. Never thought I'd end up liking Yondu so much. What a great character.",
      "review_date": "2022-05-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Guardians of the Galaxy Vol. 2 does not become what was the first, even so it has as many bad things as good. That's what happens with this sequel, gags abound everywhere and less are those who meet than those who do not. Another problem thatGuardians of the Galaxy Vol. 2 does not become what was the first, even so it has as many bad things as good. That's what happens with this sequel, gags abound everywhere and less are those who meet than those who do not. Another problem that I had with this movie was the narration that it has, the first hour and a half is quite slow. The CGI is amazing and one of the best that Marvel has given so far; the chemistry between the actors is intact and adds the good pair that Rocket / Yandu do; the Easter Eggs are impressive); the last hour esexplosivas and dynamic and Baby Groot, well, missed a bit of Baby Groot, but, left me satisfied. It is enjoyed and is entertaining",
      "review_date": "2017-10-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nA bit goofy and uneven at times but very funny. The Rocket and Yondu scenes are probably the best. Drax and Mantis were were great too. Just needs some better writing and more of the characters the first one teased us with. I especially want Cosmo and Howard the Duck helping the Guardians.Some of the new songs are pretty much \"easy listening\" rock. So the soundtrack is a little disappointing. Fox on a Run is probably the best. While I do get why there's not too much focus on new characters. To build more on relationships of the first films characters.However it felt like Alice: Through the LooKing Glass which pretty much was made to work out the issues between father and sons and sisters who didn't get along. Except, yes this movie is much better than that one.",
      "review_date": "2017-06-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Even better than the first Guardians, only soundtrack was a bit worse, but still cool ( Fox on the run and The Chain was unfortunately only in trailer) Especially Yondu, Rocket and Groot scene escaping space ship ( it was as awesome asEven better than the first Guardians, only soundtrack was a bit worse, but still cool ( Fox on the run and The Chain was unfortunately only in trailer) Especially Yondu, Rocket and Groot scene escaping space ship ( it was as awesome as Quicksilver scene in newes X-mens) I recommend this film to everyone who like Marvel or Star Wars movie, because it is best screening of comic book ever.",
      "review_date": "2017-06-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I am not joking when I say this, but this is best film I have ever seen. All the characters mean something to this film. No one was a filler character. The story may seem stupid in the trailer, but you get to know more in the film and itI am not joking when I say this, but this is best film I have ever seen. All the characters mean something to this film. No one was a filler character. The story may seem stupid in the trailer, but you get to know more in the film and it makes sense. They were no boring scenes, an almost perfect soundtrack and bloody good time. Please go see this film in cinemas while you can because it makes the experience 10x better. The film looks fantastic which is impressive since most of it is CGI. Can't wait for the blu-ray to release and I can't wait for Vol. 3. Don't watch this illegally either. This film deserves your money.",
      "review_date": "2017-06-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It is weaker than the original one, but it's still a good film. This movie has colorful visuals and overall cool characters, however some jokes didn't really land and they felt forced. And the story doesn't really have the same charm andIt is weaker than the original one, but it's still a good film. This movie has colorful visuals and overall cool characters, however some jokes didn't really land and they felt forced. And the story doesn't really have the same charm and novelty that the first one has. Still, it was a good watch and I recommend it.",
      "review_date": "2018-02-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Gee, I didn't expect the ending to be such a tear jerker. A great sequel which delivers. Hilarious but also emotional at times. If you enjoyed the first one, then you will like this one.",
      "review_date": "2017-05-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The movie is enjoyable. It is not as mind-blowing as the first movie. There is a lot more plot with heavy emotion.I admit the baby groot is cute but every time when Groot is on screen, I heard the 'aaw' kinda of sound, that is a bit too much.",
      "review_date": "2017-05-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Very good sequel to the excellent first movie with great performances, awesome action sequences, cool effects and a killer soundtrack. Not quite as good as the first one, the plot is less compelling and sometimes thinly written, but still very good.",
      "review_date": "2017-07-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I'll just say it right now: it's not better than the first movie. I don't know if it's just me, but I think that the traditional, \"Marvel Movie Formula\" containing a mix of humor, action, drama, and predictable story lines is getting way outI'll just say it right now: it's not better than the first movie. I don't know if it's just me, but I think that the traditional, \"Marvel Movie Formula\" containing a mix of humor, action, drama, and predictable story lines is getting way out of hand. Let me show you what I mean. In this movie, it had WAAAAAY too much humor. To the point where I felt like it belonged to an SNL skit. A parody. I don't know about you, but I like my superhero movies to be a little bit on the serious side, maybe even borderline dark. I like my superhero movies to be ironically believable, if translated into the real world. But that's just me. That's one of my bases for judging this movie. The soundtrack is great, but I really do think that the first had the better one. That's the trouble with sequels, it's difficult to surpass the hype of the first (if it was a good movie). The acting is great, although I still do think that Dave Bautista's character is a little too overacted, and a little stiff, to be honest. I don't know if that's how Drax really is or maybe it's just the acting; but even if it's the former, it's still a little too off for me. Cinematography wise, it's good. It's a Marvel film so expect a ton of amazing visuals and CGI. Overall, I gave this movie a 7/10 because the movie is good! And anyone who watches this movie will probably tell you it's great! But it's just that the jokes were a little too often this time. I don't like that. And that's the major reason why I'm giving this a 7. Other than that, it's a solid Marvel film that's maybe on the list of the ones that are not too memorable.",
      "review_date": "2017-05-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What a blast! Not as good as the first film, but it still was a great time. The story was very interesting and fun. I also liked that they focused more on the characters and fleshed them out and less of the over the top action, which thereWhat a blast! Not as good as the first film, but it still was a great time. The story was very interesting and fun. I also liked that they focused more on the characters and fleshed them out and less of the over the top action, which there still is. I also thought this one was funnier than the first one. Everyone again does a fantastic job bringing these characters to life and the scene stealers are no doubt baby groot and Drax. Kurt Russell also does a great job portraying his character \"Ego\". Overall fun watch go see it in theaters.",
      "review_date": "2017-05-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the few movies where I found the second one better then the first. Good humor and visually stunning overall. One of the few recent Marvel movies that I have enjoyed.",
      "review_date": "2017-05-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Will the price increase to save the galaxy for the second time?The inaugural chapter of the most irreverent galactic mercenaries from Marvel was a gigantic turning point in the path set by superhero movies. \"Guardians of the Galaxy\" was oneWill the price increase to save the galaxy for the second time?The inaugural chapter of the most irreverent galactic mercenaries from Marvel was a gigantic turning point in the path set by superhero movies. \"Guardians of the Galaxy\" was one of the best proposals in 2014, a carefree sci-fi film that divorced in full from the general storyline that, by requirement, has to follow regarding the super longed final outcome called \"IW\". The massive success was mainly due to the three true foundations: Story (screenplay), actors (performances) and director (decisions). From all, that colorful and hilarious mix comes the expected \"Vol. 2 \", which remains stable in relation to the first one and satisfies the enormous expectation that was on the shoulders of the guardians.If the creative outbursts of the writer seemed eccentric in the first film by virtue of the composition of apparently nothing correlated tones and genres, in this one, James Gunn is fully unleashed from any impediment in a story of living planets, hybrids between deities and humans and allusions to Mary Poppins. The director preserves his characteristic flame innovating and relating exotic formulas even in the opening.Here, the triad of elements, that were as original as refreshing in the first one, are strengthened, getting the same heart with a similar wrapper, it's really a continuation, not a clone. The most important pillar is the story, the plot around which the movie will have to be meant. Before it was about setting up a dysfunctional family, now, it's about being a dysfunctional family. With a general structure established, its writer, who is also a director, chooses to explore and clarify the past of his pieces, since due to its dazzling introduction was possibly a wide and amusing deepening of its roots. In addition, this study is applied to the introduction of new Guardians: Mantis, Yondu, and Nebula, finding in them a new breath to irreverence of the core stars. Likewise, within that sea of fabulous inclusions, the scriptwriters insinuate and strengthen what they have been announcing for some time: Independent of the appearances in future movies, the story of the Guardians will have three films, nothing more, nothing less.It happens with very few motion pictures, \"Guardians\" is in that strange but thankful section. Even though humans will always get swept up in visuals, James Gun's film, like its predecessor presents an authentic, nostalgic and a maddening musical compendium from 70s/80s, hits enhancing the scenes with regard to the seen ones in the universe. While \"Mr. Blue Sky\" provides the best and most monumental opening for a Marvel movie,\"The Chain\" by Fleetwood Mac orchestrates one of the most mind-blowing sequences that Phase 3 has been able to set up, to this mix of yesteryear, we can add it a few songs that are right on target in the dramatic moments, which also make way for the best of Marvel. Do you want an appetizer? See the teaser trailer. Another extra? See the official trailer. But in case you are still overcome by doubts, another one? Delight yourself with the opening sequence. The pictures are sickeningly sweet like a visit to a candy shop, prevailing and vigorous like the guilty pleasure of entering the shop. The range of colors is phenomenal, and its application boosts greatly that feeling, moreover, the way to sort the components in the scene is beautiful; a harmony vis-à-vis with each character. However, they episodically fail in the well-known \"more is less\" proverb, even thought Ego's planet is paradisiacal, the screen is crowded of pigments and dizzying gadgets for the spectator, tarnishing the beauty of photography. It's worth highlighting the remarkable work in the editing room, that in addition to vivify scenes, produce mind-boggling IMAX and 3D screenings.And Gunn keeps on to inscribe rules for upcoming superhero movie directors. The filmmaker concludes his feature film, his work, his son, his beloved in an intimate and melancholy way, producing a breath of hope and affliction at the same time, something that, at first glance, doesn't fit into the atmosphere of the story, but that after following the crazy adventures of our guardians for two hours feels phenomenally effective. A smile and a goodbye hurt more than hundreds of blows and Gunn has shown (also) to know how to handle it. He's a peculiar director, that has pros and cons like any other man—but more pros—, the priority for music, the character design, the importance of comedy and drama, the tidiness imposed on frames and a few hazards crossing their minds. It seems Marvel will continue at the service of the demands and ideas of this talented man and his squad of characters, demonstrating in this installment more of everything, duplicating what we liked about the first one, but giving it personality to a film as fun as tear-producing simultaneously.",
      "review_date": "2017-08-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"Guardians of the Galaxy Vol. 2\" was a great movie, interesting, and especially very, but very funny, the characters and the story was funny, and the comic scenes, action, and post-credit scenes were magnificent, One of my favorites, and one\"Guardians of the Galaxy Vol. 2\" was a great movie, interesting, and especially very, but very funny, the characters and the story was funny, and the comic scenes, action, and post-credit scenes were magnificent, One of my favorites, and one of the favorites of the public.",
      "review_date": "2017-05-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie was good. A bit of a down step from Volume One, but at least it had a nearly perfect soundtrack to it. Like I said, it was good but had more potential and was rather disappointing.",
      "review_date": "2017-11-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is pure fun. The humor is great, the family dynamic is continued and we see the guardians grow, the action is entertaining and finally an interesting and charismatic villain. The score is awesome and somehow even better than theThis movie is pure fun. The humor is great, the family dynamic is continued and we see the guardians grow, the action is entertaining and finally an interesting and charismatic villain. The score is awesome and somehow even better than the first. The jokes do get a bit old after a while and some of them don't always hit, there are some pretty static plot lines and a lot is happening at once. However the message of the film and what it did is still amazing. It expands the universe even more and the characters and might even bring tears to your eye. Not a perfect film but a really darn good one.",
      "review_date": "2018-12-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The story and action sequences are better in this one than the first one. So if that's one thing you didn't like about the other one, it might be worth it to give this one a chance.",
      "review_date": "2020-01-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I think in tone and cinematography it was a great sequel to the first one. Nothing is the same the second time through, and I think it received some reception that was anticipating the same level of innovation the first one delivered. ThoughI think in tone and cinematography it was a great sequel to the first one. Nothing is the same the second time through, and I think it received some reception that was anticipating the same level of innovation the first one delivered. Though it may not be as inventive, it is still clever in a lot of regards. Really love both of them. I would recommend seeing it in 3D IMAX to get the full visual treatment, but worth the viewing regardless of if you have an IMAX near you.",
      "review_date": "2017-05-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Guardians of the Galaxy Vol. 2 has a sub-par storyline and plot, simple storytelling, and overall, not a whole lot to it compared to other Marvel movies. I won't be comparing this movie to the first one much because I hardly have anyGuardians of the Galaxy Vol. 2 has a sub-par storyline and plot, simple storytelling, and overall, not a whole lot to it compared to other Marvel movies. I won't be comparing this movie to the first one much because I hardly have any recollection of the events that took place. Characters: The acting is nothing special, but the characters are just okay. Drax is probably one of the best parts, as he is funny in a weird way. But there are parts where they attempt to make him say meaningful dialogue that just comes across as sort of awkward because the entire movie sets him up to be a near clueless, unmannerly beast, then attempts to make him deliver good insight on decisions towards the end. It's like if the Hulk gave a heart-warming, poetic, lovely speech at the end of The Avengers; it wouldn't be terrible and go to waste, but it seems out of place and out of character. The other characters are okay, and a lot of them hardly do anything besides Chris Pratt.Plot: The story is basic, though not completely bland. I spotted the \"twist\" right from the beginning, and even makes me wonder if it was supposed to be a huge twist (probably not). One problem with the whole movie is that the Guardians spend the majority of the movie split up (Groot and Rocket with Yondu, and Drax, Starlord, and Gonorrhea, or whatever Zoe Saldana's name is in this). So they never really live up to their name in this movie. In fact, the whole plot is centered on one of the characters stealing something in a job they were doing, which is very un-Guardian-like. I get that they're not supposed to be taken super seriously as heroes, but at least let them work together and keep the chemistry they had in the first one.Humor: I saw this movie with a bunch of friends and a pretty filled theater. My experience was that you either laughed a lot, or only got a few chuckles here and there. A lot of the humor is kind of absurd and just a kind of \"oh, ok. I guess I could laugh at that.\"Effects: The effects are pretty well done except for a few scenes here and there where they were a bit poor, but considering the amount of work that must have been put in, it was still well done.Overall, Guardians of the Galaxy Vol. 2 is nothing to get too hyped about, but is definitely worth a watch. It's entertaining enough to compensate for the simple storyline and characters (except for Yondu) and enough action to hold you over. If you liked the first one, I guess you'd like this one. It did have a good ending, however.",
      "review_date": "2017-05-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Сразу скажу, что мне эта часть понравилась больше, чем прошлая.1.Сюжет: в 1 части он был неинтересный и скучный. В этой же части за ним интересно наблюдать, да, местами предсказуем, но главное то, что интересен.2. Юмор: стал взрослее иСразу скажу, что мне эта часть понравилась больше, чем прошлая.1.Сюжет: в 1 части он был неинтересный и скучный. В этой же части за ним интересно наблюдать, да, местами предсказуем, но главное то, что интересен.2. Юмор: стал взрослее и пошлее, что намного больше хорошо, чем плохо, ведь шутки стали действительно смешными, я смеялся. Немного плохо это из-за того, что порой происходит перебор и перед нами предстают шутки про пенисы и какахи. В целом же, юмор вывозить большую часть картины, он прекрасен.3. Картинка: Яркая, цветастая, красивая. Это идёт как должное, ведь при таком бюджете создатели обязаны сделать отличные эффекты.4. Музыка: опять же, понравилась больше, чем в прошлом фильме. Сами композиции, да и то, как они вплетены в действие - это слушается и выглядит прекрасно.Итог: В разы, разы, разочки лучше vol.1, так что бегите в кино и смотрите в 3D!",
      "review_date": "2017-05-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's not better than the first one but it's still a worthy sequel full of laughs and action (Sorry for my English, I'm Spanish trying to learn the language. :/ )",
      "review_date": "2017-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Guardians of the Galaxy Vol.2 brings in a lot of enjoyment.The humor and the action sequences are on point! I do have problem the pacing/editing errors in this movie but that's just me. Even though it's not as great compared to Vol.1, butGuardians of the Galaxy Vol.2 brings in a lot of enjoyment.The humor and the action sequences are on point! I do have problem the pacing/editing errors in this movie but that's just me. Even though it's not as great compared to Vol.1, but it's still a damn entertaining movie. I'll give this movie a B+.",
      "review_date": "2017-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "NO SPOILERS REVIEW!Funnier than the first, a less compelling climax, but a much more emotional ending. This movie is full of content for Marvel fans, and constantly hilarious. Very different than the first, so hard to compare, but it is excellent.",
      "review_date": "2017-05-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nGuardians of the Galaxy Vol 2 that builds upon the first movie, but not how a typical Marvel sequel  or any action adventure sequel does it. Instead James Gunn decides to build upon the views emotion by diving deeper into each of the characters past and present emotions. The audience gets to find out what makes each character tick. Whether it is Peter Quill and his Father issues or Nebula and Gamora having sister issues or even probably one of the more emotional at least for me was Rocket and Yondu bond that is created with this film. Usually in sequels directors like to go bolder with their action and make even bigger explosions, but with this the action takes a slight backseat compared to great dialogue. Don't get me wrong the action is great all of around from the opening sequence to the end the action was fantastic, but it's the dialogue from each character that makes me feel their pain throughout the whole movie. Not only is the dialogue and action fantastic in the movie but also the mixtape which James Gunn created is fantastic as well. Each song fit so well into each scene, and I find me self going back to replay all the songs because it is so catchy. James Gunn use of color also makes this film beautiful with different variations of color. Some people feel that Marvel films are ugly when they discuss color but this film can have no argument. The use of color on each of the planets and especially the last scene blew me away. Now some spoilers here the creation of Ego the living planet was awesome the detail that was given to that planet had me blown away. Now even more spoilers that I want to talk about quickly, one of them being the Sovereign people. I thought they were a nice touch to move the  plot along at times. I liked who they were used and the technology that they had to try and defeat the Guardians. I believe that they will have a much bigger role in Vol 3 no doubt. Ego, Peters fathers was probably one of the best villains in the MCU because he was actually a real human being, which people can relate to rather than a monster but also because he had an emotional story with Peter. Kurt Russles performance was out of this world as always. The only negative I can say which really isn't a negative at all was the humor. At one or two times during the film I found myself saying \"eh I wish they didn't put that joke I never there\" but I wouldn't care because I still laughed at it so really I do t even consider that a big negative but it was something to say. So would I reccomend this movie? Absolutely, for me personal I know this is a bold statement but this is my favorite Marvel Movie right now. When comparing this to the first one I have a hard time picking a favorite because I feel like the information you learn from the second one elevates the first movie. I won't spoiler any of that here it's better to experience on your own but, I truly had a fun time with this movie it's my favorite and I will say as of now it is better than the first. The way the use family and emotion to capture the character and make views relate to each character is fantastic.  And probably one of my favorite things about this movie was that James Gunn had freedom to do whatever he wants, this movie had no connections to movie the whole MCU story closer to Thanos and I was 100% fine with that.I would give this film 10/10",
      "review_date": "2017-05-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Guardians of the Galaxy Vol. 2 is fun and enjoyable experience.  Unfortunately, it's not a particularly great movie.  If you begin watching with a relaxed attitude (\"I want to be entertained for 2+ hours\"), you're in for a treat.  If you wereGuardians of the Galaxy Vol. 2 is fun and enjoyable experience.  Unfortunately, it's not a particularly great movie.  If you begin watching with a relaxed attitude (\"I want to be entertained for 2+ hours\"), you're in for a treat.  If you were hoping for a film of similar quality to the first?  Then prepare yourself for some disappointment.The full cast is back (plus minor characters I was surprised to see again).  I felt the actors did an excellent job, and really put in effort, given the material.  With the frenzy of CGI eye candy; I'm sure they spent most of the filming in front of green screens.  Drax has more screen-time this round, while Rocket isn't quite as prominent.  Groot is a hoot, stealing both your heart and the show.The theme of this movie is \"family and friendship\", but unfortunately it's forcefully overdone.  The film goes to great lengths to emphasize this point, raising a dozen separate subplots to demonstrate complex relationships between characters.  There are lots of social conflicts, dramatic moments, and ultimately new realizations about self.  It's not so complex you won't understand it.  It's just way, way overdone.  Everyone has issues to work out with everyone else, and it gets very tiresome.  Should have been spread out into further sequels (which are inevitable), or toned down.What isn't believable (almost immediately from the start) are the action sequences.  Granted it's sci-fi + comedy + comic book.  I'm a huge fan of all those things.  I'm very willing to suspend my disbelief a whole lot.  But GotG2 is really over-the-top, in a very \"Peter Jackson-ish\" way.  Characters whirl and spin, fly and jump, fall from great heights, get pummeled, eaten, beaten, blasted, stomped, the works.  And they emerge wholly unscathed.  Always.  Every laser dodged, every impact absorbed, every explosion washes over them.And that makes it difficult to care or worry about them.  Sure, there dangers threatening them, bad guys closing in, and threats.  But who cares?  They seem impervious to all harm, can improvise every situation.  After a while, once madcap CGI battle sequence seems the same as the next.I loved the music from the first film.  But can you have too much of a good thing?  The answer is yes.  Prepare for much more 70's and 80's songs (and references) than the film needs.  I'm exaggerating, but it sometimes felt like every scene change started a new song.  We all get it: Peter is from the 80's and loves his mix tapes.  Cool, so do we.  But instead of fun and refreshing, it felt really forcefully inserted this time.Ditto with the comedy.  I loved the humor....but eventually too many wisecracks, one liners, and running jokes, and you'll become numb to them, or start rolling your eyes.  It also felt overdone and forced.The main story was different and had great potential.  But it sure took a looong time to get there.  Our heroes have questions.  Very important questions, and there are mysteries to be solved!  Not to mention they're being chased by some disgruntled former customers.  What do you do?  Leave half your friends behind, while you fly across the galaxy, get a tour of a planet, and sit around patiently hoping for answer.  Why aren't explanations demanded?  Why aren't you concerned about those pals you left behind?  The main villain and plot is ultimately exposed, pretty confusing (what are they actually trying to pull off?), and with the world literally exploding around them, our heroes don't even get a papercut.I enjoyed it.  I'll probably watch it again someday.  But like so many movies, it's overdoing everything in a misguided understanding of its fan-base, and goes too far.  \"Producers:  If you liked \"such-and-such\" from the first movie, just wait!  We do that 10 times as much now!\"I'd rather watch something that's paced, clever, and marginally believable.  But it was fun adventure nevertheless, and worth seeing again.",
      "review_date": "2017-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I felt like I have watched an episode of tv series because you expect this quality plot from a tv series. I've watched vol.1 again before watching this and I liked the first one much more than this. Awkward scenes, weird logic of characters,I felt like I have watched an episode of tv series because you expect this quality plot from a tv series. I've watched vol.1 again before watching this and I liked the first one much more than this. Awkward scenes, weird logic of characters, petty jokes, and the main plot are just not good enough. I would not say it's a bad movie but they surely could do better than this.",
      "review_date": "2017-09-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The first Guardians film became one of my favourite films of the last two decades, so this sequel had an extraordinarily high bar, and James Gunn has delivered an exceptional film in reply. The script is just as fun as the original, withThe first Guardians film became one of my favourite films of the last two decades, so this sequel had an extraordinarily high bar, and James Gunn has delivered an exceptional film in reply. The script is just as fun as the original, with humour and heart, and more than a smattering of bawdy repartee. The cinematography is sumptuous, the storyline is compelling, and the visual design is superb, though the soundtrack is not quite as magnificent as volume one. Pratt is brilliant, and performances are polished throughout, with a special mention to the younger Gunn in particular. If you enjoyed the first film, you will not be disappointed. 8.99/10",
      "review_date": "2017-05-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "First one was fresh, irreverently funny and inventive (7 or 8 rating here).  This is an overlong, formulaic, cliché laden, self indulgent, boring slog!  Marvel doesn't make good movies anymore.  It makes franchise commercials.  When are theFirst one was fresh, irreverently funny and inventive (7 or 8 rating here).  This is an overlong, formulaic, cliché laden, self indulgent, boring slog!  Marvel doesn't make good movies anymore.  It makes franchise commercials.  When are the stupid idiots at the studios in Hollywood going to stop putting out way too long, repetitive, homogenous junk?!  No movie like this should ever under any circumstances be over two hours, but that's the idiotic trend none of the sheep are taking a good look at.Both the voices of Vin Diesel and Bradley Cooper are unrecognizable as they are pitched, not to mention Groot only says one line.  Almost anyone could do these voices yet they are billed as stars, as is the practice with all animated flicks.  Stupidly.  The marketing morons believe the marquee value draws business, but not a single extra ticket is sold because of any star voices and actually all it does is take the audience out of the story knowing who's behind the cartoons.",
      "review_date": "2017-05-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nIt is vital when giving **** to DC films (cause they have been rubbish) that one also apply the same standard to any Marvel endeavors. When we do apply the same standards, it is rather sad that Guardians of the Galaxy Vol 2 is a rubbish mediocre plotless mess that tarnishes the brilliance of the first one. In a few months time, the wool will be pulled from the fanboys eyes and they will realise they have seen a dud. The biggest problem with this film is that it is overly generic and lacking any real plot. 1) Let me tell you that this film doesn't really have a plot until maybe end of the middle section. The film is so poor that it often signposts what the characters are going to do next, becasue they literally have nothing driving the plot. 2) Action is rubbish in this film. The film literally has the worst generic action scenes with Drax the Destroyer having all his action scenes in the beginning. If you thought the generic battle scenes in Suicide Squad was bad, then Vol 2 tops that by having spaceships and energy tentacles as the main threat - honestly so fricking boring. 3) The jokes are pretty hit and miss. Whereas in the first one they had all these clever well crafted jokes, Vol 2 feels like something Amy Schumer stole. The film is so unfunny that the characters do most of the laughing for you. The film force feeds you a joke every two minutes expecting that what you paid for, except, most of it is dry and you would need to have a brain of a 9 year old to enjoy it.4) Dialogue is pretty much signposting. Characters will randomly tell you their backstory or what they feel at different points with little context. Whats worse is that it adds literally nothing to their characters (that we didn't know before). For example, *SPOILER* the main villain tells StarLord he put cancer in his mum for no reason whatsoever, all to drive that vengenance element. 5) The music is average in Vol.2 and like Suicide Squad, they just put a random track every 5 minutes like an overdrawn music video. Most of the music was forgettable as well. 6) The themes of the film are poorly set up. I knew there was going to be a father-son relationship and was looking forward to it. However, all of these themes are jammed in at the end and there is little reason why anyone should care because they never set it up properly. 7) The characterizations of the heroes are inconsistent. In one scene where Gamora falls off, StarLord just stands there and watches her fall despite the fact she is his lover and he had those rocket shoes. Gunn deliberately did that so that Nebula can save her (to fufill that sister arc). This is poor writing and just makes all the thing set up redundant. The good things with the film is the cinematography and acting. Colours are vibrant, and the actors are working to their best of their script. However, this doesn't detract the mediocrity of everything else wrong with this film. If you like seeing a long Marvel commerical, then Guardians of the Galaxy vol 2 will be your bread and butter. However, this is by far one of the most boring and poorly written film thus far this year.",
      "review_date": "2017-05-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe movie is just one running gag to another, but the charm from the 1st movie carries it to it's wonderful frantic conclusion. Make no mistake about this; GotG2 is fanservice for fans of GotG1. Beyond that, it serves nearly nothing to the overarching story arc of the Marvel movies to this point. Other than the mention of Adam Warlock during the end credits, this was the explanation of just who Peter Quill's dad is and brings us no closer to Infinity wars. In truth vol 2 is here because there was a first movie that had lose threads. If the first one had more conclusive information...vol 2 would not have existed.It was great though, nearly as good as the first one, but lacked the warmth of that movie. I mean this via character development and the physical world on screen. Nearly everything about the 1st one popped, two was a bit darker in tone and visuals. Acting for some here were great (Yondu, Rocket and to a minor degree Drax) while some not so much (Nebula, Gamora, and the depiction of Groot). Karen Gillan can do well with whatever she's given, but all the direction they gave her in this movie was \"vomit anger with every word.\" There is no depth beyond ME ANGRY AT WORLD!! Gamora is the same, but change anger with simmering apathy and underdeveloped affection. Groot had few funny moments and I know these movies are quasi-aware of themselves, but really did we need a car window decal moment for him? Did we need a moment where Tazerface  states that they can't kill him because he's too \"adorable?\" I would recommend to people going to see this not to view the movie as the next movie in the marvel movie series leading to the infinity war; you'll be disappointed. Go into this move instead as the second part of the Guardians of the Galaxy mini story arc within the Marvel Cinematic universe. In jokes are aplenty as well as resolutions for the prior movie.",
      "review_date": "2017-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is all style over substance - the plot is extremely thin, but there's a lot of flashy colours, pretty good music, and some passable jokes. The intro sequence with the monster acts as a metaphor for the whole film, in fact.",
      "review_date": "2017-05-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie works hard at being better and more clever than the first, often it is as much as it isn't, and at times, the humor feels forced, but not out of place. The antagonist feels like he is for sure classic disney formula, plays the goodThis movie works hard at being better and more clever than the first, often it is as much as it isn't, and at times, the humor feels forced, but not out of place. The antagonist feels like he is for sure classic disney formula, plays the good guy than turns bad, so sad.  But the ending is so strong and brings the film to a dramatic, emotional and telling conclusion before the film has a chance to overkill itself.  If i had to pick between the two movies I would go with the first, because the characters feel more natural and there is better flow from scene to scene.",
      "review_date": "2017-05-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "James Gunn, Chris Pratt, Zoe Saldana and co. return to the deepest reaches of space to bring us \"Guardians Of The Galaxy Vol. 2,\" a worthwhile sequel that may world-build and crack wise to a definite fault, but, still - a worthwhile sequel itJames Gunn, Chris Pratt, Zoe Saldana and co. return to the deepest reaches of space to bring us \"Guardians Of The Galaxy Vol. 2,\" a worthwhile sequel that may world-build and crack wise to a definite fault, but, still - a worthwhile sequel it remains. The eye-catching visuals and infectiously entertaining set pieces will undoubtedly entertain, but as things unfurl on the narrative front, the more you may or may not start to realize just how flimsy things are this time around. Still though, there's enough charm and character in this particular piece to power through some of the slower, more aimless portions of the story at hand. Indeed, it definitely does not feature as clean and clear of a narrative as its predecessor, but this \"Guardians Of The Galaxy\" sequel ultimately *just* lives up to the standards set by the Marvel brand.",
      "review_date": "2017-05-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Hamstrung by plot inconsistencies, action sequences that drag, and an overabundance of characters, \"Guardians of the Galaxy Vol. 2\" doesn't scale the high tunes of \"Vol. 1\", although it is undoubtedly just as entertaining and fun.",
      "review_date": "2017-09-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Not as bad as some of the review made it out to be but it is not as good as the first one. I wish that studios and publishers would stop making trailers that spoil some of the best parts of the movie and this one is not an exception to that.Not as bad as some of the review made it out to be but it is not as good as the first one. I wish that studios and publishers would stop making trailers that spoil some of the best parts of the movie and this one is not an exception to that.The main story is about Star-lord and his father and it is OK. There are several sub-plots and they are decent but one of them was really pointless and mostly annoying except maybe as a reason to introduce another character and only as a hint in the end credits.The visuals are great. The characters are what they were in the first and the new characters are interesting.Worth a watch if you liked the first but better on Blu-ray or DVD.",
      "review_date": "2017-05-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Haters will hate.  This was a dumb fun movie that I watched a few times.  Is it as good as the first one?  Well, sort of.  If you enjoyed the first one then you will love this one.  If you expected much more then you will be disappointing.Haters will hate.  This was a dumb fun movie that I watched a few times.  Is it as good as the first one?  Well, sort of.  If you enjoyed the first one then you will love this one.  If you expected much more then you will be disappointing.  Overall, a good movie.",
      "review_date": "2017-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The gang is definitely back, although more of the same is taken a little too far as the wit and charm that made the first film so fantastic is extended to virtually every minute of its sequel, which makes it feel a little stale at certainThe gang is definitely back, although more of the same is taken a little too far as the wit and charm that made the first film so fantastic is extended to virtually every minute of its sequel, which makes it feel a little stale at certain points as some jokes fall flat and the candy colored visuals can make viewing a little hard to discern at times. However, solid character development, the undeniable chemistry of the main cast, it's now signature 80's tone and an ending that admittedly packs a punch make Vol. 2 an enjoyable addition to the MCU canon.",
      "review_date": "2017-05-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was a funny movie that lacked intriguing plot. The comedic scenes throughout this movie made it enjoyable to all ages. I am surprised and disappointed that Marvel did not incorporate the Infinity Stone into the plot (to set up theThis was a funny movie that lacked intriguing plot. The comedic scenes throughout this movie made it enjoyable to all ages. I am surprised and disappointed that Marvel did not incorporate the Infinity Stone into the plot (to set up the Guardians' role in Infinity Wars. Introducing the new villain in the credits felt out-of-place to me.I would rate this movie a 7.4. I could not round it up to an 8 due to the boring plot sequences. I also felt like they did not enhance Chris Pratt's character AT ALL. I feel like Zoe Saldana and Dave Bautista (surprising as it is) carried the movie. I would recommend this movie to everyone, including non-Marvel fans. I do not feel like you had to have seen the first GOTG to understand this one. I think the movie was good, but not as good as the first GOTG.",
      "review_date": "2017-05-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A fun sequel that had more heart than I was originally expecting going in to the theater.  The main theme of the movie is about family, those that are family by blood and those that are gained through comradery.  Drax was hilarious as theA fun sequel that had more heart than I was originally expecting going in to the theater.  The main theme of the movie is about family, those that are family by blood and those that are gained through comradery.  Drax was hilarious as the trailers made him out to be, and the rest of the guardians banter was on par with the first film. Without giving away spoilers, I found the villain in this way more fleshed our in this film as opposed to Guardians 1.  My favorite villains are always the conflicted ones that think they are doing things for the better good. The movie did feel a little convoluted at times with all the overarching plots, but It didn’t hinder my overall experience.  I was a fan of the first film and was just as happy the second time around.",
      "review_date": "2017-05-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "While Guardians of the Galaxy Vol 2 lacked the surprise from the original, it did not lack any of it's humor or action. It was fun and the fact that it still holds up to the original is amazing. Of course, it is not flawless. It has plotWhile Guardians of the Galaxy Vol 2 lacked the surprise from the original, it did not lack any of it's humor or action. It was fun and the fact that it still holds up to the original is amazing. Of course, it is not flawless. It has plot holes and some not so great moments. But in the end - this is an entertaining and surprisingly character driven movie and it is one of my favorite movies of 2017.",
      "review_date": "2017-06-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nIf you look at Gaurdians 1, which is a solid 9 if not 10 movie. Gaurdians 2 is almost that, but like... It's like if you asked for pancakes and got waffles. You still love waffles but you're upset you didn't get pancakes. The humour was perfectly in sync with the series so far and I am more than happy with that. There are a lot of times where I see Drax becoming my spirit animal. The villain, well, I saw it coming from a mile away. It explains a lot about how Star Lord survives the 1st movie I guess and where his nickname came from. I do like the concept of the villain however, taking down a god is a huuuuge deal. However now Star Lord has no plot armour for the third film. Maybe. Great effects, rocket racoon is an **** groot is cute. 8/10 would watch again on netflix.",
      "review_date": "2017-06-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "GOTG 2 was a great film. Hilarious throughout, memorable characters (Baby Groot, unforgettable and soo funny XD) and a deeper look into their pasts was needed, as the first GOTG lacked in that field. Special effects were outstanding, bothGOTG 2 was a great film. Hilarious throughout, memorable characters (Baby Groot, unforgettable and soo funny XD) and a deeper look into their pasts was needed, as the first GOTG lacked in that field. Special effects were outstanding, both Rocket and Groot flawlessly smooth, and all the action sequences were beautifully crafted as well. Good, not great plotline, and some could argue it focused too much on the humour and less on developing the story, but IMO the balance was right. Gunn certainly delivered a worthy sequel to the brilliant first instalment. Definitely worth your ticket money.",
      "review_date": "2017-06-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Volume 2? More like Sophomore Slump. The genuine heart and humor that made the first one so refreshing has been replaced with weirdly casual violence, rampant cruelty, flippant misogyny, and off-putting \"jokes.\" This is a movie for teenageVolume 2? More like Sophomore Slump. The genuine heart and humor that made the first one so refreshing has been replaced with weirdly casual violence, rampant cruelty, flippant misogyny, and off-putting \"jokes.\" This is a movie for teenage boys who can't tell the difference between glib and glitz, between innocence and immaturity. The overbearing  \"family friendly\" corporate sheen imposed on top of the cultural rot (Aw, adorable baby tree that you can purchase for $9.99!!!) just makes he whole enterprise feel even more cynical and depressing. Watching this movie, I felt like I was at one of those high-pressure sales pitches where suckers get promised free vacations but end up being sold worthless time-shares in the swamps of Florida. I might be willing to forgive this films' soulless nature if it was at least entertaining and funny, but it's not. The jokes land with a cringe-inducing thud as the cast alternates between desperation and obvious boredom. The story is... honestly, not sure because I barely remember it. Let's just say it's quite an achievement for a plot to be both monotonous and nonsensical. Aesthetically, this is by far the best looking Disney-Marvel film to date, which isn't saying much. The special effects are cartoony but still impressive, and the cinematography transcends the normal network-TV blandness that has became a hallmark of the MCU. Still, I would have traded the improved production values for a memorable story or at least one or two solid jokes. Save your time and spend the 2.5 hours listening to a classic rock radio station while staring at a lava lamp.",
      "review_date": "2017-05-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I thought this was amazing!! It's the sequel I wanted!! There was a lot of character back story which the first lacked. This is totally worth seeing and people giving it 0's and below average scores most likely haven't seen it or are DCI thought this was amazing!! It's the sequel I wanted!! There was a lot of character back story which the first lacked. This is totally worth seeing and people giving it 0's and below average scores most likely haven't seen it or are DC $%#@riders. Now not to stir that pot but I can't remember when DC made a movie even half as good as this Marvel Studios is AMAZING!!",
      "review_date": "2017-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It is not even close to as good as the first movie.  If your only gauge of movie quality is special effects then you would like this one better.  But what made the first movie great exists only sporadically in this sequel.  The interaction ofIt is not even close to as good as the first movie.  If your only gauge of movie quality is special effects then you would like this one better.  But what made the first movie great exists only sporadically in this sequel.  The interaction of the Guardians and their banter was the heart of the first movie and there isn't as much of it here, largely because for a big chunk of the film, the group is not together.  There are two plot lines about family that are pretty corny and both involve lots of effects.  The movie is too long at over 2 hours.  There are new and different bad guys to deal with, one which you learn about in depth, one group you know very little about and thus far, are not that interesting.  You get a nice cameo from Sylvester Stallone that looks like it could end up in a spin off movie at the end.  Things end abruptly on a high note that is a little too contrived.  But there are good things too.  Quill and Gamora's relationship develops.  A returning character gets to right a previous mistake. Quill finds out about his father and about who raised him like a son, the latter of which is quite touching.  Rocket continues to be an amusing jerk.   Drax is amusingly unaware.   Baby Groot is very cute in several scenes, including the beginning titles.  Awesome Mixtape Vol. 2 contains a number of great songs, but not all.  Still it is cool to see 70s music be the main soundtrack.  I truly loved the first GotG;  I liked this one,  I wanted to love it.  It is very hard for lightening to strike twice in the same place.  I would give this a 6 1/2 if I could, but my sentiments for the first one will bump it up to the 7.",
      "review_date": "2017-05-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Weak plot, with a poorly executed villain really disappointment this potentially excellent sequel.Certainly well peppered with funny moments and jokes, but the overall story falls short.  Entertaining, but only with significant amounts ofWeak plot, with a poorly executed villain really disappointment this potentially excellent sequel.Certainly well peppered with funny moments and jokes, but the overall story falls short.  Entertaining, but only with significant amounts of suspension of disbelief.",
      "review_date": "2017-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe film was always going to have a hard time following the original and i feel they did a good job with this one. It could have been better however. My main issue with the film is how little it contributes to the overarching story the MCU is trying to tell.The first film was very important as it was centred around one of the infinity stones, while this film certainly had high stakes it didn't really contribute anything (outside of Starlord maybe having powers now) to the MCU. This unfortunately makes it a movie you could easily skip in the lead up to infinity war.Now this can be considered good or bad based on your comedic tastes but i found the film quite goofy in places, yes these films are known for their humor and it's one of the many reasons the MCU is ahead of the DC films but this film in particular lays it on thick in some places. Particularly with the scenes involving Groot and Rocket. I personally found the film funny but others may view as a bit too much.The action in the film is entertaining and finds time to add splashes of comedy whenever it can. Again, good or bad depending on your taste. The story also manages to have a few emotional moments for the characters that land well although i doubt any tears will be shed in the cinemas.In the end i would recommend this film to fans of the MCU but if you haven't seen the first guardians then I'd recommend skipping this or watching the first one first (it's bloody good).",
      "review_date": "2017-05-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI have serious problems with te second act and the insistence of fighting all the time with those annoying remote controlled ships but the end is truly amazing and the Yondu part of the story was a really cool addition.",
      "review_date": "2017-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Those of a certain young age will probably enjoy Guardians more than others. The penis and scatological humor wears thin and overall, the writing is juvenile. One cares little for the characters. Kurt Russell is utterly wasted in aThose of a certain young age will probably enjoy Guardians more than others. The penis and scatological humor wears thin and overall, the writing is juvenile. One cares little for the characters. Kurt Russell is utterly wasted in a one-dimensional role which had great potential. If not for the charisma of Chris Pratt, it would be a lot worse.",
      "review_date": "2017-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Short Verdict: It is slightly poorer in every aspect compared to the excellent first Guardians of the Galaxy film (GOTG1). See my review.>Related Media: There is GOTG1 and the comics from a few decades ago.\n>\nWhat’s it like? FollowingThe Short Verdict: It is slightly poorer in every aspect compared to the excellent first Guardians of the Galaxy film (GOTG1). See my review.>Related Media: There is GOTG1 and the comics from a few decades ago.>What’s it like? Following the events in GOTG1, the Guardians had become sought-after soldiers of fortune. However, on one of these missions, Rocket (the racoon) stole from their client and the team were thus pursued by their client. The team was then saved by a being that is very powerful and has a big secret. >The film is slightly poorer in every aspect when compared to the GOTG1.>Cons:>1. The first scene has the team perform a task given by their client. The over-the-top action becomes emblematic of the rest of the film. There were lots of flashy actions but nothing really new; funny, but not refreshingly so. The film needs to be shorter and sharper.>2. It doesn’t make sense that the client mentioned above would require the help of the Guardians considering that they have powerful ships. Many parts of the film do not make sense.>3. In many scenes, many characters explain their backgrounds with long speeches that were too long (and therefore dull) and too grammatically correct. Considering that they are aliens who would not have spoken English, it really seemed out of place. In other films, aliens are usually portrayed with them giving short comments with slightly poor grammar/syntax.>4. The long speeches above rather highlighted that Chris Pratt is not a good actor. Sorry. GOTG1 was able to hide this by being quick with the editing and being slap-sticky on the comedic parts, so viewers miss this aspect.>5. The economics and the organisational structure of the Ravagers (space pirates) are revealed to be rather un-workable. In GOTG1, many Ravagers ships and personnel were lost but they got an Infinity Stone as payment…  sort of. In GOTG2, they lost even more ships and at this rate they will lose everything by the third film.>6. The cameo by a famous actor draws undue attention to his minor character. This was a bad idea.>7. The songs used here are much less memorable here than in Vol 1.>8. There are five mid-/post- credit scenes but only two good ones. The director needs to know when to cut down.>Pros:>1. The film has many funny parts.>How would the different age groups rate it?Children: ExcellentTeenagers: ExcellentYoung adults: ExcellentMedium age adults: GoodOld adults: Average>4/5 (No half scores) - Good enough to watch it in the cinema.",
      "review_date": "2017-05-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "About as much fun as I've ever had while watching a movie. You know that phrase \"tongue-in-cheek\"? I'm pretty sure it means when you take something with a grain of salt but you press the salt against your cheek with your tongue for a second.About as much fun as I've ever had while watching a movie. You know that phrase \"tongue-in-cheek\"? I'm pretty sure it means when you take something with a grain of salt but you press the salt against your cheek with your tongue for a second. So I think you'll understand why I  think this movie is a little tongue-in-cheek.",
      "review_date": "2017-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Guardians of the Galaxy Volume 2 is a movie made for fans of the comic book genre. It's balls to the wall crazy and amazingly colorful. I loved it! Amazing bad guy, a lot of character progression and cool action. Some of the jokes didn'tGuardians of the Galaxy Volume 2 is a movie made for fans of the comic book genre. It's balls to the wall crazy and amazingly colorful. I loved it! Amazing bad guy, a lot of character progression and cool action. Some of the jokes didn't quite land though (cough pacman cough).I had a good time, go see this movie!",
      "review_date": "2017-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Ladys and gentlmen, penis jokes in GoG! Wow. You thinks it's enough? Nope, they have a second string to bow: parents sex joke.Ok, maybe it's a bit much nibbling at few jokes, but this little bunch of them kinda ruins atmosphere. The filmLadys and gentlmen, penis jokes in GoG! Wow. You thinks it's enough? Nope, they have a second string to bow: parents sex joke.Ok, maybe it's a bit much nibbling at few jokes, but this little bunch of them kinda ruins atmosphere. The film generally is cliche and predictable. Especially when it comes to fights. At the same time heroes, though fulfilled with problems (and that's depreciate their problems), are charmy. So, it's ok. But audience expected something more.",
      "review_date": "2017-05-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The most dysfunctional family of Marvel in a cosmic mission almost to the height of previously. Acid humor, vertiginous action sequences and charming, memorable characters, praticullarly Baby Groot.",
      "review_date": "2017-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "9/10 from me, a must see for the cinema..........................................................................................................................................................................................",
      "review_date": "2017-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Awesome movie, better than the first!  Funnier, more action packed and we got to know characters better (more depth).  Another bonus was getting to watch hunky Star-Lord on the big screen for over two hours. Just like the movie, he has gottenAwesome movie, better than the first!  Funnier, more action packed and we got to know characters better (more depth).  Another bonus was getting to watch hunky Star-Lord on the big screen for over two hours. Just like the movie, he has gotten even better (looking)!  Drax and Rocket are hilarious and Droot so cute!  Definitely a must-see movie!",
      "review_date": "2017-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This year's Guardians of the Galaxy is comical, fun, and just simply enjoyable for people of all ages. It has plenty of colourful characters, an easy-to-follow plot, and a rather touching scene at the end. For a while, fans could forget about Thanos.",
      "review_date": "2017-05-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Guardians Vol 2 has not only jumped close to the top of my favourite superheroes films, but my favourite films of all time! Hilarious and emotional at the same, a good story and excellent effects, Guardians Vol 2 doesn't disappoint. Some ofGuardians Vol 2 has not only jumped close to the top of my favourite superheroes films, but my favourite films of all time! Hilarious and emotional at the same, a good story and excellent effects, Guardians Vol 2 doesn't disappoint. Some of the humour started to become predictable though, however this is a truly excellent movie.",
      "review_date": "2017-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "„Guardians of the Galaxy Vol. 2“ (2017) – 5/10 – or 8/10 if you like the first one, or big superhero movies in generalI stopped watching mainstream superhero movies in 2013 and have mostly avoided them ever since.They offer nothing to me„Guardians of the Galaxy Vol. 2“ (2017) – 5/10 – or 8/10 if you like the first one, or big superhero movies in generalI stopped watching mainstream superhero movies in 2013 and have mostly avoided them ever since.They offer nothing to me personally and I'm honestly surprised at their huge commercial and critical success, given that almost all of them are just more of the same, copying the genre trailblazers such as original „X-Men“ and „Iron Man“.I don’t have the time nor energy to still watch the same thing over and over again after 15 years or so. How many times can you enjoy watching two guys hurl through air, repeatedly punching each other, for example?There are some exceptions to this of course („Logan“) but superheroes nowadays are better off in TV or streaming series such as „Luke Cage“ where the makers get the chance to put freshness and depth on the table.The first „Guardians of the Galaxy“ collected over 770 million dollars from the cinemas in 2014, so the sequel is, of course, very similar. A true-blood superhero movie, just like the grandmother used to make.It’s loud, brash, full of colors and explosions and always ready to gently tease about superhero and sci-fi movies’ tired cliches, without bringing anything to replace them.Yes, the result is full of „energy“ and much „fun“, but if you don’t particularly care about the paper-thin characters or picturebook world they inhabit, it’s difficult to hold interest after 30 minutes or so.And how can one care if there’s never even a slight feeling that any big character is really in danger, no matter how large the explosions and enemy guns! It’s all sound and fury, signifying nothing, as the late great Shakespeare would say.The story is trivial as expected and thus would work better in small doses… but the movie format is much more profitable, so we get about 140 minutes in a row.Nevermind that there’s maybe 90 minutes worth of story here, every self-respecting Hollywood epic must last over two hours. I am Groot!",
      "review_date": "2017-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Feels bad to see the critics score.Very bad to see a \"critics\" rewiev that saids \"Not as good as the first one\".Yes, guardians became even some kind of a \"comedy\",but the creators have said that it will be more funny even then firstFeels bad to see the critics score.Very bad to see a \"critics\" rewiev that saids \"Not as good as the first one\".Yes, guardians became even some kind of a \"comedy\",but the creators have said that it will be more funny even then first movie.Film like the first part is really different from the all Marvel movies cause of it's fun and explosive action.Also here was showed more storie about every main character wich forced us to worry bout them.This is probably one of the best comicsfilm that I've ever seen.(If I've done some mistaces in the text forgive me pls I'm not very good in eng)",
      "review_date": "2017-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great movie! Lived up to my expectations and I loved the original. I think the critics were too hard on it. I'd write more but I don't want to spoil anything.",
      "review_date": "2017-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Another perfectly adequate and totally unmemorable Marvel movie. I give it a slightly better-than-average score because Chris Pratt is a genuinely likable and charismatic lead, but the rest is, not BAD, but nothing you'll remember by the timeAnother perfectly adequate and totally unmemorable Marvel movie. I give it a slightly better-than-average score because Chris Pratt is a genuinely likable and charismatic lead, but the rest is, not BAD, but nothing you'll remember by the time you're in your car driving home.Like all the other comic book movies, the visuals are very slick and there are some amusing quips and inventive set-pieces, but that's the entire appeal right there. The characters all have the gravitas of moody 14-year-olds wrestling with their hormones, there's absolutely zero sense of real drama or tension or emotionally engaging conflict (Kurt Russell does his best but his villain winds up being just another generic Cosmic Blob of Evil that wants to eat the universe... like basically every other Marvel movie), and to the extent there are twists or surprises you'll see them coming from a mile away.But hey, why even bother criticizing a piece of extruded corporate product like this. Disney knows their markets well, so turn off your brain, enjoy the shiny flashing lights, and go tell people it was \"good\" because it made you laugh a couple times and wasn't egregiously awful and what more could anyone possibly ask of a summer blockbuster?",
      "review_date": "2017-05-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I know it's an unpopular opinion (because apparently opinions now range from 'popular' to 'unpopular' now) when I say that I thought 'Guardians of the Galaxy' (2014) was an overrated superhero movie. I just didn't get what was so great aboutI know it's an unpopular opinion (because apparently opinions now range from 'popular' to 'unpopular' now) when I say that I thought 'Guardians of the Galaxy' (2014) was an overrated superhero movie. I just didn't get what was so great about it, the character development was a little lacking, save for Star-Lord, the plot was paper-thin and generic so much so, that it was covered with sprinklings of 70s/80s music and goofy humor to keep it elongated, and the villain was so forgettable, I sometimes struggle to remember his name. I know he was blue and was played by a talented and underrated Lee Pace, but that's all I have. 'Guardians of the Galaxy Vol. 2' is a rather okay sequel that reunites the goofy misfits everybody loved, and takes them on a stranger adventure. Star-Lord (Chris Pratt), Gamora (Zoe Saldana), Drax (Dave Bautista), Rocket (voiced by Bradley Cooper), and now Baby Groot (voiced by Vin Diesel) are back, and they get themselves into trouble when Rocket, so recklessly steals from the Sovereign race, and their leader, Ayesha (Elizabeth Debicki) wants to chase them back for it. It also seems that Gamora has some unfinished business with her deadly sister, Nebula (an over-acting Karen Gillan), who wants to best her sibling in everything she does. The Guardians then find themselves meeting a man who goes by the name Ego (Kurt Russell), and if you've seen the trailers, or read any of the synopsis or kept up to date with the news surrounding this film, you'll know that Ego tells Star-Lord that he is his father. At first, Quill tries to take time to believe this, as everything comes back to him. They also meet one of Ego's assistants named Mantis (Pom Klementieff), who tells the Guardians everything they need to know about Ego, and the strange but wonderful planet that he has created. Yondu (Michael Rooker) is also back, and finds himself in trouble, and teams up with Rocket and Groot to find the rest of the other Guardians. The film does an okay job to further the story of Peter Quill's past, and developing the rivalry/sister relationship between Nebula and Gamora, but its sluggish pacing, wasting the other Guardians like Drax, who by the way, is also named \"The Destroyer\"... very mild spoiler alert, but he does little-to-no destroying in this movie. Bautista is ultimately wasted as being the comic relief of the film, which is odd, because I thought Rocket is supposed to be the funny one, then again, so is Groot (even in baby form), or even the lead character, Star-Lord himself. And that's my next criticism. It's pretty obvious that director James Gunn noticed that everybody loved the first movie due to its use of music, and goofy humor. So, he decided to double on that. There is so much humor coming from all of these characters, that it takes away the tension from the plot, and you cannot help but think that this is their natural state... they don't feel fear or concern, whatever problems arise, they just laugh it off and save the galaxy somehow. The music, which was used quite effectively in the first film, to its credit... unfortunately, there is too much of it. At times, when a scene does not need a song playing, it plays anyway, regardless if it fits the tone of the scene. 'Guardians of the Galaxy Vol. 2' is an underwhelming sequel that even tries to become \"The Empire Strikes Back\" by showcasing the lead character's past, and there's even a scene where the Guardians fly their ship through and asteroid field. Just because you imitate a scene from one of the greatest sequels of all time, doesn't mean yours will be as good either. Kurt Russell is also underused here as well, it seems that this movie lacks any of the superior action we've seen from so many MCU films, just to try and fill in the gaps for character development, and use as many jokes and songs as possible to distract us from its flaws. Kristian Harloff from the YouTube channel SchmoesKnow - who was also underwhelmed - even said \"We don't need a story because everyone's funny!\", that seems like the goal here. I know I maybe in the minority again, but this movie just didn't work for me, maybe for everybody else who wants more songs and jokes... but, I've seen Marvel do better than this. Hopefully, with \"Infinity War\", the Guardians will win me over there...",
      "review_date": "2017-05-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Although I swore never to get excited for another Marvel movie ever again I just can’t help myself when it comes to Guardians of the Galaxy and I certainly wasn’t disappointed this time. Sure I wasn’t exactly blown away, but I wasAlthough I swore never to get excited for another Marvel movie ever again I just can’t help myself when it comes to Guardians of the Galaxy and I certainly wasn’t disappointed this time. Sure I wasn’t exactly blown away, but I was entertained. It’s got all the charm and humour as the first one, the same wonderful characters with some new not so wonderful characters and an average, predictable storyline. It does suffer from the overuse of special effects with one too many scenes that seem to be straight up lifted from a video game but at the same time you’re invested in the story you just start to go along with it, despite how over the top it may become. More importantly you’re rooting for these well written characters that you love from Guardians Vol 1 and now you can just sit back and enjoy the show, so that’s exactly what I did.So to sum up no it’s not as good as Vol 1 but you will indeed enjoy it as much and yes Groot steals the show yet again, surpise surpise. Baby Groot is just too adorable to resist. Recommended if you’re a fan of the first Guardians movie. And hats off to Marvel, if they can make us sit through not one but five post credit scenes then we’re all well and truly addicted.",
      "review_date": "2017-05-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This continues to be Marvel's best soap opera til now. It's utterly hilarious and the characters are brilliant and comfortable with their demands. Although the story gets sillier this time, Baby Groot is a masterpiece that deserves all theThis continues to be Marvel's best soap opera til now. It's utterly hilarious and the characters are brilliant and comfortable with their demands. Although the story gets sillier this time, Baby Groot is a masterpiece that deserves all the love around the world.",
      "review_date": "2017-05-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Guardians of the Galaxy Vol 2 is a fun ride with a lot of heart. James Gunn frames the action is unique way, captures scale of the spectacle better than almost any Marvel offering to date and provides laughs that measure up as well. I loved it.",
      "review_date": "2017-05-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "See the movie people. You'll get over the sequel inferiority complex if you just open up and enjoy yourselves. There's no such thing as a perfect sequel unless you're a highly paid critic with a stick up your ass. Guardians continues to be aSee the movie people. You'll get over the sequel inferiority complex if you just open up and enjoy yourselves. There's no such thing as a perfect sequel unless you're a highly paid critic with a stick up your ass. Guardians continues to be a special niche in the growing Marvel cinematic universe. Sure, you may walk out of the theatre shaking your head if you're that type of person, but my answer to that is \"I am Groot\"",
      "review_date": "2017-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I'm happy to say that this sequel to 2014's suprise smash hit, as well as one of my absolute favorite films that year, delivers a sequel that met my expectations, but didn't exceed the original, which is perfectly alright with me, sinceI'm happy to say that this sequel to 2014's suprise smash hit, as well as one of my absolute favorite films that year, delivers a sequel that met my expectations, but didn't exceed the original, which is perfectly alright with me, since that's pretty much what I went in expecting anyway. The returning cast is  as charming and likable as they were before, the action is eye-popping, hilarious often times, and just plain entertaining from start to finish, and even the emotional card is played towards the film's end, not unlike the original, which also had its fair share of touching moments. Overall, while it may come up a bit short of the original in terms of freshness and overall originality, for being a sequel, it certainly manages to get the job done more than great, which is enough for me!",
      "review_date": "2017-05-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "what a great movie. i enjoyed it even the slow parts where great.  lots of funny scenes and lines it in.  stay after the credits for a few shorts.  next one should be very interesting with the new aliens in it these ones you do not want towhat a great movie. i enjoyed it even the slow parts where great.  lots of funny scenes and lines it in.  stay after the credits for a few shorts.  next one should be very interesting with the new aliens in it these ones you do not want to get mad at you:)",
      "review_date": "2017-05-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Guardians of the Galaxy Vol. 2 is a great follow up to the 2014 original. It brings back the same memorable group of characters on a brand new space adventure filled with lots of funny moments and awesome action/special effects. This storyGuardians of the Galaxy Vol. 2 is a great follow up to the 2014 original. It brings back the same memorable group of characters on a brand new space adventure filled with lots of funny moments and awesome action/special effects. This story dives deeper into Peter Quill's past and further explores the relationships between the various characters, really making it feel like a more personal story. And of course the overall aesthetic of the movie is fantastic just like the first, with iconic music choices and colourful visuals making this a gorgeous movie to both watch and listen to. If you liked the style of the first movie, then you'll dig this one too.",
      "review_date": "2017-05-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "MASTERPIECE! Everything about this movie, while can be argued \"cliche\", did it perfectly with spades! The Action was Perfect, The Music was Perfect, The Comedy was The Highlight of Movie! The Characters had more fleshing out, and made youMASTERPIECE! Everything about this movie, while can be argued \"cliche\", did it perfectly with spades! The Action was Perfect, The Music was Perfect, The Comedy was The Highlight of Movie! The Characters had more fleshing out, and made you really care for them. **** I Love This Movie!",
      "review_date": "2017-05-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Before going to this film I was a little scared by some reviews it got, some people calling it not \"good as the first one\", forced, and things like that. Now that I've seen it I can tell you FORGET about them! This movie by no means can beBefore going to this film I was a little scared by some reviews it got, some people calling it not \"good as the first one\", forced, and things like that. Now that I've seen it I can tell you FORGET about them! This movie by no means can be compared to the first one because it's very DIFFERENT. It doesn't try to remake things the 1st had, it makes unique new things with that awesome GotG flavor we all love from the 1st one. Yes, some jokes don't land, and yes some \"dramatic scenes\" feel out of place. But no film is perfect & this film did original and unique things that expand every character of the roster. You get to know them a lot more, and by that, you end up loving them EVEN more that you already did (assuming you liked the 1st one). The message it brings at the end it's reinforced by all that happened in the 1st entry, and by things that happened in this one, the movie it's so good. Overall, do not compare this film with the 1st one because you are making a mistake. Take this film as a new entry, a new experience, a new breathing to the franchise. The movie it's a great ride! Give it a try!",
      "review_date": "2017-05-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "at the beginnig , I thought the jokes would be boring , but after the second half of this movie I laught myself to death. In guardians of the galaxy 2 gets every charackter  his screantime to explore the typ of the type of the Charackters.",
      "review_date": "2017-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Solid movie as a whole but its definitely a disappointment when compared to the first Guardians a masterpiece in my book. The story is slightly convoluted with them trying to introduce 5 or 6 new characters while trying to keep the focus onSolid movie as a whole but its definitely a disappointment when compared to the first Guardians a masterpiece in my book. The story is slightly convoluted with them trying to introduce 5 or 6 new characters while trying to keep the focus on Peter Quill and his father's arc which effectively pushes great characters like Drax, Yondu, Rocket, Groot and Gamora to the sidelines. The end of the movie is where the money is where even casual MCU fans will have a hard time not staying invested in the film. Comedy is good but it also feels forced at times as its used to cover an underwhelming and painfully convenient plot. Still, good movie overall but it just could have been better.",
      "review_date": "2017-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "'Guardians of the Galaxy Vol. 2' pales in comparison to its predecessor, but it retains much of the humor, colorful visuals, and great retro songs that made the first one so charming.",
      "review_date": "2017-05-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Very enjoyable movie. Fun and funny, filled with action, with some emotional moments as well. My one complaint was that some of the over-the-top irreverent humor which the first movie was known for felt kinda forced in this one. There wereVery enjoyable movie. Fun and funny, filled with action, with some emotional moments as well. My one complaint was that some of the over-the-top irreverent humor which the first movie was known for felt kinda forced in this one. There were some jokes that really didn't fit, and others that weren't even funny. But this is just a minor complaint. The movie overall was great.",
      "review_date": "2017-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Absolutely hilarious. This movie is a fantastic comedy, action movie and hits hard at home. It gets all the emotions right, it's pacing is fantastic. The movie introduces lots of different plot points that all have purpose and all get solvedAbsolutely hilarious. This movie is a fantastic comedy, action movie and hits hard at home. It gets all the emotions right, it's pacing is fantastic. The movie introduces lots of different plot points that all have purpose and all get solved at some point in the movie. Something so small in the beginning can have large purpose in the end. Definitely one of my favorite Marvel movies, maybe even my number one favorite. Definitely a must watch.",
      "review_date": "2017-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I AM GROOT!!!O ya, this is exactly you get. Cute baby Groot and actions, why not!!!!So the story took place only a couple of months after first movie. It continues the team's adventures as they unravel the mystery of Peter Quill's trueI AM GROOT!!!O ya, this is exactly you get. Cute baby Groot and actions, why not!!!!So the story took place only a couple of months after first movie. It continues the team's adventures as they unravel the mystery of Peter Quill's true parentage. Literally 60% of the movie is about Peter’s heritage. At this time I want to say Kurt Russel is absolutely amazing in the movie. He is extremely likable, very light-hearted and funny. You believe everything he says. The same can be said for Michael Rooker, who played Yondu, he felt more human in this movie rather than being a dick like the last movie. Everyone else were… good. No one is bad and everyone played their part well.However, the biggest problem with this movie is the writing. At one points all the characters are separated and at one stage the movie seemed to lack direction. It felt like they had a lot of subplots and most of them are going nowhere. They tried to give every character a reason to root them for, which we do, but it is more set up from the previous movie. The only arc I really liked was between Drax and Mantis, because it is more natural (by that I mean the writer tried least hard to make characters interesting). It proves that sometimes less is more. Also I found the joke is way too much. Literally every minute there is a joke. The problem is not the joke itself. Most of them are really smart and funny. The problem is that I feel like sometimes it got in the way of the plot development. There should be some serious moments in between. O and they used the cute factor of baby Groot, way way too much.But on the plus side, the cinematography is absolutely amazing. It is the most beautiful of all the MCU movies. Watching it in IMAX is an absolute pleasure, I imagine if you watch it on D-BOX…. It will be an experience you cannot forget. I love the design of the planets and the aliens. They are more unique than the first movie, even better than the ones in Star Wars and Star Trek. Set designs are gorgeous. Fight scenes were one of the best I have seen in any movie, in terms of space battel that it. In short, very eye candy and there is nothing wrong with it.All the bad things I said about writing is saved with the ending. One of the best ending for any MCU movies. It is so great that made me tear up, not kidding. It tied up all the subplots and made me realized that, yes they are going somewhere (what I meant is that, it saved the movie from the mistake of Age of Ultron). When the “Father and Son” by Cat Stevens started…. O man….. (The mixtapes also not only great, but played an important part in the plot). In the end, Guardians 2 may be as good as one, but it doesn’t matter: all the hearts and fun are there and if it is a bit messy, so what. I enjoyed it.O and stay behind for the post-credit scenes, there are five of them. But not worry, the credit scene is one of the best I have seen in any movies!!!!",
      "review_date": "2017-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Constant fun, great jokes, so many memorable characters, and pure eye-candy. Being a marvel fan there was so much to take in the first time, GotG is known for fitting Easter eggs everywhere. You have to see this twice to notice all the extraConstant fun, great jokes, so many memorable characters, and pure eye-candy. Being a marvel fan there was so much to take in the first time, GotG is known for fitting Easter eggs everywhere. You have to see this twice to notice all the extra subtle awesome-ness. 10/10",
      "review_date": "2017-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Absolutely amazing! This movie takes everything great about the first movie, and improves upon it. Better humor, better action, and better characters. I cannot wait to see the Guardians meet the Avengers.",
      "review_date": "2017-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Visually, this is one of the best films I've seen. The soundtrack in the film is great, as was the case with the first one. All the guardians have great rapport throughout the movie. This film has it all, highly recommend watching it.",
      "review_date": "2017-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Guardians Of The Galaxy Vol. 2 is an exciting, fun, entertaining, enjoyable,joyful and somewhat an interesting film. The new Marvel film is beautiful and colorful with a lot of humor,which many people will not like, some of them do make youGuardians Of The Galaxy Vol. 2 is an exciting, fun, entertaining, enjoyable,joyful and somewhat an interesting film. The new Marvel film is beautiful and colorful with a lot of humor,which many people will not like, some of them do make you laugh,other times it didn't but even if it did'nt it can still make you chuckle. The Characters are well realised and most of them are as fun and entertaining but also this time interesting and has emotional layer, they were given enough screentime in order to fell inlove with them again, wel you can easily love them.Their dialogue and interactions are just on point and shows that Guardians are just fun to watch.There is emotional stakes here, if you consider it.The Story is convuluted and kind a bit stupid, this is the problem that most will talk about, plot is there after the 45 minute mark where things kick-off, while the 45 minutes before that was jokes no plot, just jokes but hey it's entertaining as hell. Action is great and funny to watch. Villain is wasted again, no suprises there, but unlike other Marvel Villains, excluding Loki, he has some potential to be a great one but it was wasted by a lot of expositsions. The ending was emotional enough but the dialogue ruins, just show don't tell. Music is genuinley good this time, instead of remaking a new theme for the Guardians, they kept the original one that is used for the original, which is good! The OST is magnificent and fits to the movie's plotGuardians Of The Galaxy Vol. 2 is good, better than the first?, well some of it improves from the first, especially the effects and color grading, the scale and emotional connection to the characters but it still has the same problems as the first, the plot and the villain. GoTG Vol. 2 is a good sequel to it's predecessor which a good thing. It's much better than Thor: The dark World, Iron Man 2 but for me is much better than Ant-Man, Doctor Strange and the first Thor.",
      "review_date": "2017-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Guardians Of The Galaxy Vol.2 is an underwhelming entry due to the bar set by the first one but thoroughly enjoyable. James Gunn continues to impress with his dazzling visuals and making great use of the characters. The Story takes aGuardians Of The Galaxy Vol.2 is an underwhelming entry due to the bar set by the first one but thoroughly enjoyable. James Gunn continues to impress with his dazzling visuals and making great use of the characters. The Story takes a different direction which is emotional and pays off well at the 3rd act. The 1st hour of the movie is choppy and suffers from pacing issues.",
      "review_date": "2017-05-08",
      "source": "metacritic"
    }
  ],
  "num_reviews": 148
}