{
    "title": "Kazaam",
    "rating": 0.0,
    "release_date": "1996-07-17",
    "num_reviews": 305,
    "genres": [
        "Comedy",
        "Family",
        "Fantasy",
        "Musical"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "Read my comment.",
            "content": "Shaquille O'Neal delivers an Oscar worthy performance in what might be the most powerful performance of the 90's. All around, it is brilliant. This is a gripping and amazing tale about a genie and his friendship with a lonely child. Acting is purely amazing and the story is beautifully played out like poetry in motion. Honestly, this film goes down as one of the all time greats. Top to bottom, this film is perfectly mastered. Every actor in this film comes through and nails the role perfectly. 11/10Now, imagine the exact opposite of that. Got it? Okay, the truth is...the movie isn't even *that* good. Shaq, what were you thinking?",
            "review_date": "2006-05-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This movie changed my life.",
            "content": "This movie really helped me find myself. Before I saw this movie, I wandered this streets crying often knowing my life had no purpose. Until one faithful day, I found myself in Chuckey Cheese on my usual drinking binge. When to my surprise, the robotic Chucky Cheese and gang started singing \"Happy Birthday\" which sounds exactly like \"You're the Best\" (a song from Karate Kid) after an eleven day drink binge. I saw a bright light, which many witnesses argue was a fire cause from the bad wiring in the Chucky Cheese band, pointing at the prize shelf. I took the remaining money I found on a passed out man outside the Chucky Cheese and went to play the Wack-A-Mole game that changed my life. I furiously pounded the moles while I was in the middle of the Chucky Cheese. The children screamed and cried as I fulfilled my destiny; if I could see those children again, I would hug them, for I would not have been able to win those two magical tickets. I went over to thank Chucky which soon after I blacked out, passing out on stage I woke up a few days later in my one room apartment with the tape super-glued to my face. In my excitement I quickly tore it from my skin and shoved it into my VCR. The next hour and thirty-six minutes (I got the special edition) of my life would be the happiest any man could ask for. I was so blown away by the amazing special effects that I was overcame and called an ambulance to pick me up after the movie ended. Shaq play a stunning and realistic role as a rapping Genie. I often found myself dancing in room to his tunes while my neighbor was yelling hurtful words and threats through the wall. After awhile though, I passed out on my floor. Awaking from another blackout, I caught glimpses of Shaq giving candy to all the children. I laughed, I cried. Could this movie be as brilliant as I realized. The ambulance pulled up and I told the paramedics to grab my belly; I was immediately tared. After a few weeks in intensive care, I returned to my house how I left it. Kazaam has given me a new out look on life and hopefully it will help shape your views.",
            "review_date": "2006-11-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Shaq should stay OUT of music and acting!!!",
            "content": "What a pathetic movie.I won't waste much time commenting about it.  I'm still trying to get back the couple hours I wasted on it.Let me leave it simply with - Shaq has NO BUSINESS being an actor or singer. He is utterly without talent at both discplines.  It's a crying shame that substantially more talented people waste away in community theatres and karaoke bars while Shaq uses his name as a basketball player to undeservedly get cast in movies and cut CDs.Much of the failure of this movie was the pathetic no-talent that is Shaq.",
            "review_date": "2003-06-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Deserves more credit.",
            "content": "The movie and plot is dumb, but the concept is a fun idea (who doesn't like genies?). It could have been a much more entertaining movie, however.",
            "review_date": "2020-05-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nostalgia overload",
            "content": "The critics were way too rough on this one. I loved Kazaam as a kid and when I recently rewatched it I can see why.A kids perspective is different from an adult. A kid got a lot of imagination and a good sense of fun. So while this movie is corny and silly from an adults perspective these were exactly the things I loved as a kid.A giant rapping genie, a fun friendship, family, the struggle of a kid growing up in the city and a ridiculous music business villain. I had a blast watching this movie over and over again. 90s kids know the truth about Kazaam!",
            "review_date": "2019-04-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "WTF, man?",
            "content": "Dude. This movie was AWESOME. I loved when he dunked it. Alright, i'm drinking, but so what? So, apparently I have to fill 10 lines of text. That's terrible. Good thing I got half a bottle of wine left. So, yeah, Kazaam was amazing. Shaq was a genie. Who better to play the part? No one, that's who. Yizzeah. So, anyway, Max lives in Compton and is sick of getting shot at so he hires this basketball player to be his genie. Said basketball player is terrible at free-throws. Anyway, this guy is always..like..turning crap into something else and making some other crap fall from the sky. Then he (and the Miami Heat) beat the Washington Wizards 105-86 in the opening game of their Eastern-Conference-semifinals playoff series, but then he lost to Steve Nash in the MVP voting. So, the moral is, genies are better than wizards.",
            "review_date": "2006-09-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Please make it stop.",
            "content": "This is the worst film I have ever seen.I was watching this film with some friends and after 40 minutes we had enough. The plot was bad and there wasn't a single likeable character.I could get more entertainment watching static. I gave this movie a 1 only because the scale didn't go into negative numbers. Avoid this movie at all costs.",
            "review_date": "2001-01-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "it wasn't that bad",
            "content": "Kazaam is an alright movie and isn't that bad. It doesn't deserve to be rated so low and in the bottom 100. It was decent. The movie starts out a little shaky but it gets better. The acting in the movie is kinda bad and the plots are very predictable but it was still okay. I'll admit that Shaq's acting is bad and he should stick to rapping and the NBA, the other characters acting weren't that awful.The movie has a nice fell to it while watching, the scenes and designs are cool. One of my favorite parts in the movie is when Max is talking to Kazaam and Kazaam tells him that he has 3 wishes, so Max wishes that it would rain burgers and fries. That part was funny and cool. I also liked the ending in the movie.Id recommend this movie",
            "review_date": "2008-10-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I feel enlightened after watching this movie (in the good way, not the naked after a party way).",
            "content": "I remember watching this film as a semi-retarded adolescent and not enjoying it due to the vague underlying themes that flew over my head at such a young age. However, last week, passing this movie in the Blockbuster Mega-Discount bin, I decided to re-watch it and see if my opinion has changed.(I tried to keep this review as spoiler free as possible, without losing some of the movie's flair. I feel I have succeeded) I must say, spending that 2.50$ plus tax was the greatest decision of my pitiful and shameful life. In the 5 days I have had the VHS, I have watched this film at least 15 times, I unfortunately lost track after blacking out naked on my carpet on the 2nd day. This movie goes down in history as one of the 5 greatest drama sequels of all time, and If I had to put a rating on it's comedy factor, I would give it 4 thumbs way up. I found myself laughing throughout the entire film, calling my friends and family to repeat jokes I had heard. The casting in this film is absolutely excellent, with Shaq leading the performance like a Frenchman in a yogurt factory. The story revolves around a genie named Shaq, and a small Italian boy named Max. Upon finding a magic stereo player, Max discovers a small black genie living inside, and offers to give him a place to sleep and eat for a week. Ironically, this is where the theme of pedophilia comes into play, with multiple scenes of Max and Shaq showering together and close up shots of them smiling. I hate to repeat myself, but as a child, I understood nothing about this subject. However, as a fleshy man, I see it in a new and blinding light.There are several moments throughout the play where the development of the characters and storyline drag, but the rest of the film certainly make up for it. The end is griping, and keeps me on the edge of my seat every time I watch it. At the same time, I cry when the credits roll and long to see Shaq's black face one more time (of course, I will rewind the movie at this point and watch it over again).On a final note, this movie is almost perfect in every aspect. This is the epitome of what a Hollywood blockbuster should be. The casting is amazing, the special effects are mind-blowingly realistic and stunning, the fully orchestrated soundtrack fits the mood perfectly and amplifies the experience. If I were to put a grade on this, I would have to give it a 9/10, losing a point because of the slight nudity (i'm not the biggest fan, but I won't say no!). But, this is not a movie to be rated, it is a movie to be bought, watched, and enjoyed. Do yourself a big favor and buy this movie, your taste buds will thank you.",
            "review_date": "2006-09-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "2 Stars? Come ON!!",
            "content": "To any kid who grew up in the 90s this movie was excellent! I show it to my students now that I am a teacher and they love it still. It's a kids movie for goodness sake. The story is good, it is entertaining and funny so for a kids movie it's dang great! People giving this low ratings either didn't grow up in the 90s, had a really sucky childhood, or are just hating on the greatness that is Kazaam!",
            "review_date": "2017-06-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "what the hell?",
            "content": "This is one of the most god-awful movies ever.  Shaq better just stick to basketball.  This movie took away apart of my life I will never have back. I will make fun of this movie until I die, and then some. It is so horrible it is not even funny.  MST3000 would have a blast with this one.",
            "review_date": "2001-05-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Holy Raining M&Ms and Candy Bars! It's Kazaam!",
            "content": "Yeah, I remember seeing this in the theaters when I was nine years old. A bunch of other kids and their parents and families were there to see the movie, also; lots of us like Shaq, because he's been in other movies, too; \"Space Jam\" is one of them, and I thought that was a great movie also (Shaq gets sucked down into the golf hole! Genius!) There is one scene that I love so much. It's the scene (in a warehouse, I believe) where Max's first wish to Kazaam was that he wished that he could have junk food \"from here to the sky!\" Well, he got his wish - an icky burger had fallen to the ground! Max said to Kazaam, \"That's it?\" And suddenly, the whole place was raining candy bars, PowerBars (at least that's what they look like in fast mode), M&Ms (you can see the bags after it stops raining), the works! That got me laughing! You all must see \"Kazaam\" for yourselves and suddenly, y'all will indulge in junk food the next time y'all are bored!",
            "review_date": "2006-02-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Once upon a time...",
            "content": "For the life me, now that I'm 19 (almost 20) I have no idea why I watched it as much as I did. My dad actually laughed when I asked to get it. For one, it stars Shaquille O'Neal, which should have been a clue. At the time, I thought that was neat, and made me watch it more. I loved this movie while I was young. I use to pray for the genie, so I could make it rain candy. The most hilarious part, was it was an illegal copy, and at the bottom of the screen, it would scroll \"This is an illegal copy. If you have bought this from a store, you have broken the law.\" Anyway, as I got older, I saw how stupid the story line is, and how bad the acting is. However, it was part of my childhood, and you can't ignore your childhood. Make fun of me all you want for once liking it, but remember, I was seven at the time.",
            "review_date": "2008-03-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "KAZAAM *1/2 OF ****",
            "content": "Shaquille O' Neal plays a rapping genie helping a kid(his name....who cares) to re-unite with his work~a~holic father. OK, this movie is deeply flawed, mild in entertainment, but with all of these rappers and basketball stars (Omarion in \"You Got Served, Darius Miles in \"The Perfect Score) in movies playing rappers and basketball stars, at least Shaq attempts to be a genie,and TRIES to stretch his acting ability by being something he's not. Besides that, the kid's wishes are implausible, seeing as candy bars and burgers rain (through a roof somehow) and come down perfect in order and unsmushed. I can't see which audience this is targeting. Kids won't be awed and 12+ will be laughing for all of the wrong reasons.\nVERDICT: *1/2 of **** Not Recommended",
            "review_date": "2004-04-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Once again, I was misled by others' negative revues...",
            "content": "Based on the opinions of some (not all) of the other reviewers, I expected this movie to be horrible.  I was quite pleasantly surprised that -- while Shaq will probably never win a Golden Globe award -- it was a very entertaining and heart-warming story.  Unlike some others, I had no trouble watching it to the end, and I was not sorry that I had allocated that portion of my lifespan to viewing it. \nIn short, the movie was about a 5,000-year-old genie stuck in a boom box who befriends the lonely 12-year-old boy who finds him and whose only (real) wish is for his parents to get back together.If you take it for the light-hearted comedy for which it was intended and not expect \"classic cinema\", then IMO, it is well worth a look.I give it 6 out of 10.",
            "review_date": "2003-02-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the many hidden gems",
            "content": "This movie contains one of the most underrated actors of all time in Shaq. Not to mention the fact that he enters the movie rapping in typical Shaq fashion and he raps multiple times in the movie. This performance should give Shaq a Oscar if not a Grammy",
            "review_date": "2020-05-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A perfect example of a movie that I loved as a child, hate as an adult...",
            "content": "Well, adolescent really(19). Like Howard the Duck, Kazaam was a movie I loved as a child but looking back on it I was shocked at how low my taste buds were as a kid. Granted, there are some funny moments specifically the ones with the flying toasts and the bicycle race. And it is not the worst movie of 1996, Ed and especially Bio Dome are worse. However, the special effects are really quite substandard, and the rest of the production values are of direct to video quality and shoddy ones at that. The story is predictable with only a few worthwhile scenes to favour, the sight gags suffer from poor comic timing and the script is childish and simplistic. The characters I really dislike here, the kid is annoying, the villain is one of the lamest I have seen in a long time while Shaquille O'Neal's Genie with his awful rapping(then again I dislike rap intensely, and that is the least problematic of his performance) grated on me fast. The acting doesn't fare much better either, while the direction is literally non-existent and the soundtrack is only tolerable if on mute. This is of course my opinion, disagree all you want, I guess I just didn't like it. 2/10 Bethany Cox",
            "review_date": "2011-06-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Teacher Review",
            "content": "I watched this movie with my class, and most of my students enjoyed it. Some even said it was a 10/10. Some of my students thought this was a remake of Aladdin. I thought this was an extremely underrated movie. Shaq did a good job acting, and there isn't another movie that is like it. Most of my students approved of this movie greatly. They liked the rapping!",
            "review_date": "2018-10-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Who...dare... to rate ME?! (1 star?)",
            "content": "Twenty years later this movie is still a great movie!! I thought eh, what the heck... let's watch this cinematic adventure of Shaq as a genie after such a long time. It's true, EXTREMELY CORNY. But, isn't that what 90s nostalgia is all about? The junkfood scene, the Shaq in the \"magical\" shower scene...and of course... the coveted cassette... the WE GENIE rap. Ahhh...brings me back to a time of fruit by the foot, frotopia drinks and N64. If you're looking for a spectacular plot, a moving speech, tears.... you may want to look elsewhere. HOWEVER. If you are wanting a brief adventure back to 96' with a little chuckle here and there, enjoy KAZAAM! I am forcing my kids to watch this movie repeatedly until they admit it really is an awesome movie....",
            "review_date": "2016-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Come on, folks, it wasn't THAT bad...",
            "content": "Okay, Shaq can't act. But he doesn't need to; he's mostly there to be big and imposing. It's hardly a good movie, but it's an entertaining kidflick...",
            "review_date": "1999-01-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "At least Shaq has rapping to fall back on...",
            "content": "i was given the book version of Kazaam for my 8th birthday, and people always say the book versions are always better than the movie, but this time they were wrong. At least with the movie it's over soon.The acting in this is terrible, which i expected from a film with Shaq who plays a magical rapping genie that comes out of an old ghetto blaster (which there was probably a good reason he was trapped in there). The kid in the film that plays Max is whiny and a terrible actor. He's bullied by neighborhood kids, which i don't blame them because he's a little douche bag.The story is just plain stupid and extremely cliché. About a boy who's father is always working and never around who finds a new friend who makes his life better and eventually helps him reconnect with his father.Even at 8 years old i thought this was a stupid idea. It's a surprise any of the people whom worked on this film had careers after wards because it's an embarrassment and should have never been made. i could ramble on even more about how this movie sucks, but you should already know just by reading the plot.",
            "review_date": "2006-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Shaq stars as a rapping genie.",
            "content": "This is, by far, without a doubt, the best movie that has ever been produced on film. Shaq's awesomely realistic portrayal of a rapping genie is the best thing to be displayed on screen in decades, rivaling performances of Al Pacino, Kerry Grant, Jack Nicholson, Marlon Brando, and all of the other great actors of our time. Now Shaquille O'Neal shall be added to that list. This uniquely told tale of a boy who finds a whimsical boom box wherein lies a magical genie is one hundred percent genius. This film came at a time when good writing and good casting was scarce in Hollywood; but this film renews hope in a new generation of audiences, and renews hope in a culture. >From the musical score to the costume design, this film is purely golden; the 'Citizen Kane' of a new generation.",
            "review_date": "2004-07-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "best movie",
            "content": "I need to so some research in order to find out what film topped this on the Oscar list, but regardless a tragedy has occurred. Most likely the best performance of Shaq's career, this film changed the way I looked at life. You cannot give up on your dreams. Especially if you have a giant African-American wizard at your side. If I had to describe this movie in one word it would be \"revolutionary\". The character that portrayed Max will surely go on to bigger and better things unless he decides directing is a better career move. I think the greatest compliment this movie could be given is that it is the Aladdin of live action movies without as good of script.thanks, George",
            "review_date": "2007-02-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Shaq's egomania OOZES off of this movie; a notorious bad kids movie, and not as campy as one would wish",
            "content": "Yes, Kazaam is one of those horribly bad movies that almost reminds one of everything that is wrong with not just kids movies, but with humanity. Here we have Shaq as a rapping genie- yes, a RAPPING genie- where he does everything from making bad puns to dressing in ridiculous outfits, all ending in him in a Christ-like pose with lots of light surrounding him. So, yeah, expect really cheesy bits, including the first wish being a lot of junk food falling down from the sky (and, regrettably, not knocking out the two main characters, particularly the kid). What might not be expected is that a film with a kid and Shaquille O'Neill would be so incredibly schmaltzy! The main plot of the film involves this kid, played in that all-too-typical and annoying-kid fashion by the great-grandson of Frank Capra (where in which the kid is yelling out his dialog angrily), who comes upon a genie who's been trapped in a boom-box. Then \"hiarity ensues\" as the kid makes the Shaq-genie his quasi-slave as he waits on his last two wishes as he tries to make amends with his shady-gang-type absentee father.This really sappy, contrived son and father story would be bad enough, as there are certain lines that have been uttered in a million other movies (i.e. the \"two chances in life\" speech from father to son). But it's Shaquille O'Neill who is both the reason to watch the film (ironically), and the obvious sinking crux of it all. His plot line involves him, when not getting the over-talky treatment from Capra, to rap within the dialog and also start off his blossoming recording career. On top of this, he also kicks ass and takes names with the main bad guys who want him back in the boom-box. So is there a camp factor to the movie? Up to a point, but this is even squashed by all of the mushy scenes and 'heart-felt' moments that have really no business with the rest of the material. One might ask if the people making the movie, who were obviously doing it at the behest of the popularity of a BASKETBALL player who wanted to go on the Michael Jordan acting bandwagon, if it would be anywhere near decently entertaining or convincing. I'd hope that they too knew they were just getting paid. But I'd hope even more that they felt at least a little guilty afterwords for feeding the Shaq-machine.So, if you want to have a fun night of Shaq as genie-turned-rapper-turned-wisecracker, all the more fun to you. Hell, it might even be interesting to have a Shaq movie night with this and his other critically acclaimed effort Steel. But if you're hoping to keep a few brain cells, stay away from what is very likely the worst flick of 1996, and a candidate among many others for worst of the 90's.",
            "review_date": "2006-06-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "People who hate on this must just hate life :D",
            "content": "Quite simply I want to say that this shouldn't be in the bottom 100 movies as voted by the users of IMDb. It is a great heart warming movie, perfect for the whole family. There are many many many other movies out there so much worse than this movie. It made me laugh and that's exactly what a good comedy should do.This movie was hilarious! A rapping genie who knows kung fu and lives in a boom box played by none other than Shaquille O'Neal, what more could you want in a comedy?! I mean sure some of it was cringe worthy and it's not exactly Oscar material, but overall it was a great laugh. Anyone who wants to dis this movie needs to lighten up a little. Shaq has the greatest sense of humor!",
            "review_date": "2010-07-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Reel Look: Kazaam",
            "content": "\"Let's green egg and ham it.\" I was only seven years old when Kazaam was released into theaters, starring Shaquille O'Neal as the eponymous enchanter. And to this day I am truly grateful that my parents never took me to see this magical mishap of a motion picture two decades later. Back in the 90s when Shaq was at the height (no pun intended) of his professional career with the NBA, Los Angels Lakers and doing several Reebok or Pepsi commercials, his film appearances, especially as a main character, proved to be disastrous. The tag line on the VHS and DVD cover or what have you reads: \"He's a rappin' genie-with-an-attitude...and he's ready for slam-dunk fun!\" I as the viewer greatly disapproved. Even the Los Angeles Daily News didn't know what to say, so they just slapped \"FUN!\" on the cover in big capitalized yellow letters. Nonetheless, I would taken away the 'N'. With a budget of $20 million, only earning back $18.9 million in return, it also obtained a six percent rating on Rotten Tomatoes based on thirty-three reviews, and a twenty-four out of one hundred on Metacritic. So why did this family fantasy flop so hard? Let's take a look.The film promptly opens on a swinging wrecking ball knocking down a dilapidated building in New York City; a perfect metaphor. A final swing knocks Kazaam's lamp in slow motion onto a boombox that just happens to be there as we hear him screaming. And how fitting to see director Paul M. Glaser's (David Starsky from the Starsky & Hutch TV show) name appearing over the sound of breaking pottery. That sound effect alone sums up the rest of the movie indefinitely. We then meet Max Connor (Francis Capra), a twelve-year-old kid on the run from a local gang of bullies, who chase him into the said building being demolished. Max accidentally kicks the boombox and unknowingly awakens the 5,000 year-old genie just as the bullies find him. Kazaam scares them away with his so-called rapping. Max later goes home to Alice (Ally Walker). She is a single Mom of whom she and her son don't exactly see eye to eye, especially since she's seeing a fireman named Travis (John Costelloe, of whom was an actual FDNY firefighter in real life and played Jim \"Johnny Cakes\" Witowski on The Sopranos). Kazaam later explains to the troubled youth, of whom at first wants nothing to do with him, that he can grant him three wishes. From telling Max that he doesn't \"believe in fairy tales\" to even taking a shower in front of Max in his own bedroom singing an almost unrecognizable rendition of Stayin' Alive...its just a mess.Eventually the tough Max warms up to Kazaam and starts to believe what he says when he causes mountains of junk food to rain down from the heavens. He also realizes that he owns the towering turban-wearing thaumaturge until he makes his last two wishes. Of course what Max really wants is to get to know his estranged father (James Acheson), of whom left him when he was two. He sets out to find him, only to discover that he is a musical talent producer of which the cause of his success is specializing in unauthorized music. Kazaam forgets about Max once the boy's father takes a liking to him as a new possible rap talent as he tries his hand at a music career at his nightclub. But the sleazy villainous club owner Malik (Marshell Manesh), wants Kazaam for his own, and it is only the final wish, from the heart, that Max wishes that his Dad would be given a second chance at life as Kazaam personally deals with the Malik and his cronies. Hereafter, Max then accepts Travis as a new father figure.Kazaam is really one of those good/bad movies that emerged in the 90s. It was good because it was and still is a fairly harmless family film, but bad because it has over time gained attention since its release for its absurd concept and Shaquille O'Neal's performance, making it a critical and financial failure. It also caused Paul M. Glaser to never direct another film since due to negative reviews on his work. Roger Ebert gave the film 1.5 stars, writing: \"Shaq has already proved he can act (in Blue Chips, the 1994 movie about college basketball). Here he shows he can be likable in a children's movie. What he does not show is good judgment in his choice of material. [...] the filmmakers didn't care to extend themselves beyond the obvious commercial possibilities of their first dim idea.\" In a 2012 interview with GQ magazine, O'Neal said, \"I was a medium-level juvenile delinquent from Newark who always dreamed about doing a movie. Someone said, 'Hey, here's $7 million, come in and do this genie movie.' What am I going to say, no? So I did it.\" Though more suited in appearing as a film cameo, Shaq's last leading role would be in the following year as John Henry Irons/Steel in the critically-acclaimed box office bomb 'Steel', nominated for a Razzie Award for Worst Actor.If Kazaam is wishful thinking in the power to begin anew, than it should have stayed bottled up and lost for one-thousand and one nights deep beneath the sands of the Arabian desert. The film is innocuous but its demise is that it is solely based on and crafted from a mix of genre clichés. Kazaam lacks imaginative stamina and, compared with Shaq's larger-than-life charisma, the film does not know what it wants to be either due to stifled, routine filmmaking and terrible rapping. Nowadays the movie is just a guilty pleasure for millennials to riff or poke fun at. My wish for you is that you never buy or rent Kazaam and see this jolly black giant on your television screen anytime soon.",
            "review_date": "2016-12-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This moved me.. to the next theater",
            "content": "i def. would NOT consider this a movie.. in fact i'd like to forget that this \"thing\" was ever created, but it's hard to. This \"movie\" was more of a torture device, kind of like the chinese water torture and such. there are 2 good things about this \"movie\" though.. the kid's snaggletooth was hilarious and whenever it's on disney, i turn it on and fall asleep to it.. works better than nyquil.. overall: my wish would be that this disgrace was never ever ever made.",
            "review_date": "2003-09-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An astounding, ground-breaking movie",
            "content": "This movie is very underrated, with betrayal, love, hardships, a gold script with 0 errors and an Oscar worthy performance from Shaq, this movie is very underrated. Had incredible special effects and blood effects, honestly this movie is unbeatable. Now my opponent is the type to stall to wait for the buzzer to go off so he doesn't have to explain anything and he is a liar and cannot be trusted and is not fit to be elected as president of North Korea. Mr. Trump what is your response to this? Well twitter bios I love them, LOVE them. And my bio? The best, UNbeatable. Unlike crooked Hillarys bio, full of lies, no truth, sad. Mrs. Clinton, what is your response to Trump? Saturday morning jumped out of bed And put on my best suit Got in my car and raced like a jet All the way to you Knocked on your door with heart in my hand To ask you a question 'Cause I know that you're an old-fashioned man, yeahCan I have your daughter for the rest of my life? Say yes, say yes 'cause I need to know You say I'll never get your blessing 'til the day I die Tough luck, my friend, but the answer is 'No'Why you gotta be so rude? Don't you know I'm human too? Why you gotta be so rude? I'm gonna marry her anywayMarry that girl Marry her anyway Marry that girl Yeah, no matter what you say Marry that girl And we'll be a family Why you gotta be so RudeI hate to do this, you leave no choice Can't live without her Love me or hate me we will be boys Standing at that altar Or we will run away To another galaxy, you know You know she's in love with me She will go anywhere I goCan I have your daughter for the rest of my life? Say yes, say yes 'cause I need to know You say I'll never get your blessing 'til the day I die Tough luck, my friend, 'cause the answer's still 'No\"Why you gotta be so rude? Don't you know I'm human too? Why you gotta be so rude? I'm gonna marry her anywayMarry that girl Marry her anyway Marry that girl No matter what you say Marry that girl And we'll be a family Why you gotta be so Rude RudeCan I have your daughter for the rest of my life? Say yes, say yes 'cause I need to know You say, I'll never get your blessing 'til the day I die Tough luck, my friend, but 'No' still means 'No'!Why you gotta be so rude? Don't you know I'm human too? Why you gotta be so rude? I'm gonna marry her anywayMarry that girl Marry her anyway Marry that girl No matter what you say Marry that girl And we'll be a family Why you gotta be so Rude Why you gotta be so Rude Why you gotta be so rude?",
            "review_date": "2016-10-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A 7 foot tall man is following a kid around the city offering him treats and wishes... see? We're already at problem #1 with this movie",
            "content": "The other day my girlfriends and I were having our pizza night and looking for movies to watch. Kazaam was on demand and I asked if any the girls had seen it, only one of my friends did and I asked if it really was as bad as everyone says it is. She said she didn't remember since she saw it as a kid so we all decided to go for the bait and see if Kazaam really does deserve one of the worst movies in cinema titles. Oh, yeah, it really does. I could not believe how bad this movie was. Shaq has the acting quality of a wooden shelf, the kid who is supposed to be a hero is actually a brat, the villain of the story looks like a chewed up version of Mario from Super Mario Brothers and the story does not make sense for the child audience it was aimed for. How in the heck is a child supposed to relate to this story of trying to get his pirate music stealing father back with his mother while being stalked by a 7 foot tall grown man offering him free treats and all the presents in the world and OH MY GOD does that not sound so bad?! There are so many things wrong with this movie it drives me insane.A schoolboy named Max is confronted and chased down by a group of bullies through the city of New Bronslin. Max is chased into the abandoned building, where he discovers a magical boom-box and accidentally unleashes the genie inside. The genie, who introduces himself as Kazaam, tells Max that he is now Max's genie. Max returns home to find that his mother is marrying a fireman. It is revealed that his mother lied to him about his real father's whereabouts, and that he is actually located in the city. Max set out to search for his father in the hopes of rekindling some sort of bond between them. He suddenly encounters Kazaam during his travels, who pesters Max into making a wish. Max eventually finds his father, only to learn that he is a musical talent agent who specializes in pirated music. A employee of the nightclub shows interest in Kazaam upon the realization that he is a genie, and hopes to control Kazaam through Max's father.Between the awful acting, the terrible script and the lousy effects, this movie is just plain bad. This is how bad this is, Shaq literally slam dunks the villain to defeat him! If that's not a plug in for his career, I don't know what is. The kid Max has no likable qualities, he has a very loving mother and a possible step father who cares for him, yet he acts like a total jerk because he's not getting his way with not having his dad around who is a criminal no less! Even when his criminal father kicks him out of his life, Max still does everything to save him, sick isn't it? Shaq, I don't know the writers were thinking. Maybe that it's so funny that a giant basketball super star should be a genie and it's a great way to make a quick buck for those sucker parents who's kids are begging to see the film. I don't know how to say this other than just say it, it really is as bad as everyone says it is if not worse. Trust me, don't waste your sanity on this horrible movie, Shaq's acting is enough to make you wish this movie never existed in the first place.1/10",
            "review_date": "2010-06-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "wowwwwwwww",
            "content": "this has got to be the greatest film of all time. Shaq should have won an Oscar for his great acting. The musical score is the best i ever heard in modern cinema. I will be trying to find the DVD movie of this next weekend..i would gladly pay 99.00 bucks to own it on DVD. what i like even most about the film is the attention to detail..even the boombox..awesome..i want to own it. I only wish this movie was five hours long...or at least make at least five sequels..with shaq singing and rapping in all films..what an awesome movie. The wishes he makes in the film were the correct ones. It had a very emotional ending. I think about this movie every day. I believe half the audience in the theatre cried with emotion also. I have been meaning to comment on this film a long time ago..but was filled with too much emotion even to this day to come to grips in writing a review for such a gripping wonderful masterpiece in American cinema.",
            "review_date": "2007-06-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Boom Shaka Laka, Kazaam Scores!",
            "content": "Kazaam is a winning combination of a coming-of-age story, and a slapstick comedy, with pulse-pounding basketball scenes.  Never before has the ghetto been portrayed with such realism, and shaquille O'neal's fearless performance is worthy of the recent oscar buzz.  I make one suggestion to all of you, WISH that you can get tickets to see this masterpiece of the cinema.",
            "review_date": "2002-01-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awful...Pathetic... Well, At Least It Wasn't Disappointing!",
            "content": "Shaq. Francis Capra. What's the worst that can happen when you join together a horrible basketball player and actor, and one of the worst child actors of the 90's? Before you can say \"kazaam,\" you get \"Kazaam,\" a film that goes to show why such crucial elements as, say, actors and dialogue are important to a story. The screenplay is just plain bad, and the acting is even worse. The directing style is...well, I don't know, but it was really, really bad. And then, the film has the mandatory emotionally-controlling segments that have nothing whatsoever to do with the already pointless plot, like the whole divorced father piece. Priceless. Priceless as in so awful it has no price. Cut to the chase, and my sypnosis is this: DO NOT SEE THIS MOVIE!1/5 stars -John Ulmer",
            "review_date": "2003-01-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Well, at least it's not as bad as contracting Ebola.",
            "content": "Reviewing KAZAAM and saying it's a bad movie isn't hard at all--after all, critics at the time it came out fell all over themselves excoriating this film--saying it was among the worst films of the decade! So the fact that I say it's bad or anyone else says it's bad is certainly no surprise. It's like someone talking about WWII--practically no one says that was a GOOD thing, right?! The question I have and no place on IMDb can answer it is \"why did they make this in the first place?!\". After all, it's obvious to anyone who isn't severely brain injured that the film would be horrible. But, movies like ED (a baseball playing chimp), COOL AS ICE (starring the ever-popular Vanilla Ice), TROLL 2 (which doesn't even have any trolls in it), BABY GENIUSES (Einstain-like superhero babies) and PINOCCHIO IN OUTER SPACE (huh!?!) prove that any idea, no matter how dumb, can make it to the big screen! So, the idea of the best basketball player of the time starring as a genie to an obnoxious little brat seems downright 'normal'! The film starts with a kid who is pretty jerky keying the lockers in the hallway of the school. Like the punk from FREE WILLY, this kid is somehow 'misunderstood' (in other words, a total brat) and you know that no matter how selfish and horrible he is, by the end of the film he'll have learned something and grown. Just once, I want to see a punk kid like this end up in prison or or dead by the end of the film! Eventually, while the neighborhood bullies are in the middle of pummeling him, the genie Kazaam (Shaquille O'Neal)is accidentally released and insists on giving the brat three wishes. But, the kid doesn't believe him AND the genie's magic seems a tad rusty.Eventually the brat does realize that Kazaam is for real. However, unlike most kids, he withholds making his wishes so, in the meantime, Kazaam is forced to follow him around everywhere--like his own personal servant. And, according to the cliché, you know that by the end of the film, Max and Kazaam will have become lifelong buddies and a bunch of tears will be shed. Oh, and Max will have come to terms with his absent father and mom's fiancé (I'm gonna gag). Apparently this genie is a bit of a social worker in addition to being a granter of wishes.As for Kazaam, Shaquille speaks in rhyme through much of the movie and even takes a break to rap...very poorly. I'm a middle-aged white guy and I think I could probably rap at least as well! He's an amazing basketball player and I've heard he's a nice guy--but a rapper...no way! As far as his acting goes, he wasn't great but had such a nice personality in the film that it's hard to hate him--even if they made him do a lot of very stupid things.So is the movie as excruciatingly awful as you've probably heard? through the first two-thirds of the movie, I would have said no. Shaquille seemed to try his best with an unlikable kid and a bad script. However, later in the film, the bad becomes horrid--as Kazaam seems too concerned with himself to help the kid when he's really needed. And, out of nowhere, the plot gets really, really weird--as the guy who wants to make Kazaam a rap star(?!?!) turns out to be an evil mobster! And, oddly, this guy seems to accept that Kazaam is a genie with no hesitation! In addition, the last portion of the film consists of people trying to kill Max and his dad. I know that the kid was annoying, but this is supposed to be a kids' film!! What part of 'trying to kill the kid' didn't the writers not understand?!? Then, in an ending that makes this perhaps the worst kids film ending in history, Kazaam becomes god or something and it all was like a drug-induced hallucination! This ending was even dumber and weirder than the one in THE BLACK HOLE...and boy, did it make my brain hurt!! Uggghh--the horrible dialog was just too much to bear!!!Overall, it's a terrible film that is due mostly to writers who were certifiably insane. Yes, folks, with a messed up message, bizarre non-kid friendly material and horrible characters, this is one wretched film. Sadly, given the idea and actors, it's hard to imagine the final product turning out much worse!!By the way, if you want to see a Genie in a modern world film that is GOOD, try the British made for TV film \"Bernard and the Genie\"--a charming and exceptionally well-written film from start to finish.",
            "review_date": "2010-01-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Am I the only one who thought this was actually a good movie?",
            "content": "First off, I will not sit here and say that the movie was perfect. However, I feel like everybody did great in their roles for their character portrayals. Personally, giving the overall movie a rating of 2.6 is a little harsh, don't ya think? It wasn't that bad, but then again I tend to enjoy ALL movies and I only know of a few that was a waste of film! It all depends on the viewer and their perspective of things. Im an artist so naturally I'm a little more open minded when it comes to judging things, but honestly, what did you TRULY expect from this movie? What would YOU have done differently? This is a general question. For me, once you can answer that, then you'll see how ridiculous panning this movie is.lol ^_^",
            "review_date": "2013-10-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Kazaam is a National Treasure!!!",
            "content": "Kazaam is one of the best movies ever made. I hat insult to such an amazing movie that people give it such a bad rating. Shaq as a rapping Genie literally what more could you ask for. What a masterpiece they don't make movies like this anymore. This movie is as 90s as it gets. Shaq gives an Oscar worthy performance. One of the best movies of all time. Watch this you won't be disappointed in this National Treasure of a movie!!!",
            "review_date": "2020-03-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Eh...",
            "content": "Now everybody knows Shaq should stick to basketball. This movie wasn't as horrific as pointed out but I've seen better. A 5,000 year old, rapping, seven-foot genie trapped in a boom box is suddenly awakened by a 12 year old New York boy with nothing better to do. He grants the kid three wishes (all which are not that great) and through it all, a friendship develops. Shaq--or Kazaam-- is discovered at a nightclub, becomes a temporary success, while somehow Max is unhappy with his life. His father is involved in selling bootleg tapes and is involved in some kind of scheme with Malik, the Middle Eastern owner of the club. Max's final wish is for his daddy to have a second-chance. The wish is granted, Shaq is released from that stupid boom box, becomes free, and runs off with Asia-Moon (some woman in the club).",
            "review_date": "2003-05-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If i was doped up this, movie would still be the worst movie ever.",
            "content": "If you are a fan of really bad movies, and you think there funny, you will the great acting of Shaq.  First off putting pro players in movies hardly ever works.  Shaq had to of been the worst actor i have ever seen next to Dennis Rodman who also made a few bad movies. Well any way this movie is also bad due to the hideous kid. I would give this a zero but that is impossible.",
            "review_date": "2003-08-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very fun, but also meaningful",
            "content": "I liked this movie a lot. It's really stupid in a lot of ways, but it does a lot of things right and very well. It's fun, but also meaningful.",
            "review_date": "2020-07-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Couldn't even make it all the way",
            "content": "Despite all the negative reviews and the many obvious and facetious 10/10 reviews, I decided to give this a go one day when it was on tv and after about 30 minutes or so, I still had no idea what I was watching. This was made in the 90s and that's where this should've stayed.Apparently a genie bottle is knocked against a portable stereo, breaks open and Kazaam decides to transfer himself into this stereo.A little later a smart-mouthed allegedly \"troubled\" teen, Max, is being chased through an abandoned building by backwards cap-wearing teens. He falls through an upper floor and onto the stereo releasing Kazaam. Shaq pops out, starts rapping terribly for some reason and continually pesters Max about taking his wishes.Kazaam and our little smart-mouth, (because the world can't get enough movies with back-chatting brats), set about locating and reuniting with his real father. I got so far as Kazaam following Max to a nightclub. Kazaam with his genie stereo strapped around his waist starts rapping along with the obligatory half-naked black women, all lazily rapping and repeatedly pointing at the audience. Again it's the 90s. Max's father is an unscrupulous music producer or some such and wants nothing to do with his son. The nightclub owner somehow realises Kazaam is a rapping genie and wants to sign him, and therefore control him. The next morning, Kazaam ends up in Max's bedroom singing off key in a one man personal shower with an oversized loofah and at that moment I called it quits.Who the hell writes and funds this junk? It's clear that most people will debase themselves when the right amount of money is offered, whether they actually need it or not and Shaq is no exception. He can't act, never could, but there was no shortage of studios throwing money at him to put him in bad movies and act like an idiot. Don't waste your time.",
            "review_date": "2019-10-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Make This Crap Disappear.",
            "content": "Kazaam (1996): Dir: Paul M. Glaser / Cast: Shaquille O'Neal, Francis Capra, Ally Walker, James Acheson, Marshall Manesh: Ridiculous and violent film aimed at younger viewers. Francis Capra plays a boy angry about the split between his parents. He lives with his mother since his father pirates music. Upon escaping from bullies in an abandon building he unleashes Kazaam the genie from a boom box. Like all genies he can grant three wishes but unfortunately none of them involve the ending of this film arrive sooner. Very lame and extremely violent towards the end. Director Paul M. Glaser manages to turn the film into a mess without the assistance of three wishes. Shaquille O'Neal looks pitiful in that stupid clown outfit, and Capra does exactly as expected and arrives right where viewers will likely predict he will be by the film's end. Ally Walker is wasted as Capra's mother who is discouraged with regards to his father but loves her son, etc. His father is one of these guys who just doesn't know any better. Marshall Manesh plays a nightclub owner who shows interest in Kazaam as oppose to a superior script. The only area of compliment are perhaps the special effects, otherwise the film serves only as a showcase for O'Neal in a bunch of stupid action sequences and looking foolish in the process. This film should be kazammed into a campfire to see if it burns into something magical. Score: 1 / 10",
            "review_date": "2015-08-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "yo gangsta kid meets gangsta genie, with gangsta results!!!",
            "content": "Possibly the best movie ever made this is the gangsta version of Aladdin. No blue genie trash! This is gangsta all the way!!! I watched it and I was like yo this is seriously gangsta. Yo ya gotta catch this move, Shaq is the best actor/actress ever or at least the most gangsta!!! The boom box scene freaked me out and is not suitable for younger audiences. Yo but this man, this was g...g...a...ngsta. I Love You Shaq!!!!!!!!!!!!!!! U my main bro see ya in the hood. Whoever disses this movie is an un-gangster weirdo who I assume smells funky. Yo me and my sizzles were like yo this movie gansta. I was like I gotta write to Shaq make a sequel bro!!! I call it Kabaam, or Jumanji I haven't decided either one is gansta. I also came up with a really gansta rap: Yo Yo Yo im a gangster, My name Kazaam, Shazaam, Babaam yo yo yo gansta.",
            "review_date": "2006-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "2",
            "content": "Oh God. When you're retired from basketball or from Sumo( I don't know he looks pretty fat) and then you're trying to become superstar actor. Just cringe, please never do this again you just can't. You're the worst actor and sport commentator so please keep your 1% of smartness for yourself.",
            "review_date": "2018-12-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "how is this a thing?",
            "content": "I watched this movie when it came out, i was 11. decided to watch it again after stuckmann made a hilariocity about it. so much of this movie shocked me. unfortunately it didn't make me laugh that much, more just strong feelings of disbelief that this exists. hilariocity scale 5/10 (about 2 viewings, 6/24/2020)",
            "review_date": "2020-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Why would someone make a film with Shaq as a Genie?",
            "content": "Boy, this is one of the worst films I've seen. No wonder it's on IMDb's Bottom 100 list.I'll start off with the good parts: It did have some funny moments like the scene with the flying french toasts and the scene where Max and Kazaam are having a bicycle race.The bad parts: Everything else in this movie was boring and bad.Shaq as a genie is just plain awful. Beside's he can't even rap. In one scene, he's singing, \"Let's Green Eggs and Ham it\". Seriously? That's kinda like a 5-year old doing a rap song.The other character's weren't even that good. Max is annoying. The villain is not even that evil. Literally.Also, wasn't this suppose to be a family film? In one scene, Max say's, \"So after my 2 last wishes, I own you?\", then Kazaam say's, \"Technically\". Is it me, or is this film about slavery?Overall, \"Kazaam\", is an awful movie that's not even worth watching. But compare it to, \"Batman and Robin\", \"Son of the Mask\", or \"Battlefield Earth\", it's not that bad. So if you're looking for a good movie with a Genie in it, watch the Disney movie, \"Aladdin\". That film has a Genie that can sing and make you laugh. He is also voiced by Robin Williams. A \"GOOD\" actor.",
            "review_date": "2011-02-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very Enjoyable",
            "content": "OK, i'll admit that this movie is defiantly not going to be the idealistic fun, thrilling, and adventurous movie that adults these days like to see, but it is absolutely wonderful for children. It is a great family movie to watch. I loved this movie when i was young and i would still watch it today if i saw it on T.V. I love the plot, the humors and the actors in this movie. It is very entertaining for young kids and will keep them interested in the t.v. screen. I recommend watching this movie with your kids for a great family bonding time. It is cute and meaningful and might teach your children a thing or two. If your children are 10 or younger, they will definitely like it.",
            "review_date": "2008-05-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This movie is crunchy. That's a good thing.",
            "content": "This movie is classic. You need to see it. Max makes all the wishes you would make if you didn't believe that shack could be a genie. Anyway it has great one liners and shack is great in it. Max also grows up to be Warehouse Hood Leader in crank. Max also asks for like 15 wishes that shack cannot grant. He can give him junk food to the ceiling though. I'm not allowed to spell shack the traditional way it is spelled. wait I'm not allowed to put spiteful remarks? remember when shack did that caramel crunch commercial? it is pretty much an hour and a half of that. that still means that I really like it. well all and all it was a great movie that I saw right when it went straight to video. shaq is really tall and i look foreword to still owning this DVD. Hey I can say Shaq! I'm i mean h'm going to tell everyone!",
            "review_date": "2007-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Extraordinary acting, fantastic musical score and superb direction. This movie is a classic.",
            "content": "This movie has gotten a bad wrap over the years, but in reality, it maybe one of the best of our generation. I remember watching this movie over and over and over and over again as a child and enjoying it more than any of those cookie cutter Disney movies.We have become so jaded and left our youth behind if we say this movie is terrible. Think about it; the acting was definitely above par for such a film, the direction was great, and the musical score was beautiful. It was subtle enough that I could hardly notice it but left me tapping my feet noticeably from the for the entire film. I love this film, always have and most certainly always will. It might not be The Godfather and it might not be Titanic but it is definitely not one of the 100 worst movies of all time. To place this piece of work there is dishonest and over all wrong! Enjoy this fantastic family movie.",
            "review_date": "2010-02-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wham bam thank you Kazaam",
            "content": "There was a genie played by Shaq His name was Kazaam, and he was whack His rhymes were corny, this lines were bad some stupid kid cryin over his stupid dad bad actin, bad casting, bad special effects whats next? this movie sucks Prolly didn't make 20 bucks he lives in a boombox not a lamp hurts like a cramp like a wet food stamp...Yeah, you get it, a stupid rhyming genie who can't act, in a stupid movie with horrible special effects. Oh, and its confusing as hell. I'm not even gonna go on. Let's just say, it belongs in the \"its so bad, its funny\" category. Watch it once with your buddies and get a good laugh. But don't expect anything spectacular.",
            "review_date": "2006-05-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the most...",
            "content": "...absolute worst movies I have seen ever!It was me and my ec-wife's turn to babysit her sister's three kids and thought a movie and pizza would be great. We didn't have much of a choice because the kids wanted to see this stupid and idiotic farce.I mean, come on Shaq! A rapping genie? Did youbnit make enough of a salary in the NBA to even do this script? It made no sense, had no real plot or storyline, but of course there's that lingo that rappers share, which I don't want to understand or care to. By the movie was over, we so ready to leave and pass on the pizza. It was that dumb of a movie that should have stayed on the cutting room floor.20+ years later, I'm still astounded with Shaq, his educational level (from what I understand he was given an \"honorary\" PhD...but why? Can he not find a career other than advertising for Icy-Hot and the General car insurance? I guess that's what a fine educamation does for you other than just being handed a certificate of completion. SMH.Avoid this movie. It's definitely one to totally forget and get your money back. That awful.",
            "review_date": "2018-12-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ugh...",
            "content": "Unfortunately my nephews wanted to watch this and I got stuck watching it with them. It is horrible...scratch that, horrible doesn't do it justice; even my nephews (age 5&7) got quickly bored with it (fortunately they let me stop it 3/4 through and put in Babe.) Shaq has officially found something he does worse than shoot free-throws (act AND choose scripts.)",
            "review_date": "2000-05-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "To make \"Kazaam\" you need...",
            "content": "1. Paper-thin plot that has been done before 2. A rapping genie cum-basketball player 3. A very, and I mean very infuriating bratty kid. 4. 3 stupid wishes 5.Product placement (then again, what movie doesn't have this) 6.crummy script. 7. Shaquille O Neal rapping. Stir together and you have Kazaam....... What a poor movie!",
            "review_date": "1999-07-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pimp my Genie.....",
            "content": "Kazaam has been sealed up for thousands of years, until one day he is accidentally freed by Max, who is on the run from a local gang. Kazaam explains that he belongs to Max until he grants him three wishes, but what Max really wants is to get to know his estranged father. When the genie, who considers trying his hand at a music career, forgets about his young master, Max is attacked by villainous club owner Malik..........Shaq had a couple of years in the nineties where the marketing bods saw something I the brand that was Shaq. First there was his silly game, Shaq-Fu, which was a Mortal Kombat rip off, then there was his illustrious music career, which in turn gave him the chance not only to star, but to executive produce his two 'big' movies.Steel came after this, and is decidedly better than this, but there is something really weird about Kazaam, it's bad, sometimes hilariously bad, but the studio must have had a little faith in the film, being released in the summer, just a couple of weeks after Independence Day.So Max finds Shaq, hates his mother and step dad to be, finds his real dad, who hates him, and in turn, influences Shaq to hate everybody via the power of rap, and his magical boom box.The first wish Max should have asked for was to repair that distracting crooked tooth to be corrected, and to get some manners, because Max has to be one of the most unbearable child characters I've seen in a while. He's abhorrent to his mother, who appears to be in a totally different film, and he looks up to a man who wouldn't give him the time of day.Shaq cannot act for a toffee, here it seems that he was just trying to showcase his rappin' talents and hope that the two combined would catapult him to the big time.It didn't,And the fact that Max falls the equivalent of the Chrysler building through the film begs the question, is all this happening in his subconscious? Die he really see a man take a shower in his own room?Clearly not as horrid as most say, but it's still pretty terrible.",
            "review_date": "2016-01-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "shaq rules",
            "content": "I believe this movie may be the best movie I've ever seen, it kicks the crap out of other movies like American beauty!!!!!!!!!!!!!! I love Shaq and this movie 2. Shaq is the best actor ever and the little punk didn't suck that bad. God I hate that kid. Too bad he wasn't a miscarriage. I can't believe the little retard got paid for this. Furthermore I believe that this movie has exemplary acting and I believe the plot was well ahead of it's time and it took my breath away. I would recommend that anyone who dislikes this movie should slap themselves for being such an ignorant dilettante. For all of you who gave this movie bad reviews fore shame.",
            "review_date": "2005-11-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This is one movie everyone would wish to disappear.",
            "content": "Shaq might be a legendary basketball player, but this movies is by no means a slam dunk. The plot might be by the numbers, but the film's real problem is the soul-less performances given by the cast, the deeply un-funny comedy and the compilation of yelling non-sence that the movie refers to as rap music.",
            "review_date": "2018-11-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great family movie, deserved of criticle acclaim!",
            "content": "**** y'all haters, i put a lot into this performance and i was massively pleased with the outcome. I wish they had Max as a black kid just to make it seem more true to life but otherwise this was a great movie! Filming it was fun and when i showed it to my cousins they thought it was great, considering how much effort went into the production of this film and having you film 'connoisseurs' hating on it. You can all suck my fat one. For all of you out there who appreciated this film and voted 7 or above out of 10 for i want to thank you. Shaq out!",
            "review_date": "2010-02-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "number two all time greatest movie",
            "content": "Yeah thats number two behind none other than shaq's other masterpeice \"Steel\" Who other bashes this movie is obviously deaf and mute because there is no way that his briliant acting and great costumes can steer any movie wrong. Loved it, youll love it, theyll love it and by they i mean you so really i guess its just you'll love it. 10 out of 10",
            "review_date": "2003-11-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Garbage",
            "content": "This is quite possibly the worst movie of all time.  It stars Shaquille O'Neil and is about a rapping genie.  Apparently someone out there thought that this was a good idea and got suckered into dishing out cash to produce this wonderful masterpiece.  The movie gets 1 out of 10.",
            "review_date": "2003-02-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wish it Away",
            "content": "Unbelievably, this movie was made after Robin Williams showed the world how awesome a genie could be. Maybe they didn't see Aladdin. Or any movie.Kazaam could possibly be one of the worst movies ever made. Terrible and mixed messages, bad dialogue, cinematography and editing from a blind person, horrible and uncharismatic characters – so no one to root for, inconsistences in an incoherent script, sickening special effects and probably the most horrifying raps any human spoke/sang are just some of the problems. But, I'm sure with the many more issues I didn't list, this film could be taught in college on how not to make a movie. This all-over-the-place mess didn't even try. Sometimes I just feel sorry for bad filmmakers who had a vision and at least tried. There was no attempt here but some to cash a check that probably bounced anyways.Not much of a plot, but a bullied and unlikable kid releases a boom-box genie in an abandoned building that was in the process of being demolished, but the filmmakers forgot to finish that idea. Kazaam, a bland genie, just wants to grant three wishes to the delinquent so he could be imprisoned again, I guess. All that is followed by no less than six other subplots, none of worth repeating, remembering or writing about.Again, there's so many things wrong with this \"family-friendly\" kid movie, but probably the most despicable is how creepy the adult Kazaam acts around his \"master,\" the 12-year-old boy. He stalks him, ends up in bed with him and even kisses him\u0085on the mouth, no less. I don't care that this came out 20 years ago, none of this should've ever been seen as anything but a recruiting video for pedophiles. It's not so bad it's good, it's so bad\u0085it's unforgivable. ***Final thoughts: Granted, I just watched a ton of artsy Oscar-bait movies to catch up on the 2015 nominated movies, so I wanted a little dumb movie action. Additionally, I needed to see this this for the fantastic How Did This Get Made? podcast that covered it. Maybe I did get my wish: I really got something INCREDIBLY dumb. You outdid yourself this time, Kazaam!",
            "review_date": "2016-01-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Shaqaam",
            "content": "Shaq O'neil was selected in the 1992 NBA Draft by the Orlando Magics. From the University of LSU (Louisiana). After of only 3 years he was placed in movies like Steel, Kaazam etc.He was a better actor than Micky and Lebro. I'm just puzzled to why he had such a short notable acting career, then again he did play 15+ seasons in the NBA so he never really quit acting... Anyways...Kazaam was one of those bad, corny movies that was so awful that it worked. It's not the best movie and it sure ain't a legendary movie but if you are bored and tired after working your slave job then watching Kazaam can make you feel relaxed.",
            "review_date": "2022-05-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Thank you, Conan!",
            "content": "I will have to admit that I would NEVER have seen this movie if it weren't for Conan O'Brien.  I think he is secretly in love with this movie, and not in a good way.  If there's anything to take a stab at Shaq in *any* way, he just shows a clip or 2 from this movie on his show.  So, I went out and rented this movie (with about 10 others to disguise it) to make fun of it, and I had a laugh-a-minute riot!  How many times did you just want Kazaam to die a horrible death when he started rapping?  And the writing was atrocious -- do **NOT** show this movie to little kids!  You will put them at risk for brain damage with lines like: \"Francais?  I love it 'beaucoup, beaucoup, beaucoup'!\" and \"You smell like a hippopotamus butt.\"  Many others follow, as well.  And the ending was horribly melodramatic --  I will not spoil it so you can see it for yourself.  Overall, I would like to thank Conan O'Brien for discovering this horrible movie that every family can enjoy...making fun of.  P.S. I think Touchstone Pictures is so embarrassed for putting out a piece of trash like this, I don't even think that Conan needed to have these clips furnished by the studio for his show.  0.5/10",
            "review_date": "2000-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A forgotten classic.",
            "content": "Now, most people who vote this movie as being \"bad\" probably had the powerful symbolism go over their heads, not that that would be to hard to accomplish. I would suggest everyone rewatch this movie closer and you will see what I mean.This movie may be one of the most powerful commentary on the horror of gang violence and illegal sex trades in America I have ever seen.Watch the movie with that in mind and Shaqs performance will blow you away.10/10I would suggest that this American classic be in every moviegoers collection.",
            "review_date": "2010-02-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "this movie was so funny though!",
            "content": "This movie was terrible, it's obvious but it was so funny! Come on, Shaq rapping! It's obvious that the acting was so bad but it is funny to watch. What's the point of picking on the movie with bad directing and bad editing. For this case two bads do equal a right. In fact, for this movie, 80 bads equal a right! I hope Shaq does more stupid movies thinking its not stupid. I hope he does a movie with Kobe Bryant where they are like warriors going to war with each other. Now that would be funny.So all of you picking this movie apart, it doesn't take a genius to know that movie really sucked. It sucked so bad that it was funny and that is worth a look. Really it deserves a 1 but it made me laugh by how horrifying it was.Just for the record: Directing a 2, editing a 3, acting a 1, plot a 2, message a 4.",
            "review_date": "2006-06-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's about as good as 'Shaq Fu'",
            "content": "Bad movies are easy to fault, 'Kazaam' is a total mystery, a movie that goes wrong from the very basic concept. I could not figure out how anyone thought that casting basketball great Shaquille O'Neal as a genie was a good idea. How in the world do you convince anyone to spend millions of dollars on this concept? I could argue that it's an ad for Shaq as a product but the movie showcases none of the charm and talent that have made him a star athlete. So what's the point? The pathetic stab at a story involves a lonely kid who finds a boom box in the wreckage of an old building. Suddenly out pops a 5,000-year-old genie that grants him three wishes. Therein lies the first question – How could a 5,000 year old genie live in an object that has probably been around only about 10 years? Kazaam gives the kid a mountain of candy that falls from the sky and therein lies the second question – How does he know what candy is and how does he know how to materialize them in wrappers that he has never seen? I also put this question to the mountain bike that he presents to the kid. Kazaam's boom box was found the wreckage of a building. Somehow I feel like I've given more thought to this script then they did.As for the kid, he's played by Francis Capra, a young actor the I liked in Robert De Niro's 'A Bronx Tale' a few years back. In that film he was likable, bright and always seemed to be listening when the other actors were speaking to him, not just waiting for his cue. Here that's all gone, he's bored and never seems to be trying. It's kind of like watching Maculay Culkin in his worst films.'Kazaam' is tired. I'm not just talking about the script or idiotic idea of casting Shaquille O'Neal as a genie but I mean this movie is paced so lethargically that it made me tired just watching it do nothing. This is what I call a 'door movie', because the filmmakers don't care what you see on screen because after you've paid the admission and gone through the door, their job is basically done.",
            "review_date": "2014-06-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The shameless copy of Aladdin but wrong",
            "content": "Well,well,well if it isn't one of Disney's worst movies from 1996 because it is nothing but a copy of Aladdin (1992) just like The Wild (2006) being a copy of Madagascar which is way better than this, this movie ended on the awful movies wiki from miraheze for the bad voice acting from the character named Shaquille O'Neal (Max), unfair ending, misleading title, bad rapping and one of Disney's worst movies along with The Wild (2006), Underdog (2007), Mars Needs Moms, Strange Magic, Mulan (2020) and Artemis Fowl, if you want to watch a better movie from 1996 go watch The Hunchback Of Notre Dame and Aladdin And The King Of Thieves because those are better examples of two good Disney movies, forget this copy, The Return Of Jafar also sucks and so does Belle's Magical World.",
            "review_date": "2022-09-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Kazaam! Kapow! Kawham! Kazaam steals hearts of Americans",
            "content": "I can't believe that Shaq was actually good in this movie.  This is his crowning achievement of his life, and I have followed Shaq ever since his days at Louisiana State University.  I have to admit, that as soon as I saw him in that Pepsi commercial, that I began to question his credibility in acting, but this movie totally restored my faith in the great Shaq Diesel. This movie blew me (and the critics) away.  It had everything...something for the family, for those that like comedies, musicals, basketball, genies, and tots; as well as for all those lovers out there... We all know that Shaq gave us burning sensations while we watched him in basketball, but Kazaam raises that sensation to 212 degrees. Wazoo! -John Hurst",
            "review_date": "2003-01-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What could we expect?",
            "content": "Ok, the best thing to do going into this film is to not expect anything from it.  I just found it channel surfing a few months back (late May 2003).  I remember hearing about it years ago when they first came up with the \"movie.\"  But I found it incredibly corny.  But in a good way.  Shaq plays himself pretty much, a big joker.  And who would expect much acting prowess from a man who calls himself \"Shaqdiesel.\"Anywhoo, as long as you acknowledge that this is going to be a horrible movie, bereft of anything worthy of even seeing a movie, t'is a good way to let your brain turn to jello, like, say, after studing for finals or writing a 10 page paper in 3 hours ;-).---P.R.",
            "review_date": "2003-07-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Shaq, please for the love of God, just stick to missing free-throws",
            "content": "This movie has successfully proved what we all already know, that professional basket-ball players suck at everything besides playing basket-ball. Especially rapping and acting. I can not even begin to describe how bad this movie truly is. First of all, is it just me, or is that the ugliest kid you have ever seen? I mean, his teeth could be used as a can-opener. Secondly, why would a genie want to pursue a career in the music industry when, even though he has magical powers, he sucks horribly at making music? Third, I have read the Bible. In no way shape or form did it say that Jesus made genies. Fourth, what was the deal with all the crappy special effects? I assure you that any acne-addled nerdy teenager with a computer could make better effects than that. Fifth, why did the ending suck so badly? And what the hell is a djin? And finally, whoever created the nightmare known as Kazaam needs to be thrown off of a plane and onto the Eiffel Tower, because this movie take the word \"suck\" to an entirely new level.",
            "review_date": "2006-04-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This movie EARNED its place on the worst 100 list.",
            "content": "This movie proves that Shaq is better at making free-throws(ha!) than acting.  Combine that with a poor story and cheesy visuals and you have a definite bottom dweller.  Zero stars.",
            "review_date": "1999-07-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I wish to have not watched this trash.",
            "content": "So you have a gigantic, crazily dressed, flamboyant rapping genie, and you instead choose to focus on some clichéd family drama nonsense that we've seen so many times that it's painful.Seriously, I was so unbelievably disappointed by this. I thought I was in for a fun and silly friendship between a kid and his wacky genie. I expected it to be awful, but surely with that premise, it'd at least be fun, right?No.There needed to be way more of Kazaam in the movie to give it more goofy fun. The movie is like 20% fun nonsense, and 80% an angry kid having a tantrum and being horrible to everyone around him.Like always, it's not the fault of the child actor themselves, but honestly whoever wrote the kid character has provided me with reason no. 1379421 why I never want to have children.If I had the genie myself, I'd wish to be able to reach through time and throttle the guy that wrote the kid character to be this way.",
            "review_date": "2022-01-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A rapping genie... played by Shaq... what could be better??",
            "content": "A rapping genie... played by Shaq... what could be better?? I honestly love this movie and watch it every time it graces the TV screen! It may not be the best movie ever made (it isn't by far), but it is very enjoyable to watch. Shaq did have a few rap records that many enjoyed. This movie is a lot about his rapping and the catchy rhymes make it all worth-while. I recommend it to any Shaq fan who is up for a laugh. It is also a great movie for little kids as it actually does teach a lesson. I thought Shaq did alright acting. He had another role in an even better film by the name of Blue Chips starring Nick Nolte. His role was rather limited but all in all some decent acting from an athlete.",
            "review_date": "2005-08-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The 90's were not funny, they were stupid.",
            "content": "I've just started watching my way through IMBDs bottom 100 and this definitely belongs there, I'm pretty sure it deserves to be higher up than number 99 too. I've seen a video review of this so I kind of knew what to expect but it turned out to be so much worse. The other two films from the list that I've seen so far were immensely boring because nothing ever happened in them. This one at least had some action in it but every single thing that happened was just stupid. Now, I can enjoy stupid movies; films that are so bad they become funny, this one though was painfully unfunny. On top of that, the film is in the mid 90's and the film makers make that abundantly clear with the way people dress and above all the horrible hip hop music playing throughout the film. It reminds me of all the bad things about the 90's and none of the good ones. By far the worst thing though is Kazaam himself who, despite being thousands of years old is hip, but not in a good way, and goes around rhyming every sentence he utters like some kind of idiotic hip hop artist. That Shaq can't rap doesn't exactly make it any better.This whole thing feels like a bad 90's music video - starring an untalented rapper - drawn out to a full length feature.",
            "review_date": "2011-11-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"I am an Idiot for starring in this movie\" - Kazaam",
            "content": "Kazaam\" is a massive failure on so many levels that showcases a production company's desire to take advantage of children and is a backdoor way for Shaq to promote a rap career. This movie fails with everything it sets out to accomplish. Shaq as a genie didn't even make me laugh as much as it made me feel uncomfortable every time I saw that stupid smile of his staring at the kid. This film sucked, so let's get this over with so nobody has to view it.It's about a kid, Max (Francis Capra), who lives with his mother, Alice (Ally Walker), in Brooklyn, New York. During school, Max is chased by bullies into an abandoned building where he falls through the floor and discovers a boom box. He accidentally unleashes the Genie inside, who calls himself, \"Kazaam\" (Shaq) who likes to rap. Kazaam becomes Max's Genie and follows him around until Max's three wishes are granted. Max discovers that his mother lied to him about his father, Nick (James Acheson), who left the family years before. Max discovers his dad is in New York, so he sets out to find him while hauling Kazaam behind him.There's only one reason this got made, and Shaq rapping throughout the movie shows why. He is not only creepy throughout the film, but there's not even any potential for it to be good at all. I don't think any intention to make a good movie was here, and all I can think of is that Shaq was desperate to be an actor, nope, or a rapper. It's also supposed to be a kid's movie, and I have a lot of issues with that. I strongly disagree with that as its quite a violent film, but I will get to that. So, it starts with a massive wrecking ball taking up five mins of the movie's opening to destroy a building that houses a magic lamp that Kazaam is inside. The thing tips over and lands on a boom box. The Genie decides to take up residence inside.We get introduced to Max, who tries hard to be a bad boy and gets bullied by some stupid kids who try even harder to be bad boys. It's like the director told the kids to look like wannabe drug-dealing thugs because that what they come off as. These kids are supposed to be high school students, but they are so mean-spirited, and one of them wears an earring bigger than my fist. It adds a seriously violent tone to the film as they beat Max up for no reason. I can't even begin to believe they are bullies. There is a sequence in a bathroom where they outline his body on the floor with paint. I think I'll stick with the director telling them to be drug dealers because I don't believe they are in high school. Why do we need to show \"Bullies\" painting a teenager's body on the floor?The kids are scared off when Kazaam appears, starts rapping, and one of them decides to try to hit the Genie with a piece of wood. Does that sound like something someone would do if a Genie, oh I don't know, popped out of nowhere and looked like Shaq dressed like a ridiculous clown? Shaq looks like a TV commercial for the middle east as he walks around with the kid at 7 foot 6 and smiles like an idiot whenever he stares at the kid. From here on, we learn that Max's equally stupid father pirates music and gets involved with some of the most laughable actors I have ever seen in a film. These guys are truly pathetic. One of them, I think he is the main villain, speaks with a fake Russian accent and can't act at all. It all leads up to a violent ending involving Max and an elevator shaft. Shaq kung-fu fights a group of terribly acted Russian gangsters. They want to learn Kazaam's power or something. At this point in the film, I just wanted it to end.Nobody in this film can act. The direction gets thrown out the window, and the screenplay is such a mess that they need to fill time in so Kazaam shows Max his powers by using horrible special effects to make it rain candy bars. The special effects are so adverse they will hurt your eyes. One of the creepier scenes is when Kazaam wakes up in the kid's bed, and than he uses horrible special effects to show in front of the kid singing a stupid song. I think Shaq was a rapper around this time, which would explain why there is a dumb subplot where some moron sees Kazaam rap and hires him to open for the female hip hop trio Salt-N-Pepa. The story takes a complete detour and forgets everything so they can showcase Shaq as a rapper until the end of the film comes along, which becomes quite violent with the main villain getting turned into a CGI ball and dunked.This movie should never have got made. Too many bad ideas fused to form a choppy film that attempts to showcase Shaq in many different ways that fail, his outfit is the silliest of them all. The ending is pretty severe for a children's movie. After he beats up the gangsters, the kid Max had been thrown down an elevator shaft early and is dead. Shaq uses his powers to become \"SuperShaqFu,\" I guess, and the kid gets resurrected because of a speech. I hope parents don't take their kids to see this awful film, and the people who made it should be ashamed of themselves for taking advantage of Children.\n1/10",
            "review_date": "2016-05-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Counter-vote!",
            "content": "I'm only giving this one a 10 because I don't think that this one deserves such a low rating based only on Shaq's bad performance.(either on the set or on the court) Just take a look at the great camera work, superb sfx and other performances and let yourself be entertained. If it weren't for the 10 being a counter-vote I would've given it a 7.",
            "review_date": "1999-07-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "All hail Shaq.",
            "content": "The movie Kazaam featuring the multi-talented Shaquille O'Neal should be the standard which all movies are held to. Since originally viewing this wonderful work of cinema 15 years ago, I can say it has definitely held up to the test of time. I've yet to see a movie that even comes close to achieving the depth of character, raw emotion, and beauty that Kazaam portrays. Shaq is definitely a triple threat -- basketball, acting, and singing, what's next!? I can't wait to see more from this truly awe-inspiring man. This film has definitely slid under the radar of Hollywood critics, which I see as a blessing. I'd hate for this movie to get wildly popular and lose its innocence. Once I have children of my own, this will be one of the few movies I allow them to watch since it preaches such good morals & values. If you're debating whether to watch this film or not -- DO IT! Your life will never be the same in the best way possible.",
            "review_date": "2011-02-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you see this film..... You're as stupid as me",
            "content": "So I'm aware that this film was released a fair while ago, but I've only just seen it; and not out of free will. I can some up this film in 1 word.... Shaq, the only \"actor\" who is more robotic than the Terminator. And really thats all that needs to be said, it's a stupid stupid movie that barely makes any sense, it's so uninteresting that I could feel myself getting stupider as I watched. If you see a copy of this film DESTROY IT, and then maybe one day the world will be ridden of this raping of cinema known as Kazaam1/10 (and the only reason it scored that high is that i'm not allowed to give it a zero)",
            "review_date": "2010-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This is what happens when bad meets worse.",
            "content": "Can a movie be any worse when it has both the qualities of the cheesiest plot ever written and the most annoying, unlikable characters in acting history? no. this is what happens when bad meet worse. The idea of Shaq having the starting role in a movie is beyond experssion, this \"proffesional basketball player/actor\" hybrid is almost as laughable as a NYrapper/general practinioner. Lets face when your not broke don't fix it. Shaq better stick to basketball or we might just get a few more laughs out of him. If you like this movie, i strongly recommend MANOS HANDS OF FAIT.",
            "review_date": "2001-11-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I named my kid Kazaam after this",
            "content": "Shaq is the goat bro the story was so good atleast 100/10?Idk how the plot was so interesting, the cast was just beautiful, shaq as the wisdomic genie was so poetic. Loved it so much I dedicated my whole life to this movie and named my child Kazaam.",
            "review_date": "2022-05-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I just couldn't look away",
            "content": "The only reason I DVRd this movie was because 1. I live in Cleveland and Shaq plays basketball for us now and 2. I've always heard how awful it was. The movie did not disappoint. The best parts were Shaq's outfits. The worst parts were, well, just about everything else. My 12 year old son and I just squirmed and couldn't look at the screen when Shaq started rapping and we kept wondering why Max didn't wish for Kazzam to fix that front tooth of his! But for all it's terribleness we just couldn't stop watching it, the story sucked you in, like a black hole or quicksand or a tar pit, it was hypnotic. But it was worth it for the laughs and just to say that we actually watched \"Kazzam\".",
            "review_date": "2010-02-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you sat through this pointless piece of garbage, you can sit through anything!!!",
            "content": "Arguably the worst film ever made!!!  I rented this movie with my 5 year old nephew and we ended up turning it off after 45 minutes.   Even he thought this movie was god awful.  It's hard to believe people actually went to the movie theater to see this.  That's a wasted $5 plus a hour and a half of your life that you'll never get back.  The acting in this film is just plain pathetic.  Shaq should just get out of films completely and just concentrate on basketball and free throws.  I thought Michael Jordan in Space Jam was pretty bad.  However, Shaq makes him look like Robert Deniro in Taxi Driver.",
            "review_date": "2000-07-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hated this movie before anyone told me that I was supposed to",
            "content": "Let me give a quick summery of the film: A rotten, rude kid named Max stumbles upon a radio that contains Kazaam: a rapping genie. Like all genies, he grants 3 wishes but, being good natured, also helps Max with his personal life, as he has to deal with bullies and a father mixed up in organized crime. During all this, Kazaam raps from time to time, (also showcasing Shaq's dismal rap skills).This movie proves what we all know: Athletes need to stick to sports. I admit that it never looked like an Oscar-worthy movie, but EVERYTHING about this waste of film is horrible. The characters are either unlikable or stupid, the plot is not even worth mentioning, the dialog is a joke, and Shaq is only a quarter of the problem. Hell, even if Denzel Washington played Kazaam this movie would still be a joke. I know that the movie only drew ANYBODY was because Shaq was so big (no pun intended) at the time. I honestly cannot think of a single positive thing to say about this waste of time. Shaq should have put the time had used to make this movie toward practicing free throws.",
            "review_date": "2008-06-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just plain trash",
            "content": "I hated every moment of this movie.Now, when I see any family movie, I always walk in with an open mind.\nThis movie was such garbage though.Would someone poke Shaq with a with a five inch fingernail and remind him to stay in basketball? Not that any other acting in this movie was any better.The rap song added absolutely nothing to this movie.The movie also gives you a good old ridiculously sappy ending that tries to change your mood after watching this type of trash.Just skip this movie and rent Babe for the kids again.* out of *****",
            "review_date": "2000-07-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Stinks like a bag of burning doggie stuff...",
            "content": "Another failed attempt of trying to turn an athlete  into an actor. Can casting directors not see that this never works?Okay, wait, this film was horrible to start with.The plot is just cheesy, and is covered up with a sappy ending, one of those melodramatic ones they throw in at the end of a few family films to try and cover up how horrible the movie was to the adult audiences.The rap song sung by Max and the genie adds nothing to this bloody horrible movie. It just makes matters worse.Take my advice. Just skip this one. It even punishes the little ones.Thank Goddess I only paid $2 to see this...* out of *****, for nothing lives up to the terror Baby Geniuses will lead you off with....",
            "review_date": "2000-07-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "WARNING: Parents don't subject your kids to this kind of CRAP",
            "content": "When I saw this in the theater I was so embarrassed, I can't believe I spent my money on such crap. It was so bad please, keep your kid away from this movie. Shaq and the Capra's song will definitely scare them off. Please I beg of you don't subject them to this. Zero is too high of a rating for this, I can't rate it.",
            "review_date": "1999-03-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you watch this, expect a strong feeling of loss and regret",
            "content": "This movie deserves no rating, and it's not for the reasons you'd think. It is a complete failure, but mostly because it got past common sense, Hollywood budgets, and directing standards.All because I believe Shaq threw enormous piles of money at it, and no one wanted to tell him this was the worst possible movie idea.Also take note that Shaq raises his eyebrows every other word he speaks.Some moments are only mildly painful, while others are clench your teeth, eye-squinting travesties. Most notably, the rap battle between the boy and Shaq, where they repeat \"We ain't men, we genie.\"* Scowling at a piece of toast. * A boom box that shoots a shower of sparks * A grown man showering in front of a child * A rapping genie, that despite boasting his lyrical skills, always starts every rhyme with \"I am Kazaam\" * More than an hour of your life wastedThese are what you have to look forward to in watching this.I'm troubled that anyone thought this would make money, or legitimize Shaq's rapping career in the minds of children.If you have a choice between sitting in gridlock traffic for 9 hours, 10 straight hours of oral surgery or watching Kazaam, Kazaam wins by a slight margin. There's no more positive endorsement I can give.",
            "review_date": "2013-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "As terrible as you think it is",
            "content": "The good thing about watching movies years after they come out is that you can form a nuanced opinion without the influence of the cultural reception at the time. Watching Kazaam taught me that there's nothing nuanced about how terrible this movie is. You heard it was bad. I heard it was bad. We can now agree that there's nothing clouding our judgment.This movie reeks of the decade it was made in. Physically-incapable-of-acting basketball star Shaq is the title character, a genie that lives in a boombox. The protagonist of the movie is Max, a bratty kid that finds Kazaam in an abandoned building. We're supposed to sympathize with Max because he's bullied, but he's such a little jerk that it's actually cathartic to watch him get bullied. Kazaam and Max make an unlikely pair, not just because a 7 foot tall black man follows a little white boy around New York like a lost puppy, but also because Kazaam wants to go through the three wishes to gain his freedom (and hopefully get far, far away from this kid), and Max, in a completely realistic and tightly written portrayal of the selfish child that he is, decides that he doesn't want to use any of the magic wishes his genie is begging him to make. The \"plot\" of the film revolves around Max learning that his mother lied to him all these years and that his father actually lives in the city, so he goes off to see his father for the first time in however many years (Kazaam is along for the ride). He's crushed to find out that his dad is a total sleazebag (like father like son) music executive and eventually it's up to Kazaam to use his miraculous powers not to end poverty, war or world hunger but to mend this broken white family. There's another sleazebag that figures out Kazaam is a genie and plots to steal him out from under Max.If you found Shaq's non-acting to be distressing, prepare yourself for the \ntrauma that is his rapping. This movie fails in just about every conceivable \nway. A story about a kid and his genie should be pretty straightforward but \nsomehow, most of the characters are unlikable, the plot is dull and \npredictable, and I'll sound like a broken record if I keep talking about the \nacting. Space Jam, this is not.",
            "review_date": "2018-06-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Why didn't I give this a rating of 1?!? Answer:",
            "content": "It didn't cause physical pain. If I take prescription medication after a movie, it gets a '1'. A good example is the outer space sequences in '2001:a space Odyssey'. The repetitive forced breathing made me pass out.'Kazaam' is nothing short of annoying. A rapping genie in a boom box discovered by a spoiled little kid. You know the kind of kid you see in the grocery store giving their parent hell because they want a candy bar. Imagine a movie jam packed with that. If I had gotten a boom box when I was a kid I would be appreciative, much less a genie inside.I fell asleep during 2 attempts to watch this movie. Honestly I didn't make a third attempt, so I have no idea how it ends, but then again I don't CARE.",
            "review_date": "2005-12-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Yes, it is that bad",
            "content": "This film was utterly crap. I had to do a school project on it (for art), only because ONE kid in our class wasn't allowed to see M rated movies. I regrettably chose a scene from the movie to focus on - one of the totally not-fight-scenes. Poor acting all round, as usual the kid outshines Shaq......only just. And Shaq is VERY poor indeed. I really can't understand what was going through my (usually really good) teacher's head when he got out that video....",
            "review_date": "1999-04-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Movies is GREAT!!!!!",
            "content": "This movie had one of the best plots by FAR! the way the movie starts with the young boy getting the crap beatin out of him then finding this magic genie BOOMBOOK!, WAS GREAT!!! i do not know who has come up with this but its remarkable! almost as good as Fear and Loathing In Las Vegas but it close up there on my list!! Also the acting and rapping my Shaq was Awesome i've never seen something so great i practically cried my eyes out when they busted in to that sweet hot lil funky number!! well, thats about all i can remember of this great movie! hope u go out and rent to you can enjoy this very well done movie KAZAAM! P.S. The ending really got me i almost cried but i held back, god bless and enjoy the film!",
            "review_date": "2006-03-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Retarded",
            "content": "What was the point of this movie? What was the plot? I do not know. Shaq can't act, people don't know how to direct, and I am Kazaam! A genie who raps? Come on. Maybe Eminem or Linkin Park will be in a movie like this. I remember I watched this just to kill time. It didn't really interest me. I just remember thinking, \"Who put Shaq in this movie???\" The whole story seemed stupid too. It made no sense whatsoever. I guess an unrealized moral of this movie is that you can find anything in the ghetto and anything can happen. I can't comment much more because this movie is so terrible there's nothing worth commenting about. I \"wish\" this movie would go away.",
            "review_date": "2006-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "counter-vote countered",
            "content": "I'm only giving this movie a 1 because I think that this one deserves such a low rating not based only on Shaq's bad performance (either on the set or on the court or on the album). Just taking a look at the camera work, sfx and other performances and letting yourself be entertained is not a just cause to give this movie a 10 let alone a 7. If it weren't for the 10 being a counter-vote I would've given it a 0.",
            "review_date": "2002-01-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Rapping Genie Shaq?? Try free throws",
            "content": "*may contain spoilers* OK, this isn't the worst movie I've ever seen, however, it's not a good movie. the child actor wasn't great here and was kinda mean and rude to Kazaam. Shaq (playing Kazaam) was as good as he possibly could be, which of course isn't good. Shaq's just not an actor, he's a physical specimen, he's a monster basketball player who you don't want to play against, but acting isn't his thing and if that was his real rapping, then that also is really bad. He actually said, \"Let's Green Egg and Ham it.\" Anyways, the plot is that Shaq's a rapping genie who gets let out of his radio type lamp and gives Max three wishes and Shaq \"raps\" (or as i call it, doing bad poetry) almost everything he says. If you like Shaq and just want to see his presence or are curious to see his very short rap career, then, watch the movie. i, however, didn't love it, but again, it wasn't the worst I've seen.",
            "review_date": "2015-08-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If i was doped up this, movie would still be the worst movie ever.",
            "content": "If you are a fan of really bad movies, and you think there funny, you will the great acting of Shaq.  First off putting pro players in movies hardly ever works.  Shaq had to of been the worst actor i have ever seen next to Dennis Rodman who also made a few bad movies. Well any way this movie is also bad due to the hideous kid.",
            "review_date": "2003-08-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Yawn...",
            "content": "It has been a few years since I saw this movie, but awful movies tend to stay in my mind.This is proof of the fact that athletes should stick with what they are good at: sports. Athletes were not intended to act. Shaq's hideous performance in this movie is proof.",
            "review_date": "2003-06-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Another Slam Dud for Shaq!",
            "content": "We would really like to give this movie a full, detailed review, but unfortunately we periodically left the room for no reason at all just to get away from this brutal disgrace of a movie.  First of all, this movie appeared to have a large budget, yet the director clearly forgot to address Max's snaggle tooth.  With all the special effects in this movie, they could've at least made this kid look like he kept a dentist appointment. Now, let's move on to the major flaw of this movie--Shaq.  It appears that this guy can do it all--play basketball, rap, and act.  However, these last two things are severely lacking.  His raps consist of such memorable lines as, \"I'll be the cream for your coffee,\" \"I'll green eggs and ham it,\" and \"fresh out the box like a premature burial.\"  This rap song was awful....it was right up there with his breakthrough flops \"I'm Outstanding\" and \"Biological Didn't Bother.\"  Possibly the worst scene of the movie was the recycled after-school special speech by the soon-to-be step-father, Travis. We cringed when we heard Travis reassure Max that he would not take the place of his father.  There were a lot of unnecessary scenes with Max's father that we left the room for.  However, when we returned we caught the tail-end of some poorly acted \"bad-guy\" scenes.  This movie was plagued with weak walk-on parts, such as 'Da Brat and Spinderella. We found it very preposterous how Shaq became a pop music icon after \"rapping\" one stinkin' song in a dingy club.  We also found the recycled \"school is cool\" message to be extremely played.  In particular where Shaq plays Max's tutor (a job that seemed extremely far-fetched for Shaq).  In this movie, Shaq claims that he is more intelligent than a Harvard grad.  Once again, this is just stupid.  In reality, Shaq has the equivalent of a 5th grade education, as evidenced by his stammering as he struggles through the cue cards. Overall, this movie is unbearable and painful to watch.  Shaq should really look into other hobbies in the off-season, and Francis Capra should receive dental assistance before even thinking about going to another audition.",
            "review_date": "2000-06-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Shaq is God!",
            "content": "Just kidding!  I think someone with downsyndrome could act better than shaq. The movie is horrid.  Shaq is a genie who grants this little boy some wishes.  Sounds like oscar material.  I sure hope anyone who watches this poor excuse for a movie has a vomit bag nearby cause your gonna need it.",
            "review_date": "2002-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Whee hee, what fun!",
            "content": "Probably one of the worst films I have ever seen. Unbeatably cheesy, with the a plot line leaking stupidity everywhere. I mean, really, a rapping genie who comes out of a boom box? Whut? Still, this doesn't diminish my enthusiasum, which I didn't spell right, for the movie. It's extrordinarily goofy, and fun to just laugh at. I wouldn't rent it more than once, but I would rent it at least one time. I wasn't expecting this movie to be at all good, and I was right, but pointing at Shaq in every scene and yelling out, \"SHAQ!\" was worth my time. *wink wink*",
            "review_date": "2002-03-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Watching Shaquille O'Neill act is as bad as having every hair on my body pulled out one by one.",
            "content": "Shaquille O'Neill, while he is quite a large guy, is one terrible actor. It seems as if he is constantly reading his lines off a cue card (and he obviously can not do this very well either).  Aside from this shameful acting, this movie has no redeeming values whatsoever.  The kid is a criminal and he is never reprimanded for his evil doings.  Oh yeah, he gets a genie as a result of his dispicable activities.  Okay, that's a good message for the kiddies.",
            "review_date": "1999-06-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "good film-bad film",
            "content": "Let's play a game of good film-bad film. Mad Max was a good film, water world was a bad film. Goldeneye was a good film, view to a kill was a bad film. Kazaam is the bad film version of 'Bernard and the Genie' (1992). Look at the plot:  Loser finds genie.  Genie helps loser.  Genie  likes 20th century life. Lenny Henry makes a much better genie than Shaq, though.  I can't believe the casting for this film.  Shaq should learn that sportsmen don't make actors. Just look at Frank Bruno. And what is it with Francis Capra?  I had to kick the telly over every time he came on, he is that annoying.  Who else thinks it's ironic that 'Capra' is latin for goat. Well, Francis and Shaq can be proud of this one.  Like Frank Bruno can be proud of his acting. As far as films go, this one smells 'like a hippopotamus butt'.  And we're talking one smelly hippo. Guys, take it from me, you don't want to put this one at the top of the old curriculum vitae. Well that's all I've got time for.  I have to be back at the lab by six...",
            "review_date": "1999-01-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "content": "Well, adolescent really(19). Like Howard the Duck, Kazaam was a movie I loved as a child but looking back on it I was shocked at how low my taste buds were as a kid. Granted, there are some funny moments specifically the ones with the flying toasts and the bicycle race. And it is not the worst movie of 1996, Ed and especially Bio Dome are worse. However, the special effects are really quite substandard, and the rest of the production values are of direct to video quality and shoddy ones at that. The story is predictable with only a few worthwhile scenes to favour, the sight gags suffer from poor comic timing and the script is childish and simplistic. The characters I really dislike here, the kid is annoying, the villain is one of the lamest I have seen in a long time while Shaquille O'Neal's Genie with his awful rapping(then again I dislike rap intensely, and that is the least problematic of his performance) grated on me fast. The acting doesn't fare much better either, while the direction is literally non-existent and the soundtrack is only tolerable if on mute. This is of course my opinion, disagree all you want, I guess I just didn't like it. 2/10 Bethany Cox",
            "review_date": "2023-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Filled with terrible acting, unlikable characters, creepy undertones, outdated effects, a terrible need to be rad, filled with cliches, two plots going on at once, abysmal rapping and overall just a very boring movie. I walked in expecting a movie that is so bad it's good or at least just an entertaining kinda bad, but nope it is incredibly boring and extremely bad!",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ridiculously Bad. The acting by Max is ok but Shaq is a unique kind of horrible. The supporting cast is generic and forgettable but Shaq is the main star and just makes the acting bad. The cinematography is bad also with terrible shot fight scenes and music numbers that are shot bad as well. The music is horrible in this. The editing & pacing are equally awful with things just happening and when there is any focus its marred by terrible special effects and a hilariously bad plot. It's such a misguided concept of a film that does have a certain charm at times. Honestly stay away from this.",
            "review_date": "2022-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What the **** were they drinking?!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie. What a masterpiece. It got me through a really rough patch. Ily Kazaam! The jellybean on the stairs scene really resonated with me as an actor. ILYSM 😍😍",
            "review_date": "2021-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In this Touchstone release, Shaquille O'Neal stars as a genie opposite a kid named Max who found him, played by Francis Capra. This movie has a reputation for being a great example of a bad movie, and it lives up to that reputation. Shaq may not be the best actor, but he has better acting examples under his belt than this movie. I think the writing is the biggest problem in this film, the audience can't connect with the characters as they are all introduced as self-serving and stuck up. The only character in the movie I felt for was Max's mother, played by Ally Walker. About halfway through the film, the movie seemed to become a cheap attempt to further Shaq's rap career, but he isn't a good rapper and none of the musicians he performs with are really any good either. The ending could have been satisfying if they had properly set it up earlier in the movie. Overall this movie seemed to be a cheap money grab using Shaq's name as the draw. Make a hard pass on this movie!",
            "review_date": "2021-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shaq hits the free throws with this one..",
            "review_date": "2021-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would have given it a zero but I can not, the only part of the movie that mattered was seeing Shaq be a god at the end of the movie, 1:22:40",
            "review_date": "2021-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, original, and containing Shaquille O'Neil!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2021-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this film is a failure, it was a punishment in my eyes.",
            "review_date": "2020-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kazaam I think the two that are the best in this film are Kazaam portrayed by Shaquille O’Neal & Francis Capra portrays Max. They are the two characters developed the most. However the problem I see in this film is not much more is developed with the other characters to make me care about them. The parents I don’t have much sympathy for either. Both sides show that they are flawed characters. There is also not much time we see them with their parents before they leave the parents out of the scene. Their is not enough back story provided concerning why the parents got separated. The bad guys and the gangs are not well developed either. This film has funny scenes such as the French toast flying around. Kazaam taking a shower but no water touching the floor. The film works best when Kazaam & Max are paired up. But there is not enough time to get invested in the other characters to care which side to stand for or against. This has so early visual effects which look cartoony rather than real such as Kazaam with magic sparks coming out flying around the room that looked false. I thought one of the odd visual effects was turning one of the villains into a ball. ",
            "review_date": "2020-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Shaq film that kneecaps his charms with a script that seems written in 10 min. max.",
            "review_date": "2020-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Peter is married to Lois Griffin and is the father of Meg, Chris, and Stewie. He also has a dog named Brian, with whom he is best friends. He has worked at a toy factory and at Quahog's Brewery. Peter's voice was inspired by the security guards that MacFarlane heard at his school. His appearance was a redesign of the protagonist Larry from MacFarlane's previous animated short films The Life of Larry and Larry & Steve. He has appeared in several pieces of Family Guy merchandise, including toys, T-shirts, and video games, and he has made crossover appearances in other shows, including The Simpsons, South Park, Drawn Together, American Dad!, and Family Guy's spin-off series The Cleveland Show.\"(McFarlane 1999).\n\"Peter Griffin is the main character of the American animated sitcom Family Guy. He is voiced by the series' creator, Seth MacFarlane, and first appeared on television, along with the rest of the Griffin family, in the 15-minute pilot pitch of Family Guy on December 20, 1998. Peter was created and designed by MacFarlane himself. MacFarlane was asked to pitch a pilot to the Fox Broadcasting Company based on Larry & Steve, a short made by MacFarlane which featured a middle-aged character named Larry and an intellectual dog, Steve. After the pilot was given the green light, the Griffin family appeared in the episode \"Death Has a Shadow\".",
            "review_date": "2020-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "remember when shaq use to act? yeah I don't either. I haven't seen this since I was a kid and even then I knew it was bad.",
            "review_date": "2020-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Silly, but it's Shaq!",
            "review_date": "2020-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I dont understand the negative reviews to this movie. Personally it is my favorite movie of all time. It is very funny. My favorite parts of the moive is when former NBA star Shaquille O'Neal is  on screen.",
            "review_date": "2020-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "He's more of a rhyming genie than rapping genie. Im not sure whats worse. This movie or Steel starring Shaq. Who am I kidding this is worse.",
            "review_date": "2020-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, the 2000 hit spoof film Scary Movie was right. This is a scary movie. Shaq's acting is one thing, but the, presumably unintentional, implications of slavery and pedophilia make this much closer to a horror movie that was converted into a lighthearted family comedy halfway through. And even if you're oblivious to all of that, there's still the matter of a script content to fall back on genre cliches, an awful plot and a director whose heart really wasn't in it. A pointless film that even 11-year-olds are likely to roll their eyes at.",
            "review_date": "2019-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Siskel put it best: \"It's marketing, not moviemaking\"—and without any hint of cinematic magic, you'll wish you could get those 90 wasted minutes back.",
            "review_date": "2019-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I absolutely loved this movie when I was a kid... Watched this so many times... Just watched it again recently for the first time in probably 27 years, and I have to say it's not quite what I remembered... A lot more plot holes and Ridiculousness... But the Nostalgia still got to me",
            "review_date": "2019-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent premise can't save this painfully unoriginal and cliche filled mess, as this film is the definition of Lazy.",
            "review_date": "2018-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was pretty awful.  It might have been a little better without the rapping.",
            "review_date": "2018-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is going to be a quick review, Kazaam isn't a family comedy, it's a horror movie, if you don't believe me well as they said in Scary Movie, \"you haven't seen Shaquille O'Neal act\"",
            "review_date": "2018-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Many critics like to point out all the flaws in a movie instead of just enjoying the movie.  Was it as big as space jam? No. Can shaq act better than michael Jordan? Absolutely. Shazam was a decent movie that was never intended to be an oscar winning film. Just a feel good film to sit back and enjoy.",
            "review_date": "2018-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shaqueille O'Neal, I can't believe you got put in this stupid excuse of a movie. You deserve much better than that. Slapping an athlete into movie is one thing, but having a lazy crew won't cut it either.",
            "review_date": "2018-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was there a director on board?",
            "review_date": "2017-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So bad...it\u0092s actually good.",
            "review_date": "2017-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The special effects for this film still hold up, but not enough to show potential in Shaq's acting range!",
            "review_date": "2017-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The humor is really bad, Shaquille O'Neal's acting and rapping are atrocious, and Shaq's role in this movie can be considered extremely racist and pedophilic. This movie is a disgrace to genies everywhere!",
            "review_date": "2016-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shaquille O'Neal's finest work.",
            "review_date": "2016-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is solid proof that Shaq can't act, and that he should've just stuck with basketball",
            "review_date": "2016-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly a cinematic masterpiece. Shaquille O'Neal is an actor of the ages, he portrays the role of a rapping genie like nobody else could have. I would've liked to see a sex scene thrown in there too between Shaq and a stray dog, but you can't have everything, can you? It is truly the best film on this planet, and anyone who hasn't seen it is out of their mind. To be perfectly honest, my one wish in life wouldn't be to win a million dollars, or to marry the girl of my dreams, or to even have every small puppy in the world, no. What I want, is that in 500 years, for Kazaam to be the movie shown in elementary schools to represent my generation. I would rate this TWENTY-five stars if I could. In short, I freaking love Kazaam.",
            "review_date": "2015-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "classic film to watch Shaq be a rapping Genie of the boombox.   a good bad movie.",
            "review_date": "2015-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The trail-blazer of crappy movies staring athletes.",
            "review_date": "2015-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No one comes off looking good in this dud.",
            "review_date": "2015-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible movie but not worst of all time. I like shaq but after seeing this movie I lost some respect for him.",
            "review_date": "2015-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ya' know, when you're really good at something, stick with it. Just because you excel at, let's say, coal mining, doesn't mean you should think, \"Hmmmm, you know what? I'm SO good at coal mining, I'm gonna branch out and become a brain surgeon.\" So I'm sorry, but when superstar athlete, 7-foot-tall, 324-pound Shaquille O'Neal decided he could act? Someone should have let the guy know that's not how life works. And oh, by the way, you have the acting abilities of a tree stump. The inimitable yet often misunderstood \"Shaq\" stars in this film travesty as a genie who gives a picked-on boy three wishes. Well my three wishes are: 1) That the United Nations bans Shaq from ever stepping in front of a camera anywhere on Earth ever again, 2) That every athletic contract include a clause preventing athletes from pursuing film careers, and 3) That Lena gets a lifetime Grammy, it's long overdue. And so you're producing \"Kazaam\" and you get a giant acting novice to star, so who do you hire to direct, to help bring forth what you hope will be a good performance from this lumbering jackass? Starsky! F*cking Starsky! Yes, '70s TV icon Paul Michael Glaser directs. And just to top things off, they throw in a cameo by boyband the Backdoor Boys...er, I mean the Backstreet Boys. So that's supposed to be the recipe for a smash hit film: a jock who can't act, a '70s TV reject, and a talentless '90s 'N Sync ripoff. Okaaaaaaaay. Needless to say, I cannot recommend this film, not even to watch as a joke just to see how bad a movie can be. If you want to do that, watch \"Beaches.\"",
            "review_date": "2015-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not very good, has not aged well, but still kinda fun for light, family fare that's very reflective of the time it came out.",
            "review_date": "2014-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"FUN!\"\nthat's waht the poster sayed... and they are F****** Liars",
            "review_date": "2014-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was really a charming average movie designed more for kids than adults, but you can enjoy it if your with your 10 year old and enjoy a fantasy. The basic premise is as obvious as the title with Shaquille O'Neal playing the title role and you didn't need to really be an Oscar winner for the role. Besides, anything with Francis Capra can't be all bad, just look at his work on Veronica Mars! Capra was a really cute kid and I found my own son could relate to him as he came across warm and accessible. As For O'Neal, this is a similar role as he played in Steel. If you saw one movie, you saw his style in the other. There is a reason Basketball pay him so much and he'll follow yo that career with one in Law Enforcement, but if you need a big friendly guy for a fantasy movie, he will be your ticket.",
            "review_date": "2014-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epicly bad....its just so bad it's funny....shaq just can't act and the plot is preposterous",
            "review_date": "2014-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Half assed 90s kids movie with Shaq as a rapping genie. Need I say anymore? One of Shaq's many career ruining shots at acting.",
            "review_date": "2014-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When Max, is chased by bullies into an abandoned warehouse. He bumps into an old boom box and manages to release Kazaam (Shaquille O'Neal), a genie who has been held captive for thousands of years. In order to stay free, Kazaam must give Max three wishes. don't waste your time with this.",
            "review_date": "2014-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not good, but the level of hate people have for it kinda baffles me. Trust me: there were MUCH worse movies that came out of 1996.",
            "review_date": "2014-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as terrible as everyone says, but way worse than it sounds on paper.",
            "review_date": "2014-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie should be happy that when I first praised it I was too young to know any better...",
            "review_date": "2013-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lame, boring and annoying",
            "review_date": "2013-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are a lot of reason of why NBA players should do commercial instead of doing a movie. But for this movie gives a perfect example why.",
            "review_date": "2013-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At least it's better than Shaq Fu. PASS",
            "review_date": "2013-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I completely disagree with the rest of the close minded reviews. This film is old school and very cheesy, yes, I get that. open minded people find these kind of movies worth watching. I know its no where near being a great movie, but for the 90's, shaq, and being an old school movie is what I loved about it.",
            "review_date": "2013-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's plain stupid, but in a fun bizarre way",
            "review_date": "2013-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The completely ridiculous premise of Shaq playing an ancient genie, once you get past this its actually not that bad a film. The story of a bullied boy finding a rare lamp with a genie inside.\n\nI mean it veers more on b grade but it does have a story & really it's the acting that lets this one down.\n\nInteresting also as this is a prime example of early CGI through out the film, since the technology was so new the visual effects are now very dated. \n\nIt's a simple film that's really going to appeal to 8-10 years old & Shaq's acting is better than Michael Jordan but that's not saying much.",
            "review_date": "2013-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Plot goes allover the place and nothing really makes sense, the movie just seems to do whatever it feels like and breaks its own rules it abruptly makes. But with a movie starring Shaquille O'Neal as a genie... I mean, what would you expect?",
            "review_date": "2013-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best worst movies.",
            "review_date": "2013-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fuck the haters shaq in a genie outfit is awesome... 4% really rotten tomatoes. I just have this to say about people that dont like kazaam.... Fuck you... I AM     KAZAAM",
            "review_date": "2013-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The idea of Kazaam is hilarious because it's Shaquille O'Neal, a basketball player in the role of a genie. Unfortunately, that's the funniest thing about it. I expected Kazaam to be bad, but I wanted bad comedy rather than bad drama.\nKazaam is too gritty and crime based to be a kids movie, too childish to be entertaining for anyone else. \nIt also features cheap-ass visuals, Incredibly fast pacing, ridiculous plot dynamics and a distinct lack of creativity, which I feel can largely be attributed to the poor direction given by Paul Michael Glaser.\nObviously Shaquille O'Neal cannot act for crap, but his role as a cult figure and hilarious commoditization is what makes him ideal for the role of Kazaam, and rarely there's a small laugh to be had.\nBut with Kazaam, the screenplay was probably written by a 5 year old who's watched every Disney movie and attempted to fuse the moral lessons with a  loose rehash of the plot from Enemy of the State.\nThe cinematography is poor, as is the film editing and the ending with the final wish is was too illogical which is ironic because it's a movie about a rapping genie.\n\nThe few minor positives are that it's funny to say that you've actually seen this film because of the idea behind it, as well as a somewhat decent performance from young Francis Capra despite being stuck with awful material.\nI guess i also enjoyed the uplifting ending, but it does nothing to change the poor quality of Kazaam one iota.",
            "review_date": "2013-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This rating would've been higher based on my memories of this movie... But rewatching this... My God is this movie AWFUL! The writing is horrendous, the fantasy wish fulfillment is underutilized, product placement is overt, the kid is nasty, Shaq is forced to do a lot of stupid stuff in the name of entertaining kids... Sometimes these kids movies from the 90s are actually alright -- this is not one of them.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't decide which is worse: Shaq acting or singing?",
            "review_date": "2013-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the worst movie ive ever seen",
            "review_date": "2013-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just why? Do we need another flick with an overrated player from a different profession to star in A MOVIE! NOT A COMMERCIAL! Even the weak plot can't save this.",
            "review_date": "2013-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What the hell Shaq? You had such a great career in the NBA, why whore out with a crappy movie like this?",
            "review_date": "2013-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this movie, and I don't know why",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shaq did such a good job he almost left behind his basketball career to act, but then he realized he can come back to movies once hes out of the league",
            "review_date": "2012-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All I remember is that there are giant over-sized pancakes in one scene... strange film.",
            "review_date": "2012-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Poor Shaq can't act.",
            "review_date": "2012-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shaq may not be a whale, but when this came out I was feeling Francis Capra.",
            "review_date": "2012-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was forced to watch this movie repeatedly everyday for 1 month (while baby-sitting my cousins during summer break). At first I though Kazaam was a waste of film... but somehow... he grew on me like an itch that just won't go away.",
            "review_date": "2012-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shaq tried to follow in Michael Jordan's footsteps and make a cool kids movie. He failed.",
            "review_date": "2012-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All I have to say about this movie is that rap absolutely sucks and this movie just gave another reason to hate rap. I'm not really sure why I ever wasted the time recording this off tv.",
            "review_date": "2012-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although I love 90s films, this is one of my least favorites.",
            "review_date": "2012-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everyone has to see this once to understand why Shaq never acted again...",
            "review_date": "2012-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The kind of movie you really wish you could forget you enjoyed at some point in your life. So much bad writing. So much bad acting.",
            "review_date": "2012-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this film is a perfect reason why shaq shouldn't act.",
            "review_date": "2012-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While lame and inept in many regards, and corny and stupid in many others, Kazaam still has a heart buried under all that schlock.\nShaquile O'Neal is fun and loveable despite the awful script (\"Let's green egg and ham it!\") and his admittedly inept acting.\nIt may have been designed as a celebrity vehicle, but it's one of the more benign and inoffensive examples of that sorry genre.\nAny movie where Shaq plays a boombox-dwelling Genie that makes it rain Skittles and Resses Cups after declaring \"Wham, Bam....KAZAAM!!!\" can't be all bad.\n\nA great movie and an enduring classic? No.\nA movie that deserves a status as \"one of the worst movies ever\" as many claim it to be? Definitely not.",
            "review_date": "2012-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You know that free throws are Shaq's weakness? This movie is his worst nightmare.",
            "review_date": "2012-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is almost as terrible as Shaq's free throws",
            "review_date": "2012-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thank god he's not a laker anymore",
            "review_date": "2012-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "another show/movie that i LOVED! good movie, lol",
            "review_date": "2012-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not even Shaq's charisma could save this movie.",
            "review_date": "2012-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Down right awful. One of the worst movies I have ever seen.",
            "review_date": "2012-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "another movie that i remember from when i was a little. good memories...",
            "review_date": "2012-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "SHAQ DADDY as much as this movie is hated on i didnt mind it but i was also a kid watching it",
            "review_date": "2012-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dull, frantic and utterly unwatchable.",
            "review_date": "2012-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am far too biased to accurately review this movie. I LOVED IT.",
            "review_date": "2012-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "haha this is a cool movie!!",
            "review_date": "2012-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know if I could ever make fun of Shaq's terrible free throws the same again...because now 've got this!",
            "review_date": "2012-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know the idea of a genie played by a basketball player with no acting talent who comes out of a boom box and grants wishes to a kid with emotional problems due to his parents' divorce and his relationship with his estranged father, while the genie gets distracted with the beginning of a rap career...SOUNDS like a GOOD IDEA FOR A MOVIE...but somehow none of that managed to click.  Go figure.  TERRIBLE MOVIE.",
            "review_date": "2012-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't realize how much rapping was in this movie. And there wasn't as many quotes as I was hoping for...but i did die when Shaq picked up the dude and said, \"I will never be your slave\"...so wrong...just so wrong.",
            "review_date": "2012-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "hahah, Shaq's big challenge should be to hide any copy of this film",
            "review_date": "2012-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "what rhymes with \"cinematic abortion,\" Shaq Diesel?",
            "review_date": "2011-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i grew up with movie",
            "review_date": "2011-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kazaam has got the reputation of being one of the worst films ever made, and with good reason. I originally saw this when it first came out and thought it was awful, and I was 11 years old at the time. The film is utter garbage. I don't even know where to begin with this film. Well for one, if this was supposed to be an entertaining and fun family film, it definitely doesn't do that. Kazaam is a stupid, pointless, poorly constructed piece of garbage that should never have been made in the first place. This is a film that no one should waste their time on. Director Paul Michael Glaser should be ashamed of himself for directing this drivel. Kazaam is a pointless film, and if you're looking for one of the worst films ever made, then look no further. The acting is awful, the plot is equally bad and so is the directing. There is no redeeming qualities about this film and it's overall, a great waste of time. Watching paint dry is more entertaining than watching this trash. A terrible film that should never have been made, Kazaam definitely scraps the bottom of the barrel of bad ideas, and has nothing good going for it. The only good thing about this film is the end credits. Avoid this film like the plague; you'd be glad you did. This is simply an awful film that's really not worth watching.",
            "review_date": "2011-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great crappy 90's film for kids who don't care about plot.  For some reason i owned the novelization (if you can call it that) as a kid.",
            "review_date": "2011-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still remember watching it years ago.  The acting's not that great, but I enjoyed when I watched it.",
            "review_date": "2011-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shaq or you were a great basketball player, but please stop your ambition in acting. The audience will say 'Thank you'!",
            "review_date": "2011-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wanna see a horror movie? Watch Shaq act!",
            "review_date": "2011-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Has its moments (when it actually feels like a family movie), but pushing a kid down an elevator shaft isn't one of them.",
            "review_date": "2011-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had the unfortunate circumstance of seeing this movie when it first came out. At that time I was a wee little tike and I didn't know that a bad movie could exist. Boy do I feel sorry for my former childhood because I saw a whole heaping pile of crappy movies when I was young. If you're lucky enough to not have seen this movie then you are in for a real ride through hell if you decide to do so. That's what I had to experience when I watched it again, and I could barely tie my arms down to prevent me from scratching my eyes while they were in pain. Its movies like this that should never be made, but for some reason Hollywood keeps on making them. Why? Don't ask me, I'm not a mind reader (that is, if they have minds).\r\n\r\nThe movie fails to satisfy anyone who sees it, unless you're David Armstrong that is. Shaq has got to be one of the worst actors I have ever seen, but I can't really say that because of one tiny problem: he's a BASKETBALL PLAYER, not an ACTOR. The plot doesn't make any sense and fails to give anyone a feeling of interest or excitement. The mere fact that it is irrefutably impossible for something like this to happen helps to make that statement more accurate. There's a reason we don't see Shaq in movies anymore, and this is without a doubt one of them. Don't see this movie unless you feel that you have to see how bad it is, but be sure to wear goggles so that you don't end up doing what I almost did. \r\n\r\nP.S.- for those of you who are asking me if I've seen the Nostalgia Critic review of this film then I'll say yes, and it was funny. ☺",
            "review_date": "2011-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really don't understand why so many people hate this movie so much. I mean OK the premise is really stupid, being about a genie trapped in a bottle falls into a boom box and becomes a rapper, ok that is a stupid idea but aside from that its really not that bad of a movie",
            "review_date": "2011-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "BORING!! Bad acting.",
            "review_date": "2011-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Academy award winning performances",
            "review_date": "2011-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great acting, great story. A MUST SEE!",
            "review_date": "2011-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the worst films ever made.\r\n\r\nSeriously? Shaq as a Genie?\r\n\r\nThe reason why I gave this a 20 percent, is because two scene's made me laugh and compare it to \"Batman and Robin\", \"Battlefield Earth\" or \"Son of the Mask\", it's kinda better.\r\n\r\nEverything else...is crap.\r\n\r\nFirst, Shaq sucks at rapping. While he's singing, one of the lyrics is, \"let's Green Eggs and Ham it\". That's like a five year old writing a rap song. Second, Max is annoying and the villain is just a wannabe bad guy with thick eyebrows. Third, is this movie about slavery? Because in one scene, Max owns Kazaam after he uses up his last two wishes.\r\n\r\nOverall, this movie is just awful. If you're looking for a good movie with a genie, Watch Disney's, \"Aladdin\". That movie has a Genie that can sing and make people laugh. He's also voiced by Robin Williams. A \"GOOD\" actor.\r\n\r\n1/5",
            "review_date": "2011-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I give it a full star just because I think it's actually BETTER than some kids movies today.",
            "review_date": "2011-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest crappy movie ever made. Shaq as a rapping genie? Where's the sequel?",
            "review_date": "2011-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No doubt in my mind Kazaam is one of the worst movies ever made if not the absolute worst. Even as a kid, I couldn't help but laugh unintentionally. I do think Shaquille O' Neal is awesome, but this is a terrible and cheesy movie that could go on the cob because there is so much corn in it.",
            "review_date": "2011-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film stars Shaquille O'Neal as a rapping genie who showers in front of the 12-year old main character. That about sums it all up.",
            "review_date": "2011-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie gives kids with little hope in life a reason to believe in a better tomorrow.",
            "review_date": "2011-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Actually when I saw for the first time this movie I was very young in age and I remember that was one of the worst  movies I had ever seen,was crappy,with bad actors and a script for crying.This movie proves what we all know: Athletes need to stick to sports.I admit that it never looked like an Oscar-worthy movie,but almost everything  about this film is horrible.The characters are either unlikable or stupid,the plot is not even worth mentioning, the dialog is a joke,and Shaq is only a quarter of the problem.Hell,even if Denzel Washington played Kazaam this movie would still be a joke.I know that the movie only drew ANYBODY was because Shaq was so big (no pun intended) at the time.I honestly cannot think of a single positive thing to say about this waste of time.Shaq should have put the time had used to make this movie toward practicing free throws.\r\n\r\nBetween the awful acting,the terrible script and the lousy effects,this movie is just plain bad.This is how bad this is,Shaq literally slam dunks the villain to defeat him! If that's not a plug in for his career,I don't know what is. The kid Max has no likable qualities,he has a very loving mother and a possible step father who cares for him, yet he acts like a total jerk because he's not getting his way with not having his dad around who is a criminal no less! Even when his criminal father kicks him out of his life, Max still does everything to save him,sick isn't it? Shaq, I don't know the writers were thinking.Maybe that it's so funny that a giant basketball super star should be a genie and it's a great way to make a quick buck for those sucker parents who's kids are begging to see the film.I don't know how to say this other than just say it,it really is as bad as everyone says it is if not worse.Trust me,don't waste your sanity on this horrible movie,Shaq's acting is enough to make you wish this movie never existed in the first place.\r\n\r\nThe film starts with a kid who is pretty jerky keying the lockers in the hallway of the school.This kid is somehow 'misunderstood' and you know that no matter how selfish and horrible he is,by the end of the film he'll have learned something and grown.Eventually,while the neighborhood bullies are in the middle of pummeling him,the genie Kazaam (Shaquille O'Neal)is accidentally released and insists on giving the brat three wishes.But,the kid doesn't believe him and the genie's magic seems a tad rusty.\r\n\r\nEventually the brat does realize that Kazaam is for real. However,unlike most kids,he withholds making his wishes so, in the meantime,Kazaam is forced to follow him around everywhere - like his own personal servant.And, according to the cliché,you know that by the end of the film, Max and Kazaam will have become lifelong buddies and a bunch of tears will be shed.Oh,and Max will have come to terms with his absent father and mom's fiancé.Apparently this genie is a bit of a social worker in addition to being a granter of wishes.\r\n\r\nOverall,it's a terrible film that is due mostly to writers who were certifiably insane.Yes,folks,with a messed up message,bizarre non-kid friendly material and horrible characters,this is one wretched film.Sadly,given the idea and actors,it's hard to imagine the final product turning out much worse.The only positive thing about this movie is that reminds me my childhood!!!",
            "review_date": "2010-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sooooo bad!! But I got to respect Shaq he has some good one liners and is a great athlete and funny in real life. Im not surprised this film was a box office bomb..",
            "review_date": "2010-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "another film i was surprised at mainly because of all the bashing it has had from critics and people and i love this movie i thought it was funny entertaining and fun for the whole family",
            "review_date": "2010-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shaq's charismatic, but wow.  Just wow.",
            "review_date": "2010-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was an interesting movie.  It was ok, but pretty cheesy.",
            "review_date": "2010-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i grew up with movie",
            "review_date": "2010-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THis movie is an atrocity to cinema, and it would be better for your time to spend the movie watching Twilight(yes, it is that bad)",
            "review_date": "2010-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, Shaq may well be the worst actor ever. And, at that, the worst rapper ever. One of the lows of modern cinema.",
            "review_date": "2010-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "genie with a boombox, I AM KAZAAM!",
            "review_date": "2010-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Do not watch this movie. The movie is targeted towards children, but the plot of the movie involves a kid bootlegging a music tape.  Kids can't understand that, nor do they care.  Furthermore, Shaq's rap lyrics in this horrendous piece of trash are awful.",
            "review_date": "2010-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best example of horrid 90s films...",
            "review_date": "2010-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is a bad movie...\nBad cast...\nBad direction and silly story",
            "review_date": "2010-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the best Shaq movie ever. With Steel in a close second",
            "review_date": "2010-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this movie on TV a lot when I was a kid, at first I thought it was kinda fun, but eventually it got extremely annoying.  Now, I can see it for what it is: a movie about a kid who gets a genie to help him beat up bullies.  The genie is played by Shaquille O'Neal, a big, tall, basketball player, who can't act.  This movie is too cheesy, it's like the cheese got burnt, it's so bad.  Do not watch this movie, there are many better movies with the same theme.",
            "review_date": "2010-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a lot better when I was a kid, this sucks.",
            "review_date": "2010-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This rating would've been higher based on my memories of this movie... But rewatching this... My God is this movie AWFUL! The writing is horrendous, the fantasy wish fulfillment is underutilized, product placement is overt, the kid is nasty, Shaq is forced to do a lot of stupid stuff in the name of entertaining kids... Sometimes these kids movies from the 90s are actually alright -- this is not one of them.",
            "review_date": "2010-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Apologies in advance for this review, as it indicates that I attempted to take this film seriously. It is a visual encyclopedia of every outlandish negative stereotype one could ever attribute to 90s cinema. No fun, nostalgic kitsch value whatsoever, just a headache in its place. Also, obligatory: the only thing Shaq does worse than shoot free throws is act, etc., etc.",
            "review_date": "2010-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hmm....this movies looks good. Wait a second. Shaq is in this movie? Goodbye.",
            "review_date": "2010-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shaq: Do I Have To Really Have To Do This? I Don't Want To Be A Terrible Rapping Genie! Do I Have To Be A Stupid Genie?\r\nPaul Michael Glaser: YES YOU DO!! YOU'RE GOING TO BE A GENIE WHO SUCKS AT RAPPING! NOW GO SAY LET'S GREEN EGG AND HAM IT!\r\nShaq: No, I'm Not Offending My Fans And The Fans Of Dr. Seuss!          Paul Michael Glaser: GO DO IT NOW OR YOU WON'T GET MONEY FOR YOU AND CHARITY AND FAMILIES OVER THE WORLD!           Shaq: Ok, Mr. Glaser... Let's Green Egg And Ham It! This Movie's A Piece Of Crap!!!!!!!!",
            "review_date": "2010-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you don't like Kazaam then you must have no sense of humor. Or a very dry, boring one. Either way you suck.",
            "review_date": "2010-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly this being made was a mistake by everyone involved.",
            "review_date": "2010-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think the movie was all right. The kid in the movie was kind of distant and not able to connect with. Shaq did a great job though. He made the movie fun.",
            "review_date": "2010-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "forget it, this is awesome!",
            "review_date": "2010-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie really annoyed me. The kid (Francis Capra) is a little brat who spends most of his time on screen acting like a smart-ass and antagonizing everyone he comes across, including the audience. He also tries to establish a relationship with his father, who is involved in organized crime and yet Max still feels he is a viable alternative to his mother (Ally Walker) and his would-be step-father (John Costelloe), who are not that bad. Did I mention he is also stupid? As for Shaq...well...let's just say he is better on the court (well, in his prime anyway) than onscreen. His performance comes off as silly and awkward, though to be fair he does seem to have fun in the role. The two characters do not get along well during any point of the film with the exception of the end (which is kind of required) and in the middle when they engage in a god-awful rap duet, which is one of unfortunately many dumb scenes throughout the picture.\n\nThe worst part about this movie, even more from the performances, is that it does not really make sense. It is supposedly aimed at kids but it spends a lot of time focused on a bunch of criminals and people hanging around clubs. Were the filmmakers trying to bring in Shaq's older fans? I am not sure but whatever they were trying to do, they failed. It is a little odd to be putting that in a film that also features the basketball player riding around on a magical bicycle and making junk food fall down from the sky. As a result, it makes you lose focus on the plot and gives you less reason to about what happens next. It is not helped by a number of plot holes. I will not mention all of them, but here is one example: a stereotypical Middle-Eastern crime lord (Philip Santella) knows all about Kaazam's powers and limitations despite having very the little knowledge about him. Maybe he knows about genies based upon what he learned in his homeland, but we will never know.\n\nWell, there is nothing else I can really say except...the film sucks and I do not recommend it.",
            "review_date": "2010-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not sure why anyone ever thought that this would be a good idea.",
            "review_date": "2010-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "makes the worst movies of all time list",
            "review_date": "2010-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So bad, but it's undeniably hilarious. The 90s really did have some weird concepts, it makes the 80s look like child's play. At least those movies make sense in their own way. 90s movies often don't even make sense to themselves. This is very much a modern urban version of Aladdin, only the Genie is 7 ft tall and completely crazy.",
            "review_date": "2010-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it as a kid ,but watching the NC review of it makes me realize what a piece of shit this was.",
            "review_date": "2010-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shaq isn't suitable to be an actor.. this movie is really horrible",
            "review_date": "2010-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I laugh every time I see this movie, because it is so bad that I love it. Everyone nows a basketball player like Shaq can't act! By now, people shouldn't care about that, when they watch this movie. Notice on the cover the only critic concenses is FUN! They forgot the NY at the end!",
            "review_date": "2010-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "haha, wow. major 90's flashback of NBA player poorly trying to act.",
            "review_date": "2010-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is equivalent to the prize you get in the bottom of a box of Tasty O's.  It will leave you dumbfounded, angry and the feeling like you eat paint chips.  If you enjoyed this movie I apologize for making fun of your disability.\r\n\r\nTo aggrivate me more you can't give this a 0%, so it gets a 10% by default.  Now I'll go pick the Nerdy kid for Street Hockey to complete my kind streak.",
            "review_date": "2010-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "AAAAH!  I remember this movie!",
            "review_date": "2010-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok yea, this movie is pretty bad. My rating isn't as low cause I'll admit it is enjoyable to watch when you're a kid like I did, but of course as a teen I see this movie is pretty lame and corny.",
            "review_date": "2010-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lying awake last night with a million thoughts racing through my head I desperately tried to think of something to do that would calm me down. Looking through my DVR I passed movie after movie until I came across this one, and a wave of nostalgia rushed over me. I thought \"I haven't seen, or heard of Kazaam in at least 8 years. I wonder if it is any good.\" So I turned it on and wouldn't you know it... it was awful. Not just awful, but awful awful.\r\n\r\nWith a movie starring Shaq you pretty much know you're in for trouble, but surprisingly Shaq isn't the worst part of this movie. Yeah his acting, rap, and overall repertoire of skills (outside of basketball) stink, but he's still charming in a \"I have no idea what I'm doing\" sort of way. He's funny to watch because you can tell he feels like an ass for being in the movie, and it shows on the screen. \r\n\r\nThe plot for this movie is as stupid as the poster. Long story short, rapping genie teaches kid how to not be a prick to his mom. The End. The plot stinks, the characters are bland and uninspired, and the musical numbers are torturously bad, but it's the fact that the movie is supposed to be taking seriously that makes it so awful. \r\n\r\nMy memory of this movie was indeed better than the movie itself, and I wish I had let this movie remain a good memory, instead of it becoming more pent up rage. I wouldn't reccomend this movie even to my worst enemy. It isn't the worst movie ever made, but it's the worst move to star an athlete ever made.",
            "review_date": "2010-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LOL!!!!  Come on, Shaq.  Stick to 15 minutes a game in the NBA as the 8th man!",
            "review_date": "2010-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not only one of the worst films ever made, but proof that Shaq should just go away already.",
            "review_date": "2010-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "HORRIBLE. Sorry bad it's good....no not really.",
            "review_date": "2010-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hated this movie even when I was a kid, and that's saying a lot because I liked a lot of stupid movies as a kid.",
            "review_date": "2010-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that definitely seemed to have a lot more power when I was younger. As I rewatch it as an adult the poor acting is evident, although not entirely unreasonable as it is clearly meant to be for kids. I still find it entertaining enough with the exception of Shaq's atrocious attempt at rapping. (First viewing - Childhood)",
            "review_date": "2010-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was really good, brought the kid back out in me again.",
            "review_date": "2010-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shaq should have always just stayed with what he was good at......basketball.",
            "review_date": "2010-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "shaquile... who doesnt hate him? i only like him at basketball. hes a terrible actor, and plays in alot of horrible films. and heres another one! kazaam, a racist film wich makes you want to watch more disney classics. its boring, unoriginal, dull and incredibly racist. why? A BLACK PERSON AS A GENIE!? THATS SLAVERY! boy does this movie suck.",
            "review_date": "2010-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Proof that, with very few exceptions, basketball players can't, and probably shouldn't try acting.",
            "review_date": "2010-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kazaam has an unoriginal premise that doesn't work to well with this cast to begin with and fails to impress its audience on a few different levels.",
            "review_date": "2009-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"kazaam\" is a comedy film about a genie played by shaq who first of all shaq can't even act",
            "review_date": "2009-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "haha i thought i'd just imagined this movie having been real.",
            "review_date": "2009-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I turned it off when I was a kid: need I say more? Oh wait, Shaq is in it.",
            "review_date": "2009-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, this really is just about as bad as what I have been reading in the critic reviews. What really kills the film is Shaquille O\u0092Neal\u0092s bad acting and the kids character is so unlikable that you don\u0092t care at all about the movie. A fatal mistake. In addition, the story is stupid and the direction is poor.",
            "review_date": "2009-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, this really is just about as bad as what I have been reading in the critic reviews. What really kills the film is Shaquille O?Neal?s bad acting and the kids character is so unlikable that you don?t care at all about the movie. A fatal mistake. In addition, the story is stupid and the direction is poor.",
            "review_date": "2009-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worse movie of shaqs career.",
            "review_date": "2009-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I remember watching this in the theatre when I was six.",
            "review_date": "2009-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The kind of movie you really wish you could forget you enjoyed at some point in your life. So much bad writing. So much bad acting.",
            "review_date": "2012-11-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I Love this movie so much, Truly life-changing It makes me smile so much every time I see it. I love the character development and the plot. It cured my cancer and my ED, I really don't know what I would do without it anymore. I watch it atI Love this movie so much, Truly life-changing It makes me smile so much every time I see it. I love the character development and the plot. It cured my cancer and my ED, I really don't know what I would do without it anymore. I watch it at least 7 times a day and have bought over 7,000 copies. Shaq's face is the last thing I see when I go to bed and the first thing I see in the morning. It lightens my mood all of the time! I Love Shaq and his muscles I want him to pick me up like a baby and smother Icy-Hot all over my body. I love all of Shaq's work like Space Jam,Kazaam,Billie Jean. His music and his soft voice helps me with my love life and my wife doesn't complain either. Watching this movie is a whole entire different sexual experience. Every time I watch it calms me down and doesn't make me hit my kids(They are 3 and 6). Shaq's rock hard abs are the only thing stopping me from dropping my kids Chris Brown 1-2 style. So anyways it's and Okay movie.",
            "review_date": "2021-03-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Entertaining fable for kids, and not at all \"dark\" ( as some critics said it was) by present day standards and sensibilities.",
            "review_date": "2007-09-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is not merely a waste of time; it has also caused me to lose the ability to have children. Shaq should stick to missing freethrows and fouling people, rather than trying to act in any capacity and thus costing people the ability This movie is not merely a waste of time; it has also caused me to lose the ability to have children. Shaq should stick to missing freethrows and fouling people, rather than trying to act in any capacity and thus costing people the ability to reproduce.",
            "review_date": "2006-02-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ok, so I can't tell if Ryan, and Connor K. and Jake are being sardonic, but i really hope they are cuz this is just a terrible movie. But, if u love marijuana and stupid funny movies (which i do) this is definitely a 10.",
            "review_date": "2006-02-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I am currently plummeting to my death under the golden gate bridge and Kazaam (1996) directed by Paul Michael Glaser and starring Shaquille O'Neal is the only thing I can think about. Kazaam (1996) directed by Paul Michael Glaser and starringI am currently plummeting to my death under the golden gate bridge and Kazaam (1996) directed by Paul Michael Glaser and starring Shaquille O'Neal is the only thing I can think about. Kazaam (1996) directed by Paul Michael Glaser and starring Shaquille O'Neal was the only meaningful thing to occur in my life. Thank you Shaq. For everything.",
            "review_date": "2023-03-16",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "rt_rating": 2.0,
    "rt_summary": "A genie named Kazaam (Shaquille O'Neal) has been sealed up for thousands of years, until one day he is accidentally freed by Max (Francis Capra), who is on the run from a local gang. Kazaam explains to the youth that he belongs to Max until he grants three wishes, but what Max really wants is to get to know his estranged father. When the genie, who considers trying his hand at a music career, forgets about his young master, Max is attacked by villainous club owner Malik (Marshall Manesh).",
    "meta_rating": 5.8,
    "meta_summary": "When young Max bumps into an abandoned boom box, he's shocked when it releases a tall, Black genie named Kazaam (O'Neal), who grants the kid three wishes. The two become friends, and Max wants Kazaam to help him track down and ultimately save his father from criminal entanglements."
}