{
  "title": "Dark Waters",
  "rating": 8.0,
  "release_date": "2019-11-22",
  "genre": [
    "Biography",
    "Drama",
    "History",
    "Thriller"
  ],
  "summary": "Inspired by a shocking true story, a tenacious attorney (Mark Ruffalo) uncovers a dark secret that connects a growing number of unexplained deaths due to one of the world's largest corporations. In the process, he risks everything – his future, his family, and his own life - to expose the truth.",
  "critic_reviews": [
    "The brilliance of Dark Waters is that it is able to lay out the case against DuPont without getting too wonky.",
    "A great movie like Dark Waters reminds us of what happened, of just what the “system” failed to do to safeguard us. And it reminds us of what a legal crusade looks like — a years-long grind of discovery, depositions, evidence and trials, and to be thankful for dogged, dull pluggers like Robert Bilott who stopped a mass murder in progress, armed with only a degree from “a no name law school.”",
    "Riveting, responsible and deeply unsettling, a first-rate film like Dark Waters is a rare and welcome chapter in the dramatic fabric of how one unlikely person can make a big dent in the world of social injustice.",
    "What gives Dark Waters its singular texture is that Todd Haynes (“Carol,” “Far From Heaven”), who has never made a drama remotely like this, colors in the scenario with an underlying dimension of personalized obsession.",
    "Ruffalo optioned the rights to Nathaniel Rich’s original article and has an executive producer credit on the film; clearly, he has a stake in the material. The actor is excellent as reluctant hero Bilott, muting his natural charisma to create a character who is both taciturn and generous, determined but socially ill at ease.",
    "This is the kind of issue-driven cinema that used to win Oscars. That Dark Waters and Just Mercy weren’t mentioned during awards season is as troubling as it is perplexing.",
    "Dark Waters is a movie that works marvellously well within its own generic terms, and perhaps after the fey disappointment of Todd Haynes’s previous, rather insufferable fantasy Wonderstruck, this tough, clear movie was what Haynes needed to clear his creative palate.",
    "Haynes carefully navigates the risky terrain of presenting real people (who are still among us) and facts in a scripted feature film, artfully blurring the lines between documentary and drama.",
    "Haynes plays up the melodrama, and the film moves along without a lot of surprises. But that gives it a certain momentum — a momentum personified by Bilott in the storage room, sorting through boxes. It’s not flashy, but it’s how you get the job done.",
    "The bad guys have all the money but at least we have indie filmmakers and movie stars like Ruffalo (who vigorously and successfully campaigned to keep the frackers out of New York that caused havoc across the Delaware from him in Pennsylvania). Dark Waters is hardly a cure, but it keeps the issue aboveground.",
    "What makes it a Haynes film, besides the evocative camera genius of Haynes regular Ed Lachman, is something intangible and mysterious. The director’s admirers will think immediately of \"Safe,\" the 1995 indie classic starring Julianne Moore as a wife and mother who thinks she’s being poisoned by something unidentifiable in the environment. That feeling of dread pervades throughout, and deepens the film’s scarily timely themes beyond the usual demands of docudrama.",
    "Mr. Haynes, a notable stylist whose work is sometimes tinged with surrealism, was an improbable choice to direct this material, though a fine one, as it turns out. Like Rob, the film isn’t flashy, but it is honorable, admirable and improbably stirring.",
    "The combination of Ruffalo’s quietly intense performance and Haynes’ direction illuminates both what drives him and what the cost can be.",
    "The director Todd Haynes’s artistry is hardly detectable in this environmental thriller, yet the film, based on a true story, nonetheless offers a stirring and infuriating story of brazen corporate indifference to employees, neighbors, and the world at large—and the obstacles faced by those who challenge it.",
    "Successfully restraining himself throughout from getting fancy or experimental, Haynes has intently devoted himself to the story and his actors, with strong, unshowy work that ideally serves the tale being told.",
    "The subtle brilliance of its mise-en-scene, from 1980s Ohio boardrooms and rubber-chicken dinners to all-black wait staff and the casual discrimination against women, beds the story in the awful truth.",
    "We’re served both the galvanization and the despair, the victories eked out bit by painful bit and the looming defeat, as an implacable monolith dismisses puny mortal concerns like so many gnats. It’s tough stuff, but it’s worthy stuff too.",
    "Mark Ruffalo is a master at playing a certain type of earnest character who often wears a quizzical expression — not because he’s slow on the uptake, but because he’s the smartest person in the room and he has questions no one else has even thought to ask.",
    "While Dark Waters is something of a let-down for a Haynes film, it’s otherwise sturdy enough. One can admire the commitment of Ruffalo, who plays the role of the modest, decent, semi-accidental hero without vanity or trite psychology.",
    "It will make you mad as hell. So angry, even, that you might wonder why no one has given this opportunity to Todd Haynes before.",
    "As a piece of pure exposition, Dark Waters is interesting enough. But around the hard work and do-goodery, Haynes also provides a sense of crushing dread—the kind of unsolvable paranoia these procedure-bound movies usually work to counter.",
    "At its most controlled and insinuating, Dark Waters is reminiscent of paranoid thrillers from the 1970s like \"The Parallax View\" and \"Chinatown,\" where you know going in that you're going to see a story about how profoundly bad things are, thanks to corporate influence over government as well as the economy, but the extent of the corruption is still shocking.",
    "Where Haynes excels is in teasing out the personal and professional connections that mingle throughout.",
    "While Dark Waters often suffers mightily for being so inert, it always manages to circumvent lulls by embracing Bilott’s persistence, which works as an anecdote to corporate America, whose stranglehold over the country comes through in Edward Lachman’s deathly grey visuals defined by lifeless rural vistas.",
    "It’ll be much too easy to bail on what is a very slow-building first 30 minutes for those watching on a streaming service in the near future. If they make it an hour in, they’ll be pleased to know that John Denver’s “Take Me Home, Country Roads” is prominently featured, as any West Virginia film seems obligated to boast. But outside of that, the lack of respite is rightly suffocating and will be unfortunately repelling for those who approach film as a mindless escape.",
    "In Haynes’s psychologically and atmospherically astute compositions and careful nursing of the emotional impact on Bilott and wife Sarah (Anne Hathaway), it’s more a brittle ache of a quest than a righteous melodrama.",
    "As legal dramas go, it’s quite good; as a Todd Haynes film, you struggle to see the talent for which he’s known.",
    "As a platform for Bilot’s efforts and why they deserve a national profile, the movie has a sincere sense of purpose. It’s a 20-year-old drama that extends into the present, and as environmental concerns continue to escalate, it couldn’t feel more contemporary.",
    "These Waters never quite run as strong or as deep as they should.",
    "Beyond the fundamental horror of corporate greed trumping public-health concerns, the movie -- while often bleak and unsettling -- does find hope in the idea that one ordinary guy can make a difference. Dark Waters' message, though, is something bigger -- namely, that turning the tide is a task that will ultimately require a commitment from all of us.",
    "Ruffalo, as a character more polished and reserved than he usually plays, is compelling as ever; he’s able to convey the sense of time passing, with the case weighing down on him more heavily as years slip by.",
    "Dark Waters is an effective outrage machine: If you like “Erin Brockovich,” you’ll probably like this too.",
    "Todd Haynes’s film intermittently hits upon a few original ways of representing its ripped-from-the-headlines mandate.",
    "A bizarrely strait-laced project for Todd Haynes, Dark Waters lacks dramatic oomph but compensates via a well-mounted telling of a terrifying story, driven by still contemporary concerns and a convincing central turn by Mark Ruffalo.",
    "You do feel Haynes’s touch now and again, particularly in the sense of menace that seeps into a crepuscular law office and in the everyday eeriness that suffuses outwardly ordinary homes that are anything but normal.",
    "Of course we all hate insidious environmental destruction; it’s valuable to have movies about that. This one works fine enough. But let the other less-talented filmmakers make them.",
    "Dark Waters would likely have been a forgettable mediocrity in anybody’s hands, given its fact-based, muckraking limitations. Coming from the visionary who gave us Safe, Far From Heaven,  I’m Not There, and Carol, it’s a crushing disappointment.",
    "Scenes involving Anne Hathaway in particular land with a painful thud. In an attempt to flesh out the “adoring, supporting wife” role, Haynes shoots himself in the foot, bringing much attention to an underdeveloped character, who, despite all the pseudo-feminist speeches, amounts to, yes, the “adoring, supporting wife.”"
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Completely correct and if u search for researches and number of thyroid problems or cancers that are usual somehow it says wright .",
      "review_date": "2020-01-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Horrifying, necessary, and engrossing, \"Dark Waters\" is a well-acted investigative film that delivers a startling rebuke against corporate malfeasance.",
      "review_date": "2020-03-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Interesting story of how evil and soulless large companies can be to make profit. It exposes how deadly Teflon is to everybody, whether in carpets or on pans or in laundry products or in tabacco or fuel. It is truly an eye opener of how theInteresting story of how evil and soulless large companies can be to make profit. It exposes how deadly Teflon is to everybody, whether in carpets or on pans or in laundry products or in tabacco or fuel. It is truly an eye opener of how the legal system is abused and manipulated to the public’s harm. It also show how corrupt the legal process can be.",
      "review_date": "2020-03-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "When done correctly, average movies like this can inform, intrigue, and alarm, allowing the audience a better chance at a perspective they'd not considered before. \"Dark Waters,\" though, is simply not your average investigative thriller.When done correctly, average movies like this can inform, intrigue, and alarm, allowing the audience a better chance at a perspective they'd not considered before. \"Dark Waters,\" though, is simply not your average investigative thriller. There's a kernel of truth at the center of this story that's so damning and vile, it would take a real class \"F\" filmmaker to mess up the translation and impact of what's important here. That's not to say director Todd Haynes's presence is never felt. He simply knows that the mere existentiality of this story itself is all the audience needs to stay in their seats. Whereas in other, lesser films you'd be informed. Here, you're upended. Instead of being intrigued, here, you're spellbound. Horrified instead of alarmed. And as far as widened perspectives are concerned? How about trying a major paradigm shift on for size in the form of this harrowing cinematic treatise on unchecked power, the pursuit for truth, and the tragic, infrastructural downward spiral taking place in so many parts of the American Rust Belt. Perhaps I'm just ridiculously uninformed, but I was utterly floored upon finishing this movie. It's an absolute feat for the subgenre, and one that should be seen by all.",
      "review_date": "2019-12-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Absolutely a must see! Great acting, and a great job done! Rob Billott is an amazing attorney and should be a household name for the courage he had to do what he did!",
      "review_date": "2019-12-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Dark Waters is one of the most important films I have seen this year. \"Dark Waters\" had my attention wrapped from beginning to end. Most respected critics agree with me. The impossibly courageous and steadfast REAL life hero Rob Billet forcesDark Waters is one of the most important films I have seen this year. \"Dark Waters\" had my attention wrapped from beginning to end. Most respected critics agree with me. The impossibly courageous and steadfast REAL life hero Rob Billet forces us to face the truth without distraction, glamour or pretense. His humility, humanity, and heart are astonishing. He is a rare and genuine hero in this age of Narcissism and climate crisis. In our age of superficial \"looking away\" from the truth, anxiety and despair this film busts down all the inclinations to hide. I am also surprised by the reviewer missing the artistry of the film. The blue grey coldness that seeps into the shots reflects the insidious corporate crimes making their way into the flesh and bones of the victims. Haynes brilliantly represents the tragedy of bodies and the earth ravaged by industry and corporate greed. This film shows how the consumer and the victims of environmental pollution (mainly farmers and the poor) are abused and hurt by corporate greed. It is an astonishing portrait of courage and perseverance. Showing us that we can indeed overcome evil if we care enough to wake up and try.  I give dark waters an \"A\". The reviewer missed it completely.",
      "review_date": "2019-12-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Despite some occasional tendencies toward being formulaic, director Todd Haynes's new fact-based thriller explores the efforts of a determined community, led by a courageous and ethical attorney, to take on a major chemical corporation hidingDespite some occasional tendencies toward being formulaic, director Todd Haynes's new fact-based thriller explores the efforts of a determined community, led by a courageous and ethical attorney, to take on a major chemical corporation hiding the dangers of its products and all of the fallout that comes with it. The film's excellent script does a fine job explaining the complex litigious questions involved, detailing the implications of the crusaders' actions without resorting to jargon or unfathomable legalese. Then there are the superb performances of Mark Ruffalo as the heroic lawyer and Bill Camp as his outraged and victimized client. This is an important story, one that's well told and doesn't hold anything back, a tale that should inspire us all to action when it comes to tragedies such as this.",
      "review_date": "2019-12-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Movies like this are primarily educational, if well acted and produced then are naturally must see.  A pretty big case of pollution by DuPont, very briefly touching on the inadequacy and corruption of the EPA.  Mark Ruffalo and Anne HathawayMovies like this are primarily educational, if well acted and produced then are naturally must see.  A pretty big case of pollution by DuPont, very briefly touching on the inadequacy and corruption of the EPA.  Mark Ruffalo and Anne Hathaway both do a good job, and the cinematography is great.  Who knew Teflon was so bad for us?",
      "review_date": "2020-03-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Excellent acting and pacing.  Honestly thought it was better than Spotlight, which this movie parallels quite often.  Learned quite a lot about an issue I haven't heard much about",
      "review_date": "2019-12-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A very eye opening movie that succeeds in delivering emotional moments and shocking information. The acting may land successfully on its feet, but the story carries the acting to the finishing line.",
      "review_date": "2019-12-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Mark Ruffalo stars as the tenacious attorney who uncovers the truth about a toxic chemical that's being dumped in a small farming community by DuPont. His fight is long and frustrating, but not as long and frustrating as the film itself. EvenMark Ruffalo stars as the tenacious attorney who uncovers the truth about a toxic chemical that's being dumped in a small farming community by DuPont. His fight is long and frustrating, but not as long and frustrating as the film itself. Even though this is inspired by a true story, the narrative plays out in predictable beats without any surprises or even inspired dramatic moments. Ruffalo's performance is dedicated, but the lackadaisical direction by Todd Haynes fails to ignite any genuine sympathy or even outrage. An interesting historical story, but the original New York Times Magazine article is probably just as informative and effective.",
      "review_date": "2019-12-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Excellent film. Impecable rhythm. Completely worthwhile story. Fantastic acting. Haynes shows his versatility.",
      "review_date": "2022-10-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The fact that this movie is based on a true story is it's main strength. If it wasn't, the movie would be pretty much average. Mark Ruffalo does a great job.I think Americans need to see this movie especially. It's pretty safe to say thatThe fact that this movie is based on a true story is it's main strength. If it wasn't, the movie would be pretty much average. Mark Ruffalo does a great job.I think Americans need to see this movie especially. It's pretty safe to say that transparency and civic responsibility aren't the values that drive corporate America.",
      "review_date": "2020-03-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "About half way into the film there is a 15-20 second that will have you holding your breath, sitting on the edge of your seat and waiting for the outcome. Though you have seen this scene in many movies it still catches and you wish the restAbout half way into the film there is a 15-20 second that will have you holding your breath, sitting on the edge of your seat and waiting for the outcome. Though you have seen this scene in many movies it still catches and you wish the rest of the movie was as suspenseful.\"Dark Waters\" is about a lawyer who defended big companies and now is heading a class law suit against one of the biggest--Dupont! Mark Ruffalo plays Robert Bilott who has been just made partner of a well known admired law firm. He is not the sharp, $1,000 suit-wearing guy you mostly see in movies but when a farmer from West Virginia, a friend of his grandmother, comes in with a load of video tapes and eventually shows him where he has buried a hundred of his cows, along with the organs of many, Bilott feels he has no choice and takes the case against the thoughts of other partners.The case takes almost 20 years to be decided and we follow along how Dupont not manipulated the government but also the people. You may not have heard of PFOA but you are familiar with Teflon which is not only used in cookware and how it  does kill people and disfigures babies.This is very much a procedural movie without much dramatics but it handles 20 decades in a little over 2 hours smoothly and let's us get to know many of the characters who are real people as this film is based on a story originally written in the New York Times.In the end credits you get to see some of the people but in the movie, along with Mark Ruffalo, the actors such as Anne Hathaway, Tim Robbins, Bill Pulman, Victor Garber and Bill Camp with others, do a solid job of making their characters believable.As with many films this season \"Dark Waters\" runs over 2 hours and this one could have been a little tighter but director Todd Haynes had to cover 18-19 years and does it smartly.",
      "review_date": "2019-12-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A pretty unsettling film in many regards, this film chronicled the DuPont company's cover-up of contaminating chemicals found in their water for the longest time. Mark Ruffalo puts on a great performance here, but the film feels prettyA pretty unsettling film in many regards, this film chronicled the DuPont company's cover-up of contaminating chemicals found in their water for the longest time. Mark Ruffalo puts on a great performance here, but the film feels pretty standard and straightforward for my liking in terms of a biopic. Overall, it's disturbing but also kind of forgettable.",
      "review_date": "2019-12-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great content, excellent cast in a tense legal drama. While certainly not the best in its genre, the fact that it is a true story is pretty damning of the large companies responsible for such reprehensible business practices and negligence.",
      "review_date": "2021-08-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "La vera storia di un David contro Golia, un piccolo (immenso) avvocato di provincia che ha messo in ginocchio il gigante della chimica DuPont. Un film necessario che racconta una tragedia dai mille volti: quella del Capitale che non si faLa vera storia di un David contro Golia, un piccolo (immenso) avvocato di provincia che ha messo in ginocchio il gigante della chimica DuPont. Un film necessario che racconta una tragedia dai mille volti: quella del Capitale che non si fa scrupolo di rovinare persone innocenti pur di veder crescere il proprio contro in banca. Mark Ruffalo dà corpo al protagonista di questa vicenda con tono volutamente dimesso, umile, e così facendo ne sottolinea l'intrinseca grandezza: è un guerriero che non si agita scompostamente sul campo di battaglia ma siede su un pavimento, da solo, a capo chino, tra montagne di documenti da catalogare. È questa forse più di tutte l'immagine simbolo di una ricerca di giustizia che lo vedrà impegnato con una cocciuta, splendida ostinazione per vent'anni.",
      "review_date": "2020-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "After watching this movie, you will no longer see your Teflon pans the same. The long one-man fight against the negligence of one of the world's largest corporations is supported by impeccable adaptation and brilliant performances.",
      "review_date": "2020-06-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I know it sounds like a strange comparison but I guess it will give some perspective for some.Dark Waters is a film like Erin Brockovich but where the fight and the environmental issue is much more important than the central character andI know it sounds like a strange comparison but I guess it will give some perspective for some.Dark Waters is a film like Erin Brockovich but where the fight and the environmental issue is much more important than the central character and that's something that Mark Ruffalo - who plays the central character - understands and makes it work quite well balancing the personal struggle with the legal struggle.Although the topic of the film is known and even today there are no real repercussions in that matter this is still a good film that will give you a good talk after seeing it and that's always a good thing.",
      "review_date": "2020-01-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Todd's welcoming gift to this article alike film is important. Grammatically incorrect and even lofty in its speech. But suitably important and that is enough to peddle.Dark Waters\n\nThe director Todd Haynes's desk is under tons and tons ofTodd's welcoming gift to this article alike film is important. Grammatically incorrect and even lofty in its speech. But suitably important and that is enough to peddle.Dark WatersThe director Todd Haynes's desk is under tons and tons of paper. The challenging ones are shuffled in a two hour narration and sprinkled incoherently as opposed to a proper structure. It is very rare to see a film that is directed by someone and written by someone else and still lacks a definite pattern. Maybe that is the pattern or simply I don't get it- it's usually the latter one, trust me. But what Todd needs primarily is steadiness. Accepting the calmness, the patience that a job like such offers. Waiting for the formality to settle in and then stir the soup. He is just not ready to let it sit for a while. What we then get is always, everything is said to be in motion, no matter how inedible it grows. It is preposterous how the family drama, the conflict that could have easily rattled you, instead just disenchants you from buying into what they care about. It takes a lot of time for them to finally get into our head, almost in its final act, do we get to sit and mourn, meaningfully. To be honest, I am also going to blame the lack of chemistry between Anne Hathaway and Mark Ruffalo. Ruffalo who is basically a wild bear wearing a suit with manners and etiquette like some member of a White House joining for a big dinner, Hathaway unfortunately feels too sober to enjoy and let it affect her. She is simply not open enough. She had to hold the inner \"warning\" monologue of Ruffalo and instead she is found to be a delicious side dish that just doesn't fit into this cruel chemically conspired world.",
      "review_date": "2019-11-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Dark Waters – Fact-Based Expose   If only half of this expose about a poisonous product is true, then it represents a shocking betrayal of any consumer trust – a direct result of the manufacture of Teflon coating for non-stick cooking – whileDark Waters – Fact-Based Expose   If only half of this expose about a poisonous product is true, then it represents a shocking betrayal of any consumer trust – a direct result of the manufacture of Teflon coating for non-stick cooking – while poisoning people, is a shockingly serious subject indeed. Mark Ruffalo does well portraying prizewinning real-life environmental lawyer Robert Bilott, who spent 20years pursuing DuPont for its reckless dumping of highly poisonous; PFOA and PFOS, toxic chemical waste - as used in the manufacturing of Teflon coated cookware, paint, etc - alarmingly, 90% of people will have these chemicals in their bodies! The film is stylishly made and features an evocative music score by Brazilian Marcelo Zarvos. Well worth watching to understand just what corporate greed can produce in terms of human health and ultimate life-threatening contamination – not to mention corrupt governments and their employees! Several of the real-life victims are featured telling their own dramatic stories.",
      "review_date": "2021-05-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A must watch. It’s the kind of a movie that you didn’t know that you needed in your life, but will be forever glad you watched. This is no Terminator 2 or another 10/10 piece of entertainment, but it’s how everybody in the movie industry canA must watch. It’s the kind of a movie that you didn’t know that you needed in your life, but will be forever glad you watched. This is no Terminator 2 or another 10/10 piece of entertainment, but it’s how everybody in the movie industry can make a real impact in the worlds well being.",
      "review_date": "2021-01-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "“Dark Waters” is stark proof that important films are not always enjoyable.  This is a film people should see.  Just don’t expect a pleasant journey, much less a mindless escape.In 1999, Rob Bilott (Mark Ruffalo) is a corporate attorney in“Dark Waters” is stark proof that important films are not always enjoyable.  This is a film people should see.  Just don’t expect a pleasant journey, much less a mindless escape.In 1999, Rob Bilott (Mark Ruffalo) is a corporate attorney in a Cincinnati firm that specializes in defending chemical companies.  When a farmer from Parkersburg, WV, suddenly appears at the office, claiming that humans and animals were being affected by the runoff from the local Dupont plant, Bilott ultimately switches sides and takes the case.  At this point, we’re introduced to PFOA (also called C-8), a chemical compound used by 3M (Scotchgard) and Dupont (Teflon).  It would be tempting to launch into endless details about the well-documented lying, foot-dragging and general malfeasance of Dupont (as far back as 1961, Dupont’s internal medical studies showed that C-8 posed enormous health risks for their own employees).  Since this is a movie review, suffice it to say that corporate transparency and civic responsibility are not key themes in this film.  In the hands of a director less skilled than Todd Haynes (“Safe,” “Carol,” “Far from Heaven”), this film might have been a polarizing, over-the-top political diatribe.  But Haynes veers away from vitriolic exposition, instead infusing the film with a consistently ominous score and dark, washed-out visuals that convey much more about impotent rage and pervasive hopelessness than any speech could accomplish.As the main character, Mark Ruffalo is excellent.  He again conjures up the righteous indignation and poignant disappointment that suffused his character in “Spotlight.”  But here, his role is a bit more complex, with Bilott’s Midwestern diffidence and deference initially obscuring his dogged determination to pursue the case.  Tim Robbins is powerful as his boss, Tom Terp.  Bill Pullman and Anne Hathaway make forgettable appearances.  As the initial plaintiff, long-time actor Bill Camp (also seen in this year’s “Joker” and “The Kitchen”) steals the show as a gruff, blunt, no-nonsense man who just wants common sense to prevail.This is a film intended to stir outrage.  It succeeds.  According to Nathaniel Rich’s January 6, 2016, article in the “New York Times Magazine,” which forms the basis for this film, data from nearly 70,000 West Virginia blood samples has demonstrated that PFOA causes “kidney cancer, thyroid cancer, high cholesterol, pre-eclampsia and ulcerative colitis.”  Today, EPA’s website defines a safe PFOA level as .007 parts per billion.  On average, Americans harbor 4 parts per billion in their bodies.  Nearly every American ever tested has PFOA in the bloodstream.  But even now, EPA offers only “health advisories” on PFOA, guidance that its website defines as “non-enforceable and non-regulatory.”  Outrageous, indeed.",
      "review_date": "2019-12-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Cool film about environmental law. Any environmentalist will enjoy this just for its sheer relevance",
      "review_date": "2020-11-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A very well done drama movie about a rough topic that results in a very entertaining and eye opening experience. The story is very well developed, along with a very good level of acting and a good cinematography. It intrigues and neverA very well done drama movie about a rough topic that results in a very entertaining and eye opening experience. The story is very well developed, along with a very good level of acting and a good cinematography. It intrigues and never bores.A good movie doesn't need pretentious special effects or pseudo emotional stories to achieve a high point of quality. Thus, \"Dark Waters\" is a proof of that.I think everyone should give this a try.",
      "review_date": "2020-02-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An historical movie. Thank you for what you did. It's incredible. Acting, script, just wonderful.",
      "review_date": "2021-03-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Dark es una joya pura en el cine, me gusto demasiado no podría esperar menos del cast, la verdad 10/10",
      "review_date": "2023-01-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great movie according to me! Must watch I think!! Highly recommended from my side!!!",
      "review_date": "2020-03-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Mark Ruffalo is pretty good in this movie, there is some good cinematography in this movie I'll give you that. Also, there's a moment in this movie where they've got a backdrop in a building and the outside doesn't look real at all, sort ofMark Ruffalo is pretty good in this movie, there is some good cinematography in this movie I'll give you that. Also, there's a moment in this movie where they've got a backdrop in a building and the outside doesn't look real at all, sort of reminds me of the 1982 snowman cartoon. Finally, the cows in this movie dont look real at all, they just look very CGI. Overall, I'd say it's got its moments as a movie but it could have been a little bit better because it felt like it dragged.",
      "review_date": "2020-04-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Crazy scary movie. Fact based and incredibly accurate. Why this isn’t a 10 is Ridiculous.",
      "review_date": "2020-08-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Until recently, I had no idea that such a pollution incident had occurred.In Japan, there have been no such reports about Teflon coating (I think), but that's a terrible thing.  I thought I didn't see many Teflon-coated pans in supermarketsUntil recently, I had no idea that such a pollution incident had occurred.In Japan, there have been no such reports about Teflon coating (I think), but that's a terrible thing.  I thought I didn't see many Teflon-coated pans in supermarkets anymore.I bow to the courage of the lawyers to stand up against this kind of thing.",
      "review_date": "2022-01-22",
      "source": "metacritic"
    }
  ],
  "num_reviews": 69
}