{
  "title": "Escape Room",
  "rating": 7.5,
  "release_date": "2019-01-04",
  "genre": [
    "Action",
    "Adventure",
    "Sci-Fi",
    "Drama",
    "Mystery",
    "Thriller",
    "Horror"
  ],
  "summary": "Six strangers find themselves in circumstances beyond their control and must use their wits to find the clues or die.",
  "critic_reviews": [
    "It’s a movie about escape rooms that literally kill you, and if you’re willing to buy into that premise, it’s about as good as a movie with that premise could probably be. So, hey, 2019 is looking up.",
    "A cutthroat little thriller that's surely more fun than most of the riddle-solving lock-ins currently springing up around the country.",
    "Tight, fun little thriller.",
    "From a purely visual point of view, Escape Room is worth the price of admission.",
    "If you've ever watched a Saw movie and wished there was no gore and a few more puzzles to solve then you'll likely enjoy this tropey but fun flick.",
    "A very cinematic spatial impossibility is conjured up by Robitel as he allows the audience to ponder how exactly these rooms are supposed to fit together. The film has a vicious streak of throwaway black comedy.",
    "It’s a mostly fun, logic-be-damned ride if you just stay in the moment and don’t think too deeply as the going gets tough — which is soon enough.",
    "The escape-room scenes themselves (a.k.a. the good stuff) are imaginatively conceived and deftly executed enough to justify a late-night cable viewing.",
    "For all its of-the-moment charms, Escape Room can’t shake its more basic genre trappings, eventually giving itself over to tired and predictable revelations and flimsy twists.",
    "Great cast, fun mysteries, well-crafted set pieces, and suspense for days isn’t enough to outweigh the crushing defeat felt at the end of Escape Room by the ludicrous ending that overshadows the proceedings.",
    "Students of the genre will know what’s coming and if you’re craving a few thrills, you can do far worse.",
    "The movie may attract some attention from horror/thriller fans eager for a post-Halloween fix but this is no better than a direct-to-video production masquerading as a theatrical release.",
    "A sometimes diverting, but overly familiar series of set pieces in search of a good melodrama.",
    "The filmmakers haven’t gone so far as to put you in the game, too. A lot of it is watching all the characters find keys and have their own revelations, so by the time you get to the fifth room, it’s understandable if interest is starting to wane a bit even with the addition of a link between the six people.",
    "There are intimations of “Tales From the Crypt,” “Final Destination,” “The Game,” and other older, better films here; this movie never catches a fire like any of those did, and even its twist coda feels dreary and pro forma.",
    "Escape Room is an amusement park ride. It has no reason for being beyond that base-level kick, and it doesn’t, as they say, transcend the genre. But there’s something to be said for amusement park rides. People like them for good reason.",
    "The setup may seem recyclable, but really it’s disposable.",
    "This picture is impressively designed but low on scares.",
    "Escape Room is like The Crystal Maze with more death. It’s fun at the start then loses its way, but it’ll do until ‘Flossing: The Movie’ comes along.",
    "At least it could have been fun-bad, not just boring-bad.",
    "The best thing you can say about Escape Room is that for most of it, you’re not desperately searching for the exit sign.",
    "The first part of the film gets some airy momentum going. Then, however, we learn the secret of what the characters have in common, and it gives you that slightly sinking feeling of one contrivance too many.",
    "It's not asking much that a thriller be scary or shocking. This one waffles between being predictable and absurd.",
    "The year may be young, but Hollywood is going to be hard pressed to come up with a climax that is more anti-climactic than the many anti-climaxes that bring down the curtain on Escape Room, the first official dog of the new year.",
    "It’s also not all that good, even if it’s hardly the kind of “bad” that most would get riled about. Escape Room is cut from one of Hollywood’s most familiar cloths: the “mall horror” movie.",
    "There’s just enough cleverness in Escape Room to enjoy that this bad-horror-movie experience becomes more discouraging than droll."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Saw x Cube x The Belko Experiment, if you like those movies then you should like this one.",
      "review_date": "2019-01-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I personally have never yet been to an escape room. Not because I haven't wanted to, it's just been difficult to find one in my area. I know have a center in my mall that offers it and now intend on going to it, especially after seeing thisI personally have never yet been to an escape room. Not because I haven't wanted to, it's just been difficult to find one in my area. I know have a center in my mall that offers it and now intend on going to it, especially after seeing this movie. That may sound crazy but solving puzzles and using your mind is a fun experience. Just like this movie. Escape Room was a movie that came out of nowhere. I had no idea about this film until a TV spot appeared during a football game I was watching. I found myself really interested in this film. After an opening that will send us back weeks earlier, we are introduced to almost all of our escapees receiving mysterious puzzles boxes that reveal an address to a building where a exclusive escape room they are being invited to attend. They are all under the impression that this invite was sent to them from people they know. We immediately get bad vibes to this however because of the mysterious greeter asking for their phones not to be used in the room. I was getting \"Belko Experiment\" vibes from this at this point and that is not a bad thing. I liked that movie quite a bit. The building design, at least from the outside and lobby look much like the belko building. The set design of all the escape room is very well done. This film is far from done on the cheap then you would expect. With a budget of just over 9 million dollars, every penny is shown with creativeness of the rooms.The film doesn't feature any big name actors except for Taylor Russell from Netflix \"Lost in Space\" and Deborah Ann Woll from HBO's \"True Blood\". That is not to say we are getting low end actors here though. Every performance is well done. Taylor Russell is a very good actress and carries this film. Each room poses a new problem and none of it seems repetitive. With each new mystery comes new challenges and inattentiveness. I have heard some people complain that this has too much of a \"Saw\" vibe. I disagree. Yes, the struggle to solve a puzzle before death is similar but not in the same way. I am so sick and tired of similarities always being brought up because of this. All movies share in common things with other films. Does that mean that every film should be accused of this? I don't think so. Each room brings intense moments with not knowing which character is going to die or experience bodily harm. This all leads to a interesting final act that I did not anticipate. In fact, Jason Kobasic and I were both feeling like this film could be connected to \"Belko Experiment\" and I would have been OK with that. There is a lot of franchise potential in this but only if that characters that survive this film are brought back into it. I am tired of sequels to these kind of movies that just bring in new people every film and ignore the previous characters or just kill them off. The ending did frustrate me at first up until I read an article with the film's director saying that sequels want to get made if the box office is good. Well, I am happy to report that the film has already made 64 million dollars worldwide. Be ready people, another trip to the escape room is coming and I am ready for it.Grade: B+",
      "review_date": "2019-04-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Generally, I liked this movie. I don't think that it fits into the category of Horror, but I can agree with thriller. Some of its aspects reminded me of Cube and other movies. However, for me, it seems that the movie only gains from thatGenerally, I liked this movie. I don't think that it fits into the category of Horror, but I can agree with thriller. Some of its aspects reminded me of Cube and other movies. However, for me, it seems that the movie only gains from that fact. It nicely explores the idea of an escape room that becomes too realistic.",
      "review_date": "2019-04-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I liked it. It kept me entertained from start to finish.not oscar material or film fest material. Does it have to be, to be good?",
      "review_date": "2019-07-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "5.6/10 The escape room settings and concepts are creatively executed, but the overall story is ridiculous and tries to be so original though it’s not at all because it rips off Saw and Cabin in the Woods so much. The cast is mostly grating5.6/10 The escape room settings and concepts are creatively executed, but the overall story is ridiculous and tries to be so original though it’s not at all because it rips off Saw and Cabin in the Woods so much. The cast is mostly grating and extremely annoying especially the guy that plays Jason. At least have a couple actors that don’t seem like complete rookies so we can attempt to care about them although the awful script could be to blame for that aspect. The visuals are decently solid throughout and there are a few clever settings and devices. The sequel set up is so blatantly desperate at the end though I will definitely not be watching it. Overall it’s just a rehash of the 2 films I mentioned set in escape rooms with utterly ridiculous plotting/scripting, with some moments of intrigue spliced throughout. A definite horror cash grab through and through.",
      "review_date": "2019-04-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Escape Room has actually tried to present a surprise to the audience in the middle to the end of the film. But, the twist plot presented feels cliched. So it's not too surprising.The flow and dialogue are also considered too fast. As ifEscape Room has actually tried to present a surprise to the audience in the middle to the end of the film. But, the twist plot presented feels cliched. So it's not too surprising.The flow and dialogue are also considered too fast. As if pursued by duration. So that the audience, who were actually invited to join in solving the puzzle, did not have time to think. And running out of time.",
      "review_date": "2019-03-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie was kinda fun almost like watching a game show at least from the first room to the pool room. Everything after and before I didn't care much about. As for the characters I either didn't care about or didn't like.Also, can we stopThis movie was kinda fun almost like watching a game show at least from the first room to the pool room. Everything after and before I didn't care much about. As for the characters I either didn't care about or didn't like.Also, can we stop having these endings where a boy and girl are the sole survivors and they end up being a couple. You're not Hunger Games. And those two characters had NO chemistry.",
      "review_date": "2019-12-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Do Not watch! The first half of the movie lures you in and after the end you’ll regret watching it. Lazy and uninspired. Don’t let them rob you of your precious time.",
      "review_date": "2020-10-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Ubughihihyftdtswetuoomlpkomininuuggyyvgctcdxswqweyiolntefuugguugugugugugughjguguugughj",
      "review_date": "2021-04-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°@;@;@;@;@;@;@;@!@!@!@!@!@!!@@:@:@:@:@:@:@::@@:@:@:@::@;@",
      "review_date": "2021-06-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Personally, I very much enjoyed Escape Room. The dialogue may be a pit predictable at times, however the acting makes up for it along with the complexity and diversity of the puzzles and/or their rooms. There are indeed several spots that canPersonally, I very much enjoyed Escape Room. The dialogue may be a pit predictable at times, however the acting makes up for it along with the complexity and diversity of the puzzles and/or their rooms. There are indeed several spots that can be predicted throughout the movie, however the twists were very enjoyable. Overall, the movie is quite fun to watch because of the way it handles its characters and development. The ending is a bit rough, but it only proves that this is a movie that requires you to think. If you have spare time this weekend, go watch it! Escape Room is a thrill that tends to focus more on its story rather than throwing gore at your face every 5 seconds. Basically, the movie is solid all around; however, the roles of the actors are kind of cliché, and it can get confusing. The movie definitely could have improved if there wasn't so much being left out; like \"Birdbox,\" it could have used more structure in the plot. However, if you're a nerd who enjoys surrealism and seeing people lose their minds like me, chances are you might get something from this movie.",
      "review_date": "2019-01-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Escape Room is about a group of strangers invited to participate in a series of escape rooms (for the unaware: group puzzle-solving activities) only to find out they're deadly. Sure, yeah killer traps and rooms have already been done inEscape Room is about a group of strangers invited to participate in a series of escape rooms (for the unaware: group puzzle-solving activities) only to find out they're deadly. Sure, yeah killer traps and rooms have already been done in previous films, but I appreciate the idea of an escape room in general being used as a force of murder considering how popular they are these days. I wasn't sure how this film would turn out based on the previews, but I was pleased with the final product.Yeah, the movie has some predictable characters and elements, but this is a very polished film. The script, occasional joke without sabotaging the mood, characters, and general direction are all solid. Great main cast all around, better than expected for movies of this type.A lot of thought goes into the murder rooms, which are all impressively decorated and designed. They are a little over-the-top, but the film manages to explain how  they work practically. The challenges and threats all pan out nicely. The ending, while I wouldn't say it was bad, wasn't ideal for me. To clarify, I'm talking about the wrap-up after the final fight for survival, which works. 1) This final part breaks the tenuous suspension-of-disbelief as the antagonist or antagonists does/do something that seems impossible to pull off even with his/her/their resources. 2) There is a semi-long tacked-on setup for a possible sequel that seems more at home for a big blockbuster than a horror film.Also, be forewarned that the reveal of the human face/faces to the antagonist/antagonists is a little underwhelming.I wouldn't say Escape Room is a must-see, but I do recommend it to any horror fan who wants a good time.",
      "review_date": "2019-01-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Sure, none of the multiple endings were entirely amazing, but if you're an escape room person, like I am, you'll have fun with this!  It's always fun to think how bodily injury can come into one of these rooms, and they've explored thatSure, none of the multiple endings were entirely amazing, but if you're an escape room person, like I am, you'll have fun with this!  It's always fun to think how bodily injury can come into one of these rooms, and they've explored that effectively. The acting is solid - shocked that they got 3 of these actors to do this film, frankly.",
      "review_date": "2019-01-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's a decent thriller. Saw + Cube = this movie. I know, the idea was popular a few years ago but still managed to get me interested in what will happen in the next room.",
      "review_date": "2019-02-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Why would you spoil the entire movie in the first f****g scene?! Even though the idea was a rip-off i think it wasn't so bad. All stereotypes were justified. An asian nerd, a grungy loser, black macho, badass milf, bearded old dude and aWhy would you spoil the entire movie in the first f****g scene?! Even though the idea was a rip-off i think it wasn't so bad. All stereotypes were justified. An asian nerd, a grungy loser, black macho, badass milf, bearded old dude and a know-it-all asocial shy teen. I was engaged since the beginning, but unfortunately it ended up being very predictable. Hopefully the sequel will be better.",
      "review_date": "2019-02-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Way too much loose ends, very few plot twists and the riddles throughout the film are not viewer friendly at all, so we cant speculate the answers. All of this leads to a boring movie.",
      "review_date": "2019-02-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I thought this film was clever, interesting, and fun. The actors were all very believable and likable, and this was a good vehicle for them to prove they are worthy of going on to something a bit better. I am not into blood and gore for itsI thought this film was clever, interesting, and fun. The actors were all very believable and likable, and this was a good vehicle for them to prove they are worthy of going on to something a bit better. I am not into blood and gore for its own sake (even though I like a good horror movie like, for example, the original Halloween) and this film kept me guessing without pissing me off with dumb tricks.",
      "review_date": "2019-01-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "1. Copycat of many movie, SAW+CUBE most likely.2. MOST players died in accidents, if you are calling this escape room, they should die because of playing it wrong or etc.3. Always sick rich **** behind everything, come on it is 2019.",
      "review_date": "2019-01-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nSchauen Sie sich den ganzen Online-Film anSchauen Sie sich alle neuen Filme kostenlos online an Kostenlose Online-Filme",
      "review_date": "2019-01-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Escape Room feels like a spin-off to the Saw franchise - with a better premise behind it, that is. The film will draw your attention throughout with its continual far-fetched thrills, however, some moments of cringe-worthy dialogue andEscape Room feels like a spin-off to the Saw franchise - with a better premise behind it, that is. The film will draw your attention throughout with its continual far-fetched thrills, however, some moments of cringe-worthy dialogue and unconvincing reactions on behalf of the cast might just keep you from getting entirely sucked into the grand mystery at hand.",
      "review_date": "2019-01-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is a pleasant surprise, full of memorable performances (of the two main characters, above all), clever twists and awsome scenes, such as the lipstick one. A must see!",
      "review_date": "2020-01-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A good time if you are into \"Saw\" type of movies but with less gore and more puzzles.",
      "review_date": "2019-01-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Escape Room is yet another watered down, generic, and standard horror film for teenagers looking to get a cheap scare from a popular thing studios are trying to make scary. Escape Room fails mainly due to a PG-13 rating, boring characters,Escape Room is yet another watered down, generic, and standard horror film for teenagers looking to get a cheap scare from a popular thing studios are trying to make scary. Escape Room fails mainly due to a PG-13 rating, boring characters, inconsistent rules, an extremely lackluster ending, and not using it's concept to it's full potential. For a film all about escape rooms, it's sad that there's only one escape room that is actually creative and original, the rest are either boring rooms or rooms so ridiculous that it's impossible for them to even work (literal frozen lake indoors). Escape Room is just forgettable, I'm sure it will get a sequel as even the weakest horror films nowadays do, but this film is boring and desperately needed more creativity behind the camera and a R-rating to really take this concept all the way.",
      "review_date": "2019-02-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis movie was good but it was predictable at times. This movie was very thrilling and suspenseful. The acting was great especially from Taylor Russell, Logan Miller, Tyler Labine, Deborah Ann Woll, and Jay Ellis. I enjoyed this movie overall but I didn't like the ending.",
      "review_date": "2019-01-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "'Escape room - the child version of 'Saw', come with your kids fella.' This.. this was horrible. Can't believe my boyfriend rate this crap 7/10 and he is the critical one. I had high expectations, but it turns out to be big fail. Spoiling in'Escape room - the child version of 'Saw', come with your kids fella.' This.. this was horrible. Can't believe my boyfriend rate this crap 7/10 and he is the critical one. I had high expectations, but it turns out to be big fail. Spoiling in the first seconds, stupid dialogues, boring characters, cliche plot story and so on. Craaaaaap.",
      "review_date": "2019-02-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If you like crappy saw ripoffs (not that SAW was good to begin with), you'll love this movie.",
      "review_date": "2019-01-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "‪so, for a PG-13 horror film coming out in the first week of January, ESCAPE ROOM isn’t half-bad. The structure is obviously blah, but there are several sequences where my palms were sweating. For $9 million, it’s impressively designed, too‬",
      "review_date": "2019-01-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is so boring and predictable. Another waste of time, this kind of movie always disappoints.",
      "review_date": "2019-01-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Escape room sounds like a good movie, but when I saw it was a disappointment. I really like the rooms itself because they were creative and unique. And the movie have some great suspense to it. But the biggest flaw is the ending. I won'tEscape room sounds like a good movie, but when I saw it was a disappointment. I really like the rooms itself because they were creative and unique. And the movie have some great suspense to it. But the biggest flaw is the ending. I won't spoiler it, but I have to say I really don't like the multiple endings to this movie. Overall the movie have a good concept, but the execution is far from being good.",
      "review_date": "2019-03-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Awful,stupid,cheap,unfrighten,not interesting,horrible that's how I can call Escape Room.",
      "review_date": "2019-01-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's not terror enough and it makes me sleep for 20 MINS.It's boring in the first 20 MINS.Waste my money and time.It sucks.",
      "review_date": "2019-02-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I was gonna give this movie 7, but after CinemaSins from YouTube, I realized Escape Room is not that good. Yeah, the movie is somewhat good, like don't too get tempted with money, and try to survive.I'm from Greenland, it's almost alwaysI was gonna give this movie 7, but after CinemaSins from YouTube, I realized Escape Room is not that good. Yeah, the movie is somewhat good, like don't too get tempted with money, and try to survive.I'm from Greenland, it's almost always cold weather, like now, it's almost winter now. I don't think 2nd room is possible to survive that long.",
      "review_date": "2019-09-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A group of young people comes together to solve the mysteries of an especially elaborate scheme of escape rooms, all of which have mortal consequences. If you can accept the unrealistic aspects of this concept, it's fun to watch howA group of young people comes together to solve the mysteries of an especially elaborate scheme of escape rooms, all of which have mortal consequences. If you can accept the unrealistic aspects of this concept, it's fun to watch how imaginative and diabolical the puzzles become. There are a few moments of slight suspense when each environment gets most perilous, but it's mostly just about outsmarting an evil game master. It's been compared to the SAW series, but this movie relies much more on clever mind games than torturous violence (and is already set up for a sequel).",
      "review_date": "2019-01-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The first hour was really good, much better than expected, despite some dumb character decisions. Then the third act came in, and the movie went completely b*tsh*t. The ending is a mess and ruins the whole thing. This is the kind of movieThe first hour was really good, much better than expected, despite some dumb character decisions. Then the third act came in, and the movie went completely b*tsh*t. The ending is a mess and ruins the whole thing. This is the kind of movie where writers had a nice pitch, but didn't know how to end it.",
      "review_date": "2019-04-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Suspense for beginners.I will not deny that it has its moments but frankly it never dares to more and wastes an interesting premise for basic but ultimately empty entertainment.",
      "review_date": "2019-02-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Not good, not bad. Just a weird mix-up between Cube, Saw and Hostel with a hint of Cabin in the Woods. Anything is poorly executed but still works for some reasons. The end is so lame and predictable but it's probably better to not expect toNot good, not bad. Just a weird mix-up between Cube, Saw and Hostel with a hint of Cabin in the Woods. Anything is poorly executed but still works for some reasons. The end is so lame and predictable but it's probably better to not expect to be surprised by a project from Fast and the Furious and I Know What You Did Last Summer producer Neal H Moritz.",
      "review_date": "2019-05-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Everything about this film is ridiculous...and yet I couldn't look away. Escape room has a great cast, decent set pieces, interesting (and just plain crazy!) premise delivered well. It's super cheesy and not terribly logical (like who wouldEverything about this film is ridiculous...and yet I couldn't look away. Escape room has a great cast, decent set pieces, interesting (and just plain crazy!) premise delivered well. It's super cheesy and not terribly logical (like who would finance something this insane!). Like hostel, cube, saw and other such thrillers, it keeps you on the edge of your seat till the end.",
      "review_date": "2021-03-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I went into this excited about the premise, but left disappointed by the execution. Make no mistake, the focal point of this movie isn't about cool rooms, interesting puzzles, or challenging clues to overcome - it's about the motivations of 6I went into this excited about the premise, but left disappointed by the execution. Make no mistake, the focal point of this movie isn't about cool rooms, interesting puzzles, or challenging clues to overcome - it's about the motivations of 6 of the most unlikable characters you may ever see in a film. It suffers from 'little kid trying to be an adult'-syndrome similar to how when a 12-year-old learns something is edgy they do it CONSTANTLY to seem like an adult to the point of doing it to an immature degree. The movie wants you to know that it's mature and that the stakes are high not through the traps that threaten to painfully injure or kill, but through the characters who fire off so many F-bombs, S-bombs, MFers, etc.throughout the entire film that it probably averages over 4 per minute. It's like being on early Xbox Call of Duty teamspeak with a 12-year-old. It added nothing to the movie and made me lose respect for the script writers.I told you that the main cast of 6 is very unlikable, but some are clearly worse than others. Because of the traps/inherent danger of the puzzles there are some deaths in the cast.  A big problem is the most tolerable characters are the first to go, while the super annoying characters remain til the very end - leaving you with maximum suffering. Combine this with some really culturally out-of-touch moments like when they refer to a \"Games Master\" (ANYONE knows that the correct term is Gamemaster with no 'S', etc.)The movie begins with the worst trope in the entire world - a scene from later in the movie, and then flashes back to \"6 months earlier\" or whatever and the chronological progression begins. The problem is this removes a TON of possible suspense and excitement from a genre LITERALLY called suspense - it's the whole point of movies like this. You now know that this character you saw in the scene will be safe until you are caught up in the plot to that point again. There is no concern over them being at risk from the danger elements, they have an invincible shield constantly. It removes so much possible excitement and in exchange we get NOTHING for it.For a movie focused on the characters and their motivations they seemed to go extremely lazy on this aspect. A super successful businessman with a private office, multiple homes, and luxurious gifts would not be enticed to play some novelty game with strangers just for $10,000. A character that is too shy to even look up or respond when another character says \"hello\" to them, 30 minutes later is shouting **** at people and performing martial arts levels of combat out of nowhere. The shyness was not an act, the character has no previous combat training, etc. It's all just very unbelievable.I do want to say something good about it though - some of the puzzles and rooms were very interesting or had creative traps. Most likely the entire movie budget went to visual/special effects and that part is well done so they are often quite imposing to behold.My final complaint is the unrealistic representation of races in this movie. The driven, successful, measured, intelligent businessman and the hyper intelligent genius-level prodigy scholar are both black - when in real life blacks have the lowest average IQ of all of the races by far. It's made even worse when you factor in the male/female IQ differences and the fact they made a black female the most intelligent character in the entire film (she's also on the poster art so it shouldn't be too much of a surprise) is just a step too far to suspend belief. The white characters, while having the highest average IQ of the races in real life, are represented by a jittery failure of a pothead, a backwater redneck who doesn't even know what an escape room is, and a military vet that is severely and constantly crippled by anxiety (this last one is a bit realistic so I'll let it slide.) I really enjoyed the Indian kid and wish we had more time with him as a character. He had both positive and negative stereotypes which fleshed him out a lot more than the Mary Sue black girl who can do no wrong.",
      "review_date": "2019-04-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "About 10 minutes into the movie I was looking for a clue on how to escape the theater. You could hear the sarcastic chuckles from the few who attended wondering why they were still in their seats. (Another red flag - sparse audience) I'mAbout 10 minutes into the movie I was looking for a clue on how to escape the theater. You could hear the sarcastic chuckles from the few who attended wondering why they were still in their seats. (Another red flag - sparse audience) I'm bitterly disappointed with some of the misleading user scores from some of the people I rely on. Amateur acting mixed in with a poorly written script. SAVE YOUR MONEY & TIME",
      "review_date": "2019-01-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Es entretenida, así de simple, ni mas ni menos, para pasar el rato una tarde de fin de semana.",
      "review_date": "2019-06-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Escape Room is better than I think a lot of people would expect. In a lot of ways it's similar to Saw, but it is better than the more recent saw films. The plot is what you'd expect: a group of people have to solve puzzles in each room toEscape Room is better than I think a lot of people would expect. In a lot of ways it's similar to Saw, but it is better than the more recent saw films. The plot is what you'd expect: a group of people have to solve puzzles in each room to escape and progress to the next. It's as simple as that, except, you know, people can die in a film version of the game. It's entertaining but that's about it.",
      "review_date": "2019-10-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Αληθινές θανάσιμες παγίδες που υποχρεώνουν τους επιζώντες να συνεργαστούν στενά μεταξύ τους, καθώς προσπαθούν να λύσουν μια σειρά από περίπλοκους γρίφους και να δραπετεύσουνΑληθινές θανάσιμες παγίδες που υποχρεώνουν τους επιζώντες να συνεργαστούν στενά μεταξύ τους, καθώς προσπαθούν να λύσουν μια σειρά από περίπλοκους γρίφους και να δραπετεύσουν",
      "review_date": "2019-04-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "3.7/10",
      "review_date": "2019-01-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great seeing Martin all grown up. I'm so proud of him. He has truly come a long way since his early days. Thanks for the memories :)...",
      "review_date": "2019-01-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "well, what can I say it not good and it's not all bad, there's nothing new in this film that hasn't been done before and better, it's not a patch on the cube. but it's watchable.",
      "review_date": "2019-03-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》",
      "review_date": "2021-06-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "-----------------------------¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○",
      "review_date": "2021-06-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don't see what's so bad about this movie except that it's all rather improbable to say the least. It's well made though. I didn't see Jigsaw, so no deja-vu for me. No yawns, just interesting twists and turns. They should have just put theI don't see what's so bad about this movie except that it's all rather improbable to say the least. It's well made though. I didn't see Jigsaw, so no deja-vu for me. No yawns, just interesting twists and turns. They should have just put the first scene where it belonged though, if you're willing to overlook that dumb decision a 7 is well deserved, otherwise a 5 to 6 is indeed more like it.",
      "review_date": "2019-04-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "You can't help but like the cast and their characters, who are solidly built up throughout. The escape rooms are interesting and add a level of interest to the movie. However, I think one of the biggest problems this film has is that it isYou can't help but like the cast and their characters, who are solidly built up throughout. The escape rooms are interesting and add a level of interest to the movie. However, I think one of the biggest problems this film has is that it is too convoluted. The writers made this plot unnecessarily complicated and made it out to be far grander than it should have been.It certainly beat my low expectations going into it but I thought it could have been a lot better.",
      "review_date": "2019-04-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Escape Room isn't the most original film out there, however it does have some good ideas and a great cast. As it did so well at the box office it more than likely will have a sequel.",
      "review_date": "2019-04-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I really did enjoy it. Of course some of it reminds Saw, but in the setup of Escape Rooms. Also som of it reminds older movie Cube (as I noticed some other users mentioned here, even though Cube was much more mindblowing), and since thoseI really did enjoy it. Of course some of it reminds Saw, but in the setup of Escape Rooms. Also som of it reminds older movie Cube (as I noticed some other users mentioned here, even though Cube was much more mindblowing), and since those movies I both really liked, I obviously enjoyed this too",
      "review_date": "2021-09-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "When you see this type of movie, the only things that attract you are \"the way of die\" and \"how clue will solve\", honestly both of them were more silly than I expect.The room design was nice especially the upside down room, I like theWhen you see this type of movie, the only things that attract you are \"the way of die\" and \"how clue will solve\", honestly both of them were more silly than I expect.The room design was nice especially the upside down room, I like the performance of Logan Miller, I think he was the best one in the movie.",
      "review_date": "2019-04-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nEscape Room attempts to capitalize on the apparently wild popularity of America’s new “escape room” pastime. (I stand firm in my opinion that the film would be much improved if there were an unofficial fifteen minute intermission in which the film abruptly cuts out and the lights come up and the exits are blocked, but for whatever reason, the film insists on being watched as its main draw.) It’s almost not worth mentioning the obvious line about how the movie itself is a play on its own name. It isn’t even the first escape room movie in the last few years. The trailer had some lovely visuals, so I recommend if you want to see the movie, you return to the trailer and loop that a few times.Taylor Russell, of Netflix’s Lost in Space fame, Logan Miller (who’s been on a bit of a hot streak until this film, it seems), and the others are actually kind of brilliant as an ensemble cast. Deborah Ann Woll who seems like maybe the biggest draw in some respects from her time on True Blood is a Rorschach of fan-service and feminist badassery, serving two crass masters effortlessly. Despite a startlingly dumb premise and an overly long follow through–why do the rooms grow progressively more and more boring as they proceed?–the cast bravely struggles onward. Looking at the writing crew for this one, it seems clear that Maria Melnik, current staff writer for Gaiman’s American Gods adaptation for Starz, is not to blame, which leaves one Bragi Schut holding the bag. It’s so seldom that we can find a patient zero for such criminally lazy writing, so we should rejoice a little bit in the ease with which that mystery was dispatched.Clearly what would’ve made this movie better is if they had stuck more closely to the premise of their trailer and either 1) pulled a Soderbergh and kept their cards close until a big twist and reveal at the end when we see how the players actually outsmarted the Gamesmaster or 2) the movie should have shifted at the halfway point, as it appeared it would before fizzling out and then going completely bonkers and then flashing forward helpfully by three months, toward giving the players more agency as they try to stay a few steps ahead of the game design itself, pulling double duty as they are forced to solve the rooms while also deceiving their captors. That second game, of returning control of the situation to the victims is a classic type of empowerment that saved the genre from tired stereotypes and clichéd plots long ago (think Red Eye, Panic Room, the recent sequel to Halloween, and, to a different extent, the turn in It Follows).Friend and I saw this instead of the advanced screening of Alita: Battle Angel because there was too much traffic to make it to SF in time. It was probably better than gouging our eyes out with sea salts or sucking on knives, but only just.",
      "review_date": "2019-10-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fantastic movie, lots of exciting turns and twists. Lovable characters with great acting, which really helps the story work.",
      "review_date": "2019-11-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nGroup of people compete in an escape room to win prize money but when they start dying, they all become unrealistically quick to screw each other over and save themselves.",
      "review_date": "2020-09-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This seems to be designed as a throwaway movie. I was the only person in the 300-seat theater on a Thursday night, so I wasn't disturbing anyone by playing on my phone for half the movie. I didn't care about any of the characters or theThis seems to be designed as a throwaway movie. I was the only person in the 300-seat theater on a Thursday night, so I wasn't disturbing anyone by playing on my phone for half the movie. I didn't care about any of the characters or the puzzles. I had hoped that it was at least a popcorn movie. Avoid it. Not even worth it if you have a free pass.",
      "review_date": "2021-07-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙````````````````````````````````````````````````````````",
      "review_date": "2021-05-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥",
      "review_date": "2021-06-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•",
      "review_date": "2021-07-01",
      "source": "metacritic"
    }
  ],
  "num_reviews": 85
}