{
    "title": "Ford v Ferrari",
    "rating": 8.3,
    "release_date": "2019-11-15",
    "genre": [
        "Action",
        "Biography",
        "Drama",
        "Sport"
    ],
    "summary": "Visionary American car designer Carroll Shelby (Matt Damon) and fearless British-born driver Ken Miles (Christian Bale) battle corporate interference, the laws of physics, and their own personal demons to build a revolutionary race car for Ford Motor Company and take on the dominating race cars of Enzo Ferrari at the 24 Hours of Le Mans inVisionary American car designer Carroll Shelby (Matt Damon) and fearless British-born driver Ken Miles (Christian Bale) battle corporate interference, the laws of physics, and their own personal demons to build a revolutionary race car for Ford Motor Company and take on the dominating race cars of Enzo Ferrari at the 24 Hours of Le Mans in France in 1966. … Expand",
    "critic_reviews": [
        "The movie is an old-fashioned rouser with a lot of new-fashioned virtuosity.",
        "It’s a new and emotionally complex model of an old-fashioned audience-pleaser, with wonderful performances by Christian Bale and Matt Damon and a resonant soul to go with its smarts.",
        "A barnburner of a motion picture that mainlines heart-in-mouth excitement and tug-at-the-heart emotion, Ford v Ferrari is made the way Hollywood used to make them, a glorious throwback that combines a smart modern sensibility with the best of traditional storytelling.",
        "Ultimately, Ford v Ferrari is about art versus commerce, devotion versus cynicism, and inspiration versus deadness. It’s one of the year’s great films, and of all the great films so far, the most accessible.",
        "It stands with the greatest racing movies ever, and it’s certainly the most entertaining. But there is no doubt about one last superlative.  Ford v Ferrari is one of the best pictures of the year.",
        "The chemistry between Bale and Damon is what makes the movie move the way it does, along with the script. Bale alone in the race car figuring out how to win and survive is where the film really sings.",
        "Shelby and Miles’ story is compelling, but Mangold digs deeper to find the motor that propels Ford v Ferrari across the finish line.",
        "Ford v Ferrari is the sort of cinematic entertainment that sucks you in and won’t let you go until you cross the finish line.",
        "You’re going to watch Ford v Ferrari for the action, underdog story, and more-than-competent cast. Mangold also has the tone and pace of the film down perfectly. I would watch Ford v Ferrari over and over again.",
        "The movie works on you cumulatively, wearing down the impulse to roll your eyes at its familiar parts and leaving you to appreciate how snugly they fit together, and the way the whole thing purrs.",
        "Ford v Ferrari is a little too long; some scenes leave unnecessary skidmark trails. But the movie still has amiable style and energy to spare. It’s fast but never furious.",
        "Bale is a cussed and calculating actor, yet he’s never been more likable than he is here — an irony to relish, since the character he plays makes so little effort to be liked.",
        "Ford v Ferrari is almost as much about having to navigate having multiple bosses at a large corporation as it is winning a car race.",
        "The film’s lively dynamics owe much to the bristly nature of nearly every relationship and interaction in the film.",
        "Whether you care about motorsports or not, Ford v Ferrari is a kick: both a rollicking true story well told, and a moving depiction of male friendship.",
        "Extremely enjoyable true-life drama featuring some of our most deft actors having the time of their lives.",
        "This infectious and engrossing story of the 1966 showdown on a French racetrack between car giants Ford and Ferrari is a high-octane ride that will make you instinctively stomp on a ghostly gas pedal from your movie seat.",
        "Ford v. Ferrari expertly captures the essence of mid-20th century racing, and the spirit of the men who went to battle in Le Mans.",
        "While there are plenty of obstacles and things going vroom, the two reasons \"Ford\" works so very well are named Damon and Bale: They're endlessly entertaining as loyal dudes who work out their differences through brotherly roughhousing.",
        "It’s on the track where it finds traction. The events of the various races, reflected on the faces of characters whose lives revolve around the outcome, tell a story all by themselves.",
        "Ford v Ferrari is an easy film to scoff at; there is nothing new here, and there is no debating that fact. Instead, we have a compelling story told in simple, intelligent fashion. It deserves a spot on the list of great racing dramas, and the list of the year’s most entertaining dramas.",
        "It’s a movie so well put together as a hero’s tale that it moves along almost too smoothly; the script by brothers Jez and John Henry Butterworth hits its marks of tragedy and triumph with a kind of shiny, measured inevitability.",
        "With its precise production design and rumbling racing scenes, Ford v Ferrari is as sleek and visually alluring as the vintage vehicles it showcases—but beneath its shiny hood is an engine with real complexity.",
        "Slick, thrilling and saturated with vivid hues and 60s can-do optimism, Le Mans ’66, James Mangold’s follow-up to Logan, is a precision-tooled machine of a movie.",
        "Ford v Ferrari is no masterpiece, but it is — to invoke a currently simmering debate — real cinema, the kind of solid, satisfying, nonpandering movie that can seem endangered nowadays.",
        "Luckily, Mangold fuels his true-life plot with enough flesh-and-blood action to leave you dizzy.",
        "Even if you’re not a motorhead, chances are you’ll be thrilled by this high-velocity bromance, powered by zesty acting and Mangold’s meticulous direction.",
        "It’s the rare movie that doesn’t trivialize a platonic male relationship with buddy film tropes.",
        "A fun, engaging story that’s more about obsessive drive than actual driving.",
        "This is solid, middle-of-the-road entertainment. Slow patches aside, it finishes strong and, although it probably won’t win the box office race, it may generate some Oscar interest (because Bale is almost always good enough to warrant that sort of attention).",
        "Damon is superb in the kind of role he excels at: a man of integrity who gets steered off the path and is subsequently righted. Lest all of this sound heavy, I should assure you that Ford v Ferrari is exactly as fun, maybe even more fun, than its well-put-together trailer makes it out to be.",
        "Setting aside more particular genre trappings, Mangold re-engineers one of his unfussy studio throwbacks into a supersized Dad Movie event.",
        "Ford v Ferrari works as a stylish, enjoyable mash note to its era, and the need for speed and all that.",
        "Damon and Bale are such magnetic onscreen figures that it doesn’t take much to inject their various arguments, smarmy asides, and high-stakes bets with plenty of intrigue.",
        "Any misgivings bestowed upon Ford V Ferrari by the script are, more or less, eliminated by the film’s big draw: the racing. Gloriously calibrated, simply designed, and modestly edited, audiences are reminded of the dynamite, nearly natural relationship automobiles share with filmmaking.",
        "It’s behind the wheel with Miles that Ford v Ferrari becomes a well-oiled entertainment machine, a thrill ride with a driver’s-eye view of the world’s most exciting track. Everything that doesn’t work is just a distant speck in the rearview mirror.",
        "Watching Bale and Damon channel those two speed freaks in all of their surly, testosterone-spitting glory is a reminder of how much fun it was to watch Bale play a similar character opposite Mark Wahlberg in “The Fighter.”",
        "Ford v Ferrari is a classic Hollywood underdog film about friendship and overcoming obstacles. Mangold’s direction is serviceable, but unspectacular, while Bale is a dynamic presence.",
        "If only director James Mangold had taken the route the Wachowskis did with “Speed Racer,” which had psychedelic colors to spice things up.",
        "Ford v Ferrari’s narrative and emotional beats feel assembled in a factory-floor kind of way. The characters are stock, the story’s ups and downs are easily telegraphed, and the inoffensive but not particularly inventive dialogue is spat up as if the actors were eager to move onto the next thing.",
        "At a time when the nation continues to weigh the fate of its auto industry, James Mangold’s depiction of the Ford Motor Company facing its first major financial threat transparently plays to nostalgic reveries of the industry’s golden age.",
        "It is intermittently a blast, particularly when Bale and Damon ham it up with each other, trading jabs and one-liners, and having childish slap fights in broad daylight as Miles’ saintly, patient wife Mollie (Caitriona Balfe) quietly observes. But when it isn’t a blast, Ford v Ferrari is politically muddled to the point of distraction.",
        "Damon and Bale are unfailingly enjoyable company to be among, steering the psychology away from alpha-male dominance to something more complex and occasionally mystical.",
        "Ford v Ferrari is well acted and shot, but the story doesn’t engage, making James Mangold’s latest effort something of a slog.",
        "Two immensely enjoyable central performances and some of the best race sequences yet filmed fuel an otherwise standard sports movie.",
        "Though it’s bolstered primarily by the charisma of Bale and Damon’s performances, the soulless yet thrilling Ford v Ferrari doesn’t provide much more than huffy banter, corporate rivalry, and an adrenaline rush. The real-life characters deserve more than that.",
        "It is crammed with unearned emotional moments and factory-built male characters whose dedication to their sport we are expected to find adorable and heroic by turns."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "An excellent, adrenaline-rushing, funny, and beautiful film. Believe the critics this time around. This is pure cinema Hollywood at its best! Christian Bale gives yet another incredible performance as Ken Miles and gives the near-perfect actAn excellent, adrenaline-rushing, funny, and beautiful film. Believe the critics this time around. This is pure cinema Hollywood at its best! Christian Bale gives yet another incredible performance as Ken Miles and gives the near-perfect act for an Oscar nomination. All the other roles played by Matt Damon, Jon Bernthal, Tracy Letts, and Josh Lucas all are stellar. One gripe I do have with the film, however, is the slightly slower-paced sequences in non-racing areas. I think the film dragged rather than raced in those portions. But when the film raced, literally, my heart was pumping and I was nearly sweating out of exhaustion! James Mangold gives possibly a Best Director nomination-worthy job, period. All in all, this is an A-tier, one of the best 2019 movies, and an instant classic for me.",
            "review_date": "2019-11-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "My real rating is 8.5 as a film in general, still a solid 10/10 as a racing film. I watched it on IMAX (laser), the engine sounds and screeching felt so good, the cornering was exhilarating, the shifting and throttling finally make sense in aMy real rating is 8.5 as a film in general, still a solid 10/10 as a racing film. I watched it on IMAX (laser), the engine sounds and screeching felt so good, the cornering was exhilarating, the shifting and throttling finally make sense in a racing film, and the music was there pumping hard, my wife was even humming it on the way back to the car. All these alone pay the ticket if you love driving, furthermore, you know you experienced a great racing adventure if after the film you go back to your car and hear your car engine with more affinity, feel the cornering more natural and have the sensation your Prius is really slow, but suddenly you realize that you are going 85 thinking is 55.Why 8.5 as a film in general? The cinematography was lacking, there was no worldbuilding whatsoever: shots around houses, labs, testing/racing tracks, and even cities were missing or only stills, and way too many short cuts to deliver an event such as pass or tight corner. Story-wise, it is based on real events, so saying the plot is obvious, it is a dumb thing to say. The acting is top-notch: Bale always creates a character that makes you forget about him in a snap, with incredible powerful deliveries left and right; Damon is always Damon, likable AF, he is like Tom Hanks at this point, you are just happy to see him on screen doing his thing; The Punisher is great too, he came and punched his way through. That being written, Ken's wife and child are \"the\" rockstars (I won't pretend I remember their names), every scene that was around them was really powerful, it shows that Mangold strives on getting the best of the best, and this pair has a bright future ahead.Bloody hell, go on and watch it already!",
            "review_date": "2019-11-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the best movies i have seen in my life. It has adrenaline from start to end with touches of drama. Excellent tempo. Very good script and direction. Very convincing performances. It is accompanied by a very good music that immerses youOne of the best movies i have seen in my life. It has adrenaline from start to end with touches of drama. Excellent tempo. Very good script and direction. Very convincing performances. It is accompanied by a very good music that immerses you along it. The movie lasts 2 hours 32 minutes and you don't feel them, it's worth it, you enjoy every goddamn second. I hadn't felt this way for a long time, and I don't know about cars and they don't attract me, but the movie is made with love, in addition to everything you learn from history with this based on real life. I could watch it a thousand times.",
            "review_date": "2019-11-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Awesome crowdpleaser that deserves all the attention and hype needed to keep Fox going while under Disney.",
            "review_date": "2019-11-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is brilliant film as a original work and as a work for those who especially love cars, speed and wonderful picture. Actors is marvelous - Matt and Christian are the best for there roles. The movie isn't boring, has a dynamic actions andThis is brilliant film as a original work and as a work for those who especially love cars, speed and wonderful picture. Actors is marvelous - Matt and Christian are the best for there roles. The movie isn't boring, has a dynamic actions and true feel of speed.Also, the story ins't changed in compare as original history",
            "review_date": "2019-11-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An old-fashioned type of film they don’t seem to make too often anymore. Damon and Bale are great and the racing scenes are intense. A dad film if there ever was one...",
            "review_date": "2019-11-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "American car designer Carroll Shelby (Matt Damon) and British racer Ken Miles (Christian Bale) team up in order to build a legendary race car for the struggling Ford automobile company in order to challenge Ferrari at the 24 hr Le Mans raceAmerican car designer Carroll Shelby (Matt Damon) and British racer Ken Miles (Christian Bale) team up in order to build a legendary race car for the struggling Ford automobile company in order to challenge Ferrari at the 24 hr Le Mans race during the mid-60s. Of course, this car was the GT40, and the rest is history. Going into this and judging from most of the trailers, I knew it was probably gonna follow the standard biopic tropes and be crowd-pleasingly predictable at times... And it was! However, that definitely didn't change how much fun I had with this film regardless. It's got all the racing and car scenes auto-buffs will definitely be all over, and even the non-car enthusiasts just looking for a thrilling ride of a story likely won't be disappointed. It didn't feel too long despite its 2.5 hr runtime, but there were definitely a handful of filler scenes that felt a bit longer than necessary. Acting-wise, Damon and Bale make a great team and bring plenty of charm to the film with their performances. Overall, despite its predictability with many of the story elements, the same can't be said for the racing sequences (especially in the second half), which had me on the edge of my seat, and Damon and Bale without a doubt work together great alongside one another to make this ride a highly entertaining one!",
            "review_date": "2019-11-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Worth every minute. The chemistry between Matt Damon and Christian Bale sizzles and leaves you wanting more. Crisp writing and acting makes this movie shine. While billed as corporation vs corporation, it's actually man vs corporation and allWorth every minute. The chemistry between Matt Damon and Christian Bale sizzles and leaves you wanting more. Crisp writing and acting makes this movie shine. While billed as corporation vs corporation, it's actually man vs corporation and all the suited egos houses within.",
            "review_date": "2019-11-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A well-made piece of little-known sports history, specifically the intense rivalry between Ferrari and The Ford Motor Company in their highly competitive efforts to win the 24 Hours of Le Mans during the 1960s. It's the kind of film thatA well-made piece of little-known sports history, specifically the intense rivalry between Ferrari and The Ford Motor Company in their highly competitive efforts to win the 24 Hours of Le Mans during the 1960s. It's the kind of film that appeals to a specialty audience, despite its human angle, so, if you're not into auto racing, this probably isn't for you. However, for those who enjoy the subject matter and appreciate such things as great speedway action footage, this is one of the best films ever made about the sport. With a mostly breezy, light-hearted script and fine performances by Christian Bale and Matt Damon (who share a great chemistry together), this is an eminently entertaining offering.",
            "review_date": "2019-11-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Literally a part is the history of the Automobile, the struggle of the American mass-car manufacturer against the race car specialist, Pride and the essence of racing, a tough but genius driver, a genius of car creation. if you like cars, orLiterally a part is the history of the Automobile, the struggle of the American mass-car manufacturer against the race car specialist, Pride and the essence of racing, a tough but genius driver, a genius of car creation. if you like cars, or race watch.",
            "review_date": "2019-11-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "love it!, The level of the cars shown in the movie are just a pleasure for any car lover.",
            "review_date": "2019-11-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is about passion, friendship and talent. It's riveting from start to end, Matt Damon is great, Christian Bale is even greater. James Mangold and his team doesn't make any mistakes, the scenes flows, the car races are simply theThis movie is about passion, friendship and talent. It's riveting from start to end, Matt Damon is great, Christian Bale is even greater. James Mangold and his team doesn't make any mistakes, the scenes flows, the car races are simply the best I ever saw in a movie.The story is somewhat classic, it's a biopic, but damn,, it may be the best classic American biopic ever made.Hold on to your seats, this is a great ride.",
            "review_date": "2019-11-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "For a movie that spans two and a half hours, about one hundred and fifty minutes, I found myself enjoying every single one. 'Ford v Ferrari' has what makes a racing movie great with thrilling sequences and a story with effective dramaticFor a movie that spans two and a half hours, about one hundred and fifty minutes, I found myself enjoying every single one. 'Ford v Ferrari' has what makes a racing movie great with thrilling sequences and a story with effective dramatic tension. But the real winner of this film: the humorous, poignant, and most importantly, human chemistry between Damon and Bale, (also supported by a very talented ensemble). In summation, it will have you transfixed.",
            "review_date": "2019-11-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Delivering plenty of laughs, adrenaline-pumping action, as well as powerful dramatic and emotional moments, \"Ford v Ferrari\" is a triumph on all levels.",
            "review_date": "2019-11-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's a movie with a capital \"F\".Ford vs. Ferrari, with Fiat thrown in the mix.\nThe movie features Fantastic and Fabulous performances. The leading actor, Ford-the-car deserves nothing but a praise, while Ferrari-the-car truly shines as aIt's a movie with a capital \"F\".Ford vs. Ferrari, with Fiat thrown in the mix.The movie features Fantastic and Fabulous performances. The leading actor, Ford-the-car deserves nothing but a praise, while Ferrari-the-car truly shines as a supporting actor.As to the real people, well, that's a different story. The movie director managed to do what no other director could - have a great Christopher Bale act poorly, with the rest of the actors not Fairing any better. It's is a Feel good, inspirational, one-dimensional Flick, with performances Forced and Fake (again, except the race cars).My score: Four out of ten (trying to be Forgiving).",
            "review_date": "2019-11-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is one of the best films of 2019 and easily among the best of both Matt Damon & Christian Bale's careers. As a lover of history and cars, I can see that my expectations for this movie were high and it did not disappoint. Usually racingThis is one of the best films of 2019 and easily among the best of both Matt Damon & Christian Bale's careers. As a lover of history and cars, I can see that my expectations for this movie were high and it did not disappoint. Usually racing movies show us the good guys winning in the end but this one was different. It made the audience care not just about the characters but also the historical significance of what they achieved. This should be considered an American classic. Beautifully written and well acted. HIGHLY Recommend it to anyone that loves cars",
            "review_date": "2019-12-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "James Mangold’s ‘Ford v Ferrari’ is a fun two-and-a-half hour ride down memory lane, circling the lives of legendary race car driver Ken Miles and equally esteemed car designer Carroll Shelby.The film gets off to an uninspiring start,James Mangold’s ‘Ford v Ferrari’ is a fun two-and-a-half hour ride down memory lane, circling the lives of legendary race car driver Ken Miles and equally esteemed car designer Carroll Shelby.The film gets off to an uninspiring start, introducing the main characters using quick-hitting scenes that turn each into an eye-rolling archetype.  Shelby is the inspired engineer.  Miles is the irascible wildcard.  Henry Ford II is the cutthroat Man of Industry … and they even give him a sniveling bulldog lackey.The second half of the film picks up the pace and is considerably more engaging.  Mangold does a fine job filming the racing scenes, choosing just the right balance of different viewpoints and cuts.  Beyond that, he thankfully spares audiences from the awful “shaky camera effect” that some filmmakers would’ve used anytime they wanted to ramp up the action on screen.Given that the ‘24 Hours of Le Mans’ race is indeed twenty-four hours long, Mangold also excels at keeping an even pace down the final stretch, not relying too much on either the racing or the off track drama, but rather striking an even balance between the two.",
            "review_date": "2019-11-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Christian Bale and Matt Damon star in a car-racing epic with a fine mind and a big heart.",
            "review_date": "2019-11-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Amazingly done movie with an even more amazing cast. A must see! Bale ❤️",
            "review_date": "2019-11-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "American car designer Carroll Shelby (Matt Damon) and British driver Ken Miles (Christian Bale) work together to build a revolutionary race car for the Ford Motor Company to take on Ferrari at the 24 Hours of Le Mans in France 1966. Le MansAmerican car designer Carroll Shelby (Matt Damon) and British driver Ken Miles (Christian Bale) work together to build a revolutionary race car for the Ford Motor Company to take on Ferrari at the 24 Hours of Le Mans in France 1966. Le Mans ’66 an exhilarating trill ride from start to finish and I enjoyed every minute of it.The art of good story telling is creating something that anyone can enjoy, you don’t have to know a whole lot about cars and racing to appreciate Le Mans ’66. I’m sure all you car nuts out there will get a little more out of this film but when you break it down, Le Mans ’66 is an exciting real life story jam packed with intense racing sequences and some unexpected emotional moments. The racing scenes are all real and not relying on computer generated effects and the results pay off. Nail biting drama, extremely immersive and will have you on the edge of your seat. But for me what pushes this movie into five star territory is the relationship between Christian Bale and Matt Damon. Genuine and humorous with electric chemistry.I knew virtually nothing about the story before seeing Le Mans ’66 and I really feel this added to the drama. Whether you’re interested in racing or not I can promise you’ll enjoy this film. A truly gripping story with two brilliant central performances from Damon and Bale. Thoroughly enjoyable and highly recommended.",
            "review_date": "2019-11-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The car racing scenes are just amazing, the acting is great and the movie is just good.",
            "review_date": "2019-11-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Once again we're treated to a rose-tinted view of events of the recent past, dramatised and watered-down a point where the film is trying to tell a story, but that story exists in a fantasy environment.I'm all for family-orientated movies,Once again we're treated to a rose-tinted view of events of the recent past, dramatised and watered-down a point where the film is trying to tell a story, but that story exists in a fantasy environment.I'm all for family-orientated movies, but it's hard to watch a film about what is in effect corporate America in the early-mid '60s, and not have an aura of casual racism, sexism, ubiquitous alcohol consumption and pretty much everyone chainsmoking.It just takes the viewer out of any 'moment' in the movie because it's just so sterile and fake.So, it's another potentially great film ruined by the curse of the 'PG-13'/'12A' rating that prevents realism from being shown.",
            "review_date": "2020-01-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's not easy to make car racing look interesting on film, as shots of cars going around corners and faceless drivers shifting gears start to feel pretty repetitive. Though the many scenes of fast driving do add some adrenaline, the film hasIt's not easy to make car racing look interesting on film, as shots of cars going around corners and faceless drivers shifting gears start to feel pretty repetitive. Though the many scenes of fast driving do add some adrenaline, the film has to rely on a dramatic arc that hinges on the possibility of building a fast car and getting the right driver. Unfortunately this dilemma advances all too predictably, and features static characters in cookie-cutter relationships that feature no real tension and no development whatsoever. The characters are drawn well enough to elicit a few laughs at unexpected juxtapositions, but mostly they just go through the motions, and we literally hear the same overblown lines at the end of the film as we do at the beginning, as though the film wanted to remind viewers that nothing actually happens in between. Some nice period touches and decent turns by some supporting actors working with limited material demonstrate that the filmmakers were at least trying, but the flat relationships and tepid dialog keep things moving at a snooze. Maybe watch it on an airplane if there's nothing better?",
            "review_date": "2019-11-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "In 1966, Ford wanted to jazz up its brand, so they entered the 24 Hours of Le Mans to take on the historically dominant winner, Ferrari. Matt Damon plays the sports car designer who teams up with a famous driver (Christian Bale) for theIn 1966, Ford wanted to jazz up its brand, so they entered the 24 Hours of Le Mans to take on the historically dominant winner, Ferrari. Matt Damon plays the sports car designer who teams up with a famous driver (Christian Bale) for the titular challenge. This film is less about driving and more about the team's drive to win, including the technical challenges and the duo's head-to-head combat with the management of Ford. Most of the racing is saved for the big event, which is masterfully captured and downright riveting. The leads create a compelling duo, but the entire cast is makes this movie work. Director James Mangold keeps the dialogue and conflicts involving, while expanding their personal lives to give extra heft to the drama. A smart and compelling look at hard competition and the will to win.",
            "review_date": "2019-11-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "CGI is bad, historical accuracy and technical details are bad, story is very basic and formulaic. 2 main characters and chemistry between them carry it, nothing else special",
            "review_date": "2019-11-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I can count on 1 finger how many racing car movies I have seen and though I may recall who was in them I don't remember any of them and, sadly, because I had heard good things about \"Ford v Ferrari\" it will probably be in the same category.I can count on 1 finger how many racing car movies I have seen and though I may recall who was in them I don't remember any of them and, sadly, because I had heard good things about \"Ford v Ferrari\" it will probably be in the same category. Based on a true story, the screen writers Jez Butterworth, John-Henry Butterworth and Jason Keller, juggle 4-5 different stories to add human drama to the film while eliminating any one of them would have brought the movie in at a reasonable showing time, way less than the 2 hours and 30 minutes it runs.At the same time the director James Mangold has one too many race scenes, one too many shots of a foot hitting the brakes, more shots than necessary to prove Ken Myles is eccentric or business owners and their employees can be  underhanded and ruthless. Caitriona Balfe, though a bit difficult to understand, impressed me playing the wife of Christian Bale, who as driver Ken Myles, has been getting raves for his role, left me cold and also hard to understand. Matt Damon is, as always, impressive in a strong, somewhat silent way, as former champion driver and now designer of race cars. Tracy Letts in the role of Henry Ford II has a 2 minute moving and at the same time funny scene while being solid in the rest of the film. Josh  Lucas as the boss's right hand man is an effective villain even if the role is a bit overwritten and obvious.The banter between Damon and Bale tells a lot about both men but one segment, meant to be funny is only funny due to the reaction of Balfe while Bale's scenes with Noah Jupe, just right as his son, shows the man to be a good father.The behind the scenes of business life certainly isn't new but the behind the scenes of the racing sport and business aspect of it and car companies is interesting.Though you may know who the winner is, or will be, in \"Ford v Ferrari\" it will entertain you if you can get through the 30 to 40 minutes unnecessary segments.",
            "review_date": "2019-11-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Watched Ford v Ferrari : Exhilarating !!!Outstanding cinematography engaging screenplay and very good direction with perfect background score work !!\n\nStory of famous  24 Hours of Le Mans presented with excellency !!\n\nActing side everyoneWatched Ford v Ferrari : Exhilarating !!!Outstanding cinematography engaging screenplay and very good direction with perfect background score work !!Story of famous  24 Hours of Le Mans presented with excellency !!Acting side everyone got chance to shinechristianbale done his role ; neat and sparkling!mattdamon is Highly astounding !!!Over all ford v ferrari is inspiring,fun , emotional and thrilling  race to finish !!!",
            "review_date": "2019-11-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Have watched every racing movie that was ever produced and this, by far, was my favorite. Sure it’s an American rah-rah-toot-toot movie, but what a ride!",
            "review_date": "2019-12-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Conventionally crafted but with today's state-of-the-art VFX, this well acted sweeping true story of racing and the broader auto industry fires on all cylinders. (Unlike the also 1960's period set ridiculous and ridiculously over-rated \"OnceConventionally crafted but with today's state-of-the-art VFX, this well acted sweeping true story of racing and the broader auto industry fires on all cylinders. (Unlike the also 1960's period set ridiculous and ridiculously over-rated \"Once Upon a Time in Hollywood\", this actually has a strong story!)  Despite some of the best racing sequences ever filmed it surpasses previous racing film entries because of its human drama and is the rare outing these days that lives up to the praise.  Like last year's \"Green Book\" this is what Hollywood and only Hollywood can deliver so well.  Had they cut about 10 minutes in the end to match the pace set in the beginning, it would rate even higher here.",
            "review_date": "2020-01-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A exhilrating journey through the life of competition of Ken Miles, Ford V Ferrari surely balances the drama and action with some comedic elements in between to make the film an engaging viewing experience. While biographic films might beA exhilrating journey through the life of competition of Ken Miles, Ford V Ferrari surely balances the drama and action with some comedic elements in between to make the film an engaging viewing experience. While biographic films might be boring at times, Mangold kept the pace well enough to let us feel the bond between Ken Miles and Carrol Shelby, whom despite obstacles mounting both from within the Ford Motors and the races itself, still manages to make the best out of the situtation to prevail against odds. Although the story is not about winning, it's about courage and committment ones needs to battle against the unknown. Some downsides would be the uneven screentime of Lee Iaccoca of John Bernthal's character and the way too conventional filming styles.",
            "review_date": "2020-03-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It has become apparent to me that James Mangold is probably one of the most under-appreciated directors of our time. This is a filmmaker who has made some fascinating films and many people probably don't know they were by him. From 'Walk theIt has become apparent to me that James Mangold is probably one of the most under-appreciated directors of our time. This is a filmmaker who has made some fascinating films and many people probably don't know they were by him. From 'Walk the Line' (2005), '3:10 to Yuma' (2007) and even 'Logan' (2017), he has made some fantastic films, and has a very good eye in how he approaches his storytelling. Here, with 'Ford v Ferrari', he uses Matt Damon and Christian Bale (surely to get some Oscar consideration for his work) as the two leads to tell the story of how Carroll Shelby (Damon) persuades Ken Miles (Bale) to compete in a race against Ferrari by driving a Ford. Shelby designs cars, and wants to team up with Ford to make the best race car possible. The big company knows that they can't remain financially stable if they keep making car after car. They need style and they need to keep up with competition, but most importantly, they need a reputation. Shelby uses Miles as a way to promote the Ford race cars as he is clearly the best racer out there. Their friendship, their bond is what keeps this movie lifted throughout. The screenplay, written by Jez Butterworth, John-Henry Butterworth and Jason Keller keeps these two central characters interesting when they're apart and when they're together. They know that Damon and Bale can work around the dialogue and that their chemistry is vital to the story. The racing sequences are also some of the best you'll see on screen. This movie can get a little long from time to time, so it can be hard to keep interested, but the acting, the chemistry, the racing and just the overall drama, with hints of comedy sprinkled here and there, is enough to keep you invested. It's sure enough that Bale will score another Oscar nomination for his work, hopefully, Mangold can get a \"Best Director\" nomination for his work here. It's a film and a story that deserves to be seen.",
            "review_date": "2019-11-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Seemed to me that every time there were Ford three-piece-suits on the screen the movie went to sleep. Somehow the movie lost track of the real fascination of building a Le Mans winner. But anything with Bale in it is mandatory viewing for me.",
            "review_date": "2019-11-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Summary: Car Top GunThe Good:  - Awesome acting from three great actors.  - Nuanced dialogue and a well-written screenplay of historical events that's funny and relatable (maybe too relatable).  - Great action cinematography on the races.Summary: Car Top GunThe Good:  - Awesome acting from three great actors.  - Nuanced dialogue and a well-written screenplay of historical events that's funny and relatable (maybe too relatable).  - Great action cinematography on the races. The bad: - Too many themes. - Not nuanced enough in the one it really wanted, the business vs. art theme.  - Very talky.",
            "review_date": "2020-02-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "¡Wheels of fire! The first act maybe is a little slow but the effort of Damon and Bale are notorious for make a real fact drama of team work and friendship, and adrenalizing races  without the boasting formula of Fast & Furious, something you¡Wheels of fire! The first act maybe is a little slow but the effort of Damon and Bale are notorious for make a real fact drama of team work and friendship, and adrenalizing races  without the boasting formula of Fast & Furious, something you will appreciate. Rush!",
            "review_date": "2019-11-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Shortly after about 20 minutes into the film I started to get doubts about the movie. Not for the quality but because I was worried that the story wasn't going to justify the whole two and a half hours. But Ford v Ferrari surprises and endsShortly after about 20 minutes into the film I started to get doubts about the movie. Not for the quality but because I was worried that the story wasn't going to justify the whole two and a half hours. But Ford v Ferrari surprises and ends up being a rather entertaining and intense experience.James Mangold is armed with two solid Christian Bale and Matt Damon to provide a story that in addition to being interesting and exciting also has a pleasant dose of humor, irony and sarcasm in something that could lend itself to be more dramatic.While it's true the film shines and is much better in the scenes that involve the car races, it manages to balance in a good way all the narrative aspects of the story, like the ones that include the corporate elements with Ford and its bureaucracy, the scenes that show us how they achieved the mechanical improvements of the car, to the link and friendship between Ken Miles and Carroll Shelby.All this compensates both sides of the balance achieving a good pace that doesn't allow the argument or interest to decline. As I said it's two and a half hours long and I didn't feel them and believe me, that's hard to achieve.I really didn't plan on awarding it an 8 because I didn't really like the ending.I feel that it didn't do justice to the story and how it had been built up to that moment and it's not that it falsified an event that really happened, it's simply that it didn't feel in tune with the rest, but considering all the other stuff and the good time I had watching it, it deserves the 4 stars.I expected something good and it was therefore Ford v Ferrari deserves the recognition and the attention.",
            "review_date": "2019-12-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nI like this movie, very fun. Christian Bale at his best, very exciting of the year! It's very good movies! In 1966, British driver Ken Myers defeated Ferrari when he opened the Ford GT40 and won the 24 Hours of Le Mans!",
            "review_date": "2019-11-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ford v Ferrari might not be a great movie, but it is still pretty good. It is two and a half hours long and it never feels like it, because the story is entertaining, genuinely interesting and flows very smoothly. The fantastic performancesFord v Ferrari might not be a great movie, but it is still pretty good. It is two and a half hours long and it never feels like it, because the story is entertaining, genuinely interesting and flows very smoothly. The fantastic performances from the leads (Matt Damon and Christian Bale) will really make you connect with their characters and follow their journey. They both develop good chemistry and are so fun to watch together. There's some good comedy occasionally and it happens naturally. The humor doesn't affect the tone, because, like I said, it feels natural and not forced for the sake of having humor. While the performances from basically every actor of the cast are really good (not as good as the leads, tho), some of the characters felt like cartoons. Sometimes there are moments that get over the top and feel like they belong better in a dumb comedy film, but those moments don't happen too often and the tone remains consistent (Those moments are entertaining tho, but I felt them out of place). The music feels like stock music downloaded from YouTube, and I feel like the racing sequences would've been a lot more intense with less music. Speaking about the racing sequences; They are amazing. The great cinematography and nice editing really helps to capture the races clearly. There wasn't a single moment in the races where I couldn't understand what was going on. Everything was shown nice and clear. The sound design and the sound mixing were fantastic and really helped make the races intense.Overall this is a really good movie: It has stunning technical aspects and great performances, but I feel like some characters, the music and some writing choices could've been better.",
            "review_date": "2019-11-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The first 45 minutes of the film descend into Phantom Menace-tier lunacy, with too many characters introduced and too many events rushed through far too quickly. The rest of the movie plays out like a much more grounded, realistic \"Days ofThe first 45 minutes of the film descend into Phantom Menace-tier lunacy, with too many characters introduced and too many events rushed through far too quickly. The rest of the movie plays out like a much more grounded, realistic \"Days of Thunder\" - which sounds good on paper, but in reality makes them film extremely cliche and bland. The cars are the stars of the final half, but after so many low, sweeping shots of the GT, you feel like you're watching a Ford ad.",
            "review_date": "2019-11-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nthis movie good but I can't say is great .this about two car that in the end Ferrari win the game",
            "review_date": "2019-11-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "i have watched many movies about cars like the fast and furious (of course) or the 2014 need for speed movie. but ive never really come across anything like this before. sure it is based on the actual story, but the way it had been reimaginedi have watched many movies about cars like the fast and furious (of course) or the 2014 need for speed movie. but ive never really come across anything like this before. sure it is based on the actual story, but the way it had been reimagined was so interesting. whenever i watch a scene from the 24 hours of le mans in 1966, i always laughed at the crashes and cars flying all over the track, but this movie really made this event feel like a living hell that you would have to be out of your mind to take on. the cars were weathered like they came out of it as well, the crashes look absolutely fatal and deadly to you if you're not careful enough. the characters weren't the best, but they did do most of the things the actual people did. the cars weren't the real deal but they were beautiful and sounded evil. a really nice way to show the \"beauty of insanity\". the way they portrayed ferrari really made me hate how ferrari shot at ford and really refreshed me when they were destroyed at le mans. this movie overall is not just about retelling a legendary story from the 60s, it's about the stupidly insane things 2 people can do in a few years to beat an automaker that had been racing for way way longer.",
            "review_date": "2019-11-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I'm going to look back at 2019 fondly for supplying so many great movies like Once Upon A Time In Hollywood, Joker, Doctor Sleep, and now, Ford v Ferrari. I loved the hell out of this movie. My all-time favourite actor, Christian Bale, bringsI'm going to look back at 2019 fondly for supplying so many great movies like Once Upon A Time In Hollywood, Joker, Doctor Sleep, and now, Ford v Ferrari. I loved the hell out of this movie. My all-time favourite actor, Christian Bale, brings his A-game to this movie. Oscar nomination is incoming. Matt Damon also brings his A-game; this is probably the best I've seen from him. Bale and Damon's chemistry is fantastic too; I wouldn't mind seeing them work again in another movie. Jon Bernthal, Caitriona Balfe, Tracy Letts, Josh Lucas and Noah Jupe round out the cast and are brilliant in their roles. The movie is written well too. The writers portrayed the friendship between Ken Miles (Christian Bale) and Caroll Shelby (Matt Damon) well. They also brilliantly captured the family dynamics involved with racecar drivers, a frighteningly dangerous sport, in that era in particular. They even captured the politics involved in working for a giant like Ford excellently, bringing tension and also humour to the story. One scene involving Enzo Ferrari, giving his opinion about the Ford team is a highlight, so too the responding scene involving Henry Ford II. I can't praise the film enough on the technical front. The score by Marco Beltrami and Sanders captures the intensity of the races perfectly. The cinematography is gorgeous from start to finish. The directing is f'n fantastic, masterful even, James Mangold take a bow. What a movie he put together. The race scenes were freaking amazing. In particular, the Le Mans sequence. I was on the edge of my seat the entire time, and I sincerely believe it should go down as one of the best sequences in film, period. There is a bit in that sequence that should earn Bale an Oscar nod on its own. I can't recommend this movie enough. It's one of the best of 2019, a year that seems to keep on giving.",
            "review_date": "2019-11-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is 10/10 one of my favorite movies of all time it should be considered an American classic and anything with Christian Bale or Matt Damon in it I have to watch. But them as a duo?! Never would have thought a racing movie could be so good.",
            "review_date": "2019-12-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's a good, solid film, but definitely not a must-see in my book. It's missing some \"magic\" for lack of a better word. Something to make these real-life events shine.  I'll say that both Matt Damon and Tracey Letts do amazing jobs, and BaleIt's a good, solid film, but definitely not a must-see in my book. It's missing some \"magic\" for lack of a better word. Something to make these real-life events shine.  I'll say that both Matt Damon and Tracey Letts do amazing jobs, and Bale is excellent as usual. Josh Lawrence plays the heel, as usual - though he was much better in \"You Can Count on Me.\" I want to see much more of Catriona Balfe - she jumped off the screen.",
            "review_date": "2019-11-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a fun Hollywood movie that I found amusing enough despite its long length. It suffers from typical underbaked dramatic tension with \"the wife\" and cartoonish villians. Some nice golden light with Kodachrome overlay and good sound. YouThis is a fun Hollywood movie that I found amusing enough despite its long length. It suffers from typical underbaked dramatic tension with \"the wife\" and cartoonish villians. Some nice golden light with Kodachrome overlay and good sound. You could do worse if you feel the need to go see something this weekend, but you could also skip it and not miss much...",
            "review_date": "2019-12-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Matt Damon is great as Carroll Shelby and the cars are great as cars but Mangold's direction and the cinematography give the racing scenes and most of the scenes with Christian Bale an unfortunate cartoonish quality instead of the intense andMatt Damon is great as Carroll Shelby and the cars are great as cars but Mangold's direction and the cinematography give the racing scenes and most of the scenes with Christian Bale an unfortunate cartoonish quality instead of the intense and gritty quality that a racing movie needs.",
            "review_date": "2020-04-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A fun retelling of a little-known story. Good chemistry between Damon and Bale. Interesting to see a behemoth of a company like Ford to be portrayed as the little guy. Fans of American exceptionalism will no doubt love this and pine for theA fun retelling of a little-known story. Good chemistry between Damon and Bale. Interesting to see a behemoth of a company like Ford to be portrayed as the little guy. Fans of American exceptionalism will no doubt love this and pine for the \"good old days,\" but I think anyone who appreciates a good story, gorgeous cars and good acting can find something enjoyable in this flick. I particularly appreciated that it didn't have a typical storybook ending...",
            "review_date": "2019-11-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The racing sequences are cool but much of the drama feels contrived. Bale is entertaining.",
            "review_date": "2020-03-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Entertaining biopic on the Le Mans race of 1966, a somewhat obscure history piece where Ford, once upon a time, managed to dominate that world renowned race. Its done in a typical underdog vs establishment fashion (which was a bit strange,Entertaining biopic on the Le Mans race of 1966, a somewhat obscure history piece where Ford, once upon a time, managed to dominate that world renowned race. Its done in a typical underdog vs establishment fashion (which was a bit strange, considering in real life, the underdog was Ferrari and not the other way around. Beside that fact, this flick is well acted by the two leads, and competently directed by the always dependable Mangold. Yet, it did not bring anything new to the table.",
            "review_date": "2020-01-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "late in the movie during a huge celebration for winning Miles starts telling Shelby how to make the car go faster and Shelby, with the crowd celebrating all around says...\"well what are we doing here?\".The 2 guys were living their liveslate in the movie during a huge celebration for winning Miles starts telling Shelby how to make the car go faster and Shelby, with the crowd celebrating all around says...\"well what are we doing here?\".The 2 guys were living their lives just as they wanted....not for some payoff down the line but for the  process itself. Awesome movie. Crowd pleaser. Lots of applause in the theater at the end.",
            "review_date": "2019-11-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ford v Ferrari is one hell of a great movie. For starters, the acting from both Matt Damon and Christian Bale is Oscar worthy. Second, the racing scenes are so well shot and so well directed that at times you feel like you're the one in theFord v Ferrari is one hell of a great movie. For starters, the acting from both Matt Damon and Christian Bale is Oscar worthy. Second, the racing scenes are so well shot and so well directed that at times you feel like you're the one in the car. Go see this movie.",
            "review_date": "2019-11-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"Logan\" and \"Walk The Line\" director James Mangold reteams with his \"3:10 To Yuma\" star Christian Bale for \"Ford v Ferrari,\" an easy shoe-in for most deceptive title of the year, as this isn't really a movie about the pride of one man in\"Logan\" and \"Walk The Line\" director James Mangold reteams with his \"3:10 To Yuma\" star Christian Bale for \"Ford v Ferrari,\" an easy shoe-in for most deceptive title of the year, as this isn't really a movie about the pride of one man in Detroit, Michigan and another in Modena, Italy, nor is it even really about cars. This is an effective, thrilling, intuitive and enjoyable dissertation on perseverance, friendship, and the neverending battle between creativity and big business, featuring two dynamite performances from both Bale and Matt Damon. Yes, it's a tad safe, and it does tend to play a little loose with certain aspects of truth. However, if I'm being honest, I'm not necessarily sure there's a dire upshot in smoothing over a few edges here and there, especially in a story that bears little to no impact on current circumstances, events, or political movements. It's not as though this is a biopic of one of modern society's formative figures, or even an allegorical exploration into the underpinnings of some of today's issues. We're talking about the difference between cheating during the Super Bowl and cheating in a game of Jenga. That's not to say this movie bears no weight of any kind, though, as all forms of technicality on display (i.e. sound design/mixing, cinematography, stunt work, etc.) help remind you that this at times a life or death pursuit. I'm no expert on automobiles, but I do know a bit about film. And this one's more than worthy of a spin. What a ride.",
            "review_date": "2019-11-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a very visceral film about the excitement of driving a race car that should appeal to anyone who loves to drive any kind of vehicle. The lead actors are very appealing, and the film should at least win some awards for film editingThis is a very visceral film about the excitement of driving a race car that should appeal to anyone who loves to drive any kind of vehicle. The lead actors are very appealing, and the film should at least win some awards for film editing this year, and perhaps for the very convincing performances of Christian Bale and Matt Damon. If you want to see a “fun” movie, this is the film to see.",
            "review_date": "2019-11-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I dont understand the title, Ferrari is not the enemy in this movie, but Ford, so it should be more Miles & Selby vs. Ford. The political sabotages in the own corporation are interesting, but sometimes a bit unrealistic (\"3 at the sameI dont understand the title, Ferrari is not the enemy in this movie, but Ford, so it should be more Miles & Selby vs. Ford. The political sabotages in the own corporation are interesting, but sometimes a bit unrealistic (\"3 at the same time\"). Ferrari is not arrogant in my view and never an enemy, in contrary, Shelby was using some unfair methods in the races. But Shelby is american, so a hero....not in my opinion. There are some feminists elements also, that I didnt like: Miles behaved to his wife like a softie what is very unrealistic if you remind his job and the time. On the other side some shots during driving were nice, but if you follow Moto GP or Formula 1 you know better.So overall a good movie, but there are some weird situations.",
            "review_date": "2020-02-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I watched this film at home not knowing what to expect. I know a lot of critics loved it but these type of movies have never been my thing. I found myself loving this film from the get go and the film never lost my interest. Every action hadI watched this film at home not knowing what to expect. I know a lot of critics loved it but these type of movies have never been my thing. I found myself loving this film from the get go and the film never lost my interest. Every action had me on the edge of my seat and the ending was beautifully heartbreaking. I loved this film and recommend this to anyone who is even a little interested.",
            "review_date": "2020-07-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An excellent movie, and a cinematic delight. Interesting, endearing characters, and an interesting period of car history (that I knew nothing of.)The plot is well aided by superb acting, particularly from Christian Bale.It comes to tell theAn excellent movie, and a cinematic delight. Interesting, endearing characters, and an interesting period of car history (that I knew nothing of.)The plot is well aided by superb acting, particularly from Christian Bale.It comes to tell the viewer a tale in a fascinating and fun manner. No politics or preaching. This movie is done to provide you, the movie-goer, with a good time. In 2019, that's not to be taken for granted.My minor complaints are that the rivalry with Ferarri could have been fleshed out a bit - his driver, in particular, is reduced to a mean expression; and that the ending, although taken from reality, leads to a sudden shift in the theme of the film, that in my opinion takes away from the impact of the main event.Still, one of the best movies of this year.",
            "review_date": "2019-12-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If you like a little bit of speed (forget Fast and crap) go see it. Your testosterone will go to the sky, I promise you... ,,/",
            "review_date": "2019-11-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The sound of engine directed to my heart. Why The great Ferrari and rich Ford.",
            "review_date": "2019-12-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "+Beautiful 4k HDR+Excellent cinematography+Fantastic cast\n-Average screenplay -OST feels carries an oddly modern tone\n\nI was unsure what to expect going into this, but F vs F is another great sports movie with the all the classic dramatic+Beautiful 4k HDR+Excellent cinematography+Fantastic cast-Average screenplay -OST feels carries an oddly modern toneI was unsure what to expect going into this, but F vs F is another great sports movie with the all the classic dramatic beats you come to expect from the genre. All this is elevated by the sexy cars and talented cast. F vs F is a well made yet predictable ride.",
            "review_date": "2020-02-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An enjoyable ride from start to finish, quite literally. Apart from a few cheesy scenes this is a well-acted, amazingly choreographed and thrilling movie. It does take a few liberties with the story, but it is a movie, so I would expect noAn enjoyable ride from start to finish, quite literally. Apart from a few cheesy scenes this is a well-acted, amazingly choreographed and thrilling movie. It does take a few liberties with the story, but it is a movie, so I would expect no less. The overall narrative is that of the real events that occurred, and most of the characters are real people who existed in or around the events.But the really impressive feat of the movie is the racing itself. No matter if you enjoy racing or not, you will be on the edge of your seat biting your fingernails. You really want these guys to succeed. And you might think that's a given. It is not.If you don't know the story of Ken Miles and the 1966 Le Mans, I would highly recommend going in completely blind. Read up on it afterwards if you want. You'll realize that, aside for the over-dramatization of certain events, this movie is pretty accurate in its portrayal of the event and what led up to it.",
            "review_date": "2021-12-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Instant classic.  It struck me about halfway thru the movie, it all works.  The casting is perfection.  The screenplay is fantastic.  The acting is sincere and heartfelt. The racing is thrilling.  The music is rousing and inspiring.  MoreInstant classic.  It struck me about halfway thru the movie, it all works.  The casting is perfection.  The screenplay is fantastic.  The acting is sincere and heartfelt. The racing is thrilling.  The music is rousing and inspiring.  More than all of that, the sum of those parts, I understood their passion for the cars, the sport and speed.",
            "review_date": "2019-11-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Story line is predictable but the acting performances and the action filming more than compensate. A good old popcorn eating movie",
            "review_date": "2020-01-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It is a nice film that is long and at times it feels like that, however, is a nice automobile film based on a true story.",
            "review_date": "2021-12-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A brilliant film with good cast and cars racing scenes are amazing. Good Movie",
            "review_date": "2019-11-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Such a thrilling, fun to watch, beautifully done movie. No extra strings attached, just an amazing story about passion, friendship and superation. Just an awesome story put up in screen with the mastery of Mangold.",
            "review_date": "2019-12-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ford v Ferrari is as good of a racing movie as I've ever seen. The story (based on true events) is a solid one. The racing sequences are executed well. Christian Bale's spirited performance as Ken Miles is the main standout. The friendshipFord v Ferrari is as good of a racing movie as I've ever seen. The story (based on true events) is a solid one. The racing sequences are executed well. Christian Bale's spirited performance as Ken Miles is the main standout. The friendship between Miles and Carroll Shelby (Matt Damon) is fun to watch. My main complaint is about this movie is its title. The story is more about the internal rivalry in Ford (and the build up to 1966 Le Mans) than it is about the rivalry between Ford and Ferrari. Nevertheless, Ford v Ferrari is a must-watch - especially for racing fans.",
            "review_date": "2021-05-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the best racing movies out there. I liked it! Really intense and never boring. Interesting story as well, with sad ending but at least it's part of history.",
            "review_date": "2020-04-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It makes an almost too perfect comparison with the movie’s star car, the Ford GT40. Somewhere between its impersonal factory-made cohorts and its sophisticated and refined rivals is a solid, powerhouse machine built with rugged American driveIt makes an almost too perfect comparison with the movie’s star car, the Ford GT40. Somewhere between its impersonal factory-made cohorts and its sophisticated and refined rivals is a solid, powerhouse machine built with rugged American drive and ingenuity.",
            "review_date": "2020-03-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nWatch out, Ethan Van Der Ryn and Erik Aadhl (with Godzilla KOTM). Paul Massey, Don Sylvester and Paul Giammarco are coming to get that Oscar for Sound Mix (which will be both sad and great for me, given Godzilla had one rounding thumper of a mix, and this one is all about precision, between destroyed brakes or tons of cars slamming one another to start the race in Le Mans)...Y’know? It’s a good thing that we’re now getting Oscar-bait movies that feel like they were made to have fun with it, both story-wise and production-wise (besides Tarantino fare), instead of just being made to put serious effort and care into the story and the production (coff coff, Downton Abbey…). Actually, scratch that. This doesn’t even feel like an Oscar-bait. This is basically James Mangold at his most free for directing purposes. To the point to where they also confirm that Mangold will do about anything to plug the Western aesthetic into his multi-genre movies (we’ll talk about that later). I can say that Ford V Ferrari is fun and I’d finish the review here, but I can’t, because I’m shocked that Fox went there and consumed $100M to transform such a story-changing event (for racing fans) into a big-ass thrill-a-ride packed to the brim with exquisite IMAX-worthy racing scenes and a really sweet and poignant dad/son story in a movie about building cars. Not only that but also delivering us one of the best movie villains I’ve ever seen on screen, Leo Beebe (played by Josh Lucas), the Director of the whole Le Mans project, AKA that one Executive who will try ruining it too because he hates Ken Miles so much.Lucas brings in enough rage and menace to this character, and he makes it to where he also becomes one of the more hateful characters in the picture. The lengths and forces he’ll go to make sure he tells anyone not to let Miles race feel like he's just ranting on him only based off of a funny banter between the two.The main cast is great too, especially Christian Bale as Ken Miles, the cocky idiot who loves going the extra mile who also has quality time with his son. Great stuff that pays off beautifully in the end.It’s a shame I didn’t catch this in IMAX, because, as said, the Racing scenes are thrilling and intense, especially the final race. Cars leaping and crashing left and right, the rage of the motors and constant speed...all accompanied by excellent editing that adds more pedal to the metal (I suppose brakes were harmed during the production of this movie).I’m struggling to write a coherent review for it, but sometimes it’s the case for these types of movies. While not really one with the source material it’s based off, I still had a blast seeing some dudes building cars for 2h32’ (which doesn’t even feel like 2 hours). Ford V Ferrari felt more or less like 9 Year Old me enjoying the crap out of a Happy Meal mix,where,even if they had Hamburgers and McNuggets (that being the Racing scenes and Ford \"going to war\"), there were some other real nice treats,like Mini-Carrots and Fruit Juice (the Father and Son relationship).I can't believe I had this much fun at it, and it'll definitely be one I'll be rooting for at the Oscars.",
            "review_date": "2019-11-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ford v. Ferrari is a retelling of the Ford company's attempts to compete with Ferrari in building racing cars and win the Le Mans race and the designer and driver behind getting the tasks done. This is just a really well put together, wellFord v. Ferrari is a retelling of the Ford company's attempts to compete with Ferrari in building racing cars and win the Le Mans race and the designer and driver behind getting the tasks done. This is just a really well put together, well written movie that looks at the passion for something in contrast with the constraints of the business world.The direction on this is tight. It looks nice and the pacing is pretty smooth for a two-and-a-half hour movie. Director James Mangold (Logan, Walk the Line) really knows how to make scenes visually interesting, throwing in little stuff. Though there isn't really that much racing in this, the race at Le Mans really pays off your expectations.Matt Damon and Christian Bale are the leads in this, the former being the guy who tries to work within the system and the latter being the guy who can't. Matt Damon gives a fine performance, but it's Bale who steals every scene he's in. The famously versatile actor completely sells the character of driver Ken Miles, both brash but charismatic. I'll be very surprised if he doesn't get an Oscar nomination. To be honest, the casting even to the smallest characters is pretty darn good. Props should be given to Tracy Letts as tough, intimidating boss Henry Ford II.The only weak spot I found, and it's more of a knitpick, is that they could've cut down on the scenes of Miles interacting with his family. It's good stuff, but it can be a little repetitive.Overall, I highly recommend this.",
            "review_date": "2019-11-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It was a nice looking movie, the cars were beautiful. Honestly, I found this movie boring.  Everyone played type, if you want to see a really exceptional race car movie check out LeMans from 1966 with James Garner, directed by JohnIt was a nice looking movie, the cars were beautiful. Honestly, I found this movie boring.  Everyone played type, if you want to see a really exceptional race car movie check out LeMans from 1966 with James Garner, directed by John Frankenheimer.  That is probably the only race car movie I would classify as a great movie that I have seen.  Maybe I expected too much from this after James Mangold had just made the fantastic Logan in 2017.",
            "review_date": "2019-12-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "They could have cut an hour out of this movie and not missed a thing, overall it had some funny moments but I could have waited to see this on a streaming service. Nothing about it made me feel like going to the theater was required. I wasThey could have cut an hour out of this movie and not missed a thing, overall it had some funny moments but I could have waited to see this on a streaming service. Nothing about it made me feel like going to the theater was required. I was hoping they would spend more time on how Ford went against Ferrari from an engineering perspective. Comparing it to the recent Rush > Directed by Ron Howard it isn't even close, Rush was awesome this movie is a solid C+.",
            "review_date": "2019-11-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \na great movie, a pure racing movie, is not the typical movie that is based on a rivalry (although the title marks it), is a film where a great friendship and companionship is forged, the career of lemans is in the background of the plot, it is the conception of all  the narrative and that makes this movie special, if you don't like racing don't see it because you're not going to understand it.",
            "review_date": "2019-11-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Such a great biopic. Races and landscapes are awesome. Cast is really perfect",
            "review_date": "2019-11-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nI loved this movie although the ending was a bit disappointing. The ending wasn't bad it just didn't end on a happy note. Ken Miles was such a good character but he gets screwed over by Ford. They make him slow down so the other two Ford race cars can catch up so they can cross the finish line together. And then they say one of the other two drivers won. And after that in a pointless scene Ken Miles crashes while practicing and I think he died. They kind of implied it. So I dont love that ending because it's kind of depressing. But the movie was good overall with good acting, directing and it was well edited.",
            "review_date": "2020-02-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Bless Bale and Damon and Balfe and Ford and Ferrari. So rare when everything, everyone, cries for one lap. One perfect lap.Ford V Ferrari\n\nThe director James Mangold is deservedly and in my case surprisingly in the lead in the Oscar raceBless Bale and Damon and Balfe and Ford and Ferrari. So rare when everything, everyone, cries for one lap. One perfect lap.Ford V FerrariThe director James Mangold is deservedly and in my case surprisingly in the lead in the Oscar race for the Best Direction trophy. And I am including the best of this year's most controlled films. There are many indie films that packs a linear, safer and comforting punch than this at-times-commercial-yet-fully-artsy drama. I have never seen him so confident and empowering on screen. And not to forget his large chunk of the film spends time on the road, in the run, at the face of Bale's snide-y looks that resembles to me with that mysterious Alfred Borden way of scanning out from The Prestige.With a whoosh the film goes by like the Ferrari(!) and speaks mostly, structure wise, a pretty standard tale. Not at all biography but sports alike, the film feels. You are aware of where and how things would go and yet Mangold insists to you to experience these moments with this incredibly rich cast. Those tiny moments where it flowers you with flood of imaginative thoughts and ideas that scares and educates you, is the best asset of the film.The nuanced performance then and then only emerges up, visible to the naked eye, teary eye by then. The helps that Matt Damon provides, the rejoicing moment between a husband and a wife after landing a well paid job and Christian Bale's performance staged, framed, mostly around his face, are the moments where you go through a religious experience of discovering cinema in a nail-biting match about patience. Another thing about Ford V Ferrari that caught me by surprise was how both the lead roles were actually underdog characters. That doesn't happen everywhere. No one dares.",
            "review_date": "2019-11-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ford v Ferrari (AKA Le Mans 66 in some European countries) is a story based on the rivalry between Ford and Ferrari in the 60s. It's a sport biopic of sorts with the characters of Ken Miles played by Christian Bale and Carolle Shelby playedFord v Ferrari (AKA Le Mans 66 in some European countries) is a story based on the rivalry between Ford and Ferrari in the 60s. It's a sport biopic of sorts with the characters of Ken Miles played by Christian Bale and Carolle Shelby played by Matt Damon of course being real individuals. The story of course exaggerates lots of things for the sake of dramatisation even more than other films so it isn't necessary a typical biopic. The film is directed by James Mangold who directed the masterful film \"Logan\" but the film certainly feels drastically different from Logan. Still, I came in with high expectations because James Mangold directed it and plus all the oscar buzz around the film.Firstly, the story is very compelling and engaging for a film about racing cars. The human drama between the Ford executives and the main characters is very natural albeit cliche. However, the director manages to balance out the racing with the human drama naturally so that none become too overwhelming or boring. Despite being titled \"Ford v Ferrari\" the film is more about the clash of Miles and Shelby against the meddling executives. The heart and passion of Miles/Shelby with the cold and calculative business choices of the executives is really the heart and soul of the film with some added bonus of intense racing. There are a lot of poignant and genuinely heart warming touching moments but with some funny moments and that is not normal for these type of films. Secondly, Both Christian Bale and Matt Damon give great performances with strong chemistry between the two that makes the friendship more believable. The supporting cast Jon Berthal, Caitriona Balfe,Tracy Letts give good performances as well and definitely do well in making the world more alive. Special mention to Josh Lucas who I say is the REAL antagonist of this film by somehow being suave but absolutely detestable. Thirdly, the race scenes are incredibly done and intense with great wide shots and none of the shaky camera garbage. The film really excels at creating exciting and thrilling auto action which is in part thanks to excellent score by Marco Beltrami and Buck Sanders. The score captures the electrifying race scenes but also uses score and music from the 60s to elevate the era the film is set in.Likewise, the sound and sound editing in this film are done perfectly as I could feel the engine turning or when the gears change. It's just really good.I do have some issues with this film and the first is the amount of cliches used by this film. The monologue at the beginning being used at the end again, Ken Miles being the typical cliche underdog character from a sports film, the montage with the amount of failures, the main character knowing more than the experts and machines etc. The cliches are done masterfully but it did surprise me a lot about how many cliches were in this film. My other minor issue has got to be the run time which is at 152 minutes. The pacing of this movie is mostly fine but there are certain points in this movie after they build the car where it just kind of drags. These are mostly in the scenes where there are paperwork or meetings where it just feels a bit too long for no reason. Other than some minor nitpicks, the movie is almost near perfect. The film is carried by great performances with thrilling car scenes but some genuinely touching and funny moments. The movie drives you along a road of contrasting emotions that leads you to an exciting finishing line. Give this film a watch.",
            "review_date": "2020-03-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Christian Bale steals the show in this movie. He is exceptional as Ken Miles. Also Matt Damon was on par with Bale's performance as Carroll Shelby. What James Mangold does in this film with the racing sequences is spectacular.This filmChristian Bale steals the show in this movie. He is exceptional as Ken Miles. Also Matt Damon was on par with Bale's performance as Carroll Shelby. What James Mangold does in this film with the racing sequences is spectacular.This film however struggles to truly add all the political matters into the film by giving just one guy to hate.Jon Bernthal character has nothing to really do after we enter in the 2nd act of the film while he was literally the driving point in the 1st act.However, James found a way to deliver these energetic and riveting racing set-pieces which takes this film to another level and add-in Bale and Damon's performance making this film one of the best of the year.Grade: B+",
            "review_date": "2020-01-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Two great lead performances and solid direction make this an extremely entertaining ride. The only issues I had were it being a little overlong and a particularly important plot beat that I felt should’ve hit harder than it did. The raceTwo great lead performances and solid direction make this an extremely entertaining ride. The only issues I had were it being a little overlong and a particularly important plot beat that I felt should’ve hit harder than it did. The race sequences are some of the best I’ve ever seen and the chemistry between Bale and Damon is phenomenal.",
            "review_date": "2020-01-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The dictionary definition of a Hollywood film. But that isn't necessarily a bad thing.",
            "review_date": "2020-03-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I'd have preferred to see Michael Mann's version, but this is an impressive and heartfelt study of friendshipBased on A.J. Baime's Go Like Hell: Ford, Ferrari, and Their Battle for Speed and Glory at Le Mans (2009), written by Jason Keller,I'd have preferred to see Michael Mann's version, but this is an impressive and heartfelt study of friendshipBased on A.J. Baime's Go Like Hell: Ford, Ferrari, and Their Battle for Speed and Glory at Le Mans (2009), written by Jason Keller, Jez Butterworth, and John-Henry Butterworth, and directed by James Mangold, Le Mans '66 (released in North American with the equally generic title of Ford v Ferrari) counts Michael Mann as an executive producer. This is notable, as Mann has been trying to bring an adaptation of Brock Yates's Enzo Ferrari: The Man, the Cars, the Races (1991) to the screen since 1993. Mangold is a fine director, but he's no Mann, and the film could never be accused of breaking any new ground or trying anything original. It is, in essence, a thematically broad and aesthetically anonymous pre-auteur theory audience-pleaser made with the aesthetic sensibilities of modernity. But whilst the individual parts may be unsatisfactorily safe and familiar, the whole is accomplished and enjoyable.The film begins in 1959 as Carroll Shelby (Matt Damon) wins that year's Le Mans, only to be told he has a heart condition and must stop racing. Cut to 1963, and Henry Ford II (a superb Tracy Letts) determines to build a car capable of winning Le Mans, which Ferrari has won in 1958, 1960, 1961, 1962, and 1963. Ford Vice President and General Manager Lee Iacocca (Jon Bernthal) reaches out to Shelby to design a car, but he says they'll need a great driver as well as a well-designed car. So, he reaches out to Ken Miles (Christian Bale), one of the best drivers in the world, renowned for his ability to identify problems in test cars after only one or two laps. However, because of his volatility, few want to work with him. He comes on board, but immediately clashes with Ford Senior Executive Vice President Leo Beebe (Josh Lucas).Le Mans '66 is somewhat similar to Michael Mann's Ali, insofar as it uses the grandiose moments of history to tell an intimate story - Mangold uses the determination to win Le Mans '66 as the background against which to examine issues such as friendship and the clash between gifted individuals for whom success is its own reward and corporations who don't see value in anything unless it's monetarily successful. Indeed, the argument could be made that the film is actually a commentary on the Hollywood studio system, with Shelby and Miles representing independent filmmakers who love the craft and see the medium as an art-form, whilst the Ford executives represent the studio, always more concerned with the bottom dollar than artistic integrity, always getting in the way of the people who, if left alone to work, could produce something spectacular.This thematic focus, however, is not to say the film ignores the intricacies of racing; on the contrary, there's a huge amount of techno-babble concerning vectors, aerodynamics, the mathematics of torque, the torsion of metal, and the ins and outs of physics. Additionally, the aesthetic design of the races is exemplary, albeit familiar, with Mangold, cinematographer Phedon Papamichael, and sound designers David Giammarco and Jay Wilkinson crafting some truly intense moments. For the most part, there are no objective shots (for example, there are no overheads giving us a good vantage of the entire race), and there are very few shots showing us something that Miles is unable to see, which creates the sense of being in the car with him, adding a default level of intensity.In terms of problems, there are only two of any significance. The first concerns just how safe and rudimentary the film is. Aesthetically, although the race scenes are kinetic and exciting, there isn't anything new or inventive in them; thematically, the film doesn't say anything we haven't heard before; and structurally, it walks a very well-worn path – chances are that everything that you think might happen in Le Mans '66 does happen. This is your basic underdog story, and it adheres rigidly to that template. This is seen most clearly in the character of Beebe, the film's token villain (you can't have an underdog story without a token villain). A Swiss army knife character he is a one-size-fits-all bad guy without an iota of nuance or interiority. The second problem concerns Shelby, who's one-dimensional (at best), as we learn absolutely nothing about his personal life. Who is the film's Carroll Shelby, and why should non-racing fans care about him? We never get an answer.Although these issues are significant in isolation, Le Mans '66 is so well made, it rises above the clichéd and overly-familiar nature of many of the individual scenes, resulting in a whole that is much more than the sum of its parts. It doesn't take any risks, nor does it bend any rules, but for all that, I couldn't help but enjoy it. It won't surprise you, it probably won't move you, it certainly won't change your life, but it's a journey well worth taking.",
            "review_date": "2019-12-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "In my opinion it's a perfectly structured story. Mr. Mangold knows how to make a great film. I'm not a motorsport fan but it's impossible to not appreciate the thrill of the race and the way it was portrayed in this film - absolutely amazing.",
            "review_date": "2019-12-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I really enjoyed this movie. I found myself sitting on the edge of my seat for much of this film. The performances were awesome and the storyline was well written. I recommend you watch it.",
            "review_date": "2019-11-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It was okay. Kinda long. Acting was pretty fantastic as you would expect. Definitely worth a watch.",
            "review_date": "2020-01-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Overrated.it's an kind of an enjoyable movie, in the manner a b-movie action flick would be.corny as hell, over the top acting by both main actors.",
            "review_date": "2020-03-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Like a high-performance race car, a well-crafted film hums along with seeming effortlessness, making the seamless integration of all the story’s elements look easy.  In the capable hands of Director James Mangold (“Walk the Line,” “Logan”),Like a high-performance race car, a well-crafted film hums along with seeming effortlessness, making the seamless integration of all the story’s elements look easy.  In the capable hands of Director James Mangold (“Walk the Line,” “Logan”), “Ford v Ferrari” is one of those films.The story, based on true events, centers on Carroll Shelby (Matt Damon), a car designer, showman and entrepreneur, and veteran driver Ken Miles (Christian Bale), a plain-spoken Englishman obsessed with automotive perfection.  After Ford’s unsuccessful effort to purchase the dominant Ferrari race team in 1962, Ford management hired Shelby-American in 1965 with a goal of winning the 24 Hours at Le Mans, the world’s premier automobile endurance race.  After abject failure their first year, the driving team led by Miles won the endurance races at Sebring and the 24 Hours at Daytona in 1966 leading up to the race at Le Mans, the film’s climactic scene.When Damon and Bale are together on the screen, that alone is well worth the price of admission.  However, they are ably supported by a strong cast including Caitriona Balfe (“Outlander” TV series) as Miles’ wife and Tracy Letts (the long-suffering father in “Lady Bird”) as Henry Ford II, whose screams and facial expressions when he experiences his first ride in a race car almost steal the show (regrettably, this scene is apparently apocryphal).  The storyline explores the fine line between persistence and obsession, the role of individualism in a corporate culture and, most of all, the overwhelming power of friendship.With its budget of $97 million, “Ford v Ferrari” strives for faithful re-enactment throughout the film.  Despite a daunting script that calls for shooting several extensive race scenes (the last scene at Le Mans clocks in at 25 minutes) and multiple spectacular crashes, the creative team elected not to use CGI.  They assembled as many cars from the period as possible, then supplemented them with faithful replicas, particularly of the Ford GT40.  One person has estimated that some of the Le Mans scenes had race cars valued at over $200 million on the track at the same time.  Several key elements of the story are rendered equally faithfully.It’s only a minor distraction, but the inevitable conflict between Shelby’s team and the “suits” from Ford seems quite forced.  And from several reports, it’s not entirely accurate.  Similarly, the race results sometimes have been altered to increase dramatic effect (which makes sense, because the outcomes of most endurance races are apparent long before the race concludes).“Ford v Ferrari’ is a throwback film in the best possible sense.  It’s well worth the time of contemporary audiences.  It’s one of the best films of the year.",
            "review_date": "2019-11-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The first act is like a rushed, convoluted mess; the rest of the film is almost Rush-like!Side-note : Christian Bale definitely deserved to be nominated for best leading role just like De Niro.(8/10)",
            "review_date": "2020-02-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This was a lot better than I thought it was going to be although I had some issues that held this film from being really good. The first 30-45 minutes were just uninteresting to me. It was well acted but there was nothing that was keeping meThis was a lot better than I thought it was going to be although I had some issues that held this film from being really good. The first 30-45 minutes were just uninteresting to me. It was well acted but there was nothing that was keeping me interested. Once we get to the point where they are modifying the car, it gets pretty great. Christian Bale and Matt Damon do great jobs but Bale steals the show. Bale is perfectly cast and is fantastic as this angry race car driver. Both Damon and Bale have perfect chemistry and play off well with each other thanks to a pretty good script although not a perfect one. Most of the other actors did a pretty good job also. There is also some good chemistry between Bale and Noah Jupe who plays Bale’s son. They also have some genuinely touching moments together. The only character I didn’t like was Jon Bernthal’s character. I thought he was extremely one dimensional and irritating. I thought the racing sequences in the film were fantastic. They are incredibly well shot and paced. Even though the film is based on true events, I still felt exhilarated and was on the edge of my seat. The Le Mans sequence was one of the best sequences in film that I saw so far this year. The sound mixing is pretty great also. It immerses you within the races which makes those sequences so much better. I felt the last 10 minutes of the film was pointless. I thought the film was gonna end after this desert scene that I won’t spoil but it kept going on. The music was also pretty bland. Even after just seeing the film, I don’t remember any of the music. Some of the other technical aspects that I liked was the cinematography. During the racing scenes, it was great and during the rest of the film, it was pretty good. The film has a couple visual effects scenes that I thought looked pretty good. Overall, Ford v Ferrari is a pretty good film with great racing sequences, great acting, and some good cinematography even if the first 30 minutes and last 10 minutes were generally uninteresting.",
            "review_date": "2019-11-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If Ford v Ferrari feels formulaic that’s because it is, but it works. It has all the elements of a traditional major studio sports movie: based on a true story, A-list movie stars, acclaimed journeyman director, fabulous cinematography, aIf Ford v Ferrari feels formulaic that’s because it is, but it works. It has all the elements of a traditional major studio sports movie: based on a true story, A-list movie stars, acclaimed journeyman director, fabulous cinematography, a motley crew of characters challenging conventions, an underdog angle. A more generous analogy would be Ford v Ferrari takes a reliable recipe and uses the best ingredients and best kitchen brigade to deliver an entrée so well done it is almost easy to dismiss. That is almost what happened with this movie. After coming and going at the box office just before Thanksgiving, it seems the Academy couldn’t dismiss this film entirely and gave it four Oscar nominations, including Best Picture. They were right to not let Ford v Ferrari pass without notice because, though it is working with a familiar recipe, this is an excellently done, engaging entertainment.Like the title directly states, this movie is about rival car companies. Specifically, it is about the nascent Ford racing program in the mid 1960’s taking on the dominant force in international racing, Ferrari. Like a lot of sports movies, you could argue that this movie isn’t so much about the sport but about the characters and their journey. Ford v Ferrari is certainly about car racing but what is most engaging about it is the friendship between its main characters, racer turned car designer Carroll Shelby (Matt Damon) and racer Ken Miles (Christian Bale). After a slump in sales, ambitious Ford executive Lee Iacocca hatches a plan to revitalize the car company's image by entering the world of international auto racing and winning the prestigious marathon race 24 Hours at Le Mans. Ford turns to Shelby to head their racing program. Shelby, turns to the best driver he knows, Miles, who is the right driver for the job but does not fit the Ford company image.At first the accents from the leads are a bit jarring. Damon is using a full Texas drawl and Bale uses a British accent not his own. Accents aside, Damon and Bale settle into the their characters quickly and comfortably. They are A-list stars that give A-list performances with great on-screen chemistry. Damon as the determined no-nonsense Shelby and Bale as the skilled but at times abrasive Miles (he’s described as “not a people person”) are not exactly a mismatched pair; they’re more like yin and yang. Their best scene together is also the funniest in the movie: they fight each other with groceries. Shelby has a canned good in his hand, realizes that it would hurt Miles, so he hits him with a loaf of bread instead. Even when they are trying to hurt each other, they are trying not to hurt each other.The real rivalry isn’t between Ford and Ferrari but with race crew and the Ford executives who don’t understand racing and are only concerned with corporate image, namely Josh Lucas as Leo Beebee. Lucas is great performer but there’s nothing to his character aside from being petty and obstructing Shelby and Miles. I did not care about the Ford motor company winning a race to gain prestige and sell more cars so rich men could be slightly richer. But I did care about Shelby and Miles succeeding. Watching them and their crew work together to solve the problems of building a state-of-the-art race car, with each member using their individual skills and knowledge, is a total delight. Those scenes reminded me of other film about people working together to solve a problem, The Martian, also starring Matt Damon, and also a Best Picture nominee. So, yes, in a film where the title flat out states conflict and rivalry, the best scenes are of people working together.Director James Mangold is not a household name, even among cinephiles, but he turns out solid work more often than not. He uses the same approach with Ford v Ferrari’s racing scenes. There some shots of the cars zooming by the stands but there are also shots behind and in front of the cars on the track, inside the car with the Miles, POV shots of the racers, or shots where the camera has been attached the door of one of the speeding cars. It is all cut together to thrilling results (editor Andrew Buckland received an Oscar nomination for his work). Ford v Ferrari also picked up Oscar nominations in both Sound Mixing and Sound Editing. The sound of the roaring engines, zooming cars, and, yes, explosions, are a major part of the immersive experience of the racing scenes. I have never had any interest in car racing of any kind, but the grueling climatic race at 24 Hours at Le Mans, where drivers race in four-hour shifts day and night no matter the weather conditions, had me completely enthralled. That’s good filmmaking. I can see Ford v Ferrari being dismissed as a “Dad Movie”—the kind of movie an adult child would watch with their dad over the holidays. If that is how you happen to see this picture, you and your dad are in luck.",
            "review_date": "2020-02-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Le Mans ’66 is a real crowd pleaser; interesting, thrilling, exciting, funny and ultimately heartbreaking. Up there with this year’s very best and deserves to be in conversation when award season starts to roll around. Not a film just forLe Mans ’66 is a real crowd pleaser; interesting, thrilling, exciting, funny and ultimately heartbreaking. Up there with this year’s very best and deserves to be in conversation when award season starts to roll around. Not a film just for petrol heads, this works for everyone. A real double header of great acting and exciting action, a real treat.",
            "review_date": "2019-12-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "(Mauro Lanari)An auto action film that knows how to re-enter the orbit of average Hollywoodian cinema with more than a hint of the existential drama. A+ on CinemaScore is exaggerated, but counterbalances the current rarity of this kind of works.",
            "review_date": "2019-11-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's one of those movies that doesn't seem Intrusive. You start feeling yourself among the heroes. You start living in this movie.",
            "review_date": "2019-11-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The movie ends shortly after the big race ends. You'll know when. No need to stick around for the last 20 minutes of the movie.",
            "review_date": "2019-11-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Wow!A great cinamtic experience we can feel in each scene!the performance of both bale and damon is oscar worthy!ending was really great and impactfull!score is real great at sometimes it feels as if we are really living theWow!A great cinamtic experience we can feel in each scene!the performance of both bale and damon is oscar worthy!ending was really great and impactfull!score is real great at sometimes it feels as if we are really living the movie!cinimatography is excellent!athough a must watch!",
            "review_date": "2019-11-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I loved everything about this movie.One of the few recent movies that I felt was worth the trip to a theater. So I saw it 3 separate times- with children, with my wife, and with friends. Every one of them loved it!",
            "review_date": "2020-03-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I really enjoyed this film by the end - its a little slow to build plot wise in the first half but the performances by the two main stars (Matt Damon and Christian Bale) are pretty top notch and by the end its really quite gripping. I foundI really enjoyed this film by the end - its a little slow to build plot wise in the first half but the performances by the two main stars (Matt Damon and Christian Bale) are pretty top notch and by the end its really quite gripping. I found myself wishing (while I was watching it) there was a bit more footage of actual car racing in the first half of the film but I suppose thats me being a bit too lazy and hoping for 24/7 action. To be fair, the film does have some good character development and it is pretty insightful about the corporate story, even though it is a somewhat long film at just over two hours and twenty minutes long. I thought its a pretty solid film by the end - I found it quite immersive and gripping. If your a fan of motor racing or like a good biopic (especially a sports biopic) then this film is well worth seeing, yes.",
            "review_date": "2022-04-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is the Single best film of the entire year! This is what all movies should strive to be.",
            "review_date": "2019-11-30",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 147
}