{
    "title": "Freaks",
    "rating": 7.1,
    "release_date": "2019-09-13",
    "genre": [
        "Sci-Fi",
        "Drama",
        "Mystery",
        "Thriller"
    ],
    "summary": "Kept locked inside the house by her father (Emile Hirsch), 7-year-old Chloe (Lexy Kolker) lives in fear and fascination of the outside world, where Abnormals create a constant threat – or so she believes. When a mysterious stranger (Bruce Dern) offers her a glimpse of what’s really happening outside, Chloe soon finds that while the truthKept locked inside the house by her father (Emile Hirsch), 7-year-old Chloe (Lexy Kolker) lives in fear and fascination of the outside world, where Abnormals create a constant threat – or so she believes. When a mysterious stranger (Bruce Dern) offers her a glimpse of what’s really happening outside, Chloe soon finds that while the truth isn’t so simple, the danger is very real.… Expand",
    "critic_reviews": [
        "Freaks is a mind-bending thriller that is subversive enough to be rebellious, and in this era of CGI superhero cinema, the revolution is welcomed.",
        "In a world packed with information, it’s outright exciting to know so little about where a story is going, or how far it’s willing to go to get there.",
        "Freaks subtly subverts the superhero formula under the guise of a hallucinatory, cautionary tale of paranoia, delusion and extreme parenthood.",
        "The film shrewdly keeps us inside Chloe’s head, filtered through her very limited comprehension of her burgeoning and truly awesome abilities.",
        "Every little detail — straight down to a smiling child holding out a melting ice cream without caring that it’s pooling atop her hand — carries weight. Not a second is wasted.",
        "Although in the early going the convoluted plot sometimes struggles to maintain interest, Stein and Lipovsky have such a clear vision that they keep developments confidently on track until subsequent revelations engage in full-throttle action mode, leading to a climax suggesting they likely have future plans for these characters.",
        "One of the film’s successes is its ability to subvert expectations.",
        "The final act isn’t as interesting as the first two were to me. But Hirsch impresses, as usual, as a man losing his wits and Dern always gives fair value as a canny old coot who knows more than he’s letting on.",
        "Appealing, partly because it’s so unembarrassed by its genre's done-to-death social-injustice themes, this undercooked blend of science fiction and family drama virtually dares you to turn up your nose.",
        "It’s watchable and intriguing stuff, yet also silly and inconsistent.",
        "The only problem is that it’s easier to be impressed by the ingenuity of the staging and the architecture of the screenplay than it is to stay invested in the characters.",
        "Lipovsky and Stein’s first feature as collaborators exudes a grungy, second-hand feel, and the movie doesn’t have the confidence or vision to breathe new life into its narrative clichés. Instead, the pair lean on the sincerity of their storytelling, crafting a paean to broken families and exploring how children process unspeakable loss.",
        "While it may be a little better in concept than in execution, there’s enough energy, imagination and innovation here to satisfy any genre hound suffering fatigue from the endless wash, rinse, repeat cycle of the Marvel Cinematic Universe, et al.",
        "Half-nifty, half-cheesy.",
        "The fatal flaw of Freaks is that Lipovsky and Stein’s tantalizing approach gives way to mundane results, as the questions raised by their screenplay are considerably more interesting than any of the answers that follow.",
        "This is clearly a film that favours concept over narrative expansion, and it suffers for this."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "A slow burn sci-fi mystery that kept us in the grip of suspense until it reveals its secrets one by one. The performances and storytelling are incredible -- and it has much more real emotion than most other movies in this genre.  Let yourselfA slow burn sci-fi mystery that kept us in the grip of suspense until it reveals its secrets one by one. The performances and storytelling are incredible -- and it has much more real emotion than most other movies in this genre.  Let yourself be taken in by these characters and you might even yell for blood, laugh unexpectedly, and shed a tear at the end.",
            "review_date": "2019-09-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "i just saw this movie. there were like maybe 7 people in the whole theatre at the arclight in hollywood. it turned out that we all clapped at the end. it was a very solid sci-fi action-drama. you're uncertain what's going on at the beginning,i just saw this movie. there were like maybe 7 people in the whole theatre at the arclight in hollywood. it turned out that we all clapped at the end. it was a very solid sci-fi action-drama. you're uncertain what's going on at the beginning, but it builds. really enjoyed it.",
            "review_date": "2019-09-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A real slow burner of a movie but one that will reward you if you stick with it. Highly recommended.",
            "review_date": "2020-04-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is my 2019 #1 movie of the year.  I cannot believe it was not a bigger hit.  For the best experience, don't read anything about it just see it, it's the strongest emotional impact I have had since The Sixth Sense.",
            "review_date": "2019-12-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Can't believe I found this gem of a movie by pure chance.If you are tired of weak excuses and plot holes when watching sci-fi movies and shows, you'll totally love how good this movie is.Everything is spot on and I won't give more detailsCan't believe I found this gem of a movie by pure chance.If you are tired of weak excuses and plot holes when watching sci-fi movies and shows, you'll totally love how good this movie is.Everything is spot on and I won't give more details apart than it is a must watch, highly recommended.",
            "review_date": "2020-01-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "When I first heard about this movie, I was afraid it was a remake of the 1932 classic of the same name, one of my all-time favourite movies. Thankfully, it isn’t that at all. This movie is more of an X-Men or Stranger Things or MissWhen I first heard about this movie, I was afraid it was a remake of the 1932 classic of the same name, one of my all-time favourite movies. Thankfully, it isn’t that at all. This movie is more of an X-Men or Stranger Things or Miss Peregrine’s type deal about people with superpowers who are persecuted by normal people who fear them and want to kill them. We’ve seen this kind of thing before, but the way this movie tells its story was actually really interesting. It throws you into this world and slowly gives you information about what’s really going on, like an unfolding mystery. This made for a very engaging and entertaining film. I actually see real franchise potential, there are all sorts of stories that could be told that take place in this world that I would love to see explored, like a low-budget MCU. The performances in this movie are all really good, even the child acting was tolerable! The effects were decent and this movie has a lot of genuinely suspenseful, scary and shocking moments! Definitely check this movie out if you’re a fan of stuff like X-Men and want to see a lower-budget, more mature take on it. It’s very good!",
            "review_date": "2020-01-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This isn't the first movie of this type…most recently Code 8 comes to mind...but it's one of the best. A father (Emile Hirsch) and his 7-year-old daughter (Lexy Kolker) live captive inside their house, hiding from the world. Turns out they'reThis isn't the first movie of this type…most recently Code 8 comes to mind...but it's one of the best. A father (Emile Hirsch) and his 7-year-old daughter (Lexy Kolker) live captive inside their house, hiding from the world. Turns out they're Abnormals, a group of humans with special powers who have become feared by the world. The appearance of a stranger (Bruce Dern) exposes the girl to the truth. Even though the film manages to create some intrigue, the narrative takes a while to take hold. Sometimes it's confusing what's happening, but once the conflict amps up, the story gets really interesting. There are some basic, but well-crafted special effects, but it's primarily the enthralling human story and the somewhat original take on the subject that makes this worth watching.",
            "review_date": "2020-05-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Better than most X-man movies. You would suspect a little from a the beginning and confirm your little speculations yet still get some surprises, very good story. What really freaks people out is how soon the little girl's capable to pick bad tricks.",
            "review_date": "2020-11-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "In the not so distant future, human evolution takes the next step. Certain people start to develop superhero like powers and are referred to as freaks. They are easy to spot, as often times, after using their powers, they bleed from the eyes.In the not so distant future, human evolution takes the next step. Certain people start to develop superhero like powers and are referred to as freaks. They are easy to spot, as often times, after using their powers, they bleed from the eyes. As with anything they don't understand, the government sees these people as a threat and has started to hunt them down. One such family, having recently lost a wife/mother has gone on lock down in a suburban neighborhood, this is their story. After seeing the trailer for this movie I was intrigued, until I realized it was just a rip-off of the X-Men, without the special effects. Basically they promote this thing like it's the next big thing in Science Fiction, when it's just a very old idea that's been done to death. As for the film itself, it takes forever to get going and even longer for you to realize just what the hell is going on. This crazed father is babbling on making no sense and keeping this little girl locked in this house. All she seems to care about is ice cream, more so than the life of her father or her personal safety, the whole thing was just so bizarre. As for the cast, there really wasn't any chemistry, Emile Hirsch was just awful, playing this paranoid babbling idiot. He's paired with Bruce Dern, who is far too old to really do much of anything, and then there's Chole (Lexy Kolker), the little girl stuck in the middle of all it. The bottom line, Freaks is an idea that has been done and done again, with a cast that so vastly different, that really doesn't click on any level. Worst of all it takes so long to get going and explain what's going on. By the time you finally get it, you've really stopped caring. Freaks looked cooled and has a trailer that will suck you in, but ultimately it's a disappointment.",
            "review_date": "2020-04-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Maybe  I didn't see the same movie in Chicago.  I was long, dull, and boring.  There were only about 10 of us in the theater and everybody left when the credits began.Maybe there was a story there, but it wasn't very well told.  I went toMaybe  I didn't see the same movie in Chicago.  I was long, dull, and boring.  There were only about 10 of us in the theater and everybody left when the credits began.Maybe there was a story there, but it wasn't very well told.  I went to see it only because it was about to disappear next week, and I was taken in by the good reviews it got.",
            "review_date": "2019-09-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "(Mauro Lanari)#metoo mutants, recommended for males only if they consider themselves expendable.",
            "review_date": "2020-03-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Excellent casting and very good acting.  Directing child actors is a difficult skill and Adam Stein and Zach Zipovsky did a great job.If you like science fiction, I recommend you watch this film.\n\nI read the professional reviews which wereExcellent casting and very good acting.  Directing child actors is a difficult skill and Adam Stein and Zach Zipovsky did a great job.If you like science fiction, I recommend you watch this film.I read the professional reviews which were quite accurate (in my opinion) which is very rare.  Everyone seemed to be intrigued with the pacing of the plot - regardless if their score was 4 or 10 or something in between.I did not have any idea what this movie was about before I watched it.  I think that made it more enjoyable for me.  The slow unfolding of the plot made it intriguing.",
            "review_date": "2021-12-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "+Great cast+Excellent slow pacing+Great story\n-low visual effects budget\n\nFreaks was a great movie. The pacing was excellent (and mostly due to the low budget!). Its clear that so much heart from the cast and production crew that went into+Great cast+Excellent slow pacing+Great story-low visual effects budgetFreaks was a great movie. The pacing was excellent (and mostly due to the low budget!). Its clear that so much heart from the cast and production crew that went into making this film. In every minute that passes im reminded of what good storytelling looks like in a film. I wasn't sure what to expect going in but I was pleasantly surprised by the quality delivered considering the shoestring budget.",
            "review_date": "2021-10-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This was a compelling chore to watch. It starts out interesting and then lurches through scenes inconsistently, a random mix of slow, perplexing, riveting, simplistic, dull, overwrought, pretentious, and explosive. The concept and writing mayThis was a compelling chore to watch. It starts out interesting and then lurches through scenes inconsistently, a random mix of slow, perplexing, riveting, simplistic, dull, overwrought, pretentious, and explosive. The concept and writing may have been better than the final presentation, and since the actors were mostly good, I'll have to pin my eye rolling on the director. This really should have been better, but unfortunately it probably took the perspective of the child to an overly-technical degree, and it comes off as childish when it should have been intriguing. I suppose audiences these days aren't given much meat to chew on anymore and so can overlook a lot of cheesy fluff. I need something with a little more intelligence and depth, so I'm not caring to look forward to any apparent sequel.",
            "review_date": "2022-02-26",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 30
}