{
  "title": "Knives Out",
  "rating": 7.7,
  "release_date": "2019-11-27",
  "summary": "When renowned crime novelist Harlan Thrombey (Christopher Plummer) is found dead at his estate just after his 85th birthday, the inquisitive and debonair Detective Benoit Blanc (Daniel Craig) is mysteriously enlisted to investigate. From Harlan’s dysfunctional family to his devoted staff, Blanc sifts through a web of red herrings andWhen renowned crime novelist Harlan Thrombey (Christopher Plummer) is found dead at his estate just after his 85th birthday, the inquisitive and debonair Detective Benoit Blanc (Daniel Craig) is mysteriously enlisted to investigate. From Harlan’s dysfunctional family to his devoted staff, Blanc sifts through a web of red herrings and self-serving lies to uncover the truth behind Harlan’s untimely death.… Expand",
  "critic_reviews": [
    "An entertainment that’s as smart, witty, stylish and exhilarating as any movie lover could wish for. It’s tempting to call it the sort of movie they don’t make any more, but they didn’t make all that many way back when, because it’s really hard to pull off a production of such startling quality. If there’s a false note from start to finish I must have been laughing or gasping when it sounded.",
    "This is a movie in which expertise and good sense win the day; no one is rewarded for stupidity or cruelty. And in that sense, Knives Out isn’t just a beautifully made diversion. It’s also a utopian vision.",
    "One of the consistent pleasures of Knives Out is that, while its style evokes an earlier era, the script is very much a witty response to today’s world.",
    "Pound for pound, actor for actor, laugh for laugh, Knives Out may be the most entertaining movie of the year.",
    "Beyond its waspish wit, a dastardly roll-call of suspects and Daniel Craig’s dapper efforts as our presiding sleuth, the film gives nothing away until the bitter end, thanks to a head-spinning tricksiness of plotting that even Agatha Christie might have conceded was rather ingenious.",
    "The genre maestro has his audience in good hands, “good” in this instance meaning both “skilled, capable, expert” and “decent, ethically sound.” He’s assembled a dazzling contraption that, if twisted in just the right way, pops open to reveal a nugget of wisdom crystallized by the cathartic final shot: we only really own what we earn.",
    "Knives Out is a charming and wonderfully crafted whodunnit that, despite the inevitable presence of a dead body, plays like a warm and cozy antidote to the winter chills.",
    "Far from empty sleight-of-hand, Knives Out twists its borrowed, rearranged mechanics into a timely, sincere, and ultimately moving celebration of decency in the face of moral failure. To paraphrase one of Blanc’s funnier musings, that’s the donut within the donut hole.",
    "A crackling, devious, and hugely satisfying old-school whodunnit with a modern twist ... Even if you do somehow manage to piece the whole thing together in advance, there’s no way of predicting the joy of watching it all unfold.",
    "The art of a cinematic murder mystery is to make the act of putting clues together seem suspenseful and worth watching. In the hands of Craig at his most gleeful, de Armas at her career best, and Johnson oozing love for the genre, Knives Out rises splendidly to the task.",
    "Of course blackmail, shady business dealings and overdoses abound in Johnson's crafty tale. He masterfully maneuvers today's political maelstrom with ease and makes these would-be caricatures into people who could very well be sitting next to you for a Thanksgiving feast.",
    "Sumptuous and diverting.",
    "This is, to be sure, a riotously funny movie — a priceless collection of puns, insults, one-liners and some of the best-timed barf gags this side of “Problem Child 2” — but it also treats the classical detective story with the seriousness and grandeur it deserves.",
    "A delicious throwback to the all-star whodunit, this juicy comedy thriller is a treat from start to finish.",
    "The whodunit turns out not only to still have a few moves left but to be downright acrobatic.",
    "The moral burden of wealth weighs heavily on Knives Out, a dexterously cunning, immensely entertaining whodunit that has more than catching the killer on its mind.",
    "Wickedly hilarious.",
    "It’s all delightful to watch.",
    "In this season of Big, Serious Movies, what a treat to find this wonderfully silly, perfectly paced hall of mirrors hanging out at the multiplexes. It’s as if Agatha Christie came back for a visit, after getting caught up on pop culture in the beyond.",
    "It’s exceptional escapist entertainment for those who don’t mind a little spice sprinkled into their cozy mystery.",
    "Even with some padding, it’s a whodunit canny enough to take the human stakes inside the artifice seriously. And that allows a fine ensemble of side-eye champs the leeway to make Knives Out funny, too.",
    "What follows is a dizzy, politically astute murder-mystery comedy that, while not reinventing the genre, certainly hits all the expected beats with flair.",
    "There is something undeniably exciting about seeing a polished piece of studio-ish entertainment like this be cognizant of the world it exists in.",
    "Rian Johnson’s Knives Out is one of the most purely entertaining films in years. It is the work of a cinematic magician, one who keeps you so focused on what the left hand is doing that you miss the right. And, in this case, it’s not just a wildly fun mystery to unravel but a scathing bit of social commentary about where America is in 2019.",
    "It lacks Hitchcockian tension or Christie-level dignity, but it’s funny, surprising, and intriguing in the way it flips the usual murder-mystery script.",
    "The central plot is a devious one that pulls the rug out from under the audience on multiple occasions; no mean feat in a genre where every variation and outcome would seem to have been tried and tested. But what really sets Knives Out apart from the competition is its humor.",
    "Even if Knives Out loses a micro-dose of its claustrophobia and tension in the second act, it’s in the name of undoing what we’ve come to expect of past whodunnit stories. It’s all part of what makes the film such an effective, entertaining, and contemporary spin on what’s no longer a worn-out genre.",
    "Rather than have the plot manipulate his characters, Johnson lets them manipulate it. That’s an extremely rare Hollywood feat.",
    "A silly, stabby, supremely clever whodunnit that only really suffers from having too little room for each of its talented players to fully register in the film’s limited run time.",
    "Built upon a wittily verbose script that delivers more laugh-out-loud lines than most of the year’s alleged comedies, Knives Out retains a beating human heart into which daggers are regularly plunged.",
    "Rian Johnson put his own spin on Dashiell Hammett with 2005’s Brick. Now he’s Johnsonised the work of Agatha Christie, with equally enjoyable results. Knives Out is snappy, meta and, yes, sharp.",
    "What a kick to watch whip-smart director Rian Johnson shake the cobwebs off the whodunit genre and make it snap to stylish, wickedly entertaining life for a new generation. That’s what happens in Knives Out, a mystery that takes the piss out of Agatha Christie clichés.",
    "Knives Out is a sendup of twisty murder mysteries with all-star ensemble casts that also loves and respects that silly tradition.",
    "For 130 minutes, the writer-director disorients and delights, confidently trailblazing through his murder mystery two, maybe even three steps ahead of the audience. This isn’t a simple, direct testament to the slick, sidesplitting script, nor the fully committed, second-to-none ensemble, but rather a passed inspection of these cogs and their ability to form a purely entertaining experience.",
    "It’s the most finely tuned version of a murder mystery you could hope for, with joyous performances and style in spades.",
    "Daniel Craig is on fine form leading a killer cast in Rian Johnson’s boisterously enjoyable murder mystery. All the evidence points to a winner.",
    "Knives Out recalls a time when audiences could still be surprised by such mysteries, before the genre devolved into a corny parody of itself. Johnson keeps us guessing, which is good, but the thing that makes this a better mousetrap than most isn’t the complexity, but the fact he’s managed to rig it without the usual cheese.",
    "A contemporary whodunnit that both respects and revises the subgenre. ... It’s such a rare pleasure to see a director so in love with a genre without slipping into Tarantinoesque fanboy indulgence, remembering his audience is bigger than himself and also that his film requires both head and heart.",
    "The movie’s wit and energy hold your interest, but they don’t spark the pleasure of the unexpected, the thrill you felt in \"Laura,\" \"The Last of Sheila,\" \"Chinatown,\" \"The Sixth Sense,\" or the 1974 adaptation of Christie’s \"Murder on the Orient Express\" (not Kenneth Branagh’s inept remake), movies whose big reveals surprise you in their elegant simplicity.",
    "This is one of those movies where it looks like the immensely appealing cast had as much fun making the film as we have watching it — especially because so many of these familiar faces are playing against type.",
    "The fun in Knives Out is watching an ensemble of super-serious actors getting to misbehave.",
    "The fun here — and there is a lot of it — is to be had simply in allowing an ensemble of game, generous-spirited actors to give their all in service to the fine art of misdirection and mayhem.",
    "Intentional or not, this alleged thriller is more of a comedy, and maybe I’m just jaded, but to me, there isn’t a genuine thrill in sight.",
    "A proper whodunit, as twist-turny as you might expect, and as amusingly edgy and cutting as its title suggests.",
    "The actors’ hammy performances only compound the amusement of watching a dynasty propped up by largesse fall to pieces at the very thought of actually having to earn their way in life.",
    "This thriller can sometimes be too mechanical — a breezy exercise if not always an emotionally satisfying one — and yet the large cast’s willingness to get on Johnson’s brainy, sprightly wavelength makes this an enjoyable romp.",
    "Writer-director Rian Johnson assembles the makings of a great whodunnit for Knives Out and winds up making a good one. It’s a perfectly entertaining film, but its attributes and apparent ambitions make the results just a bit disappointing.",
    "What we have is a straightforward murder mystery, but it is told with gusto and humour.",
    "Murder, skulduggery and an avalanche of plotting makes Rian Johnson's latest a retro pleasure for those who enjoy being dizzied.",
    "It’s an impressive movie in many ways, dizzyingly complex and intensely brainy, but if you don’t buy into the complex plot and its many (MANY) twists, they tend to be more tiresome than exhilarating. It’s a loving, labyrinthine homage to a genre I’m not sure deserves it.",
    "A production designed to within an inch of its life, Knives Out always seems on the brink of being cleverer than it is, never quite shaking off its cobwebs and entering the present tense.",
    "Johnson’s own sleight of hand is estimable, even if his effort to add politics into the crowded mix rings hollow. The machine is what matters here, and he has clearly had such a good time engineering it that it’s hard not to feel bad when you don’t laugh along with him."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nEither I have been going to the movies far too long (80 years) or I have become jaded--maybe a combination of both!I've seen at least a dozen different films in this genre with one of my favorites being \"Murder On The Orient Express\" with Ingrid Bergman and Lauren Bacall . It was an Agatha Christie movie made with a group of stars revolving around who committed a murder. In this case the screenplay and direction is by Rian Johnson which brings in some current hot topics like immigrants with references to Lin-Manuel Miranda  and a snippet of a song by Steven Sondheim among other things.The story is basically about patriarch Harlan Thrombey, played by  Christopher Plummer, has become a multimillionaire by writing novels. We meet him at his 85th birthday on the night before he  accidentally killed himself or was accidentally killed by  his Latina immigrant nurse Marta, whose mother is here illegally. She is played by Ana de Armas who, as Marta, is filled with kindness and always throws up when she tells a lie.In the cast are Daniel Craig who appears as  private detective Blanc, hired secretly, and uses a horrible southern accent without reason, Jamie Lee Curtis as Harlan's daughter Linda, married to Don Johnson and they are the parents of 'Ransom' played by Chris Evans. Curtis gives the best performance in the movie,Michael Shannon as Walt is Harlan's youngest son, is married to Riki Lindhome, playing Donna, and they have a child, Jacob, played by Jaeden Martell, who is sort of an 'odd' bird. Toni Collette is Harlan's daughter-in-law who was married to his deceased son and Harlan's granddaughter  Megan, played by Katherine Langford. The latter's character was completely unnecessary to the movie and whose major scene could have been cut without an effect one way or the other except cutting the film down to a 2 hour running time.Lakeith Stanfield and Noah Segan are detectives involved in the mystery who seem to allow Craig's detective take charge though it really doesn't make sense that they do.Three other characters are played by Edi Patterson as Fran, Harlan's housekeeper and K Callan as Wanetta, Harlan's mother---remember Harlan is 85!---and Frank Oz as Harlan's lawyer.The only interesting aspect to me was the Gothic house which has layers of hidden doors, windows and rooms and when you see all the things in the house you will feel sorry for the poor housekeeper!\"Knives Out\" was a disappointment to me but in the film's defense most critics seemed to love it!",
      "review_date": "2019-11-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The twist \"trope\" is abused to the point it becomes predictable and tiresome. I should have waited it for it to come to a stream service.",
      "review_date": "2019-11-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Mostly boring. Will be completely forgettable. Save your money. Don't bother.",
      "review_date": "2019-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was a poorly written/executed movie.  You see the culprit from 500 miles away (no surprises).  The cinematography & acting were fine...honestly they had a lot of talent but not a lot to work with story-wise.  Skip this one...",
      "review_date": "2019-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I won’t spoil anything for those interested, but what a dumpster fire. Terrible writing and direction, and I mean awful. Paper thin characters who you despise. The only bright point of the entire film is Ana de Armas, but everyone else is inI won’t spoil anything for those interested, but what a dumpster fire. Terrible writing and direction, and I mean awful. Paper thin characters who you despise. The only bright point of the entire film is Ana de Armas, but everyone else is in forgettable at best. Really just an atrocious film and maybe the worst directed I’ve ever seen.",
      "review_date": "2019-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Every time I thought this movie was maybe going to get a Lil better, it just got a little worse. It did that until the end. I didn't even care who dun it by then. Whoever directed this isn't qualified to run the food table lead alone any more movies.",
      "review_date": "2019-11-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Good actors unfortunately in the wrong hands. Rian Johnson, the writer and director should better sell advertisements than make movies.",
      "review_date": "2019-11-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Zero surprises in this 'who dun it'. The actors did their best with what they had to work with, but the script, story and direction was very amateurish. I don't know who the director was, but I would not be surprised if this was his/her firstZero surprises in this 'who dun it'. The actors did their best with what they had to work with, but the script, story and direction was very amateurish. I don't know who the director was, but I would not be surprised if this was his/her first movie, like ever. He/she should not be allowed to make more movies and let the adults handle things in the future.",
      "review_date": "2019-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What’s been part of the fun of following Rian Johnson’s career over the last 15 years is seeing just which genre Johnson will choose to tackle next. Ever since his debut, Rian Johnson has proven himself as a scholar of genre filmmaking;What’s been part of the fun of following Rian Johnson’s career over the last 15 years is seeing just which genre Johnson will choose to tackle next. Ever since his debut, Rian Johnson has proven himself as a scholar of genre filmmaking; showing not only a keen knowledge of the rules each genre but how to update them. Sometimes this was trading the seedy nightclubs and political offices of 40’s noir for the lunchroom tables of different social cliques as in ‘Brick’ or updating the social politics of a galaxy far far away in ‘Star Wars: The Last Jedi’. Rian Johnson has always found a way to tell new stories in the medium of something old-fashioned. Knives Out, his latest, repeats this trick to perhaps its greatest effect yet.Knives Out is in a lot of ways a classic whodunnit, it follows an eccentric detective, Benoit Blanc (Daniel Craig, reprising his Southern drawl from ‘Logan Lucky’) as he investigates the death of a wealthy crime fiction novelist, Harlan Thrombley (Christopher Plummer), and questions the family of suspects who could have murdered him. Rian Johnson’s film pays homage to the work of Agatha Christie with every staple that Christie purists could hope for, - the larger-than-life cast of suspects, the old ornate Victorian home, the big reveal scene where our brilliant detective puts everything together - and yet Knives Out feels completely fresh.What Knives Out does is update the whodunnit genre to make is distinctly American and show what our society looks like in a post-Trump world. Rian Johnson’s film in a lot of ways is not too different from Jordan Peele’s ‘Get Out’, as a genre film that’s a trojan horse, in this case to talk about class and privilege in America. Similar to Peele’s film, Knives Out also shows a boldness in calling out the hypocrisies and ignorance of those on both sides of the political aisle. As we meet character after character in the Thrombley family, each is eager to proudly claim full credit for their own personal success while comically defensive of how they obtained it. Meanwhile the film juxtaposes this with the character of Marta, (Ana de Armas) Harlan’s caretaker, a young hard-working Latina woman who perhaps was the only one who truly cared about Harlan. Throughout the film, the Thrombleys continue to tell Blanc how Marta is just like family to them while we see her constantly condescended and ignored. A very sharp reoccurring joke even features each Thrombley with a completely different answer (Ecuador, Uruguay, Brazil) for where they think Marta’s family immigrated from. The way these distinctions Rian Johnson creates in class and privilege only deepen as the central mystery reveals itself creates a keenly observed snapshot of our contemporary culture. In some ways, this may actually be Johnson’s greatest homage to Agatha Christie, as she too, was an author who used her work to also critique the society of her era.Knives Out has a distinct sense of tone unique for the genre. While the whodunnit has seen several serious adaptation like ‘Murder on the Orient Express’ and ‘Death on the Nile’, and camp parodies like ‘Clue, and ‘Murder by Death’ - Johnson’s film falls somewhere right between. Knives Out is a film that takes its mystery and air of suspense seriously, but has fun undercutting it by finding the comedy in it’s heightened characters and ridiculous circumstances. In a lot of ways it’s a similar approach to genre that his contemporary Edgar Wright (who even gets a small shout out) has taken in the past with films like ‘Shaun of the Dead’ and ‘Hot Fuzz. These are films with a deep regard toward their genre and influences looking to create something in their tradition while finding a new comedic take on it.It feels somewhat perfect that Knives Out would be released on Thanksgiving, the film echoes the very conversations many Americans are having with their families around dinner tables this week but manages to illustrate them in the most entertaining way possible. It’s no hyperbole to say that this film is one of the most fun experiences I’ve had at the cinema in recent years. Rian Johnson’s latest is a genre exercise that is thrilling, hilarious, and has more than a few things to say. Knives Out is not just the perfect entertainment for your holiday weekend, it’s one of the best films of the year.",
      "review_date": "2019-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is basically one long SJW virtue-signaling propaganda piece.  If you're a Democrat, you'll probably love this.",
      "review_date": "2019-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Anything Rian Johnson does is not worth your time. Skip this movie and save your money for the new Star Wars.",
      "review_date": "2019-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is an overly complicated ode to a board game that already had a movie made about it (hint: it's called Clue). It's as if the director and the actors expect you to be impressed by the script's complexity and its cast's star power so thatThis is an overly complicated ode to a board game that already had a movie made about it (hint: it's called Clue). It's as if the director and the actors expect you to be impressed by the script's complexity and its cast's star power so that you won't realize that this movie's satisfaction is akin to untangling a string of Christmas lights. Worst of all, it tries to deliver a moral along the lines of \"good things happen to good people and then they become rich.\"",
      "review_date": "2021-07-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \ndisappointing, overused tropes and the acting was sub-per imo. but ana is very pretty i liked her character and her wholesome relationship with the old man who died. unfortunate for that guy he died when he didn't have to.",
      "review_date": "2022-03-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Tension in this movie dissipates 2/3 of the way through. Daniel Craig's accent is incongruous.",
      "review_date": "2022-04-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Poorly written and directed... Even good acting and good cinematography will not save this movie. It's just boring and unsatisfying... And the ending is just overkill. There's not much to say, just a bad movie.",
      "review_date": "2020-01-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nMovie had so much potential with the story, the cast and everything but just failed to live up to the hype. Too long, predictable and boring especially after Harlan dies. A 3.5 for me but has to give it a 3 if i can only choose from these 2 options.",
      "review_date": "2022-07-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The cast did a fine job, Johnson did a good job directing and writing the film. The first act is a nice build-up. It's a fine introduction to the characters and really helps set the tone this film tries to set (almost a Wes Anderson styleThe cast did a fine job, Johnson did a good job directing and writing the film. The first act is a nice build-up. It's a fine introduction to the characters and really helps set the tone this film tries to set (almost a Wes Anderson style murder mystery but with a different kind of charm). The second act kind of hits a wall though but it recovers nicely in the ending.It was a good movie capable of being a great one but it just didn't quite get there for me.",
      "review_date": "2020-02-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Well. It's good movie, no doubt. very nice shots, well acted and nice work overall, but some writing was kind of lousy, few characters weren't even a real characters. Half way in you know whole story, and so does detective. So you areWell. It's good movie, no doubt. very nice shots, well acted and nice work overall, but some writing was kind of lousy, few characters weren't even a real characters. Half way in you know whole story, and so does detective. So you are watching a slow car crash because you know the \"murderer\" already.",
      "review_date": "2019-12-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Thoroughly enjoyed Knives Out from beginning to end. It is such a rare treat for every plot-point to have a pay off. Flawless scriptwriting from Rian Johnson. A must see.",
      "review_date": "2020-01-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Even if you are someone that thinks Rian Johnson is the Antichrist to anything related to Star Wars, you shouldn't let that keep you from checking out his latest whodunit, Knives Out, because it is really good. It has excellent acting fromEven if you are someone that thinks Rian Johnson is the Antichrist to anything related to Star Wars, you shouldn't let that keep you from checking out his latest whodunit, Knives Out, because it is really good. It has excellent acting from everyone, but the two biggest standouts, to me, were Ana de Armes and Chris Evans. Armes' performance was so real and fresh that there is an argument to be made that wasn't acting, and that was actually her as a person; and, you can tell Chris Evans had a lot of fun playing Ransom, and steering away from being Captain America (who he was phenomenal as) and getting to play a sarcastic douchebag. And, unlike a lot of recent whodunits, this movie actually had some very well-executed surprises (no spoilers). And, above all, this movie was hilarious, especially towards the end. Rian Johnson did a fantastic job on this movie. Don't let your hate for The Last Jedi get in the way of checking this movie out.",
      "review_date": "2020-03-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Interesting who-done-it with many plot twists and surprises. It is a movie that will be watched more than once with enjoyment.",
      "review_date": "2020-03-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Excellent mystery, expertly told, paced and visually beautiful. A proper old school whodunit.",
      "review_date": "2020-02-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A lot of fun.  Daniel Craig is chewing the scenery, but the accent - oh, the accent, is glorious.  The house is its own character and plays a large part in the story.  Confusing near the end when the detective lays out the entire case becauseA lot of fun.  Daniel Craig is chewing the scenery, but the accent - oh, the accent, is glorious.  The house is its own character and plays a large part in the story.  Confusing near the end when the detective lays out the entire case because it just moves so fast it loses the audience a bit, but will watch again when it comes to streaming services (with the subtitles on).",
      "review_date": "2019-12-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nAs a murder-mystery, it doesn't come anywhere close to an Agatha Christie, or any of the other interesting whodunnits, there is one scene where one of the characters is watching Angela Lansbury in Murder, She Wrote on a TV and it just made me really cringe, there are other self-serving references where the writer/director shoves in political statements and other trite references, Rian Johnson is quite obviously his own biggest fan.There isn't much suspense at all, the movie plays out pretty much exactly as you think it will, it becomes obvious from early on who-dunnit and the characters are all caricatures, none give a nuanced and interesting performance. Daniel Craig fails at an American drawl accent and this is a distraction throughout the whole movie. They should have cast an American or a decent voice actor, or had him have an English accent. Ana de Armas has a large amount of screen time and does well playing the part, as the central figure she carries the film and its straightforward plot. Her central plot contrivance, that she is sick every time she lies, isn't used in an interesting way, it merely provides a convenience for the \"detectives\" who do almost zero actual detective work after the initial interviews at the very start of the film that establish characters and motives. All of this is wasted as the cast never become plausible suspects, there are only ever two suspects and one becomes obvious in the second act. There is none of the subtlety or misdirection of the classic murder mysteries.There are so many illogical plot holes and unnatural events that the film falls apart as a crime thriller, characters walk over, throw away, and destroy evidence in full view of the police, who say or do absolutely nothing about it. There are other inconsistencies, the hugest of which is the central overdose plot and a cover-up that wouldn't work as a cover-up after a post-mortem. Its watchable and entertaining enough to pass a couple of hours, but I wouldn't ever watch it a second time or rate it as a good murder mystery, as there is precious little mystery.",
      "review_date": "2020-04-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Knives Out is a typical representative of the adaptation of a chamber detective in the spirit of Agatha Christie. The plot is simple, but it is interesting to follow, the cast also did not disappoint. I can 't say this is the best scenario ofKnives Out is a typical representative of the adaptation of a chamber detective in the spirit of Agatha Christie. The plot is simple, but it is interesting to follow, the cast also did not disappoint. I can 't say this is the best scenario of 2019, but the plot can surprise. The only thing that disappointed that at the end the viewer explained everything on fingers holding on to an idiot.",
      "review_date": "2020-03-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "TL;DR - Looper is on my top 10 list of personal favourite Sci-Fi flims, even though The Last Jedi wavered my trust in Rian as a good director, but I hold no doubt in my mind after this. Knives Out is a refreshing look into the oldest and bestTL;DR - Looper is on my top 10 list of personal favourite Sci-Fi flims, even though The Last Jedi wavered my trust in Rian as a good director, but I hold no doubt in my mind after this. Knives Out is a refreshing look into the oldest and best \"Whodunit\" Genre.The film is very amusing with quirky story beats, it pulls a quirkiness and style in it's Story flow without compromising on the mystery.Zod from Man of Steel vs Captain America vs James Bond was a bout of wits and words I never knew I wanted to see and yet the performances from Craig, Evans and Shannon are the best from the bunch. I love that Jamie Lee is still going strong with her performance a standout in itself. The supporting Cast was good enough even if they were just a back drop to the whole story.Good fun watch.",
      "review_date": "2020-06-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Knives Out is a well directed movie that falls short of being a masterpiece because it thinks it is more clever than it is. This modern take on the class whodunit genre is refreshing and risky. By playing with a well established format,Knives Out is a well directed movie that falls short of being a masterpiece because it thinks it is more clever than it is. This modern take on the class whodunit genre is refreshing and risky. By playing with a well established format, Johnson is able to create a film that kept me interested and entertained throughout. That is not to say that this a film for everyone. Members of the party I saw this film with found it to be inferior to past works in the genre.Where the film falls short for me is, as mentioned above, this movie thinks that it is very clever when in reality, it is not nearly as clever as it thinks it is. The twists are a bit predictable and that made for an underwhelming third act. Johnson's directing is for the most part great, but at times it feels like the film is giving the audience too many clues as to what is going on exactly.The biggest strength of this movie is its acting. Its ensemble cast makes for several great performances. Craig's and de Armas' in particular stand out to me. Johnson's script is serious when it needs to be while at the same time having comical elements that do not feel out of place. Having been disappointed by the way humor was implemented into Johnson's last film, The Last Jedi, I was very pleased to see a far more effective use of it in this film.Overall, I found Knives Out to be a very entertaining mystery film that was not afraid to play with the format of the class whodunit. The twists are a bit too obvious and the movie is not nearly as clever as it seems to think it is, but both of those factors did little to true damper by enjoyment of this film. While certain moviegoers may have problems with the writing or directing of this film, I would recommend it on the strength of the acting alone.",
      "review_date": "2020-01-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I went in with two high expectations but it just wasn't that good. But the thing that really annoyed me was the entire film the writer/director was trying to make a point but at the end he disproves his own point with who end up with all theI went in with two high expectations but it just wasn't that good. But the thing that really annoyed me was the entire film the writer/director was trying to make a point but at the end he disproves his own point with who end up with all the money. It showed the film was really about disliking a certain kind of people and liking another kind of people due to very superficial reasons.",
      "review_date": "2020-02-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is very over hyped, please please save your money, go see 1917 or the gentlemen, like i shouldve, wait for streaming or rent it if u must. I will say daniel craig was very good in this, but otherwise it was average.",
      "review_date": "2020-01-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A movie that mistakes being self-referential for cleverness, and a retreading of political caricatures as commentary. For a movie that pretends to be about moral ambiguity, the characters are decidedly put in the “good guy” or “bad guy”A movie that mistakes being self-referential for cleverness, and a retreading of political caricatures as commentary. For a movie that pretends to be about moral ambiguity, the characters are decidedly put in the “good guy” or “bad guy” baskets. By the time Daniel Craig’s character reveals his final deduction, which was the one time in the movie I had fun, it’s just not enough to justify the eye-rolling meandering up to that point. It does look pretty though.",
      "review_date": "2020-08-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nSeeing Rian Johnson as the director made me think twice about investing 2 hours of my life watching this- would he actually craft an interesting, entertaining movie, with an real twist and get the most of his actors? Or will he use it another vehicle for his left SJW politics?Lets seePrivileged, immoral, spoilt white family bickering over a large inheritance?  Check.Virtuous deserving poor servant of illegal immigrant single mother?  Check.Right wing supporter depicted as immature online troll man-child masturbating in toilet?  Check.Predictable surprises and zero twist?  CheckUninteresting characters except for the guy that gets it?  CheckTerrible big name actor in lead role?  Check.Ryan Johnson never change.The three is for the interior of the mansion.",
      "review_date": "2020-12-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great actors, interesting ideas & visual nuances but somehow the character shots, dialogue and pacing left me just as emotionally indifferent as the Last Jedi.  It's puzzling.",
      "review_date": "2021-03-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Yeah this was pretty ok to watch.Some of the scenes stretched out for too long but overall the acting was super(i mean from the entire cast can you expect anything less?)the mystery was alright and the comedy was ok.",
      "review_date": "2019-12-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very entertaining movie. Was expecting a quirkier movie based on the trailer, but it the characters and plot were much more .. normal. Some funny moments in the movie and the story is told with great flair. The characters are all interestingVery entertaining movie. Was expecting a quirkier movie based on the trailer, but it the characters and plot were much more .. normal. Some funny moments in the movie and the story is told with great flair. The characters are all interesting and well played, and all in all I thought it was just a good flick. Not sure why Daniel Craig had to muster a southern accent, his own would have been just as good, but that's just nitpicking. I would recommend for anyone wanting to go see a old-fashioned kind of 'who done it'. Good movie, well made.",
      "review_date": "2019-12-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I couldn't help but feel a little disappointed that more wasn't done with this terrific cast. The movie does deliver on what it promises.  It IS a murder mystery with a comedic slant.  The problem is that it doesn't doing any one part of itI couldn't help but feel a little disappointed that more wasn't done with this terrific cast. The movie does deliver on what it promises.  It IS a murder mystery with a comedic slant.  The problem is that it doesn't doing any one part of it particularly well.  It really isn't very funny and it really isn't that great a murder mystery.  There are several red herrings designed to mislead the audience but we have seen so much of that in the past that it isn't very effective.  You would not need to be an amazing detective to figure out the culprit by the midpoint of the movie.  Jamie Lee Curtis can be hilariously funny when given the right material and here she and others are criminally under used.  Much time is wasted on Ana De Armas who plays the nurse Marta.  The camera lingers on her face for far too long and far to often.  Combine that with Daniel Craig's painfully slow southern drawl, (which he does NOT nail) and I was often wishing the camera would follow what the more interesting characters were doing.And of course, being Hollywood, they can't help themselves from bashing Trump, Trump voters, and conservatives in general.  The couple in front of us walked out of the theater when things got particularly political about immigration and putting children in cages.To sum up, very few laugh out loud moments, very little real suspense, some annoying accents and politics, a lot of wasted potential and the result is a movie that will only be remembered for being forgettable.  Wait for it to show up on Netflix or something.  Not worth theater dollars.",
      "review_date": "2019-11-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Well filmed, well acted, funny, engaging, overall one of the best movies of 2019 and the bestmystery murder movie in decades.",
      "review_date": "2020-01-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My favourite detective movie of all time. A fantastic movie experience. The all star cast plus the superb screenplay and dialogues had me hooked from the beginning. Eagerly waiting for the sequel.",
      "review_date": "2020-06-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Once again, Rian Johnson proves himself to be a great director (particularly with visuals) but an absolutely awful writer who’s obsession with exploring social/political themes always comes at the cost of turning almost every plot point andOnce again, Rian Johnson proves himself to be a great director (particularly with visuals) but an absolutely awful writer who’s obsession with exploring social/political themes always comes at the cost of turning almost every plot point and character ark into MacGuffins. For the record, I actually agree with his politics so please don’t @ me. But good stories make for intelligent social commentary, not the other way around.The cast are brilliant though so that’s something!",
      "review_date": "2019-11-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Despite a number of fine supporting performances (especially Jamie Lee Curtis and Toni Collette) and excellent production values, this overlong, overwritten whodunnit grows tiresome as it goes along, especially in its extended concluding bigDespite a number of fine supporting performances (especially Jamie Lee Curtis and Toni Collette) and excellent production values, this overlong, overwritten whodunnit grows tiresome as it goes along, especially in its extended concluding big reveal sequence (at which point you might not really care what the answer is). As a film that seeks to be both funny and compelling, it often seems to try too hard to be what it aspires to be, carrying an air of smugness about itself as it does so. What's more, a number of characters are seriously underused, and the script for what should be a timeless sort of tale is tarnished by discussions of contemporary topics that ground it in the present, diluting what should be one of the picture's chief defining characteristics. But the biggest issue is a big, gaping, vacuous question that's left unresolved at film's end, one that's sure to leave astute viewers scratching their heads. While the end product is far from awful, it certainly could have been a lot better. Wait for home media on this one.",
      "review_date": "2019-12-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Deceptively simple but strangely addictive and intelligently constructed.I really didn't know what to expect about this film. I mean I knew the reviews had been good and the truth is that I was really interested because of Rian Johnson andDeceptively simple but strangely addictive and intelligently constructed.I really didn't know what to expect about this film. I mean I knew the reviews had been good and the truth is that I was really interested because of Rian Johnson and the amazing cast he gathered.And the film responded with good stuff, at least in my perspective. While it's true that you quickly sense who's responsible, the plot is pretty good and hooks you up since the first minute.The suspense never falters drastically, with the exception of some slowdowns in the rhythm. Even so, Knives Out it's quite an entertaining experience and I loved that.Very well done mainstream cinema outside franchises.It's well known that we need a lot of it, so go watch this film.",
      "review_date": "2019-12-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very predictable. I hated it. Filled with One-dimensional characters. Sloppily executes social & political commentary.",
      "review_date": "2020-02-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Knives Out is really good. It's an intriguing and fun whodunnit. Well acted, the plot is a bit farfetched but it still turns out rather well. One of the better movies of the year. I'd give it an 8.5 if I could, but I'm gonna go with a 9Knives Out is really good. It's an intriguing and fun whodunnit. Well acted, the plot is a bit farfetched but it still turns out rather well. One of the better movies of the year. I'd give it an 8.5 if I could, but I'm gonna go with a 9 because it was really, really entertaining.",
      "review_date": "2019-12-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great flick, funny dialogue and performances. Craig was very giving his all in this movie. Will recommend!",
      "review_date": "2019-12-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nIt makes no sense to play suicide, because a forensic medical examination will still show an overdose of morphine. It is strange, and it seems meaningless, that a writer who made a fortune by writing detectives does not know this. It makes no sense to make Martha once again “dance” in front of a crowd of potential witnesses, if you could spend two minutes spending her and returning to your room to lie on the sofa, taking the syringe in your hand. It makes no sense to ignore the testimony of the servant. It makes no sense not to seize the opportunity and ask Martha if she knows who the killer is. It makes no sense to go in white sneakers, stained with the blood of the murdered for a week. There is no point in the physiological features of the main character, because she successfully lies without it. There is no point in returning to sweep tracks with medicines, because in this case all possible suspicions from Martha will be removed. It makes no sense to burn the laboratory, the corpse is not far. It makes no sense to dissuade Martha from returning the money. It makes no sense to blackmail Ransom, because there is no murder. It makes no sense to put different drugs in the same containers. It makes no sense to take fingerprints, because immediately everything will become clear. It makes no sense...",
      "review_date": "2020-02-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Let the mystery begin! When you sit down you kinda know what to expect if you watched the trailer, but at the same time you have no idea what's going to happen next. Whenever a question is answered in the story, another one right away arise.Let the mystery begin! When you sit down you kinda know what to expect if you watched the trailer, but at the same time you have no idea what's going to happen next. Whenever a question is answered in the story, another one right away arise.The story gives you the classic \"this is my main suspect\" phenomena to pick your guilty party when you conduct your own \"investigation\" during the dialogues, but obviously you can't be sure if you're right or wrong. Cleverly giving out clues during the story progression makes you realize that you may be wrong all along.I can't remember a period during the movie when I didn't have to pay attention. Everything the characters say and do on screen, adds up to the greater picture.Great cast and performance from all the actors involved. Excellent entertainment for 2 hours. Well written, great directing along with great music. If you want something different, I highly recommend to check this one out.",
      "review_date": "2019-12-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Excellent story starring a fantastic cast. One of the best pictures of 2019.",
      "review_date": "2019-12-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ignore any noise being spouted from jaded ‘Star Wars’ fanboys.  Rian Johnson is among the finest filmmakers currently working in Hollywood.Consider his resume: he wrote and directed ‘Brick;’ he wrote and directed ‘The Brothers Bloom;’ heIgnore any noise being spouted from jaded ‘Star Wars’ fanboys.  Rian Johnson is among the finest filmmakers currently working in Hollywood.Consider his resume: he wrote and directed ‘Brick;’ he wrote and directed ‘The Brothers Bloom;’ he wrote and directed ‘Looper;’ he directed the Breaking Bad episodes ‘Fly,’ ‘Fifty-One,’ and ‘Ozymandias;’ and most recently he wrote and directed easily the best murder-mystery of the year, ‘Knives Out.’The plot is dense and brilliantly serpentine—just as one should expect from a quintessential film of the genre—taking on the characteristics of an ouroboros.Each of the characters in the film are familiar, flawed, and driven by their own delightfully selfish motivations.But it’s the writing—oh the wonderful writing!—that makes this picture as powerful and poetic as it is.  From the plot to the dialogue to the very last gasps of the denouement, Johnson keeps the audience completely rapt and on the edge of their seats wishing the saga could somehow continue ad infinitum.",
      "review_date": "2019-12-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "We've seen this before, many times. It was once called Clue, then it was done again quite brilliantly for it's time by Lumet. It was called Murder on the Orient Express that time around. This time, Rian Johnson gives you what he normally hasWe've seen this before, many times. It was once called Clue, then it was done again quite brilliantly for it's time by Lumet. It was called Murder on the Orient Express that time around. This time, Rian Johnson gives you what he normally has to offer. Something pro looking for the people that just can't do the new-wave of cinema. This is a great film for people that don't like when movies just end (and need something bluntly climactic), getting annoyed at the open endings of 'No Country For Old Men', 'There Will Be Blood', any Spring Breakers, etc etc...  It might be stylized to the tune of a 2019 film, but just as in 'Brick', Johnson cannot for the life of him decide what kind of reality this takes place in. Is it ours? One might get the feeling that it's meant to be a hyper-realistic play on our reality with a little Hollywood action spice. Not a bad recipe if you do it right.  Johnson does not do it right.  This film, just like 'Brick' creates a reality that is surely having an identity crisis. Good angular editing with some imagery that is more so eye grabbing than it is specifically profound. Michael Shannon I feel is held back by the script. And Daniel Craig really could have pulled off something great if it wasn't so flat as a whole. I feel bad at the great work put in by some of these amazing actors, all falling flat on such a script. -  Another relic re-birthed for a new generation.  You might see it up for some hokey awards like the Oscars or Globes, ones that are televised and who's purpose is to rake in ratings (money). Alas it is too two dimensional to be winning things at Cannes or big time fests. This will be one of those films that will be on weekend non-cable channels all the time, in about 10 years. This is the type of movie I say might not be a waste of money, but it certainly won't cut the test of time. Go to Lumet for than.  Rian Johnson; another swing and a miss!",
      "review_date": "2019-12-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you like hollywood elitist politics shoved down your throat, this is the film for you. However, if you like to just enjoy good movies, this film will fall short of even the lowest expectations. The plot is predictable and fully politicallyIf you like hollywood elitist politics shoved down your throat, this is the film for you. However, if you like to just enjoy good movies, this film will fall short of even the lowest expectations. The plot is predictable and fully politically charged. The acting is pathetically type-casted. Just all around a piece of hollywood garbage.",
      "review_date": "2020-03-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Despite the fact that the acting is spectacular, there are certain points in the story that I found confusing and strange. One reoccurring plot point in particular seemed ridiculous and out of place even though the movie leans on it for theDespite the fact that the acting is spectacular, there are certain points in the story that I found confusing and strange. One reoccurring plot point in particular seemed ridiculous and out of place even though the movie leans on it for the story to work.",
      "review_date": "2019-12-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Fresh deconstruction of a genre movie??? More like a political agenda dressed as a boring pastiche film with idiotic plot, weird acting and zero stakes. Matching puzzles to fit each other doesn't make a great picture. The most overhyped movieFresh deconstruction of a genre movie??? More like a political agenda dressed as a boring pastiche film with idiotic plot, weird acting and zero stakes. Matching puzzles to fit each other doesn't make a great picture. The most overhyped movie of the last year. I understand the critics ratings (because of the political agenda), but viewers? Do you really liked that pointless movie? (or paraphrasing Chris Evans from the movie - you ate that ****  I'm not American, I live in Europe, I don't care about Star Wars (so I'm not one of those haters) so I watched that movie with no expectations. I didn't like it because it's a weak movie. For me its place is among films such as \"Murder Mystery\" with Sandler and Aniston (the most popular movie on Netflix in 2019 - Jesus!!! I lose my faith in people).",
      "review_date": "2020-01-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Strikingly.. This movie surprised me ! Ryan Johnson shot a very interesting and exciting picture. Definitely worthy of attention",
      "review_date": "2020-02-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Kept my attention in spurts, but one of the dumbest movies of the year.  Tried to make it like Clue, the board game. But was silly from start to finish.  I did like Marta, the Paraguay nurse.  She was adorable.",
      "review_date": "2020-01-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Vaguely entertaining but full of obnoxious characters and tedious plotting.",
      "review_date": "2020-03-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Engaging and funny at times, but works too hard to set up its contrivances on the one hand, and then takes furious short cuts on the other. Such as a car chase where the main character can't be going more than 50 mph and claims she's flooringEngaging and funny at times, but works too hard to set up its contrivances on the one hand, and then takes furious short cuts on the other. Such as a car chase where the main character can't be going more than 50 mph and claims she's flooring it, and then fakes out all the police by simply hitting the brakes. Mistakes like this, or like the cheap gimmick of the main character throwing up whenever she tells a lie, are so far into silly territory that it gnaws at the credibility of what is in many respects a meticulously crafted murder mystery.The other problem is at some point the twists start to feel a bit too predictable and rote, and the reveals start to lose impact. At some point, to earn its due, Knives Out had to fool the audience and it just never really does. Most of the supporting cast is quickly off the suspect list and the only thing that makes us still care about them is the actors' performances (which are generally quite good). No, the problem with Knives Out is solely in the writing.Also Knives very cheaply injects politics as a way to turn the vilification of the antagonists up to 11 and ennoble the protagonist. It's pretty stunning how tacked on and lazy it's done here. With the film's \"critics insurance\" paid, I'm not surprised at it being rated more highly than it probably deserves. Watch the over 40 years old Blazing Saddles if you want to see a movie that does it right.",
      "review_date": "2020-02-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nBoring than I expected. Hhhhhhhhhhhjkkkkkkk.   So disappointed....’.........",
      "review_date": "2020-05-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It was fine, it not somewhat predictable. It held my attention, but I didn't walk away continuing to think about the movie. The dramatic overacting by the cast made it seems like they were trying to make something that felt like the originalIt was fine, it not somewhat predictable. It held my attention, but I didn't walk away continuing to think about the movie. The dramatic overacting by the cast made it seems like they were trying to make something that felt like the original Clue! movie, but it did't really hit the mark.",
      "review_date": "2020-02-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Came in with big expectations after seeing the actors involved, and I got to say, there is nothing impressive about this movie, except for the fact that they managed to get so many high caliber actors together on one set. A lot of hiddenCame in with big expectations after seeing the actors involved, and I got to say, there is nothing impressive about this movie, except for the fact that they managed to get so many high caliber actors together on one set. A lot of hidden advertising. Very basic plot. And caricature characters with a lack of depth.",
      "review_date": "2020-05-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "THE slowest, most tediously boring and needlessly drawn out movie I've ever watched. The dialogue went on and on and on. Plot developed at a glacial pace. Never thought this stupendously overwrought pathetic attempt at intrigue would everTHE slowest, most tediously boring and needlessly drawn out movie I've ever watched. The dialogue went on and on and on. Plot developed at a glacial pace. Never thought this stupendously overwrought pathetic attempt at intrigue would ever end. The murder mystery genre is ruined for me forever.",
      "review_date": "2019-12-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Chock a film full of talented actors having a great time being mean or eccentric, add a clever plot peppered with plenty of cynical humor, and you get this delightful whodunit. The patriarch of a spoiled family (Christopher Plummer) is foundChock a film full of talented actors having a great time being mean or eccentric, add a clever plot peppered with plenty of cynical humor, and you get this delightful whodunit. The patriarch of a spoiled family (Christopher Plummer) is found dead on his 85th birthday and, of course, everyone has a motive. Enter a debonair Southern detective (Daniel Craig chewing up that accent) to solve the case. Chris Evans is especially enjoyable as the haughty, hateful grandson, while Toni Collette's new age entrepreneur is a hoot. (It's also a treat to see Frank Oz as the attorney.) The mystery keeps surprising right up til the end with lots of smart dialogue and stylish direction by Rian Johnson.",
      "review_date": "2019-11-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Knives Out is a great time through and through. Rian Johnson expertly weaves his mysterious threads to create another fantastic addition to the whodunit genre. The cast joyfully embrace their roles, radiating a playful energy throughout theKnives Out is a great time through and through. Rian Johnson expertly weaves his mysterious threads to create another fantastic addition to the whodunit genre. The cast joyfully embrace their roles, radiating a playful energy throughout the entire film. Just enough structural changes are made to the classic formula to make Knives Out feel fresh and new. A few flat jokes and one minor limp reveal cannot ruin what is otherwise one of 2019's most enjoyable films.",
      "review_date": "2019-12-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Really hated this film. What's started off as an interesting and plausible story with good acting and great characters --devolved into a completely unbelievable and ridiculous plot. The minute that one character revealed that sheReally hated this film. What's started off as an interesting and plausible story with good acting and great characters --devolved into a completely unbelievable and ridiculous plot. The minute that one character revealed that she \"compulsively vomited when an untruth was told,\" I was disappointed and lost interest. Story became completely unconvincing.",
      "review_date": "2019-12-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nthe migration subtext in this movie is sheer idiocy. not even the stellar cast saves this crashed and sorry version of a whodoneit. the fake accents, the fake tans, the evident machinery and evidently the inapt director deliver such a sorry flick not even a film. a waste of the viewer's patience.",
      "review_date": "2019-12-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is the absolute worst movie of 2019 . Don’t waste your time if you like believable characters or plot.  The director swears he’s clever with this garbage; but it’s basically a CLUE movie to include the overacting and all. Daniel CraigThis is the absolute worst movie of 2019 . Don’t waste your time if you like believable characters or plot.  The director swears he’s clever with this garbage; but it’s basically a CLUE movie to include the overacting and all. Daniel Craig pretends to be Foghorn Leghorn for several hours it is the absolute worst impression of southern accent I have ever seen.",
      "review_date": "2020-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very over-rated movie despite an all-star cast and Craig's accent was terrible.",
      "review_date": "2020-01-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A very pretentious, bloated film that is trying to be tongue in cheek while unsubtly pushing its moralistic \"message\" about immigration and resorting to the same trope as \"Get out\" about \"white guilt\".The whodunnit is mostly boring, as inA very pretentious, bloated film that is trying to be tongue in cheek while unsubtly pushing its moralistic \"message\" about immigration and resorting to the same trope as \"Get out\" about \"white guilt\".The whodunnit is mostly boring, as in all detective stories. The genius of Agatha Christie or Arthur Conan Doyle was to all so subtly question \"Britishness\" and its pragmatism, its empiricism and confront continental/French rationalism. It was the clash between Poirot or Holmes with the British police that made it so interesting. The social critique was secondary.Here we are left with a vague, inaccurate and pretentious \"Go game\" parable and an ultimate moralistic rubbish \"you won by having a good heart\". PS: What I find very ironic is how this kind of movie makes fun about the hypocrisy of \"white\" liberals towards immigration, while I am sure Messrs James Bond guy, Captain America guy and consorts feel so smug and self-satisfied about this film... while probably having in their employ a few servants and modern serfs on meager wages toiling for them directly and indirectly.",
      "review_date": "2020-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "“Knives Out” was written and directed by Rian Johnson and stars an ensemble cast including Daniel Craig, Jamie Lee Curtis, Michael Shannon, Don Johnson, Toni Collette, Christopher Plummer and an amazing young actress, Ana de Armas. This is an“Knives Out” was written and directed by Rian Johnson and stars an ensemble cast including Daniel Craig, Jamie Lee Curtis, Michael Shannon, Don Johnson, Toni Collette, Christopher Plummer and an amazing young actress, Ana de Armas. This is an old fashioned whodunit a la the style of Agatha Christie with hints of Hitchcock coupled with  a screenplay that compels attention and careful concentration by the viewer. Plot twists and sometimes tongue In cheek dialogue make the film worthy of attending. Handled in the direction of another less skilled writer and director, the film might well have crossed the line into silliness and absurdity. Fortunately, it does not.Although the film itself is not momentous and could be criticized for being longer than it should  be, when all is said and done, the film  works. I give it an 8 for affording the audience the opportunity to have a light and entertaining theatrical experience.",
      "review_date": "2019-12-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI wasn't sure if this movie was supposed to be funny or not.  Some parts were overly corny like the main character she was ridiculous . I liked Daniel Craig's part and Christopher Plummer's part,  but if it was supposed to be funny most of the people in our theater and I would say at least a 100 didn't get it that way all the way through . So  it was pretty good as far as new material but lacking as far as hitting the nail on the head. And yep a bit like clue only they told you who don't right off the bat..",
      "review_date": "2019-11-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I wasn't expecting too much from the movie, but it actually turned out to be a lot of fun. The acting was good, and I felt rewarded for paying attention. I'd see it again!",
      "review_date": "2019-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "From the director of The Last Jedi comes another great movie! Yes, I said that. Screw you guys. Knives Out is a wildly creative, fun and, yes, subversive whodunnit murder mystery! Knives Out features and excellent ensemble cast and aFrom the director of The Last Jedi comes another great movie! Yes, I said that. Screw you guys. Knives Out is a wildly creative, fun and, yes, subversive whodunnit murder mystery! Knives Out features and excellent ensemble cast and a compelling narrative filled with twists and turns! One of the most entertaining, politically/socially relevant and original films I saw this year. It’s nice to have a mystery movie not based on a book so everyone doesn’t already know who did it going in. I actually don’t know how much I want to say about this movie, there’s not much I can really say about it without giving away major spoilers. I’d say just go out and see it for yourself. It’s really good, you’ll have a TON of fun! Get to the theatre early, it’s still selling out over a month after releasing! I’m so happy it’s doing so well, it’s a real crowd pleaser. I guess it really was Star Wars fans that were the problem after all. Good to know.",
      "review_date": "2020-01-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Incredible I love it, is one of the best movies of this year it’s funny, intelligent and I think this movie has to be nominated for best screenplay",
      "review_date": "2019-12-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is an amazing illustration of a generation gap.This \"clue\" type mystery is one that was worn out and beaten to death by the 70s and 80s but is something this current generation is completely unfamiliar with. Hence why so manyThis film is an amazing illustration of a generation gap.This \"clue\" type mystery is one that was worn out and beaten to death by the 70s and 80s but is something this current generation is completely unfamiliar with. Hence why so many reviewers are fawning over this as \"slick, clever, smart\" etc  Its simply a matter that they themselves have not seen this sort of film mystery.However if you did live through those eras and saw these types of films you would see that all Knives out is is a poorly crafted and generic imitation of far better whodunit mysteries.The characters are hollow caricatures with no depth. Casting was surprising but not for good reasons. Has beens like Jaime Lee Curtis and Don Johnson using the film trying to make a comeback, Mostly nobodies that you have never heard of, a few neverweres Like Shannon and the lead character you will think is just Miley Cyrus faking a Latino accent. Then there is Daniel Craig basically doing his best imitation of Frank Underwood minus the megalomania.The biggest problem is that it is for all intents a Disney film in the sense that Disney influences abound, despite not being directly associated with the #EvilestCorporationOnEarth. From the presence of \"Captain America\" to being Written, directed and produced by Rian Johnson you begin to see that Disney influence. It is bland, depthless, bottom feeding cud that does nothing new, exhibits no originality and panders to the lowest common denominator for fear of producing something that wasn't predictable within the first 30 minutes.Dont get me wrong, Ive spent far more time with far worse offerings but between being generic, derivative and predictable this is not an enjoyable thing to watch.",
      "review_date": "2019-12-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Back in the days of black-and-white, mystery films were quite common but as the years went by, they became less and less common with the mystery genre becoming the domain of television. This is a pity, because I like an old-fashioned mystery.Back in the days of black-and-white, mystery films were quite common but as the years went by, they became less and less common with the mystery genre becoming the domain of television. This is a pity, because I like an old-fashioned mystery. Between this movie and Murder on the Orient Express, it's nice to see the genre make a comeback. Director/writer Rian Johnson was definitely trying to evoke an old school mystery film with this homage, and after seeing the trailers, I definitely wanted to see this. I even went to a farther away early access screening because I couldn't wait. I'm pleased to say this definitely met my expectations.Knives Out is just a really well told movie. For 2 hr., 10 min., this is finely paced and edited. Johnson really knows how to steer the story, especially the beginning and introduction to the facts of the case.Besides being a mystery, this movie is also a critique of privilege, which I felt Johnson managed to not beat the audience over the head with. The movie also has a good sense of humor.The suspects consist of the Thrombey family, who from one extent to another all have leeched off of the money and success of patriarch and mystery writer Harlan Thrombey. They are such a delightfully self-entitled but diverse group of larger-than-life dysfunctional people. I'm a little disappointed that we didn't get more of them. (Ana de Armas' Marta Cabrera, Harlan's personal nurse, is the actual star of the film.) I especially thought that Linda Drysdale (Jamie Lee Curtis) is given short shrift.The cast is excellent all the way through, and I just don't have time to mention everyone. The best performance is by Daniel Craig as Southern gentlemen detective Benoit Blanc. He just kills it as the eccentric and well-spoken detective. I also appreciate that Benoit isn't portrayed as a socially awkward, mircaulous wunderkind as is often the case with detectives these days. Benoit is definitely the smartest guy in the room, but solving the case is real work for him. Again, this is Ana's story. The trailers make Benoit look like the lead. Just don't want you to have false expectations. He is one of the biggest players, make no mistakes.The movie looks great. The Thrombey estate is delightfully grand and old-fashioned looking and is decorated with a wide assortment of mystery-themed or antiquated bric-a-brac. The outfits all look great as well.There is only one thing about this movie that bothered me. The score tries for a classic mystery feel to it but tries too hard. A couple times it felt like they were just blasting the music in my face.Overall, this is just a very entertaining movie and definitely something for mystery fans.",
      "review_date": "2019-11-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Knives Out is one of the most fun movies of the last couple of years and one of the best movies of the year. Don’t listen to the angry Star Wars fans you probably haven’t seen the movie.",
      "review_date": "2019-11-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Last Jedi is made by the same writer/director?  Something is afoot.Rian's signature style is at full force.  A simple, classic premise that is layered with quirky intrique.  You're bombarded with curious red herring in between actualThe Last Jedi is made by the same writer/director?  Something is afoot.Rian's signature style is at full force.  A simple, classic premise that is layered with quirky intrique.  You're bombarded with curious red herring in between actual clues.  While I agree that there are much better crime mysteries.  Rian Johnson is really carving out his own style/sub-genre similar to what Tarantino did for himself.",
      "review_date": "2020-01-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Boring, predictable, and preachy, with insufficient backstory to make you care or hate any of the characters or understand their choices... with a Scooby Doo ending to boot (lazy storytelling and mediocre filmmaking) .  I'll never get the 2+Boring, predictable, and preachy, with insufficient backstory to make you care or hate any of the characters or understand their choices... with a Scooby Doo ending to boot (lazy storytelling and mediocre filmmaking) .  I'll never get the 2+ hours of my life back that I wasted watching this film.",
      "review_date": "2020-01-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "“This case is like a donutwith a holein the middle of a donut hole.\nActually,\nit's a donut within a donut's hole.”\n\n‘Knives Out’ subverted my expectations...in a good way. A smartly written whodunit movie that manages to be both humorous“This case is like a donutwith a holein the middle of a donut hole.Actually,it's a donut within a donut's hole.”‘Knives Out’ subverted my expectations...in a good way. A smartly written whodunit movie that manages to be both humorous and classy. The kind of murder mystery that never fails to entertain. Pleasing both cinephiles and mainstream audiences. Perfectly balance, as all things should be. It basically pulls a Hitchcock on us.Rian Johnson is a great director, but at times has silly ideas. On the other hand, when given the right material I think he’s a great director and writer. He’s also a clever man, but never came off as annoying. The dialogue was so sharply written that I could tell the cast loved every minute of soaking up and delivering these lines. The cinematography was nothing short but beautiful and will often linger in rooms of the house which helps the audience immerse in the overall setting.One of the tightest scripts of the year with raw humor and a satisfying mystery/comedy.The cast is stellar, but the main stand outs for me were Daniel Craig, Ana de Armas, and Chris Evans. I loved Daniel Craig’s Southern drawl which I didn’t expect at first, but I was amazed of how far he went for it. Often times it reminded me of Frank Underwood from ‘House of Cards’. He plays detective Benoit Blanc, AKA CSI: KFC. At one point during the movie he delivers one of the funniest monologues in the entire movie, which was brilliantly delivered by Craig. He should seriously try out more comedy roles.Dose anyone remember when Ana de Armas starred in Eli Roth’s ‘Knock Knock’? Well look at her now. She was absolutely excellent in this movie. The running joke throughout the entire movie is her character can’t lie and whenever she dose, she vomits on the spot. How ironic, yet I love the comedic irony behind it.Chris Evans plays a spoiled child with a slimy grin during the worst situations. The over privilege black sheep of the family. This is very against type for Evans, especially when his character hates dogs, which I would imagine being difficult for Evans since he’s a dog lover in real life. Also the different sweaters he wears in every scenes was impeccable.The rest of the cast manage to shine individually in this crowded movie. Although at times some of them felt like background wall paper compared to others. However that never takes away from what else ‘Knives Out’ has to offer.Toni Collette dose a great impression of Gwyneth Paltrow. Michael Shannon plays a wimpy son to a crime-writer Harlan Thrombey (Christopher Plummer). Despite the small screen time, Plummer is still charming as always. While Jamie Lee Curtis and her character brings the dramatic elements into play. She’s uninterested in the humorous quarrel during the grim situation, as early on she reminds everyone that her father just died.Judging it as a whodunit mystery, the pay off itself is slick. The events leading to the death are revealed early into the movie, and instead Johnson remains steps ahead from the audience. There’s an underlining social commentary beneath the foul play. The themes of privilege and underprivileged with the sour taste of bitterness throughout. Nothing deep or new, but at least is trying to say something rather than being one thing.Overall rating: My House. My Rules. My Coffee!!!",
      "review_date": "2019-12-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was a delicious homage to and extension of the Agatha Christie tradition. All the clues are there for you to find the solution. The acting and art direction are delicious, and I found the final twist to be both totally surprising andThis was a delicious homage to and extension of the Agatha Christie tradition. All the clues are there for you to find the solution. The acting and art direction are delicious, and I found the final twist to be both totally surprising and completely believable. That's quite rare. It's mildly thrilling, with quite a few laughs and cultural references.",
      "review_date": "2019-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was expecting it to be a better, owing to its trailer putting Daniel Craig as the front and center of the film. Despite the misleading marketing, 'Knives Out' was still a well-written and performed whodunit, with a terrific ensemble and aI was expecting it to be a better, owing to its trailer putting Daniel Craig as the front and center of the film. Despite the misleading marketing, 'Knives Out' was still a well-written and performed whodunit, with a terrific ensemble and a surprisingly clever twist at the end. I would say that some scenes could have been longer and others shouldn't have been there at all. It was still a fun and clever film in the spirit of Agatha Christie, and Rian Johnson can move on from 'The Last Jedi' with this.",
      "review_date": "2019-11-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'm usually a sap for a great murder mystery, and the all-star cast in this really intrigued me! So I figured I'd give it a go. I honestly can't talk about the story very much without spoiling anything, so I'll just talk about the story andI'm usually a sap for a great murder mystery, and the all-star cast in this really intrigued me! So I figured I'd give it a go. I honestly can't talk about the story very much without spoiling anything, so I'll just talk about the story and cast here. It's a great cast as you can tell by the poster, but as far as scene-stealers go, Daniel Craig steals this one as the rather humorous detective working the case. The cast as a whole is what made this film as fun as it was for the most part. Everybody was definitely on their A-game here! Storywise, it pretty much follows a lot of standard murder mystery tropes and plot points, to my disappointment, cause I was hoping for something slightly more fresh and different here. I also felt a bit underwhelmed with the third act personally and saw a couple \"twists\" coming from pretty far away. Overall, there's fun to be had here, but in my opinion, it settled for a mostly familiar setup and story, and played out a little more predictably than I was expecting and hoping for. If anything, see it for the great, even sometimes hilarious performances from the whole cast.",
      "review_date": "2019-11-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It’s evident from the word go that its stellar ensemble is having a blast with the material. First Logan Lucky and now here, Daniel Craig is developing quite a knack for cutting loose away from his commitments to James Bond. His Benoit BlancIt’s evident from the word go that its stellar ensemble is having a blast with the material. First Logan Lucky and now here, Daniel Craig is developing quite a knack for cutting loose away from his commitments to James Bond. His Benoit Blanc is a riot whose attempts at wisdom only perplex the suspects around him, possessing an outlandish nature that is befitting of those the film lovingly references, that will likely trigger calls for a series of films headed up by this gentlemen sleuth. Moving into the family, Toni Collette’s Joni is brilliantly **** whose liberal viewpoints inevitably cause rifts with the more conservative amongst her, along with Chris Evans, who chews up the scenery as the roguish Ransom. The real breakout here, particularly in her pitch-perfect comic timing, is Ana De Armas’ Marta, whose unique perspective away from the Thrombeys plays a pivotal part in conveying the film’s weightier ideas.A truly wicked whodunnit. Rian Johnson’s Knives Out is to die for.",
      "review_date": "2019-12-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you like the many films that have taken on Agatha Christie’s whodunits, you should have some fun at this film. It’s not great, but the acting is excellent (especially Daniel Craig and Toni Collette) and the skill of the actors kept meIf you like the many films that have taken on Agatha Christie’s whodunits, you should have some fun at this film. It’s not great, but the acting is excellent (especially Daniel Craig and Toni Collette) and the skill of the actors kept me interested. The plot moves along and keeps you (or at least it kept me) guessing with its twists and turns. I also liked the film because it was made to entertain and that’s perfect for a holiday weekend.",
      "review_date": "2019-11-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Easily the best movie this year along with Parasite. Satisfying political satire and playing with murder mystery conventions. Enjoyable on every level. I love movies that keep switching up what they are as they go along",
      "review_date": "2019-11-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Rian Johnson masterfully subverts the mystery genre while still paying homage to the great whodunnits of the past",
      "review_date": "2019-11-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A corny but lovable mystery film. It kept me guessing until the very end, giving a good payoff to the observent movie watcher. It was annoying to watch it in the theater because I wanted to share my theories with my friends, but didn't wantA corny but lovable mystery film. It kept me guessing until the very end, giving a good payoff to the observent movie watcher. It was annoying to watch it in the theater because I wanted to share my theories with my friends, but didn't want to be a nuisance. Overall I recommend this movie and it's the best mystery film I've seen in a while",
      "review_date": "2019-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Now that was a great movie. Now about the good aspects of the film, I think humor was great, acting was great (especially by Daniel and Ana), direction was great, the film looked beautiful.Now talking about the average aspects of the film,Now that was a great movie. Now about the good aspects of the film, I think humor was great, acting was great (especially by Daniel and Ana), direction was great, the film looked beautiful.Now talking about the average aspects of the film, the story is not as clever as it is trying to be.Now the worst parts of the film were characters were underutilised. Why do u need such a big cast if the show is just gonna be stolen by Daniel and Ana.Overall- I think it was a great movie and I enjoyed my time in the theatre so I will recommend it.Verdict- A",
      "review_date": "2019-11-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best movie I have seen for a long time ... Simply put,  go and see it. You will not be disappointed",
      "review_date": "2019-12-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nIs this a f---ing joke? 80% here, 90%+ on RT... this film is not smart. It reveals its plot in the first 10-20 minutes (the entire plot, no joke). Acting is terrible (cringe level) with endless talking and NONE of it is funny or entertaining. This Rian Johnson dude, keep him FAR away from films. He sucks.",
      "review_date": "2019-12-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It was fun to watch the somewhat obvious clues and figure out the actual mystery very early on, then get hit with a gut punch at the end I wasn't expecting. It wasn't even just about figuring out what happened or by who, as that seemedIt was fun to watch the somewhat obvious clues and figure out the actual mystery very early on, then get hit with a gut punch at the end I wasn't expecting. It wasn't even just about figuring out what happened or by who, as that seemed obvious; the why and journey there was the best part. Great movie, go see it if you just want to enjoy a fun movie.",
      "review_date": "2019-11-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Good idea, good story, good execution. Story is logical, is possible to deduce who is bad but it is not easy. Not for Marvel like movies fans.",
      "review_date": "2019-11-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "You think of it and you see it. You catch Rian plotting something, he catches you back with a grin observing the truth. This goes unmentioned and every second, for two hours.Knives Out\n\nThe writer and director Rian Johnson has all theYou think of it and you see it. You catch Rian plotting something, he catches you back with a grin observing the truth. This goes unmentioned and every second, for two hours.Knives OutThe writer and director Rian Johnson has all the attention he would want from me. Actually, more than he can imagine. And maybe that is why his film communicates so intensely to me. It has been my whole life watching films and I don't think ever has a filmmaker outdone himself or herself every time. Every time I go through this mechanical factory of Johnson and I come out with a page of poem in my hand. Johnson's film is not just good but also impeccably difficult to resist, to dislike. The entire film is the pulp. The scheme. There is no bite. No structure. No sleazy attitude or excuse that tells you, the audience, to go through necessary changes, developments of storytelling and asks you to sit by as it sets every set pieces one by one. From the minute you enter this house, it's a GO. This high calibered cast is skillfully juggled and stirred with their whisk of borderline offensive humor. You are told to sit in the middle of a dinner table and you are pushed like some prop of a game as these shady rich brats lashes you, charges you with upright white lies formed.. poorly! What? The distractions aren't distracting enough? Johnson is way ahead in this game. You can't even see him let alone catch him. He has staged the film within a few days, a short period of time. It's all temporary. Things, behaviour, intentions flickers faster than a broken tubelight. Just as his films are. You have to be up to date with the current intentions, suggestions, innuendos of the film. For the film is, both politically and wickedly strong. Never preachy but always on the mark. Knives Out is potent, ambitious and inspiring.",
      "review_date": "2019-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Awesome movie, one of the year's best definitely!! Sharp in every way, stellar cast!",
      "review_date": "2019-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A modern and fun \"who done it?\" in the style of an Agatha Christie mystery. Fun and enjoyable with decent acting, good cinematography, and fantastic set design.The necessary requirement of a \"who done it?\" to be enjoyable to me, that thisA modern and fun \"who done it?\" in the style of an Agatha Christie mystery. Fun and enjoyable with decent acting, good cinematography, and fantastic set design.The necessary requirement of a \"who done it?\" to be enjoyable to me, that this one pulls off fantastically, is that if you are paying attention you can figure it out for yourself before the reveal.Honestly the only downside I found with the movie is the policitical attributes and the push for the characters to be purely bad with no redeeming qualities as a way to associate with that alignment. It adds nothing to the movie and distracts quite a bit.",
      "review_date": "2019-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "For the most part it moves along quite well, and even if you see the final twist coming (because the film literally tells you midway through) it’s still a fun ride.",
      "review_date": "2019-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It was super funny and witty. Brilliant actors by the cast. One of the best movie of the year!",
      "review_date": "2019-11-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wonderful movie with a double-twist and detective story. Great actors, great actor's game, great picture and camera's positionality",
      "review_date": "2019-11-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Just another detective story, but a politically charged one. If I want politics in my detective story, I'd read some cheap conspiracy theory blog.",
      "review_date": "2020-05-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A decent whodunnit with a stellar cast of characters. I had some issues with the film overall but it's very much worth a watch, I don't think it has as much bite as Rian Johnson's previous works such a Looper, Brick or The Last Jedi",
      "review_date": "2019-12-26",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 152,
  "genres": [
    "Drama",
    "Mystery",
    "Thriller",
    "Comedy",
    "Crime"
  ]
}