{
  "title": "Once Upon a Time in Hollywood",
  "rating": 7.5,
  "release_date": "2019-07-26",
  "summary": "Once Upon a Time in Hollywood visits 1969 Los Angeles, where everything is changing, as TV star Rick Dalton (Leonardo DiCaprio) and his longtime stunt double Cliff Booth (Brad Pitt) make their way around an industry they hardly recognize anymore.   The ninth film from the writer-director features a large ensemble cast and multipleOnce Upon a Time in Hollywood visits 1969 Los Angeles, where everything is changing, as TV star Rick Dalton (Leonardo DiCaprio) and his longtime stunt double Cliff Booth (Brad Pitt) make their way around an industry they hardly recognize anymore.   The ninth film from the writer-director features a large ensemble cast and multiple storylines in a tribute to the final moments of Hollywood's golden age. … Expand",
  "critic_reviews": [
    "Wistful, funny and complicated in interesting ways, Quentin Tarantino’s new movie, Once Upon a Time… In Hollywood, may be his warmest film since Jackie Brown - which may not be what you expected to hear about a movie set against the background of the 1969 Manson murders.",
    "Throughout the film, Pitt exudes charm and a philosophical nature, but also the possibility of explosiveness. He doesn’t show you everything. What do you say about a performance like this? Scene by scene, Pitt seems to know what to do, all the time — and he never makes it look like work.",
    "The byplay between DiCaprio and Pitt is delicious and finely drawn — you’d better believe Tarantino knows he’s dealing with two of our last old-school movie stars and sneakiest actors.",
    "I do know this for sure — I can’t wait to see this film again. It’s so layered and ambitious, the product of a confident filmmaker working with collaborators completely in tune with his vision. Every piece fits. Every choice is carefully considered.",
    "In certain elements of tone and structure, Once Upon a Time In Hollywood has echoes of \"Pulp Fiction\" and \"Jackie Brown,\" but it is alive and electric with a beat all its own.",
    "The film is Quentin Tarantino’s magnum opus—a sweeping statement on an entire generation of American popular culture and an almost expressionistic rendering of the counterculture forming at its margins, gradually growing in influence.",
    "This is a tender, rapturous film, both joyous and melancholy, a reverie for a lost past and a door that opens to myriad imagined possibilities.",
    "It sits at the mature end of Tarantino’s work, bringing his tongue-in-cheek storytelling together with exquisite craft and killer lead performances from Brad Pitt and Leonardo DiCaprio. And yet, it’s still very much a Tarantino film, trading in genuine emotion one minute, unapolegetically silly the next.",
    "Once Upon a Time in Hollywood is bold, beautiful and brutal. It’s Tarantino’s best film since Kill Bill, perhaps even since Pulp Fiction.",
    "There’s a gleeful toxicity here that will launch a thousand think-pieces – Pitt’s character is capital-P problematic, absolutely by design – but the transgressive thrill is undeniable, and the artistry mesmerisingly assured.",
    "Quite simply, I just defy anyone with red blood in their veins not to respond to the crazy bravura of Tarantino’s film-making, not to be bounced around the auditorium at the moment-by-moment enjoyment that this movie delivers.",
    "It’s Hollyweird love letter material, but it’s glittered with Tarantino’s signature wise-ass attitude. Here he’s part historian, and part aging, experimental auteur.",
    "It’s shaggy and self-indulgent and almost scandalously long; and in nearly every moment, pretty glorious. Once also has the good luck of being anchored by what might be two of the last true movie stars: Leonardo DiCaprio as Rick Dalton, a boozy, anxious actor staring down the bell curve of a never-quite-stellar career, and Brad Pitt as Cliff Booth, his taciturn stuntman turned trusty sidekick and consigliere.",
    "There’s a lot going on in Tarantino’s latest film, including an exploration of the delicacy of a moment in time and how easily an era can be swept away.",
    "As one might expect from Mr. Tarantino’s previous films, his new one is violent — extravagant violence is visited on men and women alike at several points — as well as tender, plus terrifically funny. Yet this virtuoso piece of storytelling also offers intricate instruction on the pervasiveness of violence in popular culture.",
    "It’s a western, for Pete’s sake. Politics are wound into its DNA, and Tarantino knows the genome better than anyone else. Which is just to say that like other classics of the genre, “Once Upon a Time … in Hollywood” is not going anywhere. It will stand as a source of debate — and delight — for as long as we care about movies. And it wants us to care.",
    "The movie has an elegiac quality; it’s filled with passionate feeling about the fleeting nature of life and the magical permanence of cinema.",
    "I’m glad this movie exists if, for nothing else, to introduce new generations to Sharon Tate. And, frankly, I include myself in this. What Once Upon a Time in… Hollywood does best – and most importantly – is frame Sharon Tate as a human being we should get to know.",
    "The result is a surprisingly funny and extremely melancholy hangout film, an elegy for a bygone era that reflects on how all art eventually loses its edge.",
    "Once Upon a Time in…Hollywood is a wistful fantasy fueled by a series of top-grade performances, a stampeding collage of Tarantino-isms, and of course, a happy slathering of movie magic.",
    "All the actors, in roles large and small, bring their A games to the film. Two hours and 40 minutes can feel long for some. I wouldn’t change a frame.",
    "That drifting, elegiac quality (which at times may recall his once-neglected, now-classic Jackie Brown) is the film’s great strength. There are several major set-pieces — some hilarious, some creepy, one absurdly violent — that will get people talking, but perhaps the most powerful is a lengthy, seemingly aimless one that comes smack dab in the middle.",
    "The final act of Once Upon a Time … in Hollywood is funny, scary, troubling and exhilarating by turns; the meandering structure clicks into place as it becomes clear where Tarantino has been taking this story and, given his track record, perhaps could only have taken this story.",
    "Once Upon A Time….in Hollywood is beautifully made. Beyond all the ‘Tarantino-esque’ touches of the action, the banter, the violence, the constant movie references, there’s a real craft at play here.",
    "Once Upon a Time is an elegiac mash note to Hollywood 1969, at times sublimely, almost surrealistically moving while simultaneously managing to be the director’s funniest and least violent film to date.",
    "This is the director’s least violent feature film but it is in every meaningful way evident as a product of the man who made \"Pulp Fiction.\"",
    "Once Upon a Time … in Hollywood is a twilight film in more ways than one.",
    "Pitt, in particular, appears so utterly self-possessed. It’s a swaggering grade-A movie star performance in a movie that celebrates all that movie stars can accomplish — which, for Tarantino, is anything.",
    "The greatest achievement Tarantino pulls off here is, by pure force, to yank this era back to life, to recreate it and revive it as if driven by some sort of religious mania.",
    "Once Upon a Time … in Hollywood is big, brash, ridiculous, too long, and in the end, invigorating.",
    "Once Upon A Time may be a more languid journey than usual, but it gets to a familiar place eventually. In a way Tarantino has turned himself into the kind of Spaghetti Western anti-hero that’s always obsessed him — flawed but ultimately triumphant. I’m still happy to be along for the ride.",
    "This is Tarantino’s Eden, the unspoiled garden when the things he loves don’t have to be sought out or championed because they permeate every aspect of life. The sense of blissful immersion extends to the film’s costuming and production design, both of which are as meticulous as one might expect.",
    "They don’t make ’em like they used to, Tarantino’s film seems to say, but nobody makes ’em like this, either.",
    "It’s an elegy for a certain age of American pop-culture that may really be about the writer-director grappling with his own inevitable obsolescence.",
    "Cars and songs. To be exact: the sight of a car bowling along, at speed, while a song cries out on the soundtrack. That, in the end, is what Quentin Tarantino loves more than anything; more than crappy old TV shows, more than boxes of cereal, more than violence so rabid that it practically foams, and more, if you can believe it,than the joys of logorrhea. His latest work, Once Upon a Time . . . in Hollywood, is a declaration of that love.",
    "On its own terms, Once Upon a Time in Hollywood is a farrago of genius.",
    "Tarantino’s ode to Hollywood is his best since \"Jackie Brown\"; an evocative and disarmingly heartfelt LA story, capped by a finale you won’t forget.’",
    "If it’s not top-drawer QT, Once Upon A Time In Hollywood is at once an engaging buddy comedy, an intoxicating fact and fiction mash-up, gorgeous filmmaking and a valentine to the movies that delivers geek nirvana.",
    "Tarantino was a boy of 6 in 1969, living far from the center of Los Angeles, and in a sense what he’s done here is re-create the world he’s imagined the adults were living in at the time. If it plays like a fairy tale, and it does, don’t forget the first words in the title are “Once Upon a Time.”",
    "Tarantino has always worn his love of cinema on his sleeve, fetishistic and in the form of homage. But here, that love is reverent.",
    "DiCaprio and Pitt fill out their roles with such rawhide movie-star conviction that we’re happy to settle back and watch Tarantino unfurl this tale in any direction he wants.",
    "The respective performances of DiCaprio and Pitt and the film’s meticulous attention to period detail are all great and keep you invested in where this cruise around Tinseltown will ultimately take you.",
    "The paradox of Tarantino’s oeuvre is that it is highly derivative of other movies, mostly genre pulp, and yet the films seem distinctly his. He is the most influential director of his generation because he ranges promiscuously through pop culture and brings to his borrowings an incendiary force.",
    "There is a lot to like here, a few things to love. Like the fact that someone in Hollywood can still assemble a cast this large and impressive — someone who does not work for Marvel.",
    "His [Tarantino's] vision of 1969 Hollywood feels authentic and alive, with a lot of that electricity running through leads Leonardo DiCaprio and Brad Pitt, plus an inspired, understated performance by Margot Robbie as Sharon Tate.",
    "The results? More evocative than provocative. But evocative is not nothing.",
    "Having never been entirely won over by the clever-clever period genre revisionism that has been Tarantino’s mainstay since Bill was killed, I was delighted — after all the lurid what-if speculation over the film’s relationship to the Charles Manson story — to find that his latest is, in such large part, a kind of gorgeously lacquered megabudget hangout movie.",
    "Tarantino’s desire to salute the creative thrill of storytelling is an inviting, welcome presence in American cinema, and his ninth feature suggests he really ought to work more often. But all the vivid callbacks to antiquated TV westerns and the forgotten characters in their orbit fall short of coalescing into much more than that.",
    "This curious fairy tale may not be the truth, and it may prattle on too long. But when its stars align, and they let loose with their unmistakable shine, Hollywood movies do seem truly special again. And, sure, maybe TV does too.",
    "It’s a good film…a better version of the Coen Brother’s Hail Caesar! A film that kept popping up in my head.",
    "For those well-versed in the writer-director's work, it's a credible and intriguing addition to his filmography. Yet at 2 hours and 41 minutes, it also feels too leisurely in connecting its threads, especially compared to the crispness of something like the World War II epic \"Inglourious Basterds.\"",
    "Tarantino, famously obsessed with the history of cinema and its preservation, has recreated a world he wishes he could have worked in with such care and skill and love that, for the most part, it feels like his most personal film. Once Upon a Time in Hollywood is lots of fun, but it’s also strangely, hauntingly sad.",
    "Once Upon a Time… in Hollywood is uneven, unwieldy in its structure and not without its flat patches. But it's also a disarming and characteristically subversive love letter to its inspiration.",
    "Once Upon a Time in Hollywood is often diverting to watch, and it’s been shot on 35mm film with lovingly expressive care by Robert Richardson. But true to its title, it plays like a bedtime story concocted by a petulant child who insists on getting his own back from the people who poisoned his most honeyed dreams.",
    "The pacing of the picture is problematical. It’s curiously inert in the early going, with a lot of time spent in cars with the characters as they drive around and around on freeways, side streets and boulevards in Hollywood.",
    "In its thin conception, shaggy form and muddy execution – and in its glee in coasting on a perceived aura of cool whiz-pow-bang energy – the film is as much a comic-book movie as they come.",
    "If it’s a love letter, it’s the kind tinged with the grasping anguish and stab of bitterness that comes from knowing that the object of affection is almost certainly eyeing up a new favourite.",
    "It’s fine to walk out of this movie not quite sure what Tarantino was using his story’s proximity to this real-life tragedy to say; that’s part of the ambiguity inherent in making art. But it’s dispiriting to suspect that part of why he wanted to stage a Manson-adjacent story was because the accoutrements — the period cars and costumes and neon signs, the glowering barefoot hippie girls, the acid-laced cigarettes and glowing movie marquees — were just so cool.",
    "Rancid, preposterous and hysterically over the top in ideas and execution, “once upon a time” perfectly describes writer-director Quentin Tarantino’s ninth film. Once Upon a Time…in Hollywood is indeed another hopped-up fairy tale like every other Tarantino epic.",
    "It’s indulgent. But we knew that. It’s Tarantino. We come for the indulgence. Once Upon a Time…in Hollywood might be his most self-aware picture yet, a time-burning wallow in 1960s pop culture, fashions and the “magic of the movies.” It’s also misshapen and meandering.",
    "I think what Tarantino is going for is brazenly manipulating historical events to suit his style, and turning a well-worn genre on its head. But in so doing he’s made an everything bagel of a movie: Part satire, part bear hug, part fictional bromance.",
    "Once Upon a Time . . . in Hollywood has been called Tarantino’s most personal film, and that may well be true—it’s far more revealing about Tarantino than about Hollywood itself, and his vision of the times in question turns out to be obscenely regressive."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "This will certainly crack my year-end Top 10 list, and it will likely be in the top half.  I don’t remember the last time I laughed that hard (frankly, often in spots when I was the only one laughing… which is all the better) in a film.  TheThis will certainly crack my year-end Top 10 list, and it will likely be in the top half.  I don’t remember the last time I laughed that hard (frankly, often in spots when I was the only one laughing… which is all the better) in a film.  The story is excellent…vintage QT. But it’s truly Brad Pitt’s film. I mean, he should just sign over his movie check to the director for making him look this good.  Those lines, those action sequences, the dog?  Amazing.  Don’t want to spoil anything – just see this one.  It delivers.",
      "review_date": "2019-07-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was really disappointing. There was basically no plot. The movie had no momentum. It feels like Tarantino got so wrapped up in the setting he forgot about the story. It was just all so boring. Did we really need to see the trailers forThis was really disappointing. There was basically no plot. The movie had no momentum. It feels like Tarantino got so wrapped up in the setting he forgot about the story. It was just all so boring. Did we really need to see the trailers for movies no one's heard of before Tate watches The Wrecking Crew? Did we need 45 minutes of plot details for Bounty Law and Lancer? I wish I'd skipped this one and just watched Inglourious Basterds again instead.",
      "review_date": "2019-07-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI was very excited for this. The acting was superb as one would expect from DiCaprio and Pitt. That said . . . it meanders. It’s plodding and just doesn’t connect. I know why this got such great reviews - it’s an homage to a Hollywood that every film critic is aware of. I like movies, but I have a life. I cannot and will not deep dive into decades old obscure films to justify liking this movie. I know Tarantino doesn’t care. That’s what he does. Some think Jackie Brown is his best movie. I tried to watch it again (on Hulu currently) and couldn't finish it. Maybe the plot of an actor coming to terms with the end of his career connects with some people, but it didn’t with me. Maybe I’ve lost the zeitgeist. When I was 13 and saw Reservoir Dogs it was different, bold. Then I found True Romance and then Pulp Fiction. Kill Bill. Django and even the Hateful Eight (not great but at least things kept moving). Inglorious Basterds was full of dialogue you couldn’t get from other movies. Hollywood . . . was, I’m sorry, just boring.  The twist at the end was basically Inglorious Basterds but worse. There is no examination of the era leading to the Manson family. Or, maybe there was and it was “subtext.”  I understand that Tarrantino sinks himself in the genre, but this genre went away for a reason: ITS NOT INTERESTING. It just didn’t say anything other than “I like old movies.”  That’s great for the critics but not so much for everyone else. I sat in a theater where people laughed at the heady moments and seemed bored at the rest. I would give this a 1 if it wasn’t for the brilliant acting throughout. This is my first and only review, that is how disappointed I was with this movie.",
      "review_date": "2019-07-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The reviews don't seem to mention or care that it's essentially plotless. It's a beautiful, long love letter to a very particular place and time. If you know the history, get the references, and especially if you remember them personally it'sThe reviews don't seem to mention or care that it's essentially plotless. It's a beautiful, long love letter to a very particular place and time. If you know the history, get the references, and especially if you remember them personally it's very nice. If you don't, it's a long, somewhat confusing ramble with beautiful shots and good acting and way too many shots of feet. I would say that Inglorious Basterds and Django were much more compelling films. But, if you're a QT fan and/or remember 1969, it shouldn't be missed.",
      "review_date": "2019-07-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nTarentino masterfully takes back the 60s and defeats the Manson family by offering an alternate ending to that tragic night. It's a tour de triomphe both psychologically and symbolically. IMO, Tarentino's greatest work, it approaches epic proportions like great classic literature. Look for the plethora of references and allusions, the fantastic attention to detail (even the car radios are playing KHJ Los Angeles with the Real Don Steele on Boss radio)... Eye-popping visuals and incredible stellar performances from a star-studded cast. You can see my video review of this film on the Richard Vernadeau channel on YouTube.",
      "review_date": "2019-07-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "QT really is amazing.  Every movie is so entirely different in plot, sets, and time periods yet so entirely the same at the DNA (talkies with some hyper violence).  That’s QT style.  He builds historically detailed intricate worlds that topQT really is amazing.  Every movie is so entirely different in plot, sets, and time periods yet so entirely the same at the DNA (talkies with some hyper violence).  That’s QT style.  He builds historically detailed intricate worlds that top flight actors flock too to give performances of their careers.  If you are the kind of person who only cares about story, \"Once upon a time\" might not be for you.  QT likes to take a movie and mash it up with another genre.  Take for instance Magnificent Eight is a western who-dun-it Canterbury tale.  Inglorious Basturds is about WWII and the love of cinema.  lol.  \"Once upon a time\" is a fairy tale of living in 1960s california and the 1960s movie making business.  It just so happens to also be about the Manson murders.  Pitt and DiCaprio were amazing.  I'm a fan of Margot Robbies performance -- its all visual.  This movie felt like 1969!  You can tell the actors loved being in this movie.  PS: \"Once upon a Time\" in the title is part Sergio Leone spaghetti western and part Brothers Grimm w/ the twisted Manson ending.",
      "review_date": "2019-07-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Non eventful..kept waiting for something to happen..not even worth rental much less movie ticket...hopefully Q will try again",
      "review_date": "2019-07-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie could have been 1h30 long and nothing about this movie would have been lost, and it would've been much more enjoyable to watch. The only redeeming factors about this movie are the acting, the setting and the final 15 minutes.This movie could have been 1h30 long and nothing about this movie would have been lost, and it would've been much more enjoyable to watch. The only redeeming factors about this movie are the acting, the setting and the final 15 minutes. Overall the movie is just WAY too long for no good reason. Also theres is no plot, no conflict, no story. It is just a drawn out 2 hour and 45 minutes experience of the 60s in hollywood. Very boring movie. If I were to watch this again, I would skip at least half.",
      "review_date": "2019-07-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I love Tarantino, but this film was painfully slow and the payoff at the end of 3 hours was simply not worth it",
      "review_date": "2019-08-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What did you expect? Its got Hollywood top rated actors. That alone is worth a 10.",
      "review_date": "2019-08-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I honestly don't know what everyone is raving about. Sure there were a couple of funny parts at the end... after a loooong 2.5 hrs of nothing. They made it look just like it did in 1969, but really who cares? Watch a movie filmed back then ifI honestly don't know what everyone is raving about. Sure there were a couple of funny parts at the end... after a loooong 2.5 hrs of nothing. They made it look just like it did in 1969, but really who cares? Watch a movie filmed back then if you want nostalgia and it will actually be good. The acting was well done, but the story sucked so bad that the acting didn't matter. I usually love Quentin Tarantino movies but this was absolutely awful.",
      "review_date": "2019-07-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Quentin is back with a masterpiece. I almost gave up hope after his last few films. I'm going to go back for a second viewing, but this may be his best all round film. The Pitt & Dicaprio relationship was oscar worthy.",
      "review_date": "2019-07-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is nowhere near as good as Inglorious or Django.  I even thought the Hateful 8 was underrated.  This had none of the dramatic tension and too much of the \"you're cool if you think Tarantino's funny\" anti-humor.  I don't recommendThis movie is nowhere near as good as Inglorious or Django.  I even thought the Hateful 8 was underrated.  This had none of the dramatic tension and too much of the \"you're cool if you think Tarantino's funny\" anti-humor.  I don't recommend seeing it in the theatre.",
      "review_date": "2019-07-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Horrible! We left after almost 2 hours of the most boring film I've ever seen! Total waste of time and money! Do yourself a favor amd save your money! I'd give it 1/2 star out of 5.",
      "review_date": "2019-07-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Hateful 8, Inglorious Bastards, R Dogs, Pulp Fiction, Kill Bill are a few films on my all time favorite list.  This film was terrible.  I saw people leaving the theatre after about an hour.  I would have done the same, but Brad and LeoThe Hateful 8, Inglorious Bastards, R Dogs, Pulp Fiction, Kill Bill are a few films on my all time favorite list.  This film was terrible.  I saw people leaving the theatre after about an hour.  I would have done the same, but Brad and Leo are unreal and I could watch either of those guys paint or sew and still be entertained.  If people didn't know it was a QT film they would have rated it lower, everyone is just scared or blinded by his greatness.  Again, the acting was a 10, but there isn't a story.  The last 15min are great, that is it.",
      "review_date": "2019-07-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a merry-go-round, pastiche tour of Hollywood in the late sixties with Tarantino's usual alternative history tacked on at the end.Despite all the bells and whistles it is ultimately like a boring museum tour. Plotless, characterlessThis is a merry-go-round, pastiche tour of Hollywood in the late sixties with Tarantino's usual alternative history tacked on at the end.Despite all the bells and whistles it is ultimately like a boring museum tour. Plotless, characterless and at times threatening to be endless you find yourself wondering when is the real movie going to start.The real star of the movie is the dog who becomes the prime agent of the alternative ending!",
      "review_date": "2019-07-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I can't remember ever walking out of a movie....talk about boring....after alost 2 hours of hoping things would get better i walked out...",
      "review_date": "2019-07-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nfoook the shill reviews. this movie is a complete waste of time.its plotless drivel capped by some violence at the end. QT needs to stfu and retire.Leo beeches about his lame career while Brad Pitt kicks Bruce Lee's ass and tries to talk to an old man. It ends with them beating the crap out of some Manson minions. Margot Robbie just wanders around on screen with no real impact on the movie. Some fools will say this is about the cinematography and a bygone era in Hollywood, its not. Its about a self-important retard named Quentin Tarantino taking a shiitt in a pale and having hordes of his nerd club congregate on sites like this defending this fail of a movie. Dont be a member of the sheep. DId you really enjoy your time with this movie. DId it entertain you? Did it make you feel you got your money's worth? Or did you feel robbed and exploited by the Hollywood hype machine making this movie out to be the golden fleece?",
      "review_date": "2019-07-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was most pointless, meandering, ridiculous, mish-mash of a \"movie\" that i've ever seen. DiCaprio's performance aside, there's no redeeming value in this flick folks. It's 2 hrs and 40 mins of NOTHING. The scenes (that have no meaning orThis was most pointless, meandering, ridiculous, mish-mash of a \"movie\" that i've ever seen. DiCaprio's performance aside, there's no redeeming value in this flick folks. It's 2 hrs and 40 mins of NOTHING. The scenes (that have no meaning or value) go on endlessly. This is more of a collection of scenes than a movie. I want a REFUND and an apology from the critics.",
      "review_date": "2019-07-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It’s really slow and boring. The director is “selfish” in the sense that he made this movie for his own self-indulgence, not for the purpose of entertaining the audience. You’ll be sitting there for 3 hours (wasting your time) watching whatIt’s really slow and boring. The director is “selfish” in the sense that he made this movie for his own self-indulgence, not for the purpose of entertaining the audience. You’ll be sitting there for 3 hours (wasting your time) watching what the director likes about oldHollywood/ classic movie-making (which you may or may not care about). The director twisted the reality in his own fantasy world and injected some ridiculousness into it. You’ll come out of the movie theatre with a weird/ bland taste in your mouth and realized that the past 3 hours left you no resolution, eureka nor epiphany. You’ll feel cheated.",
      "review_date": "2019-07-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Sets that transport the audience back in time. ++An interesting buddy relationship. +Long periods where not much is happening. --\nA little ultra violence. --\n\nI can't think of anyone I would recommend this movie to. I was bamboozled intoSets that transport the audience back in time. ++An interesting buddy relationship. +Long periods where not much is happening. --A little ultra violence. --I can't think of anyone I would recommend this movie to. I was bamboozled into seeing it myself. I've learned my lesson, I don't like Tarantino films.",
      "review_date": "2019-07-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ok, so I am way over 50 and that will without doubt eliminate me from any valid consideration by millennial observers of my review. Fine, don't care. Can't speak for final 30 min. because I walked out, however, just want to say this, becauseOk, so I am way over 50 and that will without doubt eliminate me from any valid consideration by millennial observers of my review. Fine, don't care. Can't speak for final 30 min. because I walked out, however, just want to say this, because it's important. No make believe here, Sharon Tate and Bruce lee were real life, caring and unique onto themselves flesh and blood human beings. What they weren't are empty props for Tarantino to render them one dimensional silly people. Sharon appears as some 10 year old none to bright star struck girl outside a movie theatre showing her 1968 film with Dean Martin. By the way, real life bulletin here. she came horribly near to drowning after a parachute jump went very wrong in one scene. She was traumatized by that and still toughed out the movie. That's the Sharon Tate I like to think about. Resolute, determined and one who made this world a little better place for those lucky enough to have known her. A woman of a lot more depth and character than Tarantino supplied her character with, for Damn sure. Bruce Lee? let's see, we have, in this genius martial arts legend, a man who revolutionized the dicipline and sport he mastered and even expanded on, with Jet Kun Do. What does Tarentino do with him? He has him tutoring a studio set cast on martial arts philosophies before lapsing into the reverse mentality by instigating a confrontation with Brad Pitt for no actual tangible cause except to act the bully show off. Ask anyone of his friends and students, all well published interviews over the decades, and they will tell you about this gross fake representation of his true personality. I won't waste time with the rest of the film. It was virtually painful to sit through. Was Decaprio channeling Doc Holliday or something with all the gratuitous spitting, hacking, red eye tearing, and constant over acting, thought for sure he was a congestive. (he's no Val Kilmer) Where did all that come from anyway ? who knows, why waste interminable amounts of time on empty dialogue, who knows? Was there a legitimate movie in there someplace? not that happened by me before catching the exit. Summation: Tarantino dishonored Sharon Tate and Bruce Lee. That is what really matters here. period.",
      "review_date": "2019-07-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The emperor has no clothes... that about sums up this movie. It’s too bad that such mega watt talent was wasted on a meandering and boring movie. I’m convinced this is a practical joke that Is being played on us all.",
      "review_date": "2019-07-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The only reasons to see Tarantino's latest movie are the really alive performance by Brad Pitt, the red Rottweiler Brandy and a scene where Margot Robbie, playing Sharon Tate, watches herself on the screen in a theatre and enjoying theThe only reasons to see Tarantino's latest movie are the really alive performance by Brad Pitt, the red Rottweiler Brandy and a scene where Margot Robbie, playing Sharon Tate, watches herself on the screen in a theatre and enjoying the audience's reaction plus it is always good seeing Al Pacino, even in a wasted role.As to be expected in a Tarantino's film there is a lot of very vivid violence, much distortion of history and facts and a lot of extraneous scenes that bring nothing to the film.I have always been a fan of Leonardo DiCaprio since \"What's Eating Gilbert Grape\" even in his lesser pictures but in this movie he is just bad and I put the blame on Tarantino's shoulders as director and screenplay writer. There are many cameos but none memorable or even remembered 5 minutes after you see them.The only reasons to see \"Once Upon A Time...In Hollywood\" are if you have 2 hours and 41 minutes of your life to waste and/or your electricity has gone out and this is the only theatre that has air conditioning!",
      "review_date": "2019-07-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It rambles and changes history for no real reason.It is painfully long with literally nothing to do, I saw more people looking at their phones.It was like being stuck in traffic in Hollywood for 3 hours.",
      "review_date": "2019-07-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Let's face it:  Quentin Tarantino is just about spent.  If this film had not been directed by a legend of cinema who has been making dazzling movies for almost three decades, no one would be as forgiving of two and a half hours of scene afterLet's face it:  Quentin Tarantino is just about spent.  If this film had not been directed by a legend of cinema who has been making dazzling movies for almost three decades, no one would be as forgiving of two and a half hours of scene after scene with nothing happening, conversation after conversation of weak, uninspired dialogue, and characters with no character arc.The plot line does little more than shoehorn the Manson family into a film about being a has-been who can't create the magic that he used to, which aptly parallels Tarantino's career over the last few years.  You almost wonder if he meant to write it that way, but it's hard to tell when it's bogged down with a million other little subplots that reveal nothing interesting and go nowhere.People want to keep loving Tarantino, but without his name, this film would not be getting the score it has.  Stop reviewing Pulp Fiction and review THIS film for what it is, not for what you imagined it would be before you walked into the movie theater.  Had it been made by a first-time director, this bloated snoozefest would have ruined their career.That said, I will add:  Margot Robbie did a great job of capturing the ghost of Sharon Tate.  And that dog was a really good dog.",
      "review_date": "2019-07-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Bland and uneventful, sometimes even dragged or built up to nothing, this seems a very nice exercise in style, or a testimony of the director love for the theme, or rather a sandbox for him to play at will. The screenplay left me baffled, andBland and uneventful, sometimes even dragged or built up to nothing, this seems a very nice exercise in style, or a testimony of the director love for the theme, or rather a sandbox for him to play at will. The screenplay left me baffled, and while it shines often for the way it is directed, the story itself has only a few highs and for the rest falls very flat to my eyes. Not my cup of tea, maybe somebody will love it, but the way it is directed, combined with its uneventfulness and uneven theme, bogged the viewing a lot. Acting is mostly spot on, but quirky at times, and not in a way that adds something. It’s a well directed movie, that suffers from a very flat atmosphere with a few flares and quirks here and there, which however don’t blend in well",
      "review_date": "2021-03-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Beautiful cinematography, a stellar cast and great soundtrack aren't enough to justify what is basically nigh on 3 hours of Tarantino indulging himself with his A list chums in a game of make believe inside a nostalgia laden trip to theBeautiful cinematography, a stellar cast and great soundtrack aren't enough to justify what is basically nigh on 3 hours of Tarantino indulging himself with his A list chums in a game of make believe inside a nostalgia laden trip to the 1960's hollywood.... Fascinating stuff none the less. Shame there is a gaping plot shaped hole in here!",
      "review_date": "2019-12-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Has Quentin Tarantino ever watched a bruce lee film or interview?  If so, i wish i could give this movie a negative rating.  Zero excuse for this trash",
      "review_date": "2020-09-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Was this the greatest movie ever made? No but it was a fun and interesting movie to watch. The lead actors were so good you could put them in any average movie and make it entertaining to watch. Leo and Brad are good on screen together.",
      "review_date": "2020-03-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "As expected which makes it a 10. The stars are stars. Quentin does his thing. Messing with history works.",
      "review_date": "2020-04-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nAnother fantastic movie by Tarantino. 2019 is really generous ,because there are many great films. This one isn`t exception. Stunning perfomances,striking plot and screenplay. This film is great ,not as Pulp Fiction ,but i think,that it`s stupid to compare these two films.So,reviews like Pulp Fiction was better must be deleted or not considered for movie rating.",
      "review_date": "2020-02-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was one of the first contacts I had with a Quentin Tarantino film. I always heard that he liked to use violence a lot in his films. When I knew the time when the film was going to happen and the historical context that would revolveThis was one of the first contacts I had with a Quentin Tarantino film. I always heard that he liked to use violence a lot in his films. When I knew the time when the film was going to happen and the historical context that would revolve around the film, I was very curious on how he would approach such a case. To be honest, the film is quite slow and I was not able to get so attached to the characters -- Except the dog Brandy. What interested me most was the end of the film. He surprised me positively for knowing how to use violence in a very intelligent way that made me vibrate and feel pleasant at the same time. It is strange for an extremely violent scene to make the viewer feel so good about it. Who doesn't know actress Sharon Tate and her story, do some research before seeing the movie. It will help a little to understand the ending and the homage behind some scenes.",
      "review_date": "2020-02-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Once again, Quentin Tarantino proves that altering facts can surprise viewers in a good way. The production design, cinematography and editing are flawless.",
      "review_date": "2019-12-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "To all these people who say \"I am a Tarantino fan but this movie sucks\":Tarantino is not about crystal clear plot and good vs evil or whatever you expect to see.\nThe unique side of QT movies are the vibe, camera, actors... its like aTo all these people who say \"I am a Tarantino fan but this movie sucks\":Tarantino is not about crystal clear plot and good vs evil or whatever you expect to see.The unique side of QT movies are the vibe, camera, actors... its like a theater ...I give this movie a solid 8 because the story wasn't exciting for me a regular person, maybe if I was an actor for 70s I would connect more, but as a person from the other side of the earth I enjoyed the vibe and actors. But yes, I expected more.",
      "review_date": "2020-07-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Okay, let's talk about Once Upon A Time In Hollywood, the ninth film in the career of the genius Quentin Tarantino and probably his penultimate. Here he brings a very interesting hollywood setting in the late 60's. Right at the beginning ofOkay, let's talk about Once Upon A Time In Hollywood, the ninth film in the career of the genius Quentin Tarantino and probably his penultimate. Here he brings a very interesting hollywood setting in the late 60's. Right at the beginning of the film you can already imagine what the story will be, as it portrays the murder of Sharon Tate, which shook everyone at the time. Quentin Tarantino's direction and script remain brilliant and extremely authoritative. We can not fail to mention the high point of this work, the performances, Leonardo DiCaprio is impeccable, Margot Robbie is fantastic, but who manages to surprise more is Brad Pitt, who probably did the best job of his career, I believe that Brad's only performance who can go head to head with this is his role in Inglorious Basterds. We also have a brief appearance by Al Pacino, which is a pleasant surprise. The soundtrack is very well done and one of the best of the year. To conclude, I believe that this is not the best film of Tarantino's career, films like Django Unchained, Pulp Fiction and Reservoir Dogs present more complete elements, but Once Upon A Time In Hollywood is an excellent work of direction, script, acting and soundtrack sonorous.",
      "review_date": "2020-02-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Really enjoyed this movie. LDC was amazing.  He deserves more credit and should win awards for his role. Loved the story. Loved BP as well. This was well written and directed.  Really fun to watch.",
      "review_date": "2020-01-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Just two of our great movies stars proving their charm and chops at every turn, plus Tarantino at the height of his powers even without much of a plot. Could hang out with these guys (who are total **** btw) in this beaitoful 1969 LA all day",
      "review_date": "2020-03-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "10/10 Definitely not for everyone. But I don't care. I love this movie.This slow-burn cruise through Hollywood in 1969 with our two fictional leads \"Rick Dalton\" and \"Cliff Booth\" will bore a lot of viewers but it's the historical context10/10 Definitely not for everyone. But I don't care. I love this movie.This slow-burn cruise through Hollywood in 1969 with our two fictional leads \"Rick Dalton\" and \"Cliff Booth\" will bore a lot of viewers but it's the historical context in which they are placed in by Mr. Tarantino that had me hooked. So much of the viewers experience with this film will hinder on the knowledge of the historical events and individuals who inspired it. Context is everything, and for \"Once Upon A Time in Hollywood\", it made for one of the most satisfying movies in the history of cinema.",
      "review_date": "2020-04-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I just don't get it, it didn't look or feel like a tarentino film. 2 hours of nonsense for a 20 min pay off. What a waste of time, if you enjoyed it great but it was painful to watch",
      "review_date": "2020-01-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Quentin's best film and yet (relatively) his most wholesome one too. A comfy slice of life tale about two friends just trying to break into the industry and find redemption. Amazing set design, cinematography, acting, etc. This movie is trulyQuentin's best film and yet (relatively) his most wholesome one too. A comfy slice of life tale about two friends just trying to break into the industry and find redemption. Amazing set design, cinematography, acting, etc. This movie is truly flawless.",
      "review_date": "2019-11-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nOUATIH isn't like any of Tarantino's other films at all. For one, the movie is more focused on setting than plot. However, OUATIH proves that a movie doesn't necessarily need to focus on plot in order to be good. It paints a vivid picture into life in Hollywood at the end of its Golden Age. Tarantino does well to capture the feel and atmosphere of the era, as well as to incorporate the various historical references into the movie.OUATIH isn't completely devoid of a storyline, though. At the center of the movie is the career of actor Rick Dalton, who's in the midst of a fight to remain relevant. Leonardo DiCaprio shines as Dalton, as does Brad Pitt as Dalton's friend and stunt double Cliff Booth.The best part of OUATIH is its ending, which contains the thrilling violence which Tarantino's films are known for. It also rewrites history (similar to Inglorious Bastards) in order to create a happier ending for some of the film's characters (though you'll need to be familiar with the Tate murders to understand the significance of the ending). While it isn't Tarantino's best movie, OUATIH is a compelling film and surely a must-watch.",
      "review_date": "2021-04-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Good .. better .. Tarantino. The film does everything you expect and want to see from the Tarantino master. Great soundtrack, great narrative structure (always nicely covered) and great actors.Brad Pitt and Leonardo DiCaprio play at theGood .. better .. Tarantino. The film does everything you expect and want to see from the Tarantino master. Great soundtrack, great narrative structure (always nicely covered) and great actors.Brad Pitt and Leonardo DiCaprio play at the very highest level. One point less for the simple reason that Pulp Fiction remains untouchable for me.Thanks Quentin for this # 9 film.",
      "review_date": "2020-12-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "'Once Upon a Time... in Hollywood' is a comedy-drama on which Quentin Tarantino worked as a film director and as a scriptwriter. The movie was released in 2019 and was well-received by critics. The movie starred Brad Pitt, Leonardo DiCaprio'Once Upon a Time... in Hollywood' is a comedy-drama on which Quentin Tarantino worked as a film director and as a scriptwriter. The movie was released in 2019 and was well-received by critics. The movie starred Brad Pitt, Leonardo DiCaprio and Margot Robbie.In my point of view, this movie needs to be watched at least because it mirrors the particular period of American history. It guides the audiences through the atmosphere of 1969. This movie raises acute questions that worry and cause a stir the minds of people nowadays too. Great acting and wonderful script unconditionally attract attention to this picture.'Once Upon a Time... in Hollywood' is a kind of a fairy tale about Sharon Tate's life, which have never come true in reality.Written by Anastasiia Shystovska",
      "review_date": "2021-01-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Nothing but the best from Tarantino in this mature apologist tribute to the Golden Age of Hollywood.",
      "review_date": "2021-02-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wasted 2,5 hour of life. A movie about people driving around. Just fast forward to the last 10 minutes.",
      "review_date": "2020-02-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There are three types of potential viewers for this movie; I've provided a review for each.1.  people who liked The English Patient - skip OUAT...IH; there is nothing here for you.2.  people are nostalgic about moviemaking and 60'sThere are three types of potential viewers for this movie; I've provided a review for each.1.  people who liked The English Patient - skip OUAT...IH; there is nothing here for you.2.  people are nostalgic about moviemaking and 60's Hollywood - watch all but the last 15 minutes.3.  huge fans of Tarentino - watch only the last 15 minutes; it has everything you love.",
      "review_date": "2020-02-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Practically a complete waste of 2.5 hours of my life. The movie lacked direction and seemed to meander on with no end and no point.",
      "review_date": "2020-01-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An already timeless movie which will only get better and more appreciated while time passes by.",
      "review_date": "2020-01-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is one of Tarantino's greatest films, and possibly his best. Enough said?",
      "review_date": "2020-02-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "this movie was amazing it had some amazing camera work and the story line was incredible i can see why some people didn't get this film for being a bit long but it is totally worth it in the end",
      "review_date": "2020-02-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Where to start with this one. Well, i've liked most of Tarantino movies from the past and always enjoyed smart dialog and fun over-the-top scenes. But this last installment is kinda disappointment - it lacks the stuff expected from Tarantino:Where to start with this one. Well, i've liked most of Tarantino movies from the past and always enjoyed smart dialog and fun over-the-top scenes. But this last installment is kinda disappointment - it lacks the stuff expected from Tarantino: to be actually entertained. Instead what is offered is 3h journey to the 1969 which was really well done, alas uneventful. Sure there are few Pitt scenes that stand out but those are it - rest of the film is like forced and mandatory 60s commercial. Tarantino brings all his childhood crushes and influences to the screen - Polanski, Bruce Lee, stuntmen, riding cool cars, moviemaking backstories and business, watching movies in cinema etc - lots of bowing to the past glory days. Actors performances are fine but fail against weak story. 4/10 and never watching it again, any of his previous films are far better.",
      "review_date": "2019-08-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Loved everything apart from the Kiwi he puts in a lot of movies, goofiest accent on the planet aside from female yorkshire,9 because I enjoyed most everything but unlike Godam dirty hippies I dont have time to watch such a long movie in oneLoved everything apart from the Kiwi he puts in a lot of movies, goofiest accent on the planet aside from female yorkshire,9 because I enjoyed most everything but unlike Godam dirty hippies I dont have time to watch such a long movie in one sitting, took me 3 days to finish but I looked forward to it every evening.",
      "review_date": "2019-11-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "While the acting is really good as to be expected, the story drags on for 2 hours and doesn’t get exciting until the very end.  Because the acting was good and it was directed by Tarantino I gave it a few stars higher then I would haveWhile the acting is really good as to be expected, the story drags on for 2 hours and doesn’t get exciting until the very end.  Because the acting was good and it was directed by Tarantino I gave it a few stars higher then I would have otherwise.  Don’t believe everything you hear about this movie being a masterpiece and all that...maybe if you like art house movies you will think it is, but if you are a fan of old school Tarantino films you will probably be disappointed.",
      "review_date": "2019-08-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's movie fun for movie lovers. The biggest downside would be its length. There is a lot of plot, and the story keeps going on and on. I think concentrating for so long can be tiring, since this isn't a mindless film you barely focus on.IIt's movie fun for movie lovers. The biggest downside would be its length. There is a lot of plot, and the story keeps going on and on. I think concentrating for so long can be tiring, since this isn't a mindless film you barely focus on.I guess for Tarantino lovers, the lack of gratuitous violence  (in most of the film) might be a disappointment. I just enjoyed it for what it is, the clever writing, the clever dialog, the ever-so-human characters and their weaknesses (except for creepy 40 year old in an 8 year old body.)Perfect? Nope. Ground-breaking? Nope. Several hours of joy for movie lovers? Yes.",
      "review_date": "2019-11-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Loved it, one of my favorite tarantino films so far. He went all out on this one. The cinematography is stunning, the story compelling as well as absurdistic, but always interesting. A very tasty cocktail of genres mixed with a pinch ofLoved it, one of my favorite tarantino films so far. He went all out on this one. The cinematography is stunning, the story compelling as well as absurdistic, but always interesting. A very tasty cocktail of genres mixed with a pinch of mulholland drive, complemented with a lot of 60's and 70's influences. Definetely rewatching this one.",
      "review_date": "2019-11-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Much slower and more laidback then Tarantino's usual flicks but not in a bad way. Has a lot of heart, and features one of the damn coolest characters in Tarantino's career (which has a lot of cool characters).",
      "review_date": "2019-11-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "nce Upon Time In Hollywood is directed by Quentin Tarantino and starts Leonardo DiCaprio and Brad Pitt, i was very excited for this film, first because it's a Tarantino movie, and second because of the cast, you Have DiCaprio, Brad Pitt andnce Upon Time In Hollywood is directed by Quentin Tarantino and starts Leonardo DiCaprio and Brad Pitt, i was very excited for this film, first because it's a Tarantino movie, and second because of the cast, you Have DiCaprio, Brad Pitt and Margot Robbie, Once you see a movie with this cast and crew , your expectation are astronomically high, Can they deliver ? is it a revolutionary film from a narrative standpoint ? I think not, but does it capture everything Tarantino was going for , Yes it does, I really liked this film, i think it's very similar to Tarantino's Jackie Brown in nature and structure. it's a movie about friendship and it's very funny i didn't expect that from this movie but it worked pretty well and thats also because of how Leo and Pitt nailed their roles, you can see DiCaprio's emotional breakdown and feel it, and he was great and really owned this character, as for Brad Pitt i can say it's my favorite character from this film , he pretty much has the best lines and the best scenes, Margot Robbie as Sharon tate, even if she was not given the biggest part in this movie, but she did good the movie is filled with long scenes that gave an advantage to the actors to really shine,the production design is Phenomenal, you can feel the 60's vibes, the sets and the Hollwood Boulevard are beautifull, the movie it's not about one think, its feels like a collection of moments beautifully directed and very well written and thats exactly what i think of this movie and thats what i liked about it, things i had an issue with is the second act, sometimes a scene could've been shorten but they took a little bit long and sometimes the narrative loses itself but it fixes itself the next scene,i really loved the first and third act, they are GREAT, my major problems is within the second Act that lacks a bit of tension, if you like Tarantino's style of directing and cinematic movie that relies on characters and the performances you're gonna probably enjoy this film.",
      "review_date": "2019-09-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Once Upon A Time In Hollywood is a trip, filled with Tarantino's trademarks but this time it comes in a subtle way, beautifully delivered by two powerhouse leads with so much flair and talent it's almost overkill, but that's Tarantino forOnce Upon A Time In Hollywood is a trip, filled with Tarantino's trademarks but this time it comes in a subtle way, beautifully delivered by two powerhouse leads with so much flair and talent it's almost overkill, but that's Tarantino for you, he was never one for the easy and predictable.We are treated to a delicious timepiece so rich in details and excitement, the story goes back to the golden days of Hollywood when actors were idols in every sense of the word, the story itself goes down different paths that all link up at the end in a spectacular manner worthy of the Tarantino's violent ways, and boy was it fun to watch. The two leads, Decaprio and Pitt bring unparalleled charisma to the table, I'll tell you this, it is almost impossible to take your eyes off the screen when they're on, they just possess enough to grip you throughout the film, they capture the true old Hollywood charm so perfectly.In all honesty, I truly believe that this film wasn't meant to be explained but rather enjoyed and I did just that, Tarantino with a twist but I like it.",
      "review_date": "2019-11-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best movies of the year, it offers a view of the 60's and 70's Hollywood. Leonardo Dicaprio delivered a nice performance. Also nostalgic because it makes you think about the Charles Manson case and the fate the victims thatOne of the best movies of the year, it offers a view of the 60's and 70's Hollywood. Leonardo Dicaprio delivered a nice performance. Also nostalgic because it makes you think about the Charles Manson case and the fate the victims that horrible night. I would have liked if the movie was more accurate at the ending, but  I also respect this version because this is something that why all have desired to happen",
      "review_date": "2019-11-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Worship the feetThere is too many damn foot shots from different angles and it doesn't have any thing related to movie and it's just Tarantino's feet fetish problemThe other thing is that none of characters is actually a character they areWorship the feetThere is too many damn foot shots from different angles and it doesn't have any thing related to movie and it's just Tarantino's feet fetish problemThe other thing is that none of characters is actually a character they are like dead pictures no storyIn one word it's just some unrelated phoney shots gathered together by a phoney\"director\"",
      "review_date": "2019-12-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI was watching Wim Wender's \"Paris Texas\" at home when I decided, this movie is great but verrrrrry slowwwww; Like listening to really great sunday morning music, there is a time and a place. On this particular evening I wanted some visual rock and roll; What better that going to see Mr. Tarantino's latest film \"Once Upon a Time...\", I did not want to spoil it so no trailers/no reviews. Well I was set up, as this film is Mr. Tarantino's exploration of slow banter,space, and time... unfortunately I had no idea, after giving him an hour and a half of my patience, I walked out. SUMMARY: cheeky cool guys, nerdy 60s grown-up, slow witty banter, slow cheeky dialogue, drive here and there in a very cool white Cadillac Coup DeVille, hot hippy girls, one guys rich sad, one guys broke but confident, an homage to the\"no-jackie-chan bollocks\" viral video with Bruce lee as the but of the joke, famous douche couple, some scorn reject, some hippies, clearly more unneeded ink about the Manson clan, and WALK OUT",
      "review_date": "2019-09-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Tarantino's use of shock value needs to be checked. While some historical events with a director's own spin can be interesting, \"Once Upon a Time...\" Is nothing more than an over expensive 2.5 hour 70's homage christened with 10 minutes ofTarantino's use of shock value needs to be checked. While some historical events with a director's own spin can be interesting, \"Once Upon a Time...\" Is nothing more than an over expensive 2.5 hour 70's homage christened with 10 minutes of creative spin on a historic event That being said, Rick Dalton's career serves as a perfect parallel to Tarantino's career.",
      "review_date": "2019-12-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI wanted this film to be a masterpiece. I expected it to be. An hour and 15 minutes into this overly hyped pile of crap, I did something I had never done before in a theater. I looked at my watch. It goes nowhere . There is NO personal connection with any of these characters. And why should there be... a washed up   vain, self-centered lead character(played by L.D.) and his very odd relationship with his stuntman(played by B.P.) Ms. Robbie play an a bit movie actress named Sharon Tate(shouldn't have to spoil this one). And WTF is up with Q.T.'s obsession with bare feet. Prominently on display more than ever . The least he could have done is have the actress wash her feet. Instead ... BAM...dirty toejam is trusted right in your face. All in all , I give it a 3 , with B.P.,,'s performance elevating it from a 1. Be warned...Its 2 1/2 hours of ho-hum boredom until the last 15 minutes.",
      "review_date": "2019-12-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Loved this. Favorite movie of the year.  Alternative history down fun with great sounds, shots, timing and acting.",
      "review_date": "2021-03-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "QT's supposed swan-song is probably the only Tarantino I would give a solid as heck 10. I told myself I'd keep it brief on this one, but gosh there's just too much good things to say.  For one, it's one of only two QT films (the other beingQT's supposed swan-song is probably the only Tarantino I would give a solid as heck 10. I told myself I'd keep it brief on this one, but gosh there's just too much good things to say.  For one, it's one of only two QT films (the other being Jackie Brown) that put an emphasis on compassion. As a whole, and within the relationships of characters.  Especially that of the relationship between Leo and Brad. Pitt finding probably the most hand-in-glove character since Se7en. Great homage to QTs truest love, which is Hollywood, set against the backdrop of Cielo Drive circa 69.  - We know how much Tarantino loves to break rules in the best way possible, and he does not fail again on this one.  A great sub-tribute to Sharon Tate as well. And why does it seem that these Tarantino films are the only things that really work for Kurt Russell anymore. Either way, great ensemble cast, including Russell, great likenesses to all the old stars.  This film is really one of a kind and atypical of Tarantino in the most heartwarming and memorable ways. If you're looking for Kill Bill Vol 1 or Deathproof, you may be knocking on the wrong door. This film has a big heart, even with the usual hyper-violent tendencies. With that said, ONE OF THE BEST OF THE YEAR, and possibly Tarantino's best. An magnum-opus, a love letter, a historical document. It serves so many things. Way to go QT!",
      "review_date": "2019-12-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nPositives:1. The cinematography-- classic Tarantino. If you're a big fan of his previous works, you'll definitely like how he handled the cinematography.2. The acting, particularly DiCaprio's. In my opinion, he'll be nominated for another Oscar for this role.3. The music. Make no mistake, the music used for this movie could not be any better. 60's vibes all the way.4. The writing. Especially the script. The story was a bit dragging, but the script adds color to every scene, no matter who's dialogue it is.Negatives:1. Length. The movie is quite long and it could be dragging sometimes, especially in some scenes. Not all, but some. Some scenes are quite unnecessary, and only adds to the length, not the story. 2. Brad Pitt was not well-utilized for my liking. Sure, he had his moments in this film, particularly during the climax part, but not enough.",
      "review_date": "2019-12-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Excellent movie. Perfect release of the past of Hollywood in screen. Very smart way of writing fron Tarantino for both actor's, Di Caprio and Brad Pitt.",
      "review_date": "2019-12-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Oh dear! what was that?I cant believe I spent a couple of hours with this film, did I expect too much and was I therefor dissapointed, or what happened ??? I would not call it a film , more a fragment puzzled together ,with famous actors,Oh dear! what was that?I cant believe I spent a couple of hours with this film, did I expect too much and was I therefor dissapointed, or what happened ??? I would not call it a film , more a fragment puzzled together ,with famous actors, whos acting is amazing but true wasted talent for this film, (this script)  we could take a little glimpse into the old westernfilmera,(and the intended humor, which didnt make me laugh though)  the hippytime, the spirit of the 60 , ok...but its all mashed up and not making sense for its intended own form...mixed with real Hollywoodera then, but more valuable to watch for filmgoofs and Hollywoodinsiders,    before I wrote its a **** movie for me, but as I know how much hard work its to put it all together and to create, I would say, i really really dont like this QT composition of a film :) dissapointing, I couldnt figure out any storyline , nor a plot, nor developing characters, and was this film edited so strong that it lost some valuable scenes?, and you need a looooot of patience for the western scenes, only bearable because of leo, but still, need a hell lot of patience for this sloooowness of the film, (as we are in 3 dimensions living now, maybe I couldnt figure this one out :) )  I loved the costumes and the camera, buut the editing was confusing sometime, aaaand (I must say i liked the end), towards the end as if QT awakened from a long long sleep, we saw his famous signature at last, I liked the idea of changing the past by changing the ending in this film from the real happening ,with the twisted change of the real happened past of then ,  for none \"Insiders\" it could be terribly boring,  but all in one I must say, If you want to get a nap or to walk outa cinema with a dull , tired dissapointed feeling, go out and watch it, you can earn the money back youve spent for this film, but not your time. Peace & Light",
      "review_date": "2019-08-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Tarantino's brilliantly written and fascinating look at the 1960's era of Hollywood. Once Upon a Time in Hollywood includes great performances from Brad Pitt & Leonardo DiCaprio, who are accompanied by a hilarious and meticulously writtenTarantino's brilliantly written and fascinating look at the 1960's era of Hollywood. Once Upon a Time in Hollywood includes great performances from Brad Pitt & Leonardo DiCaprio, who are accompanied by a hilarious and meticulously written script. Tarantino's direction is as one would expect from a director of his caliber, and his flair is evident throughout the film. The set design is stupendous and the details that Tarantino focuses on are ridiculously well crafted and thought out. This film's soundtrack is equally as mesmerizing and adds to the experience as a whole. While not for everyone, this movie is a well-written and acted love letter to the 60s that needs to be experienced at least once.",
      "review_date": "2019-10-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best movie of 2019. More detailed review coming soon. By far, Tarantino's best film. I think this may be my favorite Leo film. Cliff Booth and Brandy ftw",
      "review_date": "2019-12-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "absolutely a wonderful movie experience. not a cookie cutter hollywood action film like every other movie out there. hes the man",
      "review_date": "2019-11-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Plotting of the scene were fabulous, Climax of the movie was so good.... Both Leonardo and brad did great job and the dog was outstanding...",
      "review_date": "2019-12-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nOnce Upon time in Hollywood is the best movie of 2019, it´s the movie of anyone tired of watching marvel would like.With very well developed characters, an attractive environment, and great performances",
      "review_date": "2019-09-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nOnce Upon A Time In Hollywood is a true masterpiece. I have never seen a better movie than this. Dialogues, story, characters, and cinematography are insane. I would say it's an instant classic. Beautiful movie!",
      "review_date": "2019-09-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very slow, meandering, and pointless a lot like real life. But the ending of the film is what makes it all worthwhile. 3 days later I'm still thinking about Rick and CLiff and wondering how their real-world lives would have turned out.",
      "review_date": "2019-07-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A wonderful movie, I hope that Mr. Quentin can win the Oscar for best director, to fully appreciate it, it is advisable to see it more than twice, this movie uses the base of the characters as his pillar, above the story, the scenes by carA wonderful movie, I hope that Mr. Quentin can win the Oscar for best director, to fully appreciate it, it is advisable to see it more than twice, this movie uses the base of the characters as his pillar, above the story, the scenes by car they are memorable, scenes like this are no longer seen in today's cinema.",
      "review_date": "2019-09-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Once Upon A Time…In Hollywood is one thing and one thing only; Quentin Tarantino’s beautifully crafted dreamy love letter to cinema!With his newest feature, the current master of cinema’s vision reminds us why movies are cool again. For theOnce Upon A Time…In Hollywood is one thing and one thing only; Quentin Tarantino’s beautifully crafted dreamy love letter to cinema!With his newest feature, the current master of cinema’s vision reminds us why movies are cool again. For the first time, in a long time, there’s a film that begs to be seen, not in the comfort of your own home, not on your Netflix cue on an airplane, but in front of a silver screen, with an audience and you damn right…some popcorn. Once Upon A Time is less a film and more an experience; one where the bustling hot summer days are corrected by the high intensity air conditioning of the multiplexes; one where the theatres are a safe haven for summer love and first kisses, an experience where going to the movies is as magical as popping your cherry. That’s what a Tarantino film is like; just like when I first went to go see his Grindhouse experience for the first time, Tarantino is a visionary old soul, hell bent on sharing his memorable cinematic experiences of his past, with us today. If you are a cinephile and don’t know about Quentin Tarantino’s work, most, if not all people will tell you that you should just quit now, but I digress. Tarantino worked at a blockbuster in Hollywood, California in his early years, consuming as much cinema as possible. One of his most revered quotes to date about film is his famous line that  “When people asked me if I went to film school I tell them no. I went to films”. Funny enough, this quote captures the essence of Tarantino and his canon; an individual who entered the world of cinema out of the sheer love of watching films, just like myself.As an artist myself and lover of film, I never went to film school also. Hopefully, as someone who would eventually love to make their own films one day, I feel that this is one of the many reasons why I admire, as well as, so heavily identify with Tarantino. I also learned about films by watching them. Just like myself, the influence in Tarantino films is wide ranging. His largest inspirations draws from the New Wave Gangster pictures of France, crafted by the likes of Jean Pierre Melville, Francois Truffaut and Jean-Luc Godard. All of the names listed are absolute giants in celluloid and contributed in my opinion the most to modern cinema that features, as Godard would say, “A girl and a gun”. According to Godard, that is pretty much all that is necessary to making a good motion picture. Other notable Influences on Tarantino would be essentially any film from the 1970’s because that is the era when he began to understand and study cinema, an era of films by Don Siegel, Sergio Leone and George Roy Hill.Yet while many are quick to label QT as a scam artist and artistic thief, I feel like it is my duty to rectify that notion. Before continuing on, it has to be said that art copies art, inspiration inspires and according to Mark Twain, there is no such thing as originality, only levels of authenticity. Therefore, it is my extreme pleasure to introduce and name QT a master of authenticity for his cinema. Just like when Sergio Leone remade a Kurosawa picture and developed it into the Dollars trilogy, or when Christopher Nolan gave his interpretation of the Dark Knight recently, or when Martin Scorsese won his first Oscar for remaking a Japanese film and later naming it The Departed, art is not our subject, WE are its subject. Once Upon A Time…In Hollywood is the iconic director’s masterful indulgence in everything that he loves about movies and everything we should love, too! Aside from Taratino, Once Upon A Time…In Hollywood isn’t just one man’s magnum opus, but a collection of so many talented artists, starting with its cast. The film opens with Leonardo DiCaprio and Brad Pitt going for a cruise to a watering hole. Dicaprio stars as Rick Dalton, a good ole’ boy from Missouri who drinks for hydration and smokes for oxygen. Once the leading man in television and film, appearing in western serials, one aptly titled Bounty Law, Dalton is on the tail end of his acting career. The Midwestern-American cowboy style Dalton knew all too well, is being suffocated and changed, no thanks to the foreign influenced, free-loving hippie movement. While DiCaprio’s Dalton emits a certain swagger that charms many, the audience comes to realize that this ‘swagger’ is less a personality trait and more a clearly stubborn, unchangeable style and resilience to the conforming of the times around him. According to Rick, Rick Dalton is still big; it’s the pictures that just got small. While it may be hard to argue this notion, DiCaprio’s riotous as the comedic force of the film. Blending well with Tarantino’s signature writing style for a second time, DiCaprio’s Dalton stutters, stammers and then collectively pulls himself together in front of a camera.",
      "review_date": "2019-09-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Outstanding in every aspect, exceeded my expectations which were kinda low after Hateful Eight, which is, in my opinion, Tarantino's worst work.",
      "review_date": "2019-09-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "While filmed with great care, acted with fantastic results (from Pitt and especially DiCaprio), and features a very fun (albeit controversial) ending, Once Upon a Time in Hollywood is a very mixed bag for the historically successfulWhile filmed with great care, acted with fantastic results (from Pitt and especially DiCaprio), and features a very fun (albeit controversial) ending, Once Upon a Time in Hollywood is a very mixed bag for the historically successful Tarantino. First off, its themes contrasting the glitz and glamor with the squalor and instability of Los Angeles have been done to death, although the character exploration of DiCaprio's Rick Dalton is pretty great. Furthermore, the film has no sense of direction, as the film goes from place to place with little flow or moments of impact usually found in Tarantino's films, making the overall film feel uneventful and boring. Finally, and most glaringly of all, Tarantino is at his most self-indulgent in this film. The film/actor nods, in-jokes, and references are solely done to serve his own ego and admiration of vintage Hollywood. The extremely stretched out dialogue and pointless scenes serve to be solely stroke his ego and throw ineffective character moments at the audience. This adds up to a painful 2 hour 40 minute run time that feels like it could've been cut down to 2 hours at least if not even shorter. These three problems among others amount to a film that wanes in comparison to the rest of Tarantino's masterpieces.",
      "review_date": "2019-08-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nA total disappointment for a QT fan...The movie has a VERY thin plot. Margot's story arc (if you can call it that) didn't advance or contribute to the plot in any way and could easily be left out. The same goes for the most of Brad's, although his character has one or two scenes which contribute to the overal narrative. The most interesting was the story of the aging actor played by leo. In between you see a lot of filler material nodding to the hollywood of the 60's, which in of itself are setting the tone for the movie, but they happen way too often and are incredibly lengthy. I am talking about 10 - 15 minutes here.Aside from Leo's character, none of the characters develop in any way. The actions taking place in their lives have no significant impact on them whatsoever. For example, Margot is just there to be pretty, parties in every scene and barely has 10 lines of text. Brad is just driving around in his car beating up people. He supposedly killed his wife and got away with it, but apart from a small flashback, where you don't even see the murder!, it is not explained how this has affected him. A huge missed opportunity in my opinion. It could have given his character way more depth. As stated above, the exception is leo and his portayal of Rick Dalton. Rick ´s undergoes some significant chances throughout the movie which affect his actions. The acting by Leo and Brad ist excellent, but these professionals alone can't save these poorly written characters. The dialogues are good as always, but it all seems so meaningless.And so, the movie drags on and on for about 2 hours and 15 minutes until finally QT decides it is time for his signature filmmaking and storytelling. However! When things finally do get violent it feels extremely out of place considering the rest of the movie and the final scene with the three goons from the manson family is laughable and an extreme mess.All in all it didn't like this movie and can't recommend it to anyone. While Leo and Brad's acting was very good, the weak character building and plot in combination with the overly long filler material made me want to leave halfway through. I somehow managed to stick around, but at the end of the movie I wish that I had not. It was a total waste of time and money.",
      "review_date": "2019-09-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "When this was initially released, my gut instincts told me not to waste my time. However, with all of the awards buzz it's been receiving, I decided to give it a look on DVD, after which I realized my initial reaction was right: AbsoluteWhen this was initially released, my gut instincts told me not to waste my time. However, with all of the awards buzz it's been receiving, I decided to give it a look on DVD, after which I realized my initial reaction was right: Absolute utter garbage, overrated in virtually every respect (except, perhaps, for Leonardo DiCaprio's fine lead performance). What praise is there to be given for two dragged-out hours of boring, tedious, mundane activity, followed by a gratuitously grotesque conclusion that's supposed to be...funny? My only takeaway from this is that Quentin Tarantino may be a master of nostalgia in his authentic re-creation of past pop culture but little else, which, frankly, makes me wonder, \"who cares?\" The director has hinted that his next picture will be his last; let's hope he keeps his word.",
      "review_date": "2019-12-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I broke down last night and watched the film to see what everybody is talking about.  I cannot believe this movie has earned so much praise.  It is absolutely horrid, disjointed, painfully boring.  Films that wink at themselves are the mostI broke down last night and watched the film to see what everybody is talking about.  I cannot believe this movie has earned so much praise.  It is absolutely horrid, disjointed, painfully boring.  Films that wink at themselves are the most egregious and so amateur.   This film winks at itself, with the background period radio track to the period products highlighted.  The film, and, the acting, sadly having to repeat the poorly written script, it's just so stupid and a waste of 2.5 hours.",
      "review_date": "2020-01-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great cast, a great altered story of what happened back then, great climate, great music, cool characters. One of my favorite movies, to be honest.",
      "review_date": "2020-12-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Even though I thought Sharon Tate didn't really do much in the movie, everything else was amazing from the characters to the atmosphere and the acting.",
      "review_date": "2021-04-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Really great movie, the setting of this movie is spectacular because I actually thought this was actually in the 1970's cinematography in this film is spot on. Great movie great cast loved it qieutin tarentino did not disappoint me Loved theReally great movie, the setting of this movie is spectacular because I actually thought this was actually in the 1970's cinematography in this film is spot on. Great movie great cast loved it qieutin tarentino did not disappoint me Loved the music its great 9/10 definitely watch again.",
      "review_date": "2021-05-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nWhile this movie has great cast, great scenes and setting of Hollywood in those years and depicts well how an actor's life could be then plus can feel Tarantino vibes, this movie still is quite weak plot wise - most of the movie nothing really happens just shows random stuff. Yes you can say it shows how it is for actor to do his work, but overall there are too many filler shots of like Brad Pitt randomly driving around etc. The most interesting topic about Manson murders etc is covered only a bit. Basically the last half hour is really great but the rest is lacking. One of the worst Tarantino movies for me and I like all of his movies.",
      "review_date": "2019-12-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Once upon a time in Hollywood \"10/10Wow, another genius movie from Tarantino!spoiler alert: Watch the WHOLE movie to understand !",
      "review_date": "2021-12-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nMan, I'm a big Tarantino fan and this was a stinker!  Never mind rewriting history, which was bad enough but how about a bit of rewriting in the script, or some editing?  Lumbering, clanking, overwrought and downright weirdly flat. Anyone else writing this script would never have got past the first reader and anyone else directing it would have been excoriated.  Leo and Brad were great and seeing all my favorite olde time Hollwdood haunts kinda fun but what was the point?  A Hollywood \"down memory lane\" trip?  Those places weren't integral to the plot and just appear for seconds.  Casa Vega, El Coyote?  Porque??  I can't believe I managed to sit through the whole thing. Really?  You're going to rewrite the Manson story so folks under 30 will think this is what actually happened?  Ak.",
      "review_date": "2020-01-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It’s a Tarantino movie so get ready. And the acting alone is worth seeing the movie. Leonardo amazes me every time, he’s such a fantastic actor! This movie won’t be everyone’s cup of tea, but its entertaining.",
      "review_date": "2022-02-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Nicely shot but pointless. There're some interesting scenes but no narrative to hold them together. The story (if there's one) plods aimlessly and interest rises and falls too much. I forced myself to watch the whole thing even though thereNicely shot but pointless. There're some interesting scenes but no narrative to hold them together. The story (if there's one) plods aimlessly and interest rises and falls too much. I forced myself to watch the whole thing even though there were times I wanted to pull my hair out. Worst of all, this movie is over 2 1/2 hours long for no good reason. And, I'm getting sick of Tarantino's wordy dialogue. Everybody in his movies sound the same.",
      "review_date": "2019-12-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's not the best movie from Tarantino. Maybe I don't understand what to enjoy here as it is very long with only 3-4 scenes that are fun and interesting. The rest is very slow and drags a lot. Especially in the beginning, you watch 30 min andIt's not the best movie from Tarantino. Maybe I don't understand what to enjoy here as it is very long with only 3-4 scenes that are fun and interesting. The rest is very slow and drags a lot. Especially in the beginning, you watch 30 min and it feels like an hour. Nothing was happening.  I liked the idea of \"movie being made in the movie\". But this is not a new concept. What was the reason for Margharet Robbie's character? What a wasted opportunity to have more scenes with her and tie up with main 2 characters. Narrated parts were not needed in my opinion either. I don't know what to feel, movie needs to be not boring to be fun, this is boring....until last 10 min, which was insane. But that does not save the movie.",
      "review_date": "2021-08-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie was odd and difficult to follow, with flashbacks and no discernible plot.  I kept watching in vain hope of perceiving a story line about which I could care.  The characters were dysfunctional and generally unpleasant.  The dialogueThe movie was odd and difficult to follow, with flashbacks and no discernible plot.  I kept watching in vain hope of perceiving a story line about which I could care.  The characters were dysfunctional and generally unpleasant.  The dialogue was laden with gratuitous obscenities.  The movie was obviously made for Hollywood about Hollywood by Hollywood, and so I am sure the denizens of that synthetic world believe Tarantino has created an artistic triumph.  It was a long, drawn-out self-indulgent waste of a Saturday evening.",
      "review_date": "2020-02-15",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 162,
  "genres": [
    "Drama",
    "History",
    "Mystery",
    "Thriller",
    "Comedy",
    "Crime"
  ]
}