{
    "title": "Toy Story 4",
    "rating": 7.8,
    "release_date": "2019-06-21",
    "genre": [
        "Adventure",
        "Fantasy",
        "Comedy",
        "Animation",
        "Family"
    ],
    "summary": "Woody has always been confident about his place in the world, and that his priority is taking care of his kid, whether that’s Andy or Bonnie. So when Bonnie’s beloved new craft-project-turned-toy, Forky, declares himself as “trash” and not a toy, Woody takes it upon himself to show Forky why he should embrace being a toy. But when BonnieWoody has always been confident about his place in the world, and that his priority is taking care of his kid, whether that’s Andy or Bonnie. So when Bonnie’s beloved new craft-project-turned-toy, Forky, declares himself as “trash” and not a toy, Woody takes it upon himself to show Forky why he should embrace being a toy. But when Bonnie takes the whole gang on her family’s road trip excursion, Woody ends up on an unexpected detour that includes a reunion with his long-lost friend Bo Peep. After years of being on her own, Bo’s adventurous spirit and life on the road belie her delicate porcelain exterior. As Woody and Bo realize they’re worlds apart when it comes to life as a toy, they soon come to find that’s the least of their worries.… Expand",
    "critic_reviews": [
        "This franchise has demonstrated an impressive ability to beat the odds and reinvent itself, over a span of time long enough for two generations to grow up in. It's a toy store of ideas, with new wonders in every aisle.",
        "A hugely entertaining and emotionally resonant pleasure for audiences of all ages.",
        "A diverting, visually dazzling concoction of wily schemes and daring adventures, Toy Story 4 achieves that something that eludes most sequels, especially this far into a series: a near-perfect balance between familiarity and novelty, action and emotion, and joyful hellos and more bittersweet goodbyes.",
        "What is the meaning of life? When that question is posited in a deeply moving post-credits scene, the answer is like the film you just watched: incredibly funny and devastatingly true.",
        "Toy Story 4 delivers a cinematic grand slam, a nine-years-later sequel that's wholly equal to the high expectations raised by the terrific trio that it follows. Touching, raucously funny, adventurous and yes, even profound, Pixar's signature property once again touches them all.",
        "Cooley bursts out of the gate in his directorial debut with high energy, tight storytelling, a rousing adventure, laugh out loud comedy, charming new characters, and most importantly, a tender, and dare I say personal, core.",
        "The fourth entry is a worthy addition to the Toy Story library, bringing back some of the most beloved characters in the history of animated film and introducing us to a fantastically entertaining new bunch of toys — some of them adorable and huggable, some of them more reminiscent of a certain type of creepy, old-school doll usually seen in R-rated horror films.",
        "Toy Story 4 reaffirms that Pixar, at their best, are like no other animation studio around.",
        "Pixar could easily retire this series with a clean sweep of films that have been lovely to look at and moving and funny to watch. But if they can maintain this level of wonderful, keep ‘em coming.",
        "Pixar Animation delivers another hilarious yet also deeply moving chapter in their blockbuster franchise.",
        "The first thing to note about Toy Story 4 is that it is extremely funny: I’d argue it’s the most consistently comedic of the entire series",
        "Toy Story 4 was somehow baked to perfection.",
        "It doesn’t put you through the emotional wringer the way its predecessor did, but it’s consistently inventive, funny, witty, and heartfelt. In other words, it’s a lot better than it has any right to be. It’s more than good enough to justify its existence.",
        "The focus on Woody means that Toy Story 4 is less of a metaphor about the things we leave behind as we leave childhood, which means emotionally it's the lightest of the series.  That may mean fewer hankies for those of us sitting together in the dark falling in love all over again with a box of animated toys.  But the sweetness persists.",
        "Toy Story 4 works overtime to find the humanity in all its characters, even the scary ones, despite the fact that it exists in a world of sentient toys and anthropomorphic garbage. That is not only endearingly sweet, but kind of wild.",
        "As Cooley’s film quickens and deepens, we get a fabulous running joke about the “inner voice,” a staple of American self-will since the days of Emerson.",
        "As Woody struggles to resolve his fears and feelings, Toy Story 4 transcends toydom. It feels exquisitely alive.",
        "For a series that began nearly 25 years ago, this classic in the making couldn’t go out on a more fitting note of tender, tear-drenched resolution.",
        "It bounces along at such an antic pace that its 100 minutes feel like far fewer. But there’s a quiet contemplativeness at the movie’s heart, exemplified by a long scene in which Woody and Forky make their way along the shoulder of a highway, plastic hand in pipe-cleaner hand, discussing the meaning of life as a plaything.",
        "The film never quite lets us know what to feel. It’s an unnerving little movie, one that at any given moment might deliver a burst of feeling, or a big laugh, or a jump scare. It whipsaws you this way and that, and this sense of disorientation is new for a company whose work usually feels so carefully calibrated, so perfectly put-together.",
        "\"Toy Story\" ushered in the era of computer-animated cartoon features, and the fourth movie wraps up the saga beautifully. At least, for now.",
        "Gorgeous, absolutely charming.",
        "The film surprises with the amount of genuine emotion it generates with its focus on love, loyalty and what matters most in life, to humans as well as toys.",
        "Ultimately, what gives Toy Story 4 genuine heft is that it's a tale of second chances and characters who take advantage of them. Like its predecessors, the film is rambunctious, noisy, genial, unpretentious, action-packed and old-fashioned in a very good way.",
        "Like the toys of a child now-grown, or an antique lamp gathering dust on a shelf, “Toy Story 4” isn’t needed. But it is, for many of us, very much wanted: one last adventure, one last chance to say goodbye.",
        "While we all, as moviegoers, experience franchise and sequel fatigue on our own unpredictable timetables, this film brightens the summer without simply going through the motions.",
        "I’m all for the studio exploring new concepts and original characters going forward, and setting aside the endless anthologizing of its biggest hits for a good long while. But if I had to get another Toy Story, this is about as strange and beguiling an entry as I could have hoped for.",
        "Toy Story 4 not only delivers plenty of gonzo-funny moments and genuine thrills, but also interrogates and complicates the series’s core themes.",
        "You know the formula and frankly, it’s one of the best-working ones Hollywood still has: a fun-for-the-whole-family film. In a current market crowded with franchises and pricey theatrics, Toy Story 4 feels like a warm and welcome aside, spinning an epic yarn from an intimate vantage with all the amenities of Pixar’s supremely talented creators and animators.",
        "To talk about Toy Story 4 is to talk about Forky. This is a movie that doesn’t initially appear to have any compelling reason to exist — the forced but satisfying third installment of Pixar’s signature franchise seemed to wrap things up when it came out almost a full decade ago — and yet Forky alone is enough to elevate this potential cash-grab into the beautiful and hilarious coda that its long-running series needed to be truly complete. Forky is the hero we need in 2019.",
        "Woody and Buzz et al are still wonderful creations, and time spent in their company is rarely wasted. But riffs about new owner Bonnie starting kindergarten and once-favoured toys getting left in the cupboard smack of old ground being retrodden.",
        "While the film rarely approaches the existential gut punch of Toy Story 3’s conclusion, the various answers each of our heroes arrive at are among the most moving of the quartet.",
        "Beauty aside, Toy Story 4 captures the heart of the entire saga in its own way.",
        "Let’s call it a perfectly acceptable work of superfluousness.",
        "Making his feature debut after directing a couple of Pixar shorts and co-writing Inside Out, Josh Cooley proves there’s life beyond the trilogy.",
        "This fourth Toy Story isn’t as essential as the previous films in the series, but there’s no denying the joy of seeing Woody and friends back in action, while once again it’ll likely leave you with a tear in your eye.",
        "This sequel may not be as buoyant as previous chapters, but the filmmakers’ continued commitment to honouring these characters — and to understanding what is so universal about their quest to love and be loved — is worth treasuring.",
        "Occasionally too busy and loose with its logical rigor, Toy Story 4 doesn’t quite connect all the dots. Still, the film earns a distinct spot in the chain, foregrounding Bob Pauley’s pristinely lit production design, one that showcases a kaleidoscopic carnival and a dusty antique shop swarming with hilariously nightmarish ventriloquist dummies.",
        "Even though Toy Story 4 sometimes feels like a regurgitation and retread of the earlier films, there’s something warm and comforting about spending 100 minutes in their company again.",
        "A funny, freaky, often profound animated adventure that is certainly the best movie ever made about a spork.",
        "Still, once the end credits rolled – including superfluous “bonus” scenes wrapping up various narrative threads – I couldn’t help but empathize with that talking spork. Freedom, sweet freedom! For now.",
        "No, Toy Story 4 isn’t necessary. Yes, Toy Story 4 is fun. Does it end in a way that’s worthy of the series, and Woody in particular? We’ll get there.",
        "Toy Story 4 is genuinely gripping for most of the way, with just a couple of minor dips. But it arrives at a lovely place, with an embrace of life in all its danger and uncertainty.",
        "Toy Story 4 is a blast and it’s great to be back with the gang.",
        "While it falls short of its predecessors, the film is generally more confident and inventive than any of the non-Toy Story Pixar sequels.",
        "The basic pleasures of this fourth installment may be at once more hectic and more shopworn, but the film preserves, at least, the pathology of its series: that anxiety about finding meaning and your own place on the shelf.",
        "The animation is also top-notch: Bo has a bunch of dazzling scenes as a porcelain warrior, and human characters look better than ever. With the emphasis on Woody’s tale, Buzz and the other returning toys spend much of the movie as side characters, but it turns into a true romp when everyone's plots coincide.",
        "The film seamlessly interweaves fun escapades and earnest emotions, but it lacks the visual power of its predecessor.",
        "Toy Story 4 doesn’t hit the emotional highs of the previous films. There are good jokes that work and heist setpieces that don’t. The ending is moving, though now you distrust any finality with this saga. It does feel a bit cheap, somehow.",
        "Toy Story 4 is as mediocre a Toy Story movie as there is and probably can be, but it also marks another unbelievable triumph at Pixar in their never-ending quest to realize the imagination.",
        "In other words, the movie is exactly what you expect — not more, not less — from an estimably well-oiled machine like Pixar.",
        "The “Toy Story” saga felt fully complete without it, which makes this a movie that doesn’t really need to exist, but whose existence doesn’t diminish the whole, either.",
        "In my mind, there’s no question Toy Story 4 is the weakest movie in the series. But it’s also the riskiest and the most pleasantly unpredictable.",
        "Twenty-four years ago, the original Toy Story broke ground as the first-ever entirely computer animated feature film. What’s more astonishing now is how all those ones and zeroes are harnessed to produce something so utterly lifelike.",
        "It’s easily the weakest of the four iterations of that title. If Disney and Pixar really needed to revisit a tale that they had gracefully ended, it should have been more of a victory lap. This, whatever its modest charms, has the feel of an end zone dance — crass, unnecessary, and a slightly pale reflection of the glories that warranted it.",
        "Does it tug the heartstrings? Absolutely. Is it funny? The funniest of the quartet, in fact thanks to a weird new character. But Pixar, like its former funder Apple, has conditioned audiences to expect more than a nice little movie. We want to be amazed — not subscribe to Apple TV+.",
        "It may only be a repeat of earlier ideas and plotlines, but compare it to the fourth films in other franchises and Pixar’s latest is an amusing and charming gem."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "Toy Story 4 is an immensely fun movie that caps off the series in a perfect way. The detail in the animation is incredible and it feels like a labor of love from Pixar in a way the other two sequels did not. A must see for even the mostToy Story 4 is an immensely fun movie that caps off the series in a perfect way. The detail in the animation is incredible and it feels like a labor of love from Pixar in a way the other two sequels did not. A must see for even the most casual fans. I laughed, cried, smiled, and loved basically every minute of it despite expecting a so-so sequel.",
            "review_date": "2019-06-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The new chapter of the franchise also takes advantage of the chance to expand a character that, until then, was left out. While everyone is distressed or faced with deadlock, Bo Peep is the only one who has complete certainty of who she isThe new chapter of the franchise also takes advantage of the chance to expand a character that, until then, was left out. While everyone is distressed or faced with deadlock, Bo Peep is the only one who has complete certainty of who she is and what her goals are. Therefore, it naturally assumes the role of guide of the group, guaranteeing great moments of action and girl power. This posture still creates a fun contrast with the Bunny and the Duckling, who could not be more lunatic. Toy Story 4 proves that, yes, there is still charisma and breath to spare for the franchise. Good. Deep down, no one was ready to say goodbye to these old friends.",
            "review_date": "2019-07-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "When Bonnie makes a new toy that goes missing Woody sets out to bring him back. Toy Story 4 never quite hits the consistent heights of previous movies in the franchise but the animation is absolutely fantastic and it’s sure to entertain bothWhen Bonnie makes a new toy that goes missing Woody sets out to bring him back. Toy Story 4 never quite hits the consistent heights of previous movies in the franchise but the animation is absolutely fantastic and it’s sure to entertain both children and adults alike.",
            "review_date": "2019-07-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Toy Story 4, though a good film is probably my least favourite of the franchise. Though there is a good message attached, the film's plot felt too familiar and not as heartfelt. Overall though the animation and voice acting is brilliant.",
            "review_date": "2019-07-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "+Interesting story concept+Great voice cast+Some interesting set pieces\n-Felt decidedly 'below average' as a final outing for a pixar franchise\n\nI'm unsure I know what I would want from a 4th Toy Story movie - watching this challenged my+Interesting story concept+Great voice cast+Some interesting set pieces-Felt decidedly 'below average' as a final outing for a pixar franchiseI'm unsure I know what I would want from a 4th Toy Story movie - watching this challenged my perceptions of woody and the gang in ways I didnt expect. Most of the side characters are 'back in the van' for most of this road trip movie so we are spending most of the time with the 'anxiety strickenmid life crisis woody', an 'uncharacteristically overpowered ninja skilled action ready bo peep' and new characters mentally unwell forky and sociopath gabby gabby... Perhaps i'm jaded from all the years of high quality cgi animated movies but I just wasn't as emotionally connected as I felt I was in previous outings, and so things moved along averagely which for a final toy story could be seen as disappointing? I was entertained but not enthralled as one would hope to be. Everything looks....eerily photo real at this level of quality CGI so thats a thing now! Part of me wished they had left the franchise alone and produced something new instead. Definitely worth a look for pixar fans though.",
            "review_date": "2019-10-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It was satisfying to watch this 3rd sequel to one of Pixar's best; the story was great, the characters were great, but some of their stories seem a bit unfinished, the emotion is real, and the animation always gets better and better. The onlyIt was satisfying to watch this 3rd sequel to one of Pixar's best; the story was great, the characters were great, but some of their stories seem a bit unfinished, the emotion is real, and the animation always gets better and better. The only thing that's keeping me from giving this movie a perfect score is said character stories, yet that seems kinda harsh. Still, watch this movie.",
            "review_date": "2019-07-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Heartfelt, warm, and thought-provoking, Toy Story 4 is a fantastic addition to the series.",
            "review_date": "2019-07-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is the best Pixar animated film. Not just entertaining with extreme funny scenes but they were conscious with details. Characters were so adorable and given much depth with real purpose This is an impeccable work of art.",
            "review_date": "2019-07-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A movie that while good felt pointless. The end of Toy Story 3 really felt like the end of the series, but then Toy Story 4 is coming out 10 years later to continue the story. Also for money. It's definitely enjoyable and probably theA movie that while good felt pointless. The end of Toy Story 3 really felt like the end of the series, but then Toy Story 4 is coming out 10 years later to continue the story. Also for money. It's definitely enjoyable and probably the funniest of the 4 movies, but they really don't use their characters that well. It bothered me that we didn't get much Buzz, potato head, Rex, etc. The entire movie felt like a long epilogue just to tell us about Woody. Still enjoyable even if I felt it was tacked on and pointless.",
            "review_date": "2019-07-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Less a full fledged sequel than an epilogue, to bring just a little bit more closure to Woody's arc. Like any epilogue, it's ultimately unnecessary. Does it need to exist? No. But is it ok that it does? Absolutely.The parallels to the firstLess a full fledged sequel than an epilogue, to bring just a little bit more closure to Woody's arc. Like any epilogue, it's ultimately unnecessary. Does it need to exist? No. But is it ok that it does? Absolutely.The parallels to the first film are constant and intentional. Woody must deal with the new toy on the block. Woody loses said new toy and must go on a quest to retrieve it to keep his owner happy, to do the right thing because his moral compass never pointed nowhere but true. He meets scary toys that aren't scary so much as misunderstood. All is well. Except Woody.The circle of life comes full circle. This isn't 4, this is 1 all over again. But how many times can you repeat the same story, the same mistakes, the same resolutions? Woody takes a different exit this time. He loses his voice in life but gains perspective. And by doing so sets himself free, free to help all others, not just those close to him, to infinity and beyond.",
            "review_date": "2019-07-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Toy Story 4 is an outstanding film that succeeds in keeping the Toy Story Franchise one of the best franchises. Here are the few negatives. The character of Forky, as great as he is, is a plot device. He really is only there to move the storyToy Story 4 is an outstanding film that succeeds in keeping the Toy Story Franchise one of the best franchises. Here are the few negatives. The character of Forky, as great as he is, is a plot device. He really is only there to move the story forward which kinda sucks. My other issue is that the film does borrow heavily on themes and plot points from the original 3 films. Here are the positives. This film can be very emotional at times. The film starts emotional and doesn’t stop being emotional until the credits roll. The last scene of the film is probably one of the most emotional Pixar moments. The voice acting is very good. Tom Hanks, Tim Allen, and Annie Potts are standouts from the main cast. Each delivers their lines with so much emotion and personality that you can’t help but care about them and their struggles. The returning characters don’t have a lot of screen time but they all do an outstanding job. The new characters are really good also. Keanu Reeves, Jordan Peele, and Keegan-Michael Key’s characters steal the show. Each of their characters are incredibly entertaining and hilarious to watch on the big screen. This leads me to my next point. For a Pixar film, Toy Story 4 is pretty funny. There are a handful of jokes that don’t land well but most of them got a chuckle out of me and one or two got full on laughs from me. The animation for this film is outstanding. It’s incredible to see how far animation has come from the original Toy Story in 1995. There is one shot that showcases the passage of time and it’s incredible. The story is heartwarming and nice even if it does bounce back on ideas from the previous films. The score for this film is pretty good also. It’s not extraordinary but it’s good. The tone for the film remains consistent all the way through and it’s also paced really well. I would highly recommend seeing this in theaters. Overall, Toy Story 4 is another great addition to the Toy Story franchise with outstanding animation, great voice acting, and tons of emotion. I give Toy Story 4 a 9/10.",
            "review_date": "2019-07-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Overall hilarious movie for the family with Keanu Reeves mostly stealing the show",
            "review_date": "2019-06-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If you saw the first 3, you have got to see this one.  Has that true to form Toy Story feel, and as anticipated this will get you in the feels.",
            "review_date": "2019-07-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A real heartwarming film. This movie had a lot to live up. An amazing trilogy that helped define my childhood for sure. I was happy with this film. I definitely did not expect to enjoy this as much as I did, but I walked away loving the CGI,A real heartwarming film. This movie had a lot to live up. An amazing trilogy that helped define my childhood for sure. I was happy with this film. I definitely did not expect to enjoy this as much as I did, but I walked away loving the CGI, the characters, the voice acting, and an ending that made me almost cry. Almost. Tony Hale steals the show as Forky. A hilarious new addition to the ole' gang. Tom Hanks and Tim Allen are still extremely enjoyable as they fell right back into their role like a pair of broken in shoes.",
            "review_date": "2019-07-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "WHen this movie was announced I was very skeptical. But after watching it I was pleased with the quality from Pixar and they really told a story that needed to be told.",
            "review_date": "2019-09-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Honestly, its all about fun and ruining yet another of your disney-sequel-allergy scepticism. This movie succeeds in both tasks. Sadly its the only one that does that in 2019",
            "review_date": "2019-10-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Toy Story 4 is a truly great movie for all ages. Watch it with your kids, or alone, it does not matter, you will still love seeing Buzz and Woody on the screen together for the last time.",
            "review_date": "2019-11-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "As usual Pixar at it best with some touching and some funny moments. I didnt like the feminist elements.",
            "review_date": "2019-11-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Wonderfully inventive for a fourth installment it's not the landmark the original was or as great as the third, but worth the effort (in terms of both the story craft and incredible artistic detail of the animation by the makers, and goingWonderfully inventive for a fourth installment it's not the landmark the original was or as great as the third, but worth the effort (in terms of both the story craft and incredible artistic detail of the animation by the makers, and going out to see it).",
            "review_date": "2019-08-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A truly bittersweet end for a beloved franchise that's known for its story.",
            "review_date": "2019-07-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "While its nowhere near as perfect as Toy Story 1-3 I still enjoyed the hell out of this film. Always been a fan of Toy Story and I'm here if they're willing to make it to Toy Story 40.",
            "review_date": "2019-07-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"We Belong Together\", the end title piece sung by Randy Newman as the credits rolled following the third installment made it seem that all would be fine for Woody and the gang after they landed safely in the care of Bonnie. However, Toy Story\"We Belong Together\", the end title piece sung by Randy Newman as the credits rolled following the third installment made it seem that all would be fine for Woody and the gang after they landed safely in the care of Bonnie. However, Toy Story 4 goes against this happy picture we last witnessed, and instead focuses once again on the idea of getting older, growing farther away what we used to know as children, and coming to terms with this new reality. New Pixar creative Josh Cooley leads the cast and script through another timeless entry in the series, filled with colorful set-pieces (as expected) and plenty of emotional moments to make this return to the franchise feel worthwhile, and, surprisingly, necessary. These toys have changed since last seen, especially that of Woody. The amount of focus on the development and growth of Woody is great and surprising, even for a Pixar outing. His story is what drives the plot forward, and makes for a fantastic finale, one that rivals the brilliance of 3's emotional sendoff. However, as mentioned earlier - \"We Belong Together\" - the catchy, Newman helmed song, and the idea behind it, is tested in Toy Story 4. A test that makes for a must watch story, accompanied by a wonderful cast (as always), stellar visuals, and the true emotional moments that Pixar is known for.",
            "review_date": "2019-08-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Still solid after all these years with some flaws alomg the way. Woody Buzz and Bo Peep all seem a little off in this one compared to their characters in the past but still this version was a lot of fun for someone who has grown up with these toys",
            "review_date": "2019-07-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is by far the most beautiful Pixar film made yet. The story isn't as strong as Toy Story 2 or 3, and ultimately this probably will end up ranked fourth in the series for me, but it's infinitely re-watchable just like the others.",
            "review_date": "2019-10-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "For me Toy Story 3 had the better story and characters but Toy Story 4 had the biggest emotional moments and was also entertaining to watch.I've waited for so many years for Toy Story 4 and i can say that it was worth the wait.Very good movie",
            "review_date": "2019-09-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I love this movie!!! Toy story just keeps getting better and better!! Keep this franchise going....I always laugh with this franchise.",
            "review_date": "2019-07-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If you thought Toy Story 3 was about moving on and letting go, wait ‘til you see this one. Thank you to the toys that grew up with the late 90s babies. Farewell.Shout out to Pixar for knowing how to craft three-dimensional antagonists thatIf you thought Toy Story 3 was about moving on and letting go, wait ‘til you see this one. Thank you to the toys that grew up with the late 90s babies. Farewell.Shout out to Pixar for knowing how to craft three-dimensional antagonists that aren’t just evil for evil’s sake.",
            "review_date": "2019-08-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This should not have worked, but it did. While still being probably the weakest of the Toy Story movies,it still manages to be emotional and entertaining.",
            "review_date": "2019-08-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Full of heart, charm and hilarity. Toy Story 4 is a must see. Make sure you stay for the end credit scenes. Kaboom. A",
            "review_date": "2019-09-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "When I first heard they were making a Toy Story 4, I didn’t think it was necessary at all. Toy Story 3 ended the story perfectly, what more could be done with it? Not to mention that it’s a Pixar sequel made in the 2010s, which don’t exactlyWhen I first heard they were making a Toy Story 4, I didn’t think it was necessary at all. Toy Story 3 ended the story perfectly, what more could be done with it? Not to mention that it’s a Pixar sequel made in the 2010s, which don’t exactly have a great reputation. Toy Story 3 was great, Cars 2 was bad, Monsters University was okay, Finding Dory was good but forgettable (no pun intended), Cars 3 was okay and Incredibles 2 was a lot of fun but not as memorable as the first movie. It didn’t help that none of the Toy Story 4 trailers impressed me. I walked into this movie cautiously optimistic. I hoped it would be at least as good as Incredibles 2 but I was ready for the possibility of a disappointment. However, after seeing the movie, I can confidently say that they did it again. They made another great Toy Story movie. It has an engaging and emotional story, a lovable and memorable cast of characters, interesting themes and ideas, the most beautiful animation that Pixar has put to screen yet, pitch-perfect voice acting, and really great action and comedy! While Toy Story 3 was the perfect ending, I think Toy Story 4 is a great epilogue. This is probably where the story would go next, whether you like it or not. I do have some criticisms though. Some of the writing and comedic timing felt surprisingly clunky and off a couple of times and the ending does feel a little rushed. The ending of Toy Story 3 was definitely a better finale to the series as a whole, it was more epic and larger in scale, but this is more of a finale to the arcs of the main characters. I can’t think of a more fitting way to end both this story and the 2010s decade of Pixar movies. It came in with a Toy Story movie and it went out with a Toy Story movie, and it looks like this is the last Pixar sequel we’re going to see for a long time. It’s been confirmed that there are no sequels coming out for the foreseeable future and they will be putting their focus on original films only. That sounds good to me! Overall, this is a must-see for any fan of the Toy Story movies. It just might be another instant classic. Highly recommended.",
            "review_date": "2019-09-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Every inch the worthy successor to a stunning trilogy, it reshapes the overarching narrative of the series with heart, humour and a delicately joyful finesse.",
            "review_date": "2019-09-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "i saw the trailer for this movie, and honestly after the train wreck that was incredibles 2, i thought this movie was heading down the same path. However toy story 4 not only exceeded my expectations, but it was also better than the previousi saw the trailer for this movie, and honestly after the train wreck that was incredibles 2, i thought this movie was heading down the same path. However toy story 4 not only exceeded my expectations, but it was also better than the previous movie! The Animation is simply outstanding, the opening 10 minutes are beautiful. The storyline is both fun, emotional and even creepy? I was most surprised by ducky and bunny, the 2 new characters that were shown off through out the trailer, i thought these characters were going to be your generic pop-culture comedians, but instead they were the stand outs of the film. Their comedy and timings were hilarious at times, and outside of woody and buzz, were my favourite characters. Forky was also less annoying than id assumed going into the movie, i like his mindset of believing he is trash (maybe a reference to how all those kids who grew up with the first 3 films feel about themselves now) and the scenes of him trying to escape actually made me laugh. Most of the returning cast dont get much of a time to shine, but the new characters and the fantastic story line more than make up for it. 9/10 - the best one since Toy story 2.",
            "review_date": "2019-09-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Toy Story 4 is a heartfelt experience that will leave you emotionally invested in all its story by the end of the film. The film is beautifully animated to the point where specific shots look real. The animation is simply stunning making theToy Story 4 is a heartfelt experience that will leave you emotionally invested in all its story by the end of the film. The film is beautifully animated to the point where specific shots look real. The animation is simply stunning making the film a joy to look at. The film's themes of farther-hood and letting go of the past make the film more relevant and heartfelt as intriguing you watch it. Characters such as Woody and Bo Peep have never been better and new characters like Duke Kaboom and Forky are some of the best side characters the series have ever had. My only flaw with the film is that a vast array of characters really have any time in the spotlight and are pushed aside to make way for other characters and plotlines. Overall the film is an entertaining and heartfelt experience that deserves applause.",
            "review_date": "2019-10-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Toy Story 4 comes across as a really unnecessary sequel. While greatly animated no doubt, there are moments where this film looks absolutely stunning. But in terms of the narrative Toy Story 4 just isn't all that interesting. Woody has anToy Story 4 comes across as a really unnecessary sequel. While greatly animated no doubt, there are moments where this film looks absolutely stunning. But in terms of the narrative Toy Story 4 just isn't all that interesting. Woody has an interesting character arc, but I don't buy that Bo Peep is the one to show him this arc, or that he would come to it for the reasons he does in the movie with his new owner. Forky feels like he's there mostly for comedic purposes than anything else. Which is fine, but he plays too much a big part in the story for him not to feel more impactful. Buzz Lightyear is completely wasted in this movie, the jokes with him seem like something he'd go through in a much earlier film, or heck in the first film. The veterans of the series are completely pointless, I don't see why they didn't make Bo Peep the main character and maybe leave the characters from Toy Story 3  where they were at the end of that film. It's perfectly fine movie for kids overall, but I think the older audiences who grew up with the previous films much leave wanting a bit more.",
            "review_date": "2019-10-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "All right, I do it in public so I might as well admit to all: most people who know me know I cry in movies and I have never been ashamed of it but to cry in an animated film??? Come on!! Okay I did and I do. I remember years ago crying whenAll right, I do it in public so I might as well admit to all: most people who know me know I cry in movies and I have never been ashamed of it but to cry in an animated film??? Come on!! Okay I did and I do. I remember years ago crying when Bambi's mother died but until cartoon movies became way more, in technical ways, I didn't during Snow White, Pinocchio or even Fantasia!I saw \"Toy Story 1\" but aside from remembering some of the characters I remember little of the story. I skipped 2 & 3 but not having anything else to see today I decided to see the, supposedly, latest and last story. It is a story about how one feels not being wanted or loved anymore and how to handle the feelings and life changes.In this film we find an old friend Woody, a sheriff, has lost his first owner, Andy, who pushed him aside when Andy went off to college. Woody found consolation with Bonnie who inherited him but now she is off to kindergarten and has made her own toy, Forky, made from trash items like pipe cleaners, a plastic spoon, doll's eyes and considers himself trash but Bonnie loves him. Very shortly after bringing him home she loses him and Woody feels it is his duty to return Forky, now Bonnie's friend who in turn deserts him while at the same time convince Forky he is not just trash.The chase involves some old, and many new characters, in the Toy Story series but bogs down in the chase sequences while at the same time offering a few laughs such as a skunk sort of being a Trojan horse or at least camouflage! The main tug at the emotional strings are the reunion of Bo Peep and Woody with the former having accepted the fact that she no longer serves a purpose just moving here and there.Not having seen the middle stories I am not sure who is new here but Tom Hanks, as always, is very effective and, yes, believable as Woody. Tony Hale, new as Forky, is funny while Tim Allen as Buzz Lightyear gives solid backup to his friends while Annie Potts returns as Bo Peep as a very strong woman and Christina Hendricks as sort of a villainous Gabby Gabby who wants Woody's voice box. One of the newest characters, and definitely the funniest, is Keanu Reeves as Duke Caboom, a Canadian stunt motorcyclist, full of himself and daring to do anything.\"Toy Story 4\" is a film for both children of all ages and adults will, in many cases, enjoy it more! After seeing about a dozen of the 'new' ways films are animated I am still intrigued at how the characters seem alive and, in many cases, you believe in them.",
            "review_date": "2019-07-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the more aggravating and confounding releases of the year, based solely on the fact that it's both a genuinely good movie in its own right and one that I don't necessarily think any of us needed. I definitely won't be alone in sayingOne of the more aggravating and confounding releases of the year, based solely on the fact that it's both a genuinely good movie in its own right and one that I don't necessarily think any of us needed. I definitely won't be alone in saying how perfectly I felt the franchise's third installment seemingly concluded things for Woody, Andy, and the gang, with any mutterings of a potential fourth iteration being met with unadulterated skepticism and even derision on my part. But to be absolutely fair, this movie is terrific for the most part, with a lot of the emotionality really hitting home with me, and the animation pushing the needle even further into the realm of photorealism. This in mind, though,  could I live with the hypothetical threat of someone \"Eternal Sunshine-ing\" this movie from the annals of my memory? Yeah, I'd be okay with it, I suppose. Can I say that for any of the other three installments? Personally, no. That's an issue for me, but to be sure, I understand the overwhelming praise. I just hope \"Toy Story 4's\" success doesn't act as a precedent that studios will use to justify other future exhumations of presumably dead franchises.",
            "review_date": "2019-06-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "While I was initially very much against a fourth 'Toy Story' movie being made, as the third capped off everything so perfectly, (along with the fact that I find myself disappointed more often than not with Pixar sequels), I've gotta say thatWhile I was initially very much against a fourth 'Toy Story' movie being made, as the third capped off everything so perfectly, (along with the fact that I find myself disappointed more often than not with Pixar sequels), I've gotta say that I'm now eating those words, as I found this to be the best sequel out of all of them (nothing's ever gonna top the first for me, but hey, that's childhood for ya!) Everything about this was so satisfying and fun.The voice acting is great from O.G. characters (Tom Hanks and Tim Allen are always perfect as Woody and Buzz respectively), as well as new additions (Keegan-Michael Keye and Jordan Peele voice a couple of stuffed Carnival prize toys, and Keanu Reeves is a riot as a Canadian stuntman toy.) The animation is so unbelievably detailed down to every last frame, image, and character, unsurprisingly making the first film from nearly 25 years ago look quite outdated by comparison. Even the story I was impressed by, as I was convinced that Pixar really had nothing else to explore with these characters, but they managed to take them in some unexpected directions, some nostalgic, and some new and surprising, even ones that tug at the emotions quite a bit, especially towards the end (as has come to be expected from the best of Pixar.) So needless to say, there's something here for all ages to enjoy. Overall, it's a sequel I still feel wasn't completely needed, but in spite of my initial skepticism, it's one I'm very glad we got nonetheless, as it gives us yet another fun time with these toys and characters so many of us have grown up watching for so long now, and they're given yet another satisfying story and ending, one that Pixar would be wise to leave be, for real this time.",
            "review_date": "2019-06-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Although the Toy Story films are full of adventure and comedy, the series always includes a focus on serious, emotional moments. This one includes more drama with a continuous message about the importance of friendship and loyalty. The usualAlthough the Toy Story films are full of adventure and comedy, the series always includes a focus on serious, emotional moments. This one includes more drama with a continuous message about the importance of friendship and loyalty. The usual gang is back, although most of the funny supporting characters get scant attention. This one revolves around Woody, Bo and a new toy (a spork voiced by Tony Hale) as they go on an adventure to comfort their new kid/owner. The animation is gorgeous, as expected, and there are some new characters that add some fun. Overall, it's lively, well-paced and enjoyable. Not as unique or special as the first 3, but still higher entertainment value than many animated family films.",
            "review_date": "2019-06-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "What can I say? Toy Story 4 is a great movie, but in comparison to its last two installments, it's 'just' a solid 9. Great animation, perfect casting, great all around from the team from Pixar. Yet it's biggest disadvatage: coming of whatWhat can I say? Toy Story 4 is a great movie, but in comparison to its last two installments, it's 'just' a solid 9. Great animation, perfect casting, great all around from the team from Pixar. Yet it's biggest disadvatage: coming of what many consider as a 'perfect trilogy'. This film is an epilogue at best to that storyline, yet after the epic that were Toy Story 2 & 3, it just can't hold a candle to those masterpieces. Is it still one of Pixar's best? Absolutely. Should Disney be inclined to make another sequel? No. As many of the character arcs have reached a satisfying conclusion, and shouldn't be commercialized even further. It's time for Woody and Co. to ride of to the sunset.",
            "review_date": "2019-06-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Good movie, though the 3rd Toy Story is better IMO. It's not bad at all mind you. Duke Caboom is seriously great, the ending and the road leading there is great as well, you just have to wonder if this movie needed to be made. We had theGood movie, though the 3rd Toy Story is better IMO. It's not bad at all mind you. Duke Caboom is seriously great, the ending and the road leading there is great as well, you just have to wonder if this movie needed to be made. We had the perfect ending in 3, it feels like they're just milking the fanchise for all it's worth. Not that they have no right to do that or even that they're doing a bad job. It's pretty great, just not better than what we already had.",
            "review_date": "2019-06-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Good. The 3rd one I think is better but this is not bad at all, it just doesn't reach that level. It has good emotional moments and several ones of \"knot in the throat\" in which you'll cry. I like the development of the villain (Gaby Gaby),Good. The 3rd one I think is better but this is not bad at all, it just doesn't reach that level. It has good emotional moments and several ones of \"knot in the throat\" in which you'll cry. I like the development of the villain (Gaby Gaby), her arc and how she evolves. The initial scene with the rain and how they tell us what happened with Bo Peep 9 years ago is GREAT. The new characters Forky, Ducky and Bunny, Duke Caboom and Giggle McDimples are great. The road that Woody has to travel and how he has to get rid of his past with Andy is very well done. The ending with Woody and Buzz Lightyear is one of the best things I've seen. 3D animation is the biggest thing that Pixar has done, there are times that even it looks real.",
            "review_date": "2019-06-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Imagine if the punch Toy Story 3's ending delivered was dispersed into a whole new movie. That's the fourth. It's a movie about Woody. That made it more mature at the cost of other characters lesser screen time. If you are an adult, you willImagine if the punch Toy Story 3's ending delivered was dispersed into a whole new movie. That's the fourth. It's a movie about Woody. That made it more mature at the cost of other characters lesser screen time. If you are an adult, you will find so much relatable content about life in general: the struggle to find one's place, one's constant change, relationship's difficulties, etc. The plot is the simplest of all movies, filled with funny, cute and laughable scenes, perhaps this movie will make you cry (as I did). Cons: the other characters were not properly portrayed and the movie does not really make up to Toy Story 3's perfect ending.",
            "review_date": "2019-06-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I’ll be the first to admit, I was apprehensive going into Toy Story 4 given that I thought number 3 was a near perfect sign off for the franchise, and I honestly didn’t feel there was much story left to tell. I am happy to say I wasI’ll be the first to admit, I was apprehensive going into Toy Story 4 given that I thought number 3 was a near perfect sign off for the franchise, and I honestly didn’t feel there was much story left to tell. I am happy to say I was absolutely wrong, not only is Toy Story 4 a fitting addition to the series, it may even be one of the best instalments. The story, though retreading some well worn ground, still feels fresh enough to keep everything tied together and goes along at a solid pace, with enough twists and turns to keep everyone in the audience invested.The characters (the ones that get decent screen time at least) stay true to themselves as we have grown to know and love them, and the film concludes in an extremely satisfying way.I’ll not spoil any finer details, but will leave the suggestion that you go see it if you are a fan of the other films.Very good film 9/10.Don’t make a Toy Story 5 please.",
            "review_date": "2019-07-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Absolutely BeautifulToy Story 4 is an extremely satisfying end to a franchise that has stood the test of time.",
            "review_date": "2019-07-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "TOY STORY 4 is that movie in which most people was skeptical about what could be the possible development of the plot, and the possible quality of this after a TOY STORY 3 that closed intelligently a series of events that represented theTOY STORY 4 is that movie in which most people was skeptical about what could be the possible development of the plot, and the possible quality of this after a TOY STORY 3 that closed intelligently a series of events that represented the world of childhood until the adulthood. Whereby, TOY STORY 4 does not represent the same quality in terms of plot, but it does not mean that is a bad movie. This sequel was totally unnecessary. It is probably the funniest one inside the four films, and the least emotional inside all of them. From this, it is possible to say that this movie closes the story of a special character in a good way, instead of the plot falls dramatically at the end. In general, the movie is special, and it does not disappoint, but it was not necessary.--8/10--",
            "review_date": "2019-06-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "When Toy Story 4 was first announced many people online seemed very reluctant about the idea of another Toy Story movie. Not because people were bored of the franchise, but because they thought Toy Story 3 provided such an ideal ending thatWhen Toy Story 4 was first announced many people online seemed very reluctant about the idea of another Toy Story movie. Not because people were bored of the franchise, but because they thought Toy Story 3 provided such an ideal ending that they were concerned any continuation couldn't live up to the ideal legacy the previous three films had created. But once again Pixar outdoes all expectations, making another fine addition to their greatest franchise.We start more or less where the last film left off, with Woody struggling to adapt to being Bonnie's toy. He's no longer the favourite and he's started to collect dust in a cupboard. But he finds a new meaning for his life when he decides to become a mentor to a new toy named Forky, a toy which Bonnie makes on her first day of school out of a spork. Now you may be wondering to yourself how a spork comes to life and what really makes a toy? I don't know. But whatever brought him to life has also caused him to have an existential crisis where he is forced to be a living toy when all he wants to be is trash.This crisis leads to Woody and Forky becoming separated from the rest of the gang whilst on a road trip, where they end up bumping into Woody's long lost love, Bo Peep. Whereas Woody lives trying to recapture that special connection he had with Andy, Bo has decided she doesn't want a new kid and lives her life as a lost toy. With Bo and Woody's relationship taking centre stage in the film, Toy Story 4 allows their personalities to lead the direction of the film all culminating in another heart wrenching conclusion to the Toy Story franchise.As with the other Toy Story films, we also get introduced to some new memorable toys. Beyond the lovably naive (albeit slightly suicidal) Forky, we also have Duke Caboom, a stunt-cyclist toy who suffers from PTSD due to not being able to leap through the air for his previous owner as his toy was originally marketed as. Key and Peele play a pair of carnival fluffies, who's surprisingly sadistic nature ends up being a comedic highlight of the film. And also an old doll named Gabby Gabby, who due to being defective sends her ventriloquist dummies to kidnap Woody to steal his voice box. And yes, her ventriloquist dummies are just as creepy as you're imagining they are.Another cornerstone of the franchise is that each film always showcases the best animation of the time and Toy Story 4 is no exception. These aren't the most ambitious visual concepts, most of it just takes place in an old antiques store and a moving carnival. But the attention to detail, the colour and the photorealistic lighting ensures that the film is consistently beautiful and that there's never a boring shot in the film. One moment which really stuck with me was an establishing shot of Woody and Bo Peep in the rain, which was so awe inspiring that it's a moment I found myself completely lost in.Though as entertaining as all of the new characters are, it would have been nice to see some more from the original gang like Hamm, Rex and Jessie. None of them become too involved in the main plot and some are never really given a moment to shine in the film. And with a brief runtime of 100 minutes it's not like they had to be cut out to condense screen time.Although when my biggest gripe with a film is that I would have liked more of it, the filmmakers have definitely been able to recapture that special Pixar magic. And I have no doubt that kids will remember characters like Forky as fondly as I held Buzz and Woody after growing up with the original Toy Story.",
            "review_date": "2019-06-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Toy Story 4 feels right at home with the rest of the films in the Toy Story series. Like the third film did with regard to the second, the fourth film shows us the consequences of the decisions made by Woody in the third film, choosing to tryToy Story 4 feels right at home with the rest of the films in the Toy Story series. Like the third film did with regard to the second, the fourth film shows us the consequences of the decisions made by Woody in the third film, choosing to try and continue his journey as support for Bonnie. It greatly expands on the themes of (mostly) the previous two films, taking new spins on topics ironically related to the life of the original two films' audience and introducing probably the entire series' most poignant and realistic themes.I was also a bit disappointed by the shelving of the original toys, who were relegated to almost mere cameo roles, but I did love the new characters introduced, particularly Ducky and Bunny, who provided some of the funniest comedy in the Toy Story series, and Gabby Gabby, who I will not get into for spoiler concerns.Additionally, it takes a little while for the film to get going, as its first act is pretty mediocre and slow, but does a good job of setting up future arcs. However, the film only gets better from there, with a fantastic and powerful third act that will definitely leave you teary-eyed (particularly if you're in your late 20s-early 40s). Toy Story 4 provides a really great and seeming conclusion to the Toy Story film franchise (I'm sure there will still be material produced for TV featuring these great toys). Even with a slow start and sidelining of the main cast from the first three films, its powerful themes, great new characters, stunning animation, and third act all more than make up for it, solidifying this film as another great entry in Pixar's lineup of classics.",
            "review_date": "2019-06-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "First of all, as I was leaving the theatre and was thinking about how great the movie was and I realized one thing that at certain points in the film it seemed rushed. At the beginning of the film, it felt fine and then more towards theFirst of all, as I was leaving the theatre and was thinking about how great the movie was and I realized one thing that at certain points in the film it seemed rushed. At the beginning of the film, it felt fine and then more towards the middle of the film it started to feel rushed a bit. Like in one scene they would be doing something and then would just transition to something for a bit and then to something new. The movie is one-hour and forty-minutes and I think a longer run time could have helped out a lot. I really liked some of the new characters. They all were really funny but at the same time just seemed like ways so they could get more money with the new characters and could make more movies with them. With the old characters, I actually liked what they did with Woody and how he helped show the message of this film. From what I could tell the message is that sometimes you have to change in order to be happy or everybody doesn’t just have one purpose but multiple or something like that? The animation in this film is amazing but I do wish that they kept it close to the original animation style but like I said the animation is still spectacular. I love the score composed by Randy Newman. In the end, Toy Story 4 is a good film but also feels like a cash grab film at the same time. Check it out if you grew up with the original three or just want to see a fun animated family film.",
            "review_date": "2019-06-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "'Toy Story 4' may not be strictly necessary, but thanks to a very funny script, and some amazing character moments, the movie never loses its imaginative spark. The film once again sees Woody (voiced by Tom Hanks) and the gang return, along'Toy Story 4' may not be strictly necessary, but thanks to a very funny script, and some amazing character moments, the movie never loses its imaginative spark. The film once again sees Woody (voiced by Tom Hanks) and the gang return, along with their new owner, Bonnie, along with her other toys that we met in the previous film. Bonnie is about to start kindergarten and is feeling anxious, as most children do. Woody, being the caring and sympathetic toy that he is, tries to make things easier for her. Bonnie then decides to gather some thrown away items, mainly a plastic spork, googly eyes and some thick string to make a new friend she refers to as \"Forky\" (Tony Hale). Forky, shockingly becomes sentient like the other toys, except that he's aware that this is not his purpose. He repeatedly mentions to Woody that he is trash and belongs in the trash, and does everything he can to get away. Woody tries to stop him and convinces him that he's the reason Bonnie will be happy and make it through kindergarten. One day, during a trip to the carnival, Woody is convinced that he sees a lamp of an old friend, he ultimately runs into a dolly toy named Gabby (Christina Hendricks), and she seems sinister, and Forky ends up being stuck with her until she gets what she wants. Woody then runs into Bo Peep (Annie Potts) and she has moved on from being a kids' toy and becoming an independent toy who is free to explore whenever she craves it. Woody tells her about his situation and she offers to help out by introducing him to a friend, a stunt-man cyclist toy named Duke Kaboom (a hilarious Keanu Reeves) who, much like Buzz Lightyear in the original 'Toy Story' (1995), Duke has over-the-top confidence, though he is aware he is a toy. Meanwhile, Buzz (Tim Allen) tries to find Woody, and is stuck at a carnival game where he meets Ducky (Keegan Michael Key) and Bunny (Jordan Peele), and these two were absolutely hilarious. I liked this movie, not as much as the first three, it doesn't have the same emotional punch like Jesse's tragic backstory in 'Toy Story 2' (1999), or the intense drama with the garbage chute in 'Toy Story 3' (2010), but it is the funniest of the franchise. Director Josh Cooley does an impressive job of making his first animated feature debut. The gang is back, it's great to see them, the new characters; Duke, Ducky and Bunny have become my favorite moments from this film. If you love Pixar, this is one not to be missed, the comedy alone does warrant this sequels' existence.",
            "review_date": "2019-06-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Every technical aspect is great, but it doesn't answer the question \"why did they even made the movie?\".",
            "review_date": "2019-06-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great movie.  Very moving story.  Animation is amazing! So, stop reading this and go see it NOW!!",
            "review_date": "2019-06-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Some may say the first three Toy Story movies are a prime example of the practically perfect trilogy; heart-warming, intelligent and entertaining, Woody, Buzz and the gang have become pop culture staples that have defined the childhoods of aSome may say the first three Toy Story movies are a prime example of the practically perfect trilogy; heart-warming, intelligent and entertaining, Woody, Buzz and the gang have become pop culture staples that have defined the childhoods of a generation. I approached Toy Story 4 with a healthy level of scepticism; what more could possibly be added to this franchise that had culminated in such a faultless conclusion? Yet here stands a fourth instalment, asked for or not… that in many ways keeps itself comfortably in the formula we know and love. As we saw by the tear-jerking finale of 3, our favourite bunch of toys now spend their days playing with ‘their new kid’ Bonnie. Toy Story 4 starts off with a fuzzy familiarity that eases us in… until the introduction of a new character, Forky (a neurotic spork voiced superbly by Tony Hale). Expectedly, Forky becomes lost in a circus in the midst of a family road trip; it’s up to Woody to get him back. The adventurous escapades that ensue are undoubtably good fun; for me, it felt like a much more low-key Toy Story film, the grandiose nature of some of its predecessors replaced with something smaller and more character driven. First time Pixar director Josh Cooley and writers Andrew Stanton and Stephany Folsom put together a neat package full of clever humour and all those other qualities that make a Toy Story film tick. Naturally it wouldn’t be a Pixar outing if some deeper themes weren’t explored; in Toy Story 4 we delve into questions of sentience, loyalty and purpose with all the maturity and compassion you would expect from this studio. Tom Hanks once again delivers a heartfelt vocal performance as Woody, giving more raw humanity to a cowboy doll than should be allowed. Though this is suitably Woody’s story, he is flanked by a colourful cast of supporting characters; notably, Annie Potts gives gusto to an old face and Key and Peele lend their talent to some delightfully fluffy comic relief. I would have liked to have seen a bigger role for some veteran Toy Story alumni (what are Jessie and the Potato Heads doing these days?), but the newer players are a lovable lot… and the level of fun you can tell Keanu Reeves is having as Duke Caboom is enviable. Every character and the world around them is fully realised in simply breath-taking animation, hyper-realistic yet still with a slick sense of style.  The question can still be raised, however, of the necessity of this film’s existence. The truth is, apart from brief moments, we’re retreading old ground here, exploring familiar themes and ideas. Whilst this typical Toy Story fare is successful in pushing the nostalgia buttons and entrapping us in escapism, there’s very little new that is being brought to the table. From the storyline to Randy Newman’s jubilant score, it’s a caper we’ve seen before that loses just a bit of its charm. Despite this, however, Toy Story 4 is still a sure hit for Pixar and knocks most franchise four-quels out of the water in pretty much every way. For some, its conclusion will prove to be another tug at the heart strings… and even if (like me) you don’t quite buy it, the whole thing is sure to leave you with a warm, pleasant feeling inside. All in all, Toy Story 4 may not be a revelation but it’s a kind-hearted, amusing and entertaining film that harks back to everything you loved about the other movies. If only for that, it’s certainly worth your time.",
            "review_date": "2019-06-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Good movie heart and soul. Still the best pixar franchise .  It's what your expecting. Laughs and some tears.",
            "review_date": "2019-06-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "While good, had a different feel to it than the previous films. I felt Toy Story 3 ended it perfectly, I don't feel there was a need to make a 4th but was glad they did. It's certainly worth going to go see but again I don't feel it was asWhile good, had a different feel to it than the previous films. I felt Toy Story 3 ended it perfectly, I don't feel there was a need to make a 4th but was glad they did. It's certainly worth going to go see but again I don't feel it was as good as the first or 3rd film.",
            "review_date": "2019-06-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It really felt like most of the cast got pushed to the side. It was kind of disappointing. Most of all, I really disliked Bo's character. It felt like they tried way too hard to make her \"strong\" and failed. Being \"strong\" isn't just aboutIt really felt like most of the cast got pushed to the side. It was kind of disappointing. Most of all, I really disliked Bo's character. It felt like they tried way too hard to make her \"strong\" and failed. Being \"strong\" isn't just about muscles and punching or being stoic. Bo could have been someone who was strong without being overbearing, aggressive and annoying. I wish we had some better writers for the female cast. Bo didn't resonate at all with my daughter, who wanted more of Jessie. I had to agree. I would have liked to see more for Jessie to do.Overall, not a terrible movie but not up to the standard of Toy Story. I wouldn't recommend it or see it, again.",
            "review_date": "2019-07-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nI don't understand the glowing reviews for this installment in a franchise that was, until this one, beautiful and amazing. The jokes fell flat. The plot was a mess. They kept introducing new characters when they didn't know what else to do. The idea of a kid making a toy that becomes sentient is FANTASTIC, and they did nothing with it. The only thing that works for me here is the technical beauty of the thing but I really wish they'd stopped after Toy Story 3. This one seems to have been inspired more by making money than anything else. Skip this one, even when it comes out on streaming services.",
            "review_date": "2019-08-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Toy Story proves that this is way more than just Andy. It’s never been his story to begin with, and Toy Story 4 shows that & much more!",
            "review_date": "2019-06-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I hadn't heard a lot of buzz about this movie, but if you're reading this, you feel (as I did) obliged to watch.  While the trailers did not look very promising, the movie itself was very good.  To me, it was the funniest of the franchise.",
            "review_date": "2019-06-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Thinking back, there is not a franchise so consistent as this one and this movie just keeps the trend going and it's going strong. In terms of animation, I haven't seen a movie this beautiful and the hardware that must be required to renderThinking back, there is not a franchise so consistent as this one and this movie just keeps the trend going and it's going strong. In terms of animation, I haven't seen a movie this beautiful and the hardware that must be required to render this movie must be immeasurable.  This movie is just fantastic but when Pixar announced that they were making another Toy Story I was worried because 3 was a clear ending for the series but the story they tell on 4 really has a heart behind it. Woody shines in this movie and this movie is about him and my only complaint is that Buzz doesn't do much in this movie and some of the classic characters don't show up in the movie as much as you think. Forkie is a great addition to this movie and even the villain Gaby Gaby is not a cliche and blank state like I thought it was going to be, she inst a Lotso with an anarchy view on society but her motives are really genuine and you may even root for her at the end of the movie as I did. The end is really emotional especially if you have been with these movies from the beginning like I am. Toy Story 4 is a great movie and sometimes even a spectacular one and I fell in love with just like the ones before.",
            "review_date": "2019-06-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A profound sample of injecting metaphors of mysteries in life in animated film.",
            "review_date": "2019-06-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "When toy story 4 was announced. My friends inner voice told me that Toy Story 3 ended perfectly I wanted it to end just like that but I also wanted to see Woody and his gang with a new journey again. For the Forth, it’s not just satisfying itWhen toy story 4 was announced. My friends inner voice told me that Toy Story 3 ended perfectly I wanted it to end just like that but I also wanted to see Woody and his gang with a new journey again. For the Forth, it’s not just satisfying it also goes beyond any expectation. I don’t wanna say anything more just go see it. It’s worth every single minute.",
            "review_date": "2019-06-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Toy Story 4: The (Real) ending we didn't know we need.Pixar nailed it with a fun, compelling and exciting sequel.You won't regret seeing it, and it's villain was well worth it!",
            "review_date": "2019-06-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "What other movie franchises are so good that it feels like a big deal to be in the theater watching another installment? Star Wars. Avengers. Toy Story. These movies span in some case decades of our lives. And at least for me, Toy Story 4 didWhat other movie franchises are so good that it feels like a big deal to be in the theater watching another installment? Star Wars. Avengers. Toy Story. These movies span in some case decades of our lives. And at least for me, Toy Story 4 did NOT disappoint! After avoiding all trailers, I was totally captive as each twist, turn and new character presented itself. While it may not have quite had the epic climatic ending of Toy Story 3, it was equal in quality and entertainment value. Thank you to everyone involved in making this moving and memorable film!! Loved every minute of it!",
            "review_date": "2019-06-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Everyone love Toy Story, I dont know why the story ended like this, but I still love it.Thanks Woody and the gang for being part of my childhood.To infinity ..... And BEYOND !!!",
            "review_date": "2019-06-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Nice movie, fun and enjoyable. Is it the best animated movie ever? of course not. The only annoying thing was Forkie, the whole movie revolves around Forkie. It was too Forkie much for me.",
            "review_date": "2019-06-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Toy Story 4 is a swell adventure that may be a little hard to fully digest. This was the first film where we got to see Bonnie living with Andy's past toys and it felt a little dry if not disappointing. Not seeing Woody lead the pack was aToy Story 4 is a swell adventure that may be a little hard to fully digest. This was the first film where we got to see Bonnie living with Andy's past toys and it felt a little dry if not disappointing. Not seeing Woody lead the pack was a little disappointing. But I did love Bonnie's other not showed before toys that Woody interacted with! And along with that this becomes the first film out in the series to backseat characters like Buzz and Jessie almost entirely. They felt like they were just shoved in because of how iconic they were. When Bonnie made Forky it was instant magic. I just loved Tony Hale as Forky and the jokes. Boy did I laugh out loud to some of Forky's quips. When they arrived at the carnival I instantly loved the setting. The thrift store was very cool and the carnival was so hyper realistic. Now did I love the new toys here? I can't say I ever loved or connected with Gabby Gabby but I can say I enjoyed the rest of them. Duke Kaboom's back story wasn't as compelling as Jessie's but it added stakes to his small inclusion in this adventure. Ducky and Bunny were great, they formed as comedic reliefs and they did make me laugh multiple times. Now do I consider Bo Peep new? No. But her storyline and persona has changed enough to be discussed. I like How Giggle is now her sidekick, it's cute and her sheep had such a good inclusion. I did think Bo Peep seemed a little cynical in the beginning but I started to like her more and more towards the end. The large adventure in the carnival/thrift store was so breathtaking and funny that it helped mend the disappointments I had with the first act. But boy does the 3rd act swing you off your feet. It was a surprise I saw coming but it still hit me like a bullet train emotionally. It really took what happened in Toy Story 3 and multiplied it, even if it wasn't as well executed. Overall this film is a great addition to the franchise but still missed the mark from past Toy Story films.",
            "review_date": "2019-06-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I know what you’re thinking because I was thinking the exact same thing. Another Toy Story movie!? Toy Story was a trilogy, the story was done and each film was wonderful in it’s own way. Sure I love all three but the first will always holdI know what you’re thinking because I was thinking the exact same thing. Another Toy Story movie!? Toy Story was a trilogy, the story was done and each film was wonderful in it’s own way. Sure I love all three but the first will always hold the top spot. When I heard Toy Story 4 was in the works I was beyond disappointed, here it is, another franchise being milked until it’s dead, another money making racket, greed pulling the strings, be damned with the story and how wrong was I! I never felt Toy Story should have made another sequel and when it started I had endless doubts, I don’t think I can adequately explain how these all melted away in the first 20 minutes. Toy Story 4 is a gem, it’s right there with the others and deserves your time. I was in a cinema full of mostly adults (and the worlds quietest baby) and I think I can speak for almost everyone when I say we all thoroughly enjoyed it.Last time we saw Andy’s toys they were donated to his neighbour Bonnie and with Bonnie starting preschool she’s naturally nervous. She ends up literally making a new friend called “Forky” who is having some real trouble adjusting to the fact that he is now a toy and not just any toy, right now he’s Bonnie’s favourite toy. With Woody desperately trying to help Forky deal with his existential crisis and start embracing life as a toy. It’s funny, enjoyable for all and got the expected moments of sadness that comes with a Pixar movie. They really do love to try their best to reduce us into a blubbering mess at every opportunity. It may not be quite as emotional as Toy Story 3 but it still pulls at the heart strings nonetheless. The visuals get better with every film and if Toy Story 4 doesn’t get the Best Animated Oscar then something is seriously wrong, it makes you sympathize with a talking spork. If that isn’t good film making I don’t know what is.No, this film didn’t need to be made, but it’s another wonderful addition to the story, it’s funny and I loved the old and new characters. Keanu Reeves as the Evel Knievel style stunt rider Duke Caboom, the return of Bo Peep and as if we needed any more reasons to be creeped out by ventriloquist dummies now we have them. What’s not to love? Do I really have to sell this movie to you? We’re all suckers for a bit of nostalgia and many of us have grown up with Toy Story so what are you waiting for, get yourselves to a cinema and enjoy this heartwarming, gut-wrenching conclusion to the Toy Story franchise. Yes I know we thought the last one was the definite conclusion and it certainly had that feeling but I can’t see another after Toy Story 4. Did you hear me Pixar? Enough now, quit while you’re ahead. Highly recommended to everyone.",
            "review_date": "2019-06-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I know I'm about to parrot what everyone else is saying, but it's true. Toy Story 3 ended on a very definitive note. It felt the like the final chapter had closed and that there didn't need to be another film. Not to mention that after havingI know I'm about to parrot what everyone else is saying, but it's true. Toy Story 3 ended on a very definitive note. It felt the like the final chapter had closed and that there didn't need to be another film. Not to mention that after having created what is generally considered one of the strongest film trilogies ever made, Pixar would be tempting the fates by creating another one. But they did it! Toy Story 4 is an utterly entertaining film.This film's feel seems to be created to directly contrast with 3. Whereas the last movie was darker and felt stretched out, this film feels more lighthearted and fluidly compact. This is the installment that is trying the most to have fun.Don't consider this purely a frivolous film. The ending is almost as strong as in the last movie, and I felt that one was only better only by a thin margin. Things get pretty emotional.The entire film is about Woody (Tom Hanks) having an existential crisis. Once a favorite plaything and the leader of Andy's toys, Woody is now one of his new owner's least played with toys and being a newcomer, no longer the leader. His whole journey is pretty compelling.The biggest reason this movie justifies it's existence is that not only do we have closure for Bo Beep (Ghostbuster's Annie Potts), but her character is finally given justice. In the original film, it seems she was part of the cast just because they needed at least a couple female characters. Her role didn't serve much purpose other than to be Woody's girlfriend. Same with the sequel. You could've cut the character out, and it wouldn't affect anything. Then, in number three, she was just out of the story entirely, having already been sold to a new owner. The writer's reasoning at the time was that due to the heavy action scenes, I'm guessing primarily the moments where the toys are roughed up by toddlers, Bo Beep being porcelain and fragile was difficult to include. Here she's finally give her due. She has more personality, she has agency, and she is finally part of the action and story.New character Forky (voiced by Veep and Arrested Development's Alan Hale) is an inspired creation, a handicraft toy made out of a spork who's dealing with sudden sentience. He works well interacting with Woody as they share questions about their existence in the world. I actually felt the character was underutilized a bit. (It did annoy me a little that the writers were selective about how much or little knowledge of the world Sporky had.)The new villain Gabby Gabby (Christina Hendricks) is yet another emotionally damaged toy. Don't worry about her being a clone of the last two. They go down a refreshingly different path with her.Though I enjoyed the story, I do admit that the movie basically copies the formula of the first two films by having a few characters separated from the others and going on a journey. The movie may as well be called Woody Story as the majority of the cast is sidelined for the film and even Buzz is more of a supporting player. A lot of time is spent on the new characters. Though I can't complain much as they all are pretty entertaining. (Ducky and Bunny (Keegan-Michael Key and Jordan Peele) bring us the funniest joke in the entire series.)I'd rank this only under number 2. TS4 is a blast and I recommend this to all Toy Story fans.",
            "review_date": "2019-06-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The big question is, whether all of this was worth it? It's a big, yes. Anything for Woody. Infinity and beyond.Toy Story 4\n\nCooley understands the kinetic momentum of these Pixar productions. And Pixar might as well be like The Beatles,The big question is, whether all of this was worth it? It's a big, yes. Anything for Woody. Infinity and beyond.Toy Story 4Cooley understands the kinetic momentum of these Pixar productions. And Pixar might as well be like The Beatles, right now. Incredibly careful and sensitive about their releases. So it goes without saying that the film is ambitious and well funded and well casted. Yet, I find myself reserved giving everything to the film like I did to earlier ones. The director, Josh Cooley assembles the pieces as they used to be and has done a marvellous job regarding so. Addition to that, the equations that they are digging for, is something we all already have been wounded with, just a little scratch and tears come rolling out.Another success is how nuanced the political correctness and the metaphors regarding the current political conditions are. The conversation between Woody (Tom Hanks) and Forky (Tony Hale) while walking on a road (trip) is easily the best part of the film. The humor is balanced perfectly, especially when a new character is introduced in this hefty mayhem. Key and Peele are bromance-ing out amazingly, they have got some of the best scenes in their pocket. So what's left, why is it so far away from us.We don't mind the similar structure of the storyline- in fact in this one, the entire last act is quite intense- or the usual formula where or how characters overcome their issues. The primary reason why it doesn't welcome us is because there is no profound revelation in this film, that is going to leave you wiser after the curtain drops. And maybe still we could let that go, but unlike the previous installments this is also immensely effortful. You can see the pressure on the screen as they narrate the Toy Story 4, it is good that they were, but even Duke Caboom (Keanu Reeves) couldn't perform under pressure- that actually is the meta character who goes through similar issues like the makers, irony, that they forgot to solve their own.",
            "review_date": "2019-06-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It feels like this movie serves as an epilogue to the first 3 films, an epilogue that doesn’t need to exist, but is a funny, entertaining and emotional one nonetheless. Fantastic movie and a worthy addition to the Toy Story franchise.",
            "review_date": "2019-06-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "NOT FOR SMALL CHILDRENThe main problem with Toy Story 4 is that it is definitely NOT for small children. My 4 1/2 yo daughter enjoyed Toy Story 1, 2 and 3. Toy Story 4 terrified her. She kept saying she was scared and wanted to go home. WeNOT FOR SMALL CHILDRENThe main problem with Toy Story 4 is that it is definitely NOT for small children. My 4 1/2 yo daughter enjoyed Toy Story 1, 2 and 3. Toy Story 4 terrified her. She kept saying she was scared and wanted to go home. We considered it, but then my wife picked her up and held her on her shoulder and she fell asleep for the rest of the movie.Toy Story 4 has a dark and creepy tone and several scary ventriloquist dummies that hold other toys captive. For an adult the movie is OK, maybe a 7. The plot just isn't quite as complex or interesting as previous entries as I remember them, but it's entertaining. For a small child it's a 0, so giving this a 5 overall is actually generous.",
            "review_date": "2019-06-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "‘Toy Story 4’ is another triumph in the Pixar series. Just when I thought they were done at ‘Toy Story 3’, oh they fooled me! This was even more satisfying than the heartbreaking, yet warm conclusion, given from the previous. This movie was‘Toy Story 4’ is another triumph in the Pixar series. Just when I thought they were done at ‘Toy Story 3’, oh they fooled me! This was even more satisfying than the heartbreaking, yet warm conclusion, given from the previous. This movie was funny, sentimental, and all around, another amazing Pixar film. This will probably go down as one of the truest films I’ve ever seen. Even take that from an animated movie! The movie looked just as great as the newer Pixar films, Duke Caboom was an awesome addition to the gang, along with Ducky and Bunny adding hilarious lines in the mix, and they focused more on Woody, which I really appreciated. This fairly short animated film will go down as one of the best Disney has ever made, for me.",
            "review_date": "2019-06-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Toy story 4 is a classic example of excellence. Top notch animation,great story line and after watching the fourth sequence of toy story, you can still feel your toy's inner voices. 5 post credit scenes does hint that there will be part 5 inToy story 4 is a classic example of excellence. Top notch animation,great story line and after watching the fourth sequence of toy story, you can still feel your toy's inner voices. 5 post credit scenes does hint that there will be part 5 in nearby future. Bo's absence in toy story 3 has been justified here.",
            "review_date": "2019-06-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A movie that didn't need to happen, but still turned out amazing. It has everything you expect from a Toy Story movie, good characters, sad scenes, comedy, and more. A must watch for sure.",
            "review_date": "2019-06-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Was really not expecting to enjoy this movie but its ability to humanize the characters better than they normally do made it really enjoyable.",
            "review_date": "2019-06-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "As a fan of the original trilogy, I was not sure what I am walking into but Pixar has achieved perfection with this one; the story, the animation, the metaphors and the heartfelt dialogues made it the best movie of the year for me!",
            "review_date": "2019-06-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is the movie Rian Johnson would be proud of. Not in a “oh,so terrible” way ,but in a great way. If this was his directorial debut in the field of Animation,this is exactly what would’ve been.Toy Story is a special franchise for me.This is the movie Rian Johnson would be proud of. Not in a “oh,so terrible” way ,but in a great way. If this was his directorial debut in the field of Animation,this is exactly what would’ve been.Toy Story is a special franchise for me. This is the one that started it all: my passion for Movies,my huge love for Pixar and my passion for Art in general (had it not been for Toy Story,I wouldn’t have known what Alien or Fight Club were). And it’s still my favorite Trilogy to this day,being such a continuous franchise of movies where they span every idea the Directors and Writers sparkled in their tiny little heads (In 2004,Toy Story 3 was supposed to be a rescue mission to save a malfunctioned Buzz Lightyear. The malfunction does happen in here,with another character in an interesting way).And Disney,being the cash-full House Of Mouse that it is,forced Pixar (?) to make another one,where giant worries boomed on Social Medias,thinking it would ruin the franchise with a sequel as good as “Cars 2” or “Monsters University”. Personally,I was excited for it,because,unlike the other “new sequels” (not counting TS3 or Cars 2),this did feel like Nostalgia-Bait done right.And,while Toy Story 4 may be just what I expected,it also had a lot more to offer beyond “this wasn't really unnecessary…”. New characters you actually root for,big laughs that makes it the funniest of thel 4,and a huge sense of emotion that invested me in so many ways. Oh,and also,many new ideas and stuff like that…Right from Frame 1,I had a smile so big,you have no idea...Ok,so to start… Am I the only one who can’t shake the feeling that Woody was like Marlin from Finding Nemo? Sure,it leads to an emotional conflict that will have the lasting power to him until the end of the movie,but think about it: He’s the overly protective toy who “needs” to protect Forky because he wants to make Bonnie happy. Hey,he beats Marlin in terms of protectiveness…This is definitively Woody’s story. So much so that, unlike previous installments,other characters get either overshadowed or used for a funny subplot (mostly Buzz Lightyear). And when you see Woody’s plot unfold,that’s where it’ll get all “Rian Johnson”-y,as the plot twists are EXACTLY what a Director like him would do. Someone may have a problem with that twist,but it’ll make a majority of the Audience bawl their eyes out (I,like,did totally not cry at this btw… It’s not my fault the theatre flooded…)The new characters do not feel unnecessary and/or annoying. Forky is the character everyone will ironically relate to in 2019 for the sole fact that he thinks he’s Trash. Ducky and Bunny (played by Key and Peele) steal every moment of the movie,and Keanu Reeves doesn’t disappoint in here as a Canadian Stuntman. I hope he makes more Animated movies like this…This is,first and foremost,a love letter to all Toy Story fans. Not in a “let’s stop our movie so that they can see a Captain America vs. Himself fight” kind of way. Little details are sprinkled here and there while the big picture is narrated,and it makes the movie the “Ready Player One” of the Toy Story franchise. And it’s all accompanied by beautiful Animation that only stops for a second to be like “look at the pretty Animation!” (unlike the other final movie everyone loves for strange reasons…). Now we can also make Mud realistic,FORK YEAH.I love how everything feels like a Videogame,specifically the Second Chance antique store. Either a Haul or a dusty hallway feels like a Super Mario game. A Haul is World 1,while a Closet is the Final Boss Fight,while the outside of the store (with the Trash Cans) is a Secret Level.And,to finish it off,when the Third Act rolls,BRACE YOURSELF,because that’s only designed to be an Emotional Challenge,which puts TS4 as the most personal I’ll ever get since Finding Dory. I adore these characters,and they’re a giant part of what made my Childhood in the first place.As for flaws,besides the final scene (where only a few will be perfectly and emotionally fine with it),the Randy Newman score was just an “Eh?”++. Nothing super bad or mediocre,but a rehash of certain themes make it sort of annoying,although,in the context of the scenes in which they’re played,it makes so much sense. Overall,there’s really nothing to say besides “I love this movie,man…”. Oh,and stay for the Credits. This time,you won’t regret it,I promise.",
            "review_date": "2019-06-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Toy Story 4Sub-label - the absurdity and strength of the dark momentTranscending metaphorical lines through toys,A lot of joyful plots cover up the real bumps,Strong emotional interaction contrasts with throwable items.Not a simple comedy.",
            "review_date": "2019-06-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "New story as New begining for W, watch it with my childrens. 9 of 10, - 1 for buss story",
            "review_date": "2019-06-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Easily my favorite movie of the year so far. It keeps up with the consistency of the franchise of delivering great stories with very deep and emotional themes.",
            "review_date": "2019-06-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I was surprised to see a theater full of people on a kids' movie at 7pm on Sunday.But I shouldn't have. It's a Pixar movie after all. Long time ago I figured out that Pixar always remembers that kids usually go to movies with parents orI was surprised to see a theater full of people on a kids' movie at 7pm on Sunday.But I shouldn't have. It's a Pixar movie after all. Long time ago I figured out that Pixar always remembers that kids usually go to movies with parents or other adults. The adult audience is as much a target as kids, in ALL Pixar productions. Additionally, the Toy Story 4 was ripe with references to previous series for Toy Story aficionados.My kids grew up with Toy Story 1 and 2. I haven't heard about their impressions on the newest sequel yet.I expected tons of humor and emotions from the film, and they were delivered. Yet I would not call it my favorite Toy Story sequel. It is very hard to keep the bar that high.If you are one of Toy Story or Pixar aficionados then definitely go see it.",
            "review_date": "2019-06-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is a great continuation of the Toy Story series! It has the perfect amount of humor and entertainment to make it an amazing movie.",
            "review_date": "2019-06-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Nine years ago, Pixar achieved something that seemed impossible and they gave an excellent ending to the story that put them on the map.When they announced Toy Story 4 I wasn't excited at all. Even with the all love I have for theNine years ago, Pixar achieved something that seemed impossible and they gave an excellent ending to the story that put them on the map.When they announced Toy Story 4 I wasn't excited at all. Even with the all love I have for the characters, I was 100% convinced that their cycle was over.They were still united and would start again so what was the need for a new story?After watching Toy Story 4 my fears were confirmed and Pixar managed to undo their grand finale and despite the good thematic and its emotional ending, Toy Story 4 falls short to its predecessors and that emotional ending manages to disrupt the union of the characters, maybe forever, and that before my eyes is unforgivable.No doubt Toy Story 4 is about moving forward and growing and it express it in a more direct way than the third film because now those emotions are for Woody and not for Andy and yet I cannot stop thinking that Pixar went to a place that shouldn't have gone with these characters.This is still Toy Story - although the show now belonged completely to Woody - And the quality is still there, that is undeniable. The jump in the animation is simply breathtaking but Toy Story 4 is a very good sequel that should never have existed in the first place.",
            "review_date": "2019-07-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Amazing animation that you would come to expect from Pixar however the story is a bit boring. The first 3 toy story’s were some of the best animated films every made but this one didn’t live up to those high standards. Villain was a bitAmazing animation that you would come to expect from Pixar however the story is a bit boring. The first 3 toy story’s were some of the best animated films every made but this one didn’t live up to those high standards. Villain was a bit underwhelming and story never really got that exciting. Forky and the new characters are pretty funny and add some depth to the film. Always great to see Woody and Buzz on screen again.  Still a good Pixar movie just not one of the best they’ve ever done.",
            "review_date": "2019-07-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nE-Value: 9Acting: 9Plot: 8Although Toy Story 3 had a perfect and emotional conclusion to the trilogy nine years ago, the Toy Story series continues to move forward with the fourth instalment and continues the adventures of Woody, Buzz Lightyear and the other toys under the Bonnie’s ownership.Two years after the events of Toy Story 3, Woody (Hanks) felt that he is being neglected by Bonnie because she has not played him as her toy as she preferred to play with other toys. During the orientation day at Bonnie’s kindergarten, she makes a new toy from trash materials and a fork. She named her toy as Forky. Woody befriends with Forky but he keeps going back into trash can because he believes that he a trash and not a toy. Woody tried his best to convince Forky that he is not a trash but Bonnie’s toy.After the orientation day, Bonnie and her family go on family road trip which she brought some of her toys including Forky and Woody. Forky jumps out of the RV which forces Woody to go rescue him. Separate from Bonnie’s family and her toys, they travel to a nearby town and come across an antique shop where they got ambush by some ventriloquist's dummies led by a doll named, Gabby Gabby (Hendricks), who wants Woody’s voice box.Unfortunately, Woody escapes the antique shop without Forky. Not wanting to leave him behind, he tries to figure out a way to rescue him. In the process, he reunites with Bo Beep (Potts), who was given away prior to the events of Toy Story 3 and now lead a new lifestyle. She agrees to help Woody rescue Forky while Buzz plans a rescue mission on his own to save both Woody and Forky before it is too late.Much like the previous Toy Story movies, Toy Story 4 continues to be the one the greatest animated movies of all time. While some animated movie series gets worse with their respective sequels, the Toy Story series is not one of them. Not only the animation is great, the plot, humours and the character developments are well written, executed and nothing too cliché. Woody and Bo Beep had the best character developments which is one the best parts in the movie.The voice acting from the cast never ceases to amaze me especially Tom Hanks and Annie Potts whom they deliver an emotional performance. Keanu Reeves, who voiced Duke Caboom in this movie, also gave the best performance in his voice acting. I never really expected that he could play a comedic role since I always see him more an actor who always gets typecast into action movies. He really does provide the best comical relief moments in the movie.The ending of this movie is very emotional, beautiful and great at the same time. You will get the same feeling from the ending of Toy Story 3. The only downside of Toy Story 4 is some of the toys such as Jessie and Rex had limited screen time and played more of a supporting or minor role. It is not too disappointing but I wish they have more screen time. Nevertheless, Toy Story 4 is simply amazing and a masterpiece. Whether there will be the next Toy Story movies or not in the future is up for debate. Last but not least, do stay back awhile for mid-credits scenes.",
            "review_date": "2019-07-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is the best movie of the franchise as well as being the funniest. The villain also has interesting motivations",
            "review_date": "2019-07-10",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 157
}