{
  "title": "Kazaam",
  "rating": 5.8,
  "release_date": "1996-04-17",
  "genre": [
    "Fantasy",
    "Comedy",
    "Family",
    "Musical"
  ],
  "summary": "When young Max bumps into an abandoned boom box, he's shocked when it releases a tall, Black genie named Kazaam (O'Neal), who grants the kid three wishes. The two become friends, and Max wants Kazaam to help him track down and ultimately save his father from criminal entanglements.",
  "critic_reviews": [
    "The movie is decidedly old-fashioned, aiming to send kids and their parents out of the theater feeling good about themselves.",
    "It's probably just passable for children, but adolescents won't sit still for this bland mixture of mediocre jokes and soft-core action.",
    "With its uneven mix of comedy, melodrama and action, pic will need all the help Shaq's name and a rap soundtrack can provide.",
    "Alas, the movie's producers could use a genie of their own. Surely, if granted three wishes, they could have produced a better film.",
    "As for Shaquille O'Neal, given his own three wishes the next time, he should go for a script, a director and an interesting character.",
    "Is Kazaam racist? In effect, yes. But it'sracism linked to bad marketing: You can't really mix a black-pride rap film with a revamped version of \"Free Willie\" and expect them to magically jibe.",
    "It takes the movie all of 15 minutes to descend into sub-Spielbergian banalities about poor Max's search for his absentee dad.",
    "The odd truth is that the film's novice star is better than the material.",
    "Memo to Shaquille O'Neal: Don't give up your night job.",
    "The plot is hamstrung by trite formulas, and there's too much violence and family tension for very young viewers. Shaquille O'Neal is likable as the title character, though.",
    "This is as witless as movies come -- an unamusing, moronic blend of horrible acting and inept screenwriting.",
    "Original enough to come up with new ways to go wrong. For one, the film is a blatant showcase to promote O'Neal as a rap artist.",
    "It's full of special effects that are big on smoke and noise, but short on logic and payoff."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "The kind of movie you really wish you could forget you enjoyed at some point in your life. So much bad writing. So much bad acting.",
      "review_date": "2012-11-28"
    },
    {
      "review_title": null,
      "content": "I Love this movie so much, Truly life-changing It makes me smile so much every time I see it. I love the character development and the plot. It cured my cancer and my ED, I really don't know what I would do without it anymore. I watch it atI Love this movie so much, Truly life-changing It makes me smile so much every time I see it. I love the character development and the plot. It cured my cancer and my ED, I really don't know what I would do without it anymore. I watch it at least 7 times a day and have bought over 7,000 copies. Shaq's face is the last thing I see when I go to bed and the first thing I see in the morning. It lightens my mood all of the time! I Love Shaq and his muscles I want him to pick me up like a baby and smother Icy-Hot all over my body. I love all of Shaq's work like Space Jam,Kazaam,Billie Jean. His music and his soft voice helps me with my love life and my wife doesn't complain either. Watching this movie is a whole entire different sexual experience. Every time I watch it calms me down and doesn't make me hit my kids(They are 3 and 6). Shaq's rock hard abs are the only thing stopping me from dropping my kids Chris Brown 1-2 style. So anyways it's and Okay movie.",
      "review_date": "2021-03-07"
    },
    {
      "review_title": null,
      "content": "Entertaining fable for kids, and not at all \"dark\" ( as some critics said it was) by present day standards and sensibilities.",
      "review_date": "2007-09-10"
    },
    {
      "review_title": null,
      "content": "This movie is not merely a waste of time; it has also caused me to lose the ability to have children. Shaq should stick to missing freethrows and fouling people, rather than trying to act in any capacity and thus costing people the ability This movie is not merely a waste of time; it has also caused me to lose the ability to have children. Shaq should stick to missing freethrows and fouling people, rather than trying to act in any capacity and thus costing people the ability to reproduce.",
      "review_date": "2006-02-18"
    },
    {
      "review_title": null,
      "content": "Ok, so I can't tell if Ryan, and Connor K. and Jake are being sardonic, but i really hope they are cuz this is just a terrible movie. But, if u love marijuana and stupid funny movies (which i do) this is definitely a 10.",
      "review_date": "2006-02-25"
    },
    {
      "review_title": null,
      "content": "Wosmfodmskmdkdmdodmksmsodmkdmdkdormkeodmdosrmelmrkmkkkk@#$%^^&**().,??!!;::'bvb:;:;;:;;:;;+×÷=□◇◇○♡○◇▪●■▪.",
      "review_date": "2021-05-04"
    },
    {
      "review_title": null,
      "content": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●$$$$$$$$$$$$$$$$$$$$$$$$$$$$%&%&%&%&%&%&%&%&%&%%&",
      "review_date": "2021-07-19"
    },
    {
      "review_title": null,
      "content": "I am currently plummeting to my death under the golden gate bridge and Kazaam (1996) directed by Paul Michael Glaser and starring Shaquille O'Neal is the only thing I can think about. Kazaam (1996) directed by Paul Michael Glaser and starringI am currently plummeting to my death under the golden gate bridge and Kazaam (1996) directed by Paul Michael Glaser and starring Shaquille O'Neal is the only thing I can think about. Kazaam (1996) directed by Paul Michael Glaser and starring Shaquille O'Neal was the only meaningful thing to occur in my life. Thank you Shaq. For everything.",
      "review_date": "2023-03-16"
    }
  ],
  "num_reviews": 21
}