{
    "rating": 7.7,
    "release_date": "1991-12-12",
    "num_reviews": 123,
    "genres": [
        "Comedy",
        "Drama"
    ],
    "summary": "An anthology of 5 different cab drivers in 5 American and European cities and their remarkable fares on the same eventful night.",
    "reviews": [
        {
            "review_title": "Jarmusch as humanist; one of the best films of 1991",
            "content": "Jim Jarmusch, a director who never neglects to find the time for the little moments, glances, exchanges in dialog, that bring out the better (or lesser) in people, puts his skills to full force in Night on Earth. Another in his several episodic-style films, this time he pushes forward his great use of pure conversational, and emotional, comedy, as well as drama. In fact, this may be one of the best from the 90's of that kind that came out (i.e. mixing comedy and drama to create some bittersweet vignettes). Inspiration of course pours out from European cinema, but even in the American segments there's a sense of genuine pathos with the characters. Sometimes one style was kept totally consistent, with all comedy in episode four or all tragedy in episode five, or the two styles went back and forth like in the first two. The third remains the more ambiguous, and maybe more uncomfortable, segment of the bunch, and even if it might be the lesser of them all it's still fascinating due to the actors.But to get back to the humanism that comes on in the film, it's not something at all uncommon to Jarmusch's work. In Ghost Dog it goes a long way to help us not be too left out of the world of Whitaker's character, or it makes every lady seem all the more odd and unique in Broken Flowers. Here since it is met with a more realistic approach, with situations that could be happening right now at night in these cities, I'm almost reminded of Renoir. Particularly in the second segment in New York, where there's the perfect divide between lightness and over-the-top- lightness being in Armin Mueller-Stahl's performance as Helmut (German ex-clown turned un-knowing cabbie) and Giancarlo Esposito's performance as Yo-yo. Maybe it's because scenes like these usually wouldn't make it into 'mainstream' fare, but a sequence like this showcases some great dialog on both sides (and when Rosie Perez comes in, all bets are off). Stahl especially makes the scenes work in-particular as he almost seems to inhabit this person of an outsider in the (taken for granted) amazing space of NYC.To say which one was my overall favorite might be a little picky, as every one of them had something to offer differently. There was the cute, and slightly awkward, scenes with Ryder and Rowlands (maybe one of Ryder's few gems in her career too, mostly based on style). The segment in Paris, again, may make one feel a little uncomfortable, but that might be the point. And I loved how Beatrice Dalle's role went effortlessly between the bizarre and the almost ironically compassionate. It's also the segment which provides a little extra bitter of a touch by way of the Ivory Coast cabbie, however it does come to pass as being about two outsiders thrust into a strange little moment in life. Roberto Benigni's segment was drop dead funny, which is surprising considering the hit or miss ways of Jarmusch's comedy. But Benigni is so outrageous in his long monologue its no wonder what becomes of his passenger. It's a terrific mix between Benigni's voracious style of fast (but not too fast) speech, and a sort of silent-film kind of comedy, likely out of Buster Keaton or something. And all of this is accentuated by a carefully controlled mis en scene of driving (which is always visually endearing), where right when you're expecting there to be a cut it waits one or two extra seconds. It's a film with a sweet rhythm that doesn't drag like in Jarmusch at his worst.The last segment, oddly enough, could be a downer for some. It was for me, until I decided to watch it a second time. This combines the frustration seen in bits in the other segments regarding a city life that bogs down on its inhabitants, and the sympathy that can come out even behind the tough veneer of lives lived with a shell protecting them from idiots. When it comes time for Matti Pellonpaa's monologue, it makes for the most touching, and a close-call for most emotionally striking, thing Jarmusch has ever written, put together by his portrayal. What's interesting even more so is how the film, despite this bleak story, doesn't seem to end too much on that note, due to the last little bit between Mika and Avi, the drunk passenger. In fact, after watching this a second time, I got to get the sense of what the film might be about- getting past that separation between a driver doing his job and a passenger with their own issues. It's also a small ruby of a communication fable, of how lives in different cities and countries may be of course different in speech and attitude and dress, but have similar plights to deal with in the dead of night.",
            "review_date": "2006-01-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The good old world",
            "content": "Jim Jarmusch does for movies as Tom Waits does for music, no wonder he uses his music in his films. I've seen this movie over and over, its truly wonderful. We glimpse A side of the world that is the same no matter where you go. The world is round so no matter where you go you are always in the center of it. Here we catch a Taxi in different cities around the globe and although the cultures are clearly different , there is something of the blues in each act. I can't make out which one is my favorite, they all have a certain magic to them that totally captures to mood of the country we are in although the mood itself is that of the night where not much seems to be going on really except in our taxis. Each scene in this film is a masterpiece, no matter which country Jarmusch takes us too. Of course Benigni needless I mention is that little bit more of a of a superstar but for that matter so is the blind girl in Paris. Great music, great photography, great acting, its all good. Its magic!",
            "review_date": "2006-11-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Original, funny and tragic",
            "content": "Jim Jarmusch does an excellent job in creating character conflict and intriguing, realistic dialogue.  But what I admire most in this movie are the opening scenes of every segment.  He knows how to capture the essence of every city and how to establish mood.  National Geographic has nothing over Jarmusch's photographic talent.All segments are well written and tie in with the respective cities that are the back drop of the film: LA, NY, Paris, Rome and Helsinki.  The Helsinki segment is the most depressing and it's kind of a bummer that the movie had to end on that note.  The Paris segment steals the show.  Incredible camera work and terrific dialogue.Overall, the movie gave me a renewed appreciation for cinema.  Thanks Jarmusch.",
            "review_date": "1999-06-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I wish to Marry that Blind Lady , Facinating work of Jim Jarmusch , This Movie is my All Time Favorite ( French A+ Movie) My Ratings 10/10",
            "content": "Excellent movie 'composed' by Jim Jarmusch. I absolutely love everything about it, from excellent soundtrack by Tom Waits to beautiful city scenes that make my wanna sit & gaze for hours. A wonderful examination of human interaction, hilarious, melancholy, and everything in between. Jarmusch is a master at his craft.",
            "review_date": "2020-03-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Funny as hell",
            "content": "It's not that this movie is non stop laughs, but just that it is so smart and such intelligent humor. It's got a clever premise about five short stories involving cab rides in different cities, but it's the specific situations that will crack you up. One after another, they are all hilarious. Roberto Benini's scene had me laughing out loud, and that never happens. The only sketch that wasnt so great was the opening one with Winona Ryder. Everything that followed it rocked and impressed the hell out of me. A smart comedy. not too many of those.",
            "review_date": "2001-11-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the great \"world-movies\"",
            "content": "In the early 90's Jarmusch delivered this charmer, a movie that unites America and Europe through one single topic, yet shows very different versions of it.At probably the exact same moment people around the globe get into taxis. A stylish Hollywood casting agent mounts a cab in L.A., in New York it's a hapless poor man trying to get home, in Paris we encounter a blind woman, in Rome a priest and in Helsinki a bunch of drunks will tell their story. Yes, indeed. Stories are told, because each episode is an encounter with the respective cabbie, who all have a life and a past of their own.Wynona Ryder's performance of the 20-year-old, chain-smoking taxi driver does not work very well and also makes for the least interesting story. But Armin Müller-Stahl as an East-German refugee and former clown, who is awe-struck and belittled by the bustling NYC around him makes up for a lot. His helplessness when trying to communicate with his passenger, played by Giancarlo Esposito, almost becomes tangible when it manifests in his complete inability to steer the taxi. Within very few minutes the two men develop an utterly deep and good-humored trust and friendship between them. I'd call it the funniest portion of the movie, but in Rome we encounter Roberto Benigni as an always talking, sex-obsessed cabbie. His is the story we get the least emotional or intellectual outcome from, but, hey, welcome to the Benigni Show! If you are open-minded enough to laugh about a few surprises in the field of sexual experimentation (which we don't see but only hear described without too much detail), this one will stay with you as one of the brightest twenty minutes in your life. Before Rome we visit Paris with the most mysterious, yet most catching segment, a curious story about the afore-mentioned blind woman and a black cab driver, who - we can't be sure - might be going blind himself (he's very short-sighted and therefore has problems with driving his taxi) and has a lot of questions to ask. The woman, however, is not interested in conversation, yet we get the impression she opens up more than the driver realizes. In Helsinki a group of drunks tell the story of their sleeping friend's worst day. The cab-driver listens to it. It's a terrible story about a horrible predicament and the poor fellow's life basically lies in ruins. And yet the cabbie tops the story with one of the saddest things you'll ever have heard.The concept of the movie thinks of night as a place rather than a time, because all of the stories begin at the same moment in time but in different time zones. We move east in the process of the film and so we experience sunset in Los Angeles and early morning in Helsinki. Each of these times lends a special atmosphere to the story it tells, which becomes the most effective in the Helsinki story, which is utterly sad, however ends with a new day starting. People leave their places and go about their lives - the world moves on, none of the stories has an ending, life for each of the characters (except one) will continue.What's so great about this movie is that it tells such different stories with such different characters who all have different pasts and intentions, each accommodating the place of action (even visually - in L.A. even the buildings appear to be candy-flavored, while in Helsinki the city is cold, drab, yet hopeful) and it all comes together to this huge picture, which reminds us that we are all different but all live on the same planet and know similar things about life, death and everything in-between. I wonder what this movie would have been like, if Jarmusch had also considered taxis in non-western countries.I highly recommend this movie to anyone who... Oh, blast! I recommend this movie to everyone.",
            "review_date": "2003-03-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Original, interesting and wonderfully warm and engaging",
            "content": "One night, five cities, five taxis. Five short stories set in Los Angles, New York, Paris, Rome and Helsinki involving taxi drivers, their customers, new connections made, lessons learned, opportunities and pain.Written and directed by Jim Jarmusch, Night on Earth is a collection of five short stories with the link being that almost the entire story plays out in taxi with the main character being the taxi driver. The five stories occur roughly simultaneously in five different cities across the globe on the same night. Highly original in concept and setting.Each story is wonderfully crafted by Jarmusch, with interesting, engaging characters and great interplay between the driver and their customers. There's also some interesting, edifying themes to the stories, presented in a subtle, non-confrontational way. Each story gives us different types of characters and different tones (and apart from Los Angeles vs New York, different languages!).Cast is filled with big names - Winona Ryder, Gena Rowlands, Giancarlo Esposito, Armin Mueller-Stahl, Rosie Perez, Roberto Benigni, Beatrice Dalle - and nobody puts a foot wrong. Other than Gena Rowlands, none of these were huge stars yet, so Jarmusch certainly had an eye for emerging talent. The stand-outs are Winona Ryder as the rough, tomboyish Corky and Roberto Benigni as the hilariously funny Italian driver.Great film.",
            "review_date": "2020-06-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of My Favorite Films!!",
            "content": "Since I have almost seventeen years of experience in the taxi business as a dispatcher and driver, I have to say that \"Night on Earth\" is one of my favorite movies! This movie gives a very real and comical portrayal of life in this line of work. I've known people who were given great opportunities, and rejected them. I've personally kicked drunk idiots out of my cab. I've had blind people tell me which route to take. I've had people who were so \"down and out\" tell me their life story. This is a film that portrays what taxi driving is all about, and it is not limited to the USA. People are the same all over the world! This movie is not yet available on DVD in the USA, but I really hope it will be soon!",
            "review_date": "2003-01-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "5 little stories, 5 cities, 4 languages - surprising",
            "content": "A fantastic piece of entertainment: five little stories, five cities, four languages. That's all. This movie has no message but it portrays five regions of the world most sensitively.The L.A. episode is the weakest. It is not bad but it has one big problem: it is the first one. People start watching the movie and expect something sensational. This first episode cannot present anything spectacular, only first class character acting. There are no big surprises or twists, the episode is not particularly funny or anything. Honestly, when I saw the first minutes of this movie I thought: `O dear, I'm going to fall asleep!'Then, the N.Y. story came. This one made me laugh real hard, and it made Armin Mueller Stahl one of my favourite actors. I started to love this movie, and I was well prepared for the Paris episode, which is, in my opinion the best, the most satisfying of them.I found the story of the Roberto Benigni episode rather stupid, but his talent in exaggerating (so he did this even seven years before 1999's Oscar ceremony!) made up for it.Then, the huge contrast: The liveliest episode is followed by the dreariest. Finnish workers tell each other stories from their lives, each trying to tell the saddest.`Night on Earth' is not a movie for everybody but I think it is, in any case, the ideal movie to watch on television at two o'clock in the morning.",
            "review_date": "2002-01-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful, captivating and a great journey among the quest of human struggles.",
            "content": "I was intrigued by the strong captivating energy of the characters and especially the use of (joyful) music along the ride. It FELT like we're with them in the cab, listening to their struggles and staring at each other through the rear view mirror to find out more about them. Each section with a vibe and magic on its own... and I was happy to see five different city scapes riding by the window...just like we're there, in summer, autumn and spring and winter... curious things happen in the night! Sure, some elements seem overly exaggerated (like an italian couple making out twice in the Rome part... what a clichee!), but it still felt like additions to the phantastical and humorous vibes. A timeless movie that still captivates the struggles of humanity and teaches us countless lessons. A film to be watched over and over, ageless, timeless, endless.",
            "review_date": "2020-12-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The best film of Jim Jarmusch",
            "content": "For me this film is the best of Jarmusch and one of my favorites films ever. The reason is simple: Is original, yes this film is one of the most originals films in a lot of years, the five stories, the five different cities and is all only in one night, for me that is awesome and excellent because Jarmusch is the only filmmaker that could do that. About the film: well my favorite story is the one with Roberto Benigni that takes place in Rome, the reason is Benigni, because for me this is the funniest performance of Benigni and well the story is great, the part when Benigni tell his story about the sheep is just very funny and of course the other five stories are great. The other story that i loved is the one that takes place in New York with \"Helmut\" is very funny and i think that Jarmusch want that: funny and great stories with a message like the message in the one that takes place in Paris, whit the blind girl and the taxi driver. Well this all i can say about a great film and well i have to say that hope that you can see this film and enjoy Roberto Benigni, Winona Ryder and more (yes the cast is great). Night on earth: 10 Roberto Benigni: 10",
            "review_date": "2007-03-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What a night!",
            "content": "I think whenever you crave a late night out but can't get out of your bed you'd better watch a Jarmusch film instead while lying on your bed under a blanket with a big cup of tea in your hand. The common element that can be traced in all of his films is that he captures these laid-back vibes of such nights to a tee. In Night on Earth, we see nocturnal cityscapes of gloomy, empty streets before getting in a taxi with eccentric yet amicable strangers of different cultures, ceaselessly chatting over trifles of otherwise moral value, all while the tires humming over the asphalt roads and the cool, fresh night air tapping on the car windows. This is basically the whole movie!The five-segment anthology takes place inside taxi cabs across five different cities on the same titular night. The first one is set in Los Angeles, and features a chain-smoking, gum-chewing, tomboyish taxi driver (Winona Ryder) and a classy casting agent in Hollywood (Gena Rowlands). This is probably my favourite out of all the five vignettes next to the second one, which takes place in New York where a German cabdriver (Armin Mueller-Stahl), with a background that remains ambiguous, is lost in a city and culture he doesn't understand. This one genuinely got a few chuckles out of me. The third episode, that's in Paris, is relatively a bit heavier on its message but is more than made up for it thanks to a brilliant Beatrice Dalle as a woman with hyper-acute senses compensating her lack of sight. In the fourth one, which takes place in Rome, we witness Roberto Benigni being Roberto Benigni as he confesses his sins to a priest (Paolo Bonacelli). The final one taking place in Helsinki is by miles the bleakest of them, imbued with a deadpan undertone but suffused in a sorrowful and grieving tone.Jim Jarmusch values the brief, ephemeral encounters of people who had never met before, and likely would never meet again. People of nature peculiar to yours but actually quite normal once you get to know them. It's all about everyone's own attitude to life; everyone's priorities shaped by their own environment or according to their life path of their own choosing. And without Jarmusch's signature languorous aura that ties up all the segments together and casts a magical spell on the mundane to turn it to something rather celestial, this night on earth would've been a lackadaisical one with nothing memorable.",
            "review_date": "2021-07-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The most under-rated film in history!",
            "content": "No one I ever mention this film to has heard of it, let alone seen it! I actually tried to see Thelma and Louise at the cinema when Night on Earth came out, but as it was sold out, I saw this instead - what a lucky break! The film is actually 5 short films of around twenty minutes, each one a taxi journey, taking place at the exact same moment in 5 cities across the world, from LA to Helsinki, via New York, Paris and Rome.Without ruining the surprises contained (its unexpectedness is one of its delights) the film covers numerous emotions. At times it is utterly hilarious, at others it's sad and moving. It is pacy and yet considered, the characters are well painted, both by the writing and the acting, and the story lines engrossing yet punchy. There are some sub-titles, by the way, but please don't let that put you off. It's not one of those intellectual \"aren't I clever\" films.If you like your films classy, well written, well acted, intelligent, thought provoking yet accessible, and with a great soundtrack (Tom Waits), then Night on Earth is for you! Share it!",
            "review_date": "2006-09-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful taxi ride",
            "content": "At the same time, in five world metropolises (LA, NY, Paris, Rome and Helsinki), five taxi drivers have unusual night rides, through which we get to know various life stories. There's no much action in this movie and it's mostly comes down to dialogues between drivers and their passengers. It's interesting that each story is filmed in a language that is native to the city where the story takes place. So, if you don't speak all four languages, it's impossible to watch this without subtitles. Bit of emotion and bit of humor nicely mixed by recognizable recipe. In all of his movies music plays important role and in this one legendary Tom Waits had crucial part in making magical atmosphere typical for Jim Jarmusch.8,5/10",
            "review_date": "2017-12-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "fantastic",
            "content": "Jim Jarmusch does a great job with vignettes, as we've seen in \"Mystery Train\" and \"Coffee and Cigarettes.\" Here he unites the world with the same incident -- someone taking a cab -- but different experiences in different cultures.Gena Rowlands is a casting agent landing in LA and being picked up by an offbeat taxi driver (Winona Ryder); Armin Muller-Stahl is an ex-German clown driving a cab in New York who picks up Giancarlo Esposito (who ends up driving) and later Rosie Perez; Isaach DeBankole is a taxi driver in Paris who throws three idiots out of his cab and picks up a blind girl (Beatrice Dalle); Roberto Begnini is a taxi driver in Rome who confesses all kinds of sex acts to the bishop he's driving (Paolo Bonacelli); and Matti Pelonpaa is a cab driver in Helsinki who tells his sad story to his passengers.Each vignette is wonderful and indicative of the country in which the characters reside. My favorite is the New York City sequence, which is out and out hysterical, with Armin Muller-Stahl, Giancarlo Esposito and Rosie Perez, all of whom are fabulous. And if you ever lived in New York, you can relate to the difficulty in getting a cab that will take you to the boroughs, especially late at night - it was all so typical, as the scenes in the other countries probably were as well.I would have to put what is practically a monologue by Roberto Begnini next. It's definitely the most absurd as he confesses the grossest things to the overwhelmed bishop. Very black comedy.If I have a least favorite, it's the first one, as it was fairly predictable and Winona Ryder as a taxi driver with aspirations to be a mechanic was unconvincing. Gena Rowlands, however, looked gorgeous and has an in joke while on the phone: \"I'm supposed to have dinner with Shera and Peter tonight,\" meaning Shera Danese and Peter Falk, best friends of the Cassavetes.In \"Mystery Train,\" Jarmusch shows people visiting Sun Records and ties them all together with one incident, and we see what each character is doing at the time it happens. Very clever. Here, the thing that unites these characters is a cab ride.Very, very enjoyable, with lively characterizations, beautifully directed. Jarmusch is a quirky talent but a great one nonetheless.",
            "review_date": "2013-03-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "each vignette good in a different way",
            "content": "I suppose people will typically talk about they loved the NY and Rome stories, but hated the Helsinki segment, or vice-versa, or whatever. This probably comes from thinking of the entire movie as belonging to a single genre--drama, comedy, satire. If you take each story by itself, though, with an open mind, you will find yourself being entertained (mostly) in five different ways. Although of course we will all have our favorites. I wondered briefly why there wasn't a segment set in Hong Kong, Singapore, Japan--to make it truly global. Of course it wouldn't be night at the same time on that side of the world. Jarmusch should have done it anyway.Some think the movie is too long. But this is obviously a movie you don't need to watch in a single sitting; indeed, for the reason stated above, it's perhaps best watched a little at a time.",
            "review_date": "1999-04-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A mixture of dialogue and couleur locale",
            "content": "\"Night on earth\" tells the story of 5 nightly cabdrives in respectively Los Angelos, New York, Paris, Rome and Helsinki. The first and the last are in my opinion the most worthwile. New York and Rome are too hilarious and Paris is too artificial. By the way the Helsinki episode works with a cast of Kaurismaki actors.Because all the cabdrives take place during the night the clienst are rather excentric and the conversations with the cab driver lively. The music of Tom Waits mey not be a very obvious choice but it works surprisingly well.The film, which is close to mainstream for a Jarmusch movie, consists of a mixture of dialogue and couleur locale. In New York for example a black man is having trouble finding a cab due to racism.",
            "review_date": "2021-08-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "You can have some amazing experiences riding around in taxis.",
            "content": "Playing on a theme similar to the one in director Jim Jarmusch's \"Mystery Train\", \"Night on Earth\" portrays the relationships between cabbies and their fares in five different cities all at the same time. In Los Angeles, punk Corky (Winona Ryder) picks up overworked executive Victoria Snelling (Gena Rowlands) and gets on her nerves. In New York, immigrant Helmut Grokenberger (Armin Mueller-Stahl) picks up African-American YoYo (Giancarlo Esposito), who has to show the driver how to drive. In Paris, an immigrant from the Ivory Coast picks up a blind girl, and they have a discussion about race and blindness. In Rome, a lunatic (Roberto Benigni) picks up a priest and confesses (warning: what he confesses may shock you royally). In Helsinki, a man picks up three men, and everyone has a sad story.The Rome segment is truly the funniest, with Benigni going all out in every way possible. The New York segment is also pretty funny, with YoYo getting irked by Helmut's inability to drive, and making fun of his name. The Helsinki segment is touching in every way possible. Jim Jarmusch may be an acquired taste, but he does have some good ideas.",
            "review_date": "2005-12-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "7/10",
            "content": "In terms of perspective on life, these comic-philosophic taxi rides may be the most uplifting scenes in Jarmusch's oeuvre. The first of five segments (in L.A.) deals with Winona Ryder (in a broad, self-conscious performance) as a cab driver who picks up Gena Rowlands, who wants to put her in a movie. Rowlands is subtle and complex: she's a rich bitch with a soft side, but we don't know if she's the former because she's a player or if she's the latter because she wants to use Ryder. What Jarmusch is going for is to contrast the social classes -- he has an obvious, unfunny line where Ryder's character says she's never been to the executive terminal at the airport before -- but what's really interesting is seeing, since Jarmusch is usually a male-oriented director, how he handles women (one a tomboy, one in a position of power).It's obvious that the little idea of a movie about four taxi cab drivers is just a thin story that gives Jarmusch an excuse to work with certain actors, like Rowlands, whose late, great husband he adores. He goes for cultural miscommunication in the New York story (which is the film's most tender and brotherly), the warring cultures within a city, where a black man (Giancarlo Esposito) who can't land a cab fights with his Puerto Rican girlfriend while being badly driven around by former circus clown (Armin Mueller-Stahl, in a goofy, charming performance). Jarmusch makes brilliant statements on race and color in the Paris segment, with a sassy blind woman who's aware of what her driver is thinking of her -- and who turns our expectations on their head twice, without coming back to where we started. Benigni, who doesn't play the clown, is nevertheless the funniest in the Rome ride: he talks aloud to himself and outdoes and predates \"American Pie\" by almost a decade. The final, Helsinki section is the most powerful. When the cabbie tries to one-up the sob story by one of his three passengers, the conclusion seems to be that he wins; the two conscious passengers seem to think their unconscious friend's troubles are insignificant, as if they can't both be sad. 7/10",
            "review_date": "2004-08-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Contrivance for Hire...",
            "content": "It's a shame these vignettes didn't take place in the more diverse and less westernised parts of the world, where you might have been a bit more sympathetic to the passengers and/or drivers predicaments - an opportunity missed. The Rome tale with Benigni was ludicrous although if we had seen the drugs he was on before the piece it might have made more sense. Not sure any of them provided any actual value or insight grounded in the real world but, they were all competently performed, excepting the dead priest who clearly couldn't play dead. Bring on driverless cars!",
            "review_date": "2020-10-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Episodic glimpses at lives uncovered by the night...",
            "content": "The nights in the big cities have their very own mysterious and incomparable aura. Only the cab drivers who are circling the blocks after midnight and pick up ever changing passengers really have a sense of such a feeling, that strange kind of reality that engulfs them when everyone else is sleeping. You get a glimpse of the dark side of the aura if you follow De Niro's Travis Bickle in \"Taxi Driver\", and for the rest feel free to join independent film-maker Jim Jarmusch on five rides through L.A., New York, Paris, Rome and Helsinki and see what the night has to offer.Writer/director Jarmusch celebrates the synchrony of events happening in various cabs all over the globe, where drama, fun and tragedy all take place at the same time while the earth takes another turn around its axis. All shot on location of the actual cities this episodic masterpiece was photographed excellently, there are some wonderful performances, lots of poignant moments and hilarious laugh-out-loud comedy. Armin Müller-Stahl for example as German ex-clown \"Helmet\" going to \"Brookland\" clashing with NY culture is side-splittingly funny right from his greeting \"Hello! How are YOU?\" Then of course there is Roberto Benigni's wild confessional ride through Rome with a padre on the back seat, which has become an instant classic. Incredibly touching is also the final chapter in Helsinki with some drunkards exchanging tragic stories only to arrive at sunrise to catch some sleep. Or the one with the black cabbie, who learns to respect a blind woman and makes one wonder: Who's really the blind one? OK, OK, with all those overwhelmingly brilliant snapshots there's one obvious downside - which is the first tale, starring Wyona Rider as a small, but tough cookie: \"I want to become a mechanic!\" But after all taxi driving wasn't for her and she did eventually become an actress, didn't she?",
            "review_date": "2012-05-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Cinema Omnivore - Night on Earth(1991) 8.0/10",
            "content": "\"The common thread here is the human bond tentatively built among strangers during a short taxi ride, our ability of empathy, respect and amusement, Fashioned after MYSTERY TRAIN, NIGHT ON EARTH might seem formally repetitive, but Jarmusch's discernment and flair still gleams brightly like morning dews. Each story is contained in its limited space with their larger implications (about race, nationality, ableism, generation, religion, hope and tragedy) simmering in the right temperature, Jarmusch's mastery, as always, resides in his acumen of seeing philosophy, enlightenment and warmth in the most banal and desolate, and his brilliant execution of visualizing that mingled with nostalgia and eccentricity, The auditory accompaniments from John Lurie and Tom Waits are cozily strident and evocatively folksy, altogether, the two pictures are harmonious in their tones and structures, deathless meta-stuff forsooth. \"\nread my full review on my blog: Cinema Omnivore, thanks.",
            "review_date": "2021-12-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Five Beautiful Stories",
            "content": "This is a truly amazing movie which I love. It has five different stories, each on a different city, with very different people, but all in a taxi. All the people are very different, with different background, ambitions, culture and personality, but in the end, so similar. I loved every part of it, some of them are very funny, others touching, depressing, heartbreaking, enjoyable or simply beautiful. They are all wonderful portraits of the city in which they happen. They don't show touristic locations, but how the cities really are and how people behave and think. Every story is well told, with great pace, amazing, believable dialogs and realistic characters that you get to know very well in little time. They work both together and alone. They're all great and I can't choose my favorite.In the first segment, a young tomboy taxi driver meets a wealthy talent seeker, who wants to cast her in a movie. In New York, an afro American meets an immigrant, his cab driver, lost in the city. In Paris, a blind girl takes a ride with an irritable cab driver from the Ivory Coast and they talk about life and blindness. In Rome, a cab driver picks up a priest and starts confessing, and in Helsinki a miserable driver picks up three drunks and they speak about the most depressing things that ever happened to them.The direction is amazing in all its simplicity. The camera angles are steady, usually focusing no the actors and allowing you to concentrate on the dialogs.But there are some that show the city, the cars passing, the buildings, lovers in the middle of the night, junkies, etc, and these have unusual quality.The acting is great by everyone. Winona Ryder, frequently criticized, is in my opinion very funny and totally different from her other roles. I really enjoyed her acting. Gena Rowlands plays her \"opposite\" in a nice, underacting way. Armin Mueller-Stahl is very touching and expressive (the moment he says he was a clown is very beautiful), with an amazing use of his eyes. Giancarlo Esposito and Jennifer Perez are fun to watch, too. Béatrice Dalle is incredibly charismatic and believable as a blind young woman, and Isaach De Bankolé is good. Roberto Benigni is about as hilarious as you can get, in his one man show. His speech is obviously very funny, but Benigni makes it mind blowing. Some will hate it, though I couldn't stop laughing. Matti Pellonpää delivers his speech in a dramatic, depressive way but without overacting.The cinematography and the music are beautiful, make this movie feel nostalgic and help linking the segments. This is a very original, worthwhile movie.",
            "review_date": "2006-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "My impressions of a Night On Earth",
            "content": "I know that this film is now at the 10 year mark. However, to me it is a true classic. The film is almost like a really good book. You can stop it between chapters and not miss a beat. It has fantastic acting and a dynamite cast. Some have said that they thought the first story with Gena Rowlands and Wyonna Ryder was weak ,but I disagree.That story was about someone being content with who they are not looking for the brass ring. It also left the door open for further possibilities. I loved the New York story for many reasons . Not the least of which is that I live in New York. Excellent casting and a real story of the immigrants who came here to New York and the melting pot we are here in New York. It also showed a real problem that minorities face here in NY trying to hail a cab.Each story had a really excellent theme. The confession theme in Italy had me rolling , while the story of the Helsinki cab driver was really tragic. If you look at how the film begins and ends, there seems to be a opposite end effect. The affluent casting agent stepping off the private jet versus the worker stumbling out of his cab into the morning.This is an excellent film with an excellent cast. I highly recommend it!",
            "review_date": "2001-07-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pointless",
            "content": "I was first introduced to director Jim Jarmusch with Dead Man, and I loathed it. I thought that I had never before seen such an utterly pointless or pretentious movie in my life, and I probably never would again. It was many years later I ventured to watch another Jarmusch film. The second was Stranger Than Paradise and, while I still felt it was fairly pointless, I also felt it had its moments. It was interesting and occasionally aesthetically pleasing. From there, I explored much of the director's filmography, and found a few films that I really liked, foremost among them being Broken Flowers, his most recent. But I'd have to say, the majority of his movies I do find to be rambling exercises in cinematic pointlessness, even if they are sometimes interesting. I even found Dead Man tolerable on the second viewing.Unfortunately, I have come to Night on Earth, and I'm pretty much right back where I started. Following in the footsteps of the pretty good Mystery Train, Jarmusch directed another film with several different stories in it. This one is comprised of five different nighttime cab rides in five different cities, L.A., New York, Paris, Rome and Helsinki. Basically the film is just about cabbies' interactions with their customers. But there's little, almost nothing, really, of interest in any of these characters or conversations. Only one of the five sequences I found even remotely worth sitting through, the New York City episode, where the only cab black man Giancarlo Esposito can hail belongs to a German immigrant, Armin Mueller-Stahl, fresh off the boat. He doesn't even know how to drive, so Esposito persuades Mueller-Stahl to let him drive instead. Along the way from Manhattan to Brooklyn, they run into Esposito's sister-in-law, Rosie Perez. As in all the segments, nothing much happens during this cab ride, but I did enjoy the little friendship the two men build in the short time they know each other. Even this one ends horribly, though, with Jarmusch leaving Mueller-Stahl in dire straits. The worst segment by far is the Rome one, where Roberto Benigni plays a sunglasses-at-night kind of driver who loves to talk. He picks up a clergyman who becomes stupefied at the driver's chattering. Jarmusch kind of discovered Benigni in Down by Law, and the guy was almost tolerable there. But here he is so over-the-top that I eventually stopped reading the subtitles. I don't know why I just didn't fast-forward it to the final sequence, as none of the sequences are related anyway. This was definitely one of the more painful movies I've watched of late.",
            "review_date": "2008-07-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A little masterpiece !",
            "content": "I've been a taxi driver for almost 30 years, and when discussing movies featuring taxis, I always say that there's only been one movie that gives a fair description of what taxi driving is all about. Jarmush hits it spot on here. Through 5 episodes in 5 different cities, all happening at the same time, he takes us into the magic World of night driving. I'll agree with most that the 1st episode (LA) is also the weakest. But good performances by Rowlands and Ryder still manages to bring it home nicely. Then we move to NY for a warm, touching and low key funny episode with a great performance by Stahl. Now off to Paris for a weird, but strangely fascinating interaction between a Black driver and a blind girl. This is an episode that grows on you the more times you see it. Now for some good fun. Welcome to the Benigni show in Rome. Now this may be the least authentic part, but it's downright hilarious. After having had your spirits lifted here we move on to Cold, gloomy Helsinki for the final part that could very well bring out the tears. It does however end with a light twist to get you out without feeling too miserable. This is my favorite Jarmush movie. It's about real people, it has great dialogue and while it may not be a great masterpiece, it's certainly a Little one.",
            "review_date": "2013-12-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "'The Poet of the Night'",
            "content": "Roger Ebert in his review for Jim Jarmusch's 'Night on Earth' called Jarmusch a 'poet of the night'. This is such a fitting description of Jarmusch's storytelling in not only this particular film, but also in certain parts of another Jarmusch film that I love, 'Mystery Train'. Jarmusch is interested in the random people that walk/drive in the streets at night. 'Night on Earth' is an anthology film about various characters from various cities in the world connected by the fact that they either drive/board a taxi on this particular night on earth.At the start of each vignette/episode, we get the same shot of various clocks on a wall showing the time in the different cities that the film covers and the camera zooms into the appropriate clock showing the time for the city that appears in the respective episode. Jarmusch uses some establishing shots to introduce us to each of these cities. But the interesting thing is avoids using too many shots of well known and famous locations and monuments and focuses more on the mundane and decrepit locations. This actually connects all the cities together. Of course while looking at these exterior shots of these individual cities, one can find the individuality and uniqueness of every city, but at the same time, it is noticeable how Jarmusch is deliberately attempting to make some of these shots resemble each other and thereby forge a thematic connection. Jarmusch treatment of the various colourful characters in the film is also similar. The characters come from various backgrounds with numerous unique features, sensibilities and characteristics. Jarmusch actually uses these contrasts for comedic effect during these extended conversations in the taxicabs. But Jarmusch's tender lightness of touch in terms of storytelling, the solid acting by each member of the ensemble, the relatable dialogue and the overall spirit of humanism trickling down from one episode to the next connects all of the episodes as well as the characters together. The shot with which the film ends is absolutely heartbreaking since we can easily put ourselves in the featured character's shoes and understand his hopeless situation. It's a shot that underlines one of the primary themes of the film which is human beings struggling with their mundane lonely existence. This night offered all these aimless souls an opportunity to talk to a stranger and share their fears and apprehensions. But as the sun rises again and a new day begins, the struggle starts again.Yes, the film in a few moments did flirt with the danger of being a bit too on-the-nose with its themes and the use of contrasting background and life situations of the clashing characters, but if it can make me stay captivated and engrossed by using nothing but random conversations between random characters and make me care about them so much and contemplate how their individual lives will pan out after we leave them in their respective episodes, the minor reservations become negligible. This is truly special film and is now right up there alongside 'Down by Law' and 'Mystery Train' as one of my favourite Jim Jarmusch films. Highly Recommended.",
            "review_date": "2017-08-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Interesting...",
            "content": "I honestly don' know how to rate this. On one hand, it has some of the finest details and scenes that I've seen from Jim Jarmusch. On another hand, the more it goes on, the less I was interested in it. It's definitely an admirable work, no doubt, but where that line should've been drawn is where it gets tricky. The first three stories are all sublime, to an extent, the last two easily tested my patience, but whether that's really due to the stories themselves or to where they were placed in the film is really anyone's guess (although something tells me it's more due to the latter). the acting is uniformly excellent, and all due well to what their roles require (great seeing Winona Ryder so young). I do like this film quite a bit, but I need to sit on my feelings to see how it ultimately fares with me.",
            "review_date": "2014-12-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Four obscure tales from Jim Jarmusch",
            "content": "Jim Jarmusch is a filmmaker that you can always rely on to deliver something offbeat and unlike most other films. My only taste of him before seeing this film was the slightly later 'Dead Man', and I found that to be a very worthwhile experience and one that set me up nicely for Night on Earth. Night on Earth isn't quite as trippy as Jarmusch's later film; but it still oozes that odd sense of cool and while you're watching it you're constantly reminded that what you are seeing isn't just any film. This film is split into five sections, all of which tell a story about a taxi in different parts of the world. Part of the reason why this film is so odd is that all of the stories take place at the same time, which creates a very strange feeling while you're watching it. One problem with films that work in this way is that there's always a weak link in the stories; but here there isn't. All of the stories are of high quality, and all are brilliant in different ways. Of course, everyone will have a favourite and mine has got to be the blackly comic one that takes place in Rome! An excellent ensemble cast, mostly made up of unknowns, helps night on Earth immensely. In fact, it's ironic because the only cast member that doesn't pull her weight is the only one that isn't unknown - Winona Ryder. I'm something of a fan of Ryder; but seeing her in this movie is an awful experience. How anyone could think that she could be cast as a taxi driver, complete with cocky swagger and cigarette in mouth, and get away with it is ludicrous. However, the rest of the cast is really good and all bring realism to their roles. Roberto Benigni is typically over the top, but his performance is very fun and he is an actor that has a great ability to draw you into his performance by the way he speaks. This was capitalised on brilliantly in the masterpiece 'Life is Beautiful', and it's shown here too. The stories in the film don't appear to have an absolute defining point (with the exception of the story in Paris); but it doesn't matter as the musings about life and such are always interesting and the obscure idea of following people in taxis is always amusing. On the whole - a very worthwhile film experience!",
            "review_date": "2005-04-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "5 stories...every second is better then previous one...",
            "content": "This is a wonderful movie...i truly enjoyed...after the movie was finished i just felt better...lets say happier.and the Benigni role was fantastic...maybe the best one.Very funny. I personally didn't like truly the opening of a movie, can't say i enjoyed watching Winona Ryder, but it was a good part of a movie.The stories after the opening one are fantastic. The one in Rome, with Roberto Benigni, is just super funny. After i saw this movie my opinion about Benigni has changed completely. From just OK actor went sky high. Ater this one i had to watch another movie from same director and again Benigni has role in it. It is called Down By Law.",
            "review_date": "2015-06-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Quite captivating.",
            "content": "This picture is most unique, and is really superb in terms of generating interest and capturing the audience's attention. There are excellent performances from great talents like Rosie Perez and Wynona Ryder, and a wonderful early glimpse of Roberto Benigni as the very explicit Italian taxi cabdriver in a scene that is absolutely hilarious. This is a classic small film-it works wonders on the small screen- imagine what it could do as a blockbuster, though it's small screen image gives it an extra boost.  In order to catch great films such as these you either have to watch Bravo or attend Film Festivals, which is what makes films such as these rare gems.",
            "review_date": "1999-06-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An Uneven Collection of Short Films",
            "content": "I feel safest at nighttime, not on the streets but in the sheets, cemented to my bed with my laptop by my side. These summer nights seem to beg me to stay up until the earliest hours of the morning, and it's hard not to comply — at two pm, there's nothing in the world stopping a friend from asking you for a favor, a grandma inviting you to move furniture for an estate sale, a parent demanding you mow both lawns, take out the garbage, and clean your bathroom. But at two am, every one of those people is asleep: nobody expects anything from you, and, for once, the stresses of reality cease because no one else is throwing them in your face. Nighttime is a period of spooky solitude, elusively appealing.\"Night on Earth\" divides itself into five vignettes, all set during these wee hours, all involving the relationship between a taxi driver and their temporary client, all in a different city. Directed by Jim Jarmusch, one might expect a deadpan drama of steeping revelations and scintillating conversations, in the way \"Broken Flowers\" could make even the most awkward of an exchange blossom with black hilarity. But \"Night on Earth\" is wildly uneven, some of the segments mostly involving, others splendidly acted but unsuccessful in their rendering. I've always felt that a movie comprised of short films should be so arresting in each segment that it wouldn't be unheard of to pine for a longer, feature adaptation. But even in its best moments, \"Night on Earth\" is slight, some performers more pleasing than others — a difficulty when some segments are damaged by particular characters.The first vignette, set in Los Angeles, stars Winona Ryder as the cab driver, Corky, Gena Rowlands as the passenger, Victoria. Corky, young and spunky, chain smokes, chews bubblegum, and figures that her dream career is that of a mechanic; Victoria, middle-aged, welcoming, and refined, is a casting agent looking for fresh talent. She sees a spark in Corky, figuring her rough-and-tumble attitude could be assembled into a rebellious, cool product headed toward stardom. This segment, though dampened by Ryder's unconvincing portrayal of a grungy youth with small dreams, makes an impression thanks to the always lovely Rowlands, who makes what could be an unlikable character affectionate, motherly even.The second, stationed in New York and headed by Armin Mueller-Stahl, Giancarlo Esposito, and Rosie Perez, is the second most annoying of the segments: driver Stahl, a German immigrant, hardly knows how to drive, so his customer Esposito takes over the wheel and loudmouths his way through awkward silences. Midway through the trip, the two pick up the shrill Perez, who happens to be Esposito's sister-in-law. The vignette could be enjoyable, with Stahl sweetening the atmosphere as a gentle giant, but Esposito and Perez are so obnoxious that we can hardly wait for the short to be over.The third sequence travels to Paris, by far working as the most straightforward, best written moment in the film. Here, a blind woman (Béatrice Dalle) gets a ride from an endlessly p-ssed off driver (Isaach De Bankolé) who rethinks his usual grumpiness after she gives him a run for his money: the woman, it seems, is scorned by life and completely disregards her ailment, scoffing whenever her cabbie asks an inappropriately curious question. The segment works so well because of the rapport between Dalle and Bankolé — whereas the other shorts attempt to have the characters find a mutual understanding between each other, Dalle and Bankolé's mutual curiosity/disdain bears an odd sexual tension, fascinating just enough to leave us potentially wanting more but backing off when considering just how well it works.I won't go far into the fourth sequence (set in Rome), which is jaw-droppingly irritating as comedian Roberto Benigni delivers a mile-a-minute performance as a cab driver who just won't shut up. If he's annoying to his guest then he's annoying to us as well — don't expect to want to do anything besides fast-forward as his mouth runs into oblivion, us preferring deafness to hearing any more about another one of his sexual experiences. Following the exasperation of this vignette, \"Night on Earth\" ends on a melancholy note as it hits the snowy streets of Helsinski, with a group of passengers complaining about how horrible their friend's day was until the driver decides to top it with a soul crushing experience himself. While I appreciate Jim Jarmusch's enviable ability to turn realism into sardonic astuteness, \"Night on Earth\" feels more like a filmmaking exercise than an actual film. It doesn't move — it serves as an experiment pleasing only the people involved while the audience sits and waits patiently for something moving to happen.",
            "review_date": "2015-07-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A collection of vignettes, five taxi rides in five cities of the US and Europe, mixing drama and comedy",
            "content": "NIGHT ON EARTH (1991), the fourth film by American auteur Jim Jarmusch, is a series of vignettes centered around taxi journeys in the US and Europe over a single winter night. There is no overarching plot, but rather each segment is a study in interaction between the driver and his fare.In Los Angeles, Winona Ryder is a 16-year-old tomboy taxi driver and Gena Rowland is a Hollywood casting agent. In New York, Armin Mueller-Stahl is an immigrant from East Germany who gets a crash course on American culture after he takes Giancarlo Esposito and Rosie Perez to Brooklyn. Crossing the Atlantic, we first go to Paris where Isaac de Bankole, an Ivorian immigrant who faces the challenge of racism daily, picks up blind woman Béatrice Dalle who could care less what colour his skin is.The last two segments are less about class or race and more humorous and individual. In Rome, Roberto Benigni finds an opportunity to confess a long list of sins after he picks up priest Paolo Bonacelli. This is a hilarious scene, the most extreme part of the film. In Helsinki, Matti Pellonpää brings three drunks home (Kari Väänänen, Sakari Kuosmanen, and Tomi Salmela), but after they bemoan their misfortune, he tells them what real suffering is.NIGHT ON EARTH continues the characteristic choice of scenery that Jarmusch offered in his films to date. When so much cinema depicts the US as so many ritzy places and historical landmarks, Jarmusch instead offers vacant lots, dilapidated buildings, and businesses that have long since gone out of business. In Paris, Rome, and Helsinki he also offers nondescript, industrial or residential areas, quite deserted because it is the dead of night.This isn't a flawless film. The opening bit with Winona Ryder feels overacted. The Paris segment is nothing but clichés about how the blind might not see, but their other senses are more powerful than the sighted. The New York and Helsinki segments are homages to Jarmusch's peers Spike Lee and Aki Kaurismaki respectively, using their settings and borrowing some of their actors. While the New York scene has Jarmusch's characteristic humour, Jarmusch's style is almost completely effaced in the Helsinki scene and one could believe he's watching a Kaurismaki film.Nonetheless, this is a very enjoyable film. Virtually all audiences will enjoy Benigni's wacky comedy, and I've come to appreciate Matti Pellonpää's acting even more. I've seen NIGHT ON EARTH several times, and I've always found it to have re-watch value.",
            "review_date": "2015-05-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's a Special Night on Earth!",
            "content": "I like this film. It's about Taxi drivers and their passengers. There are no big twists or complicated story lines. You pretty much get what read on the title; It's a night on Earth.The film consists of five chapters set in different countries who all take place during the same night. And all the chapters feel very different and unique. They are funny, dramatic and even tragic when they need to be. Everything feels very well balanced. The cinematography is very good and even relaxing at times. There's something very calming about just looking ahead towards the road during a nightly drive.A lot of people would expect the night settings to build up to more of a thriller film. But, no. The situations seem very natural and realistic. This movie isn't afraid to just be what it is. My favorite chapter was the one in Finland. It was really fun to see some of my favorite Kaurismäki regulars show up. I think that one was the funniest and the most tragic story at the same time.I've made a film set in a Taxi called \"The Red Trees\" (Co-directed with a good friend named Adam Leijon), and I know how to difficult it sometimes can be to film in a car and have it be engaging. I appreciate \"Night on Earth\" very much for doing such a good job making all the conversations interesting. It's funny that I watched it now because I can see that \"The Red Trees\" film I did with my friend could fit perfectly as another chapter in this film.I really recommend it, but don't expect anything action packed. It's a simple film with a great combination of stories.",
            "review_date": "2016-12-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Deadly Dull",
            "content": "Jim Jarmusch is an acquired taste, at best. This 1991 movie, which was produced, directed, and written by Jarmusch, is slow, self-indulgent, and horribly scripted. Five scenes, in five dark cities, play out at night. These are taxi scenes, but take it from me, folks: I have driven a taxi in two cities, only one of them dark, and every night that I drove I returned home with at least one story to relate that was better than these. It is painful to watch Gina Rowlands or Winona Ryder, for example, deliver lines that make them look like beginning actors. Only Roberto Benigni, who probably wrote his own comic bit, sustains any interest. Enjoy another film.",
            "review_date": "2014-08-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Five Short Stories in the World",
            "content": "During one night, taxi drivers in Los Angeles, New York, Paris, Rome and Helsinki interact with their passengers while driving them to their destination. \"Night on Earth\" is a collection of five short stories with different genres, from comedy to drama, taking place in taxis along the same night. The storyline is absolutely original and supported by great international cast. My vote is seven.Title (Brazil): \"Uma Noite Sobre a Terra\" (\"One Night on Earth\")",
            "review_date": "2018-07-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Look to the Human Side",
            "content": "This is a film that is strictly about character. Or should I say characters? A set of five little twenty minute films, set in and around taxi cabs, allowing the characters to interact and expose their loves and their fears, their baggage and their hopes. Each is strong or weak in its own way. The first, with Winona Ryder is, to me, the weakest, although I couldn't take my eyes off her. There is subtlety and a delicate touch to all of them. My favorite was the Finnish one. The most contrived and least human was the Italian one with Roberto Benigni. While it was outrageous, it was a long running gag, a kind of cruel joke. In the other the four, the people were interesting and accessible. Their lives were realistic and, in some ways, cruel, yet their stories moved us. All things considered, it is a unique idea and has enough to recommend it. Also, there's the music of Tom Waits. What more could you want.",
            "review_date": "2010-11-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"...the pumpkin, the sheep, my brother's wife. I was on fire!\"",
            "content": "If you go in expecting a coherent story line or some connecting thread among the five vignettes presented, you'll probably be disappointed. What I got out of the picture was the sense that throughout the world, people of different backgrounds and nationalities are all subject to similar kinds of human frailties and foibles, no matter if one lives in Los Angeles, Paris or Helsinki. The other two cities rounding out this peek around-the-world at a particular point in time are Rome and New York City. Some of the situations are rather bizarre, but to my mind, the most hilarious character in the picture was portrayed by Roberto Benigni as the cab driver in Rome. In a moment of reflection, he decides he must tell his confession to a priest who becomes his fare, and proceeds to drive the man into an unintended heart attack when he loses control of his medication. Perhaps the most poignant story is the last one in which a cabbie takes on three inebriated passengers and winds up relating a personal story that adds an unexpected perspective to their own unfortunate circumstances. All five of the unrelated tales have a way of making one think about how it would feel to walk in someone else's shoes, and perhaps, just how fortunate one is compared to the problems of the next person.",
            "review_date": "2018-06-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful in all it's simplicity",
            "content": "Night on Earth is a beautiful movie in all it's simplicity. In the center of the movie are the encounters of people, who maybe wouldn't meet otherwise, but in a taxi cab they get a connection to each other - or to themselves. The movie is a mixture of drama and black comedy (especially Roberto Benigni's character is unbelievably funny!) that carries through the movie. It consists of five quite different episodes located in different cities of the world. Although the main idea is quite simple, after seeing this movie you have a feeling that you have in some level at least learned or remembered something important about the world and human beings.",
            "review_date": "2012-11-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Made me want to become a cabbie",
            "content": "Good, offbeat comedy which overworks the F word to the max. My favorite sequence was the one featuring Yo-Yo and Helmut; what a riot those two were. Look for the dead guy in Rome to 'help' by lifting his head while being dragged from the cab. The guy never blinked once [something I could never do] but he couldn't let his head loll over like a real corpse. Entertaining film, but totally weird.",
            "review_date": "2003-04-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Better Than Average Comedy - Night on Earth",
            "content": "This is a pleasant cab ride from LA to Helsinki. The comedy is uneven at times, but the Italy segment is the best. The LA segment is also very good. The other three segments; New York, Paris and Helsinki are uneven at best. I found the New York segment to be the least believable and funny as well. It is a pleasant way to spend and hour and a half for a date movie. Enjoy.",
            "review_date": "2021-02-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Give it a try",
            "content": "When I first heard about \"Night on Earth\" I thought it was one of the typical award-winning Arthaus- movies your girlfriend forces you to watch. I mean, 120 minutes watching people in taxis? But it was really entertaining, especially the scenes with Roberto Benigni and Armin Mueller-Stahl. I could Benigni watch for the whole 120 minutes talking to himself. (Talking? Singing, screaming, yelling, poking fun, ... and his interlocutor, the deserted, silent, dark, somewhat morbid streets of a beautiful Roman night) So, if your an Arthaus-sceptic like me, give this one a try. Buy the DVD and, if your girlfriend wants you to watch anything that sounds boring, suggest that one in response, you'll not be disappointed.",
            "review_date": "2006-11-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A perfect intro to Jim Jarmusch's films",
            "content": "If you've never seen a film directed by Jim Jarmusch, this would be a good place to start. Five vignettes about taxi drivers around the world are presented in this funny, touching, and truly unique picture. The stories range from flat-out hilarious to surprisingly moving, taking place in Los Angeles, New York City, Paris, Rome and Helsinki. The Rome story -- featuring Roberto Beningi as a maniacal cabdriver giving a lewd confession to his priest customer -- is typically hilarious Beningi. The Helsinki story is sad and very moving. An enormous range of emotions will be gleaned from viewing this film. Jarmusch has a tendency for the offbeat and this film is no exception. However, it's a bit more accessible than some of his other works. If you like this, go out and rent \"Stranger Than Paradise,\" \"Mystery Train\" or \"Down By Law.\"",
            "review_date": "2000-02-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This notable Jarmusch film could have inspired Jafar Panahi's \"Teheran Taxi\"",
            "content": "This could have been the inspiration for Jafar Panahi's \"Taxi Teheran\" made some 15 years later. Jim Jarmusch's film has 5 segments set in 5 cities in the developed world driven by 5 different taxi drivers; Panahi's film takes the same concept with one driver (Panahi himself) in one city. The Panahi film comparatively could have been titled \"Day in Teheran,Iran.\" Both films paint character differences, some sad, some optimistic, some with set opinions, some who change their mindset after conversations in the taxi. My favorites are the opening sequence with the beautiful Gena Rowlands (Mrs John Cassavetes) and Winona Ryder playing fascinating roles in the segment set set in Los Angeles. Another good performance is of Armin Mueller-Stahl in the segment set in New York. Great songs with lovely lyrics add value. Jarmusch thanks another great director for inspiration for parts of the film: Ms Claire Denis of France. Of course, one of the actors in \"Night on Earth,\" Isaach de Bankole, has been picked by both Mr Jarmusch and Ms Denis in various important films they have made. Last but not least, recent works of Jarmusch have benefitted from the impressive cinematography of Frederick Elmes. Elmes and Jarmusch make a great team. All in all, a very notable work of Jarmusch.",
            "review_date": "2022-05-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Booooorrrrrrinnnnnng !",
            "content": "Segment #1:An unentertaining, if energetic, attempt to one-up the 4-letter-word count achieved by GOODFELLAS.  Anyone who has flown once or twice will realize that the director had no money to employ extras at the LAX location.  Never in the history of aviation has a coast-to-coast passenger stood alone at the prime baggage shoot location at the luggage carousel just before the bags to drop. Unreal.  Fantasy.The phone calls were poorly acted and unbelievable.  Painfully obvious plot devices.  The station wagon's windows were up in one scene, then down when an actor needed to reach through, then up, then down again.  Continuity -- not!  Wider's fake auto driving was poor -- a chronic three inch back-and-fourth jerk all the way from LAX to the Hills.  Not real life.Segment #2:A comedy with funny moments pulled down by obnoxious over-acting.  Emotional aspects were played two notches above real life.  One other reality check: taxi passengers cannot be locked inside the back of a cab.  Locking and unlocking is controllable from inside the back seat.Segment #3:A stunning looking blind women.  A most interesting concept.  Most interesting.  However, the execution of Segment #3 went no where.  For a blind lady wanting to use a taxi to go home, she certainly was dropped off far from her doorstep!  Huh? Segment #4 + #5:I ran out fast towards the end of Segment #3 hoping to avoid the film's slow, pretentious Gypsie theme music -- ineffective, awkward and out of place.",
            "review_date": "2001-10-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "About the night...",
            "content": "Jim Jarmusch's \"Night on Earth\" is a tricky movie. A tricky long-duration movie that wins points because its masterfully made and because the connections established between its different parts justify its condition of full-length feature. Otherwise, we were simply fooled by the original Jarmusch (well, maybe we were a little), as we lived the experience of five different shorts in the same movie, presented as one whole piece. The truth is I don't know what was the man's plan, so these are guesses. However, whatever the plan there's no doubt that \"Night on Earth\" is a good piece of film-making. Honest also, the film doesn't ask much of the viewer; only that he or she listens and watches carefully. If you do that, you will be rewarded. But don't worry about trying to get some 'meaning of life' thing out of this ride; the less you look for the better, because although Jarmusch's script is as complex and thought provoking as they come, there's never an intention of teaching something or giving a lesson of anything. The development is simple, as stated in the adequate tagline: \"Five Taxis, Five Cities, One Night\". What's a night on Earth, anyway? Well, for me it's just about every single night of my life, and I suppose it's the same for Matsan who lives with me and for my parents and brothers for that matter. Well, Jarmusch chose the cities and the characters: taxi drivers. I mention the characters in detail and not the cities because I personally believe that these five cities could have been any of the cities of the world (of the Earth, to respect the film's title). The fact that the cities Jarmusch chose are iconic world places and that the director 'knows the night' of every one of them and shoots them brilliantly and similarly and trying to tour them all is a remarkable fact, but still I don't feel the necessity of mentioning the cities in this review. As I said, I'd like to make a reference to the taxi drivers: the first one, played splendidly by Winona Ryder is a compulsive smoker who looks and acts like a boy and cares about nothing else than her work and becoming a mechanic; the second one, played by a phenomenal Almin Mueller Stahl, is a man who is apparently driving a car for the first time; the others include Roberto Benigni (and I think with that you can imagine the character), a black driver played by Isaach De Bankolé and a driver named Mika played by Matti Pellonpaa. All of these individuals 'are' the film, which shows each taxi from a few camera angles and cares about anything else than the people in each car (the ones who are not driving also give magnificent portrayals) and the streets of each city. I realize that I might not be writing a very enthusiastic review, but I think it may not be enough with the expressions 'amazing script' and 'amazing human perception' to convince to watch this atypical picture. I'm going to take one last risk by telling you that what you'll see must happen every day in many cities of the Earth. But to write it down and shoot it for people to watch it, laugh at or with it and maybe also cry, is very original and unforgettable. Of course, if like I said in the first place, \"Night on Earth\" had been a series of shorts, or a miniseries or whatever, I wouldn't have had this trouble writing the review. Watch the film and tell me about it.",
            "review_date": "2008-08-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Life On Earth!!!",
            "content": "1 night. 5 cab drivers, 5 fares, 5 different cities.5 stories pass between passenger and driver as one of the worlds best contemporary directors Jim Jarmusch takes us around the world and back, in stories about cultural adaptation, following your bliss, sex and death, and the depths of love and... pain, some in more detail than others. The last two with the priest and the \"saddest story in the world\" stand out the clearest in my mind.Alternately funny and reflective, but always entertaining, this is definitely Jarmusch' most accessible, and also one of his most compelling. Great film maker, and great moment for \"world cinema\".",
            "review_date": "2008-07-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Jarmusch's human connections",
            "content": "\"Night on Earth\" is a masterpiece, a showcase of Jim Jarmusch's talents, and a massively entertaining movie. I don't think I've ever seen a movie constructed like this - but Jarmusch does it originally, inventively and lively. It is a segment movie of five parts; each part is told excellently. I admire Jarmusch's fascination with human dynamics here; I've never quite seen anything like it - it must surely be top form. It's joyous to watch Jarmusch progress through his bag of tricks.The plot of the film is broken down into five segments of five different cab drivers in five different parts of the world - Los Angeles, New York, Paris, Rome and Helsinki. The movie stars Gena Rowlands and Winona Ryder in the Los Angeles segment, Armin Mueller-Stahl, Giancarlo Esposito and Rosie Perez in the New York segment, Isaach De Bankole and Beatrice Dalle in the Paris segment, Roberto Benigni and Paolo Bonacelli in the Rome segment, and finally, in the Helsinki segment, Matti Pellonpaa. Everyone gives great performances.Jim Jarmusch is a true poet in this movie, a symbolization of some of the greatest talents working at the time, and an ideal stylist - the music, by Tom Waits, adds to his scenery, and everything in the film works comically, beautifully, and sometimes even devastatingly well. See \"Night on Earth\" if you haven't - it's fantastic.Night on Earth (1991)4 STARS (OUT OF 4)Written and directed by Jim JarmuschStarring Winona Ryder, Gena Rowlands, Giancarlo Esposito and Roberto\nBenigniRated R128 minutes.",
            "review_date": "2022-07-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of my all time favorites!",
            "content": "This is literally what I expected from the movie \"taxi driver\" and got disappointed. But luckily got into Jim jarmusch's movies and found this!",
            "review_date": "2021-01-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Original, bold, poignant, very funny",
            "content": "It's at times a little telegraphed, even heavy handed; the links between the five stories being arbitrary, almost tenuous introductions to another morality tale, but there's lots to like regardless. Roberto Benigni is excellent as the offbeat cab driver who likes the company of pumpkins and sheep, and his funny segment is juxtaposed quite beautifully with the more heartfelt and raw finale. My favourite segment, however, is the equally funny New York section starring Giancarlo Esposito, which is basically a culture clash between a working-class New Yorker and a foreign immigrant's first night driving a taxi. It balances both the humour and drama perfectly, a harmony which isn't met so successfully in the rest of the film. Yet, Jim Jarmusch's tale about disparate lives intermingling during one night is both original, bold (filming across the world and in native languages has to be applauded), poignant, and very funny.",
            "review_date": "2006-10-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Jim Jarmusch is trash",
            "content": "Histrionic black and latino characters, white color-literally-blind women, italians obsessed with sex... All, in a movie that pretends to be international with 2 scenes in north america and 3 in europe.Movies say more about who makes them than about the supposedly portrayed. Jarmusch is generally overrated, but this movie in particular is really trashy.",
            "review_date": "2022-08-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "My Favorite Film from Jim Jarmusch",
            "content": "My favorite film from the offbeat director Jim Jarmusch is a seemingly simple collection of stories involving cab drivers and their passengers in five different cities.In Paris we have an immigrant cab driver Isaach De Bankolé who picks up a blind woman.In Rome we have the frequently polarizing Roberto Benigni as the cabbie who picks up a priest.In New York we have Armin Mueller-Stahl a German emigree who is in awe of the city and not really prepared to drive in it, who picks up Giancarlo Esposito and Rosie Perez.In Helsinki the driver picks up some drunks who tell the story of their friend's terrible day to which the cab driver responds with a tale of his own.In Los Angeles we have Winona Ryder as the cabbie who picks up a powerful Hollywood Agent in the person of Gena Rowlands.There isn't a lot of action here, the film is very much about conversation and telling stories and it may be very surprising how well this works as entertainment to many viewers.There are also some compelling performances here and some interesting discussion of various ideas and points of view.",
            "review_date": "2019-04-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Frederick Elmes best work",
            "content": "Even allowing for Eraserhead, Blue Velvet and Wild at Heart, this film probably features the best work of Frederick Elmes' life (Cinematography). The transitions from location to location are beautifully constructed; a series of intimate painterly portraits, introducing you to the vulnerable underbelly of each city. This also applies to the cut scenes between dialogue ... at times I was drooling! The characters are generally so well drawn that we can even forgive Winona Ryder's unconvincing tom-boy mechanic. Each twenty minute story is just long enough to engross and short enough to leave you happy that you didn't waste your time and you're ready for the next. And there's real comedy too ... farce, circus buffoonery and even belly laughs. I must admit, by the last story I did begin to tire a little of the format. It all finishes with not so subtle pathos (which I resisted) which highlights the unrelenting pain of life. Absolutely beautiful. Highly recommended.",
            "review_date": "2000-05-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "At night by day",
            "content": "Jim Jarmusch's \"Night on Earth\" is what one could call an international American movie - and therefore almost a contradiction. When normally Americans come to Paris, to Madrid or to Rome, the movies in which they act look like these cities would lie in the US. Not only there is exclusively English spoken, but the actors do not behave as if they were in Europe. Sadly enough, this is even true for Soderberg's \"The Good German\". The worst that can happen, then, is that Americans try to film European history. I do not watch such movies anymore until Unviersal will have agreed to contract Fredy Murer as director of a new American Western.Very different are the movies of the world-versatile Jarmusch, a real Odysseus for whom the Greek attribute \"polytropos\" could not better fit - also what the choice of his movies concerns. Although the situations in the different taxi-drives are acted, they are so good as in real life. In order not to spoil the real pleasure that everybody has who has traveled to the cities in which Jarmusch leads us, I give here only a few hints. Masterfully Armin Müller-Stahl as taxi-driver and clown who looks as if an UFO had abandoned him amidst New York city. His film-name Grokenberger is a nice allusion to Grock, the greatest clown of all times. Jarmusch's humor gets a bit cynic if he chooses exactly Paolo Bonacelli for the role of the priest who dies in the taxi under the \"confession\" of Roberto Benigni: the same Bonacelli who was in one of the three leading roles in Pasolini's \"Salo\", a movie that is so full with nausea that people can hardly survive it. To a nice allusion Jarmusch also succeeded in the last episode which shows a cab drive of three drunks in Helsinki. Helsinki is the cinematic seat of whom? Right, of Aki and Mika Kaurismäki. So, the awaken watcher is not too astonished, when the sober taxi driver is called Mika and the deathly drunk passenger Aki. Also a form of reverence of Jarmusch who is a real Global citizen.",
            "review_date": "2009-05-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worldwide Character Study",
            "content": "Interesting and different film about five separate taxi rides in five major cities around the world on the same night. The film is a successful look not only at the heart of the cities themselves, it is a study of characters and of short term relationships.Shot in Los Angeles, New York, Paris, Rome and Helsinki, each segment is about twenty-five minutes long and features a different theme each time. Audiences will find the comical New York segment very funny, whilst the Paris and Rome pieces are also good for a laugh. The opening Los Angeles sequence is entertaining too, featuring impressive performances from Gena Rowlands and Winona Ryder. Sadly the closing Helsinki segment is disappointing. Jarmusch's attempt at an uplifting finale does not come off, and his audience may leave the cinema uninspired.\"Night on Earth\" remains a great character study though, as well as being a genuine look at the real side of the towns represented. PS Look for Beatrice Dalle as a blind French girl. Very impressive.Friday, September 11, 1992 - Valhalla Cinema",
            "review_date": "2007-10-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Jim Jarmusch: The Ultimate Independent",
            "content": "An anthology of five different cab drivers in five American and European cities and their remarkable fares on the same eventful night.Jim Jarmusch is pretty much the ultimate in independent filmmakers. He has this interesting quality about him, where he has continued to make great films over the last couple decades, has worked with everyone you could ever want to work with, and still maintains a status that is slightly shy of mainstream. The average film watcher would not know his name or almost any of his movies, but the more discriminate film lover would go out of their way to see them all.This is a great film in that it is just so simple. Most of the movie is nothing more than a cab driver and their fare having a conversation. Sometimes this is all you need to make a great picture, just a well-written script.",
            "review_date": "2015-05-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I love that movie",
            "content": "It's funny, poetic and beautiful. When I've seen this movie the first time I couldn't stop watching - it was just amazing. The different and somehow same stories - the names, the dialogues. It's simply good. I love it.",
            "review_date": "1999-07-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"At least I can still smoke in my own cab.\"",
            "content": "No, this is not a posted sign in the film. The tobacco companies tried  to include it, but Director Jim Jarmusch had too much integrity to  allow it.  But what could be a more natural setting for sucking on the killer weed  than the inside of a taxi cab? Here we've got five of them. The tobacco  companies saw the script and fronted mass bucks, or actually in this  case, for a small Indie episodic venture by a director without a  commercial hit to his credit, they fronted small bucks and sent an  accountant.  Anyway, this is a collection of five short stories filmed at night in  five cities, Los Angeles, New York, Paris, Rome, and Helsinki. In the  first, Winona Ryder is an L.A. cabby looking like a ninth-grade grunge  girl with her own sweet dreams who picks up Hollywood casting director  Gena Rowlands at LAX and takes her to Beverly Hills. It's a cute idea,  their bonding, but Ryder is without subtlety and clichéd to the hilt in  dark glasses, bubble gum, baseball cap on backwards, and the endless  puffing, talking sarcastically out of the side of her mouth: \"All  right, MOM.\" I actually expected some Joan Jett and the Blackhearts in  the background. Rowland is very good however and overcomes a cloying  script.   In New York, veteran German character actor Armin Mueller-Stahl,  looking for all the world like a dead ringer for Albert Einstein, is  the cabby, Helmut, and Giancarlo Esposito is Yoyo, his fare. Problem is  Helmut drives with one foot on the gas pedal and the other on the brake  so that the cab starts and stops every two seconds. So they switch  positions. Meanwhile Rosie Perez arrives for a cameo.  In Paris, Isaach De Bankolé is the cabby and blind Béatrice Dalle, in  white zombie contact lenses, is his fare. This is perhaps the best  piece. Bankolé, who is a black dude from the Ivory Coast, asks her  kindly, \"Don't blind people usually wear dark glasses?\" She has the  great rejoinder, \"Do they? I've never seen a blind person.\"  Roberto Benigni is the cabby in Rome. He picks up a priest and to the  priest's great discomfort confesses in vivid detail his rather  revolting sexual experiences.  Finally in Helsinki we have Matti Pellonpää as the \"taksi\" driver. The  stark lighting on the snow and the empty streets captures well the cold  northern night. Incidentally, the European stories are done in the  local language with subtitles.  This is obviously an art film and requires a relatively sophisticated  audience. The editing isn't sharp (some of that's deliberate) and the  dialogue is uneven, but some of the camera work is excellent. See it  for the acting, which is mostly very good.",
            "review_date": "2002-02-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Romantic movie...",
            "content": "The idea of showing people move into somebody's life - even if it's just for a few minutes - having some sort of impact, however mundane or profound, and then leaving, never to be seen again via a taxi cab ride is a slightly romantic notion for me. Sounds silly, but it is (romantic, not silly).\n\"Night on Earth\" is a nearly perfect movie for me. The first L.A. segment is uninteresting. But your reward for getting through it is the rest of a wonderful film. The New York and Paris segments are at the same time amusing and bittersweet (Helmut and Yo-Yo make a great duo, the Blind Woman and the Paris driver make a great couple, even if they don't realize it). The Rome segment is out-and-out hilarious and may be the best portion of the movie. The first few minutes where Roberto Begnini is driving around Rome by himself almost seem improvised. The Helsinki portion is sad, but at the same time I don't think it leaves the movie on a down note. It's hard to explain why, but the ending almost seems hopeful to me.The nighttime atmosphere of the last 4 cities is perfectly portrayed and the music by Tom Waits is wonderful. All the performances are strong - especially Roberto Begnini, Armin Mueller-Stahl, Giancarlo Esposito, and Matti Pellonpaa. Do yourself a favor. See this film.",
            "review_date": "2001-04-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The World According to Jim Jarmusch: Life is a taxi cab ride",
            "content": "NIGHT ON EARTH (1991) *** Winona Ryder, Roberto Benigini, Armin Mueller-Stahl, Gena Rowlands, Giancarlo Esposito, Rosie Perez.  Indie filmmaker guru Jim Jarmusch's gimmicky yet originally witty 24 hour look at one international theme: taxi drivers and their fares in Los Angeles, New York City, Paris, Rome and Helsinki.  All equally surreal and memorable with the universal theme of humanity transcending its globetrotting pastiche.",
            "review_date": "2003-04-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Jim Jarmusch at his finest",
            "content": "This movie is excellent. For the 41 people who did not like this movie go rent the Porky's series and lock yourself in a room.  After you get through the first scene with Winona and Gena Rowlands it is all gravy.  Not that the first scene is not better than most movies it is just not nearly as good as the rest.  From there are on out it is a four start film.  This movie gives you everything. Great acting, great writing, great directing, and Tom Waits great soundtrack.  You have Roberto Bergnigni doing his thing.  You have comedy and drama.  This film towers above most films on its premise alone. Great charachters who are more developed in their short sequences than most cardboard hollywood cut outs are in their entire movies.  If you like Jim Jarmusch then you have seen this movie.  If you don't know who he is watch this film and if you like it see the rest of his work because it is excellent.",
            "review_date": "1999-08-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Vintage Jarmusch - careful, beautiful, and true",
            "content": "A charming film about five taxicabs in different cities around the world in one night. The movie captures the unique flavor of each city it touches upon, but also shows the close relation between them all - they are all characters of the night, a different breed entirely. This movie was anything but fast-paced, and yet I still left wanting to watch these people for just a bit longer. The ending note was perfect - sad and a little hopeful.",
            "review_date": "1999-09-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Overrated for being cult!",
            "content": "A strange collection of shorts rolled into one movie with the connection being a Taxi, not the best premise for a film especially as that's the only link between them.I enjoyed this more when i was in my teens, i can't think why, other than a few amusing moments in New York which was probably down to the amount of swearing in it than the movie, which just falls flat with most of the other characters, leaving the non-existent story exposed.As much as i love Winona Ryder, she is totally miscast here and her character as a taxi driver is unbelievable as her fake accent.I'd rather watch a go-pro Taxi video on Youtube then have to rewatch this again!4/10 - mainly for the cinematography.",
            "review_date": "2022-08-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "After seeing this movie, you will never see a taxi in the same way as before !",
            "content": "Years before its absolutely cult \"Dead Man\", which stars Johnny Depp, Jim Jarmush carries out the crazy project of shooting five different taxi stories in five different parts of the planet. In addition to a dreamy casting for every single story, it is finally the profoundly human and realistic part that touches the spectator. From the hollow conversation in the first fare to the touching story of the last, passing through Roberto Benigni's unsuccessful confession (at the top of his art), each and every story mesmerises us with the help of the night atmosphere. Supposed to be simple night taxi stories, their symbolism and their poetry go beyond the setting they are set on. The diversity of the roles and the stories as well as the places and cultures, mixed with a desire of originality, transform \"Night on Earth\" into a cult movie that, despite its five stars cast, is too often forgotten. Big mistake because after seeing this movie, you will never see a taxi in the same way as before! Full review on our blog Los Indiscretos : https://losindiscretos.org/english/night-on-earth-1991-jim-jarmusch/",
            "review_date": "2016-12-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Paris is the best",
            "content": "Jim Jarmusch creates 5 vignettes from around the world of cab drivers and their passengers.In Los Angeles, tomboy cabbie Corky (Winona Ryder) picks up Hollywood executive Victoria Snelling (Gena Rowlands) at the airport. In the end, Victoria offers Corky a movie role but she rejects it for her plans to be a mechanic. Winona is cute as a cabbie but very, very, very fake.In New York, YoYo (Giancarlo Esposito) can't get a cab to go to Brooklyn until Helmut Grokenberger (Armin Mueller-Stahl) picks him up. It's Helmut's first fare and he can't really drive. YoYo takes over driving and picks up YoYo's loud sister-in-law Angela (Rosie Perez). This is lotsa yelly fun. Armin is great, Giancarlo is terrific and Rosie is loud.In Paris, a cabbie from Ivory Coast (Isaach De Bankolé) is angry with passengers and throws them out. He picks up a blind woman (Béatrice Dalle) and they have a tough discussion. This is my favorite of the vignettes. I don't know who Isaach was at the time but he's amazing.In Rome, a cabbie (Roberto Benigni) is driving like a mad man and he picks up a priest (Paolo Bonacelli). He makes a lot of crazy confessions and then the priest dies. This one depends greatly on how much Benigni one can take. It's a bit too much for me.In Helsinki, a cabbie picks up three drunk guys. One of them was just fired from his job and then he passes out. This one is a fine sad story although it may work not as the last one. I would end stronger with the Paris one.",
            "review_date": "2015-08-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I'm very bored. Now, everybody will call me stupid.",
            "content": "Few directors enjoy the cult status that Jarmusch does. Sadly, he is praised undeservedly, this film is not ingenious. So why do people praise him so much? The answer may appear at the conclusion of this review.The film's plot revolves around five taxi rides around the world, at night. They take place in Los Angeles, New York, Paris, Rome and Helsinki.The way the movie is filmed is unambitious, the camera is placed in the taxi, the driver in the front seat (to the right of the screen), the passenger in the back seat (to the left of the screen). Technically (camera placement, cinematography, lighting etc) Jarmusch doesn't offer us anything new, so people shouldn't praise him for this.The worst part about this movie is the plot. Jarmusch shows us long and boring monologues, uninteresting dialogue and a very weak plot. This is why no studio will ever finance him. Oh, but he's proud of that, isn't he? The way people talk, and what they say is very boring. Even if you have a great actor playing the part, and saying the lines in a very interesting way, this doesn't make you interested. Imagine Morgan Freeman, or David Letterman saying \"We're out of milk\". Even if they do say it in a way which is most accurately described as awesome, you're still not interested. The great Kurosawa said \"Though a mediocre director can sometimes make a passable film out of a good script, even an excellent director can never make a good film out of a bad script\". Jarmusch wrote this script in eight days. Jarmusch wrote a very bad script. You can say, \"but this is how people talk in real life\". If we were more entertained by real life than by movies, the movie industry would cease to exist. The reason we watch movies is to see something that we don't see everyday. Showing me something \"real\", something I can see everyday bores me. He isn't just showing people the way they talk in real life, he is showing us real life. He might as well have turned the camera on in a cab, and made a movie out of it. Writing a script in eight days is not impressive, it's insulting, he didn't put enough effort into it and it ends up sucking. If you are making a movie, put more effort into the script, because people watch movies. People deserve better, especially if they are paying to see the movie. Nothing happens in this movie, I'm serious, it's just people talking in a cab! That's it, nothing more! Jarmusch has said that he would rather make a movie about a man walking his dog, than a movie about the emperor of China. Does he LOVE emptiness in a movie? Does he LOVE a movie that has no story, or a very weak one? He is the biggest enemy of all fiction, he hates a good story, and he loves a bad one. He loves boring things. The most interesting thing about Jarmusch is his hair. The script is the major fault in this movie, because of the bad script the movie is terrible.The film has some good acting, I guess. Nothing memorable, though. Roberto Benigni is a great actor and director, see \"A beautiful Life\". Winona Rider is also respectable. The person who plays the Norwegian cab driver is very good, and his monologue, I will admit, is well written. It's not the imagery we see in Bergman's \"Persona\", a film which contains the single best monologue in history, but it's good. Jarmusch probably worked a whole day on it.The music in the film is not consistent with the tone. People talking in a cab at night is not Jazz. It's not The Blues. It's just people talking in a cab. Jarmusch put it in, probably because he likes Jazz, that's it.Why people like him still alludes me, but I'll give it a shot. It's because they don't want to like what everybody else likes. They want to be unique. They want to see independent film making, they probably also like Indy rock. It's OK to like something, but to wrongly preach about how great it is, when it's really just boring, and act as if you are better than people who don't like this film for a reason, that's wrong. I don't like this film for the reasons above, why you like it, I don't know. Maybe I'm just too stupid to get Jarmusch.",
            "review_date": "2012-01-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "terrible",
            "content": "I can't believe that IMDb watchers rated this a 7.7 stars, they must've been high on some kind of serious drugs or something! Five pointless stories about five foreign cabdrivers. This film makes you think that something is going to happen around the next turn but nothing does, no cool twists or anything funny just boring stories that made my girlfriend fall asleep. The first two stories were better than the last three. The boring story with Winona Ryder was probably the best, this was one of her first films and must not have read the script very well. She must have needed some money real bad to decide to do this horrible movie. Get ready to put your ear plugs in when you see Rosie Perez coming with her annoying shrieking voice of darkness! This scene was really annoying even the drunks in the ghetto wanted to tell her to shut up. I was hoping that each story might have some type of twist coming into the plot, but they never did and I was very surprised I watched the last two stories, they just got worse as they went along. The last three of them are even captioned, you actually have to take the extra energy to read the words, so really!!! – Don't bother with this movie, it really sucked. Absolutely pointless, none of them had any substance.",
            "review_date": "2011-08-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Five great shorts",
            "content": "The five locations filmed on this 'Night on Earth' are five separate shorts. The common theme of middle of the night cab drivers is what brings them together.  They were all enjoyable, but my favorite was the Rome one.  I would have hardly thought something in subtitles could've been so funny, but it sure was.  The Helsinki one was a very good 'tragedy of human life' piece.  They all did a great job commenting on the variety of human characters out there in this world.Note that three of the five segments are not in English.  I hope that doesn't turn people off too badly, as they'd really be missing out then.",
            "review_date": "1999-10-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The best of Jarmusch",
            "content": "This film is one of my all-time favorites. Night on earth is about power and the silliness of our assumptions about social status, being in control, sexual mores, power and moral strength. We are still not too far from the animal world, but instead of brute force, we use social conventions to establish a pecking order in every situation. We move into any social environment with some expectations about our place in it relative to the status of others. Night on earth is a little study of these expectations. Every one of the episodes has a beautiful triangle of power, morals and expectations.The cabbie - the casting agent - her boss/client in LAThe cabbie - Yoyo - his sister-in-law in New YorkThe cabbie - the priest - the transvestites in RomeThe cabbie - the diplomats - the blind girl in ParisThe cabbie - the drunk - his friends in HelsinkiThe casting agent of the LA story is socially superior to the dirty little cabbie girl (played delightfully by Winona Rider;) but we soon learn that she is not on top; she is a slave of the demands of her job, the whims of her boss/client. When she tries to assert her status by condescending to the cabbie girl the whole structure of assumptions falls apart. Status is meaningless if you do not want it. In the end the true strength award goes to the Corky. We see the same idea evolving in the other episodes as well.Every story starts with an assumption, an assumption of social order that first gets twisted then turned completely upside down. This twist and turn is played out with flawless consistency in each episode.Whichever character appears to be the weakest in the setup of our social assumptions turns out to be the strongest by the end of the ride.I will not bore you analyzing them all and you do not need to see it for its 'deeper meaning.' This is one those wonderful movies that can entertain at any level. I've never seen Roberto Benigni this funny or Rosie Perez this cute and sexy. Without question this is my favorite Jarmusch movie, and I am sure your will like it too. Do not miss it!",
            "review_date": "2001-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "We're not so different, after all",
            "content": "This is only the second(the other being Ghost Dog: The Way of the Samurai) film by Jarmusch I watch, even though my interest in him has been growing for a while. If you've been exposed to anything by him or at least heard about it, you know that he's not mainstream. He makes movies comparable to short stories(not necessarily the most recent brand of such, those get to be all about your own interpretation, and are very vague). Slices of life. This visits five different cities around the world(New York, Los Angeles, Paris, Rome and Helsinki), and thus contains four different languages(!), as three of these places are in Europe. Different classes and types of people meet, as each time we go to a new place, we follow a cabbie and his fare(sometimes plural), all in this one night, possibly starting at the same time. There is no overarching plot connecting them all; what makes them similar is that they're all human beings with a history and personalities. The realism is high, if there are oddities. Not all the characters are likable(and there are stereotypes among them), but they tend to be interesting and credible(flawed, *real*), same as their backgrounds. The acting is great, with some performances being downright excellent. This is carried by the dialog, what is said(and in what way), and what isn't. Other than establishing shots of the 5 places(that are not all alike, going right from a metropolis to something you could almost call quaint), most of what we see are the drivers and the passengers, there are no flashbacks and occurrences are largely retold, not seen. The editing and cinematography are subtle; the focus here is on the content, not the form. There is also hardly any music, other than the main theme, which has variations on it for where on Earth we are(and in what culture) when we hear it, so to speak. The majority of the humor is discreet, as well, with the obvious exception of Benigni(and arguably the NY segment). There is plenty of swearing, a bit of sexuality in the lines and a little disgusting content in this. I recommend this to anyone who likes pictures like these. 8/10",
            "review_date": "2010-06-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "So entertaining.",
            "content": "Each segment is perfect for the characters and their part. Terrific acting with reason and purpose. I enjoyed this film completely. I have to say it introduced me to Roberto. What an introduction I laughed so hard I had a side ache. It's worth seeing for him alone even with the subtitles. He's amazing he takes over the screen and never let's go .you may have to see this part over and over again because you're laughing so hard you miss parts. This made me a fan of his for life. So much so I watched , his greatest achievement ,\" Life is Beautiful.\". I had decided not to watch Holocaust movies any longer after seeing, Sophie's Choice and Schindlers List. Too sad and half my family suffered from similar fate at the hands of turks.",
            "review_date": "2022-03-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pumpkins, Sheep, G,a.y.s and sister in law....it's too much for the Priest!!!",
            "content": "The genius of Jarmusch strkes again, however for all five segments just two them worthwhile at all, the first one in LA Winona and Rowland is a peace of crap, the second one in New York lifted the degree but still low standard for a Jarmusch's level, in Paris is great really, all french people on bad temper as always and forever, the night in Rome is the best one, Benigni and the priest in some kind of christian confession is outrageous funny, dirty sins are too much for the religious man who had a heart attack, the last one is enough funny only!!!Resume:First watch: 1999 / How many: 2 / Source: Cable-TV-DVD / Rating: 7.5",
            "review_date": "2018-04-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great concept",
            "content": "The concept behind this film from Jim Jarmusch is interesting - five short stories of cab rides in cities around the world in the wee hours of the night (Los Angeles, New York, Paris, Rome, and Helsinki). There is something to the ephemerality of a shared human experience where two completely different people get to know one another randomly, and then part never to see one another again. Even in these small interactions, they may rub something off on one another, and I think that's what's at the core of what Jarmusch was going for.The film held my interest, but where it fell short for me was in its characters, which often seemed simplistic or like caricatures. The casting agent looking for a star in Los Angeles and the profanity laden shouting in thick Brooklyn accents in the first two stories come to mind, as does Roberto Benigni's antics and ribald stories to the priest which aren't much better. The independent blind woman in Paris sent a nice message, but it seemed pretty easy too. The film needed more of a consistent sense of realism, and does not start off well - I didn't buy Winona Ryder as a cabbie or how dopey and childlike Armin Mueller-Stahl was. Tonally the film veers between comedy to drama and maybe that's the point, to show a range of the human condition, but the swing between Rome and Helsinki was too much for my taste.There are some nice shots of the grittier sides of each of these cities, and Jarmusch was wise in not showing their glamor. There are also small bits revealing racism towards the black characters, and these were also delivered an intelligent degree of restraint: the taxis not stopping for the guy in New York, and this line heard from a distance in Paris: \"I'm not a racist, but you drive like a f*ing black!\" The score from Tom Waits was also a highlight, certainly pairing well with the night feels and the story in Helsinki. It's all set up to be a really good film, but it's let down by its script.",
            "review_date": "2022-07-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Funny as films come and diverse as life on earth",
            "content": "After watching \"Night on Earth\", it is not hard to see why Jim Jarmusch is regarded among the greatest of independent filmmakers. Brilliance pours from every scene of this movie. As you probably know, the film takes place in five taxi cabs in five different cities on the same night. In a film with a such format, it is tempting to comment on \"which segment is superior\" but this would be missing the point entirely because \"Night on Earth\" is greater than the sum of its five parts, although it is true that the five segments can stand easily on their own. The L.A. segment portrays two very different women, for whom expectations from life differ completely and yet they are both content with who they are and they can somehow connect at some level. The N.Y. segment is hilarious, especially the part played by Rosie Perez. The trio in the taxi can only come together in New York, I guess. The Paris segment works so perfectly on so many different levels. It mainly raises questions about prejudices, not just about where people come from but simply about regarding others who are not like us. At the end, it leaves you asking \"who is more blind?\". The infamous segment in Rome is comedy at its purest and Roberto Benigni in top form. I guess it will be the most bizarre and entertaining confession I will have ever heard of. The Helsinki segment seems to end the film on a sad note but in my opinion, it actually says more: Although we sympathize with the two \"talking\" passengers since they sympathize with the taxi driver, it is again these two who are inconsiderate to their friend. And as for the driver, although he is deeply sad and wounded, this sadness is a little self-centered and he has no pity to those whom he can actually help. As a whole, in addition to being a very good comedy to make you laugh, this film makes you contemplate about life, people, space and time. It opens in L.A. just about when it is getting dark and ends in Helsinki at dawn. While you actually know that these stories are taking place at the same time, it feels as if you have witnessed a night go by on Earth and have made a unique journey.",
            "review_date": "2009-04-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Multi national taxis",
            "content": "Jim Jarmusch directs five distinct taxi rides from different cities around the world. The first is set in Los Angeles with Wynona Ryder as the driver and Gena Rowland's as a Hollywood exec looking for an actress for role in a film. She feels that Ryder would be perfect for it so Ryder must make that decision.The second ride is in New York City with a German immigrant who picks up Yo Yo and his sister in law, Rosie Perez and they show him the highlights of Brooklyn.Number three is in Paris with a blind French passenger being driven by an African driver. They try to communicate but there is a big language and cultural barrier.Number four is in Rome with the cabbie picking up a priest and confessing all kinds of crazy sexual sins. This is the funniest segment of the bunch.The fifth and final one in set in Helsinki. Three drunken passengers who have been laid off from their jobs take a ride and describe their problems to the driver.Night on Earth is a charming vignette with music by Tom Waits.",
            "review_date": "2012-03-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Gena Rowlands was a good lookin' dame",
            "content": "If birth certificates are to be believed, Gena Rowlands is 60 in this movie. She is every bit as good looking as any woman half her age and, far as I can tell, not a hint of cosmetic surgery. She's not just a pretty face, though. She's a fantastic actress, conveying the story of a woman through her interactions with cab driver Wynona Ryder and phone calls she makes to who-knows-whom. And by gawd she's still going as of 2023. I'm in love.Giancarlo Esposito in the NY segment. That man was hilarious. Who would believe he'd grow up to be Gus Fring on Breaking Bad. I love the way he takes over the driving, the jazz starts, and he gives the actual driver, an East German immigrant Armin Mueller-Stahl, the ride of his life through Manhattan. Loved it.The third segment in Paris, first with the African ambassadors and then with the blind white woman, interacting with the cabbie from The Ivory Coast, says more about race relations than Crash and Bee Ell Emm riots put together.The irrepressible Roberto Benigni shows up in the 4th segment in Rome to do his shtick. When he gets rolling with his confession to the padre in the backseat I laughed. Others might be grasping at their chest like the padre. Tastes vary.Benigni's comic relief sets up the final segment in Finland, where you're gonna hear a story that'll make you feel like an 2ssh2ole for whining about all the trivial szhyyt in your life.A remarkably rewarding film.",
            "review_date": "2023-03-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "IN A WORD - FUNNY",
            "content": "One of the few movies that I've seen in recent years that actually made me laugh out loud.  The best segments of the movie were those not obviously played for laughs - Paris (hilarious) and Helsinki (touching).  Recommended to anyone that wants to see a quirky film that is also very funny.",
            "review_date": "1998-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tragicomical and entertaining",
            "content": "Night on Earth... Just another picture that you didn't plan to see, but you just couldn't stop watching when you got to see on your TV set. It's not one great story, but several, and the comical about the driver who doesn't understand the gear box, but lets his passenger drive his car, and the tragical about the Finnish driver whose 14-year-old daughter has got pregnant, is a great mix. Next time it's showing on TV, be sure not to miss it!",
            "review_date": "1998-12-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Taking liberties with the storytelling medium has its ups and downs",
            "content": "Night on Earth is an odd little film from an odd little director named Jim Jarmush. I'm a fan of Jarmush's style in writing and directing and he really tries to shine through this film. It tells five different stories about five taxi cab drivers in four different countries in one night. Each story is very different and none of them really begin or end. It is really five snippets of the strange occurrences which happen between us at night. The stories take place in Los Angeles, New York, Paris, Rome, and Helsinki. The film is very loose and very odd, making it interesting yet sometimes hard to really become devoted to.There is no real connection, blatant, or metaphoric, between the five stories. They all seem to be in their own little worlds simply documenting the happenings that go on late at night in taxi cabs. It could be argued that the films only goal is to document these melancholy little tales, not having any other motives and not trying to be any more than an anthology of stories. From this perspective the film just ends up being pretty dull when you look at it as a whole. Each story in its own right is fairly entertaining and it can be plenty amusing, but anything and everything that happens in this film ultimately amounts to nothing. The film really goes nowhere and doesn't seem to accomplish anything. But again, maybe it isn't trying to. Maybe it is simply just a portrait of the quiet night life that occurs in 4:00 AM taxi cabs. The only thing that is certain is that Jarmush has taken some playful liberties with the storytelling medium and has created a film that is very different.Once you get past the fact that Night on Earth really isn't trying to do anything amazing, you can appreciate it a lot more for the good things about it. Jarmush's script is great and he writes witty banter excellently. There is little to no action in the film. It is all about the dialogue as the actors sit in their taxi cabs and discuss life, death, and everything else. Luckily, the dialogue is the most engaging thing about the film when it needs to be. It is that and the great acting by all the performers. None of the five stories fall flat from an acting standpoint and they only grow more and more interesting until the last story which takes place in Helsinki which is most definitely the most enthralling. There are plenty of great things going for this film, I'm just not sure what any of it is supposed to mean and what purpose anything in this movie serves. Better yet, I don't know that this movie has a purpose.Regardless, Jarmush has made a very interesting film with Night on Earth it is intelligent and almost always entertaining. There's nothing here to make me dislike the film but at the same time that is the problem. There isn't much here so I can't love it either. All in all it is a film of high quality and class, but at the same time it feels a little empty because of no real connection or leading element to fuel the film. Night on Earth is a good film, but it is really nothing more than five separate short stories with no real beginning and no real end.",
            "review_date": "2011-06-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful fragments of human life",
            "content": "There isn't much going on in Jim Jarmusch film, but there's a lot happening beneath the surface. Even more than he is a terrific filmmaker and a wonderful screenwriter, Jarmusch is a great observer of human nature. Even though 'Dead Man' and 'Ghost Dog' are the films that gave him more widespread commercial success, these are not typical of his style; Jarmusch's early film hardly have any plot at all, and all they give us is fragments of human lives. His approach towards his characters is always very up-close and personal, but never first-person; the viewer is always an observant, sometimes as comfortable as a close friend, sometimes too close for comfort, almost a voyeur. And yet, with his incredible insight into the human soul and what makes it tick, Jarmusch makes every one of his characters come to full life \u0096 even though there are no internal monologues, no revealing close-ups; Jarmusch creates his characters solely through their behavior; and he understands people so well, that in doing so he completely transcends the boundaries of language, culture and nationality.Like Jarmusch's previous film, 'Mystery Train', 'Night On Earth' gives us several different stories about different characters from different backgrounds. This time, though, there is not the slightest connection between the stories, except a thematic one: we are shown five stories taking place in taxi cabs in five different major cities around the world.The first story takes place in Los Angeles, and in it is a twenty year old (but she looks seventeen at most!) Winona Ryder, fresh from her break in Beetle Juice and Edward Scissorhands, who plays a young, perky, smart-ass, chain-smoking taxi driver and gives one of the most brilliant performances of her career; opposite her is another terrific actress, Gena Rowlands, as an uptight, busy Hollywood agent.In the second story, taking place in New York, black Brooklyn native YoYo (Giancarlo Esposito) has a hard time getting a cab in Manhattan, and is finally picked up by Helmut, clown-turned-taxi driver, Eastern German immigrant on his first day at the job (and his first day on an automatic, as well).The third story is located in Paris, in which Isaac De Bankole (the unforgettable Raymond the ice cream man from 'Ghost Dog') plays a taxi driver who's having a bad day, as he picks up a blind woman (Beatrice Dalle) who doesn't make him feel much better.The fourth story, taking place in Rome, is practically full-out Italian comedy, with Jarmusch's old friend Roberto Benigni plays a bizarre taxi driver who's giving a bishop (or is he?) a hard time for his money.Finally, in the fifth story, located in Helsinki, the wonderful Matti Pellonpaa plays Mika, a cheery yet melancholy driver, who picks up three young drunkards and shows to them the true nature of pain.Each one of these stories has a very distinct and unique atmosphere, ranging from comedy to drama, and revealing, often, the different mentalities of the different countries; the humanity, though, runs all the way through. All of Jarmusch's characters are different and yet the same; they are all equally human, and he understands them all, but each one on their own terms. Jarmusch's observation is always brutally frank and sincere, and always loving and forgiving, for all of his characters equally. Night On Earth is sometimes sad, often funny, mostly touching and always beautiful. There may not be much going on, but it never fails to fascinate.",
            "review_date": "2005-06-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Jarmusch on Jarmusch",
            "content": "Jim Jarmusch's Night on Earth will surely divide audiences. Those familiar with his work will most likely find plenty to like, while others might find it slow, boring, and pointless. Even as a fan of Jarmusch, I admit this has it's slow spots. However, it's mostly quite entertaining. The second segment, where we have a East-German refugee who can't handle driving a cab in the city is probably the best segment as we see him and his passenger struggle communicating with each other. The third segment is also quite hilarious with Benigni being a sex-obsessed cabbie. Benigni fans in particular should love that segment. As a Tom Waits fan, the use of Waits' music in between segments only adds to the greatness of the movie. Overall, this is more entertaining than Jarmusch's Coffee & Cigarettes and I'm glad this has finally been released on DVD.",
            "review_date": "2007-11-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This was truly terrible",
            "content": "Not sure what the point of this movie was. We get enough of the ordinary in our lives so that is why we turn to movies or shows-for some drama or movement or action or an engrossing story...this had NONE of those things. The movie bombed so my review isn't harsh. I think the only reason anyone saw it back then would've been for Winona or Gena or Rosie. I don't think anyone would've known any of the other actors...they were no names at the time. I can't imagine anyone being happy about the fact that once they got into the movie theatre they'd be reading subtitles pretty much the whole movie. None of the stories had points or resolutions - we know nothing about these people when their segment is done. It's just overall very frustrating and bleak. Some of the reviews stated that this was funny! The last segment was a story about a taxi driver who lost his newborn baby three weeks after it was born! And then the movie ended! That was sad not funny. The one that had potential to be funny was the one in NY but it devolved into Rosie Perez repeatedly telling Giancarlo to shut up but with more colorful language. It wasn't funny - it was annoying. The only one that seemed to have potential was the one with Winona and Gena. It was entertaining and I liked their exchanges. The story drew you in and made you want to know how they both ended up. That is the only reason I gave this 3 stars. There is no deeper meaning here or any humor. I feel mad I wasted time on this garbage.",
            "review_date": "2022-12-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A great piece of artwork",
            "content": "Well, I suspect I am a little prejudiced about this movie. Although the ending part, which was situated in Helsinki (quite south, I'd say,like the first parts of the film. Or west.), was the saddest one, I liked it the most. This film is both funny and sad at the same time. There are no funny parts or sad parts - just parts of life, all of them both. The result is not only a great piece of movie, but a great piece of artwork - paintings, short stories, stageplays, musical scores - everything.And by the way - four of the five parts were subtitled. :P I'll give a nine to this, since there are no number 10 movies, and you can not give partial numbers.",
            "review_date": "2005-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The priest's life is in danger to listen to Benigni's confession.",
            "content": "Not everyone thinks that actors are superior. New immigrants and the bottom of society often have a common language. The blind can't drive, but the people in the accident have good eyesight. The priest's life is in danger to listen to Benigni's confession. Everyone is miserable. The above five stories~~",
            "review_date": "2021-05-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A bumpy ride",
            "content": "Her name was Lola; she was a sheep. As Roberto Benigni's lascivious taxi driver confides in his incredulous fare, he wanted \"something that moved, that looks you in the eye... something with a soul.\" After losing his virginity to a pumpkin, Lola was definitely a step in the right direction. Alas, his embarrassed father sold Lola to an \"ugly, uneducated\" butcher for 80,000 lire. \"I felt so badly, I haven't eaten meat since.\" By the time he's confessed he's shagged his sister-in-law - her cotton panties reminded him of Lola's fleece - his passenger, a bishop (Bonacelli), is lying dead on the back seat from a shock-induced heart attack. It's 4am: what to do? Benigni's powerhouse performance is the high point of a film incorporating five different taxi rides, set during a single night in five cites. In Los Angeles, harried Victoria Snelling (Rowlands) thinks her sweary, tomboy driver Corky (Ryder, not so much chain-smoking as absorbing whole cigarette packets through osmosis) would be perfect for the film she's casting - only Corky turns her down.Over in New York, an East German clown-turned-cabbie (Mueller-Stahl) who doesn't know how to drive, teaches sceptical YoYo (Esposito) the virtue of patience. Meanwhile, in Paris, two outsiders - Béatrice Dalle's sharp-tongued blind girl and her sullen driver (De Bankolé), a victim of racial prejudice from the Ivory Coast, reach an understanding.That same night, in Rome, Benigni's cabbie talks his holy passenger to death while making his confession, and, in Helsinki, a laid-off industrial worker and his colleagues (Väänänen, Kuosmanen and Salmela) meet a taxi driver (Pellonpää) with rather more to be depressed about. Travis Bickle had it easy.We're in familiar Jarmusch territory here, with his recurring theme of loners reaching out to one another in the dead of night. And there's little delights to be found tucked away within these red-eyed meditations; not least Tom Waits' clanking score - evoking the ghosts of New Orleans and Kurt Weill via Captain Beefheart.Night On Earth isn't Jarmusch's best movie - despite some good turns from the cast, it's too uneven, and the weaker segments (Los Angeles, New York) could have been excised without any loss of quality or coherence. Not that the film follows any linear strictures (however inverted, as with the superior Mystery Train) or narrative arc: Jarmusch isn't interested in dealing a complete hand here - merely shuffling the deck around and plucking cards at random.The effect is rather like bolting through an exhibition of Edward Hopper paintings at high speed, half-glimpsed nighthawks on the periphery of vision. The whole film is redolent of a Tom Waits lyric from his classic 1985 album 'Rain Dogs': \"I've seen it all. I've seen it all through the yellow windows of the evening train.\"",
            "review_date": "2009-11-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Low-key academic humor in a number of short films that have a taxi in common.",
            "content": "You really need to be in the right mood to watch this movie and enjoy it. It's slow, it's really a handful of short movies spliced together with the common theme of a taxi being present.The movie focuses on conversations as opposed to action or much interaction between the characters- they are all talking to each other mainly and not much else.I would call this movie quirky - at points there are obvious glitches in the acting or the editing but the overall movie is pretty interesting, but it's not guaranteed entertainment all the way through. Some scenes drag, but then you realize what the plot development was for, but it usually has the same impact as the ending of a short story, it loses points for that unevenness in presentation and lack of cohesion overall.It's worth a peek but it's more art-house curiosity than mainstream entertainment.",
            "review_date": "2007-06-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "4 out of 5 ain't bad",
            "content": "This is a really terrific film that takes place in five cabs in five cities: L.A., New York, Paris, Rome, and Helsinki.  Fast forward through the first story with Gena Rowlands and Winona Ryder:  it is wooden, boring and unconvincing.  All the other four stories, however, are funny, touching and entertaining throughout.The second story pits the unlikely pair of Helmut and Yo-Yo, (not to mention the typically verbose Rosie Perez), and has the right tone of humor and sadness.  I wish we could have seen more of this brief friendship.The last three stories are all foreign.  The Paris chapter concentrates on a black cab driver who is made fun of by foreign (and also black) dignitaries. He is proud, until later he finds a cynical blind woman and he becomes curious about her.  It's not riveting, but it does hold interest.The fourth story from Rome would be normal slapstick fare ... if it weren't for the manic comedy of the great Roberto Benigni.  His monologue to the priest in the back seat of the cab - even when read, not heard - is hysterically funny, with Benigni giving the perfect blend of absurdism and sincerity.  You can't tell whether he is telling the truth or not, and you can see where the comic brilliance that produced \"Life is Beautiful\" comes from.The fifth cab takes place in Helsinki (that's in Finland, right?) Three drunks get into a cab, one of whom has had the worst day imaginable.  Then the cabbie tells a tale of his own, and it puts the unlucky drunk's problems in proper perspective.The great thing about this film (other than the various locales) is that each one could work as a stage play, or a radio play.  It's about people, and what different people can learn about each other, even if they are put together by chance.  None of the combinations of driver/passenger would probably remain friends in normal life, but for the brief moments they are together, they gain (or in the Rome story, lose) something as a result of the other's experience.",
            "review_date": "1999-09-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Light at the End of the Tunnel",
            "content": "Jim Jarmusch's experiment is a succession of 5 \"short\" films, all taking place in a taxi, at night - hence the title - in various cities. If you've experienced anything like Paris, Je T'Aime or it's New York based counterpoint, then you have an idea what to expect... except you don't, not really. All the flaws are reversed.Jarmusch has a knack for absurd situations, but 2 important factors constrain him in this case: Length: 5 minutes per film might be a bit short sometimes to get anything more than a gimmick or gotcha, but 20 minutes, given the confined space, proves tiresome in most of the vignettes. There is simply too little for many of his characters to do or express given the rules Jarmusch has set himself. Cliché: not a bad thing in itself when it can be subverted a bit (and to a degree, one of the segments does this with a lot of charm), but here things become a bit too obvious. Of course, the LA segment is a bout filmmaking/acting, the Paris story about sex, and the Scandinavian one had to be about death. Mixing things up could have been more refreshing. The twist to the French one saves it a bit.The consistency of vision helps, something compilations of shorts by various filmmakers lack. But the real saving grace is the performances - with the exception of a typically overbearing Roberto Benigni - and the jewel of the collection, so to speak, that is the Paris segment with the ever- dependable Isaach De Bankolé. In fact, a whole film wit his character would have probably a better final product, though that would deprive us of the sight of Armin Mueller-Stahl and Gena Rowlands, two touching artists we see all too rarely.Worth seeing at least once.",
            "review_date": "2013-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A film that gets better with each segment",
            "content": "The first segment is pretty good but doesn't have the best acting and isn't very funny. The rest are great, the highlights being the last two.Night on Earth is an interesting delve into 5 different groups of people in 5 countries that are in Taxis, like all Jarmusch films the dialog and characters are incredible.This film doesn't look amazing,nothing too special cinematography or lightning wise and it gets a bit boring looking at a Taxi for two hours.The worst part about the film is how repetitive it is. Until the last two segments, the segments have very similar structure.Overall it's great, it probably deserves a 7 but the last two segments are incredible so I'm going to give it an 8",
            "review_date": "2019-08-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A different type of cinema",
            "content": "Jim Jarmusch's film Night on Earth is a series of taxi cab encounters, each of which is set in one of five major cities around the world. People of different social origin and background are placed together in the cabs with the knowledge that they (driver and passenger) have only a limited required role to play and that it is unlikely that the other person has or will have any connection to their life in the future so nearly anything goes. Most social pretense is dropped as a result of this and these people are often seen telling things to complete strangers that they wouldn't dare tell their closest companions.With Night on Earth, Jarmusch found a unique way to look at his characters. Nothing life altering happens to these people in the course of the film and there is very little conflict. Drama, conventionally thought of as essential to effective film-making, is eschewed here. Since plot isn't really an issue with this film there is plenty of time to focus on characterization. Thus Night on Earth is populated with no less than a half dozen fully articulated characters while most films struggle to flesh out one or two.It helps, of course, that the characters are interesting and of course people who end up in taxi cabs in the middle of the night tend to be about some intriguing business. We never know, for example, how a Catholic priest ends up needing a cab on a deserted street but we do know plenty about his driver (the manic Roberto Benigni) who describes in great detail three separate sexual encounters, only one of which involves another human. There's also the cocky tomboy driver (Winona Ryder) who is just plain uninterested in something most people would consider the chance of a lifetime. Ultimately, these characters express a wide range of emotion: some are funny, some are sad, and some are just curious. Their actions always seem realistic if not necessarily logical.Writer/director Jim Jarmusch does an excellent job giving each scene its own flavor, mostly through aesthetic choices, particularly lighting and framing. The scenes never devolve into theatrics the way many films that have to focus on enclosed spaces do, though, as Jarmusch always knows when it's time to switch to an exterior shot or even take the action outside the cab for a minute or two. Ultimately, Night on Earth succeeds at creating a different type of character based cinema and does so with an admirable sense of style.",
            "review_date": "2010-05-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "3 A.M",
            "content": "The world is round so no matter where you go you are always in the center of it. This is one of the best Jim Jarmush movies. Great music, great photography, great acting, it's all good. It's magic.\" Why would I drive if I could be driven?\" This is the first thing I think about it whenever I see this movie. It always remindes me on my country, my childhood and place I belong to. For the ones who didn't know, the really story about Christopher Marlow, the Devil as himself A.K.A Men in White is from the one of Jim Jarmusch movies. On the bottom of, line I like cab driving. Sincerelly, yours Dushan Petrovic from Belgrade, Serbia",
            "review_date": "2017-12-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "just average",
            "content": "This is not one of Jim Jarmusch's best movies and this is just like Coffee and Cigaretts in which some of the short stories are good and others are not. There are five short stories set in cabs at night in five major cities. The first one is in L.A. with Winona Ryder picking up Gena Rowlands from the airport. The second one has Giancarlo Esposito picked up by Armin Mueller-Stahl in which Stahl can hardly drive and can't find his way to Brooklyn so Esposito decides to drive instead. The third one in Paris in which a black cab driver kicks out two men for making fun of him and picking up a blind girl who he thinks won't mess with him. The forth one in Rome with Roberto Benigni picking up a priest and then decides to confess right in the cab about having sex with a pumpkin and then a sheep. The fifth one in Helsinki in which the driver picks up three men and one of them has had a terrible day and the cab driver listens to his story and has an even more depressing story. The first two stories just don't work that well but they get much better with the last three.",
            "review_date": "2005-11-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I wonder....",
            "content": "You ever wonder what could be happening to someone like you, thousands of miles away?  The cab rides in this film take place at approximately the same time, but the stories couldn't be more different.  Shame on Bravo for muting out the two words that dare not be spake on this review (the crude terms for sexual intercourse and natural fertilizer)--especially since they left them in the subtitles in the foreign-language sections.  What, we can hear but we can't read?The cast turns in uniformly good performances, and the film first exposed me to Armin Mueller-Stahl and Roberto Benigni--if you don't laugh yourself silly at Benigni's confession you must be legally dead.",
            "review_date": "1999-11-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Rome has Roberto",
            "content": "5 nights in 5 cities; Paris has Beatrice Dalle playing a blind person - nice juxtaposition of character considering previous roles, NY where the passenger takes the wheel is great as is Rome where Roberto Benigni makes his second appearance in a Jim J film. Roberto has a bishop in his taxi. In LA Winona Ryder and Gena Rowlands are contrasted well. Helsinki - bleak and a strange place to end the film. I would have changed the running order to finish with Rome perhaps.",
            "review_date": "1999-04-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good Directing and Performances",
            "content": "6.5 of 10 stars. This is a good Film that is well Directed by one of the most influential and respected Director's of this era, Jim Jarmusch. He also wrote the Film, and the writing is great, flat out. Most Film Historians consider this Film to be a Masterpiece, one of many for Jarmusch, but I consider the Film to be good, but not one of his Masterpieces; on the other hand, most Film Historians consider 'Dead Man' to be a good Film, but not one of his Masterpieces; but I consider 'Dead Man' to be one of his Masterpieces; who am I to disagree with Film Historians?!? Either way, Jarmusch is still in the process of an amazing career. I believe if I asked 100 of the most respected Film Historians around the World what the 10 best Films Directed by Jarmusch are, they would all have different looking lists, but this would be their Top 10 consensus, and they would consider the Top 8 on this list to be 'Masterpieces':\n1. Stranger Than Paradise (1984)\n2. Down By Law (1986)\n3. Paterson (2016)\n4. Mystery Train (1989)\n5. Only Lovers Left Alive (2013)\n6. Ghost Dog: The Way Of The Samurai (1999)\n7. Night On Earth (1991)\n8. Broken Flowers (2005)\n9. Dead Man (1995)\n10. Coffee And Cigarettes (2003)The original music in this Film is done by the Legendary Tom Waits, and it matches the Directing of Jarmusch perfectly and creates an amazing feel throughout the Film.The Film Stars Gena Rowlands and Winona Ryder alongside Giancarlo Esposito. They star in the 1st 2 segments as there are 5 segments to this Film. Rowlands is one of the more respected Actresses in history that, when the part calls for, can peel the onion back and deliver as few Actresses have ever been capable of doing. This part doesn't call for that, and without over-reaching, which she could have easily done, Rowlands delivers with balance and skill. Ryder performs good also and performs well with Rowlands; Ryder seems just a bit off balance at the start of the segment, but picks up momentum, and by the end of the half hour segment, she and Rowlands are putting on a treat right before my eyes, it flat out works during the final half of the segment. Giancarlo Esposito does extremely good in the 2nd segment with Armin Mueller-Stahl, the two perform very well together, the segment works for sure.All of the segments work; the 4th segment with Roberto Benigni might be my favorite of the 5 if I were forced to pick, he knocks it out of the park with his performance, it's amazingly written by Jarmusch, it is is Directed with clear vision by Jarmusch also, as is the entire Film.",
            "review_date": "2021-12-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Earthly Cab Drivers",
            "content": "One of Jarmusch's finest. Beautifully crafted characters specially Helmut, Yo Yo and Angela, showing the contrast of European immigrants with struggling upcoming African-Americans and Latinos in NY in the 90's. All the characters are struggling with social-economical issues from start to finish. Well, I guess with the exception of Roberto Benigni's existentialist segment, everything else seems in perfect harmony with disorder. If this is your first Jarmusch, keep on going with Dead Man, Down by Law and Ghost Dog for better appreciation of his work. Jarmusch is one of the great American directors alive! Jarmusch's brilliancy comes from his simplicity borrowed from Rosselini, DeSica, Fellini, and Chaplin's attitude towards humanity.",
            "review_date": "2008-04-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "5 episodes of which I liked only 1",
            "content": "The first episode (Los Angeles) was the most boring. It had absolutely nothing to offer that was entertaining and I felt the actors didnt play very well too. Sometimes it looked more like a play than a movie. Also I found Winona Ryder exaggerated her character too much. But luckily after the LA episode came the NY episode which was the best overall. Very funny and the characters played very well too. Really gave me a good laugh. The Paris episode, well it wasnt that great overall. The Rome episode then again was a bit better featuring Roberto Benigni as the Taxi driver. Very good actor! The last episode played in Helsinki and tried to be dramatic though for me it failed as you cannot feel so much for characters you hardly know about. Besides the plot the movie featured some really great scenes and I liked the fact that everyone spoke their native tongue (the french taxi driver spoke french,...).",
            "review_date": "2002-02-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "beutifully made film expressing ones self to life and love",
            "content": "i absolutely loved this movie!!!! it was so wonderful to see how this film was divided up into 5 different locations, Los angelas,  paris, Rome, finland, and new york city. i loved and enjoyed the performances of all of the actors, and actresses in this film. i started to hear about this movie from listening to the films soundtrack score, recorded by talented musician tom waits. i loved the score so much, i was desperate to see this movie. so, when i watched it, i  loved  it from the beginning to end. this film starts off, with winona ryders character, who is a cab driver who wants to be a mechanic. driving around la, who meets up with a snobby like  agent played by gena rowlands. who have a pleasant conversation about  there boyfriends, and there jobs.  i wasn't impressed with gena's performance. her acting has never appealed to me! winona did a wonderful job, playing a  20 year old cab driver, who is just wonderful, and indeed funny in her performance!! hey, she may be in trouble for shoplifting, but, she will redeem herself. i feel for you winona!! then, it turns to  new york,  i love both the actors, guy who played Helmut Grokenberger, as a confused, kind german cab driver, who meets up with the  crude sounding, yet hysterical giancarlo esposito as the cool yoyo, it was hysterical seeing him make a silly joke about helmut's name, like himseklf referring to his name like a helmet. mentions, if he had a son, he could call him lampshade. the talk between yoyo's sister in law played by the talented rosie perez was crude, but yet enjoyable seeing them fight  like  liittle children, brother and sister like fighting. in rome, yet don't get me wrong the movie was wonderful, but this story witch features the wonderul roberto benini who was in life is beutiful, and the 1986 film \"Down by Law\" was kind of funny at first but then when he was driving the priest around, his stories get very vulger, and hard to listen to. then one of my ultimate favorites in this movie was the paris story witch featured french actor isaach- de-bankole, as a  wonderful and meaningful cab driver who talks with a lovely  blind women played by one of my favorite french actresses  beatrice dalle, who was in the refreshing horror film \"Trouble every day\", was indeed riveting, and yet remarkable as playing a blind women. she is a very wonderful actress, i reccommend, that you rent one of her movies someday. you  will love her!  then finally, in the story witch finishes in helsinki finland, witch stars matti pallopaa as mika, a truthful cab driver, with alot to say about himself, like the cab drivers, and is wonderful in his performances. this movie was one of the best films everymade!! see this movie!! i hope that they release this movie on DVD one of these days!  jim jarmusch is  a masterpiece filmaker!  this never slows when you are in touch with the stories.",
            "review_date": "2003-03-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nice and special",
            "content": "Nice movie thats getting better story for story. Quite movie with special characters.",
            "review_date": "2019-04-27",
            "lang": "en",
            "source": "imdb"
        }
    ]
}