{
    "rating": 3.8,
    "release_date": "2020-10-21",
    "num_reviews": 194,
    "genres": [
        "Drama",
        "Romance",
        "Mystery&thriller"
    ],
    "summary": "A young newlywed arrives at her husband's imposing family estate on a windswept English coast and finds herself battling the shadow of his first wife, Rebecca, whose legacy lives on in the house long after her death.",
    "reviews": [
        {
            "content": "The book is dark, mysterious and twisted, very good but the movie does not give any ominous atmosphere at all. The characters' personalities are not correctly developed, some of the good characters aren't even there. It doesn't show the extent of Daphne's mind and it focuses to much on the romance.",
            "review_date": "2023-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The reviews towards the movie were pretty harsh. I believe since many fans are comparing the movie to the novel or previous movies made by the same tittle.\nHaving no knowledge of the book or any movie, makes this romantic and mysterious movie really interesting and thrilling, totally recommend watching.",
            "review_date": "2023-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie wasn’t bad. It wasn’t memorable and I feel they spent a lot of time in the beginning bringing out her character, but spent little time really describing Rebecca or the husband. And then it just pretty much ended. The acting was good, but the ending was really bad. ",
            "review_date": "2023-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wheatley's Rebecca is solely a dramatisation, and does no justice to the original novel. It is full of spectacle and air where the plot should be. \n\nRebecca, at its core is a psychological thriller exploring the deeply sinister motives of a murderer (Maxim De Winter/Armie Hammer). The strange, one could almost say reverse Oedipal complex which dominates the De Winter's isolating relationship is the focus for the entire narrative - his patronising and arrogant comments ‘I'm asking you to marry me you little fool', and infantilisation of his new wife, ‘You've lost that strange  young lost look I loved' suggests pedophilia, and yet in Wheatley's interpretation of this classic horror, he has sadly conformed to the trivial and painstakingly untruthful idea - that Rebecca is solely a Gothic romance.\n\n The cinematography and golden age glamour perhaps distracts from the obvious lack of characterisation from Lily James, whose charming buoyancy is the opposite of the shy, timid and easily persuaded young Mrs De Winter. Aside from the incredible characterisation of Mrs Danvers, (Kristin Scott Thomas), the narrative indulges in the romance of a man twice the girl's age (which is, again, omitted) with soft sex scenes on the beach and unnecessary ‘romantic' smooches. The use of the red dress to symbolise promiscuity for the ghost of Rebecca is sadly obvious and superficial, whilst the lack of key symbols, such as the rhododendrons (female sexuality) are omitted. Sadly, it can be concluded that Wheatley has falllen, or rather indulged in the popular theory that Rebecca is a romance, and attempts to please his audience through glam and glitter. \n\nIf you want to watch a visually beautiful film and have not read Rebecca, you will be delighted if slightly disturbed by the visual hints at the unequal and dangerous power dynamic between the couple. If you know Rebecca, you will be outraged at the like-ability of this narcissistic murder, and confused by the dramatisation.",
            "review_date": "2023-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An OK remake of an OK original.",
            "review_date": "2022-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must admit watched the first 25 mins only,  so disappointed, screenplay just bland and had no feeling.",
            "review_date": "2022-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you have seen the original version of Rebecca that was done in the 1940's, you might appreciate this movie more. Rebecca is Daphne du Maurier's crowning achievement as a novelist. It is a romantic mystery with a touch of noir and the paranormal. The story is peculiar because it leaves you perpetually distressed, yet hopeful for a happy ending. It can translate well to the big screen. I like the older movie better, but this is still good and I would never discourage anyone from watching it. I gave it 4 1/2 stars. Given a choice I would watch the old version over this one because that's what I grew up with.",
            "review_date": "2022-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the book was annoying but better",
            "review_date": "2022-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film missed the mark. I can never understand why filmmakers decide to make a film based on a book if they know they are going to completely change the principal characters and vital plot points. It's an insult to the classic Rebeca by Daphne Du Maurier for this film to have the same name as the book. I have to wonder if the screenwriters' and director even fully read the book or if they decided to take the concept and loosely make a movie based upon it; the movie is inspired by, not based on the book; so much of the story and the people has been stripped away, it's something different entirely. Here's a tip: if you're writing a screenplay based on a book but can't even keep the essence of the main characters, simple details, the theme, or important plot points, and have to add in scenes that would never occur- then maybe don't write or make the film.",
            "review_date": "2022-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In no meaningful ways surpassing its predecessor, this version of Rebecca shines only in that it is visual stunning, and well acted. The plot beats are stilted at times, and the narrative lacks focus. I wanted this to be great, instead I was passably entertained. I love Lily James, and she embodied her character perfectly, I found it hard to get behind many of the characters decisions. That pulled me away from the narrative as it was centered on her.",
            "review_date": "2022-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I started watching with the expectation that this remake would never touch the 1940 Hitchcock classic. For the first two thirds of the movie I must admit I found it rather entertaining, hewing close to the 1940 film.  But in the final third the film went off the rails.  I never read the book, so I checked Wikipedia to see which film more closely resembled the Du Maurier novel.  It turns out that this movie is much closer to the original source material.  However, that doesn't mean it is a better movie.  The same thing happened with Mildred Pierce. The 2011 miniseries with Kate Winslett was  closer to the novel, but Joan Crawford's 1945 film was much better.  Anyway, this Rebecca really isn't really all that bad, I just think it's more worthwhile to invest two hours in the earlier film.",
            "review_date": "2022-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lousy direction, lousy editing, lousy story telling... and the WORST costumes I've ever seen on a leading man and leading lady - ill-fitting and unflattering.  \n\nThe wealthy Mr de Winter has one pair of un-tailored, baggy, *tan* pants to wear the entire time he's in Monte Carlo.  What's that about?   Even his pajama bottoms aren't cut right. Everything the character would have worn would have been tailored to perfection for him.  If they were bought off the rack they would have looked better. \n\nSpeaking of pants, the second Mrs de Winter's baggy white slacks look horrible on her, evidently cut from the same pattern as Mr de Winter's pants. \n\nA wonderful, talented cast is wasted in this choppy, flat, mess of a movie.",
            "review_date": "2022-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed this immensely.",
            "review_date": "2022-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is not much originality in \"Rebecca\". It felt like a hybrid between \"Jane Eyre\" and \"Crimson Peak\", but with the disappointment that Maxim de Winter murdered his first wife in the end. Despite his first wife being a cheater and manipulative woman, Maxim still killed her, which made him a murderer and, worst of all, his second wife became an accomplice when she decided to prove his husband's \"innocence\", so they could be together. It is also annoying that Maxim hid so many secrets about his first wife from his second wife and, at the end of the movie, he became brutally honest with the second wife, and they both decided to work as a team. In summary, I think the movie plot is mostly weak and both Maxim and the second wife are half-cooked characters.",
            "review_date": "2022-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Could not help keep thinking the Michell Webb Sketch on this.",
            "review_date": "2022-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a stunningly faithful adaptation of Daphne du Maurier's classic novel.\nThe casting of characters was excellent, all the characters pretty much exactly as I\npictured them while reading the book. The casting alone makes this movie worth\nwatching. There were some changes toward the end after the shipwreck was\ndiscovered which largely pertain to the trial, but they are understandable changes,\nnothing radical. The changes merely streamline the story and make it more dramatic\nfor a visual audience. Up until Rebecca's boat and body are found, however, there are\nvery few changes.",
            "review_date": "2022-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually it was beautiful, but it missed the mark and was tedious at times.  The plot additions distracted.  Instead, see the original best picture winner or read the book.  It was on Netflix.",
            "review_date": "2022-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay.  The story was a little under-powered for the caliber of lead actors.  It redeemed itself in the end as it seemed to be on a predictable trajectory that wasn't so satisfying.",
            "review_date": "2021-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Please, I think the movie great overall but I think the synopsis is misleading as it implied that some sort of supernatural power would make an appearance but never did.",
            "review_date": "2021-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This honestly makes me very sad. Did I hate the movie? No. Did it disappoint me? Immensely. Rebecca is my favorite book. This movie turned that into this rushed, watered-down, \"Armie Hammer classic\".",
            "review_date": "2021-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was it a Cinderella story based in Monte Carlo, or a ghost story based in an old English chateau, or a court battle over a murder accusation. Any of these storylines could have been explored entirely to make an interesting movie, but it seemed to move from one to another without taking full advantage of any of them.",
            "review_date": "2021-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best way to approach Ben Wheatley's adaptation of Daphne du Maurier's novel is to forget the Hitchcock take all together for a couple of hours. Wheatley once again proves that he is flexible across all genres by presenting Rebecca as more of a romance than a chiller, and it works really well. Armie Hammer and Lily James are well cast as the central characters, but it's Kristen Scott Thomas who walks off with the film, brilliantly encapsulating Mrs Danvers despite the looming shadow of Judith Anderson from Hitchock's 1940 original. Wheatley is without doubt one of the finest British directors working in cinema, and his portfolio is now staggering.",
            "review_date": "2021-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That old-school type of story telling where there truth doesn't come out because everyone keeps secrets for so long. Armie nor Lily are acting geniuses in this, but it's a well told mystery. And Rebecca (the dead wife), she wasn't that awesome.",
            "review_date": "2021-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Disappointing remake of the original Hitchcock film.  Loses on so many levels.",
            "review_date": "2021-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than I thought it would be based on the horrendous reviews, but pretty pointless as a remake.  No perspective, style, or performance indicates what the director was trying to get at.  The first half is very slow for a thriller, and the first set of Sam Riley as Favell is really the only member of the support cast who's able to add any tension.",
            "review_date": "2021-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This remake is obviously not in the same universe as Hitchcock's masterpiece, but is nonetheless a very good film with a superb cast, and a good way to introduce the story to a 21st Century audience.",
            "review_date": "2021-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My best friend and I sat down to watch this movie, thinking that lily james and armie hammer would have some spicy hot scenes together in a romantic and heartwarming film set in Europe. HOWEVER, we were flabbergasted and utterly angered to find out that all the romance happened in the first 20 minutes of the movie!!!!!!!!! Following that was two hours of absolute GARBAGE. Everything was unexpected, it took 18 twists and turns all of which were unnecessary and awful. We could have written this ourselves, in fact we were (correctly!) guessing every line before being uttered. Don't waste your time on this awful awful awful film. Also armie hammer is a cannibal. Peace and love ❤️",
            "review_date": "2021-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is the worst movie I have ever watched. Is such a horrible representation of women and of what is expecting from them. So sad that our sociaty still consumes these lame and stupid movies.",
            "review_date": "2021-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's an old saying in the movie business cautioning against remaking the classics. That's especially true when a director attempts to follow in the footsteps of a legendary director. It's advice that would have been well heeded with regard to this remake of the 1940 Alfred Hitchcock classic \"Rebecca.\" When a naive lady's traveling companion is swept off her feet by a wealthy English aristocrat in Monte Carlo, she's soon overwhelmed by her new life when she joins him back at home as his new wife, becoming the lady of the house at his sprawling seaside estate, a mansion where the ghost of his deceased first wife allegedly still lives on -- and with whom he is apparently still obsessed. While the film features a superb BAFTA-nominated production design, gorgeous cinematography, and excellent performances by Lily James, Kristen Scott Thomas and Ann Dowd, the suspense factor that made this picture's predecessor a classic is virtually nonexistent here. Instead, this offering tediously rumbles along, tossing out occasional mildly interesting revelations but never reaching out and grabbing viewers in the way that a Hitchcockian-type tale should. The story even becomes somewhat at muddled as it moves toward its conclusion, diluting the impact of whatever modest chills it may have built up along the way. Indeed, this release is, once again, further proof that, when it comes to emulating cinematic icons, it's generally best to leave well enough alone.",
            "review_date": "2021-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very well done film and brilliant portrayal of the book. I cannot fathom why the reviews were so bad that I had to come and add one (first time). Well done to the team that pulled this together!",
            "review_date": "2021-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fails to capture the essence of the story in its entirety ",
            "review_date": "2021-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was Great! They changed a few things. But I think something they change make the story more better!",
            "review_date": "2021-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great performances by Lily James and Kristin Scott Thomas (wonderfully vicious as Mrs. Danvers). However, the editing and script distances the film from the Hitchcock classic.",
            "review_date": "2021-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eh. Don't waste your time—watch the original instead.",
            "review_date": "2021-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "...Did anyone even read the book?",
            "review_date": "2021-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Came for Armie, stayed for the movie. It kept me interested from the very beginning to the end. I really enjoyed some horror to it as well, it keeps you on tippy-toes but just the right intensity so it's not too scary. The plot is unpredictable and the ending is surprising. I enjoyed the classy outfits from the 30s too. Great cast and visuals!",
            "review_date": "2021-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie was pure shit move but Armie Hammer was pleasing to the eye as always so it's ok.",
            "review_date": "2021-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rebecca is a delightful story of love and suspense. Lily James shines as humble girl married with a wealthy widower (excellent Armie Hammer). The \"presence\" of the former wife is felt in the mansion, although the housekeeper (an amazing Kristin Scott-Thomas) is similarly intimidating. So, after the honey moon, lovely Lily James faces a duel with the dead wife and with the housekeeper...that knows secrets of the dead.\n\nEnjoy the suspense, the outstanding performance of beautiful Lily James and an awesome photography. Ben Wheatley has achieved a superb film!!!\n\n\nIf you have listened some comparisons with the older version of Rebecca (directed by Alfred Hitchcock), you should be sure that snobs just dream of a duel between Ben Wheatley (the director of the film) and Hitchcock... So if you want... watch both movies!",
            "review_date": "2021-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed this. I thought the acting was great and the visuals gorgeous.",
            "review_date": "2021-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I highly recommend avoiding this movie at all costs. If I could give 0 stars I would. This is one of the worst movies I ever watched. The movie was all over the place. The only reason why I kept on watching the film was because it seemed like the movie was going to end. This was enough of a horrible film that this is the first time I have logged in to Rotten Tomato in 8 years. The last time was when I was in school.",
            "review_date": "2021-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a sort-of typical romance movie combined with a sort-of thriller/mystery. But, in the end, neither of them were particularly interesting. The movie was just ok.",
            "review_date": "2021-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was so ridiculously bad it took me about 5 hours to watch it because I kept pausing it. Nothing about the script was exciting enough to keep me entertained, the editing was choppy and the music was terrible. Lily James and Kristin Scott Thomas did all the heavy lifting, trying to turn this mess into something that was... somewhat watchable, so I'm giving it two stars.",
            "review_date": "2021-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing cast and cinemtography yet still feels like a neverending disappointment. I would totally blame the story and plot despite the fact that this movie is an adaptation movie. but pass.",
            "review_date": "2020-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is slow and boring.",
            "review_date": "2020-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was left with one question at the end of this movie: how can I get those last two hours of my life back???? Seriously, the worst dribbling, plot-less, aimlessly boring cinema.",
            "review_date": "2020-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had high hopes given the actors and it was certainly watchable, but if you are someone who needs a coherent ending, this is not the movie for you.  The ending just seemed silly and did not quite match the rest of the movie.  But, it was not completely horrible.",
            "review_date": "2020-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite its impressive production values and excellent cast, its tone and style are messy, its plot points and narrative twists, while totally original and unexpected once, now are so overdone that they feel derivative, and it ultimately doesn't live up to the standards of Alfred Hitchcock's Academy Award-winning classic.",
            "review_date": "2020-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As much as I love the actors and actresses in this movie, nothing about it really had me enjoying the film. The clichés were handed out like appetizers and the plot of the film was all over the place. Wasn't a fan.",
            "review_date": "2020-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked the lesbian addition but it wasn't that spectacular otherwise. The original is already solid.",
            "review_date": "2020-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved Daphne du Maurier's book.  Alfred Hitchcock's take on the book did it justice in 1940.  I watch it often and every time discover something I missed from the time before.  So I was eager to see the latest incarnation of \"Rebecca.  Is it worth the time to watch?  I'd say marginally yes.  Does it come up to the original?  Hardly.  There must be new stories to film especially when the old ones have no room for improvement.",
            "review_date": "2020-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Holds itself well on it's own without the expectations of its predecessors placed on it.",
            "review_date": "2020-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful to look at, but a mess plot-wise. This rendition of Rebecca was lukewarm and dull.",
            "review_date": "2020-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I never saw the original movie. I liked the first half of this movie, but the ending fell flat. I wanted more out of this story... lots of potential, but didn’t come through.",
            "review_date": "2020-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw the original many times. A pure classic. Emotional, touching, passionate, convincing and superb acting. This remake is trash in every sense of the word. Appalling acting, unpersuasive, none of the characters evoked sympathy or compassion. The adage if it ain't broke, don't fix it should have been followed here. Awful. Very disappointed.",
            "review_date": "2020-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the fourth version I've seen, and it does not measure up to either the Jeremy Brett/Joanna David miniseries version (with Anna Massey masterful as Danvers) or the version with Diana Rigg (also terrific) as Danvers. I did think Kristin Scott Thomas and/or the writer or director made interesting choices: Danvers isn't a cold and ominous monster at the outset, but these qualities emerge later, with a more subtle creepy buildup. However, as with too many remakes, the makers had a lot more money to throw at it, and the storytelling suffered under the weight of the overproduction. The thudding music was overbearing (I already know how to feel, thank you very much); the swooping camera, the overheated colors, and the over-the-top grandeur of this Manderley kept pulling me out of the story (\"You're impressed, aren't you? Aren't you? Isn't this all blowing your mind?\"). Add to that the ridiculous liberties taken with terrific source material that did NOT need new inventions and twists, and I grew increasingly vexed. My husband, however, loved it. I recommend hunting down the Jeremy Brett version. (The Olivier/Fontaine version is classic, but the Hollywood censoring of the story is regrettable.) It's available on DVD from at least one specialty vendor. Look, too, for the audio book read by Anna Massey. Superb!",
            "review_date": "2020-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's classic. Just like the movie your grandparents loved.",
            "review_date": "2020-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Every turn felt forced.",
            "review_date": "2020-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring as watching beige paint dry. Nothing happens, at all!!!",
            "review_date": "2020-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved the book and the original movie, but I was very disappointed with this one. It had no heart and no suspense.",
            "review_date": "2020-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved it!  All the negative reviews seem to come from those who watched the original, which I haven't.  But I liked that it wasn't predictable.",
            "review_date": "2020-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Holy sh*t! What a ride!!! This genre bending thriller will take you on the wildest roller coaster of your life. The next time someone asks me what my favorite movie is, I'm saying Rebecca. This movie surpassed my every expectation. Here I was, sitting on the couch expecting some lame romance but nope!! I am going to pass this movie down through generations of my family.",
            "review_date": "2020-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Armie hammers accent was horrible. The script is horrendous. The premise is dumb. There are no twists or turns. There is a crazy housekeeper that sets the house on fire in the end and the drowns  herself miraculously without any weights lol. Do not watch this piece of crap",
            "review_date": "2020-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really felt for the main character and cried with her. Due to all the negative reviews I also watched the praised Hitchcock version and expected to like it. But it was horrible. Especially the new Mrs Winter character. Ugh really did not enjoy it at all.",
            "review_date": "2020-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An adequate remake of the original Hitchcock movie of the same name (although the film makers say it's a new adaptation of the novel rather than a remake — I'll let you decide which one it is if that's important to you!). It follows the original novel a bit more closely than Hitchcock's version. Lily James playing the new Mrs de Winter does a good job of playing naiveté but, as the story progresses, her character doesn't really develop far enough. Armie Hammer plays the role of Maxim de Winter stiffly and superficially. Kristin Scott Thomas is the most compelling. She plays Mrs Danvers, the housekeeper, who wants to keep the first Mrs de Winter \"alive\". It's a slow movie with lush cinematography and there are some satisfying twists — especially if you haven't seen the original movie or read the book. Unfortunately, though, this version of the story doesn't bring any innovation to the plot when it needs to and falls a bit flat by the ending. It has the feel of an old-style Hollywood movie but the director seems to want to make a safe movie that will be liked by everyone who watches it. This means it's not really suspenseful enough and loses some of the potency of the original. Unfortunately, the Hitchcock version is not available on streaming services (as far as I can tell). So this one will have to do. Worth watching on a rainy afternoon or while you're in lockdown during a pandemic.",
            "review_date": "2020-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ben Wheatley's new adaptation of the famous novel plays its cards safe, which results in a film that is neither amazing nor terrible, but, for me, definitely boring.  The pacing could have used major improvements and the intrigue failed to captivate my attention, unfortunately.",
            "review_date": "2020-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie was going emotional at the beginning but then in middle it goes so fast that some scenes doesn't make sense so I couldn't catch some part of it quickly specially the part that out of sudden they found Rebecca body! It came out of nowhere",
            "review_date": "2020-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too long of a movie for such short and rushed reveal.... The only thing worth it is the cinematography",
            "review_date": "2020-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A mystery romance on Netflix. Based on the book of the same name by Daphne du Maurier, a young newlywed arrives at her husband's imposing family estate on a windswept English coast and finds herself battling the shadow of his first wife, Rebecca, whose legacy lives on in the house long after her death. Rebecca was one of my favorite mystery novel, and even though I did not remember much of the detail, I still know the major plot points. The book was good because it set up the mystery very well and really hook you in. This made the twist so unexpected and great. With this, I hope that the movie will capture the mystery feeling and the strong effect of Rebecca. However, I felt that the movie did not fully hook me into its plot and the mystery. One of the reasons is that it focused more on the romance aspect. I think that the romance worked because of the great acting from the actors. Also, the cinematography was very well done, especially the mansion and the coast. However, this focus on romance made the plot not as interesting and hooking, leading to the twists being not as impactful as it should. Overall, a decent movie, but did not capture the mystery of the original material. 6.5/10",
            "review_date": "2020-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Producers should have burnt the money instead of spending on this file.",
            "review_date": "2020-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some women are hard to replace.  So this is about a rich widower (Armie Hammer).  He meets a young woman (Lily James) while on vacation, and they quickly hit it off and get hitched.  She comes back to live with him on his expansive estate, but upon arrival, she finds herself living in the shadow of his dead wife, Rebecca.  Now I have never seen the original Alfred Hitchcock movie, but I didn't want that to be the reason to be that I skipped this.  I've seen the majority of his greatest hits, but I managed to miss his only film that won Best Picture.  Unlike most, however, I am not opposed to remaking a movie that is 80 years old.  Nobody talks about Rebecca these days, and as long as you're not doing a shot-for-shot remake a la Gus Van Sant's Psycho, I feel like you can do something with an update.  I obviously can't speak to comparing the two films, but as a standalone movie, I think this does have merit to it.  Now, if you happened to have seen a trailer to this, I can't say that it gives you an accurate depiction of what you are getting.  Netflix is making it seem like it is like the sexy and trashy Fifty Shades of Grey or their series You when in actuality, that is far from the truth.  Sure, attractive people are falling for each other, which is the key to almost every romantic movie ever made, and you are going to get that here as well.  At its core, this is much more of a mystery-drama than anything else.  The production values impressed me right from the start, and I was feeling both the charm and the romance as these two characters are getting together.  The romance is only prevalent in the beginning; for the remainder of the film, that is where the intrigue comes into play.   I enjoyed the genre-bending that they did here, and there was a point where I could easily see this becoming a horror movie; the glances and looks that the staff gives this woman leave options open as the story unravels.  It feels like they primed the film for a Hitchcockian twist, and for a while, I thought I was going to get a progression like Vertigo.  The girl never reveals her first name after all, and the writing is twisty enough that I kept guessing.  I won't spoil if there is or is not a twist, but I was satisfied with the direction they ultimately ended up taking this.  I don't think Rebecca is perfect, and I do have criticisms.  This movie is pushing two hours for its runtime, but I didn't feel like it was too long.  I thought that events move a bit too quickly.  I bet that this could have been very successful as a short miniseries; Netflix recently knocked it out of the park with The Queen's Gambit, and if filmed and divided up in the same way, this could have been just as big of a hit.  I also didn't care for a few of the music choices in this.  Typically I can get with an anachronistic number that doesn't fit the time, but here it drew too much attention to itself for no payoff.  I did ultimately enjoy this, however, and I do give it a moderate recommendation.",
            "review_date": "2020-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First things first, the film is beautiful to look at. It embodies the era it is set in. I enjoyed the performances of the cast and, havn't seen the prior version, enjoyed the story. Although the film itself had pacing issues. A good 30 minutes could have been cut and we still would have had the same end product. It also didn't push its thrills as far as it could. But generally not a bad drama with a plot twist, that wasn't exactly groundbreaking.",
            "review_date": "2020-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rebecca is a Netflix flick of another adaptation of Alfred Hitchcock's 1950 Oscar winning film by the same name staring Armie Hammer as an owner of English manor whose wife named Rebecca had killed herself. Armie meets Lily James and get married and move into the manor.  I thought the movie was going to be ghostly and mysterious but ended up being a mystery murder. The movie was ok nothing special, I wouldn't remember it or want to watch it again.  Other than the beautiful sceneries it was worth watching.",
            "review_date": "2020-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A little bit lack-luster in its plot treatment, but very well shot and designed. Good to have on in the background while chatting with friends. 7/10",
            "review_date": "2020-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The key to a successful twist in a plot is that the characters' actions still have to make sense in retrospect, once the missing information is known. The \"twist\" in Rebecca left me with too many questions unanswered for the story to make psychological sense. Had the ancestral home, the family name and all the other trappings of wealth and privilege come from Rebecca, the continued looming presence of her memory would have been natural. But with Maxim as the master of the house and the heir to the family name, the set up on which the story depends is inexplicable, and the film failed to convince why the balance of power lay where it did. Without that, the plot fails and you're just left with 2 hours of beautiful scenery, photography and clothes.  Except for Kristen Scott Thomas, who is always mesmerizing.",
            "review_date": "2020-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I feel like every single negative review was by someone who never read this book. \n\nIf you've read Rebecca and it's a beloved novel to you, this movie is amazing. A great rendition.",
            "review_date": "2020-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not even a great cast could pull off this terrible plot. Thumbs down 👎🏼 ",
            "review_date": "2020-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Please read the book by Daphne du Maurier or watch the original adaptation by Hitchcock.",
            "review_date": "2020-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent twist on a classic thriller! I am not sure why this doesn't have better reviews but it is well worth your time.",
            "review_date": "2020-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3 out of 5 stars. Rebecca is a fair drama thriller film that is beautiful to look at with the set locations, cinematography, and Ben Wheatly trying to deliver a mystery thriller direction. But it does feel short handed with surprises and twists. Which the film is short on surprises. Which many may not be surprised. The plot follows Lily James character as she runs into Maxim (Armie Hammer) who owns an estate. They both fall for each other. When Lily is being driven away. Maxim proposes to her. Which they get married and she moves into the estate. She soon finds out he is a widow after his former wife was lost at sea. And apparently drowned. When Mrs. Danvers (Kristen Scott Thomas) is rude and unwelcoming to her. She discovers that there is so much more that she does not know. It was a decent plot. Starting out as Lily James is a girl that wants to travel. And takes the companionship as a job to get her to travel. Until she runs into Armie Hammers character which the films direction becomes like a romantic drama film. Except Hammers character has an attitude every time she brings up about his former wife who passed away. Or avoids talking about his past. The plot does change gears in the final half hour when the twist is revealed. And it becomes something more of a serious drama. Which is also where it disappoints with a twist that feels a little short handed. Lily James is lovable as Mrs. de Winters. She is sweet and curious. It is difficult to not like her character. James delivers a great performance. Armie Hammer is good as Maxim. Playing a mysterious character which he is struggling with his past. Kristen Scott Thomas is okay playing Mrs. Danvers. Who looks disgusted every time she sees Mrs. de Winters. Ben Wheatly does deliver a beautiful cinematography and tone with the set locations. And trying to build an eerie bleak mystery. But it lacks momentum or thrills.",
            "review_date": "2020-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed the photography, places and recreation of that period. However, plot is weak and the way it's narrated could be way better.\nThe movie raises too high the expectations and cannot deliver afterwards.",
            "review_date": "2020-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Poor script and the leading actriss is terrible her interpretation.",
            "review_date": "2020-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was excited to see a modern remake of this wonderful book and film.  Sadly, it's rushed, wooden and lacks any emotional impact.  It feels like a Hallmark movie of the week. The brooding atmosphere of the BBC series from the 70s is missing completely.  It all just unfolds with no credibility or believability.  Very disappointing.",
            "review_date": "2020-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have one and only one question; what necessitated a remake of a classic film?  This had to be one of the underwhelming offerings I have seen in years.  I felt no investment with any of the characters.  Suspense was nonexistent.   Armie Hammer's British accent was less than convincing.  The only saving grace was Kristin Scott Thomas as Mrs.Danvers.  Unfortunately the mediocre dialogue failed her in the end.  Do not waste your time.",
            "review_date": "2020-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a disappointment! Wheatley is a promising director but this film is a misstep. Gone are the mystery and depth of the novel, the story drags on and the ending is awful. Except for Kristin Scott Thomas who delivers a spot-on performance, the cast is uninspired, Hammer in particular who lacks the charisma and intensity to play a character like Maxim De Winter.",
            "review_date": "2020-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As soon as the movie gets to the house it loses steam. Costuming, Production design, Cinematography, Ben Wheatley was given time, the backing of Netflix and established previously adapted source material. He was given all the ammunition necessary to make a great film. The fact that he misfires should give Hollywood whose offering him directing roles left and right GREAT PAUSE.",
            "review_date": "2020-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching this film without any knowledge of an Alfred Hitchcock adaptation already existing, I had nothing to compare it to so I enjoyed it very much. Lily James and Armie Hammer are gorgeous on screen together and fit perfectly in the beautiful setting and visually stunning cinematography. The mystery at the center of the plot was intriguing with plenty of Agatha Christie vibes which I'm a huge fan of. I loved the scope of the movie with its grand sets and costumes and big budget feel. It's completely insane that this Rebecca should get negative reviews simply because another one was made last century.",
            "review_date": "2020-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't waste your time - watch the original. This is an utter waste of a talented cast.",
            "review_date": "2020-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sparks never fly and Kristen is one of my favorite actresses but her one note performance here is beneath her. Dreary predictable.",
            "review_date": "2020-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ehh both actors aren't right for the role. Especially Hamer, what an awful accent. Director has no idea what is true gothic horror. If you've never seen this watch Hitchcock's version.",
            "review_date": "2020-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Haven't seen Hitchcock's yet, but this one is pretty bad. It goes slowly, creating a rare relationship between Lilly James and Armie Hammer characters, wich doesn't grow at all. Respect to Kristin Scott Thomas, who is excelent here. Seems like a 5/10.",
            "review_date": "2020-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful adaptation. Scenic views and amazing performances. Esp the leads. The duo shared enthralling chemistry and looked amazing together. I haven't seen Armie Hammer in many roles but he was outstanding as the brooding Maxim and almost equally charming as Laurence if I may say. He's earned a fan in me. Lily and KST were amazing as well. \nIf people could just enjoy it without comparing it to the original. That would be great. An appreciable effort from Ben, he deserves it.",
            "review_date": "2020-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't get the criticism at all. Critics and audience need to take a chill pill. Keep calling this a remake when its a new adaption. They are being extra harsh on this one. A beautiful new adaption. Lily and Armie were extraordinary in it. KST played the part of the sinister housekeeper so well. All the performers were exceptional. A movie I can watch more than once and thats very rare for me. ☆☆☆☆☆",
            "review_date": "2020-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very well done and visually appealing remake of Daphne Du Maurier's Rebecca. Not nearly as chilling and haunting as the original '40s film, but appealing nonetheless. Armie Hammer is a feast for the eyes, although the lead actress Lily James is a bit mediocre. She is adequate but probably miscast. The chemistry between the two is lacking from start to finish. Kristin Scott Thomas is amazing as the wretched capricious housekeeper Mrs. Danvers. However, the power of Rebecca is absent or lost in this remake that misses the mark. There is a scene at the ball where she is dressed as Rebecca that is incomplete and falls flat. The original movie was nominated for 13 Academy Awards and won 4, so it was a tough act to follow. If you didn't know that, and were just looking for something entertaining, with nice scenes of Monte Carlo and Europe and gorgeous mansions, this is definitely worth the time. But it's not bone-chilling like the original.",
            "review_date": "2020-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I generally find the second Mrs De Winter wishy washy and frustratingly dim, but I actually felt for her in this rendition.  Good, would watch again.",
            "review_date": "2020-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have to admit it had to be good to win me over. Rebecca is one of my favourite films of all time but nevertheless was looking forward to a new version. The sets were great and KST was superb as Mrs Danvers but Lily James just never had that mousy inferior feel to her - sorry, but the perfection of Joan Fontaine and those slightly hunched shoulders - and for me Armie Hammer was just not convincing as Maxim. There are so many Daphne Du Maurier books that have never had a decent film why redo Rebecca?",
            "review_date": "2020-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a flat as a pancake.. Having just read the book too I had high expectations and was left bitterly disappointed. \nIt was robbed of the huge dramatic potential and surreal darkneasthe brilliant novel offers. Poor acting and a poor ending.. (different to book.) it actually started quite promising but fell flat as soon as they went to Ma",
            "review_date": "2020-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a lackluster of a film. I was so bored that half way through I turned it off and put on Alfred Hitchcock version to cleanse my palate. Lily James is lovely but boring. Armie is back to I'm going to play bland character days. It was hurtful to watch.",
            "review_date": "2020-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Armie Hammer is terrible. Lily James as usual tries to save the film. I wish she made more interesting choices. But nobody should try and remake a Hitchcock movie. PERIOD.",
            "review_date": "2020-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ooof. I guess lesson is, stick with the OG. Hitchock did a marvelous job for his time. But the story in itself feels outdated and these actors and director bring nothing new to the table.",
            "review_date": "2020-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "HUGELY disappointed. I cannot believe my favorite actress would be in such a silly story. Why are women always portrayed as the victim??? It's exhausting.",
            "review_date": "2020-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Garbage. Terrible dialogue. Terrible acting, terrible directing. Don't bother wasting your time watching this!",
            "review_date": "2020-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't understand all the bad reviews for Rebecca. I loved the new adaptation. I especially loved the costumes and filming locations. Lily James does a wonderful job.",
            "review_date": "2020-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ben Wheatley's \"Rebecca\" is an ambitious, lavish and suspenseful remake that falls short of the high standard set by the Hitchcock classic. With his ninth feature, writer/director Ben Wheatley has crafted a passable remake that offers a fairly uninspired interpretation of the classic novel. It's the filmmaker's first attempt to reinvent a beloved Hitchcock classic on the big-screen, but he pulls it off admirably. Using captivating cinematography, Wheatley draws viewers into the gothic world of a woman haunted by her former mistress. From intimate close-ups to stunning establishing shots, the cinematography keeps viewers immersed in the film's period setting. In terms of acting, the entire ensemble is at the top of its game. Lily James delivers a star-making performance as Mrs. de Winter. With mesmerizing expressions, she conveys the curiosity, innocence and jealousy of the iconic literary character. Armie Hammer is also excellent in the role of a rich aristocrat with a troubled past. While he isn't given much to do, he brings tough sensitivity to the character. Although \"Rebecca\" is undeniably an admirable remake, ultimately it is not a flawless film. Its story is highly formulaic, and follows beat-by-beat the plot of the original. Moreover, it builds to a saccharine conclusion that comes across as misjudged. Nevertheless, fans of the beloved novel will definitely enjoy \"Rebecca\" and so will movie-goers seeking old-fashioned entertainment. At a time when Hollywood seems to be obsessed with remakes of classics, its a cautionary reminder that Hitchcock's masterpieces are meant to be left alone.",
            "review_date": "2020-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Come on, people. This is a great adaptation and very true to the original. Stop with the haters--the sets are gorgeous, the acting is good. Kristen Scott Thomas is perfect as Danvers. The only hanging chad is the incomplete storyline involving the mentally challenged man in the cottage, which gets more play in the Hitchcock version. It is 2020, it is streaming at home....get a glass of wine or a cup of tea and enjoy this gem.",
            "review_date": "2020-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable 1930's escapism with a twist for those who have not read the book or seen prior movies.",
            "review_date": "2020-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Last night I dreamt this movie was a bit better.",
            "review_date": "2020-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a huge Hitchcock fan, the.orognal was one of my favorites and this was such a fantastic remake which I find is try rare. Stunning and captivating.",
            "review_date": "2020-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unnecessary remake (that's the XXXth). Although actings are OK, and photography in color too, it lacks the atmosphere and cinematographic direction of Hitchcock and gets far away from it.",
            "review_date": "2020-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Disappointing. Not like the book at all. ",
            "review_date": "2020-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm clearly the outlier here because I was entranced by Rebecca, a film loaded with the kind of emotional complexity that only Ben Wheatley can deliver. One minute, you love his characters; then you fear for them; then you hate them; then you love them all over again. Such is the case for the players in Rebecca, all of whom will shift your loyalty and sympathy from scene to scene. \n\nI was gripped by Lily James' performance, as well as Kristin Scott Thomas' turn as the cold Mrs. Danvers, a new touchstone for the \"hell hath no fury\" -type of arthouse woman. \n\nGorgeous imagery, opulent set design, and of the course the gripping central mystery of who Rebecca is, are all so wonderfully entangled here. \n\nI've never seen Hitch's original, and I don't want to pretend I'll rush to change that. I want my experience with Wheatley's Rebecca to linger a little longer.",
            "review_date": "2020-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good start, awful ending... Cero character development",
            "review_date": "2020-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stop remaking classic films unless something can actually be readily improved upon, updated, or made with a novel, distinct artistic vision. This 2020 remake of the Hitchcock classic adds little of substance and never nails the oppressive atmosphere of its predecessor; the original was about an open secret with mortal consequences, in which the individual with the most to lose seems to be left in the dark, but this doesn't convey the same tautness, despite going through the motions. James and Hammer seem capable, and Thomas, while certainly a strong actress who demonstrates an understanding of the Mrs. Danvers character (feeling less like the off-kilter obsessive, and more like a more verbose, generically creepy Lurch from the Addams Family), seems to exist in the shadow of Judith Anderson. That weirdly upbeat ending didn't help the final product. The film is more or less fine, but joins a long tradition of relatively mediocre Hitchcock remakes; the small screen has seen better results in recent years. (2/5)",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spellbinding, entertaining and forms sustained mystique of who the titular character is and the truth behind her, but its finale fizzled out somewhat and doesn't entirely fulfill.",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why would they hire such good actors for such a crappy movie?",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ministry without rhythm, the film stops being interesting in the middle of the film, stupid characters and without logic, good script even surprised me.",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible remake. Lily James and Arnie Hammer are lifeless and bring now real charisma to the characters. Rebecca is based on a beautiful gothic novel and the Hitchhock film version was excellent. This film was just bad. Lily James played the character kinda is smug and goes through the motions. Arnie reads the most important line in the book without any real thought. He is no Lawerence Olivia. I had high hopes as a fan of the novel and original film. This is just bad. Also the ending with the court hearing was changed from the novel and just didn't work at all.",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Remakes typically stand out (for good or bad) when they do something dramatically different from the original. Ben Wheatley's update of 'Rebecca' shockingly doesn't do much of anything different  and so even though it looks great and is well-acted I couldn't help but think I'd rather just watch Hitchcock's classic version again instead.",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It wasn't so bad especially since I haven't seen the original movie yet. I just noticed that there's lack of chemistry between Lily James and Armie Hammer. Kristin Scott Thomas was the brightest light acting-wise. I won't watch it again but I don't think I'll regret watching it too.",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a boring film. The run time felt like 9hours.",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They had a great story and they kill it. No matter the agreeable visuals. Mrs de Winter goes from being a charming lovely young girl with her own interests and natural curiosity to being a mousy girl without character in minute 30 and to end up like a passionate clever detective in minute 90....all of this with not proper character development whatsoever. The dialogues are so flat and when there was a chance of revealing the core of the stories' conflict- take the ball for example- the agony of the new Mrs. de Winter in the face of otherworldly nature of Rebecca's presence, they reduce the sequence to a series of snapshots and lighting games that say little about what would be the feelings of shame, inadequacy, abandonment and resentment of the poor orphan that was the new Mrs. de Winter at heart. And this is just to speak about the female protagonist. Mr. de Winter was not even there, he has nothing for himself. I bet the book is good because it is an interesting story, one can see it has some substance and can raise issues of class, gender, sexuality, marriage, attachment, loss, but they did not do Rebecca at all. It is a pity such a bad storytelling and such a bad acting",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When I saw this had 45% on both critics and public I had reason to worry, but I can safely say that it was not justified. This is a solid movie, with gripping thriller/mystery plot, good actors and satisfying. I haven't read the source material so I can't comment on how good of an adaptation it is, but as a standalone film, this is a very definite 8+/10 in my books.",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was very skeptical of this movie. I'm a huge fan of the original, but darn this was a delight. It was so creepy and the lead actress is not phenomenal. It really brings modern gender issues, sexuality themes, masculinity questions, class norms... I can't begin to cover it all. The cinematography is really the highlight. It's just lush and spectacular. Honestly, so worth it.",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had great expectations because I like Lily James even if I thought she was too pretty for the role of a common, poor, modest girl.  And I was right.  Mister de Winter was supposed to be quite a few years older than the second wife - who has no name in the book or in the movie -  but they seem the same age.  Not good.  The girl is supposed to be intimidated by his age too. The the entire story left me cold.  One good thing is that the story is close to the one in the book with little differences, but the atmosphere of the mansion is pretty flat.  I don't know how someone who didn't read the book and didn't see the first adaptation, the Hitchcock one, would feel about this movie, but for me this one didn't do anything.  It's a waste, really. But as I said, if you didn't see the Hitchcock version of 1940 and didn't read the book maybe you would appreciate more this new movie.  Try and see.",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's becoming quite impressive how often Ben Wheatley is willing to challenge himself in different genres and styles and his remake of Alfred Hitchcock's Rebecca is another example of his bravery. That said, for as good as this film looks (and it does look very good indeed due to sumptuous production design) it's essentially very hollow underneath. I'm a huge admirer of Wheatley's and for two thirds of this film he delivers some impressive work but it falls apart when it matters most and ultimately leaves you feeling like it was a vacuous waste of time.",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Genneric. Tries to be everything and ends being just another Netflix movie.",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really fun, there were a few holes in the plot but a good thriller without all the sleaze thrown in.",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is literally no story line. All that happens is the lead femal being verbally and emotionally abused. We do not need movies like this. Absolute shit",
            "review_date": "2020-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, will not change the game, but I think 'Rebecca' have a certain charm and sometimes deliver a good suspense too. Lilly James and Kristin Scott Thomas deliver good performances that keep your attention in the narrative. I think the third act could be better, but the illusion that the director Ben Wheatley provide in the first act and the psycologic suspense of the second make this adaptation worthy to watch.",
            "review_date": "2020-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This new adaptation lacks the essence and tone of its source material or the 1940's Hitchcock version. Its pleasing to the eye with its bright costumes, elaborate sets and colourful cinematography but is otherwise dull and irrelevant. The movie is miscast and fails to generate the same level of mystery, dread and suspense as the Gothic novel or the Hitchcock classic. The changes it made were unnecessary and although the film is an entertaining way to pass time, it is in no way a good adaptation of the novel nor does it surpass the 1940's Oscar-winning classic.",
            "review_date": "2020-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A slog to get through. Acting is dull and wooden. The plot conveniently places people where they need to be without any reasoning. Uninspired directing.",
            "review_date": "2020-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly pointless remake. This lame film shows what a difference a master filmmaker can do (Hitchcock) with the original and its thematically related film \"Vertigo\". Waste of the big budget that could of been spent on other worthy projects.",
            "review_date": "2020-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really liked the film. The settings are beautiful and the house is another protagonist in this drama. The acting is also very good. Don't miss it!",
            "review_date": "2020-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a terrible movie... Pleasing to the eye but nothing else.",
            "review_date": "2020-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wooden acting by the male lead, a female lead who was just too worldly wise. Absolutely no chemistry between them. Scott Thomas puts in a serviceable turn as Mrs Danvers but not enough to elevate the movie above the mundane. Rough editing and no atmosphere in or around the house itself (I think several locations were used for Manderley). The choice of music was frankly bizarre and jarring, and the final frame at the end a pathetic example of a director trying to be clever. Rotten.",
            "review_date": "2020-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Miscast and tedious.",
            "review_date": "2020-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a complete abortion. The actors were  atrocious with the exception of the butler, the maid and the doctor. Daphne Du Maurier would be horrified!",
            "review_date": "2020-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Armie Hammer did not disappoint however the movie overall was quite disappointing.  The supporting cast was excellent and although I am not a fan of Ms Thomas, she was in fact the best of the best in this particular movie. Lily James' performance was boring and amateurish.  And was there a director? It just didn't flow and really it was just a disaster.  Too bad cause I loved the novel and the version from the 40s/ But this was just boring and disappointing/",
            "review_date": "2020-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In spite of gorgeous setting, pretty clothes and famous cast, a sad disappointment.  Of course, kudos to Armie Hammer, Lily James and Kristen Scott Thomas for even daring to fill the shoes of the original actors. Rent the Hitchcock and skip this.",
            "review_date": "2020-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't expect it to be that good. I mean when I watches the trailer which had me interested in so I watched it.  The movie let me hold my breath few times and I wanted to know more about the mystery...l loved it.",
            "review_date": "2020-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "gosh; i'm not sure what it was, but i didn't really like this one... it was interesting at the start but the only interesting thing after was just the mystery of Rebecca. there's a slight twist at the end, which is welcomed but i'm not sure it was done well - is it just him?? i couldn't tell. i thought Lily did a great job, but whoever played Maxy boy just wasn't all that dynamic at all. i thought his performance was dry. which didn't help. all-in-all the movie's not terrible, but i don't think i'd recommend it.",
            "review_date": "2020-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good adaptation.. fresh look at a old tale. Maxim's character needed to be more fleshed out to bring out the emotional abuse he endured, enough to drive him to commit murder. not sure if that comes out as intensely as it should have. all actors great in this",
            "review_date": "2020-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was truly terrible, the movie went on for too long and it progressively got worse towards the end.",
            "review_date": "2020-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So boring.  The whole movie was obnoxious.",
            "review_date": "2020-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well done, well made, well worth it!\n-Yet what one has to wonder is how necessary was it, really.\n-Let's watch the original B&W film next?",
            "review_date": "2020-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pros:\n\nI enjoyed the thrill aspects of the film – especially the 2nd half of the film\n\nI thought Armie Hammer and Lily James gave condemnable roles each – special shoutout to Keeley Hawes who I thought stole the show every time she was on screen.\n\nI appreciated the plot and its original source material\n\nCons:\n\nI felt the first half of the film was slightly forgettable\n\nI did feel the film could've maybe gone slightly more into the heart of the source material\n\nOverall, I thought ‘Rebecca' was a good watch and certainly something to fill the time. While I wasn't blown away by the film, I thought there were aspects that made it shine. Performances were good and the plot twists towards the final act were enjoyable. Although, I can't help but feel this film will not stay with me for very long. There is an original film from 1940 I have yet to see, which I will check out and compare. But this version of ‘Rebecca' was just ok for me.\n\nQuote – \"I don't believe in ghosts\" – Mrs. de Winter\n\nRating – 2/5",
            "review_date": "2020-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was aesthetically pleasing but the story was boring. The trailer made me believe this would be somewhat a scary or thriller type movie but I found it just boring..",
            "review_date": "2020-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only reason to wade through this frightening mess is to watch Lily James and Kristin Scott Thomas demonstrate their acting prowess--still, I'd advise against it.",
            "review_date": "2020-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved the movie.  While Armie is not Sir Lawrence Olivier, I felt that he gave a much more realistic Max.  However, I do not think that Armie is quite old enough for the role.  I always felt that Joan Fontaine was too old to play the main character, at least with Lily James - she has that young, wide-eyed, innocence that the role requires.  I love how she grows into the role of the 2nd Mrs. DeWinter.",
            "review_date": "2020-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I expected something different",
            "review_date": "2020-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the Alfred Hitchcock version but I also absolutely love this 2020 version.  I enjoyed the subtle changes instead of feeling like  I was watching a direct replica. I love the little epilogue section at the end although short to bring us up to date after the climactic previous ending.",
            "review_date": "2020-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved it!!! And I read the book twice and also adore the Hitchcock classic. However, I always found Olivier unconvincing in that particular role. The new version is a suitable update for modern times and a young audience, who may never have heard of the book or the classic movie which may well be too inaccessible. Also, the supporting actors are fabulous - Sam Riley makes a wonderful Favell, ditto for the sister and Mrs Van\nHopper. Kristin Scott Thomas as Danvers is great as usual, Armie Hammer looks and acts the part, so does Lily James, Manderley is fabulous and the costume design splendid. Sometimes a classic has had its day and needs some dusting off!",
            "review_date": "2020-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Many reviews I have seen say that this new version cannot measure up to the old Rebecca. How appropriate, then, for a movie about constantly being compared to the \"original\".\n\nI am biased because I have never seen Hitchcock's Rebecca, nor have I read the book, but I will do both because I have seen this movie. It's a well-made film, the acting is good, Kristen Scott Thomas steals the show, and it's an entertaining way to kill two hours. It's not life-changing or anything, but it was enjoyable.",
            "review_date": "2020-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting in this movie was great, however, the script and the plot were so sexist that it best be left in the past. Maxim de Winter emotionally abuses Mrs. de Winter by constantly blowing up at her fairly often when she has done absolutely nothing to offend him, and Mrs. de Winter just takes it, and beats herself up over it. At some point in the movie Maxim de Winter accuses his late wife, Rebecca, of cheating and possibly being pregnant with another man's child, but it is discovered that she was actually dying of cancer. Not only that, but Mrs. de Winter works to defend Maxim and stays with him even after discovering that he murdered his first wife, Rebecca, while she was dying of cancer! Horrible lesson to teach young women. I know it's a remake of a classic, but a classic that should be left in the past!",
            "review_date": "2020-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At first it was a bit slow at the beginning but after finishing the movie i realized that the first part was needed to build up for us to understand the characters. Loved the cast, love the setting and absolutely loved the suspense of it! It is a great movie for this generation and  I absolutely recommend it!.",
            "review_date": "2020-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is so terrible but lily james is amazing",
            "review_date": "2020-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie gripped me from beginning to end. I couldn't look away, and I didn't see anything coming. You think you know what the movie is about, then there is a twist, and the whole thing takes a left turn you didn't see coming. I read the movie is very close to the book except the ending, which the movie tweaks. I honestly could care less for the novel. I thought the movie was great. Another thing to note is how good the acting was. I could feel the young Mrs. De Winter's anxiety and her insecurities every step of the way. Honestly, the whole movie has an anxious tone to it, because you care about the characters and you feel for them. Very well done.",
            "review_date": "2020-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A simple and dull melodrama. We miss Hitchcock.",
            "review_date": "2020-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I adored this movie so much. Lily James and Armie Hammer's chemistry was the most exciting part for me. They were absolutely gorgeous together. I had some doubts about Armie's english accent but he kinda nailed it so kudos to him.\nKristin Scott Thomas was amazing as well, how she carried herself throughout the entire movie. I loved her. \nKeeley Hawes, Sam Riley and Ann Dowd were awesome as supporting actors. \nIs been a while since I've enjoyed a movie this much. Great visuals, stellar cast and beautiful music. Like everything was perfect. Ben Wheatley did a brilliant effort in bringing *Daphne du Maurier's* \"Rebecca\" to life. \nPS. I have seen the hitchcock version and I am a fan. Honestly you can enjoy both versions without tearing apart this newer version which is happening these days. This is an adaption and not a remake and people should take this as one.",
            "review_date": "2020-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why remake a Hitchcock movie? What a dumb idea. Terrible acting and rhythm, cinematography doesn't compare and they could have shot the movie at a different house, its like every movie is shot at that same house now... a waste of time.",
            "review_date": "2020-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kristin Scott Thomas is excellent as the flawed Mrs Danvers and the script puts a spin on her relationship with Rebecca.",
            "review_date": "2020-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie may be fine for those unfamiliar with the source material, but for lovers of the book or the previous movie adaptation, this adaptation is not worth your time. It has the bones of the story without any of its soul. If it were merely an issue of comparison, that'd be one thing, but the the screenwriters and filmmaker have so clearly missed the mark when interpreting this story I wonder if they even read the book or merely just browsed the wikipedia entry. This movie had so much potential, a new adaptation was not without merit given the constrictions of the Hays Codes when Hitchcock was making his version, or the modern political arguments happening right now around the Me Too movement and privilege, but this adaptation does nothing with its freedom or modern context except to change back the ending, which honestly, doesn't fit the love story they were apparently trying to make.",
            "review_date": "2020-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sad, badly done adaptation with the only interesting part of it to be in recent headlines. Skip this and watch Hitchcock's version instead.",
            "review_date": "2020-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mrs de Winter meets her husband on the French coast while working as a companion for brash loud American Mrs Van Hopper.   The two fall in love despite Maxim de Winter's life still being clouded in grief from the death of his wife a year earlier.   They soon return to Maxim's estate, Manderlay where Rebecca's presence still seems to have a strange hold on the staff, visitors to the estate and especially her husband.\nI would never had said I am a fan of the work of Daphne du Maurier but this is the second adaptation I have seen of her work that has had me completely gripped, the first being My Cousin Rachel.  It begins with romance across the classes but at it's heart is a mystery, the mystery being the circumstances around Rebecca's death and why she still, even in death seems to have such a strong hold over the lives she touched.  The costumes and settings are spot on and are all perfectly set for the setting of the story.  I thought the players were well cast but non more so than Kristen Scott Thomas who steals every scene she is in as the creepy and domineering Mrs Danvers.  I can't make any comparisons with the course material because I have never read it but as a period drama / mystery / thriller it worked very well and was very enjoyable.",
            "review_date": "2020-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was frustrating to watch. I actually have no words. Lily James character she plays is so weak and it seems like she is constantly in a state of fear and can't even hold herself up, all her movements were over exaggerated. She had no reason for being alive other than living for her boring ass husband and sucking his face!!!!!!!! I haven't felt this annoyed while watching a movie for some time. Nothing made sense, the other shoe doesn't drop at the end, there is no twist. You have been warned.",
            "review_date": "2020-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Except the anti-climatic third act, story is okay and actors did their best (even though it will be hard not to compare them with the actors in Hitchcock version). In terms of production design and cinematography, it is one of the best movies I've seen this year. If you were a fan of gothic romance, give it a try.",
            "review_date": "2020-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved the movie! Armie was perfect as Maxim ♥️",
            "review_date": "2020-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Huge disappointment considering Wheatley and Goldman's involvement. Uneven direction and crude female empowerment of the heroine can never be rescued by the great locations and wardrobe. Both Hammer and James fail to convince while Kristen veers into pantomime.",
            "review_date": "2020-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can get over costumes that look like they are from Zara for a movie set in 1930,i also can get over spitting all over the source material. But I can't get over how they changed the character if I. The story is about her growth and development but here she already starts out as outspoken and self-confident. The whole conflict with Danvers and Rebecca does not persuade.",
            "review_date": "2020-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What bothered me most about this adaptation was its handling of Maxim and the second Mrs. de Winter's relationship. Throughout most of the book, Maxim is reserved and standoffish toward the second Mrs. de Winter. Although he could be witty and playful, there was always a solid barrier between them. That's what made the scene where Maxim finally confesses what happened to Rebecca so potent. Finally, they (Maxim and the second Mrs de Winter) are able to be intimate because Maxim has let down his barrier. \nIn this movie, they are all over each other from the outset. There are a few moments of emotional distance between them, but the constant physical contact between them took away from the tension, loneliness and doubt that was so apparent in the book. And the ending - don't even get me started! That was so, so cheesy.",
            "review_date": "2020-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm unsure why people dislike this version other than people just disliking remakes of old beloved material. It was visually stunning, the characters were well played, and the storyline interesting as always. Some people just don't like to see old things made new. I think it did a great job of bringing this material to a new, modern audience.",
            "review_date": "2020-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most reviewers seem to be comparing it to the Hitchcock film and expecting some dramatic reinvention. If you're willing to abandon that, or have never seen the original, it's a fine and enjoyable movie.",
            "review_date": "2020-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ABSOLUTELY LOVED IT!!! A wonderful adaptation with brilliantly cast archetypes of womens power, the men paled by comparison which was a welcome contrast between 1940 and 2020 direction as well as a spotlight on how well Du Maurier channeled timeless female strengths 80 years ago!\n\nFor me the garish yellow suits the alfa males cowardice; fear of living alone, of betrayal and of losing face. This actor was very close to the Maxim in my mind, conjured and refined from re-reading the book a thousand times; handsome, commanding, hotheaded yet weak in character... defined by priviladge not achievement... a shell. We are not meant to fall in love with Maxim,  he is an object of pity; a male in distress. It is Du Maurier's  simpering, unnamed heroine who defeats her dragon, embraces her dead rival and embodies all women to rescue her man for better or worse and live on... \n\nThe book strikes a chord with women and this film highlights and celebrates girl power where Hitchcock placed artful, broody shadows, perhaps to keep the book within his social lens and time. Nothing can touch the original masterpiece however this film, in many ways, is faithful Du Mauriers cunning flip of stereotypes.\n\nMost critics are comparing the film to Hitchcock's vision not Du Maurier's book and for that very reason have missed the magic.",
            "review_date": "2020-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lily James is perfect as the insecure bewildered bride who grows through the course of the story. Kristen Scott Thomas was delightfully creepy as the obsessed housekeeper Mrs. Danvers. Armie Hammer was swoon worthy as Maxim de Winter and you can understand why a lonely middle class girl would marry him after a very short acquaintance. He played a very difficult character in a appealing way.",
            "review_date": "2020-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved the movie! Great watch & Becoming",
            "review_date": "2020-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's simply no comparison with the Hitchcock classic. Maybe if I hadn't seen it I would have enjoyed this new take more but the leads are so bland and the film left me unmoved.",
            "review_date": "2020-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really enjoyed watching this.",
            "review_date": "2020-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's a great story. ok maybe not a perfect film, but some great moments. and it's a great story",
            "review_date": "2020-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rating: C\n\n\"All in all, Netflix's version of Rebecca gets lost in trying to balance so many genres in just one film. Ben Wheatley does a great job controlling the pacing, offering enough time to develop the main characters and the core relationship. However, the tone changes are far from being well-executed, leading to an utterly absurd, rushed, convoluted last act out of nowhere that raises logical questions and leaves the viewer with a false sense of uncertainty. A well-structured, entertaining first half partially compensates for the weirdness that overflows the second part. Lily James and Armie Hammer deliver great performances, as does Kristin Scott Thomas, but the production design (supported by terrific costumes) steals the spotlight. Clint Mansell's score doesn't go unnoticed, but its placement is exceptionally inefficient. In the end, the attempt at creating a horror atmosphere with the \"haunted\" mansion storyline is so anti-climactic that I can't wholeheartedly recommend this flick…\"",
            "review_date": "2020-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rebeca is a film that shouldn't be compare with another adaptations. It is an fresh and bright vision of the book; Lily James gives the best performance of her career, Armie Hammer doesn't shine how he deserves (a script problem); also, the tension and the dosis of terror works perfectly.",
            "review_date": "2020-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A shy ladies companion meets a strikingly handsome gentleman who turns out to be riddled with grief. They quickly become infatuated with each others company and love begins to bloom. \nShe is inexperienced and looking for adventure and he hasn't laughed with anyone since his wife passed. \nThe old fashioned tone is splendid as is the setting. Full of sunshine and romance. \nHave they found their perfect fairytale? Seems so.\nUntil suspicious questions go unanswered, secrets build high walls before they come tumbling down. \nThe house - Manderley - has many corridors with many rooms. Almost impossible to know what lies beyond every door. The housekeeper adds to the strict, proper environment. \nA dark shadow looms over Manderley in the form of Rebecca's ghost. \nIt is so enriched with drama it's intoxicating. Perfect for a quiet night in or during a rainy day.",
            "review_date": "2020-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bad acting and not credible situations. Good idea to start with but the movie is not convincing.",
            "review_date": "2020-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Rebecca ' is a stylish but flawed remake of a masterful psychological thriller.",
            "review_date": "2020-10-21",
            "source": "rt",
            "lang": "en"
        }
    ]
}