{
    "rating": 9.0,
    "release_date": "2020-11-20",
    "num_reviews": 494,
    "genres": [
        "Drama"
    ],
    "summary": "During a series of adrenaline-fueled one-night gigs, itinerant punk-metal drummer Ruben (Riz Ahmed) begins to experience intermittent hearing loss. When a specialist tells him his condition will rapidly worsen, he thinks his music career — and with it his life — is over. His bandmate and girlfriend Lou (Olivia Cooke) checks the recovering heroin addict into a secluded sober house for the deaf in hopes it will prevent a relapse and help him learn to adapt to his new situation. But after being welcomed into a community that accepts him just as he is, Ruben has to choose between his equilibrium and the drive to reclaim the life he once knew. Utilizing startling, innovative sound design techniques, director Darius Marder takes audiences inside Ruben’s experience to vividly recreate his journey into a rarely examined world.",
    "reviews": [
        {
            "content": "Phenomenal. Acting is so well done. I was shocked. The thing that knocks down the rating is the pacing of the movie I thought was kind of slow at some points and I was just ready for that scene to be over. Also, the ending was nice but I wish we got more closure. It felt very abrupt.",
            "review_date": "2023-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the finest films I have seen in years.",
            "review_date": "2023-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everything was just damn near perfection",
            "review_date": "2023-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stunning achievement. Hard-hitting and emotional.",
            "review_date": "2023-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Going deaf, accepting oneself, and pain. Strong concepts tackled in this work. Riz Ahmed is fantastic as always. It's a movie I had to sit on emotionally. Lots to process with the pain of loss, change, and accepting oneself completely.",
            "review_date": "2023-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such an enjoyable film experience. I loved the way the audio reflected Ruben's own hearing experiences. Beautifully shot, beautifully acted.",
            "review_date": "2023-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed's performance is seared onto my brain if we're honest.",
            "review_date": "2023-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Learning to be deaf must not be an easy task. Great concept! A movie almost completely silent, which I found interesting because you seem to see everything from a different perspective. As someone who plays a lot of instruments, I can't imagine how hard it would be if I had to live this.  Another thing that I'd like to add is that for some reason this movie kinda felt like a documentary to me, but it's not a bad thing, I liked it, but I do feel like this would have been better as a tv show.",
            "review_date": "2023-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film ditches it's nonsensical premise pretty early on to give us a glimpse into the world of deaf humans and their defiant plight for acceptance. I can appreciate and accept those messages, but the film shoves narrative and character beats aside in order to make its point.\n\nI'm unsure what Sound of Metal was attempting to be, but by the end scene I felt it was a cruel and unjust movie that had so little empathy and love for its main character that I came out of it slightly repulsed, and a bit more than mildly angered.",
            "review_date": "2023-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "God this movie is so good, there's no other way to decribe it except that.",
            "review_date": "2023-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a powerful movie. Rij Ahmed should have won the Oscar for this Roel, BECAUSE he was incredible. The supporting cast is really great, but the sound design and mixing, WOW, as well as the editing in this movie, literally perfection. The screenplay is great and that ending is just so powerful, loved it a lot!",
            "review_date": "2023-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The concept of the movie is really good, they do a great job of making you feel like you can't hear and building the suspense.",
            "review_date": "2023-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "he's great. the main part of his story is awesome. the beginning and last 20 mins are total shite",
            "review_date": "2022-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best editing ever done in a movie! With the best sound mixing ever done in a movie! And the best sound editing ever done in a movie!",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great concept, good character arc, worth it.",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a fellow drummer, this movie kinda hits home.",
            "review_date": "2022-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As humans we all face disabilities of some kind: this film chose the deaf community. Riz Ahmed was absolutely superlative and deserved the award for Best Actor: the depth of the story he told through his amazing eyes was hypnotic. Paul Raci was perfect in his supporting role as a diamond in the rough. The sound (or lack of it) was astounding in ITS role and the film editing was flawless.  Kudos to the entire cast and crew for taking us on an this amazing, beautiful journey!  It was hands-down the Best Picture not only of 2019, but also be one of the best \npictures so far this century!",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"| Ratings Categories |\n{Characters (9/10) ; Cinematography (9.5/10) ; Plot (10/10) ; Acting (9.5/10) ; Pacing (8.5/10) = 93%}\"",
            "review_date": "2022-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sound of metal:\n8 / 10",
            "review_date": "2022-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slightly surprised at how positive reviews as for me it was film to be admired rather more than enjoyed. The tone throughout is unremittingly sombre and l would have appreciated a little more light and shade. Real art house flick for those if that persuasion.",
            "review_date": "2022-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Original ideas, well acted. Didn't quite have the perfect story arc to make me want to watch again or recommend",
            "review_date": "2022-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another film in competition for the Oscars 2021 with a great theme, but rather poorly realized, by an author completely unknown to me, Darius Marder.\n\nFirst of all, let's clear up a few untruths that are presented in the movie, namely, most medical insurances, even in the US, cover operations in cases of hearing loss. Then, the implant placement operation is always performed first on one side, never on both at the same time. And most importantly, couples in such situations are most often encouraged to go through together e.g. learning sign language, and not being forbidden to do so for some mysterious reason.\n\nOn the other hand, criticism of the plot, according to which it is illogical for the main actor Riz Ahmed to continue making noise immediately after receiving the diagnosis (a couple of months of rehearsal is not enough to call even the most talented actors drummers), really doesn't stand, because it is natural for each of us, and especially the character as presented in the film, to need time to accept and face the new facts in our lives. It is these moments that are, in my humble opinion, the greatest value of the story. Unfortunately, the film did not go any further than that, and that is also the biggest complaint, because it has obviously long ago become a trend to shoot stories without any messages and conclusions.\n\nThe biggest praise goes for the supporting female role of Olivia Cooke, who, in addition to inspiring acting, allegedly performed all the music scenes live on her own.\n\nIn any case, the film deserves a passing grade, unlike some other nominated works, which did not manage to come up with the topics they set out to do. Sometimes it is better no ending at all, than one indulging in the mere commercial taste of the audience, with an extremely illogical plot and maximally stereotypical male characters, using \"subverted expectations\", as in the so-called revenge-feminist \"Promising Young Woman\", which is also in competition. We will see who will do better at the awards ceremony in April.",
            "review_date": "2022-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1ya- Between an impassioned, frustrated performance from Riz Ahmed and experimental, suffocating sound design and mixing, the film fires on all cylinders as it examines the unexpectedness of change.",
            "review_date": "2022-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was nominated for best picture for a reason. Its much more than a story about a metal drummer who loses his hearing - its about a change in perspective and coming to terms with who they are. That deafness is not something to \"fix\" but to accept as so many are proud of their non-hearing and their community. Also its a great look into the community and how the deaf community live their every day lives from an outsiders perspective. \n\nAlso incredible sound design and acting to let us walk around in the shoes of those who struggle or is newly struggling with the inability to hear.",
            "review_date": "2022-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved Riz Ahmed's performance, and enjoyed the whole concept of calmness and silence and viewing things from such a perpsective.",
            "review_date": "2022-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At times I forgot it wasn't a documentary.",
            "review_date": "2022-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bow down to Riz. He delivers every emotion, like a punch in the bones. Every other aspect of the movie was also well executed.",
            "review_date": "2022-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movies about losing one of the key senses related to the art form intrigue me. Most commonly, from \"City Lights\" (1931) to \"Bird Box\" (2018) or \"The Invisible Man\" (1933 and 2020, among other adaptations), it seems at least, that sense is sight, as motion pictures are primarily a visual medium, but they've hardly ever been entirely silent--not even silent films were silent, accompanied as they tended and tend to be by musical accompaniment and occasional sound effects or live narration. I've been tagging such use of \"sight-analogy\" on Letterboxd, it's such a frequent reflexive device. All the better, then, when art is featured in the picture. In the case of \"Sound of Metal,\" the art is heavy metal music (hence the title, which also takes on something of a double meaning when the protagonist later drums with his palms on a metal slide in a key scene that a deaf child feels, or listens, to). Similarly, this music is not entirely audial, as there is an unmistakable look to the rock scene. Shown stereotypical pictures of how one dresses--what sort of tattoos or blonde highlights, e.g.--one might do well at guessing what sort of music they prefer. Nevertheless, \"Sound of Metal\" is about a drummer who loses his hearing and at least partly because of playing music. The consequence of which is to focus one's senses on the distinctive qualities of the art, whether music or, by extension, cinema.\n\nIt helps that it's well acted, led by a standout performance from Riz Ahmed and a good supporting cast headed by Olivia Cooke, and well dramatized--even the drug addiction and scratching works--which makes for a nice conflation that the movie isn't just about what's important to art but also what's important in life--there being considerable crossover of both. If this doesn't get an acting Oscar nomination, it better at least get something for the sound. Few films feature such an acoustic focal point. \"The Conversation\" (1974) is an obvious exception, but not to compare this to what's probably the greatest exploration of sound design in film history, it should be indication enough of how good \"Sound of Metal\" is that the comparison even comes to mind. Featuring deaf characters, including some real-life deaf actors, draws attention to the picture's sound design, as well as to the image when the picture becomes silent as well. In general, I especially appreciate the shifts here between subjective and objective camera positions and the accompanying varying degrees of silence and sound and of seeing. The last silent scene is perfect. I don't think a better ending could've been made.",
            "review_date": "2022-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Learning to be deaf.  Not an easy task.  What happens when a heavy metal drummer loses his hearing?  Too many things to enumerate.  Especially when that same drummer is a recovering addict.  The choice comes to Ruben the drummer - will he recover his hearing through surgery, or will he accept a new reality as a deaf person living in a deaf community?",
            "review_date": "2022-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "too long, not enough substance.  When a friend handed me the movie and told me about it, it sounded interesting enough to watch but the acting was subpar and the character just suddenly went deaf without much discussion. The movie left me with a lot of questions about deafness",
            "review_date": "2022-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The sound for everyone is everything and this movie took a picture of several scenarios eventhough who is suffering is a boy just and adult. Good one!!",
            "review_date": "2022-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Between Riz Ahmed's mesmerizing, star-heightening performance and Darius Marder's feature directorial debut presenting first narrative impression, this film intimately sympathizes the emotional struggles but also exceptionally empathizes the accepted values of the uncommonly tackled deaf community in its truest, realistic insight. (B+)",
            "review_date": "2022-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not sure how I was supposed to feel at the end. There's some disappointment in turning his back on his community, but it's clear all along where his heart is.",
            "review_date": "2022-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In an outstanding performance well worthy of his Oscar nomination, Riz Ahmed captures the struggles and various stages of grief surrounding an incident that drastically changes his life as he's put through the ringer as a character that has to deal with sudden hearing loss. Olivia Cooke and Paul Raci are both great as supporting actors. However, it's not just the performances that are praise-worthy, but the directing and especially the sound design. It's not only beautifully shot, but the way sound is used is jaw-dropping and well-thought out, making for an incredibly immersive experience where all the stops have been pulled out in order to really mimic what it would be like to lose your hearing. The effectiveness of the sound design is a huge part of what makes this film such a visceral and somewhat rough watch, but it feels real and raw, and that's what makes it so great.",
            "review_date": "2022-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this movie around the beginning of this year and forget to give it a review. This movie was so well done with the performances and sound editing/mixing. The story is very scary but real at the same time.",
            "review_date": "2021-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Would have been better as a tv show. The second half was rushed.",
            "review_date": "2021-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fascinating journey as the main character  comes to terms with his loss of hearing and gains insight into an alternative way of viewing the world.",
            "review_date": "2021-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A realistic drama film about accepting deafness and drug addiction. Sound editing and the acting of Riz Ahmed (as Ruben) and Paul Raci (as Joe) is remarkable. The film’s title could also be a innuendo to the distorted sound from cochlear implant that led Ruben to accept deafness instead of fixing it.",
            "review_date": "2021-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While there haven't been many (and I still have a few more to view), Sound of Metal is likely my #2 movie of 2020, only slightly behind Da 5 Bloods. Unsurprisingly, Riz Ahmed as our protag, Ruben Stone, is incredible and, again, #2 performance of the year only behind Delroy Lindo in Da 5 Bloods — Elisabeth Moss is also up there for her performance in The Invisible Man. What is surprising is that Darius Marder made his directorial debut with this thought-provoking, touching, and entertaining film. Stone is ½ of the punk-rock duo, Blackgammon, the other half being his girlfriend, Lou (Olivia Cooke). Ruben — with the punk adage \"Please Kill Me\" tattooed across his chest — is a drummer who suddenly loses 90–99% of his hearing. If this wasn't enough, Ruben is a recovering addict, 4 years without using, and therefore needs — to his chagrin — not only a deaf-living house but sober-living, too. Marder uses sound in a way I've never experienced before — maybe because it's never been done(?) — to portray Ruben's disability. There was a moment when I thought the entire movie might've been conducted in this manner, which would've made a powerful point, but definitely would've been difficult to complete, but instead switches between regular hearing and the hearing-impaired. The direction and acting also beautifully showcases the frustrations of not being able to communicate. If there's one shot to stick with you, it's when all of the deaf school-children are resting on the grand-piano, Ruben right there with them. This movie is still new, so I'll spare more details, but the last three scenes, upon reflection, is one of the best sequences I've had the pleasure of viewing for a long time. There weren't many must-watches from 2020, but this is absolutely one of them.",
            "review_date": "2021-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Darius Marder's true debut and it's an interesting film. I thought for a long time that this was a documentary when I first got to know it. It sure has that look at times, but it's a bit deeper and has a few tailor made touches I guess. Ruben is a drummer in a metal band. He is an ex heroinist and lives with his girl and band member in his RV. They do gigs, but are never a big band. When he suddenly loses his hearing things naturally change. His career is no longer something to chase and he does not have much else. He gets into some sort of home. Kids and grown ups. Some earlier addicts, all of them are hearing impaired. He hats it at first, but likes it after a while. He still want's his surgery to make him hear again, but that's very expensive. His girl is someplace else and for some reason cell phones are prohibited from the home he stays as so there is not much contact between the two. \n\nThings are constantly happening here, mostly into something better. It has great sound, it looks good and it has a very great pace. It's never flat - but rarely big or really hitting you hard. A good film that could have been even better, but again, it could easily have been way worse too.\n\n8 out of 10 drumkits.",
            "review_date": "2021-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Been meaning to watch this for a while.  Eh. It's gutsy making a movie with most of cast being deaf. Makes it hard for it to be captivating though. The performances were great, some of the direction and editing were decent, but overall the movie is kind of a bummer and not in a cool, thought provoking way. Kind of Oscar bait.",
            "review_date": "2021-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a film about the main character's struggle to adjust to losing his hearing, and about the community that helps him to adjust. It's an empathetic take on becoming deaf. The film says so much, despite the dialogue being sparse, and it shows the how peaceful, but at the same time lively, being deaf can be through a deft use of audio and visual techniques. It is full of engaging sensory experiences even though it is a film about the experience of losing a major sensory input. Excellent performance from Riz Ahmed and supporting cast, especially Paul Raci.",
            "review_date": "2021-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "81%. Very good movie. Interesting to see the perspective of deaf people like the sound of them all interacting via sign language at dinner. He goes to a home with other deaf adults and spends a lot of time with deaf kids. He's doing well but decides to sell his rv and music equipment for the surgery. He tells the head of the house and he tells him he broke his trust because everyone there doesn't see being deaf as a handicap or something that needs fixing. Would rewatch but not super worth it",
            "review_date": "2021-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love the use of the sounds, definitely helps you immerse yourself in what Reuben is experiencing.",
            "review_date": "2021-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sound Of Metal is a beautiful film about recognising and normalising one's differences. Although Darius Marder raises awareness for the deaf community, his sensitive message and emotional tale of self-discovery is universal. Although I never developed any hearing issues, I was diagnosed with a life-changing health condition at an early age. Ruben's loss of identity, isolation, and new lifestyle resonated on a personal level. Ultimately, Marder highlights what it means to be alive and to appreciate the unsung beauty of silence. Anchored by Riz Ahmed's incredible performance and heightened by the innovative sound design, Sound of Metal is a rewarding viewing experience.",
            "review_date": "2021-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie doesn't include a lot of conversation scene, however This movie taght me so many things.....",
            "review_date": "2021-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4.5/5.  One of the best movies I will never watch again.  Riz Ahmed and Paul Raci are fantastic, the story is brutally tragic, and the sound design really gets under your skin, making the movie difficult and uncomfortable to watch.",
            "review_date": "2021-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed is so versatile, he can play a evil scientist like in Venom, or he can play a heroine addict who loses his hearing like in Sounds of Metal. The first half of this film was definitely better.",
            "review_date": "2021-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is an annoyance yet importance and value in the art of \"sitting still\" that makes the ending of Sound of Metal powerful and unforgettable. This act is so hard to achieve in a comfortable manner that we humans avoid it. \n\nSound of Metal provides an outstanding performance by Riz Ahmed and in-depth look into the deaf community from a should-be perspective. What I mean by this is the significance of Joe's and Ruben's conversation: \"Deafness is not something to fix. Learn how to be deaf.\" While in some acts there are loose threads, it is only minor. Nevertheless, the film makes its mark in filmmaking and in ourselves.",
            "review_date": "2021-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorites of all time. Loved every single bit of this film. A beautiful heartbreaking story, so so good…it’s definitely a must see!",
            "review_date": "2021-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed is amazing, period.",
            "review_date": "2021-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Of all the films I've seen this year, this is the one that should see the best actor award going its way at the Oscars in April for Riz Ahmed's barnstorming performance. Sure, I would not begrudge Chadwick Boseman for Ma Rainey's Black Bottom, but Riz Ahmed I think will be the underdog, and this deserves the plaudits. Riz Ahmed has been a wonderful presence in the filmic world for a while now, the first time I saw him he was terrific in Chris Morris' sobering Four Lions (2010) but this is him at the peak of his powers. Playing a drummer in a thrash metal sludge band, he begins to lose his hearing, in scenes that are truly terrifying, and brilliantly capture the initially horrifying prospect of losing ones hearing. Sublimely supported by small cast, most notably an excellent Olivia Cooke and Paul Raci, Ahmed's Ruben must overcome his inceptive doubts about joining a small deaf community (led by Raci's Joe) to come to terms with his hearing loss. Ahmed is sensational, making you feel every emotion using every bone in his body. This is not a performance that steals the film, or indeed makes the film. The Sound Of Metal is absolutely brilliant on its own terms as well, and the final scene, without giving anything away, is utterly perfect.",
            "review_date": "2021-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A deeply touching movie that not only gives a great insight into a different community, but also what it would feel like if one's life was suddenly and drastically altered by a loss of one of the senses we consider essential. Loved it that we were not given a traditional resolution, but rather a moment of silence.",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I found it rather tedious and turgid. Didn't grab or hold my attention. Relieved when the end credits rolled.",
            "review_date": "2021-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that describes the stages of addictions without drugs.",
            "review_date": "2021-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the sound and the overall message of accepting who you are.",
            "review_date": "2021-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes, I liked it. A lot. Riz Ahmed is amazing in it and his character is complex and easy to follow. Sound of Metal contains a simple, but fun plot.",
            "review_date": "2021-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hard to watch, incredible sound design- so uncomfortable. Brilliant movie.",
            "review_date": "2021-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great emotionally deep movie. Would be tough to go through and this movie takes you on that inside journey that helps better understand hearing impaired and gives you a better respect/perspective for those with it.",
            "review_date": "2021-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible. A very human story of struggling to accept a devastating, life-altering condition. Riz Ahmed conveys so much emotion and contemplation throughout using just facial expression and body language. Masterful performance",
            "review_date": "2021-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "you cant hate on a movie that has the best ending scene in the history of cinema",
            "review_date": "2021-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bit over hyped, not as good as people lead to believe, Riz Ahmed was very good.",
            "review_date": "2021-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A decent story, but kind of a downer without enough redeeming qualities.",
            "review_date": "2021-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie of 2021 so far. Breathtaking, strong and incredible performances by Riz Ahmed and Paul Raci. Emotional, deep, bare. Especially thrilling because of sound mixing and editing. Ahmed's and Raci's authentic acting deliver the rest.",
            "review_date": "2021-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After waiting for months, today this was finally released in the UK.\n\nRiz Ahmed plays Ruben, a drummer who lives through every musicians worst nightmare as he begins to lose his hearing. What follows is his struggle to accept and adapt to his new circumstances as he fights between trying to bring back his old life through any means, and moving forwards and making peace with his new life.\n\nI would have loved to see this in the cinema. The sound editing was fantastic and was really well used to get you inside the head and mind of the character. It really makes you uncomfortable at times. I still think Chadwick Boseman will get Best Actor for Ma Rainey's Black Bottom, but Riz Ahmed was brilliant here and I'm happy to see him nominated.",
            "review_date": "2021-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Sound of Metal', takes its audience on a journey of sound. It is a beautiful story, terrific casting of people from the deaf community and has stellar performance from a diverse cast, I was touched by the story and felt present with Riz Ahmed as he navigated life's unexpected problems. I would definitely recommend this film to anyone looking for something with warmth and meaning.",
            "review_date": "2021-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "MINOR SPOILER ALERT\n\nSound of Metal was a good movie. It had a fresh concept, exploring and considering both the experiences of the deaf community and addiction. It had a great cast, Ahmed shines in his role as Ruben Stone, and Raci as well in his role of Joe. Ahmed in particular, was what made this movie what it is. While I don't think that the film itself necessarily deserves a 98%, I'd give Ahmed 5 stars on his performance as a recovering deaf heroin addict. He is so utterly convincing; he seems so desperately obsessed with not only the drug, but with the things that helped him off the drug, such as his girlfriend and their band. His utter commitment to finding a way to get the life he once had back illustrates an issue many recovering addicts deal with. It shows how he has only switched from one pill to another, and I thought that the scene where Ruben turns off the hearing aid and embraces the silence was riveting. I thought the screenplay, cinematography, and sound were all very good. I was blown away by what they did with the sound, actually. They really deserved the Oscar for that. The only thing that sort of bugged me about the film was the pace. It was really slow and that didn't really bug me as much as it has in other films but sometimes it just gets really annoying. Some parts confused me a bit, but ultimately I thought that it was very good. I was really unsure about how to score this film, but I went with the 4 because I think the max would probably be 4.5 and the minimum would be 3.5. On a side note, I'd also commend the film for not allowing the Amazon/Netflix signature cringe to dig into it.",
            "review_date": "2021-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An Oscar-worthy turn from Riz Ahmed propels this heartbreaking drama into the conversation for the best movie from last year.  The sound design is incredible in a film that lends a voice to the underrepresented deaf community on screen.  Watch it!",
            "review_date": "2021-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed is extremely stunning",
            "review_date": "2021-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At first, I may not feel much, in the end I just wipe my tears quietly",
            "review_date": "2021-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In a manner like few others, Sound of Metal drops you into the shoes (read: ears) of its protagonist with full perspective immersion. Riz Ahmed channels a powerful mix of pain and fear as Ruben, a heavy metal drummer and former addict who suddenly loses most of his hearing ability. Alongside the long, uncomfortably real takes shot by director/co-writer Darius Marder, the paling fright conveyed in Ahmed's performance comes almost entirely from his face, tapping into raw, crushing emotions solely from blank stares and the sporadic physical outburst. The film's innovative sound design further lights Ruben's experience, corrupting, completely fading out, or immediately reappearing with a chilling wide shot cut at Marders' cue. It's a keenly crafted character piece with jaw-dropping moments from minute one, and while the second act pulls into a slower, calmer burn that may drag in retrospect, the film's gut punch ending shines with a bittersweet empathy ranking among the best of the year.",
            "review_date": "2021-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "riz ahmed walking in or out of a 'golden corral'",
            "review_date": "2021-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow burner, but thought I was watching something pretty original.",
            "review_date": "2021-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is a must-watch, from the stellar performance from Riz Ahmed and cast through to the phenomenal filmmaking from the team. It is a story that hooks you from start to finish, really making you feel for the character and the life he is losing around him. It also gives you a massive sense of appreciation and perhaps a little more understanding of the world around us. You should, however, try and catch it in the cinema before it is too late. Like a good old Christopher Nolan film, you can't beat IMAX.",
            "review_date": "2021-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "9.3. The art of sound, or rather lack thereof is truly quite magnificent. Within Sound of Metal, Darius Marder perfectly crafts sound as more than just one of the five senses, but a device of emotion within Riz Ahmed's character. But within Sound of Metal lies a story much bigger than facing deafness, but the idea of patience within life itself.",
            "review_date": "2021-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz is great, sound design is great, plays a thin line of letting the audience make their own decisions and telling them what is happening. I liked the ending alot.",
            "review_date": "2021-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another movie about being a rockstar, another movie that downplays how hard it is to do and how shitty life is as a musician. I have misophomia so the asmr style audio on this movie really messed with me and drove me crazy. I also have deaf family members which I was surprised at how well they incorporated the sign language and what not into the story. I just can't imagine that anyone would have passion for playing the drums when they're deaf and can't hear the music played. Decent story though.",
            "review_date": "2021-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed's performance was completely sensational. I found every performance, including those of the kids Ruben worked with's and especially Paul Raci's phenomenal. A very well directed film, i found the sort of slower nature of the story very fitting and the arc the story went on very impactful. I highly recommend :)",
            "review_date": "2021-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great exploration of what it actually means to be disabled, and whether that actually means you are \"lesser\" or not. I personally believe that a disabled person is not lesser in any way no matter what their disability is.",
            "review_date": "2021-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How is this movie rated 97% it was a original story but it still was not that good",
            "review_date": "2021-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes, this is a thought provoking film that deserves the attention it's getting but It's curious how the major flaws in it are being ignored.\nFirst off, I wasn't convinced that Rubin could play the drums! Im not sure if it was deliberately done but the drum sound in the early live sequence was weak. If that was deliberately done then why? We didn't hear the sound deteriorate, it started out dull! Also, I wasn't convinced by the 'band'. Where are they?\nNo doubt people will say these are technicalities but they didn't help suspension of disbelief.\nI think there was a great film in this trying to get out but for me it ended up a bit too confusing and the message (if I even got understood it), too watered down.",
            "review_date": "2021-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Over-hyped, over long and over rated. Slow moving with unappealing characters. If there is a message, it is so confused as to be completely lost. Ends up apparently being an attack on cochlea implant technology whilst showing little appreciation of potential benefits. Far from demonstrating that deafness need not be seen as a disability, the lead ends up in a catch - 22 situation once he loses his hearing - either give up his old life and career to lock himself away in a puritanical commune or take a chance with technology which the film perversely portrays as unhelpful. The ending not so much leaves the viewer to interprate the message as demonstrates that the makers themselves didn't know what it was. A very earnest film tackling a complex issue very badly.",
            "review_date": "2021-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "SO much to recommend about this film. Brilliantly acted and a fascinating story. I would give 5 stars if the film was a bit shorter - a few scenes went on too long.",
            "review_date": "2021-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant film, so bittersweet and insightful",
            "review_date": "2021-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good God this was a giant so what. How did this win? It's awful. Good luck getting through the first 20-30 minutes. I turned it off. Made me wish I was hard of hearing.",
            "review_date": "2021-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The performance by Riz Ahmed (as Ruben) is so strong that it is hard to believe he is acting at all.  Simply amazing.   \n\nThe movie feels \"real\", like an unfolding documentary.  Ruben quietly suffers an existential crisis as he accommodates his new life without hearing. \n\nThe movie has a slow pace with a hint of melancholy, which reflects how one might feel living without sound.  This might turn some viewers off, but I found it thought-provoking and worthy of watching to the end.",
            "review_date": "2021-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A moving look and warning to those who neglect their hearing.  Well made, but not one I need to see again.  Props for the idea.  Sit was on amazon.",
            "review_date": "2021-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one disappointed me after all of the hype; a bit too sleepy and subtle for what I was expecting given the strong hook of a premise. Wonderful, naturalistic performances, and some of the more creative cinematography on the roster. The best part of this movie was the sound design; similar to how The Father uses recasting and non-chronological editing to put you in the shoes of the main character, this film's sound design attempts to mimic the experience of losing your hearing. While it may or may not be an accurate portrayal of the physicality of it, I think they did a great job in conveying the emotional roller coaster and disorientation of being forced to experience the world around you in a new way. But not a best pic for me.",
            "review_date": "2021-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "8/10. With incredible performances, scripting grounded in realism, sensitive direction, and gripping sound design, 'Sound of Metal' tells a story that as many as 400,000 Americans each year may experience - the process of sudden hearing loss. Riz Ahmed's central performance as Ruben, a drummer who in an instant loses his hearing, is imbued with a deep emotional complexity that is complemented by innovative sound design - Ruben's panic, rage, despair, fear, and isolation are palpable as you watch him negotiate, and and eventually begin to grow in, his new reality of muffled silence. There are some scenes that make you want to reach through the TV and hug and comfort this man as his world falls apart around him, and again as he puts it back together. Olivia Cooke and Paul Raci are well matched with Ahmed in their supporting roles, the former as Ruben's deeply committed yet troubled love interest, and the later as a leader of an organization that supports the deaf. This film gives voice to a community rarely seen in film, and gifts awareness and empathy to it's viewers. It is certainly one of the most affecting, intimate films of the year.",
            "review_date": "2021-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very much overhyped and not particularly entertaining, but an interesting take on becoming deaf. The music they were playing at the beggining was awful, the main character was a complete moron for half of the film, not much actually happened, and several plot points were poorly explained like how he was allowed to hang out with a class of kids. It also seems rather silly that nobody explained the serious limitations of the implants before he had the surgery. I thought the ending was a bit bland as well since the film seemed to be setting things up for him to jump off a bridge or something. The acting was well done, but I wasn't a fan of any of the characters, and the focus was very much on the main character. The cinematography, visual effects, and soundtrack were well done. The story and message were a bit too simple in my opinion.",
            "review_date": "2021-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film about loss and acceptance . Beautiful performance from the lead actor. Really touching.",
            "review_date": "2021-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guy wrenchingly affecting film and astonishingly well acted and directed. The sound editing is superb and the whole film is really top notch. Very impressed but need to watch a comedy after that. Felt far too real and I'm resoundingly impressed with people who go through this and make a go of things.",
            "review_date": "2021-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a heartfelt movie about an issue not much debated in our society. Dealing with loss of hearing is something much more intricated than we imagine and the movie shows it in a touching way.",
            "review_date": "2021-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sound of Metal is a thoughtful and moving film about a musician dealing with the fact that he is rapidly losing his hearing. It has a smart script, a good plot, brilliant sound effects, and an incredible performance by Riz Ahmed.",
            "review_date": "2021-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sad existence of an addicted heavy metal couple and how they deal with an unexpected blow. Good plot and great acting!",
            "review_date": "2021-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Highly recommend!\n\nRiz Ahmed gives an incredible performance as Ruben, not only did he make me care immensely for the character but he also makes Ruben feel like a real person. You can tell he put a tonne of effort into this and it really does show.\n\nAway from Ahmed, Olivia Cooke (Lou) and Paul Raci (Joe) are also very good performers, while it's nice to see Lauren Ridloff (Diane) involved - she's great in 'The Walking Dead', while she is soon to be in the MCU's 'Eternals' as well.\n\nSo much heart to this. I couldn't possibly say with 100% certainty for obvious reasons, but it seems to do a terrific job at telling the story that it intends to. That's not always the case, so the filmmakers deserve praise for that - as well as for the sound design et al.\n\n'Sound of Metal' is worthy of the hype, no question.",
            "review_date": "2021-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A big story with a smart script pays off and delivers a nice film.",
            "review_date": "2021-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A thoughtful, moving film about a musician dealing with the fact that he's rapidly becoming deaf. Great directing, great performances. There were times while I was watching it when I wasn't sure I wanted to continue because I felt so much empathy with the characters, but I was very glad I kept watching it until the final scene, which brought it together in an insightful and appropriate way.",
            "review_date": "2021-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wow, loved this movie. the story of doing the implants then the complete silence at the end is jus chiefs kiss. The sound mixing of when he would go into his deaf state and when his implants were on really showcased his character n emotions. movie was good af, deserved the oscars it won",
            "review_date": "2021-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting is wonderful but it moves so slow!",
            "review_date": "2021-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredibly well acted by RA, with a supportive cast. A great story, giving insight into a community you don't often see on screen in this way. It strikes a good balance between emotion and reality, avoiding over-dramatising",
            "review_date": "2021-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sound Of Metal first off yes has beautiful sound delievery. Riz Ahmed and Paul Raci and everyone are so realistic in their performances and the story is interesting. The way this film tells the issue in it is a force and the film is even a bit electrfrying. The ending is beautiful with the sound usage in it. And just the journey of Ruben is a hilly journey that gets to you more in more in ways that are wild. 4 out of 5.",
            "review_date": "2021-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed's craft to the story and the fact he learned sign language and the commitment he has on his facial expressions in the story makes you sad for his character what he is going through in losing his hearing but the fact he loves music and his girlfriend Lou played by Olivia Cooke just makes this film so great",
            "review_date": "2021-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film for me totally lacked depth. I found the plot one dimensional and boring. Honestly can't think of a single scene I enjoyed",
            "review_date": "2021-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can relate to a lot of aspects of this movie, having gone through some hearing loss due to an autoimmune disease and to my love of heavy metal. Riz is awesome but the revelation is Paul Raci. the moments he spends with Ruben are heartbreaking and a delight at the same time. ",
            "review_date": "2021-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed was robbed of an Oscar, he blew away the other actors. Amazing movie and performanc",
            "review_date": "2021-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed was brilliant as always & great to see him get an Oscar nod for this. The film itself, meh, it was Ok. I didn't think it was anything out of the ordinary & was probably overhyped. It had a good story to it but dragged in a few places. Probably wouldn't watch it again.",
            "review_date": "2021-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I appreciated what this movie had to say. It didn't have an ending, because it didn't need one. It was very real feeling. I would recommend for anyone who wants to watch a very true to life movie. Very well done",
            "review_date": "2021-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once I got past the opening ‘music' scenes, it was a very thoughtful, emotional, view of acceptance.  The acting was superb especially Riz Ahmed.   Sounds of Metal, as with Nomadland, shows us a community rarely seen by main street.  Highly recommended.  Amazon Prime free with membership.",
            "review_date": "2021-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In chalking off the 8th and final Oscar nominee for Best Picture, I stumbled upon one of the best lead performances I have ever seen in the film.\n\nSound of Metal is all about Riz Ahmed as the British-Pakistani actor and former rapper takes us along on a musician's gut-wrenching journey in coming to terms with his deteriorating hearing.\n\nThe way he portrays the character's mental and physical breakdown as he goes through the various stages of grief is astounding.\n\nUp for 6 Academy nominations this year, the sound design is so impeccable that it is just a foregone conclusion that the Amazon Prime original will land the Oscar for Best Sound.\n\nHats off to director Darius Marder for this unique narrative style where he gives us an in-depth POV perspective of hearing loss.\n\nWhile Hopkins' portrayal in 'the Father' as well as Boseman in 'Ma Rainey's Black Bottom' will both be a cut above this for me, Riz Ahmed deserves all the plaudits he is getting and more.\n\nA career-defining performance. Prepare for an impactful, unsettling\nwatch that is sure to haunt you.",
            "review_date": "2021-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an absolutely wonderful story of human meaning in and transformation!!!",
            "review_date": "2021-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Phenomenal story with great message. Acting was terrific",
            "review_date": "2021-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My honest opinion\nSome things trouble me about this movie. I think the acting was not an Oscar performance. I would like Ruben to have some trouble with controlling his voice level while he is talking. However, I liked his performance in a way. He handled to demonstrate his hopes about his condition and inner conflicts without directly showing it to us. I can say that Riz Ahmed did a great job at that.  \n\nI did not like the story. I like it when movies have strong beginnings and calm endings. But, in this movie, nothing happens in between (Act 2). I did not also understand what it really tries to tell the audience. I now it shows us the deaf community and how Rubert's life changes. But it was just so long and slow that you can't really follow after a moment. I did not also understand Lou. I do not want to give spoilers, but I just didn't understand what is her deal. I guess this movie just isn't for me.",
            "review_date": "2021-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A GOOD MOVIE MAKES U STOP AND REFLECT AND REALLY MAKE U SIT THERE. \n\nAND THIS DID THAT.\n\nTHIS FRIGGING DID THAT.",
            "review_date": "2021-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very realistic and beautiful haunting movie that deals with a reality that no one wishes for but help us understand the other side.",
            "review_date": "2021-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My pick for Best Picture & Best Soundtrack for Oscars 2021, is hands down 'Sound of Metal'. I watched it last night on Amazon Prime. It's a few years since I've been touched by a motion picture like I was with this one. The soundtrack is such an important part of the telling of this story (and I'm not talking about musical soundtrack). The acting is authentic and combined with the soundtrack & cinematography, this film shines a very bright light on a world most of us are completely ignorant of.",
            "review_date": "2021-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "8.0/10. This film tells an excellent story.",
            "review_date": "2021-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the performances are perfect and the storytelling is stellar. I give it an A",
            "review_date": "2021-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While hanging out with musician friends at shows I noticed that before playing, they all put in earplugs. I wondered why since I thought this would make it difficult for them to hear each other. This was very much not the case. If you've ever been to a loud concert, it is way, way louder on stage. So, the premise of Sound of Metal, about a working-class heavy metal drummer whose world is turned upside down by sudden and profound hearing loss, is frighteningly believable. Thankfully, my friends still have their hearing. \n\nThe path that Ruben, played by Riz Ahmed with one of the best performances of the year, finds himself on is abrupt and unexpected to put it mildly. Likewise, the film never quite goes where you expect, but you believe every moment and every emotion. I wasn't expecting Sound of Metal to receive 6 Academy Award nominations, including Best Picture, but I am very happy that it did because I cannot think of many movies from 2020 that I enjoyed more. \n\nFaced with the loss of his hearing, his livelihood, and potentially his relationship, Ruben also fears losing his four years of sobriety from heroin. In need of immediate and special help, his girlfriend and bandmate, Lou (Olivia Cooke), takes him to a sobriety house especially for the deaf. The house is run by Joe (Paul Raci), a deaf Vietnam veteran and recovering alcoholic who gives off the impression that his inner peace only came after a hard struggle. He takes Ruben under his wing but tells him that his program is about finding a solution to the problem in his mind, not his deafness. The scenes of Ruben at the deaf sober house and learning how to live without hearing are interesting and very engaging. Director Darius Marder's gentle approach to the characters and Ruben's journey gives us the feeling that we are getting a window into a real community with real people, not participating in a kind of cultural tourism.\n\nAs much as I admire the approach taken by Marder's direction and the screenplay he co-wrote with his brother Abraham, Sound of Metal works so well because of Riz Ahmed's performance. This is not a case of an actor showing off their talents by playing a character with a disability. Ahmed plays a full range of emotions but the real pathos comes from his facial expressions, especially his expressive eyes. Most important of all to the movie's success, he is not afraid to show big vulnerability on screen or show just how afraid and anxious someone in this situation would feel, especially if they were a musician.\n\nThough we see Ruben getting on well at the sober house and with the larger deaf community, he still wants to have cochlear implant surgery which he believes will allow him to return to his old life. This is at odds with Joe's belief that being deaf is not a handicap or something to be fixed and leads to one of the most compelling and affecting scenes of the movie; one that likely earned Ahmed and Raci their Oscar nominations. It is easily one of the best moments in any movie I saw over the last year. \n\nI will admit that I was hesitant to watch Sound of Metal at first, despite its positive reviews, because a movie about a young musician going deaf seems like a heavy or even depressing movie. However, Sound of Metal ends up being an uplifting film without delving into melodrama or smarmy sentiment. Every aspect of this movie is low-key, allowing every moment to feel genuine. This is not the kind of movie with twists but it does have unexpected narrative turns which are best left to be discovered along with Ruben. All of the unexpected places, both physical and emotional, the story takes us are what make it memorable. The empathy in the performances from Paul Raci, Olivia Cooke, Mathieu Amalric, and, most of all, Riz Ahmed are what make it so moving. Sound of Metal is something special: a film so seemingly simple but deeply affecting. It is a character study so well executed that it transcends its premise and puts us so in tune with the main character that its final moments become spiritual, or philosophical, depending on your inclination.",
            "review_date": "2021-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie portrays the struggle of a hard rock drummer who lost his hearing from all the noise he exposed himself to.  He kept on thinking that he could get his deafness fixed until he realized that being deaf is not the handicap he thought that it was.",
            "review_date": "2021-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sound of Metal is a simple, thoughtful, and well-told story that reminds us to be careful what you wish for. Ruben (Riz Ahmed) is the star attraction with a nuanced and occasionally raw performance. That said, I could not take my eyes off of Paul Raci. He simply is. His performance in this movie is so pure, and he is more than deserving of the Academy Award nomination for Best Supporting Actor. Of the big four acting awards, I felt strongest about Daniel Kaluuya winning for Judas and The Black Messiah, but this movie changed my mind.\n\nWhile it's not technically a character, the sound editing and mixing feels like one. It adds depth and perception to the deaf/hearing-impaired experience. Every sound is so thoughtfully added as well as the inclusion and omission of subtitles. As a byproduct of focusing on the deaf/hearing-impaired experience, Sound of Metal must rely on visual and sonic cues over exposition. This \"show, don't tell\" approach helps make this movie as good as it is. \n\nCurrently, this ranks as one of the five best movies I've seen for 2020. My only gripe is that the pacing is a touch uneven, especially in the third act. Still, the final scene provides a poignant bow to the story.",
            "review_date": "2021-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "8.4 - Sound engineering masterpiece, thought-provoking, rang true: each note, each word, each scene. Traditional perspectives about what we value that when taken from us, can cause us to mourn and grieve, yet can also give way to possibilities can unexpectedly, surprisingly, miraculously blind-side and quicken our future prospects. CGreenSnyder",
            "review_date": "2021-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Deeply, deeply touching.",
            "review_date": "2021-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a waste of time this one was for me. Kept me waiting for something major to happen but never delivered. Ending left me with my mouth hung open. Totally over-rated performance by its bored main character, who also seemed like he was waiting for something to happen. The message it seemingly implied was it was better to be Deaf than to hear using an implant that simply needed tweaking. Instead he hears everything around him. I screamed \"LOWER THE DAMN VOLUME, YOU FOOL!\" Left me, & any1 with the hope of hearing again using an implant, with the feeling that \"it's a waste of money & it's better to join a Deaf camp & live among \"Your kind\" than to try it for yourself\" & \"Be thankful there's something that can be turned on & off which can make you hear if you're Deaf\"! Silly, with a very poor message to Deaf people.",
            "review_date": "2021-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Technically accomplished feature debut with simple or unitary storytelling and stunning performance.",
            "review_date": "2021-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A clear message about the difficulties of the deaf community, Sound of Metal is an excellent dramatic journey fueled by the passionate performance of Riz Ahmed.",
            "review_date": "2021-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love the acting. Love the sound (and metal?). Just a well done movie about loss of hearing.",
            "review_date": "2021-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed is reliable but the film stagnates.",
            "review_date": "2021-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent acting, especially by Riz Ahmed. His ability to say so much with just his facial expressions was impressive, and his commitment to the role (learning both how to play the drums and ASL before shooting) was also extraordinary. The story line moved along well, and it did not give in to a totally happy, sappy ending. Sound was creative and added depth to the story.",
            "review_date": "2021-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is insanely good",
            "review_date": "2021-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know this is not relatable with a lot of people but with me it is, but with me it is because I have also hearing loss. This is the hardest film of the year to watch but not the best film of the year. The best part of this film is the sound design, it really captures what sound of what hearing loss and tinnitus. This is a film that everyone needs to experience once and I am giving this a 9.5/10.",
            "review_date": "2021-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "brilliant story it's hard to watch but it's must. the sound editing, Riz Ahmed and Paul Raci are amazing at this",
            "review_date": "2021-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Performance notwithstanding, it is a minor movie undeserving the Oscar nomination",
            "review_date": "2021-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one is a good one, a relevant, touching story. Great acting and well directed",
            "review_date": "2021-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful powerful character study",
            "review_date": "2021-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was my review in my ASL class.  First of all, this film as AMAZING!!  I absolutely LOVED it!  I had been planning to watch it but just hadn't gotten around to it.  I've been taking ASL through a local college, and this was on our list for extra credit.  I was on Prime back in February and decided to watch it.  I've been recommending it to everyone ever since!  I felt the film was very respectful of the deaf community, and it seems like everyone involved made a big effort to really work together to portray what it would be like to suddenly go deaf and how that and subsequent actions taken would affect not only your own beliefs in what your identity is but also how it would affect other people's lives and perception of you.  The film of course reinforced the fact that people in the Deaf community can do anything they decide to do.  One aspect I hadn't really given much thought to was treatment and halfway housing for deaf addicts.  We've talked about deaf people having access to skilled interpreters during things like doctor appointments in my classes, but addiction recovery wasn't something I had specifically thought about.  That creates another set of challenges, as addressing addictions usually involve a lot of anger, doubt and fear.  If you don't have someone you can easily talk to with sign language to help you through that, it would really create a barrier to recovery and moving forward in life as a recovering addict.  I've had family members and friends who have been addicts, primarily alcoholics, and trying to overcome it was hard enough without an additional barrier of not having a common language to express yourself and get the help you need.  \n\nI loved seeing the progression of Ruben's perception of himself and acceptance of being deaf changing.  I thought he portrayed the denial, fear and anger associated with the loss of hearing quite well.  I thought that was probably how I would react in many ways.  I was surprised he didn't seem to make any effort to discuss getting the cochlear implants with anyone at the halfway house...it was heartbreaking to watch him learn he couldn't stay there anymore and to see Joe's face after he got up to leave.  I was sad he and Lou had grown apart, but in a way I think it helped him finally and fully accept he is now a deaf person.   That last scene was pretty profound.  I think Ruben will perhaps find a way to help deaf children experience music and maybe form a deaf drumming group, perhaps one that incorporates addicts...giving back and helping others find a new creative outlet for themselves.  I hope he remains friends with Joe, Jenn and Shaheem.\n\nI read the interview with Riz, and I watched the panel discussion as well as another video related to The Sound of Metal.  It had Riz doing an actor on actor interview with Steven Yeun where they discuss the roles they played in this movie for Riz and in Minari for Steven (another excellent movie!)...discussing perceptions, roles, and stereotyping in society and in movies...the freedom/exhilaration of using a language besides English as a primary language for their respective movies...the labels that are put on us by society...code switching to fit in with the society around you but to be you at home/with friends & family.  It was illuminating and powerful...I have a lot of respect for both actors. \n\nI found the panel discussion to be very uplifting.  I loved hearing from everyone on the purpose behind the movie, how CJ and others reacted to the movie, how the actors felt about their roles, the preparation Riz and Olivia put into learning the instruments and for Riz learning ASL by immersion and wearing suppression devices to mimic losing his hearing.  Paul Raci was particularly impressive in his efforts to call out Hollywood for not casting more deaf actors and actresses in roles.  I also was happy to see different interpreters working with the panel.  I really hope this film is a stepping point for Chelsea & Shaheem to find more roles.  \n\nThe film was fantastic in and of itself, but then watching the additional videos and reading the interview just took everything to a whole new level and really elevated this movie even more.  I've shared the link to the movie, the videos and the interview on my FB page and by email/text with a lot of close friends.",
            "review_date": "2021-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The sharp, precise and smartly constructed manner in which Darius Marder's debut feature begins is rather remarkable. Not only does it tell us everything we need to know about Riz Ahmed's recovering addict/drummer Ruben and his girlfriend/vocalist, Olivia Cooke's Lou, but it plugs us right into Ruben's nightmarish experience as he becomes aware that his hearing has been reduced to a disorientating static buzz. Much has been talked about the film's inventive designs in sound mixing which manage the rare feat of actually propelling the narrative forward, and every word, and every award it's getting for them, is true and well-deserved. In an equally awards-worthy performance, Ahmed is expressive, vulnerable and raw, and you just can't help but fall hard for Ruben as he struggles to learn how to be deaf at a deaf community run by (now Oscar-nominated) Paul Raci's Joe. It's to the writers' credit that, despite the presence of addiction in the storyline, that it never goes for easy shots or the usual melodramatic tropes that you half expect to see along with a special appearance by Marlee Matlin (who's of course wonderful in her own right). In fact, the film's slow and singular drive towards an inner reconciliation for Ruben is both unexpected and so nicely orchestrated, I find myself emotionally drawn and drained watching this insightful and authentic drama tackling not just a rare subject-matter, but do so in this particular way; and it's 2hrs long but hardly feels it. The last shot may look like your run-of-the-mill elliptically abrupt indie-drama ending, but it's less about what happens next and more about how he finds peace within himself; and as far as the film's emotional arc is concerned, it finishes with Ruben arriving at exactly the right place he needs to be in his head.",
            "review_date": "2021-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Sound of Metal\" captures the essence of many forms of loss, and on so many levels that the end result is far more rich and complex than one might expect, even by the film's mid-point. Ruben (Riz Ahmed, Best Actor nominee, whom you might know from HBO's great limited series \"The Night Of . . . \"), a heavy metal drummer, discovers he's losing his hearing within the first minutes of the film during a concert performance with his girlfriend and fellow band member of their duo \"Blackgammon.\" And with that loss, sound itself becomes another character in the film as Ruben fights to save what he can of his rapidly crumbling life. With music suddenly no longer a viable career path, one would expect melodramatic, over the top wallowing in pathos, especially given that Ruben is also a recovering addict. And while there are the expected and understandable outbursts of angry frustation and agony, they are few and far between as Ruben tries to piece together who he is now, and who he can become without lapsing back into addiction. Throughout his journey, the film's sound track mirrors the type and level of Ruben's hearing loss, placing us IN his experience. Muted, muffled, empty, painful, and many points inbetween, \"Sound of Metal\" takes the use of sound in cinema further than we have previously known. Sure, we have had the soundtrack reflect the muffled ringing in a character's ears following an explosion before, but no one that I'm aware of has tried to replicate the experience of going deaf like this, making it a probable shoe-in for the Achievement in Sound Academy Award. This is NOT a film designed to elicit sympathy for the deaf through cheap tear-jerker shots, but uses the deafness to explore loss, as Ruben's life and world crumble around him leaving him empty and desperate to find a future for himself. The majority of the film takes place in a retreat for the deaf led by the wonderfully calm and wise performance by Paul Raci (Supporting Actor nominee) whose uncompromising approach to teaching how to live as a deaf person offers Ruben his best hope for a meaningful future. I can't really say much else without spoiling the film's final act, but the inclusion of the divisive issue of cochlear implants within the deaf community provides the lynchpin that yields the amazing conclusion to this film. Watch this film in a quiet place.",
            "review_date": "2021-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All the time I watched the film I thought of Christopher Nolan's \"Memento\" which I felt \"dementia\" along with the story. Nolan had it very clever way to make the audience fall and become  as if they were one of the characters. This film tells good story at turning point of a man becoming deaf but fails to demonstrate the deaf experience and how it'd feel like to the audience.",
            "review_date": "2021-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Literally just made this account so I could say this is the best movie I have ever seen. Ahmed's performance is breathtaking. It's hard to even see the movie through your tears but it's worth every minute. I can't say enough good things about this film. 10/10",
            "review_date": "2021-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More interesting for its testimony of a real fact (good use of sound to describe it) than because its cinematographical values.",
            "review_date": "2021-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is absolutely beautiful.",
            "review_date": "2021-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent. It should win the Best Picture Award at the Oscars 2021 especially for shedding a light on the disability issue with such skillful entertaining aesthetic.",
            "review_date": "2021-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A critics' darling and deafening is the victorious applause in the silent last scene when Riz Ahmed's drummer whose hearing he lost to heavy metals exposure takes off his cochlear implants to finally embrace his inconvenience.",
            "review_date": "2021-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The reason why my rating's so high is cuz they def portrayed the Deaf (with a D) community accurately, I know this as a Deaf person...I would appreciate it a lot if more movies like this were created.",
            "review_date": "2021-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ruben, a drummer for the metal duo Blackgammon, suddenly loses his hearing. He goes to a school for the deaf to learn to deal with his disability. While he makes some progress, halfway through, seeing his girlfriend, Lou makes him revert to wanting to instantly fix his deafness with cochlear implants. He sells his RV and gets the implants. While they allow him to hear, the sound is distorted and garbled. Ruben chases after Lou, but realizes that Lou has moved on from him. At the end of the movie, drowning in the distorted sound from the implants, Ruben turns off his implants to embrace the silence. \n\nRiz Ahmed's performance in Sound of Metal is empathetic and compelling, and the story grips you at the beginning. I felt that the second half of the movie dragged a bit.  I don't really care about Lou. Ruben's learning to cope with deafness was much more interesting. I also feel like for a movie about deafness and sound, the sound design was sadly not very surprising. I think I wanted to see more experimental and creative use of sound design in the movie. I wish sound design could have taken the place of subtitles in the sign language scenes. Could the actors have been dubbed with sound, to allow the hearing audience to experience sign language? Overall, I feel like the movie missed its potential.",
            "review_date": "2021-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed has a performance of a lifetime in Sound of Metal, with amazing screenplay and sound design. Great piece of drama that captures the emotion of a drummer that has to deal with the loss of his hearing.",
            "review_date": "2021-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is stunning, the performance of Riz Ahmed was outstanding",
            "review_date": "2021-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its a good screenplay to be sure but the crucial elements are Ahmed and the sound design, fortunately both are fantastic.",
            "review_date": "2021-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": ")\nWhat an amazing film!! It brings an unique perspective about the deaf world. Really great!!",
            "review_date": "2021-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A refreshing movie that is executed wonderfully. Really opens your eyes to the deaf community and/or just the idea of accepting change and finding peace with it.",
            "review_date": "2021-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The unwanted journey of the main character's new life was honest and rough and soul touching. Not to mention the film telling the story not often known to people outside the deaf community of the social & educational services/sub communities within the the larger deaf community.",
            "review_date": "2021-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great sound design that allows you to interpret the characters Arc throughout the movie.",
            "review_date": "2021-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely amazing, a film that shows the sudden change of life and how to deal with it.",
            "review_date": "2021-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touching film about going deaf appropriate for deaf to watch with captions. Beautifully acted!",
            "review_date": "2021-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite so far this Oscar Season ",
            "review_date": "2021-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a really interesting movie, but to be honest the music and the relationship betwen Ruben and Lou doesn't matter at all. I think that those aspects could have been a lot better and with that it would be a masterpiece. Even tho I love this movie and his sound and acting is really amazing.",
            "review_date": "2021-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is a mediocre film at best. It is a tonally, visually and emotionally flat movie. Riz Ahmed's performance was flat too. the whole movie he has the same surprised look on his face. I wonder how this movie got Oscar nominations",
            "review_date": "2021-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Word of warning: this movie is a long one..and it does move along at a SLOW pace, but the payoff is GOOD..I think it could have even been better with a quicker pace.. The acting was great as well..It was not just a \"pass the time\" type of movie..but it was a slow movie.So dont go if you are tired as the slow parts will put you to sleep, but then you want to wake up at the end..",
            "review_date": "2021-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly unique experience led by a career-defining performance from Riz Ahmed.",
            "review_date": "2021-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful and flawless. A cinematic experience in the truest sense.",
            "review_date": "2021-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It presents you such an emotional story with impressive character development that unfolds in such a way that it also provides the opportunity to be more empathetic to those who are partially or completely deaf by knowing how it is a part of their lives. 10/10",
            "review_date": "2021-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sorry this movie was slow and boring. ",
            "review_date": "2021-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting and thought provoking with a sure to be award winning central performance for Ahmed. Beautifully made and impeccably acted.",
            "review_date": "2021-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best approach I have found about how it is for someone to lose his hearing.",
            "review_date": "2021-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie that missed 5 stars due to a few dragging moments.",
            "review_date": "2021-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's an amazing movie with a story that people in general are not familiar with, but it still happens. The work of the protagonist worths the oscar's he's competing. I wish the story ended more clear, but as in nomadeland you get an unfinished end, but that's ok since the writers left the end of the story for you.",
            "review_date": "2021-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies of the year. Amazing acting and a thrilling story. A must watch",
            "review_date": "2021-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Had potential but just kept stopping short. ",
            "review_date": "2021-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed as a metal drummer who loses his hearing and has to learn to adapt. The story is quite good and Ahmed is terrific in his performance.",
            "review_date": "2021-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Totally engrossing. A film with substance that uses the power of film making to create an \"empathy machine\" that brings you in another's world.",
            "review_date": "2021-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I want to see the movie that everyone else is in love with! This movie was such a let-down! Plot holes a-plenty! A story that never went anywhere. A completely unlikeable lead character. The best thing about this movie was when it was over! ",
            "review_date": "2021-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I found this film to be flawless and deeply moving. Incredible experience!!",
            "review_date": "2021-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When I finished it, I couldn't feel and hear in the same way.",
            "review_date": "2021-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible. Just terrible. I cannot believe Amazon actually paid for this crap. Completely incompetent. This would be passed over by Lifetime. Nothing makes sense, nothing is satisfying, very boring. The acting was shocking (pretty close to community college level). Please do not waste your time.",
            "review_date": "2021-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From its at times physically exhausting use of sound (and lack thereof), to its wholly human look at struggle and vulnerability and the earmarks of addiction which forever tab the book of mortal life, Metal immediately grips the viewer and does not let go. \n\nThe viewer is taken through the film at a pace and tone which matches the anxiety and instability of its leading character including a healthy and relieving serving of serenity. Unlike movies of its kind, Metal does not hold you in a state of panic for the full length of the film but instead weaves you in and out following the ups and downs of Ruben (played by Riz Ahmed), the recovering addict who loses everything when he becomes deaf due to prolonged sound exposure as a heavy metal drummer.\n\nSomehow, as a woman who has never suffered from addiction or played an instrument in her life or who even enjoys loud music in the car, I was able to strongly identify with Ruben and feel  deep empathy for him even in his fictional existence. \n\nSound of Metal is a must watch.\n\nMore at: https://www.freepressfail.com/category/the-conservative-critic/",
            "review_date": "2021-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the craftsmanship of sound design is nothing short of excellent, it's nothing more than practical. It's by no means exceptional, but that doesn't take away anything from its value and efficiency that, in part, rendered this movie a truly immersive experience. It's Riz Ahmed's bravura performance, though, that gives Sound of Metal resonance that, in turn, made Ruben one of the most relatable movie characters I've witnessed in recent memory. \n\nHis ability to reflect his fluctuating feelings throughout the movie and how he perceives every phase in his new life is simply astonishing. The aching experience Ruben goes through demands a real acting talent to make the audience emotionally connected to the protagonist, but Ahmed proved he's not just a talented actor but also one who's in a total command of his craft. For if it's hard to make the viewer feel what his character feels, it's even harder to transport its mental state to the audience. Here, we don't only get the sense of loss and being stripped of everything that forms every inch of Ruben in a flicker, nor only do we only understand his pressing need to regain what he lost—especially since the possibility hovering in the air—but we see him grappling with the dilemma of whether he should continue his journey of adapting to his new condition as if it was the norm or he should keep clutching onto the flicker of hope that definitely wouldn't help in case of it turned out to be a mere mirage.\n\nFurthermore, the movie also excels in aspects other than its nuanced portrait of its main character, namely is its exploration of deaf community that truly offers new insights. That's mostly because of the effort shown in the meticulous attention to its essential components, most notably the sign language. However, Paul Raci played a major part in that by portraying the leader of this community and a mentor for Ruben. Through his facial expressions during conversations with Ruben, he delineates the professional duties such an occupation demands. We see him monitoring Ruben's progress and interfering according to his understanding of Ruben's character in particular. As for Olivia Cooke, she further proves she's a remarkable young talent that yet to bloom. Playing Ruben's bandmate and girlfriend Lou, she managed to prove how important she's to Ruben as his most great and precious loss and equally as a great help for him to get a better sense of what he has lost and how to cope with that.\n\nThe acting clinic these three immense talents put on here left an indelible impression on me, but disregarding the technical quality would make absolutely no sense. Besides the exquisite sound design, the highly-articulate cinematography truly adds up to the experience. If there's only one issue I have about this movie it would be its failure to maintain the same dramatic heft that was in its first half. As the focus on Ruben's progression through his medical recovery and its consequences slightly overpowered the emotional quality, and hence there was a bit of it lost that even the wrap-up failed to fully retrieve. \n\n(8.5/10)",
            "review_date": "2021-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting - very real",
            "review_date": "2021-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is what movies are about.",
            "review_date": "2021-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a good movie, but the pacing was too slow and it felt like three hours. The acting was very good.",
            "review_date": "2021-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just wow. The feeling of losing the thing you hold most dear is really hit on the head here. The sound design really took it to the next level to give you a taste of what it would be like to lose and partially recover your hearing. Really really well done.",
            "review_date": "2021-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ahmed charts the emotional arc of his character with great sensitivity.",
            "review_date": "2021-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film all around and an excellent performance from Ruiz Ahmed!",
            "review_date": "2021-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first time i had see Riz ahmed was on Venom. Okay this movie is another kind of movie, but its funny for me to remember that.\nSound of metal is a amazing movie, Sound is brilliant, filmography is also very good and the cast simply perfect. Riz, who playing Ruben, the main character on the movie is fabulous.\nScreenplay is really god. His moves, his sights. Really really fresh movie.\nAn absolute must see in this times of pain and doubt.",
            "review_date": "2021-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow moving story about a drummer who goes deaf. The script isn't that great but the director does a great job of creating something out of nothing. Riz Ahmed does a good job as the lead. I enjoyed it a lot.",
            "review_date": "2021-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie with a very interesting use of sound.",
            "review_date": "2021-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great, yet subtle, performance from Riz Ahmed makes this film so heartbreaking and moving to watch.",
            "review_date": "2021-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked it. The story was interesting and the lead did a great job. I thought Lou was a weak point and I thought her acting was kind of bad. I was distracted by her bleached eyebrows. I recommend it.",
            "review_date": "2021-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is how my ears felt coming out of Tenet.\n\nIn university, I actually wrote an essay on hearing loss and cochlear implants, and from my (not) expert opinion, they did a fantastic job portraying hearing loss. Hearing is such a fragile thing, and once it's gone, it's gone forever, so seeing the character of Ruben come to terms with that was incredible.\n\nAs for Riz Ahmed's performance, it was nothing short of extraordinary. You feel his initial anger and confusion, and as his character grows, you find comfort and peace in his silence. It's an emotional rollercoaster as his journey teaches us more about the deaf community and how to live without hearing.\n\nThe supporting cast all do a great job, especially Paul Raci as Joe. But the subplot with Ruben's girlfriend, Lou, did nothing for me. Their relationship was touching, and they have their moments, but I just didn't care for their love story/the tour subplot. I just thought that Ruben's personal journey of learning to live without hearing was more interesting when he was figuring it out on his own.\n\nI was actually blown away by the sound design, which is not something you usually hear in movies. (Pun intended.) Since hearing is such an important part of the film, they use it in so many creative ways. There are even long sections without any words ever being spoken, which made for a more immersive viewing experience.\n\nOn the other hand, the movie can run a little long at 2 hours. They could have probably shaved off like 20 minutes, mostly to do with the girlfriend/tour subplot. But with such an immersive sound design and an excellent performance from Riz Ahmed, this would have definitely made my Top 10 Movies of 2020 list.",
            "review_date": "2021-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With an Oscar caliber performance by Riz Ahmed and its brilliant use of sound, Sound of Metal gives tremendous insight into the deaf community.",
            "review_date": "2021-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There was a time I would rate movies like this much higher. But now I prefer something fast paced especially since the commercial movies have become better in quality. One doesn't need to look for an indie like this for quality cinema.",
            "review_date": "2021-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fascinating movie with great performances.",
            "review_date": "2021-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The lead actor kills it at the roll.  It is believable.  Definitely puts what is important into perspective.",
            "review_date": "2021-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful, enlightening and humanizing drama, Sound of Metal takes us through the arch of Metal drummer Ruben Stone's sudden hearing loss.  The sound editing brings the viewer into the experience of Ruben, complementing Riz Ahmed's performance to allow the viewer to empathize (as much as humanly possible through a screen) with the initial frustration and despair of his new reality and his mindset throughout the film.  So many choices throughout the film - from the visual shots, to the choice of when to subtitle, to the sound -  give power to the non-hearing community and truly help the hearing understand Joe's final dialogue with Ruben (a tremendous piece of acting by Paul Raci) and his terribly difficult choice.",
            "review_date": "2021-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a drummer/percussionist with hearing loss of my own, this film hit me hard.  SOUND OF METAL, directed and co-written by Darius Marder, tells the story about heavy metal drummer Ruben (Riz Ahmed from ROGUE ONE, VENOM and the HBO miniseries \"The Night Of\"), touring in an RV with his girlfriend & singer/guitarist Lou (READY PLAYER ONE's Olivia Cooke).  One night he notices an abrupt hearing loss, and after a few days of devolving hearing Ruben goes to a doctor who tells him he's lost about 80% of his hearing in both ears.  Like nearly all hearing loss, the doctor tells Ruben his hearing can never be restored, and his best bet is to have an operation and get cochlear implants: devices surgically implanted that bypass the damaged ear canal(s) to deliver an electric/mechanized sensation that resembles what humans perceive as sound.  The doc tells Ruben this procedure is expensive ($40-80 thousand), and if you know ANYTHING about working drummers you know Ruben doesn't have that kind of money.\n\nAdding to his troubles, we learn that Ruben is a recovering drug addict: four years sober.  Lou becomes increasingly worried that Ruben will be unable to cope with this devastating news and will relapse.  She contacts his sobriety coach who is able to hook him up with half-way type situation for deaf recovering addicts.\n\nThe bulk of this film is Ruben both learning how to live with deafness (Joe, who runs the rural deaf recovery house, stresses that deafness is NOT a handicap, and instead is something that Rueben needs to learn to adjust to), while also learning how to adjust to a new \"him.\"  The direction is really well done: the situation isn't meant to feel like a super downer for Ruben (obviously the situation is, but the film doesn't dwell on it like some grand tragedy), and all of the performances are on point.  Ahmed's  drumming is done in a way to seem believable and to mask the fact that Ahmed is, well, an actor and not a drummer.  This is a minor point, of course, but if the movie is about a drummer the actor needs to be believable as a working drummer, and Ahmed, as well as the director and editor, accomplish that task.  Too often I get annoyed when movies about drummers feature actors who _barely_ look like they can convince non-drummers they're competent, let alone excelling (I'm looking at you THAT THING YOU DO, WHIPLASH, ROCKSTAR, and many others).  This is obviously my own (any likely other drummers) problem, but it should be commended that SOUND OF METAL does a good job of portraying Ruben as a good drummer through solid 'acting' by Ahbed and subtle (maybe not obvious to the laymen, but obvious to this dummer) editing and film shooting techniques.\n\nI've lost about 25-30% of my hearing in each ear myself; while I'm fortunate currently to be able to adjust with hearing aids, I have some sort of degenerative affliction that is getting worse, regardless of what I've done/will do to maintain 'safe' listening environments.  I don't gig anymore like I did as a teenager/young-20 something adult but I am music teacher constantly around bands and percussion ensembles.  I'd noticed my hearing devolving for probably at least 15 years before I _FINALLY_ did something about it: I waited until I had turned 40, thinking \"well - I guess 40 is kind of old so it's time to get a hearing aid like grandpa\" or something.  This adjustment has been difficult at times, but easily one of the best decisions of my life.\n\nI say this only to underscore the difficulties Ruben has, going from a nightly-drumming professional musician to suddenly unable to hear a conversation from his girlfriend, let alone continue pursuing his passionate work.  Riz Ahmed does an INCREDIBLE job portraying this character & his hearing loss.  You can feel the confusion, pain, and frustration every step of the way.  Ahmed is a music performer in his own right, releasing several wrap albums over the last decade or so.  I'm sure he was able to draw on his own passions as a performer in order to portray the pains and frustrations of Rueben being unable to drum.\n\nBut, really, the sadness and frustration is mostly the first Act of SOUND OF METAL.  At the recovery house Joe hooks Ruben up with a class of children, where Ruben interacts with kids, becomes comfortable learning American Sign Language (ASL), and starts teaching the kids basic drumming.  Seeing Ruben start to come alive in his current situation is a legit joy!  When Ruben catches up with Lou, and sees she's pursing her own music passions elsewhere, Ruben decides to sell off his drums and recording equipment to have the cochlear implant surgery.\n\nThe film centers around Ruben trying to find himself instead of chasing what is in the past.  SOUND OF METAL has (inadvertently) become an incredible metaphor for living in the COVID/post-pandemic world.  Those who are still trying to live with the habits of January 2020 in January 2021 are going to be miserable: lamenting what we used to have and what we used to be able to do.  Myself, I've gone from producing award-winning percussion ensembles, and co-producing various types of HS bands (marching, concert, jazz) to moving to a mostly virtual world.  My family used to go to Disneyland regularly, and we haven't seen any family members in person since Christmas 2019.  Like Ruben, it's normal, understandable even, to want to be down that we're in month 10 of a nearly nationwide lock-down from our norms with no end in immediate sight.\n\nRueben gets the implant surgery, but he essentially has to leave the deaf addict recovery house.  Joe stated Ruben shouldn't try to reduce his deafness as a disability that needs to be overcome: he should instead embrace it and learn to adjust.  Ruben defies this ideology, gets the surgery, and then flies out to Europe to see Lou, now living with her wealthy father in Belgium.  But of course Ruben learns quickly that the cochlear implants do not supply \"sound\" the way his brain naturally interprets sound: they \"mimic\" human voice in a metallic, almost robotic voice and there is much distortion for moderate volume sound.  He listens to Lou perform a song, hearing massive distortion throughout, and Ahmed brilliantly captures the moment Ruben realizes \"he could never go back,\" so to speak.\n\nAnother technical aspect I have to give a shout-out to is the sound design.  Through merely sound the filmmakers do an incredible job of conveying the struggles Ruben is going through.  Portraying deafness can be difficult, as most of us are not stone-cold deaf, sitting in stark silence.  There is often some degree of distortion or white-noise (or tinnitus) when the film is portraying Ruben's point of listening, and later in the film after Ruben gets his implants activated, we get a sense for the 'metallic' and distorted (and still quite faint) sound Ruben is experiencing.  Often loud explosions and shootouts garner \"sound effects\" or \"sound effects editing\" Awards, but I think SOUND OF METAL (a clever pseudo-pun of a title, being both the style of music Ruben & Lou play as well as the types of sound Ruben hears with the implants) is deserving of recognition for its brilliant sound design and execution prorating hearing loss + life with cochlear implants.\n\nThe films ends just as the 'new' Ruben begins: when he realizes to let go of trying to hear the way he used to.  He unplugs his implants after hearing the distorted sound of church bells.  This is a great metaphor for what he ALL must do in a post-pandemic landscape.  We have to let go of how things used to be, and how we used to behave (for ex: I doubt I'll shake very many hands ever again) and embrace our \"new normal.\"  As an educator, I've had to learn all sorts of new technology and teaching tools that I plan on implementing into my curriculum for the foreseeable future: regardless of when I'll be able to teach in person to all my students at the same time.  Ruben looks to be on the path to happiness again when he embraces his \"new me,\" and only when we're ready to do the same can be begin our journey to contentment and real joy.",
            "review_date": "2021-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the film brings a different point of view and is certainly impactful but does not excite or exalt",
            "review_date": "2021-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sound of Metal has an interesting subject that feels even more interesting with Riz Ahmed acting.",
            "review_date": "2021-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie with an original idea for a story!  Raz Ahmed gets a well deserved Oscar Nomination for his performance.  This movie gives the viewer a sense of what it's like to be deaf.",
            "review_date": "2021-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The thought of a heavy metal movie put me off but soon I realized that was not even remotely what this movie is about.  A heavy metal rocker loses his hearing and what results from that is a moving story of how a person handles a sudden handicap especially when your life's focus is gone.  Riz Ahmed's performance is Oscar worthy.",
            "review_date": "2021-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's all about Ahmed's stunning performance...",
            "review_date": "2021-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed's performance helps shed some light on what it's like to go deaf. The story is good, but can feel like it drags at times. The film is reliant upon the actor's performances. I was expecting a little more based on the movie's initial reaction.\n\nIt's definitely a good film - 7.5/10",
            "review_date": "2021-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed and Paul Raci give great performances. Well directed with great  sound editing, it's one of the best films of 2020.",
            "review_date": "2021-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie with exceptional acting, and spectacular sound design that falls flat with a overly simple and possibly even pretentious story line. Everything is written beat for beat, with classic themes, such as acceptance and... oh that's it.  It's very much Oscar material, but mainly because it's simple and doesn't discover anything new.  At 2 hours long, the film doesn't use its scenes efficiently, and chooses to focus on the intricacies of being deaf, rather then the prominent theme of being good enough on your own. Because of this I can really only commend this film for being a great education on what being deaf is like. Overall, I would recommend watching. 7/10",
            "review_date": "2021-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie.  Heartbreaking but I enjoyed the story and the acting.",
            "review_date": "2021-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The way that Marder manipulates the sound within this film to compliment Ruben's journey with his hearing loss is beautiful and visceral for the audience, enhancing our understanding of what he is experiencing. The scenes within the school and community were uplifting and beautifully juxtaposed with Reuben's experience in the wider world. Whilst all the cast within this film were wonderful, Riz Ahmed truly excelled as he always does, delivering a poignant and nuanced performance deserving of every award available.",
            "review_date": "2021-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A drama about a heavy-metal drummer whose life is thrown into freefall when he begins to lose his hearing, which leads him to think his life is over. It was an extraordinarily absorbing and immersive experience with a great sound design that perfectly evokes and shows how the deaf community lives and it makes the viewer understand their situation as something completely normal for them. It is an unexpectedly quiet movie but the silence has its purpose. Riz Ahmed's incredible performance is entrancing and kept me in such a state of shock and empathy for the character. A very emotional movie due to its realism that really made an impression.",
            "review_date": "2021-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much like the drummer in a band, Riz Ahmed is the backbone of Sound of Metal. His performance in this movie is what makes it so relatable and realistic. This film also uses creative sound editing to give the viewer a sense of what it's like to be hearing impaired. Sound of Metal is a stressful, yet hopeful cinematic journey created by a talented cast, a capable director, and a convincing script.",
            "review_date": "2021-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The sound of metal\" is a film that seeks to portray the anguish caused by a sudden hearing loss, and manages to do that very well.\n\nTelling the story of a drummer from an indie band who lives with his girlfriend (vocalist) on a motor home giving presentations by the country, the script in its first layer seems simple, but as the work progresses, the characters are deepened and we are feeling a commotion for the lives of the protagonists, script and direction work together to compose a narrative that deeply scales the sentimental level of the plot.\n\nThe direction is good, with an emphasis on the opening scene, the good use of photography and lighting and the incredible use of sound mixing, which is often used even as part of the narrative of the work, causing a great immersion\n\nAll performances are good, but Riz Ahmed is spectacular, the actor's job is to deliver and deep knowledge about his character, we have a performance that goes through the most diverse personalities of a single individual, and even in the simplest scenes the actor managed to give a realistic and painful look to your character, the Oscar nomination is very fair.\n\nThe work of the inexperienced Darius Marder is very interesting, it is very clear that the director wants to cause a great immersion to the viewer, and he manages to do this from the first scene of the film, and whenever we get distracted he finds a way to put the people back into the movie, these details are present in the protagonist's tattoos, and even in the detail of sign language, where the director takes the caption from conversations in pounds and only replaces it when our protagonist learns the language, without speaking the feeling of subject of the environments that we can feel, are details of those who thought a work, but not everything is perfect, the film has a belly in the second act, and despite the good and very brave ending we have some errors of coherence in the journey, however \"The sound of metal\" is a pleasant surprise. Grade 08/10",
            "review_date": "2021-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When we loose one our senses our adjustment will make us better. This is a moving story about a person who looses his hearing. ",
            "review_date": "2021-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are a lot of good things about this film. To start with, the initial scenes where Ruben (played by Riz Ahmed) starts to realize that he is losing his hearing ability was emotionally breaking to watch. Watching Riz Ahmed as Ruben was just amazing. Riz has given a spectacular performance. The sound mixing and editing were outstanding. There were a lot of feel-good moments in the first half of the film. The thought of not using any background score in most parts of the film but instead having natural sounds play out like the breathing of the actors and chirruping of birds was mind-blowing. It also shows the various struggles faced by the deaf community and how they try to overcome them. The ending acts as icing on a cake. Brilliant performances along with the strong technical aspects and raising of awareness about the deaf community make Sound Of Metal a must-watch.",
            "review_date": "2021-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn't really go anywhere. Plodded along and not much of a payoff.",
            "review_date": "2021-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Without treading too deep into familiar territory, sound of metal graciously commemorates the dead community with its authentic acting and sound design.",
            "review_date": "2021-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent drama about finding tranquility when everything is in motion. Riz Ahmed and Paul Raci are both fantastic. It's a beautiful and sad tale, but not without hope. Great sound editing make this character study a profound piece and knowing deaf people, many of the messages hit close. The beginning is a little rocky, but things move quickly, and there were tears.",
            "review_date": "2021-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed is outstanding. The sound design is too. I think it loses itself a little bit towards the end, but the first hour (and a bit) is nothing but heartbreaking, hopeful brilliance.",
            "review_date": "2021-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not sure if I've ever heard such an amazing sound design before. It takes you down right into the agony the main character - a drummer that's losing his hearing - is going through. Riz Ahmed does an amazing job with his powerful, but yet intimate and sensitive performance, with a little help from the script, that doesn't fall on melodramatic grounds, and instead, it focuses on our main character's perspective and journey, delivering a solid, emotional drama, always sensitive and faithful to its subject matter.",
            "review_date": "2021-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerfully acted and sombre drama. I can't say it's one I'd be in a hurry to watch again though.",
            "review_date": "2021-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting and engaging story without any false moves. Deafness is not included, let alone featured, in movies and it was so well depicted. Excellent acting.",
            "review_date": "2021-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must watch film of this year 💯 The film explores the reluctant journey of a musician who loses his hearing 🎸 The cast brings out performances that are real and honest. Riz Ahmed beautifully captures the inner turmoil of a musician trying to finding acceptance in silence 🍃  Paul Raci brings a touching performance abounding with compassion ❤️. The editing and sound design is immersive and brings the audience into the perspective of a deaf man. Yet doesn't feel overdone as it maintains the perfect balance between the muffled ambience and natural clear sounds. 🔉 The direction and cinematography are subtle 📽️  Yet powerful, especially with the nature scenes 🌲. The film will leave you with a deeper appreciation for the people and silent moments in our lives 🕊️",
            "review_date": "2021-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant. Sound of Metal is a great movie overall, but the lead performance is fantastic. I believed he was living this experience. It's worth the watch.",
            "review_date": "2021-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The performances are very real, but it doesn't explore the potential of an amazing set-up - apart from a couple of tender moments, it stays a promise of a really good movie.",
            "review_date": "2021-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Disjointed and slow. The parts that focused on his stay in the deaf community were indeed powerful & moving.",
            "review_date": "2021-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Debut feature of a Derek Cianfrance collaborator, who has a similar naturalistic style, Sound of Metal is an intimate, emotionally heart wrenching physical experience that may break your heart. Riz Ahmed's performance as a metal drummer losing his hearing is rare, as is the movie.",
            "review_date": "2021-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautifully done film with a powerhouse award-worthy best actor performance by Riz Ahmed as a heavy metal drummer who suddenly goes deaf. The 2 hours goes by quickly as everything from the editing to the cinematography to the sound engineering to the great acting are all flawlessly executed. Definitely want to see much much more of Riz Amed in upcoming films. It is clear he has range and talent, and is way up there on the list of finest actors ever. The look at the deaf community was insightful and endearing and positive. All around well done film.",
            "review_date": "2021-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heavy metal drummer Ruben, played marvelously by Riz Ahmed, suddenly and unexpectedly losses his hearing. A former addict, Ruben leans heavily on his girlfriend Lou (Olivia Cooke) rather than substance abuse, to help him through this life changing event by distraction as opposed to confronting the problem. Lou, realizing the severity of the situation and being more pragmatic, encourages Ruben to go to a deaf community to adapt to his change in lifestyle. Director Darius Marder does a wonderful job putting the audience in Ruben's shoes while at the community. Immersing the audience into how it feels to not only be deaf, but being the newcomer in a foreign environment. Naturally, Ruben runs the gamut of emotions from frustration of not knowing sign language and being excluded from every activity upon his arrival, to isolation, anger, loneliness, and heartbreak. A gutting movie about self-reliance and self-sufficiency with strong performances all around. A shout out must also be given to Paul Raci, who plays Joe, the leader and mentor of Ruben at the deaf community. Definitely worth checking out on Amazon Prime.",
            "review_date": "2021-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed Gives Top Performance as a Musician Whose World Goes Silent: \"Sound of Metal\" stars Riz Ahmed (\"Nightcrawler\") as Ruben, a heavy-metal drummer and recovering addict whose world goes silent due to severe and sudden hearing loss. The film follows Ruben's journey, a man whose life was given to music, now struggling to deal with and accept this new world gone quiet, filled with muffled and limited sounds. Ahmed's powerful and dignified performance is one of the year's best.",
            "review_date": "2021-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A heavy metal drummer and recovering addict loses his hearing almost overnight, and has to adjust to deafness. While the main character, Ruben, is living at a shelter for deaf addicts his girlfriend/bandmate moves on with her life and he has to decide if he wants to rekindle their relationship or start a new life as a deaf person. I don't watch a lot of arthouse cinema, but glad I took the time for this film, I thoroughly enjoyed it. Deals with pretty heavy themes without being depressing. Powerful acting and brilliant sound design – a lot of the film is heard from Ruben's perspective.",
            "review_date": "2021-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "without a doubt, the best movie to come out in 2020.",
            "review_date": "2021-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible. Complete waste of time. Nothing exciting. Just boring ",
            "review_date": "2021-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bringing up a deaf people problem, was really good blended in a drumer character. Couldn't be more clear and simple.",
            "review_date": "2021-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was brilliant. If you are a fan of music, this is for you. If you are a fan of living and life? And appreciating what you have? This is for you. Imagine a day that comes where you cannot hear the sounds around you? You can't listen to the music? And you hear... Nothing.\n\nIt makes you appreciate what gifts you are given. Watch this movie. The story is brilliant. The music is amazing. And the acting is incredible. A must-see. You won't be disappointed.",
            "review_date": "2021-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sound of Metal is an intelligent movie with a great deal to silently and noisily say. Ahmed goes from strength to strength with his performance here. The tune of this film will certainly stick with you.",
            "review_date": "2021-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is superbly shot! The audience goes on the unique and life changing journey as Rubin. Brilliant. Love the relationship. Beautiful pure. The acting is brilliant that's why I can go with some of the flaws like why Rubin was left at a halfway house that treated him like an active junkie. She kinda flees when he goes deaf. . I fell in love with Rubin's resilience and fight for life. The actors sell it all to you. There is so much right the glaring wrong I can go with.  I am disappointed we don't know the direction Rubin takes.  I want him to be okay.  I want to see Ahmet in more films for sure.  Worth seeing. It has some truly unique aspects to it. I understand the deaf community better. I'm better for it to face my own challenges. Perfect timing for me.",
            "review_date": "2021-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really great movie. Holds your attention, deals with a lot of issues. Fabulous actors. Loved this one.",
            "review_date": "2021-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spoilers: A layered and penetrating look at life, at adapting to change, and even a peek at why people are like they are. This is not just about heavy metal drummer Ruben (Riz) or deafness or addiction or his girlfriend -- his duo's singer, Lou, who more screams than sings. I almost quit the movie early on, as it was just loud noise. But it was just brilliant scene setting, suggesting there is too much noise for all of us and not just  aural noise. The noise did harm Ruben and made him deaf. And not just the heavy metal noise, but all the noise in his life, the heroin he kicked four years ago, the constant on-the-road in a big RV. He went from hearing to deaf in an instant. And a doc told him the hearing wasn't coming back, though a cochlear implant could bring back some hearing but was expensive. He opted to try a group home run by a deaf Vietnam vet, as Lou had to leave to let the program work. We find she grew up here after originating in Paris, as her parents split up not long after, and Mom took her to the states and Mom finally killed herself,  which apparently pissed Lou off enough to spend her nights in the tiny band, screaming at the top of her lungs, playing metal guitar loud as Ruben  played the drums loud, he also  pissed off, having been raised by a single mom and at some point gotten hooked on heroin. The vet who tries to get him to a quiet place, no noise, where he can be at peace with himself and therefore his god, cuts him loose from the program, where no one is seen as handicapped even though deaf, as Ruben opts to try to fix it with the implant, after selling all he has for the operation. He gets some hearing back, heads for Lou, now in Paris, and they agonizingly and in not so many words decide their relationship and indeed their lifestyle is over. At the end Riz decides to take off the implant, to remove the sound he gets from the metal appliance, and just sit in silence maybe for a long time. We all adapt as we age to literal hearing loss or hip malfunction or fighting heart or cancer ailments, some of which we contribute to  ourselves with our own noise. This asks the musical question: Can we adapt and live in peace with the way we are now? Maybe the best thing that happened to Riz, who should win awards for this, is going deaf. It made him take stock of his  angry, noisy life going nowhere, and find a more quiet, peaceful place to reside, in both his decision-making and behavior. The noisy lashing out in anger is no way to live. The deaf's saving grace may well be that they don't have to listen to all the literal and figurative noise out there.",
            "review_date": "2021-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Portrait of Riz ought to get the best performance Oscar if Oscars does not follow the usual wrong judgement. Excellent drama and well made with all cast do true to life performances.",
            "review_date": "2021-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After all the immense buzz and positivity surrounding this film, it still blew me away by how well-done and emotional it is. For a film that deals with mature and complex subject matters, it is just full of warmth and heart, and not in an overly sentimental and syrupy way, but more of in a well-meaning and incredibly respectful kind of way. Its representation of the deaf community is both empathetic and enlightening, and proves that there should be more high-profile films that focus on its members. Riz Ahmed absolutely owns this role in what is possibly 2020's best performance, and is perfectly supported by Olivia Cooke (who is one of my favorite up-and-coming stars) and a phenomenal Paul Raci, who absolutely deserves every trophy he wins this year. The sound design is also some of the most innovative I've ever seen (or I guess heard) in a film, skillfully and authentically recreating the devastating experiences of hearing loss. The direction and screenplay are also spectacular, as both are very minimalist and low-key but ultimately impactful and universally relatable. I sincerely hope that this film gets a lot of recognition not only during awards season but for years to come, because it is absolutely something that everyone should see.",
            "review_date": "2021-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alright, so I went into this not expecting much. I've heard a thing or two about Riz Ahmed's performance but nothing else. The movie's about a drummer that loses his hearing after forcing himself to perform too much, and gets to know the world differently as a deaf person as a result. Let's get the first things out of the way, the movie is really well made. I really enjoyed Marder's direction here, providing us with some really good visuals. The cinematography is good, and the tone of the movie is direct and straight to its point. The acting is indeed really great, Ahmed showing his range in here, as well as his sign language, drumming and american accent. What this movie really nails is the mixing and overall sound. Since they worked with actual deaf people on set, they knew how important it was to get this aspect right, and so they did. The moments of silence and the muffled sound when the camera closes on the protagonist feel so real and it really puts you in the position he's in, which is great in this type of film, and hands down my favorite aspect here. The plot though, is a little bit messy to begin with. We get little background on our characters here, apart from a brief backstory for some of them. Our main character's past is an enigma, hell, we don't even know how old he is. That's not a big issue here, since the point of the film is the matter at hand and that is losing his hearing. Towards the middle of the movie there's a time jump, suggested by a few shots of landscapes and skies. With that time jump we lose a pretty big chunk of character development for our protagonist, seeing him go from being rejective to Joe to being in complete harmony with everyone. I wish we could've seen how he got to the point where he started to fit in, it would have given some nice depth to Ruben. One of my favorite characters in this movie is Paul Raci's Joe. We get some background on him, and he is established as Ruben's guide to understandng his situation. Again, the fact that this film used real deaf people made this all the more believeable and enjoyable to watch. I did enjoy this movie, despite the slow pacing and some things that went unasnwered and unmentioned. I would say this is one of the better movies of 2020, with a really good message especially with the ending, which I really liked. Sound of Metal is a good watch, one I'd recommend to anyone who likes a good drama. But I doubt the rewatchability of this, and for more critical people, the aspects I've mentioned might take from the overall enjoyment of this movie.",
            "review_date": "2021-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible. Beautiful. Lead should win an award. I felt every emotion watching this.",
            "review_date": "2021-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Sound of Metal\" (USA, 2019) is a drama, directed by Darius Marder (Place Beyond the Pines) and written with the also director Derek Cianfrance (Blue Valentine, Light Between Oceans) that is the author of the story.\n\nThe story follows Ruben, the drummer of a Death Metal band, that plays and lives in a van with his girlfriend and vocal Lou on small gigs, and is starting a career.. Suddenly he starts to lose his auditions, and the movie shows the struggle in his life to adapt to the situation and search for help, with the possibility of recovery with a cochlear implant surgery, but not having the money to do the surgery. All the stressful situation leads to a separation of the couple, with Lou continuing the gig and Rubin reluctantly agreeing to seek help in a deaf community to better learn to deal with the handicap.\n\nThe plot is intense on emotions, and shows in a realistic way the drama of losing the sense that was essential to Rubin - all the story revolves around this character, and especially from the middle to the end of the movie, the personal drama intensifies, even with the contemplative silence that occupies most of the film, or the sounds of the implant that he acquires later. The scenes that show the adaptation in the community(that uses deaf actors) is absolutely great.\n\nThe movie has Riz Ahmed as Ruben Stone (Rogue One, Nightcrwaler, The OA,The Night Of), Olivia Cooke as Lou Berger and Paul Raci as Joe (interesting that he had a deaf father in real life). Riz is just awesome on the paper, that involves showing the emotions, despair and anger to the silent parts of the individual learning, dealing and acceptance of the situation. Indeed something that deserves the prizes and indications for best male performer. The def community used deaf actors and that elevated the veracity of the story.\n\nThe cinematography by Daniël Bouquet (Nothing persona, Kaubow) is pretty competente, taking a more realistic like approach, with a nervous camera, focusing very well on expressions and situations that are really important in the context. Another great detail is the sound department, with the sound of deafening sense and later with the implant sounds transmitting well the sense and situation of the protagonist that leads to such emotions that he feels. \n\nOverall a great drama, with an intriguing and engaging story, without the load of melodrama that depicts in a realistic way the situation and the study of the protagonist, with the help of an excellent performance and use of sound department on the production. A solid 7,5 out of 10.",
            "review_date": "2021-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just saw it and I'm absorbing this film.  I guess I'm still wondering how I would act if my world was turned upside down and my profession was taken away all in a few days.  The movie is a little like life.  It does not play fair at all and does not always end as we would like it.  The question remains unanswered in the end.  Where we go from here",
            "review_date": "2021-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Sound Of Metal may very well be the best film of 2020 when it comes to Original Screenplay and Performance by An Actor. This film will give you lots of emotions which makes it even better.",
            "review_date": "2021-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It seems like they've helped each other out through some tough shit in their lives. She's got razor cuts all down her arm. She's definitely got problems and then all the screaming during their live show. I'm sorry, but Lou looks so ridiculous with her bleached eyebrows lol. \n\nGod damn, it must feel terrifying to start losing your hearing all of a sudden. Especially if what you love doing in life and your career require it. Fucking brilliant how they used different effects and sounds to show what it would feel like to suddenly start losing your hearing. The frustration and anxiety one must feel, I can't imagine. \n\nWow, it's almost as if he's living in a completely different world now where the language everyone speaks is foreign to him. Real sweet seeing him adapt and accept his new life of being deaf and building a relationship with the kids. Kids can bring out the best in you. Holy shit, that was crazy how they just cut to him getting the implant surgery. Kind of sad to see how Lou moved on with her life and Ruben is still trying to hold on to what they had when they were touring and living in the RV. The deaf community place was his new home, that was his new world where he eventually learned to adapt and be happy. \n\nJeez, what a depressing song to sing for one's birthday. It's almost like she doesn't like singing the song but is forced to sing it. So sad when he tells Lou that it's ok. That was the official moment when they disbanded the band and went on with their lives. I'm glad he was able to find peace at the end. Now he can movie on with his life. Who knows what he'll do next. Will he go back to the deaf community or move on to unknown territory. My guess is he'll go back since what he was seeking the whole time was the familiar, what he already knew. He came to terms with his new life and accepted it for what it is. \n\nI already knew going in that this was going to be one of those hard-hitting dramas, and boy did it hit hard. This movie gave me anxiety. Smartly written and powerfully acted. All the nuances and subtleties definitely didn't go unnoticed. Beautiful character development. Very impressive how Riz actually learned not only the drums, but also sign language. Watching this movie, I couldn't help but feel thankful that I have my hearing and my sight and all other senses intact. We kind of take for granted these things and it's always nice to be reminded of how fortunate and lucky we are. Extremely sobering and definitely impactful movie. This movie's a bit too real for my taste though, so I don't think I'm watching it again.",
            "review_date": "2021-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really great film and it's just like \"The Ultimate Playlist of Noise\" from Hulu but heavy metal if you ask me.✔🥓🥓🔥🚀",
            "review_date": "2021-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Darius and Abraham Marder gave their cast an excellent screenplay. Darius Marder showed the deft touch of an experienced, patient director. His use of sound brought to life the reality of someone like Ruben losing not only his sense of hearing, but the stability of the life that he had put together with Lou. It also shows how much can be expressed without sound, without actual speech.  \nWe see a segment of our population I very rarely see now, which I find odd. Lead character Ruben is told by Joe at the support group that for himself and the other deaf members, their condition is one to accept and  learn to live with rather than something that defines and controls them, and certainly not something one must fix. But Ruben doesn't want to hear this; or at least he doesn't really listen to what it means. \nJoe is played by Paul Raci, who is great, even though he spends much of the movie looking like Michigan J. Frog in front of strangers. Olivia Cooke as Lou is always so good. This last year or so has been heard reward for all the hard work and skill she has shown in other works, from Bates Motel to Thoroughbreds and Little Fish. \nBut this is Riz Ahmed's movie. Since seeing him in The Night Of, it was clear how good he was already. I've known some guys like Ruben- headstrong punk guys, hot-headed, struggling with accepting change.  Ahmed  shows us all of that in a brilliant performance. His final scene with Cooke, as they both are admitting the reality of what has changed with them without having to say it is an excellent showcase of acting but also a prime example of 'show, don't tell'. \nIt's so good to see Ruben get that moment of stillness finally. 4 stars",
            "review_date": "2021-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It silently pushes the whole PC theme of people with disability should not try to pursue options to correct their disabilities if science and medicine has options. It even has people who are supposed to be caring individuals shun someone for trying to correct their disability. Then it just ends with the main character just losing everything and shows him realizing that he should have not pursued his old sense of hearing.",
            "review_date": "2021-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not really worth the time to watch.",
            "review_date": "2021-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really good exploration of what it means to be happy/fulfilled and be living your life whether you're fully in control or not. Particularly pertinent right now, as so many of us are unable to live the life we want to. Of all my senses, my hearing is the one I fear most losing at some point in life, which makes this all the more powerful for me.",
            "review_date": "2021-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a phenomenal movie.  The acting is top notch. Without spoiling it, Riz Ahmed is fantasic as Ruben, a metal drummer who loses his hearing, and his life learning to deal with it.  Olivia Cooke is equally fantastic as Lou, his girlfriend.  Everyone in this movie is fantastic.  I highly recommend this great movie.",
            "review_date": "2021-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wasn't especially impressed with the script but Ahmed's performance keeps you entirely engaged.",
            "review_date": "2021-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed and Paul Raci are amazing actors and so good in this movie - it's obvious that they poured their heart into this role. The sound design is the 3rd star of this movie and you feel immersed into Ruben's world right from the start. I also appreciate that the movie makers hired actors / experts from the deaf community to act in it and consult on it, so I believe it is authentic and sincere. Ahmed and Raci definitely deserve all the accolades!",
            "review_date": "2021-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A total new perspective of the usual movies about rehab, with an incredible sincere performance from Riz Ahmed and a Paul Raci very committed with his work, but the special part here is the portrayal and presentation of the deaf community... It is very rare to see a movie with American Sign Language and especially, treating deaf as something normal and not a disease... Kudos for the sound design, that provides to us the feelings of losing hearing and the metal from the implant, that is very creative and givesthe film one of its uniqueness.",
            "review_date": "2021-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent performances from all. Bittersweet story about loss and the journey toward exceptance ",
            "review_date": "2021-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spectacular performance from Ahmed. The film is two hours long and not much actually passes in terms of significant plot points, but the viewing experience goes by in a flash with such brilliant acting and storytelling. The themes of growth and finding beauty in a new world really resonate. The most emotionally moving film that I have seen for some time.",
            "review_date": "2021-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Full of real human moments, raw and beautiful",
            "review_date": "2021-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unique story, great acting, and a sexy lead.",
            "review_date": "2021-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Act 2 is good but Act 1 and 3 just don't cut it. There are large narrative holes here too. Riz and Paul are great though.",
            "review_date": "2021-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it! Riz Ahmed was excellent!!",
            "review_date": "2021-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most accomplished films in recent history, Darius Marder's Sound of Metal is the best iteration yet of a well-known premise: a musician going deaf. We have seen this subject before, most recently with 2004's It's All Gone Pete Tong, but never with the grace and wisdom that Marder tacitly bestows upon this film.\n\nWe follow the story of Ruben, the drummer of his and his girlfriend's heavy metal band, as his whole life is being shattered by his imminent, utter and complete deafness. The two of them are played by Riz Ahmed and Olivia Cooke. She is fantastic in one of the film's several remarkable supporting parts, but the true star of the film is Ahmed in a career highlight, effortlessly creating a compelling, relatable protagonist and  driving the story forward with his enormous emotional range.\n\nIn what is essentially a tale of transition, Marder delves into the actual truths of the deaf community with disarming realism, while the film's scope feels personal, yet universal. So unflinchingly honest with its real world subject, no one should miss this gem of a film, which I suspect will age like a fine wine.",
            "review_date": "2021-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When our dreams and the life we know evaporate in an instant, we may find it next to impossible to adjust, as is the case in this engaging drama about a heavy metal drummer who is faced with losing his hearing. While this offering has a little trouble finding its footing at times, it nevertheless takes audiences through the challenges associated with hearing loss and an addict's struggle to maintain sobriety in the wake of profound change. The film also skillfully delves into matters of adaptability and self-acceptance, as well as learning how to see \"disabilities\" as differences, not handicaps, qualities with the potential to give us new and unconsidered perspectives on life. All of this is brought to life through the fine performances of Riz Ahmed, Olivia Cooke and Paul Raci, as well as an inventive sound design that truly makes an impact on viewers. One of the year's best.",
            "review_date": "2021-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an emotional experience it is to watch \"Sound of Metal\".  The acting from Riz Ahmed is flawless and is so full of high and low peaks.  It is the heart and soul of this film and is undoubtedly Oscar worthy.  He plays a young heavy metal drummer who is quickly losing his hearing, making everything in his life crash and burn.  When he arrives at a home that helps the deaf cope with their world, the film really soars.  It is one of the years best performances and one of the best films as well.",
            "review_date": "2021-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A meditative film with impeccable sound design. It's rooted in a really intriguing relationship between Ruben and his girlfriend, and the themes of addiction adds welcome complexity that keeps you invested in these characters",
            "review_date": "2021-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz might have given my favorite performance over the last 2 years.",
            "review_date": "2021-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "gorgeous movie. riz ahmed with a stunning performance. paul raci does a phenomenal job as a supporting actor",
            "review_date": "2021-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very engaging plot and what an excellent performance by Riz Ahmed, A Must Watch!",
            "review_date": "2021-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extraordinary performance by Riz Ahmed. Fascinating and heartfelt journey through a life changing experience such as hearing loss. Very well done. One of the best movies of the year.",
            "review_date": "2021-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great performance by Riz Ahmed.  One of the best, if not the best movie of 2020.",
            "review_date": "2021-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "INCREDIBLE. BEST PICTURE WORTHY",
            "review_date": "2021-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed and Olivia Cooke are amazing in this. It's a rare movie with a person in recovery that doesn't center around a relapse and does a beautiful job of touching on the different aspects of his character without trying to \"fix\" anything.",
            "review_date": "2021-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So. Fucking. Moving. The best film I've seen in quite some time.",
            "review_date": "2021-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good story, good acting, and I can't imagine if I suddenly got deaf",
            "review_date": "2021-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice movie who give me such a inspiration. The performance from Riz Ahmed is very-very nice. Actually, this is one of the best movie in 2020",
            "review_date": "2021-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ambitious and daring without being the least bit forced in its execution, Sound of Metal offers an honest but quite moving look inside the Deaf community with a strong narrative, passionate direction from newcomer Darius Marder, and a tour de force performance by Riz Ahmed, this is one Metal show not to be missed!",
            "review_date": "2021-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed gives us one of if not the best performance of the year",
            "review_date": "2021-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sound of Metal is a journey into one man's crisis. The sense that means the most, is gone; the instantaneous loss of hearing, for a musician, gone. The denial, as Ruben tells Lou, I will just continue on, as before.  The acceptance, as he moves towards recovery. Then returning once again to denial and then a return to real peace.  It's has a brilliantly written  Screen Play, by Darius Marder and Abraham Marder. The lead character of Ruben was performed,  \nVery Convincingly by Riz Ahmed. Also, supporting actor Paul Ravi   gave a stellar performance as a deaf counsellor. It is so fascinating to look into recovery for people also have a hearing loss.",
            "review_date": "2021-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn't know anything about it before watching. It was so powerful and surprising.",
            "review_date": "2021-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unusual and unpredictable. Loved it.",
            "review_date": "2021-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In his directorial debut, Darius Marder addresses a subject to which Hollywood hardly pays any attention and which is also not given enough awareness in society. Sound of Metal tells the story of the young drummer Ruben, who is on tour with his girlfriend and pursuing his dream of becoming a musician. Of all things, this passion becomes Ruben's undoing when he suddenly loses most of his hearing. As a result, his life is no longer the same and he embarks on an adventure for which he is not really ready.\n\nRuben is embodied by Riz Ahmed. He is the clear protagonist of the film and appears in every scene. His journey from a dreaming drummer who has the seemingly perfect life with his great love to a deaf depressive who wants to return to that life is fascinating to follow. Ahmed plays this complex character with great subtlety. But he can also boil up from 0 to 100 in some moments and give free rein to his feelings. His multi-faceted performance makes it easy to understand his situation and to sympathise with him. Ahmed totally captivates you and represents people who have suffered the same fate with a lot of dignity. Olivia Cooke, as Ruben's girlfriend Lou, only has a few scenes at the beginning and at the end. Still, it's enough time for Cooke to introduce us to her equally complicated character in a way that we can understand her as a relative. Another terrific performance is delivered by Paul Raci as Joe, Rubens' also deaf mentor. He runs an association for the deaf and acts as a sort of father to the members. He acts very calmly and emotionally, especially in the heart-warming dialogues with Ruben, though there is always a certain toughness and honesty in there. His chemistry with Ahmed is the highlight of the film. As a veteran who has long since come to terms with his situation, he sees himself in the newcomer and wants to show him that deafness is not a curse.\n\nSound of Metal sends an enormously important message and is hopefully a wake-up call towards Hollywood. Over the 120-minute running time, it's clear that this film was a matter of heart for Marder and the ensemble. As a result, much of it lingers for days afterwards. This fact makes the film-experience all the more beautiful and real. Real is the word that best describes Sound of Metal. Every scene seems realistic and probably takes place in real life in exactly the same way. The slow, almost still pacing in the middle of the film can seem boring, but is very important for the film's authenticity. Sound of Metal is a film you have to see to get a slight insight into the life of this fundamental group of people.",
            "review_date": "2021-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Between an impassioned, frustrated performance from Riz Ahmed and experimental, suffocating sound design and mixing, the film fires on all cylinders as it examines the unexpectedness of change.",
            "review_date": "2021-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice character development but not one of those \"feel good\" films",
            "review_date": "2021-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excellent showcase of Riz ahmed's acting ability! Overall the movie was very well written. I would recommend watching it but it's a bit of a depressing story.",
            "review_date": "2021-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Depressive and slow movie, made for hipsters who think that are smart watching this kind of shit. A waste of time.",
            "review_date": "2021-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The scariest film of 2020 isn't a horror movie, but a drama called Sound of Metal. In what is truly a disturbing first act, this movie portrays a drummer who abruptly starts losing his hearing, and it was filmed in such an intense, heartbreaking manner that I really felt his pain. The rest of the movie is all about his copying with his new state while the ending itself is incredibly beautiful and deeply moving. The sound here is impeccable as it brilliantly lets us in on how Ruben hears the world while the incredible turn from Riz Ahmed is unquestionably the best actor performance of the year.",
            "review_date": "2021-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent performance from Riz. I thought the first half was better than the second half but still worth watching.",
            "review_date": "2021-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie so much. I appreciate how endearing the lead character is.",
            "review_date": "2021-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touching and entertaining.",
            "review_date": "2021-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was incredible. Its meticulous crafting invokes empathy within its non-hearing impaired viewers to better understand how folks with auditory disabilities might be struggling to integrate in our society.",
            "review_date": "2021-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touching movie with heart and soul",
            "review_date": "2021-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A real emotional, character driven film. The performance by Riz Ahmed is spectacular. The sound editing to put the viewer into the head of the character is something truly amazing. Both of these are Oscar worthy. I thought it was a great film and everyone should watch it, as I think not many people can appreciate or understand the difficulties and hardships of this kind of scenario.",
            "review_date": "2021-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful experience watching the movie. Photography accurate, celluloid always gives this thing that gives films the magic. Sound design astonishing, the way it was made so that you feel what the main character was feeling along the film...amazing. Also a fantastic work of Riz Ahmed, communicating with his body everything. It's a really beautiful film. Really great narrative. It changes you after you watch it. Makes you questioning about your life and what you have.",
            "review_date": "2021-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed the confrontational cinematography, it made me feel like I was another person beside him, watching the scenarios unfold. However, there were some unnecessary scenes that should've been cut.",
            "review_date": "2021-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Electrifying performance from Riz Amhed and a raw and powerful journey of figuring out who you are without what you love.",
            "review_date": "2021-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie still comes to mind weeks after watching it. Quiet but thought provoking.",
            "review_date": "2021-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An in-depth look at the deaf community, Sound Of Metal is a powerful yet beautiful drama bought to life by Riz Ahmed’s riveting performance. ",
            "review_date": "2021-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible performance from Riz Ahmed.",
            "review_date": "2021-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerfully acted and sincere. I really felt the pain, fear and worry of these characters as they navigate the traumatic events unfolding rapidly before them. There could be some serious awards coming this films way in the near future. A bit slow at times, but still a wonderful story to experience. 8/10",
            "review_date": "2021-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Masterful, Riz Ahmed is at the top of his game in this emotional ride of a film.",
            "review_date": "2021-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing film, loved it.",
            "review_date": "2021-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The feeling of absolute silence, those moments of stillness they will never abandon you!. The whole movie is about coming to terms with your reality which is what life is all about. This according to me is a message as important as life itself.",
            "review_date": "2021-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Throughout most of the movie, we are experiencing it through Riz Ahmed's point of view/hearing. This way we share in his journey, and it offers an interesting insight into the lives of deaf people and how they experience their world.\nSound editing in this movie was phenomenal. Soothing everyday sounds, like the rustling of the leaves and grass, the drops in the coffee pot in the morning, and the voices of your loved ones, become that more powerful and precious when we switch to a third person's perspective as Riz loses his hearing. They managed to make even the sound of silence have a shape and form so we could experience it as well.\nRiz Ahmed's acting was the highlight of this film and, in my opinion, makes him a strong contender for this year's Oscars nominations. Every single step of his journey through the stages of grief for his loss, we were there with him, feeling every moment, from shock and pain, to anger and acceptance. Olivia Cooke was also amazing, showcasing wonderfully how our pain affects our loved ones who try their hardest to help us. Both managed to make me invested in their story in just a few minutes.\nEven though this was not a true story, it felt like one. It felt like it could be anyone's story about the loss of something, or someone, precious and an exploration of their grieving process. That's an amazing feat for Darius Marder's directorial debut. The Oscars buzz around this movie is well deserved.",
            "review_date": "2021-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So I really was not sure what to expect with the Sound of Metal.  Ruben and Lou's music is not for me, but other than that this was a real emotional roller coaster.  Well acted and  excellent writing of such a believable story.",
            "review_date": "2021-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great sound design and great acting of Riz Ahmed. Didn't like the point of the movie tho, i think the message passed by this film is not so correct.",
            "review_date": "2021-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies of the year.",
            "review_date": "2021-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant and heartbreaking. ",
            "review_date": "2021-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent film that explores disability with a precise and nuanced touch.",
            "review_date": "2021-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thanks to Rid Ahmed's mesmerizing performance, and an unpredictable ending. Sound of Metal is surprisingly good while delivering a more objective look to the deaf community.",
            "review_date": "2021-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Phenomenal. This is a must-see movie.",
            "review_date": "2021-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great performance by Riz Ahmed brings to life one of the best film of this year. Loss and addiction are the themes, treated with empathy, sense of time and space and with an amazing sound design.",
            "review_date": "2021-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First time in years, after the last closing frames Like Queens Gambit and No Country for Old Men - I said 'That was perfection' , every frame,every moment. And found myself watching the end standing in the middle of my living room in total astonishment and appreciation to all involved; especially the writer and director and the two incredible performances by Paul Raci and  he new Leading Man for this next world we are moving into : Riz Ahmed. BRAVO!!!",
            "review_date": "2021-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sound of Metal is a heavy, personal, and intricate film of self-acceptance that utilizes clever uses of sound design and a masterful performance by Ahmed.",
            "review_date": "2021-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is very good and touching! It's a slow drama that get to you slowly under your skin! I true good movie.",
            "review_date": "2021-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The type of film that will stay in your heart as a fond memory. Still packs an emotional punch retrospectively. Basically counts as free therapy. Cannot recommend it highly enough.",
            "review_date": "2021-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incorporates sound as almost a character in and of itself, whose presence or absence Ahmed's Ruben must react to appropriately. Far from a conventional \"emotional struggle against a debilitating personal setback\"-type film aimed at low-hanging fruit, Sound of Metal is explores not only deafness but also the grief associated with an unexpected loss, and adaptation to a new way of life in the wake of such an unforeseen devastation - fury, bargaining, attempts to reclaim what was lost, and finally acceptance of a new reality. Ahmed gives a wonderfully active, frustrated performance, giving off very human reactions to his character's plight (an understandably imperfect, often pained individual), though the supporting cast is nothing to brush off. A quality film from Amazon, hopefully the film content produced by streaming services will continue to be of such good quality. (4/5)",
            "review_date": "2021-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sound of Metal handles its subject matter with care thanks to terrific performances from Ahmed and Raci making it one of 2020's best films.",
            "review_date": "2021-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really good should get an Oscar",
            "review_date": "2021-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sound of Metal is the best Amazon Studios film I ever enjoyed.",
            "review_date": "2021-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story of self acceptance after a life altering event.",
            "review_date": "2021-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching a musician lose his hearing is terrifying, & Ahmed is amazing. Not only does he lose his purpose, but he suddenly becomes utterly dependent on the care, kindness, & faith of others…including those he doesn't know (Raci is also amazing). You're constantly reminded of the extreme, inescapable life transition you're going through & the immense grief that comes with the loss. Marder deftly nails all that, but more impressive are his profound moments of serenity & joy that come from acceptance.",
            "review_date": "2021-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sound of Metal is quite possibly the number film of 2020. I know the pandemic has slowed Hollywood's usual push for the award season but Sound of Metal would've been in the competition regardless. The film is anchored by raw performances and it's unlike anything you'll see, it's refreshing to see an original film. I had been skeptical that the film would elevate to the heights of the acclaim surrounding it but it does. The support cast ensure this feels real and in the moment, and the lead performances push this into something incredible. Riz Ahmad was wasted in a film like Venom and it's a shame Hollywood spits these actors out with thankless roles. Olivia Cooke continues her successful transition from Bates Hotel and she has managed to surround herself with strong filmmakers and actors. This is a must-see for 2020. 04/01/2021",
            "review_date": "2021-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed plays a drummer in a metal band who discovers he is suddenly and rapidly losing his hearing.  Faced with this life altering event, he reluctantly attends a camp for the deaf to begin to deal with his disability.  \nAhmed is excellent in his role as he portrays the anger and fright associated with suddenly being plunged into a quiet world. \nOlivia Cooke plays his girlfriend/band mate.\nReally great film.",
            "review_date": "2021-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was excellent",
            "review_date": "2021-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sound of Metal is a 2019 American drama film directed and co-written by Darius Marder 🥁 \n\nIt's ok, but I feel mixed about this one 😉\nI'd recommend it if you like this genre, but if not then probably give it a miss 👍🏼👎🏼\n\nMUSIC WAS HIS WORLD. \nTHEN SILENCE REVEALED A NEW ONE.",
            "review_date": "2021-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Darius Marder's film is a hard to watch film at times but emotionally hooks you in.  Riz Ahmed delivers an amazing performance.  The sound design plays such an integral part to this film and is top notch.",
            "review_date": "2021-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was an experience unlike any other. It is the ultimate in walking a mile in another's shoes. This is truly an immersive experience, and an achingly beautiful story.",
            "review_date": "2021-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really enjoyed the film.  Truly helped the viewer experience the sensation of hearing loss.  A little slow at times, but would definitely recommend.",
            "review_date": "2021-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sound of Metal's screenplay is exemplary at transporting audiences to life in its protagonists shoes and paired together Riz Ahmed's devoted and downright excellent performance, the film is quite powerful and touching. Supporting acting from Paul Raci and Olivia Cooke also deserve a mention, as does the directing from Darius Marder, a name to watch, and the sound editing.",
            "review_date": "2021-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that deals with both the physical and psychological aspects of deafness without condescension or ridicule, Sound Of Metal is an acting showcase for Riz Ahmed, whose performance is full of energy and volatility but also a lot of quiet contemplation and empathy. Playing a heavy metal drummer who experiences rapid hearing loss, his initial reaction of furious denial slowly gives way to acceptance of the fact that his life will never be the same way it was before. The film is unique in its portrayal of a person on the outside working his way in. Many scenes have little or no sound in them, and none of the ASL used in the film is captioned, putting us firmly in our hero's shoes and highlighting what a struggle it is adapting to a different world of communication The film is done in such a way that the sound is virtually its own character. Sometimes its loud, other times its quiet Sometimes its slightly muted or slightly exaggerated, and on occasions it simply comes and goes. It flags somewhat in its 3rd act, which suggests to me that the filmmakers had a solid idea for a film, but weren't exactly sure how to bring it to a close. It's still ends on a satisfying note, but its overshadowed by what came before it. It has a strong supporting cast, most of whom are actual members of the deaf community, a decision that's a credit to the movie itself and its intentions, and while its artistic choices might alienate some, I was very happy to see a sensitive portrayal of deafness, done in a manner that makes it very relatable. Sound Of Metal is a movie I have no hesitation in recommending.",
            "review_date": "2021-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a powerul message of a movie, I have to admit that the movie keep losing my attention due to a pacing that wasn't that engaging",
            "review_date": "2021-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So meditative, intense, visceral and brilliant. One of the most original and emotional films of the last year. Riz Ahmed deserves all the awards.",
            "review_date": "2021-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was the most beautiful movie I have ever seen. Go watch it.",
            "review_date": "2021-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Should've worn ear protection",
            "review_date": "2021-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Deeply emotional thanks to one of this year greatest acting performance and going on forward quickly with the real issue at stake by not passing through long usual first act structure. Nicely surprised and touched by it, keeping it real all the way to it's at the same time sad and uplifting ending. Thanks for the ride",
            "review_date": "2021-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4 out of 5 stars. Sound of Metal is a good drama film about a metal drum player losing his hearing. He cant hear sounds. He goes into a deaf community to learn and coop without the use of sound. Strong plot. Ruben (Riz Ahmed) is a drum player. And a former drug addict. Stubborn once he discovered he lost his hearing. Desperate to get the hearing implant device but at an expensive cost. He joined a community where he meets a group that teaches him the other way of living around it. Great performances by Riz Ahmed. Olivia Cooke. And Lauren Ridloff who plays a teacher for a class of deaf children. One thing i did not like was the movie was a bit slow moving in the third act. Dragging out the exposition. Spending more long camera stills.",
            "review_date": "2021-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A startlingly written and performed film. Completely original. The towering technical achievement in production, not just sound but visual as well, is matched by the story and acting, and all are as good as it gets. This one will stay with you a long time. It's crushing yet hopeful. Cathartic. One of the best films I've ever seen. For this to not win at least two Oscars, one for any number of production elements–writing, sound, best picture–and one for Riz Ahmed in the lead role and/or Paul Raci in supporting, would be beyond me. I cannot recall something this good in the last decade or more. I'm trying, but I can't. This is in a class by itself. I'm stunned.",
            "review_date": "2021-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible performance. A movie that kept me thinking far after the credits ended",
            "review_date": "2021-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't get all the hype on this movie. It was good, not great. Too many holes in the timeline and although I'm supposed to root for the main character there wasn't enough background for me to do so. He's a guy that lost his hearing and that's horrible but that's not enough for a movie.",
            "review_date": "2021-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's so important for people to understand the circumstances of others, and that's why films like this can be instrumental in changing one's perspective. Even if you don't really care for the film itself, it has something to offer that's simply more important.",
            "review_date": "2020-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't think I've better empathized with hearing loss and deafness than with Sound of Metal, a moving and observant drama about a heavy metal drummer quickly losing his sense of hearing. Riz Ahmed (Nightcrawler) plays Ruben, a former junkie who is four years sober and worried about losing his girlfriend/band mate (Olivia Cooke) with his recent diagnosis. He's attending a treatment center meant to cater to a deaf community and transition others into this community. Ruben is defiant, depressed, angry, all the stages you can imagine with grief. The movie is at its best during its quiet and contemplative moments where we empathize with the terror and alienation of Ruben. When he first joins the center, we don't get subtitles for the many signed conversations between members. It's only after Ruben learns ASL, integrates into the community, and opens himself up to the program that we too get to be knowledgeable. The sound design is exceptionally utilized to illustrate Ruben's changing perspective, and some later choices with it might make you long for the peacefulness of silence. The movie is exquisitely thoughtful and considerate while maintaining a subtle, character-driven approach that keeps things grounded from wallowing in self-pity. For many of the deaf, hearing loss isn't seen as a disability but a community with its own culture and quality of life. It's understandable that Ruben is focused on loss but the movie doesn't dwell in loss, more so transformation and acceptance. Ahmed is fabulous in the lead role which requires him to rely primarily upon non-verbal expression for extended periods. His eyes are his best vessel for communicating Ruben's emotional state, and Ahmed is sensational. Paul Raci is also great as the leader of the treatment center and the responsibility and generosity he feels to those in his care. Sound of Metal is an immersive, sensitive, authentic and poignant drama with an Oscar-caliber lead performance and a depth of compassion for the many people of the deaf community.\n\nNate's Grade: B+",
            "review_date": "2020-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant acting by Riz Ahmad!!",
            "review_date": "2020-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fabulous performance from Riz Ahmed. Gritty script that kept my attention from start to finish.",
            "review_date": "2020-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sound of Metal fires on all cylinders - it is a mammoth of a movie. Every emotion is on display and none is more or less vibrant than another. Its use of sound thematically and practically couldn't be more evocative. I recommend watching while wearing headphones to feel its full effect - its nearly painful piercing highs and dull muffled scratches. It has great power in stillness and quiet and has produced scenes I will never forget. It will be near the top of my list of recommendations this year.",
            "review_date": "2020-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring, maybe not gonna waste ur time but you won't see it twice, trust me",
            "review_date": "2020-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best part of this movie is the depiction of what it is like to go deaf. The creative choice to have the audience experience silence along with the main character on many occasions was very impactful. I will also say that the lead actor did a wonderful job and his performance shined through even with what I would say was a lackluster script. First of all, this movie was supposed to be about metal music, but there was no metal music to be found which is not surprising because Hollywood wouldn't know metal/rock music if it was in front of their faces. Secondly, when Ruben goes to the doctor for the first time and finds out he is going deaf he never truly gets an answer for why. He gets multiple reasons for why he MIGHT be, but no definitive answers as to why he so suddenly lost his hearing. All he wanted and was fixated on was surgery to get his hearing back which he knew was very expensive and didn't even ask more questions about how things might sound after the surgery. He assumed he would go back to hearing the same way he did before. This is where I think the depiction of the deaf experience faltered. There would be more conversations between the doctor and patient. I also have a problem with the lack of dialogue about Rubens passion for music. The movie was supposed to be about a passionate musician losing his hearing. How come he never got a monologue where he spoke about wanting to hear again because of his love for music? All he kept saying was, I want to get the surgery. But why? Almost everything in this movie was left for the audience to infer. They barely let the girlfriend speak as well. In the end, I thought it was VERY predictable. I knew after he got the surgery it was either not going to work or he would taking the hearing aids off and that's exactly what he did and the movie just abruptly ends. What will he do next? More for the audience to infer. The critics love movies like this, but for me it was two hours worth of mediocre.",
            "review_date": "2020-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rating: A\n\n\"With moderately high expectations, Sound of Metal genuinely surprised me. Darius Marder and Abraham Marder's exquisite screenplay is the absolute standout, at the same insanely good level as Riz Ahmed's impressive performance. The former holds a meaningful, enlightening story about not only the deaf community but also about accepting our limitations as something that's a part of us instead of taking it as a handicap. Except for a couple of unnecessary scenes that could have made the movie a bit shorter, the two-hour duration is quite fair, boasting a very captivating narrative.\n\nCountless storytelling technical details elevate this film into one of the best of the year. From an apparently simple yet extremely clever use (or absence) of subtitles for sign language to emotionally compelling dialogues, an outstandingly realistic atmosphere surrounds the movie throughout the entire runtime. Never, not even for a second, the viewer needs to deal with an over-the-top reaction, cheesy conversation, or a typical Hollywood, overdramatized moment. Darius Marder has terrific control of the tone, keeping it exceptionally grounded.\n\nRiz Ahmed delivers what I believe is his career-best display, incorporating his character's hearing disability in a seamless fashion. His subtle facial expressions and body movements are essential for the performance that can easily guarantee him dozens of nominations. Olivia Cooke (Lou) is also excellent in her role. Technically, huge praise to Daniël Bouquet's cinematography, which insists on an almost documentary-style composition by applying standard camera angles and shots often seen in this type of feature, helping to generate the before-mentioned authenticity.\n\nOne of my absolute favorite films of 2020.\"",
            "review_date": "2020-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An indie where I first learned about the existence of an exclusive community for deaf people. A heavy-metal drummer's life is thrown into freefall when he begins to lose his hearing. \n\nThis is one of the mundane drama, like Manchester by the Sea, where we follow the main character dealing with his/her life like a real person. There's very little background music. Also, there's no big movie twist that would wow the audience. It's simply just a man trying to deal with situations in his life. \n\nRiz Ahmed's performance as a drummer was real and made me care about the character. Since the story followed the drummer, often the sound in the movie reflected how the drummer heard, and this gave perspective on how a deaf person hears. There were little conversations, and many of them were sign languages, which didn't have translations, which confused me a bit in some scenes. \n\nOverall, a mundane and somewhat educational movie about dealing with being deaf. 8/10",
            "review_date": "2020-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed gives a stellar performance, which I think is pretty well known. It's fun in places and heartbreaking in others. What also stood out for me was the sound editing that went along with Riz Ahmed's character's journey of learning to live without his hearing. This is one of those movies that I recommend watching if you just want to learn about a life that is possibly different from your own. That's one of my favorite things about movies; they help you experience (however limited) a different time, place or life. The more we know about others the more likely we are to show compassion.",
            "review_date": "2020-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "*Snarf* As a partially deaf person this movie made me plotz! *Snarf*",
            "review_date": "2020-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz will win an Oscar.",
            "review_date": "2020-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its sad to see someone try so hard to get something they lost only to wind up not really getting it all back . i felt the main actor is the reason to watch this he crushes this role",
            "review_date": "2020-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A compelling info fulmtcharacter study that seems the nail the experience of losing your hearing.",
            "review_date": "2020-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty moving. One of the good movies made in 2020.",
            "review_date": "2020-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love Indie movies like this that fly under the radar.  The acting was excellent and a great insight into the deaf community.",
            "review_date": "2020-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed and Paul Raci both give Oscar worthy performances.",
            "review_date": "2020-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Sound of Metal is a five star performance stuck in a two star movie.  Riz Ahmed (rogue one) is brillant as a drummer dealing with sudden hearing loss and addiction.  The film has an interesting soundscape but most of the characters are paper thin and we lack enough information to even make sense of what a character's motivation or intent is supposed to be.   Ends up being a fustrating 3 star movie (out of 5)....despite a performance likely to be nominated for an academy award.  On Amazon Prime.",
            "review_date": "2020-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed delivers one of the best male performances of the last years. Incredible.",
            "review_date": "2020-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sad movie but a good look into what being deaf could be like and learning about acceptance",
            "review_date": "2020-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film about facing an inevitable change in life, very emotional.",
            "review_date": "2020-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful, humbling story. Excellent visual storytelling, excellent writing, and wonderful execution by this whole production team. Well done.",
            "review_date": "2020-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We didn't finish watching this.  By the one hour mark, we were both struggling to stay interested.  The pace was so slow.  At one hour, 22 minutes, we looked up the plot on Wikipedia, and both noped right out.  The premise was so interesting, and the movie started out very strong.  The female lead was very underwhelming though - her part consisted of her looking worried and confused and sleeping.  Moving onto Act 2, this is where the movie slowed way down, and meandered through many scenes that I think were meant to show the main character's growth (I'm not sure exactly), and then we barely got to the beginning of Act 3, where the crisis happens to threaten the main character's progress.  The only character that was provided any depth was Ruben (and perhaps the manager of the rehab facility, but just barely).  There could have been so many chances to show relationships that Ruben had there, but the people living there were just treated as bystanders to Ruben's story, which wasn't all that interesting. We didn't finish the movie, so perhaps it improved at the end.",
            "review_date": "2020-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was an excellent movie !  An absolute must see. \nI highly recommend.",
            "review_date": "2020-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good third act bats clean up for a non-existent second act. Great premise wasted on poor storytelling.",
            "review_date": "2020-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A raw story of strength and frailty, delivered with one of the best performances of the year by Riz Ahmed in the leading role. The writing and pace is fantastic and it really makes us submerge into this sensorial journey.",
            "review_date": "2020-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So much to admire about this original movie. A top class performance by Riz Ahmed, nicely capturing the confusion, anger and ultimate acceptance of his condition. Another Brit, Olivia Clarke, excellently  plays band mate & girlfriend Lou, and has an interesting backstory of her own.  I did think the timeline and explanation of key plot developments was messed with too much in the editing: he seems to learn to sign fluently in about a week; he gets his implants in about a month; he manages to get a flight to Europe even though he's skint . . . but all is forgiven for the haunting final two scenes; one with Lou showing his understanding of the world, and then that park bench. Excellent.",
            "review_date": "2020-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very well crafted and emotionally resonant film, Sound of Metal succeeds thanks to a strong lead performance from Riz Ahmed and intimate direction from Darius Marder. It is also worth mentioning that the screenplay, which Darius and Abraham Marder co-wrote, is a stand-out element of this film.",
            "review_date": "2020-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable movie, interesting topic. A little long, but worth a watch",
            "review_date": "2020-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's All Gone Pete Tong version 2019",
            "review_date": "2020-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heavy movie, super sad, but the story was good and the acting amazing.",
            "review_date": "2020-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must see just for the performance of the cast",
            "review_date": "2020-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Putting your character in so much pain and then judging every single one of his actions? WOW!\nActing and Sound Mixing are fantastic, though.",
            "review_date": "2020-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A few minutes in, this looked like it was going to be a slog.  The actors drew me in, though, so I resisted the urge to turn it off, and then the slog wore off and was replaced by awe. Just as the long months of Covid have been full of intense moments of beauty, so beautiful that I know better than to try to hold onto them -- such as trees in my neighborhood that I've looked at for decades taking on a majestic, moving breathlessness -- this movie has complexity and mystery, gratitude and tears. The acting all throughout, and most especially at the end is beyond.",
            "review_date": "2020-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Who knew complete silence could be so relaxing.  Utterly amazing film.  Not going to lie, probably 2020's best film I've seen yet",
            "review_date": "2020-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Way better than I expected. Riz Ahmed delivers a powerful performance in a movie that gives a great look at the deaf community. It tells something of a heartbreaking story as a man loses what he loves and desperately tries to get it back even when he can't.",
            "review_date": "2020-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Evocative as hell, ‘Sound of Metal' gets high marks for using the medium to maximum effect in illustrating metal drummer Ruben's grapple with imminent deafness. The sound design is astounding; it captures the alienation, the disorientation, and the discovery of his circumstances in ways I couldnt've imagined and the effect is exciting, terrifying, and heartbreaking all at once.\n\nRiz Ahmed nails the behavioral sand traps that keeps someone clinging and clawing at the bubble they're fixated on preserving. The tumultuous lengths to which he will go to combat his deafness echo his heroin addict past; I tragically saw much of Ruben in someone I used to know. We can all be soul-deep addicts in our own way to something or another in our lives and the pain and confusion when you feel like you are being ripped from your identity can be all-consuming. How do you battle for air when you're violently drowning?\n\nThis profound journey says a lot all at once and Darius Marder (alongside his brother and Derek Cianfrance) brilliantly scripts an arc that works on multiple levels - allegorically, spiritually, technically, humanely, all the ways. What often moved me throughout this was not necessarily what I was seeing directly on screen, but the implications of it all.\n\nIt's invigorating to see the thriving lives and relationships of a deaf community credibly explored and Paul Raci is memorably tender as Joe, the recovery leader and beating heart of the tight-knit society. His performance, alongside Ahmed and Olivia Cooke - who's coping with her own aching past - screams awards consideration.\n\n'Metal' captures well that for Ruben, like so many of us, you can't be pushed to someone else's vision of acceptance; the truest form is a result of your unique, albeit stumbling journey, when you evolve organically from the steps (and missteps) you take. It's a long, difficult road, but Ruben shifts the narrative of his life from bemoaning what he's losing to embracing what he's gaining. Moving, eternal stuff. And the closing shot encapsulates a catharsis well-earned.",
            "review_date": "2020-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Change can be difficult.  So this is about a heavy metal drummer named Ruben (Riz Ahmed).  His life is about to be thrown through a loop when he starts to lose his sense of hearing.  He has no choice but to figure something out posthaste.  Now I went into this movie fully expecting it to deliver.  It's a morose premise for sure, but I had already heard rumblings about how great this was.  It has been a weak year due to COVID, so I was hopeful that this could be one of the best movies of the year.  Unlike a whole laundry list of films before it, Sound of Metal did not disappoint.  Now right away, I was vibing with this movie, and it is because it reminded me of one of my favorite movies of all time: The Wrestler.  They share several similarities: you have this skill set that gets shunned by the people who consider themselves refined, a protagonist who shouldn't be pursuing this career any longer for health concerns, and a desire to do whatever it takes to recapture the glory days.  There are also powerhouse leading performances in both films, and I will be shocked if I see acting that impresses me more than Riz Ahmed when I'm putting together my year-end wrap-up.  Even though the story doesn't spend a ton of time on it, you get a real sense of what kind of people he and his partner are right out of the gates, his partner played expertly by Olivia Cooke.  Not only is she his bandmate, but they are in a romantic relationship as well, so there are stakes presented very early on.  This problem is one that you can't ignore and hope that it goes away; you must take action, and you, of course, sympathize with his plight.  In true underdog fashion, you want to see him rise and overcome, but there are only so many options that you would have in this scenario.  You still want to watch how this will play out, and whenever I felt any lulls here, the story came back with an even harder emotional beat.  Sound of Metal is one of the very few must-see movies released this year.  You have to prepare to have your heart ripped out, and it is all too easy to put yourself into Ruben's shoes in this scary situation.  You will find energy and intensity in just about every scene, but even when it slows down for a quieter moment, the emotional charge is still palpable.  I thought the sound design to this was incredible, and you have to give kudos to how this movie handled deaf representation.  It only took twelve months into 2020, but I can finally recommend to you my first five-star movie of the year.",
            "review_date": "2020-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Darius Marder's \"Sound of Metal\" is an intimate, gripping and heartbreaking disability drama that sheds light on the experiences of marginalized deaf communities. With his directorial debut, writer/director Darius Marder has crafted an authentic account of a heavy-metal drummer that rapidly loses his hearing. It's the filmmaker's first attempt to humanize the lives of deaf musicians, but he pulls it off seamlessly. Using captivating cinematography, Marder draws viewers into the world of a musician that struggles to cope with hearing loss. From intimate close-ups to stunning establishing shots, the cinematography keeps viewers immersed in the film's setting. Marder uses impeccable sound design to recreate the experience of hearing loss, effectively shifting between deaf and normal audio. It is hard to not praise the powerful performances from the cast. Riz Ahmed delivers his finest performance to date as Ruben Stone. With mesmerizing expressions, he conveys the frustrations, disillusionment and self-denial of a heavy-metal drummer that struggles to come to terms with his loss of senses. The supporting cast, which includes the heartfelt Paul Raci, is also excellent and worthy of awards-recognition. Although \"Sound of Metal\" is undeniably an immense technical achievement, ultimately it is not a flawless film. If there's a minor drawback to the movie, it suffers from a slow pace that tests the viewer's patience. Moreover, its sensitive themes may not appeal towards everyone. Nevertheless, fans of disability dramas will definitely enjoy \"Sound of Metal\" and so will movie-goers seeking heartfelt entertainment. At a time when deaf communities are rarely represented in films, it's a stirring reminder of the power of Cinema as an auditory art-form for telling disability stories.",
            "review_date": "2020-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gonna try my best to NOT make this a Riz Ahmed thirst review. \n\nThis movie is an incredible and devastating journey into losing life as you know it and finding the peace to start again. Ahmed takes us on this journey in a completely believable and sympathetic way AND OMG HE'S SO HOT. \n\nWelp. I failed. But I won't apologize.",
            "review_date": "2020-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "8/10. With incredible performances, scripting grounded in realism, sensitive direction, and gripping sound design, 'Sound of Metal' tells a story that as many as 400,000 Americans each year may experience - the process of sudden hearing loss. Riz Ahmed's central performance as Ruben, a drummer who in an instant loses his hearing, is imbued with a deep emotional complexity that is complemented by innovative sound design - Ruben's panic, rage, despair, fear, and isolation are palpable as you watch him negotiate, and and eventually begin to grow in, his new reality of muffled silence. There are some scenes that make you want to reach through the TV and hug and comfort this man as his world falls apart around him, and again as he puts it back together. Olivia Cooke and Paul Raci are well matched with Ahmed in their supporting roles, the former as Ruben's deeply committed yet troubled love interest, and the later as a leader of an organization that supports the deaf. This film gives voice to a community rarely seen in film, and gifts awareness and empathy to it's viewers. It is certainly one of the most affecting, intimate films of the year.",
            "review_date": "2020-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmen is Ruben, a drummer in a hard rock \"band\" (which is just him and his girlfriend, Oliva Cooke).  They share a strangely quiet, gentle existence living out of an old Air Stream and travelling the country.  Their music is loud and angry; their lives are restrained.  We learn that Ruben is a recovering addict and we soon learn that he is suddenly and quickly losing his hearing.  It's a devastating diagnosis.  To lose his hearing is to make who he thinks he is (a drummer & overall musician) nearly impossible.  He is encouraged to go to a home for newly deaf adults who are also addicts.  (One of the faults of the movie is that we aren't told exactly why or how this decision is reached.  One day, he's just going there.)  Ruben works to fit in and gradually finds a place for himself.  But in the back of his mind, all this is a \"holding pattern\" while he tries to come up with the funds to get a cochlear implant to regain his hearing.\n\nAhmed is never less than amazing.  The awards season recognition he's getting is well-deserved.  He is pretty quiet through most of the movie, yet never totally peaceful.  He is a deeply decent person, even gentle...yet he has demons he must wrestle with.  Ahmed can convey these battles and contradictions just by sitting there and letting us see his face and eyes.  You can feel how cheated he reckons himself to be.  You can see when he's drawn to simple things like teaching a deaf child how to drum his hands rhythmically.  You can see his battle to contain his anger and confusion.  His first \"AA\" meeting at the center, where everyone speaks in a sign language he hasn't begun to learn yet, is quite arresting because you can see how overwhelming it all it, yet he barely moves.  His performance is worth seeing, 100%.  (I would also point out that the sound design is EXCELLENT and so critical.\n\nBut the events of the movie are shown so frustratingly.  We have no real idea of how much time is passing?  When he learns sign language, has it been a week or a year?  Olivia Cooke's character (and performance?) give us almost nothing to go by.  We initially like her because Ruben does, but we really don't know her at all, and the script and actor give us little to go by.  And strangely, as arresting as Ahmed's performance is, I found myself not actually caring all that much about how everything turned out.  Key events in the character's journey seem to be skipped.  Major plot points (and there aren't many) are presented in a sketchy manner.  It all led to a movie that feels like less than the sum of its parts.\n\nBy all means, see if just for Ahmed's performance.  But I think the film itself is SO specific (a rock drummer addict who is suddenly deaf and must adjust but also wants surgery because he thinks it will be a cure-all to return him to his old life) that it forgets to clarify things that those of us who haven't had this specific experience are sometimes left in the dark.  It's an overall miss for me.",
            "review_date": "2020-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sound of Metal is an accomplished indie sweetheart of a film, shedding light on a niche subject with careful precision, passion and care. The film is anchored in Riz Ahmed, from beginning to end. Not since There Will Be Blood, have I felt so bound to a lead's performance. This is largely due to the technical aspect, the presence of Day Lewis' face in nearly every frame of Anderson's Blood, and in Metal, the hand held camera and careful sound design drawing us continuously between Ruben's hearing experience and hearing all levels of sound available to a fully functioning ear and it's inner parts. If the duty of art is to make us see beauty, to make us hear beauty, to make us aware of the beauty all around us, then Sound of Metal succeeds. One circumstance in which cinema shines is when and where a condition of synesthesia is created; the sort of complete experience that is simultaneously disorienting and illuminating for a viewer. Sound of Metal, in moments, brings us there to the cusp. It's a simple movie, there aren't big set pieces or shocking narrative turns, but within each moment, there's a certain high level of authenticity which makes the film feel like a Dardenne Brothers experience, and this sort of docu-approach feels right for the subject matter. With a cameo from The Diving Bell and The Butterfly's Mathieu Amalric and strong work from Olivia Cooke and Paul Raci, this little film packs some strong punches. Where it fails to outwardly wow and entertain, it will at least inwardly illuminate, warming your heart even as it breaks.",
            "review_date": "2020-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Relentless, sincere and impactful, Riz Ahmed portrays perfectly a man who goes deaf finding his inner stillness.",
            "review_date": "2020-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love Riz  Ahmed. He is an amazing actor. I love the story. The growth of the characters in the movie. The overall this movie kept me in it. Didn't  even get on my phone once. Yas Queen!",
            "review_date": "2020-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overall I found the movie interesting and worth my time. However, it seems the filmmaker didn't make a decision to either tell a story about substance abuse recovery or deafness but to their credit they did a decent job at both.",
            "review_date": "2020-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How many times does a movie hit so close to home that your life seems to be literally displayed in front of your eyes. Not many.\n\nMy Story (Review Below)\nI lost my hearing in my right ear in my early 30's. Some weird thing they can't cure called Meniere's Disease. 20 years later and three months ago, my good ear started crapping out and I was told I have bi-lateral Meniere's. Not good. \n\nI wasn't a drummer (practiced to be one though). I went to metal/rock shows before COVID, and I wear ear plugs now when I go. I can't personally speak to what it's like to be in the music business, but I can speak to what it's like to go deaf all of a sudden. \n\nJust as in the movie, I wake up and hear a loud humming with everything else a dull murmur. Even my own voice. \n\nI was told hearing aids could help -- I was lucky that I had a family benefactor who offered to pay for the best of the best as they are not covered by insurance. \n\nAnd they helped -- a little, but for the price they barely did squat. Sounds were shrilly like you had an AM radio with a bad speaker in your ear. I need to put subtitles on all movies I watch these days. \n\nBut having trauma in your life reminds you of the importance of connections. Friends and family that support you, or people you barely even know -- like my Letterboxd friends in the comments section. What a great community we have here. \n\nSound of Metal Review\nI went in without reading the byline, expecting an expose on life in the hard rock music business. Instead it's a tragic situation of the young drummer of a metal band, played fantastically by Riz Ahmed, who goes deaf. \n\nThe acting is fantastic. Riz Ahmed is great as usual but reaches a new level . His girlfriend Olivia Cooke is unrecognizable with the bleached eyebrows, moving refreshingly from trash horror movies to a fantastic dramatic effort. \n\nThere's more to say but I need to digest this more and possibly do a rewatch. \n\nAmazing.",
            "review_date": "2020-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was okay i guess.., I was expecting more,  but once they introduced the death school I was bored.   I was also disappointed with the ending of him sitting on the bench.   I don't know what I was expecting but I was lefted wanting more.",
            "review_date": "2020-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A moving and well done film about losing hearing and how to deal with loss and change. Great performances.",
            "review_date": "2020-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Originally planned as project by director Derek Cianfrance, based on the \"Metalhead\" drummer who actually did blow his ears out and had to adapt to silence. The film was unfinished and debutant director Darius Marder was given Cianfrance's blessing to complete it. And what a solid debut it is. It's a slow burn but nonetheless captivating film that really pays attention to the affliction of Riz Ahmed's character and makes great use of sound mixing to put the audience directly into the experience of the sudden onset of deafness. Ahmed gives a brilliantly reserved performance and compliments the quieter moments of the film where it achieves its biggest impact.",
            "review_date": "2020-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I dont think it was worth watching...\nOpening scene is full on misery...\nTHen i stopped watching around 10.00 m.\nBecause of the comments here i tried again...\nStopped at 60.02m.\nBoaring, boaring, borang, his chest tattoo says : Please kill me...\nI say: Please do...\nDont waste your time.",
            "review_date": "2020-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was totally on board for the journey. Nobody took a wrong step. Great performances, beautifully shot & skillfully directed. It's one of my top films in a long time and I'm sure it will stay with me. Costume and Production Design was perfect.\nGuess you can tell I love this film.",
            "review_date": "2020-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good! Great performances. The highlight for me is Paul Raci with a spectacular performance.",
            "review_date": "2020-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thought provoking movie. Left me feeling sad and in a slightly depressed mood after watching it. Had to go watch something else to cheer me back up.",
            "review_date": "2020-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whether or not a candidate for the Oscars, this Sound Of Metal deserves everyone's attention, with Riz Ahmed and his performance to the delight, the best debut of the year for Darius Marder and a heartbreaking but satisfying story.",
            "review_date": "2020-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An exclusive look at the feelings and emotions that the deaf community experiences. This very much was brought to life by Riz Ahmed's role as the main character. The editing has a huge impact on the story and the feel of the piece itself. This may be my favorite performance from this actor and this director seems be on a role so far!",
            "review_date": "2020-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Darius Marder smartly uses sound resources to create an immersive feature that channels the viewer through an intense experience that is all the more stunning due to Riz Ahmed's magnetic tour de force.",
            "review_date": "2020-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic, just became one of my all-time favs.",
            "review_date": "2020-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just watched it because it received good critics, BUT, I found it a bit boring... it's not that bad, but I wouldn't watch it twice...",
            "review_date": "2020-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the sound profile does a good job mimicking the experience of hearing loss, the story line was not representative of most people with hearing problems. Worst of all, the movie shared misinformation about sudden hearing loss and possible treatment options. More research should have been done to avoid misleading the general public about hearing loss.  My full review is here: https://livingwithhearingloss.com/2020/12/15/sound-of-metal-movie-ignores-the-typical-hearing-loss-experience/",
            "review_date": "2020-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A solid movie. Well acted. Even though I thought Olivia Cook was a little flat in spots. Riz Ahmed and Paul Raci were great. When he initially goes deaf, very intense, and makes you the viewer feel the distress. I recommend.",
            "review_date": "2020-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting and the sound were great but there were so many holes in the plot that it ruined the movie. The movie ended and I was just unsatisfied. Would not recommend.",
            "review_date": "2020-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed does a tremendous job portraying the recovering addict-drummer. Character development was amazing and realistic. Very well told story that was captivating from beginning to end. Eloquent and grounded writing. ",
            "review_date": "2020-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was really happy this film actually lived up to the hype I've seen the last week, as that often leads to disappointment in my experience. Probably the two most cliche aspects of this film to mention but Riz Ahmed was really strong and the sound design was amazing.",
            "review_date": "2020-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely brilliant movie. Oscar worthy for sure.",
            "review_date": "2020-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boy did I hate the beginning of this movie with the atrocious loud awful music....Sexy and sold performance by Riz Ahmed....but I have seen all this before in other films....no surprises and pretty pedestrian ....girlfriend was annoying but guy who played the leader of the deaf community gives a great performance.....I wanted this to be the picture of the year but it plays out by the numbers....but loved the last scene.....oscar nomination for Riz Ahmed...for sure.....",
            "review_date": "2020-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed has a stellar performance. Some of the lessons are a bit on the nose, but overall a very, very good film with a thoughtful lesson.",
            "review_date": "2020-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I permanently damaged my hearing in a battery explosion. Raw emotions evoked, they nailed it.  I rely on closed captioning.  This film, didn't need them.  Ahmed's performance was so very real - denial, anger, frustration, inability to communicate, the isolation.  The party scene evoked so much emotion, I had to hit pause.  Just sitting there alone as if on the outside looking in.  And people glance/smile at you as if sitting there, alone, and watching is a choice.",
            "review_date": "2020-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "riz ahmed does a superior job & just everything about this movie is so telling to the deaf community & how it's represented & seen. way way way better than children of a lesser god",
            "review_date": "2020-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting characterization, but no growth in the character, for a \"journey\" film. \nJust didn't really *resolve* it's arch.",
            "review_date": "2020-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz does a phenomenal job in this movie about the power of acceptance.",
            "review_date": "2020-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed is outstanding as a man suffering from a sudden hearing loss. His performance is nuanced,  bold and angry. His performance is so real, the film feels like a documentary. It rarely hits a false note and without spoilers, viewers will be satisfied with the ending.",
            "review_date": "2020-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed is absolutely stellar in this emotional story about purpose and its loss.",
            "review_date": "2020-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In a fair world, 'The Sound of Metal' will receive at least three nominations from the Academy (Sound, Best Actor, Best Director), but we all know that's not going to happen when a first-time filmmaker is involved.  Darius Marder has directed one film and co-written another, but this is HIS film.  There are some elements that didn't quite work, but it all pales in comparison to how spot on Marder gets what it's like to feel deaf.  I kept reading from deaf people how this movie gets it.  It certainly got me.  I felt like i was the one who had lost my hearing and that is a credit to the brains behind the film.  This film has the PERFECT ending. Final Score: 8.6/10",
            "review_date": "2020-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sound of Metal is a heart-warming film filled with a great message, acting performances, directing & cinematography, and sound mixing & sound editing. This film has everything. It has drama, romance, music and more. \n\nWhen something gets taken away from someone's life or when something gets to an end in someone's life, it could mean the beginning of a new thing, a better thing, a better life. A life where you will find yourself, your true self, you will start to feel every little detail around you, you will start to be grateful, you will see things differently, you might start to like things that you always thought that you might not like. Being deaf or blind or whatever doesn't mean your life stops or ends there, it doesn't mean that something is wrong with you, it doesn't mean that you can't do anything. You don't have to fix it, you just have to fix your \"MIND\" if you think that way. THIS IS SOUND OF METAL and that's why I love this film. The film is about life, love, accepting & loving your life whether it was good or bad, being grateful, feel and absorb everything and every moment around you and never give up. \n\nSound mixing & Sound editing were perfect. Alongside Ahmed's great performance, the sound mixing & sound editing were showing exactly how Ahmed's character Ruben Stone, hears every single thing around him. It is like we the audience, are Ruben Stone. We are feeling what he is feeling and hearing what he is hearing. Loved how sometimes everything goes completely silent where we don't hear any single noise, and sometimes we hear everything that's going around him. The film shifts back and forth through that to show the difference. hats off to everyone in this department who worked on it and got us this beautiful result.\n\nIn addition, The directing & cinematography were absolutely amazing, they were portraying the different aspects of Ruben Stone's life in a creative and unique way. \n\nThe film has a very great screenplay that is very well written. Some scenes will really touch your heart and they have a really deep meaning behind them. The film is also filled with quotes about life that are really deep. \n\nRiz Ahmed's performance was amazing and he was able to play Ruben Stone very very well. Really can't imagine someone else other than him to play Ruben. I really don't know what to say much about his performance other than, IT IS THE PERFORMANCE OF THE YEAR. Although Olivia Cooke did not have much time on screen, she was able to give a great performance as well.\n\nIn conclusion, Sound of Metal is one of the best movies I have ever seen, I \"HIGHLY RECOMMEND\" every to watch it as soon as possible. It is new, unique, creative, emotional, genuine. It is just everything. \n\nMy rating is: 9/10",
            "review_date": "2020-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed gives a moving performance as a heavy metal drummer trying to adjust to a radical life change when he loses his ability to hear.  Seek it out.",
            "review_date": "2020-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Sound of Metal\" is a somber movie but also a very fascinating look into the deaf community. This movie is powered by a great lead performance from Riz Ahmed who is becoming more and more of a talent to keep an eye out for with every project he does. His performance is real and understated but immensely effective. I also really liked how the movie used the sound design to allow the viewer to get inside the character's head and ultimately understand his frustration. The movie feels very realistic, so a lot of the tone is pretty low-key, but I think it mostly works for the story it is trying to tell. Overall, this is a good movie that is boosted by a fantastic lead performance from Riz Ahmed.",
            "review_date": "2020-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm very wary when it comes to screenplays, specifically when a first-time writer knocks it out of the park because I then find myself having a preconceived notion that they will always be that good. To me, one of the absolute best films of 2012 was The Place Beyond the Pines. Until now, writer/director Darius Marder hadn't really done anything of note since his contribution to the screenplay for that aforementioned film. Well, he has now made a film of his own, both writing and directing, and he's now two for two in my book because Sound of Metal is a fantastic piece of indie filmmaking. Now available on-demand, here's why Sound of Metal more than warrants your time.\n\nBeginning with a concert scene that expresses just how passionate Ruben (Riz Ahmed) is about drumming, it doesn't take long before the film sends his life into a downward spiral. Losing his love of music due to his now gradual and rapid hearing loss, Ruben must come to terms with the fact that he may never be able to hear again. Trying to find peace and solace after years of drug addictions, this is the final, and biggest test of his life yet. From the very first moments, I was sucked into this film, but Ahmed's performance also helped with that, because it's honestly one for the ages. I have seen him many times over at this point, but his commitment to this character floored me. There were multiple occurrences, even though I couldn't relate to the character, that I felt the pain he was going through. This also leads me to the use of sound design.\n\nFrom the overly loud opening to the near-silent portions of the film, the sound design was one of the biggest characters here. I have to give major props to the entire sound department. There are times where it seems natural that we would be hearing things the way Ruben is, but then the film shifts back and forth in order to show the difference. On top of that, there are moments where not a single noise or music queue is heard at all, which made for a much more engaging film in my opinion. His performance, along with how the sound design reflected it, was simply perfect.\n\nFilms that revolve around a likeable character who has to overcome insane odds are very difficult for me to dislike unless it's just poorly made, so I'm slightly biased for stories like these. With that said, as much as a loved this film, I can't quite call it perfect because the portions of the film that were dead silent are both the best and worst parts of the movie in terms of pacing. Yes, I was engaged from start to finish, but the quiet elements sometimes brought the film to a halt. In retrospect, I still enjoyed all of those moments as well, but that, in particular, is what is keeping me from giving this one a perfect score. \n\nOverall, Sound of Metal was easily one of my most anticipated films of this year simply due to who was writing and directing. This is the type of film that has talent littered throughout. Whether you're talking about the wonderful central performance by Ahmed, Olivia Cooke's great supporting role, or even the calm and collected performance that Paul Raci gives as Joe, never once did I question the acting here. Although I haven't had the chance to see a lot of editor Mikkel E.G. Nielsen's work, I will absolutely be keeping an eye on him in the years to come, because his work here inspired me. I loved nearly everything about this film and it's easily one of my top recommendations for this year. Sound of Metal is a home run.",
            "review_date": "2020-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While Riz Ahmed delivers a great performance, the story, at core, we've seen before - in some way, there are echoes of the downfall spiral of \"Uncut Gems\", with us yelling at the screen \"don't do that!\" to the starring character. There is a brave choice that hints the film that could have been, but chose to not be, at the last third of the film... somehow, the film doesn't live up to the whole potential it lays beneath its frames, but the sound design and Ahmed and the rest of the cast (specially Paul Raci) make it, overall, a quite good experience and film.",
            "review_date": "2020-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am afraid of the message this portrays to people in the deaf world about their options.\n\nFirst off cochlear implant are often covered by insurance\n\nSecond, the surgery is not as scaring as depicted, and shaving is rarely necessary, and the incision is much smaller\n\nThird, that processor was archaic, possibly decades old\n\nLastly, the programming session was terrifying and all the audiologists acted like defeatists.\n\nDifferent programs, different maps settings for crowds, directional mics with portable wireless ones\n\nThere were hints that this movie was maybe 7 or 8 years old but showing implant technology much much older. My father WITH an implant hears in groups better than me most of the time with forward focus mics and noise reduction, and he can enjoy music for the first time in over a decade.\n\nMy wife, an audiologist was rather disgusted by a lot of things in this movie.\n\nThe acting on the other hand was good and I liked the sound mixing.  The movie has a good idea, a good message in general, but I fear the message being sent to people who are losing their hearing and need information about the options that are unbiased.",
            "review_date": "2020-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I only watched because of reviews. Because frankly it looked boring and depressing...and I understand it can be a groundbreaking movie for dead people and I'm glad. But as a movie alone it was tough to watch and get through. Ending we saw coming.",
            "review_date": "2020-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent dramatic performances and a plot that puts you in the shoes of someone who has lost hearing like never before. A real accomplishment in filmmaking.",
            "review_date": "2020-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great performances and his uplifting arc is overcome by his own conflicts.",
            "review_date": "2020-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Sound of Metal' is a spellbinding dramatic experience uplifted but its stellar technical aspects and Riz Ahmed's electrifying performance.",
            "review_date": "2020-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a phenomenal drama film directed and written by Darius Marder, and starring Riz Ahmed and Olivia Cooke. It tells the story of a drummer and one half of a metal duo along with the singer, his girlfriend – who begins to lose his hearing. This is one of the most touching and well-crafted films I've seen this year, bound to land on many Top 10 lists this year. The sound design of this film is some of the most near-perfect I've ever heard in one of these, from the concert scenes, to the moments we are inside Riz Ahmed's head and experience the loss of hearing alongside the character.\n\nRiz Ahmed gives one of the most powerful, moving performances of the year in this role! The anguish and confusion, anger, just a full range of emotions he displays here and it is a true treat to see. Ahmed has consistently been one of the greatest young actors working today, and in this role, things are no different. Before filming, Ahmed took 6 months of drum lessons, and for the film, he also learned American Sign Language. This film was also shot over just one month – so to see this as the finished product is incredible. Just as with the film \"Run\" and the casting of its lead paraplegic actor, here, Darius Marder casted numerous people from within the deaf community, adding a very respectful atmosphere, as well as a vital piece of authenticity to this story. Sound of Metal is streaming on Amazon Prime Video right now and I highly recommend checking it out ASAP! All the thumbs up from me.",
            "review_date": "2020-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an intense, brave and beautiful movie. I wasn't intending on watching this, but my partner started it, I was super turned off by the band \"music\" (i like metal but this was shrieking and off putting) as the movie progressed I was drawn in by the main character and creative sound. \n\nThe movie really starts when he is left to check himself in to a deaf community to help maintain his sobriety. \n\nHe seems to have moments where he is able to adjust into his new reality but its short lived as he cannot let go of his past and relationship even as time ticks by and he learns sign language, makes connections and is offered a permanent place. \n\nThe last third of the movie is hard to watch both audio and plot wise. At this point you are solidly rooting for him to find peace while witnessing the inevitable last cling to who he was before. \n\nThe last 10 minutes are absolutely beautiful and filled with emotion. At one point a scene felt so familiar I could have been on the screen and it grabbed and squeezed my heart so deeply I STILL feel it.",
            "review_date": "2020-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful sound design, a great central performance, and a story that teaches you a lot about identity, acceptance and moving on. Definitely an Oscar contender, I said it.",
            "review_date": "2020-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whoa, where did this movie come from?\n\nAs soon as the film started, I knew instantly I was in for an emotional ride, and I was right.\n\n'Sound of Metal' is a great movie that felt so encouraging and honest. I admired how the movie portrays the deaf community in a more positive light, because in the media it's usually misrepresented, as it often reeks of denial and self-loathing. I can tell a lot of care and effort went into this.\n\nIt's very thought-provoking as well. The main character Ruben (Riz Ahmed) who is a heavy-metal drummer, where his entire life revolves around the world of sound and music, which sadly gets snatched away from him. This devastating part of his life also becomes the thing that would later define him. The silence makes him pause and consider what life can be like when we learn to accept and let things go. Not only accepting the lost of your hearing, but overcoming a nasty drug addiction. By losing apart of yourself isn't always doom and gloom after you let it sit for a while, because it can give you a brand-new perspective on things. You start to conclude that silence is heaven to the ears.\n\nRiz Ahmed delivers a terrific and heart-breaking performance as Ruben. He's the type of actor that does such a great job of making you care for his characters and here is no different. Riz has such intense, and yet expressive eyes that convey so much on what the character is feeling or thinking. Every worry, frustration, sadness, joy, and fear were all felt through his performance.\n\nOlivia Cooke, who I didn't recognize at first, also delivers a great performance as Lou, Ruben's girlfriend. There is nothing more soul crushing than watching someone you love at their lowest point both emotionally and mentally. It makes me wonder why she isn't a bigger star already, because I think she's fantastic.\n\nI like how the movie barely has a score, as the background is often incredibly quiet. The movie opens with a loud heavy metal concert blasting away it's music, but from Ruben's point of view it slowly becomes more muffled and clogged up. It just shows that a great deal of thought went into the audio and that alone made the whole thing effective. The same thing applies to Darius Marder's directing and Daniël Bouquet cinematography; fantastic and impactful.\n\nOverall rating: Highly recommend.",
            "review_date": "2020-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only here to say that Joel M's review sucks and it's probably his wife's boyfriends favourite movie that's why he hates it",
            "review_date": "2020-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film missed being maudlin or formula and intrigued me. I saw a life I wouldn't know anything about, and that changes my thinking. Great performances. This is a very very good film.",
            "review_date": "2020-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful. The story of a young man who suddenly becomes deaf. It is so realistic that you can feel (and hear) the hardness of his destiny and the way he finds peace. For the ones of us who meditate, it's very clear. Great sound design. Great actor. Bold storytelling.",
            "review_date": "2020-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sound of Metal is simply an extraordinary film. A film of deep empathy and compassion. A film of breathtaking honesty and emotion. One of the best this year without doubt. It's the story of Ruben Stone, a drummer in a hardcore rock duo with his partner Lou. Stone was an addict but has been clean for four years and his music and his partner are making his world very special. Until he starts to lose his hearing, fearing his world will come tumbling down. After consulting a doctor he learns the damage is beyond repair. A cochlear implant could help but it's expensive. Lou convinces him to go to a rural deaf community where he learns the life of being deaf. This is where the the bulk of the story takes place as we follow Ruben learning sign language but more importantly learning about himself as he navigates his new world. These scenes are a complete wonder, overflowing with stoic humanity and human empathy. Riz Ahmed is simply sublime as Ruben. His performance is one of such subtle beauty and power it left me floored. Amhed also spent months learning how to drum and also how to sign language, adding an extra layer of authenticity. The film is also a sonic masterpiece, from the opening scene of a ferocious gig to the many scenes where we 'hear' the world through Ruben's ears. We hear the muffled noises, the near silence. It truly envelops us in the film, making for an extra special experience. And the ending is one of the best you will see, a moment of pure harmony. This film I believe is a must see. It's raw and unforgiving, a great tale of recovery and moving forward.",
            "review_date": "2020-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed is outstanding, and with a nice explosive turn from supporting actor Paul Raci, Sound Of Metal is a intimiate look in the life of a musician his world getting turned upside down by losing his hearing, and experiencing the world of the deaf. Heartbreaking, yet a little tedious at parts, its worth a watch.",
            "review_date": "2020-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed is the best young actor going right now. He's phenomenal in this movie.",
            "review_date": "2020-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed gives the performance of the year in one of the best films of the year. Remarkable.",
            "review_date": "2020-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was so awful that I turned it off after 20 minutes. The \"music\" this band plays sounded like they had the actors just play with no training. It was so bad that I rooted for the guy to go deaf. They did nothing to make me like the lead character. If anything, everything the writer and director did made you just hate the guy more and more.",
            "review_date": "2020-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The subject of the first ten minutes could have easily been stretched to thirty.  And the last few minutes were captivating.  But the other 103 minutes were didactic and tedious.  I have nothing against the concept that deaf people should not consider deafness a disability.  And I am personally aware of surgery not producing the results expected.  The main section needed to be cut in half.",
            "review_date": "2020-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Sound of metal\" is deep and its innovative way of showing us a new way of fitting the sound mix into a film puts us closer to the character and his suffering",
            "review_date": "2020-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a great movie that let you understand that there is a different world out of your ears!",
            "review_date": "2020-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story, Ruiz is the man",
            "review_date": "2020-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RATING: A+  Director: Darius Marder\nThat Sound of Metal is a Directorial Debut absolutely flashed me away. This Movie could be on Number One on my Years Top List. The Two Stars of the Movie are without doubt Riz Ahmed ( who deserves as many Award Season Nominations as he can get ) and the Sound which was so Phenomenal.",
            "review_date": "2020-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everyone should watch this movie! Just that.\n\nOne of the best of the whole year, for sure. One of the best lead acting of the year, congrats Riz Ahmed. And one of the most intelligent things you're gonna see it. Trust me. Watch this!",
            "review_date": "2020-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One word: perfect. Sound of Metal brilliantly showcases Riz Ahmed's magnetic, sensational and powerful performance on full and fantastic display. Not only is Ahmed's performance in the film a stunning and painful work, but his co-stars, particularly Paul Raci as Joe who invites Ahmed's Ruben to seek help in living with deafness, is genuine, stirring, and uplifting. There is something simply stylish about Sound of Metal that director Darius Marder manages to capture, be it the horrors of hearing loss, the heartache and the climb, or the beauty that we can feel about something that is so truly raw and human. Sound of Metal is a masterpiece of modern cinema, and one of the best films I have ever seen.",
            "review_date": "2020-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Raw, original, heartbreaking, captivating, sad, yet inspirational and rewarding.",
            "review_date": "2020-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Arguably One Of Best Movies Of This Year!",
            "review_date": "2020-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outstanding from start to finish. The writing, casting, art direction, cinematography and sound design are all Oscar worthy. The story itself heartbreaking and powerful.",
            "review_date": "2020-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What really made this movie work for me -- was this specific character. 7.1/10, B-",
            "review_date": "2020-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic. So great. Love him",
            "review_date": "2020-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Righteous! Wicked. Love",
            "review_date": "2020-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie that gave me a different point of view on deafness, powered by a beautifull performance from Riz Ahmed. SOUND OF METAL 9.0",
            "review_date": "2020-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "CRUNCH TIME - My Review of SOUND OF METAL ★★★\n\nA good friend of mine, who has a disability, often shares with me his opinions of how cinema has looked at the various challenges as something to fix. He speaks about how through ableism, people get categorized as suffering from a disability rather than living with one. Some in the deaf community, for example, consider those who wish to hear again to be traitors. It's with this in mind that I came to watch Sound Of Metal, the narrative feature debut of Darius Marder (The Place Beyond The Pines), who co-wrote the screenplay with his brother Abraham, based on a story by Derek Cianfrance (Blue Valentine). The story concerns a hard rock drummer and addict who experiences hearing loss and enters a rehab center to reconcile with his new state of being. \n\nRiz Ahmed (Nightcrawler) stars as Ruben, the aforementioned drummer who, when the story begins, thrashes out a set with his lead singer/girlfriend Lou (Olivia Cooke) as part of their popular but decidedly small RV tour. Almost immediately, Ruben senses an issue with his hearing, and the fantastic sound design by Nicholas Becker immerses us in Ruben's plight, with high pitches, underwater-style rumblings, and more. We as an audience feel just as disoriented as Ruben, and it's a conceit explored throughout. Without health insurance, Ruben has few choices and cannot afford the cochlear implants a doctor discusses with him. Ignoring the physician's advice, Ruben performs at another show and further damages his sense of hearing. \n\nWhen Lou cancels the tour and leaves Ruben at the door of a rehab facility, you can feel his heartbreak. Ruben clearly lives for music and feels trapped in a hopeless situation. The facility manager, Joe (beautifully played by Paul Raci), takes away Ruben's comforts, including access to his phone, a computer, or anything from the outside world. Slowly, oh so slowly, Ruben learns ASL and finds a place within the deaf community. He befriends people like Jenn (Chelsea Lee), a genderqueer deaf person who oozes confidence, teaching Ruben there is life after a hearing loss. Ruben also has a nice chemistry with one of the teachers, Diane (The Walking Dead's Lauren Ridloff), and what could easily have served as a tired romance trope remains a gentle, platonic relationship. \n\nWe watch Ruben go through the many ups and downs of his hearing loss, from anger to denial to perhaps some unexpected places. Ahmed gives a gentle, soulful performance with flickers of rage when he feels especially unmoored. That the film works at all remains largely due to his commitment to the role. Unfortunately, as soon as the story leaves the rock world, it descends into a sluggish, PSA-quality tale. At the risk of sounding tacky, I think I expected Whiplash and got a concussion instead. The issues of the deaf community no doubt get handled with the utmost of sensitivity, but things sometimes feel a little too nicey-nice to work as drama. Don't get me wrong, some of this has an intensity and really makes you feel Ruben's loneliness. \n\nAdditionally, certain plot strands never pan out, such as the several scenes of Ruben sneaking onto Joe's computer, risking getting caught and expelled from the facility. Same goes for Ruben breaking the rules by entering his RV and selling it. I'm guessing the filmmakers didn't want to goose up the drama, but it results in a certain flatness at times. Olivia Cooke's performance rings true, never seeming like an actor playing a singer, but her character takes a backseat for most of the film. \n\nAfter quite a long slog, the film recovers in its third act with a fascinating plot development and an ending of quiet beauty. Thanks to Riz Ahmed's gorgeous performance, to his journey to accept stillness and peace, and the sensitivity to the deaf community, the final moment honors those living with hearing loss in a simple yet profound way.",
            "review_date": "2020-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mostly frustrating, but worth checking out. Kind of cliche portrayal of junkie metal musicians, which was used for all of the drama. It made me want to learn sign language though! Loved the parts at the recovery/learning home. I wonder if the duo was based of the band Jucifer?? Pretty cool sound design elements, but otherwise had the feel of a generic modern straight-to-streaming production.",
            "review_date": "2020-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "EAR DRUM\n\nThe nightmare of any musician, particularly a drummer, keeper of beat, keeper of time, is hearing loss. That is Ruben's dilemma. After a boisterous, mid-tour set, one half of a power duo starts to experience aural malfunction. Uh-oh.\n\nIn typical human nature denial, Ruben carries on, but is soon forced to make tough decisions. Scrambling desperately to get back on course, and continue his career, Ruben is eager to gamble on an expensive operation, while his vocalist girlfriend steers him to a recovery community, focusing on adaptation over cure.\n\nReuben's journey, careening between hope, desperation, struggle and revelation, is a fascinating one, amplified by the extraordinary presentation from director Darius Marder. Putting the audience in Reuben's ears the loss experience, through muffled passages, jarring distortions, and worst of all, total silence, is devastating. The eclectic sound design may be the star here. Closed captioned throughout so nothing is missed, the sub-titles, usually a distraction, become a fluid part of the viewing experience.\n\nAs a simple, uncomplicated young man jolted by a life altering shock, Riz Ahmed is terrific in a subtle yet demanding role. He absolutely rocks as a kickass drummer, a reluctant deaf student, and an empathetic partner willing to go any distance to make things right. The buzz about this film is not just in Ruben's ears.\n\n- hipCRANK",
            "review_date": "2020-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed is truly one of the best and most under-appreciated actors at this time. If he doesn't sweep awards season for this heart-breaking and real performance I'll lose all faith in humanity (not really, but it'll be a terrible choice by those choosing)",
            "review_date": "2020-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful and compassionate look at the deaf experience that is helped by a strong directorial debut by Darius Marder and one of 2020's best performances in Riz Ahmed.",
            "review_date": "2020-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sound of Metal is a gripping drama anchored by a strong lead performance. Riz Ahmed is absolutely fantastic here. Olivia Cooke and Paul Raci were also great in their supporting roles. The sound design in this film is impeccable. It makes the film stand out from others that tell this type of story. The film does a good job building character and telling a compelling story. It’s emotional and feels very authentic. There are certain points where you can tell where the story is going, but it’s still compelling throughout. Overall, this was a great film. It hooked you right from the start and keeps you engaged throughout. I definitely recommend checking this film out. ",
            "review_date": "2020-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz is a good actor.He is better and better. Good movie overall.Recommendation.",
            "review_date": "2020-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb acting from Riz Ahmed that demands awards attention. One of the year's best films.",
            "review_date": "2020-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two best things about the movie were the sound design and the performances. The design mimicks Ruben's hearing. It makes you feel like the character, to have a sense of what the character is hearing and what its making him feel like. I haven't seen a movie with such concept before. And Riz Ahmed nailed the character with his best performance since in The Night Of. He's on fire in this one. Really makes you feel for the deaf community, especially the ones who lose their hearing.",
            "review_date": "2020-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fine acting, and focused, educational storyline.",
            "review_date": "2020-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riz Ahmed is one of the most impressive actors of his generation and this film gives him the showcase role to solidify his standing. He plays a punk-metal drummer on tour with his girlfriend (Olivia Cooke who also turns in a moving performance). Things go sideways quickly when he suddenly loses his hearing. The character Ahmed creates is not only aggressive and determined, but ultimately venerable and touching. The script and direction seem a bit random at times (there are some lapses in logic), but it always returns to Ahmed's creation. The sound design also contributes to the experience of alternate hearing and open captioning is on screen to be more inclusive for a deaf audience.",
            "review_date": "2020-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If I had to choose one movie from 2020 that everyone had to watch, this would be it. The artistry of its storytelling -- the directing, the acting and the sound design -- is as pure as its message; that is, the journey toward accepting the things that cannot be changed change and seeking peace wherever it happens to be. \"Sound of Metal\" isn't an edge-of-your-seat white-knuckle thriller, but it's equally gripping in a different kind of way. Once it's got you, be prepared for a 130-minute immersive experience that holds on all the way to the end. It's the type of film that doesn't land emotionally until the credits start to roll; when the viewer has 10 minutes or so to contemplate the gravity of what they've just witnessed.",
            "review_date": "2020-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very emotionally satisfying. Perfect film.",
            "review_date": "2020-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching the film (on big screen), it is showing nation-wide, but goes on Amazon Prime on the 4th of Dec.  Best to see in a theater to receive the emotional affect of the images and power of the sound track...I saw it almost a day ago, walked out deeply affected and I am still feeling its depths and mulling its lessons on multiple levels.  The story is an exploration of the processes a metal musician goes through as he deals with becoming deaf...Riz Ahmed, who plays said musician is remarkable in the role, conveying through his eyes the range of his emotions.  Although most all scenes focus on him; you still feel that you cannot get enough of him because of that range and depth of feeling (& general good looks...love his profile with big eyelashes!).  You also learn much about the deaf community, and signing so the film is both a teaching lesson & a moving story.  Please go to see it and not only be entertained, but have your horizons expanded.",
            "review_date": "2020-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a movie about overcoming disabilities, I found it rather annoying that they made the subtitles so small that I could not read them",
            "review_date": "2020-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb acting\nStory line was incredible \nAddict in recovery-loss of hearing-new beginnings",
            "review_date": "2020-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A disconcerting experience. Riz is the man.",
            "review_date": "2020-11-20",
            "source": "rt",
            "lang": "en"
        }
    ]
}