{
    "title": "Fifty Shades of Black",
    "rating": 0.0,
    "release_date": "2016-01-29",
    "num_reviews": 416,
    "genres": [
        "Comedy"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "I tried to like it. I really did...",
            "content": "Let me preface this by saying I have never seen 50 Shades of Grey. I've seen the reviews, I know the story, but after seeing 50 Shades of Black I feel like I've seen the actual movie it was parodying. Wayans' comedies have devolved from clever self-aware satires to blatant movie rip-offs with sporadic laughs. The difference is, unlike the Haunted House movies, there are next to no laughs in 50 Shades of Black. It's essentially deconstructing every scene in 50 Shades of Grey to show the audience how dumb it is, which would be fine if it was actually funny. But no, this humor is scraped right from the bottom of the barrel, reusing the same stupid gags from previous spoofs and rehashed awkward shock \"humor\" that comes across more cringe-worthy than anything.I like Marlon Wayans, I really do. He seems like an awesome guy and he was actually a great writer one point, and a great actor too (to this day I'm blown away by his performance in Requiem for a Dream), but his talents must have gone to his head because he isn't tapping into his genius anymore. It's just easy joke after easy joke, and as simple as the jokes are, none of them land. In fact, at one point after a painfully awkward dinner scene that went on 5 minutes too long, I couldn't help but laugh, for the wrong reasons mind you, thinking, \"Jesus Christ, this is a real movie?\" It was painful. All of me wanted this movie to be good, but part of me knew it would be a disaster. Well, that part of me was right. Sure, I chuckled at a few scenes, but I also chuckled a few times in A Haunted House 2 and that's still a terrible movie. The difference is 50 Shades of Grey is even lazier and somehow even less clever than AHH2. I anxiously await the day the Wayans brothers come out with another great spoof movie, but I have a feeling it's going to be a long, long wait.",
            "review_date": "2016-02-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's time Marlon Wayans and Michael Tiddes be held accountable for ushering in the real lowest common denominator of humor",
            "content": "You would think with all the accumulated earnings the Wayans brothers, Shawn and Marlon, have obtained after being on Television and in films for years that they would invest their money and their time in projects that would be a bit more thoughtful and entertaining. Instead, ever since the runaway success of \"A Haunted House\" in 2013, the two, particularly Marlon, have been keen on making movies that fit the bill for the lowest common denominator of entertainment. \"Fifty Shades of Black,\" a horribly obvious and persistently unfunny array of cheapshots at the erotic novel/film series that is already too easy to joke about, continues Marlon's streak and incredible failing to make something out of his Baby Way Productions company.I've always found it interesting that while Tyler Perry's films are anything but consistent, and there are about an equal number of bad films in his catalog as good films, he often gets blamed for making films about black people that cater to the lowest common denominator and showcase them in a negative light, yet the recent collaborations of Marlon Wayans and Michael Tiddes go pretty much unscathed. These are films that evoke some of the most putrid and ugly stereotypes about nearly every race and, for that matter, exist simply as unapologetically crude and contrived projects that do nothing but attempt to evoke laughs based on brand-recognition. These films are just a slight notch above the dreaded works of Jason Friedberg and Aaron Seltzer.As hinted, \"Fifty Shades of Black\" is a parody of \"Fifty Shades of Grey,\" and it takes pretty much the safest, most convenient route to parody the film by making the jokes largely centered around the absurdity of BDSM and its culture, race and ethnic humor, the ordinariness and \"ugliness\" of its lead female character, and the enigma surrounding its titular character, who in this case, is Christian Black (Marlon Wayans). Christian is a multi-millionaire mogul who begins a sexual relationship with his new intern, Hannah Steale (Kali Hawk) and what entails is a relationship filled with sex, sexual violence, and downright bizarre encounters.While whatever Adam Sandler and his Happy Madison gang is cooking up this year is likely to get plenty of Razzie nominations, Marlon Wayans and his cast of familiar faces such as Affion Crockett, Missi Pyle, Mike Epps, Fred Willard, and more should be looking at the same award. It's incredibly rare to see a cast ostensibly operate on auto-pilot and look like the end product bearing some essence of quality is the furthest thing from their minds, but perhaps given the lazy screen writing of Rick Alvarez and Wayans himself, this was to be expected.Shockingly enough, \"Fifty Shades of Black\" offers more laughs than both of the \"Haunted House\" films put together, especially during a sequence that parodies one of last year's Best Picture contenders at the Academy Awards. However, in order to get to this sequence, one has to succumb to the drudgery of enough racial and bathroom humor - so much that it gives Laura Mulvey's concept of \"phallocentrism\" a whole different angle to explore - that it ultimately isn't worth sitting through the amount of trivial nonsense to get to that particular scene.We're not even in February yet and this year has already been incredibly interesting for comedies. After seeing \"Ride Along 2,\" I didn't think many more comedies of the year would get much worse than that. Then I saw \"Dirty Grandpa\" the following week and I thought the same thing; there was most likely the weakest comedy of 2016 that I would have to sit through. Now, almost exactly a week later, I've seen \"Fifty Shades of Black,\" and if this isn't the worst comedy of 2016, I seriously fear what I have to endure in the coming eleven months.",
            "review_date": "2016-01-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Fifty Shades you should see",
            "content": "People who hate Fifty Shades Of Grey (I bet there's a lot of you'se out there} will be appeased. Here, you pi..ed off many, will be compensated for your suffering. This comedy spoof, ala, Wayans, almost outdoes itself, near up there on the comedy scale with films like Bruno. They'll be chuckles aloud, in continuity. And we know if the Wayans are involved, we're not gonna be disappointed, smart brothers who know comedy but smart comedy with some gags you never see coming. They have an original style of comedy that's always a winning formula. What this film does, is that is it surprisingly sticks to the story and scene structure as the other one, almost to the letter, with some cute changes, one I particularly liked. Here, this one really takes the p..s out of the 2015 bore snore. Exciting lead, Wayans, replaces our dull Dorman, really throwing spark into the role, in top gear as Christian Black, while this time, our English lit student/journo replacement/part time hardware shop worker, and ordinary, known as Hanna, not Anastasia Steele, is wonderfully played by Hawk. From comical whippings to dejected, non helicopter/jet rides, this Fifty Shades has it all. We have some really crude moments involving male anatomy, someone who's really well endowed, shall we say. Hanna Steele's more likable flatmate here, is a chubby Rebel Wilson type who craves sex and food, and food, and food. Again we have many movie references (something I'm not really impressed by) a bit too many here, with a little bit of Zero Dark Thirty and I Spit On Your Grave 3, thrown in as well, as well as the dropping of a famous Porky's (easy lay) character. A couple of surprising co stars show up in this, like a still radiant and refined, Jane Seymour, and shocking as it is surprising, a cameo by a much recently missed Brady. This one has better everything, better script, better acting, entertainment value and appeal, for a number of reasons, most of them, laughably related. Fifty Shade's haters will love this Fifty Shades, trust me. You want something done right, different and smart, get a Wayans to do it. Good show and well made pic too.",
            "review_date": "2016-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fifty Shades of Crap!",
            "content": "The Fifty Shades of Grey, which this movie is spoofing, was nearly as bad as this one....Nearly. When i saw the preview for this movie i was actually excited to go and watch it. I eventually got tired of watching thrillers and action movies and wanted to just laugh at stupid people. The problem is i only got the stupid people part but no laughs.It's was dull, egregious, embarrassing, and just plain stupid. The funny days of Scary Movie 1 and 2 are long gone for the creators of this crap fest. Their once promising comedy future has inevitably burned out.I don not recommend this movie at all. Under no circumstances should anyone view this garbage. Side effects will include: abdominal pain, lower your IQ level, headache, anger, throwing objects at the screen, and financial bankruptcy.A huge number of the black audience actually got up half way through the movie and walked out, but then there were only 15 people in the theater opening day, I wish i did the same but i stayed since i spend $22 dollars and was trying to get my money's worth. It wasn't. Watch Kung Fu Panda 3. You'll get more laughs and joy for your money. Cheers!",
            "review_date": "2016-02-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Wayans movie will be raunchy and occasionally funny",
            "content": "If you're not a Wayans film, don't watch this. If you are, you'll enjoy it. It's not their best, but is better than much of their most recent stuff. I found myself laughing out loud several times - though the 2nd half wasn't as good. I'm surprised at some of the reviews - appearing shocked at the content! Why would you watch a parody of a sado-masochistic movie if you're not expecting potty humor??",
            "review_date": "2021-03-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "50 Shades Of Shite",
            "content": "After weeks of being teased by the trailer I was so excited to see this film! I was expecting 50 Shades Of Grey meets Scary Movie- you know, a parody that actually worked. But I couldn't have been more wrong. It was more 50 Shades Of Shite. Five minutes in to the film and I knew i'd spend the remaining 1 hour 27 minutes with my palm on my forehead, cringing for my life at it's stupidity.The film had potential to be very funny but the idea was crushed by the terrible acting, and pathetic excuse for dark humor. I can account for the two times, throughout the whole movie, I let out a slight giggle- well it was more of a scoff but at least it triggered some kind of emotion eh. As a kid I loved the Haunted House and Marlon Wayans was brilliant in it; I think this is why I expected great things. I think he should stick to his PG rating films. It's crude sexual content contained stereotypical 'humor' that could be considered racist towards African American's and many people could take offence. I find it offensive that we are expected to pay as much as £5 to watch this. Watching paint dry is more entertaining. I was counting down the painful minutes, praying for the movie to end. When it did, sheer disappointment and disgust was how I was left feeling about this movie. This film is a waste of time and a waste of a cinema slot.",
            "review_date": "2016-02-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Funny if you know what kind of joke to expect",
            "content": "People should be used to the kind of humor coming from movies with Marlon Wayans, so I don't get the point of people complaining the humor was offensive. If it's not your thing it's obvious you won't like it, the least you can do is learn that some actors/directors make movies you simply don't like.I only new enough about 50 shades (the book) and can't tell there is no need to watch the movie before watching this. At the beginning the movie doesn't really know where it's going, but after a while it finds its pace and delivers. Me and my friends had good laughs.",
            "review_date": "2016-04-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "More Misses Than Hits",
            "content": "I saw \"Fifty Shades of Black\", starring Marlon Wayans-The Heat, White Chicks; Kali Hawk-Bridesmaids, Couples retreat and Affion Crockett-The Wedding Ringer, Never Back Down.In case you could not tell from the title, this is a parody of '50 Shades of Grey'. Marlon plays the wealthy business man that tries to seduce the innocent young girl, Kali, into his world of sexual romper room. Affion plays Marlon's rather 'talented' brother, and when I say 'talented', I mean with the ladies. There is a scene where Affion has just finished satisfying a lady and is nude as he walks by the coffee table, knocking things to the floor with his.....appendage. The movie is good and bad; some jokes are funny but most are just silly as they seem to be trying too hard for a laugh. There are a few cameos. I remember seeing Jane Seymour, Florence Henderson, Michael Epps and Fred Willard. I guess it depends on how much you like this type of humor; it's not for everyone. Marlon is a co-writer of the movie. There is a lot of graphic language and nudity, and I have nothing against nudity, but here, there is more of the male kind and not enough of the female kind. It's rated \"R\" for language and sexual content-including nudity-and has a running time of 1 hour & 32 minutes. It's not one that I would buy on DVD. It would be alright, as a rental, if you are a fan. Otherwise, you might want to just skip it, entirely.",
            "review_date": "2016-01-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "So awful it makes you love \"Fifty Shades of Gray\" in comparison!",
            "content": "\"Fifty Shades of Black\" is yet another film in the idiotic teenager parody genre. This overused genre consists of many movies currently on IMDB's Bottom 100 list....with the likes of \"Disaster Movie\" (#1), \"Epic Movie\" (#12), \"Date Movie\" (#24), \"Scary Movie V\" (#50), \"The Starving Games\" (#44) and \"Extreme Movie\" (#99). \"Fifty Shades of Black\", incidentally, is #65 on this infamous list of badness. Unlike other films in this god-awful genre, this film is a parody of another film on the infamous Bottom 100 list, the original \"Fifty Shades of Gray\" (#92).This film is a bit different from the other crappy parodies I mentioned above. It is more a silly version of the original film and is NOT a parody of a dozen or more other films (which the above garbage films all are). Also, not surprisingly, it's MUCH more sexually-oriented...as \"Fifty Shades of Gray\" was a highly sexualized story. But this is much more crude than I even expected...and crude and unfunny scenes were piled on atop the other! It also has a lot of content that might make the more left-leaning audience members cringe or become furious. The leading man in this film is rich and successful like the one in the original story...BUT because he's black (Marlon Wayans), he says he made his fortune selling crack and sucking....well...IMDB won't let me say more about that. This is NOT the most positive and uplifting sort of black man, that's for sure!As far as the story goes, it's terrible....so terrible I found I much preferred the original film...which I still strongly dislike. Yes, they managed to make a worse version of an already terrible movie! Offensive, brain-numbingly stupid, crude beyond belief, and, sadly, a film marketed mostly towards younger folks (whose growing brains really don't need this!). Currently, this film is #65 on the Bottom 100....I think that is way, way too generous...especially after seeing the Florence Henderson (I am NOT kidding) sex scene!",
            "review_date": "2018-11-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "50 shades of whack! Which is 49 shades better than the movie they parody",
            "content": "I find it strange that Marlon Wayans found the need to parody what is already hands down the funnest movie of 2015. Does a bad movie, really need a parody? Seems redundant, but they did it.50 shades of black has some decent jokes that poke fun at how outrageous 50 Shades of Grey is (although my favorite bit was one that parodied Whiplash with Florence Henderson playing a music teacher training young boys to use their \"instruments\"), but the laughs are not constant enough through the entire movie to justify the money spent. It's good that Wanyans has no problem making light of himself, cause it's those skits that made for the most laugh out loud experience , but he also has no problem making a joke at someone else's expense. I probability would not care if the jokes were funny. There recent though, with a joke about the 2016 presidential campaign thrown in the mix. It's packed with enough laughs to get something out of it, but the material used to make this was too weak itself for this movie to be all that good.",
            "review_date": "2016-01-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Funny but, not Hilarious",
            "content": "\"Fifty Shades of Black\" (2016) is an entertaining film. The story is a direct parody of \"Fifty Shades of Grey\" where college student, Hannah Steele played by Kali Hawk, falls for unorthodox billionaire, Christian Black played by Marlon Wayans, but his sexual practices put a strain on what could become a beautiful relationship. The story is there for what could have been a heavy dose of comedy, but it doesn't seem to mesh well as the film could have.The director, Michael Tiddes known for over the top comedies like \"A Haunted House\" (2013), stayed true the style of comedy. Ever comedic take had funny laced in the dialogue or visuals and then amplified to drive it home. Occasionally it was a bit much. The music that filled most of the film was very intertwining and relatively spot on but, there were a few lapses in the sound department. Some of the voice-overs missed the mark and took away from the film. Overall, it was just OK but, still an enjoyably film.",
            "review_date": "2017-11-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "How did they get financing to make this disaster?",
            "content": "I have always been a huge fan of parodies, so I was looking forward to this movie. My expectations were realistic. Puns, slapstick humor, and generally sophomoric humor are fine by me. These parodies don't take themselves too seriously, and neither do I. The wife and I went to the theater expecting some lighthearted fun. But, what we saw was anything but fun or funny.This film's attempts to parody the plot of Fifty Shades of Grey were overshadowed by the stilted dialogue, lame sight gags, and ineffectual attempts to get a rise out of the audience with tired racial stereotyping and racist humor. Sexual humor was expected. But I did expect some of it to be funny. It wasn't. Most of the gags in the film were greeted by dead silence in the theater and blank stares at the screen by my fellow theater goers.We talked about walking out of the movie after the first scene, and every scene after that until we finally did walk out 20 minutes into the movie.Maybe there was a funny joke in that movie later on, but I am sure I will not be giving this movie a second chance. It is one of the worst movies I have even seen.",
            "review_date": "2016-01-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not for everyone, but I enjoyed it",
            "content": "This was my first movie at a new cinema in my town, and it was...nice. I really don't like Fifty Shades of Grey (the original one), but I enjoyed this parody, and man, it has some damn hot scenes, not a movie to see with your family because it's almost porn sometimes, in my opinion. The actors doesn't perform too well, it's that kind of comedy filled with stupidity sometimes, especially from Marlon Wayans who likes to behave like a child in some of his movies, but I think the man it's hilarious the e way he is. Well, I don't have something else to say about this movie, I've seen it almost half a year on 30 January when it first launched in Romania. As you can see, I'm a Romanian guy, and it's my first time when I review a title on IMDb, also I hope this review it's spoiler free, it's my first review, so be kind with me.",
            "review_date": "2016-07-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Too Soon?",
            "content": "Holy crap, I'm might get slack for this and I might be whack, but damn, did I crack up on this black\u0085spoof.I have heard nothing but bad things about this movie. Up and down, people and critics hated it. Plus it came and went like how fast the Christian in this film had sex. But, 30 seconds in, a laugh was forced out of me and I found myself laughing through to the end.That said, yes, admittedly, a ton of jokes did not work. Many forced, many just retreaded bad stereotypes they ran into the ground. But, for the times that they hit the head of the nail...I was almost in tears laughing. And to top it off, it was 100x more enjoyable than the \"serious\" movie it spoofed: Fifty Shades of Grey. Come to think of it, I laughed in both movies. Only this movie was intended to make me laugh.Like the other Wayans' project, Scary Movie, which, for the record, is way funnier, the movie is almost a shot-by-shot remake/satire of Fifty Shades of Grey. Sadly, as much as I've tried to forget that \"experience,\" I recall a ton here in \u0085Black as was in \u0085Grey. Again, there are a ton of scenes and jokes that just didn't work and were foreseen minutes in advance, but for the parts that did have me bust out loud, it worked. I know the criticisms, wait, actually, make that I *don't* know the criticisms. I haven't read, heard or seen anyone else's reviews – something I don't do before I see a movie and especially before I write my take, but I have heard people didn't like this much. I just could not hold back some laughter. I truly had a great time here. Enough to see a second time? Eh, maybe. Perhaps I was just in a good mood. I dunno. But, I do know this: I just finished this and I did have a good time here. Take that for what it's worth. Go in fresh, forget the complaints and maybe you'll laugh, as well.ESPECIALLY if you hated Fifty Shades of Grey as much as I did. ***Final thoughts: Man, I love to be surprised. Sometimes I love when my expectations are so low and the creative team of a film completely blows me away. They did it here and after what I heard about the upcoming Ghostbusters remake that I am (as of now, July 12, 2016) dreading\u0085I hope I am proved wrong there and I have a great time with their vision as well.",
            "review_date": "2016-07-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Better than 50 shades of Grey",
            "content": "This movie knows what it is.\nA parody. And a damn good one at that.Better acting. Better self awareness and better cinematography.Take it for what it is.",
            "review_date": "2021-02-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Funny as Always. . . Some lagging areas..But, Overall Good Jokes",
            "content": "Marlon takes aim at everyone in his humor in this movie. I found his political jokes quite funny. I really enjoyed the way they laid it into the writers and makers of the original movie. I never saw it because I thought the entire premise was sick and ridiculous. My view of that movie is pretty much in line with Marlon's, and his remake gave me many good laughs. There were many parts which could offend women, different races, political views, but especially fans of the original movie. lol.He does not hold back though, and I always find him to be original and funny. Just a little more effort and time on some of these and he could make them much bigger for all to enjoy. Thanks Marlon for all your works.",
            "review_date": "2017-03-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "a film that is a parody of a film that is a fan fiction of a film that already got a parody.. EUGH!",
            "content": "Here is my review in short. DO NOT SEE THIS FILM. It sucks worse than fifty shades of grey.. which is an absolute trainwreck. I didn't pay, but feel bad for giving any of my time to the film and as well as being unfunny it is incredibly boring, racist and horrendus. I chuckled about twice and one of those times was coz fifty shades of grey was read as a torture technique.. so well played. There was a skit involving whiplash which may have been bearable on SNL but not here.All i will say is save your time and oxygen. Go and be with your family, be anywhere but here. Quite frankly i saw 10 Cloverfield Lane today and i'd rather talk about that so.. see ya.",
            "review_date": "2016-03-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Film Review: Fifty Shades of Black",
            "content": "It was only a matter of time that someone came along and spoofed the widely popular and highly alluring pop-culture phenomenon that was Fifty Shades of Grey. What isn't surprising is that spoof specialist and kinda, sorta washed up actor/writer Marlon Wayans was the one to do so. Wayans, whose previous parody films include A Haunted House 1 & 2, Dance Flick and Scary Movie 1-4 brings forth a very important question with his newest spoof feature Fifty Shades of Black; is the spoof film finally, officially dead? Its hard to believe but, after such classics as Airplane!, Austin Powers: International Man of Mystery and yes, even the original Scary Movie, the spoof film may slowly if not almost entirely die off and be resting in peace very soon.The world currently is one that is obsessed with social media platforms and media within these social networks. Thanks to applications such as Vine, Instagram, Facebook, Snapchat and YouTube, it seems that audiences everywhere are capable of finding comedy and entertainment, not only within the comfort of their own homes, but as easily and accessibly, within moments, within the palms of their hand.When the dawn of the television was upon us, people everywhere thought that televisions were going to destroy Hollywood and the history of feature films altogether; it didn't. With the rise of the Internet and the quickly developing moment of streaming and illegally downloading films and music online, people soon thought that the future of movies and music was on its way on the decline. Yet, in 2015 no less, two of the highest grossing films of all-time were released, and more than ever, the profitability of music has never been better. So, how and why is the spoof film genre dying slowly but surely?The thing about entertainment in 2016 is that, entertainment isn't merely measured but numbers and margins, but by memories and moments of experience and spectacle, with margins and numbers as well. Entertainment is constantly evolving, and the forms in which we consume entertainment maintains the ways in which we determine whether the entertainment itself is viable, or not. The thing with earlier spoof films like the ones that were mentioned above are, in order to consume such comedy, going to the movie theatres and watching it for yourself was the only way of consumption. Now a days, not only are films, genres and characters spoofed on the daily, but pop culture, with the help of social media, spoofs the crap out of anything and everything. Don't think thats the case? Think back, just in 2015, to all the spoofs you saw online about Adele's song Hello, Drake's music video to Hotline Bling, as well as anything else flooding the front pages of your vine, Instagram and Facebook news feeds.The beauty behind the genius in the earlier spoof films of the 80's and 90's was that accessibility was limited and, these films weren't just spoofing a specific movie, having limited content to work with. Think of Austin Powers for example, it wasn't just a spoof on spy films and a filmography of more than a dozen Bond films at that time, but also a genre, the unbelievability of a lifestyle or profession little to nothing is known about, as well as providing a fantasy for the possibility of the many beauties the life of what an international person of mystery might really be like. Sure, Black may spoof Kim K for a second, the Weeknd here and there, but overall, these small and insignificant and highly forgettable inclusions did nothing to elevate the plot or humour of the film overall.If you're wondering why I haven't really mentioned the plot line or story of Black, well, thats because the film is basically a shot-for-shot carbon copy of the original Grey film, with added crass and crude black jokes included, sexual innuendos juiced up to the max and of course, taking what the original did, and making it funny by stripping away its glamorous and polished exterior; essentially, making it real world scary for real life people. No matter how you look at it, regardless of how much money you have, any girl would be scared of having a wealthy man stalking you at work asking for ropes and zip-ties and what not.What I found super interesting with Black was how the film is slowly accepting and transitioning from movie stars, to social media stars starring within feature films. Sure we've seen Vine stars make cameos in films before, like Brittany Furland in last year's We Are Your Friends, but in Black, social media icon King Back/Andrew Bachelor has a very prominent role as the not so subtle yet totally obvious best friend Jesse that wants a piece, like any other straight male friend wants from their female friends. Bach represents not only a dominance of social media within feature films, but perhaps, the next phase and new generation of movies stars tomorrow. Plus, is it just me or does Bach remind anyone else of a younger Will Smith?Sure Black states the obvious humours that we found in the original Grey film, but the beauty of Fifty Shades of Grey was that it knew that it was going to be the basis to much criticism, the butt end of endless jokes and spoof online for weeks and months after its release. Luckily for the film, made on only $40 million dollar, its return really laughed in all the faces of sceptics and all its negative criticism. Fifty Shades of Grey broke these records; highest grossing film directed by a woman, highest grossing February release and #1 President Day 4-Day Holiday Weekend (all of these numbers NOT adjusted for inflation). So I guess, the joke is on us, especially since they numbers and records are bound to be broken once the newest instalment of the series is released in 2017.",
            "review_date": "2016-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Fifty Shades of Black\" is a decent parody, but the truly funny moments are few and far between,",
            "content": "The Wayans Family has created quite an entertainment dynasty over the past three decades or so. Long before anyone had heard of Tyler Perry, the Wayans Brothers, as most people refer to them, started creating big and small screen entertainment that catered to the African-American audience. The Wayans brought us the sketch comedy show \"In Living Color\" (1990-1994) which, in turn, helped launch the careers of Jim Carrey, Jamie Foxx and David Alan Grier, among others, as well as films like \"I'm Gonna Git You Sucka\" (1988), \"Major Payne\" (1995) and the \"Scary Movie\" horror film parodies (2000-2013).The Wayans are mostly known for their parodies. 2016 adds another one to the list with Marlon, the youngest of the original \"Wayans Brothers\", co-writing and starring in \"Fifty Shades of Black\" (R, 1:31). Most will immediately recognize that this film is a take-off on 2015's very successful film adaptation of the book \"Fifty Shades of Grey\". Like most of the Wayans' films, pop culture and movie references abound, but \"Fifty Shades of Black\" duplicates much of the plot of the film that inspired its comedy. You'll see what I mean in the following plot summary (which, by the way, is necessarily risqué).Hannah Steele (Kali Hawk) is an attractive and intelligent college senior in Washington State who fills in for her sick roommate, Kateesha (Jenny Zigrino) in interviewing billionaire business magnate Christian Black (Marlon Wayans) for the college newspaper. Hannah gets flustered in the presence of this sophisticated, supremely-confident and mysterious man. Christian is quite taken with Hannah – and take her is what he soon decides he wants to do. He shows up at the hardware store where she works, takes her out to coffee and even comes to \"rescue\" her when she drunk dials him from a bar. Despite how obvious it is to the main characters and to the audience that these two are very, very different – and despite the title character's own conflicted resistance – these two cannot resist each other. But Christian very clearly states, \"I don't do romance.\" That doesn't stop Hannah from being drawn to this man.As Hannah discovers more about the cipher that is Christian, she learns that he is wounded – both emotionally and physically – by his childhood. She seems to want to comfort this man who acts as if he needs no comforting and begins to love this man who tells her that he is only interested in her for sex. Being the woman in Christian Black's life means submitting completely – sexually and otherwise – to his whims. As he eases her towards an understanding and acceptance of his lifestyle, she has to sign a non-disclosure agreement, he convinces her to have sex (actually \"f--- hard\", as he describes it) and then shows her his \"playroom.\" This usually locked room is painted dark red, has a bed and is filled with various restraining devices and implements of sadomasochistic sex play. Hannah is shocked, but not necessarily repulsed. Christian presents his contract which describes Hannah's role as his submissive.I just did something I've never done before (or even been remotely able to do) in a movie review. The previous two paragraphs are actually cut and pasted from my 2015 review of \"Fifty Shades of Grey\"! Using the \"find/replace\" function in Microsoft Word, I changed the names of the characters and the actors playing them to match those in \"Fifty Shades of Black\" and I shortened the summary, but I did not add or change anything else. (You can scroll down our timeline to my \"Grey\" review to see for yourself.) But rest assured there's plenty in \"Black\" besides just recreating and making fun of scenes from \"Grey\". \"Fifty Shades of Black\" also seamlessly incorporates Wayans-esque versions of scenes from such movies as \"Whiplash\" and \"Magic Mike\". There are also references to a plethora of other popular movies, TV shows and books, plus a generous helping of pop culture satire and some politics. This is the kind of film which is so fresh, it feels like it was written a month before its release, but that means that its humor (and perhaps its appeal) will quickly become dated. Of course, there's also plenty of racial humor, much of it stemming from white actors Jane Seymour and Fred Willard playing the title character's parents.Like much of the Wayans' work, \"Fifty Shades of Black\" is very funny in spots, but those spots are small and spread out. The few clever/amusing jokes and sight gags and even fewer laugh-out-loud moments seem adrift in a sea of gross-out humor and over-the-top acting which is often not that funny. Still, most Wayans fans will probably enjoy the film and those who've only seen a little of their work may find this one good enough for a mild recommendation. \"B-\"",
            "review_date": "2016-01-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Truly Appalling",
            "content": "How the heck does tripe like Fifty Shades of Black get funding let alone distribution? It makes Fifty Shades of Grey look like Shakespeare. Crap like this certainly doesn't help the diversity argument. Personally I would never employ any of the participating actors; black, white or any other skin colour ever again. They were all an absolute disgrace. There are films released this week that people will struggle to find whilst this garbage will stink up cinemas up and down the country for at least a week. God knows why I stayed so long but I eventually walked as no way was I going to miss my last bus home for this bilge. If you are given the choice of being tortured or watching this; I urge you to choose the torture. It won't be anywhere near as painful. Trust me",
            "review_date": "2016-03-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Really funny",
            "content": "This film tells the story of a young woman who interviews a rich businessman.When you watch a parody, you know it is exactly what it is that you are watching. It is ridiculous, scandalous and gross, but it works. The film is so funny that I just cannot stop laughing. The sets are really stylish as well, so it is not the typical cheap parody.",
            "review_date": "2018-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This movie is...marvelous.",
            "content": "I've been a big Wayans brothers fan ever since the release of their 1996 movie, \"Don't Be a Menace to South Central While Drinking Your Juice in the Hood\". Before that I really didn't understand any of their work. It was too artsy, too intellectual. It was on \"Don't Be a Menace...\" where Marlon Wayans' presence became more apparent. \"Fifty Shades of Black\" an epic meditation on intangibility, at the same time it deepens and enriches the meaning of the preceding movies. Look to the brilliant ensemble playing of Wayans, Hawk and Zigrino. You can practically feel every nuance of every human emotion. In terms of comical craftsmanship and sheer beauty of Hawk's boobs, this move hits a new peak of professionalism. The whole movie has a clear, crisp look and a new sheen of consummate professionalism that gives the script a big boost. He's been compared to Chris Rock, but I think Marlon has a more bitter, cynical sense of humor. Take the \"Wesley Snipes tax\" gag. In this segment, Marlon Wayans addresses the problem of abusive political authority. I think that this movie is Wayans' undisputed masterpiece. The script is so witty, that most people probably don't think about deep underlying themes, but they should, because it's not just about the pleasures of conformity and the importance of trends. It's also a personal statement about the author himself. Most importantly, Hannah's fiery monologue at the end of the movie encourages us to oppose racial discrimination and promote civil rights, while also promoting equal rights for women. Also, the masterfully crafted politically correct script reminds us that we have to promote general social concern and less materialism in young people.",
            "review_date": "2016-02-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Could have been better/funnier",
            "content": "As being a parody of Fifty Shades of Grey (although haven't seen the original), expectations of this film weren't too high as was expecting a silky over the top comedy with a few casual clever gags.Well this film is as expected but still not very good. The plot is essentially the same as the original, just as a Marlon Wayan's version. There are a few laughs and don't decent gags but overall expected a little better. There were more misfires than hits, and a lot of jokes felt far too forced.After all, Marian Wayan's comedies are for a selective audience and if you are familiar with his work or have enjoyed some if his previous material, you may enjoy this. Although Fifty Shades of Black isn't better than a Haunted House.",
            "review_date": "2020-10-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "50 shades of crap",
            "content": "Definitely a stinker. Not really that funny. I cant reccomend this one.",
            "review_date": "2019-12-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I see \"Oscars\" written all over this . . .",
            "content": ". . . now that Jada has car-jacked the Academy to the point that any Urban person with three movie ticket stubs has a vote (making \"4\" the new \"10\"). \"Fried chicken and Koolaid is a very popular dish in Detroit,\" and a multitude of similar future pop culture catch phrases virtually guarantees a Best Original Screenplay statuette to Marlon Wayans. These new Urban voters will be encouraged to honor the Traditiion of awarding the Best Picture Kudos to a remake, as was the case when that updated version of GONE WITH THE WIND (that is, TWELVE YEARS A SLAVE) recently won. In that respect, 50 SHADES OF BLACK is Triply Blest, translating the vanilla aspects of 50 SHADES OF GREY into full color, as well as reenacting the soap-flogging scene from TWELVE YEARS. Therefore, 50 SHADES OF BLACK is a shoo-in for a Best Pix Nom, if not a lock for the Top Spot (admittedly, it's a little early for 2017 predictions). And if Christian's brother \"Eli Black\" (Affion Crockett) doesn't bring home the Best Supporting Actor trophy, then there's no justice in this world!",
            "review_date": "2016-02-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "my notes",
            "content": "A lot of jokes missed but i laughed a lot. very similar to haunted house 1&2 (2 viewings)",
            "review_date": "2019-06-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nice comedy you should see it",
            "content": "Very Good Comedy.I rate this movie based on fact that it was meant to entertain and hype me- It did its job well.And when I mean hype I mean I had very low expectations, and it really met them. This film is pure gold, it has all these black people culture jokes, penis jokes, toiler jokes, sex jokes, all the love you need.The whole movie makes you wonder, what else unexpected turn of events will happen, what does the director of this masterpiece throw at us in the next scene, you are basically tense throughout whole movie.So if you want to have FUN by making fun of quality black humor this film is the best for it.I rate it 9 out of 10.",
            "review_date": "2016-04-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Surprisingly not bad",
            "content": "I had low expectations going in, there was a time when a movie with a Wayan family name attached to it was guaranteed to be funny (Major Payne and Scary Movie come to mind) but in recent years their quality has dropped to an all time low.If any movie deserves a parody, however, it is Fifty Shades of Grey. Although to be fair the movie was hilariously awful enough on its own. What you get is a typically low brow movie which basically rehashes the original but exaggerates it even more.It's not going to win any Oscars, and not all of the jokes hit. If you've suffered through Fifty Shades of Grey (and I'm sorry if you have) you'll appreciate the ones that do. They skewer the original very well.A good movie to watch if you're bored and want something totally mindless, just keep your expectations low.",
            "review_date": "2016-04-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Is it black or grey?",
            "content": "The first \"meeting\" of the main female character and Mr. Black is maybe the high point of the whole affair (excuse the pun). It kind of depicts how ridiculous the other movie is. But then again, we already knew that didn't we? There are a couple of scenes that hold their own just because they have such a simple and easy task, when you go back to the source material.There is one scene though that tries to make fun of Whiplash, in a sexual context. While the overall idea isn't that bad, the execution is very weak. I guess we have to an understanding at this point, that Mr. Wayans will do anything silly, and he has an audience for that, that he keeps happy I reckon. So this niche gets served too. There is some nudity if you wonder, but all in all it's just juvenile",
            "review_date": "2017-04-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Better than the real 50 shades.",
            "content": "Way more entertaining, sexy, and more realistic chemistry between the leads than in the actual 50 shades movie. Watch this one. It's just silly fun.",
            "review_date": "2021-02-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "comedy version of fifty shades of Grey",
            "content": "that is so so full of comedy movie it is comedy version of fifty shades of Grey whole story is same as i guess but topic are now changed Grey is all about romance and drama and this is just all about comedy or else you can say this is same comedy version like meet the spartan is comedy version of 300 so when you are going to watching a comedy version of any film make sure you did watched it's original version it makes you more laugh. i enjoyed full movie very very much nothing to tell because same as of Grey version but in Grey movie you will enjoy some sex scene and here this guy just come out it 1 min and movie is full with this type comedy and the best dialogue i listen it is when the girl beating men with hunter and she said,\" And this is for the little white girl in Fifty Shades of Grey she had to be naked in whole movie! this is best dialogue. i don't know why it's IMDb rating is 3.5 i noticed people is not rating much to comedy movies but i give it 9 . some movies have low rating doesn't mean it is flop this is one not it earn doubled then it's budget. i don't know why the i am not watching it for a long time i thought it is just same as the Grey version but yesterday when i watched it's trailer then i got interest.",
            "review_date": "2016-07-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Better than the original.. probably not saying much..",
            "content": "50 shades of black lampoons the much over-rated 50 shades of gray movie and book quite successfully. I must point out that I was no fan of the original; I found it quite drab, unexciting and appalling in its messaging so I was interested to see someone had done a send-up.The movie's very undergraduate and crude humour is bound to offend some people, and it could have worked better in a comedy sketch format TV show, but seriously, the original was so bad this has to be fair game. I was surprised this made it to cinemas; I suspect it went straight to DVD in this country and that's not so surprising really.I did give this an extra star for Florence Henderson's scene; there's something especially naughty seeing Mrs Brady in THAT sort of scene...",
            "review_date": "2016-07-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Much better than anticipated",
            "content": "\"Fifty Shades of Black\" satisfies my primary criterion for comedies: Did it make me laugh? It did. I haven't seen \"Fifty Shades of Grey,\" so don't know which parts were parodies or how effectively the movie lampooned its inspirational material. Some of the gags fell flat, others seemed poorly executed, but many made me laugh out loud. The humor isn't politically correct in the least, but I consider rectitude the antithesis of comedy. Much of the humor involves racial stereotypes, but rather than being mean spirited toward minorities, it often ridicules the ignorance of bigots. The sexual content, as well as the sadomasochistic elements were low key and conservative, despite the R-rating in part for \"some graphic nudity,\" which comprised obviously prosthetic phalli and scrota, and one left breast that looked better than real. Production values were more than adequate with a refreshing lack of distracting camera jitter. Performances were solid throughout, with all the actors committed to roles that weren't always flattering. Kudos to Jane Seymour and Florence Henderson for their unabashed performances, as well as to the rest of the cast. None of the actors seemed self-conscious in the least. My chief reservation is that they didn't push the envelope a little further. The bondage scenes and Steale's brassiere and panties ensembles became a bit repetitive. Some of the situations could have been mined for more humor.",
            "review_date": "2016-05-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Typical Wayans...",
            "content": "I've always been a fan of the Wayans brothers but appreciate that there is little middle ground with most people falling into two catagories of either loving or hating their stuff. There is also a lot of discussion regarding the content (especially racial) of their films. All this aside, they have found a successful formula so can't really blamed for running for it. Hollywood has done it constantly for years now and few complain about that.I actually watched this before watching the film that this parodies. I'm unsure if that was the right thing to do or not, but if you have not seen Fifty Shades of Grey, this should still satisfy their fans, or fans or downright silly and extreme sexual humour (with plenty of racial stereotypes thrown in as usual). The film never lets up with the absurd jokes and senarios and if you have seen Grey, this pretty much parodies that film scene for scene (even down to the dialogue at times).Marlon Wayans plays Christian Black, a billionaire businessman who has made his money the way most black entrepreneurs have. No not through real estate, but drugs. Kali Hawke plays Steale, the niaeve and shy young woman who Christian quickly becomes obsessed with. Unless you have been living under a rock or in the middle of the rainforest, I'm sure by now most people are aware of the content of Shades and how much controvery and critisism both the books and the film have received.The jokes here and dumb, silly, slapstick, crude and sexual in nature, playing largely on the BDSM content. A lot of these jokes miss, a lot are funny if you leave your brain down the road before watching. I really do not understand the critisim this particular parody has recieved though. Wayons does what he does, and while of late his acting and writing may not be up to what it once was, you should know what to expect from one of his films by now. Why watch and then compain about the offensive humour? I thinksome people like to moan for the sake of hearing their own voices.To sum up, this is not a good film, but it does have its funny moments and is not a film to anylise in great detail but to watch, giggle, facepalm and then forget. If you're a fan of Wayans and of crude sexual jokes then give this a try but don't be expecting any great comical genius from it.\nThe Sage's Rating: 6/10",
            "review_date": "2020-04-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Well heck",
            "content": "Still better then the original.\nWatch this instead of 50 shades of grey.",
            "review_date": "2019-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Dirty Minded 8 Year Old Could Write A Funnier More Entertaining Script",
            "content": "Fifty Shades Of Black Spoof of Fifty Shades Of Grey, College graduate Hannah Steele enters a complicated relationship with wealthy businessman Christian Black. Deep,deep joy. Another painfully unfunny spoof that takes nearly all it's material from previously made content. That is the basic definition of Fifty Shades of Black. There was only one point during this film that I wanted to laugh but because of how bad the rest of the film was I couldn't. There are two main problems with this film. 1. The script is really, really awful and is not funny in any way and 2. Nobody in this film can act! Those are two vital things to make a comedy funny the acting and the script and if both of these fail then the film is just terrible, which is what this pile of trash is. All jokes are about Fifty Shades Of Grey and it's content and might as well be an adaptation of a joke book of painfully unfunny sex jokes. There are so many moments intended to make people laugh but just end up being horribly cringe worthy moments because of either what can be seen or just what is being said. There were points where people moaned in disgust at the goings on on screen and the majority of the film was spent in silence. In total two different people ,out of 13, laughed at two different points, 3 people walked out during the film because of how bad it was.Nearly all of the characters in the film are annoying and this is made even worse by the terrible acting. During the film Marlon Wayans character describes something as \"painfully uninteresting\" and something else as being written by someone in year 3. Fifty Shades of Black is painfully unfunny and boring and could have been written by a dirty minded 8 year old. But then again the 8 year old would have probably wrote something much more entertaining and funnier. It isn't as bad as other parody films but Fifty Shades Of Black is still a seriously unfunny film and is definitely one of the worst films of 2016. ** <-- Two Stars",
            "review_date": "2016-03-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great Parody Movie",
            "content": "First of all I cannot understand why the current featured review of this movie is by someone who admits he hasn't seen 50 Shades of Gray ... that makes him totally unqualified.This was a great parody. Kali Hawk bears a striking resemblance to Dakota Johnson. Kali's performance is impeccable; she captures every detail of Dakota.It's also difficult to understand the low ratings. If you saw Gray you'll love Black.",
            "review_date": "2019-08-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Flat jokes, and just a bad parody to an already bad movie",
            "content": "Fifty Shades of Black serves as the second Fifty Shades movie and the reality that these movies are still being made, even though the cast and crew knows that it sucks, but they don't care because they are just now have enough money to spend the year in Las Vegas. It's already starting to cause me even more pain.This movie serves as a parody to Fifty Shades of Grey, but the bad thing about it is that it is not even funny or different from the same old toilet humour that is used so often in comedy movies nowadays. There was not one moment where I chuckled or even sniggered. I think I did laugh, but that might have been at the movie not with the awful cliché jokes that I've already heard in these comedy movies.And it's such a shame to see a talented actor like Marlon Wayans, who before offered a fantastic turn with Requiem for a Dream and then made us chuckle with the first two Scary Movie films, and then to see that talent wasted in this abomination of a parody movie. I hate it when actors just become overpaid tools in movies that they know are bad but they are just in it for the money, when they know that they are better than that.The thing is that Fifty Shades of Grey was anything but a good movie to start off with, so parodying a movie that is already bad doesn't make it any better or more enjoyable. I mean, this movie could've been funny in some places, but the dick and ball jokes that this movie overuses so many times just failed to hit.Not to mention it's out of place references to other movies, not just Fifty Shades of Grey, but you can tell from the poster that it's making those references just to try to be funnier, and to their credit, no, they failed.If you watch one movie early this year, Fifty Shades of Black is definitely not worth recommending when you really should just buy another ticket for Deadpool.Overall rating 1/10.",
            "review_date": "2016-03-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I'm the 100th review for this movie!",
            "content": "I see so many 1s and 2s, this movie may not be a perfect 10 but it's definitely worth more than a 2 so hopefully my 10 will bring it up a bit.It's everything I wish Marlon did more of, pulls no punches, disgustingly laugh out loud funny. I consider this progressive humour, it's not afraid to make fun of all genders and races, so much comedy is censored and tame these days this is what the world needs more of, but don't watch it with your family!",
            "review_date": "2021-12-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Please do not believe the negative reviews",
            "content": "I cannot believe they rated this movie 7% on Rotten Tomatoes and 3.4 on here. This was one of the funniest comedies I have seen in about a year or so. All the characters are hilarious and the script was really funny and well written. Please do not believe the negative reviews on this site or others. I usually never write reviews but after watching the movie and laughing hysterically, I was compelled to write one. There was a joke almost every 2 minutes or so which kept me engaged and I even missed out on a few jokes because I was laughing too hard. I did not even watch 50 Shades of Gray and this was still really funny. If you like movies such as Scary Movie, White Chicks and Dance Flick you will surely love this. Give it a try, you will not be disappointed.",
            "review_date": "2016-04-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Possibly the worst film I have seen in 20 years",
            "content": "I see many films. I admit that Comedy is not my favorite genre (at least, let me rephrase that - American comedy is not my favorite genre - I do, however, like black comedy, UK comedy).THIS film I knew nothing about, so I expected nothing. Usually when you expect nothing you are sometimes surprised right? Not with this - with this I expected nothing and got NOTHING. The \"jokes\" and I use the term loosely, are incredibly forced, as is the terrible TERRIBLE acting. The \"plot\" and I use that term even more loosely is practically non-existent, so there was not even THAT to carry the film through.A few instances of the film tried to be \"gross\" to be funny, such as the incredibly long penis scene dipped into the cereal bowl, and the incredibly large blue-balls testicle scene.Do not waste your money...in fact, don't even waste your internet downloading this complete and utter American trash.",
            "review_date": "2016-04-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Masterpiece We've Been Waiting For",
            "content": "Fifty Shades of Black is a refreshing art-house indie film as it aims to jab with it's power and ferocity instead of cuddling itself up with convolution. It's emotionally mature, capturing race and culture so insight fully and sensitively and it script really cleverly dissects racial stereotypes and turns it on it's head. Never since Birdman have I seen such a power-house of a film hilariously and truthfully mirroring Hollywood and the state it is in. By parodying Fifty Shades of Grey, one of the few masterpieces of 2015, not a year before it was made turns Hollywood's state of remakes on it's head. Marlon Wayans is fantastic, bringing his charisma, energy, and displaying the raw and powerful emotion we thought he had lost after Scary Movie 2. And how this film turned out to be the masterpiece of cinema it is is just an accomplishment. An insightful, hilarious and culturally sensitive film this is a special landmark and kicks off 2016 with art-house genius and style.",
            "review_date": "2016-05-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Black is back",
            "content": "The Wayans family have made a dubious reputation for making parody films and Marlon Wayans stars and co-writes this parody of Fifty Shades of Grey.Hannah Steele (Kali Hawk) interviews successful business entrepreneur Christian Black (Wayans) and becomes enchanted with this womaniser, she finds herself in Christian's flashy apartment where he gives her a contract where she agrees to take part in S&M in his Red Room which is decked out with various sexual toys and implements. However it turns out that Christian Black is no good at sex, lasting mere seconds before climaxing and his manhood is very small.The best part of this movie is when it rips off Whiplash which was good. As for the rest, the book Fifty shades of Grey is a parody in itself and this effort is too thin, too obvious and unfunny.",
            "review_date": "2016-04-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hurt me in all the wrong ways.",
            "content": "Marlon Wayans has crushed what's left of Scary Movie spark until it's near unrecognizable and that's before A Haunted House. At this point nothing remotely funny is assembled, in fact most of the jokes are excruciating, not in the good ways. It spams so much ghetto references, slapstick scenes that are numbing at best and repeatedly flashes repulsive materials.Plot is as thin as cheap toilet paper, mocking the original movie, which might not be great but far better than this abomination. It comes to the point that making the halfway mark feels like a torture, it just goes on with the same loud noises, putrid display of exaggeration and poorly used rough language.If flogging is an option other than this deformed movie, easily choose that as a less painful alternative.",
            "review_date": "2016-04-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I find this film to be garbage",
            "content": "This was a big waste of a film. Everything about this movie was a re cut of \"Fifty Shades of Grey\" making fun of it scene by scene , and while that worked for one or two scenes of the film a lot of the rest of this was filled with sex jokes, poop, and other stupid things. I didn't find the film funny on any level. Many of the scenes I felt disgusted by more than anything else. This film is full of stereotypes for African Americans. Trying to be funny but failing on all accounts. I began to wonder why this film was so stupid, and dull for me and then I saw the director. Micheal Tiddes, who also worked on \"A Haunted House.\" How is this guy such a success. His comedy is so out there and dull, and his parody style is so grotesque that I find it kind of insane that he is still around and making so much money off of people. This is a poor film and doesn't deserve the light of day. Sorry Fifty Shades of Black but you have failed the movie business.",
            "review_date": "2016-02-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I Laughed Way Too Hard.",
            "content": "I don't know know why the ratings are so low - I laughed through the whole thing! I'll totally watch this again! Also, I can't submit this review until it contains 150 characters, so .... BABABOOIE BABABOOIE.",
            "review_date": "2021-11-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hilarious!",
            "content": "You people have no sense of humor. I was crying through the whole thing. Entire lead cast was hysterical. RIP Florence Henderson.",
            "review_date": "2019-07-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hilarious, if you watch it in increments",
            "content": "This movie is better suited to a YouTube mini series or a Vine-style comedy. It is hilarious, but only if you don't actually watch the whole thing in one sitting.I watched this movie during study breaks at about 10-20 minute increments at a time. It is definitely cringe-worthy and there are some scenes where the humour is really grasping at straws.But one thing the film has going for it, is that it really follows the original 50 Shades to a T, and when it pokes fun at it, it's really spot on. I personally hated 50 Shades of Grey, and enjoyed spending my breaks entertaining myself with senseless humour every so often. I can't imagine actually sitting through the whole 1 hour and a half of it in one sitting, but I did appreciate the laughs this movie gave me. Best enjoyed in increments - Probably not the best compliment a movie could have, but it does enhance the watching experience in my opinion.",
            "review_date": "2017-01-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Disneyland for grownups",
            "content": "This is an urban spoof of the film \"50 Shades of Grey.\" As expected the humor is crude. The jokes were hit and miss. The film seems forced as if they were rushed to get the film on tape and didn't bother to develop their jokes, instead relying on crude humor. Not nearly as good as Marlon Wayans' other works. There are some good lines, but not enough to carry the film.Guide: F-bomb, sex, fake male nudity.",
            "review_date": "2018-03-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hardly a noteworthy spoof...",
            "content": "Of course Wayans would delve in a spoof and farce on the success of \"Fifty Shades of Grey\". And it is, of course, done in the very same formula and routine that every other Wayans spoof is done, so there is no deviation to be expected here.And with the fact established that the very same, and too often abused, formula applied to the movie, you can expect very little in terms of originality, concept or surprises. So if you are a big fan of the numerous other Wayans spoofs, then chances are very high that you will enjoy this one too. But personally, then I think that formula has been worn down to the bone and it is time for Wayans to go back to the creative corner and come up with something new.The end result that is \"Fifty Shades of Black\" turned out to be not particularly funny. Sure, there were some good laughs here and there throughout the course of the movie, because of the jokes or the situations. But in overall, then this was a very generic and flaccid movie, which could have been a lot more funnier with some more creative and original writing.I will actually go as far as saying that if you have seen any one of the many previous Wayans spoofs, then you have essentially also already seen \"Fifty Shades of Black\".Now, I haven't seen the \"Fifty Shades of Grey\" movie, nor read the book, and I have no intention to do so. So how much or how little \"Fifty Shades of Black\" stays true to the original source material.However, all in all, then \"Fifty Shades of Black\" was just another generic spoof comedy that failed to stand out or leave any real lasting impression.",
            "review_date": "2017-04-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A very bad \"comedy\"",
            "content": "An apparently filthy rich guy meets a poor but attractive young girl, eager for a new and more interesting life. This new person that enters her life is about to show her a part of fetishism and fantasy that she never thought about before.It's an ordinary comedy inspired directly from \"50 Shades of Grey\" and seems to take the parody part to the extreme. It simply makes fun of everything portrayed in the original movie, without any shame (which could be a good thing), but unfortunately without any sense of fun. It tries desperately to make you laugh but as it happens with every single movie that does this, it fails miserably. You struggle to find a couple of funny scenes, laughter being something rare in this one although it's supposed to be a full-time comedy. The plot is not something to take into account as well as all the characters from this so called movie.It's not a disappointment because didn't have high expectations regarding it but it is without any doubt a very bad movie from every point of view, something from which you should run, far, far away.",
            "review_date": "2017-08-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fifty Shades of Bleh",
            "content": "Marlon Wayans has been on a parody trip his last three movies. Haunted House--which was decent, Haunted House 2--which was atrocious, and now Fifty Shades of Black--which was OK.It may or may not have helped if I'd seen Fifty Shades of Grey. Since I didn't see it and have no intentions of seeing it I figured watching this would clue me in while giving me a laugh or two. I got a few chuckles though nothing gut-busting. Marlon is still raunchy and crass. Sometimes it works but most times it doesn't.Be prepared for PLENTY of sexual humor and a loose story that allows some shots to be fired at other movies and other celebrities. It's not cleverly done, but most Wayans movies aren't. You may laugh or you may cut it off after the first scene.",
            "review_date": "2016-05-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What a guilty pleasure",
            "content": "This movie is not a masterpiece at all... but definitely a funny slap stick raunchy comedy!",
            "review_date": "2019-08-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "one comedy and bland",
            "content": "Fifty Shades of Black is another strong contender for the Golden Raspberry, I was even willing to watch this movie because of Marlon Wayans , I particularly liked A Haunted House 1 and 2 , and I thought this movie would be better the Fifty Shades of Grey, I was mistaken , Fifty Shades of Black can be worse , the cast is quite interesting , plus the acting is bad , or the Wayans is good, the script is very poorly written , full of errors is ridiculous dialogues , the film has to a almost funny references, such as the whip scene , I do not laughed seeing this film , the maximum was almost , the direction is weak , the soundtrack is average , Fifty Shades of Black is a bad movie , with funny moments especially zero . Note 1.3",
            "review_date": "2016-05-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The movie is almost as painfully bad, and crude and offensive, as 'FIFTY SHADES OF GREY'!",
            "content": "'FIFTY SHADES OF BLACK': Two Stars (Out of Five)A spoof of the blockbuster erotic drama flick 'FIFTY SHADES OF GREY' (and the book it's based on). The film was directed by Michael Tiddes, and written by Marlon Wayans and Rick Alvarez; the same trio performed the same duties on both 'A HAUNTED HOUSE' movies (which are parodies of the 'PARANORMAL ACTIVITY' flicks). Wayans also stars in the film, as Christian Black; a rich entrepreneur with an obsession for stalking and beating young women. Kali Hawk costars, as the virgin college student he's pursuing. The movie also features Jane Seymour, Fred Willard and Florence Henderson in supporting roles. It's about as bad as you'd expect it to be, with just a few funny moments mixed in.Christian Black (Wayans) is a wealthy businessman; who made most of his money through stealing from others (and a brief job as a male stripper). He's obsessed with stalking and domineering young women (and he already has four restraining orders against him). So when a young virgin college student, named Hannah Steale (Hawk), comes to his office to interview him, for her roommate's school paper, he immediately becomes infatuated with her. A very unhealthy relationship develops. The movie is almost as painfully bad, and crude and offensive, as the material it's parodying. Almost, but not quite. It's not as offensive as 'FIFTY SHADES OF GREY', because it's main intent is just to spoof that film; it's a joke, and not supposed to be taken seriously. Parts of it are funny, because the film it's spoofing is so easy to make fun of, but it's definitely not clever or witty in any way. Overall it's a waste of time, and pretty hard to sit though.Watch our movie review show 'MOVIE TALK' at: https://www.youtube.com/watch?v=OHm0V1TOCkg",
            "review_date": "2016-05-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's a parody for god sakes!",
            "content": "judging by the low ratings and the few reviews I wasted my time on reading it seems clear that this movie is not everyone's cup of tea... FINE! That is totally okay! But please quit writing all of these negative and extremely discouraging reviews if you are not even into this sort of movies and humor!Note: you will only like this movie is you have watched the original! I watched this movie with my sister on an ordinary night when we had nothing better to do. None of us had seen it nor seen the trailer or read the reviews. I normally always look up every movie on IMDb before watching it, but in this case I am glad I didn't. I had heard from one of my friends that it was hilarious and also I had heard one of my other friends that it wasn't funny at all. So 50/50 chance, I thought.... Please understand that it's not uncommon for movies who aim to make people laugh to have low ratings. It is simply because not everybody is into that kind of humor. It's like when people who hate horror movies watch a horror movie and then make a review on it.My sister and me happen not to like the original \"Fifty Shades of Grey\" and maybe that is one of the reasons why we found this movie so funny. It was very obvious to us that they were just making one big joke out of everything. Everything was very exaggerated which we thought was extremely funny. They have done a very good job in taking small details from the original movie and turning it into something funny and crazy - again please keep in mind that it's a parody and meant to be a little too much!This humor was so stupid that we just had to laugh uncontrollably throughout the whole movie. But again, I am not very fond of the original and therefore I maybe sympathize more with its opponent. But really. It's so funny. Just make sure to watch it in good company and to have no expectations. Btw if you loved the original one you might get offended by this movie.",
            "review_date": "2016-08-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Many people may like this one, but as for me it just felt forced and tried too hard to be funny, and failed.",
            "content": "\"Are you stalking me, Mr. Black.\" Hannah Steale (Hawk) is a college student that helps her roommate by interviewing a billionaire named Mr. Black (Wayans). Slowly a relationship begins to build, but Mr. Black isn't like most men, then again neither is Hannah. I have to start off by saying that I have seen enough of the Wayans' brother spoof movies to not be excited about this one. Haunted House 2 was terrible and I was expecting more of the same from this. While this movie was better, it still wasn't that good. Unlike the last few movies they have done though this one is more of a mock then a spoof, in the vein of Hot Shots. Rather then just piecing together parts of different movies to try and be funny, this one sticks to the Fifty Shades of Grey story and really just takes it in a more ridiculous direction. There were a few parts where I smiled and even a few where I laughed out loud, but there are still scenes in this that go on way too long with a joke that isn't funny to start with. Many people may like this one, but as for me it just felt forced and tried too hard to be funny, and failed. Overall, another Wayans' spoof that falls flat. I give this a C-.",
            "review_date": "2016-04-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This movie made me asexual",
            "content": "I get that this is a spoof movie but I cringed during every scene. There were some funny bits and the fact that the movie was self-aware made me chuckle.But other than that this was just stale bread and tasteless. If this is what the actual movie is like, than I'm grateful I watched this instead",
            "review_date": "2019-12-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Disgusting",
            "content": "This was the most unoriginal and unsavory parody movie I've ever seen. When I added it to my watch list after I watched \"Fifty Shades of Grey\" (which is my most favorite movie of all time) and it showed up in the suggestions, I was under the impression that the title was the only rip-off, so I was taken aback by the unpacking of \"Fifty Shades of Grey\" scene by scene ad nauseam.",
            "review_date": "2020-01-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mildly Amusing But Still Pretty Bad",
            "content": "A spoof of 50 Shades of Grey that is overdone and heavy handed. Much of it makes very little sense. Even cameos with Jane Seymour and Florence Henderson can't save it. Best to invest your time somewhere else.",
            "review_date": "2021-01-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not that bad",
            "content": "I don't get the majority of reviews being so low. It had a few jokes that fell flat, but the characters were interesting - in fact, Hannah nailed Dakotah Johnson as Anastasia. My boyfriend, who wanted to watch it, enjoyed it a lot and laughed out loud (I did a little too). I also appreciated the brief female empowerment twist.I haven't seen the original, but the ending is probably just as contrived/abrupt in that. The digs it takes at it are perfect, perhaps the \"vampire bite\" kiss early in the film was even a super meta joke about it being Twilight fan-fiction. I'm someone who does not like Scary Movie, Haunted House, etc. This one was the right amount of crude and clever for me.It wasn't riotous laughs all the way through, but I'm giving it an extra star out of commiseration.",
            "review_date": "2016-04-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "There is something rotten in the state of Hollywood !",
            "content": "This is painful to watch. Parody movies mean, even in their hearts, to be a conscience that observes bad points in other movies, or bad movies for that matter, magnifies them, and hence pocks fun at them. So when the parody movies become bad themselves, then you have to ask yourself how low can Hollywood go these days??In all the comedies of the Wayans family, there are strong crude and sexual content, and no laughing. This one is no exception. It's nearly a comedy about the human genitals and excretory organs; which's disgusting and unfunny enough! So I was about to say: \"If you want to watch human feces, go and watch this\", however, WHO WOULD WATCH HUMAN FECES IN THE FIRST PLACE??!!There is no plot whatsoever. No attempt to understand the leads' characters or problems either; for mocking at them rightly. And accordingly the movie is nothing but huge jelly made of horrible sex jokes. So when you delete drama, as well as comedy, and immerse me - as a viewer - in tons of filth, then this is the perfect recipe for forgettable ugly nonsense!They could have made a comedy about a pervert soft porn masquerading as a romance. But No. Nudity, nastiness, and repulsiveness are way easier. Therefore, when this parody tries to have a conscience, and criticizes its original, Fifty Shades of Grey (2015), by saying that its novel was written by a third grader--it all falls apart. Because considering the condition of this very parody; IT IS written by the same third grader!Fairly, a few moments were kind of comic, and showed a bit of smartness; like the scene of unlocking the cuffs, and couple of lines. But the rest of the movie, namely 95 % of it, was between provocatively stupid and vomit-causing. I don't know, is that the legacy that Marlon Wayans wants to leave to the next generations, or even his own kids; \"I was unfunny dude, who used to hide his ridiculousness under nauseating language and shocking images, to be even more unfunny\"??!!Watching a Hollywood movie nowadays became a real torture. It's a heavy load of badness, which addresses the lowest desires in the human self, with superabundance of nudity, drugs, and cursing. Fifty Shades of Black doesn't satirize that sarcastically; it is that itself, yet without any workable sarcasm. So what an appalling failure and complete torture that is!There is something rotten in the state of Hollywood? No. Hollywood has become a rotten state already!",
            "review_date": "2016-12-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A young woman meets a rich man who demeans her verbally and physically, yet she keeps giving him chances for reasons never really explained.",
            "content": "I honestly ducked this movie when it came out in theaters for while I find the Wayans family as a whole funny, I do feel when Kenan isn't there to reel his brothers in and hone their collective talents, they are all over the place. Yet it is hard to deny that even without Kenan at the head, the individual members of the Wayans family aren't funny. Problem is, the currently most visible Wayan, Marlon, is honestly in desperate need of someone who knows his talent and can refine it. Main Storyline (with Commentary)In probably one of the worse movies I have ever seen, yet finished, we watch as Hannah (Kali Hawk) for some reasons dates Christian Black (Marlon Wayans). This is despite him calling her ugly, basic, letting his friends insult her, him having no sex game, him being cheap, and his mother seeming kind of racist. But the story-line isn't why anyone would watch a comedic film starring Marlon Wayans, it is the laughs. Well, they are in short supply. For despite all the bondage things which could be mocked, as well as the weirdness of the 50 Shades of Grey lore, honestly what we are given is potty humor made for teenagers. We sway from just licking everything to jokes about penis sizes, Christian drops a whole bunch of pop culture jokes which aren't memorable, and ultimately you are left feeling that Marlon Wayans must be forced to release one comedy a year or else he is going to get sued. HighlightsI remember laughing once or twice. One time during a Kevin Hart joke, and I'm sure there was a second. Well, maybe there was.Low PointsTo begin, there is Kateesha (Jenny Zigrino) who is Hannah's roommate and seemingly her only friend. She is a ghetto white girl who is insufferable. I mean, she is a stereotypical big, multicolored haired, ghetto, fat white girl who loves her some big black penis. Which I'm sure is supposed to be a parody of someone, but I couldn't once find out what is supposed to be funny about her. If anything, I felt bad for the actress since I assume the embarrassment an actor would get from working in a minstrel show is what she got working in this movie. But hey, she got a check, right?Perhaps the big issue here is that along with there being a weak story, little to no chemistry between Wayans and Hawk, is that the jokes almost all flopped. To the point, I look at this movie like how some look at some musicians once they get up in age. There comes a point where you realize you only see their performances due to nostalgia and not because you think they still got it. Such is the case with Marlon Wayans. After all, who didn't laugh at the many movies he did with his brothers, as well as his TV show on the WB network? Yet here he is, still doing parodies, after it seems his brothers have moved on from the genre and he is still trying to pretend he is in his glory days. To me, I think he may have reached the point a lot of comedic actors have where it is time for him to perhaps move onto dramatic movies or start becoming a supporting character to help push future stars. Which isn't me saying he isn't funny period, for his interviews and stand-up remains comical, but like Eddie Murphy something just isn't working anymore and if he refuses to adapt, step his game up, or what have you, he is going to eventually lose that curiosity if he still has it to portray a comedic character, much less do a parody, on film.",
            "review_date": "2016-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Even more stupider than the original material",
            "content": "Bad story got even worse in this attempt of a movie, This movie's jokes are lame. The buildups are more than predictable. The movie didn't even bother trying to be funny without using swear words. Wow, I'm surprised that someone even backed this movie financially. The acting didn't help either that it looks so bad. And I'm even amazed at my self for wasting my time watching this movie, even though I rated the original material by 4 out of 10. This movie is indeed an abomination. I regret watching this movie. Such a waste of time and bandwidth. I'm even angry that I have to write more to fill IMDb's 10 line review rule for this stupid movie.",
            "review_date": "2016-07-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Racist film...",
            "content": "I have to admit that it was funny, but some scenes were so racist towards black people. In my opinion, it wasn't a nice parody. The characters were average, the plot was ok.",
            "review_date": "2021-09-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "To Much Hard core Profanity. Not worth Matinée Ticket Price",
            "content": "Tuesday, 9 February 2016 I have Never seen \"Fifty Shades of Gray\" because I heard that it was like a soft core porno film. I have always like the Wayans brother television shows and some of their films too. Anyhoo, I was excited and looking forward to seeing this movie parody. I liked their films \"Lowdown Dirty Shame\", \"White Chicks\" and the \"Scary Movie\" parodies. The best thing about this movie is Biracial cute actress Kali Hawk. I liked Kali Hawk and pretty Biracial actress Katerina \"Kat\" Graham in the parody of their African and Jewish heritage of which both actress are in real life Black and Jewish, hint the spoof \"Black and Jewish\" video. Not a lot of cursing and it was funny making fun of both races.However, this film does have a few funny moments, but all the disgusting cursing and sexual innuendos, use of the \"N\" and \"B\" word by actress Jenny Zigrino and others mentioning of male and female body parts totally turned me off. Also films like this make African Black Americans look bad and women have been far to insulted with calling women a \"B\" just like taking a drink of water. You Never see Jewish American actors/actress degrading themselves on film just for a laugh.How can we as Black Americans complain about other races using the \"N\" word and we are using it ourselves so frivolously. Another major turn off for me in any movie or t.v show is the use of profanity and God or Jesus Christ/Yeshua in scenes.I kept thinking that the cursing would at least slow down to 20 miles an hour, but it never does. Just like the movies \"Spy\", \"Train Wreck\" and \"Dirty Grandpa\" this movie too has more hard core cursing than a porno movie. It should have been rated NC~17 if such a MPAA rating still exist.After watching twenty minutes of it, I left the theater the same as I did with \"Train Wreck\" and asked for a refund which I was given.",
            "review_date": "2016-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Another Parody",
            "content": "Most parodies are not great quality, this one reminds me of Jason Friedberg and Aaron Seltzer style which isn't saying much, but its a little better then that. The film is filled with really dumb jokes that art funny, but there are some moments that made me laugh. I loved the ending as it was hilarious. Like most parodies it is what it is, over the top dumb.",
            "review_date": "2021-08-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Marlon desperately needs his brothers again",
            "content": "I think pretty much everyone knew this movie was going to be crap. Just when I didn't think Marlon could do a movie worse than A Haunted House 2 he does this. First off I've seen and read 50 Shades of Grey and even though the movie wasn't as good after seeing this I actually appreciate the movie 50 Shades of Grey even more.This movie was actually pretty racist strangely enough and I'm not one to complain about racist jokes except when they're from 1992; black people liking fried chicken and hot sauce? Really? This movie tried way too hard and Marlon Wayans was a huge over-actor, even more than usual. Parodies were a lot better in the eighties and nineties when you had Spy Hard and Spaceballs. Granted the Wayans had Don't be a Menace and Scary Movie but apparently it takes more than one Wayans to write a funny movie. He needs to stop flying solo. You had A haunted House now go back to your brothers! Frankly I'd rate this lower than a 1 if I could. The only thing I noticed is Marlon's definitely been working out and interestingly enough I think he would've been a cool addition to Magic Mike XXL. He would've added extra humor to the bunch. A role in that movie would've been a million times better than this 50 shades of crap.",
            "review_date": "2016-02-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A painful, embarrassing movie. Spiritual successor to the original Scary Movie this isn't.",
            "content": "50 Shades of Black is a spoof movie where Christian Grey and Anna Steel(e) are played by black actors rather than whites. The opening scenes feature Christian stealing a woman's purse, then an expensive suit, then a car. So... the joke is that... black people are thieves? Ha... ha? Marlon Wayans was one of the minds behind the very funny Scary Movie (the first one, not the awful sequels) so I hoped that Wayans had recaptured the same comedic energy and brilliance for 50 Shades of Black.But no.No, no, no.This is a bad, bad movie. In fact, it's so bad, it's embarrassing. I never feel bad for actors in Hollywood productions; their salaries are more than what most people make in a year (Wayans makes 7.2 million a year, wow) but this 50 Shades spoof is so filled with cringe moments that you can't help but squirm in your seat and look away from the screen. If you're the kind of person that enjoys pulling the legs from spiders or capturing and then torturing neighbourhood pets, maybe you'll invite a few friends over and play this for them.Other than that, I'd say avoid.Wayans, why not open a charity or an orphanage with that money, man? You need to start atoning. You certainly won't do it with film.",
            "review_date": "2016-07-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Embarrassing Production",
            "content": "Hard to believe Florence Henderson's and Jane Seymour would agree to be a part of this movie. It always bothers me when actors and actresses who, after having long and successful careers, lower themselves and take parts in awful films like this. The first thing I think is how disparate they must me to work again. Same thing goes for well-established actors who appear in commercials. If they totally blew all the money they earned during their careers, ok they need a job. But most haven't and are simply earning a nice fat paycheck from a sponsor. Florence Henderson died shortly after this movie came out and was the last film in which she appeared. Sad her last appearance was on such a low note. And I would think Jane Seymour would just be embarrassed.",
            "review_date": "2019-09-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "50 shades of garbage.",
            "content": "Marlon has turned into quite the hunk so it was nice seeing him in certain scenes so for me that was a plus.However that one and only positive for me personally out of the way this movie was truly a disaster movie.The humor was disgusting and I'm nowhere close to being a prude one potentially hot scene regarding Marlons stripping spoofing magic Mike was ruined by throwing in an incredibly disgusting part involving Marlons underwear.The humor was miss every single time and the supporting characters were incredibly obnoxious especially the lead characters best friend a white girl trying to be black she was like nails on a chalkboard .Nothing about this movie was redeemable even though Marlon Wayans is indeed a stud in this film my personal opinion anyways.",
            "review_date": "2017-03-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great madness 😁",
            "content": "This is ten million times better than fifty shades of gray has ever dreamed of being!",
            "review_date": "2020-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The all telling trailer",
            "content": "This movie was funny throughout the story, but it was not anything that will make one fall out of the seat from laughing so hard. Many of the funnier scenes were what is shown in the previews.They could have done better with the comedy in this movie. Marlon Wayans is much funnier than his performance in this movie as the character Christian Black. Black was funny in scenes where he was or had already committed some sort of crime.More risk should have been taken with the material that was put into this movie's story. It would have paid off much more than playing it safe.",
            "review_date": "2016-04-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's more sexual than it's funny.",
            "content": "I just don't find this deserve your time. Yes there is a big laughs but not a lot, just few. Then the plot repeats its self again and again in the movie.",
            "review_date": "2019-06-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Got What I Expected",
            "content": "Spoiler alert for Fifty Shades of Grey as well for it is a parody with the exact plot. Fifty Shades of Parody. To say that this was better than the movie it was spoofing shows you just how bad that movie was. The only reason Grey was doing better than Black in the box office is due to there being a cult following of the books the Grey movies were based on. Those who either did not like the books or the Grey movies might be able to enjoy this. However a greater population do not know about the books or the movies or what they were about before watching this movie or are loyal fans of Grey. Christian Black is not a likable character as he was verbally abusive to Hannah Steel and generally has commitment issues. Maybe a little over the top but not far off from the Christian Grey character. Hannah is also just like Anastasia Steel in the way she always says 'I don't want to be controlled or submissive' but then always does exactly what she is told. Mostly at first she was amused by the idea of getting spanked and then she gets serious since Christian Grey is only in it for the sex and says she wants to find out just how intense things would get before leaving. The movie follows the same plot but ends with no to be continued like the movie it was spoofing thank god. This movie is probably worth watching only once and also does not require a sequel.",
            "review_date": "2017-04-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fifty Shades Of Black",
            "content": "If I watch this movie a dozen more times I wonder if it will eventually get funny.I watched it once & once was 1 time too many.I struggled & strained to sit through the entire thing.I don't think I laughed once while watching it.I might have grinned, smiled, or smirked, but I never truly laughed.I know I spent the majority of the time cringing.I watch anything and everything the Wayans put out and usually find them funny.White Girls did suck but it didn't suck as bad as 50 Shades Of Black did.The funniest thing about 50 Shades Of Black was the trailer.It's what made me really want to see it.Maybe if I would've seen 50 Shades Of Grey or even read the book (I have NO interest in doing either) before watching this, I might have enjoyed this movie or liked it but even then I really don't think so.There were so many parts where they just tried way too hard to get a laugh (Like the belly button scene for example.See what I mean?) I'm a BIG fan of potty humor but here it was WAY too overdone & the only thing it made me do was feel awkward.The only way I can see anybody finding 50 Shades Of Black funny is if they're high on drugs or completely drunk.I would suggest you only recommend this movie to people you don't like",
            "review_date": "2017-02-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "awful",
            "content": "why insist in this kind of movies.the movie only takes part of other movies in the worst way you can imagine. the main character isn't a actor. maybe writer or anything else, but not actor.the movie has no funny scenes, not even one.i only vote 2, because of the Money involved. nothing more.how did they got 11 M from box office?can't understand...........BORING.bad actinggood old actresses",
            "review_date": "2016-04-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you like perverted movies that are trying too hard to be funny then by all means go and watch this.",
            "content": "Saw this advertising on cable and decided to go on a date with the hussy to watch this... The advertisement made it seem so funny and knowing that Marlon was acting in it, My husband was just as excited as I was to go and watch it. I do not know what this world is coming to, because nowadays what is considered fun is pervertedness, sexual jesters, cursing blatantly for no reason, and pornographic behavior and language.I do not know how they could have fun producing movies like this...Fifty Shades of Grey was enough!!!! Why stretch a shitty movie by making a parody!My husband and I could not stay to watch out the whole movie. It was embarrassing to be sitting and listening to this perverted crap. If you have any moral values then please do not go and watch this! It is no good and I did not find anything comical about it for it to be even filed under the genre: comedy.DISGUSTING MOVIE.... We love a good laugh and a good comedy but this ain't no comedy! They are trying too hard to be funny and it is stale, and just downright perverted.",
            "review_date": "2016-02-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "its just, one of \"thooosssee\" movies, ya know?",
            "content": "Like disaster movie, date movie, scary movie blah blah its one of those c grade random comedies, which arent the best but ya know, theyre alright to just waste an hour to, not complete trash but kinda close? like it is what it is, its not trying to be an amazing film perse, it knows its a random film and therefore thats what it is and what it strives to be, gotta just accept it for what it is and realize its not gonna be an astonishing masterpiece",
            "review_date": "2018-08-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Marlon, call your Brother Keeenan. You need help...badly!",
            "content": "I downloaded this movie, played it for ten minutes, stopped it, and quickly deleted it from my computer. I really don't know what the hell Marlon is thinking lately, but someone needs to enlighten him on the fact he writes nothing like his brother Keenan. And what I mean is that his stuff is no where as funny, and clever and overall clean. After Scary Movie 1, and maybe White Chicks, Marlon seems like he's on a mission to sabotage his career, with these back to back disasters films that he's writing and starring in. Enough already with the satire, dude you need to tone it down and do some real acting, and for God sake, write a story that is actually funny without all the buffoonery. If I had brought a ticket for this crap, I would've got up after a few minutes and asked for my money back. This was just plain stupid. Marlon I've seen you in a Requiem For A Dream, you got skills, but its time for you to put on your thinking cap, and do some real funny stuff. If you need help call your brother Keenan. I'm so glad I didn't have to a buy a ticket for this crap.",
            "review_date": "2016-04-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not funny.",
            "content": "Fifty Shades of BlackThis movie was not funny. Lots of cultural references that are poorly executed. Stereotypes are one thing and the film pokes fun at them. Racism can be funny if done correctly: Daniel Tosh. This film doesn't make racism funny. It's not offensive, it just tries really hard to be funny and fails at every corner.I enjoyed the references sometimes, especially Whiplash. Since the film failed to make me laugh once, I could still see some good in the writing. It's the delivery by Marlon Wayans and Kali Hawk that fail. Kateesha was especially annoying.Affion Crockett reminds me how much distaste I have for The Weeknd and his mediocre singing (insert Mad Max reference)Marlon Wayan's goofy humor was off-putting this time around. I've enjoyed his earlier work, Scary Movie, and even more recent ones like, A Haunted House.Something nice to say about Kali Hawk is that she took this roll like a boss. She seemed to genuinely try to keep in character and play along with the goofy nature of the film.Verdict: You were right not to go see this movie. Don't bother renting it now. It was painful to finish all 90 minutes.",
            "review_date": "2016-05-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst movie",
            "content": "I realize they wanted to spoof of the fifty shades movies but this movie is bad omg they shouldn't have made this movie. Some parts are trying to be funny and they aren't, some jokes are trying to be funny and they aren't, and some acting aren't that great either.",
            "review_date": "2020-04-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Puke",
            "content": "Well of course Hollywood has to make a BLACK version of fifty shades. God forbid we have to force a movie for \"racial equality.\" Here's an idea, quit perpetuating racism by forcing these movies!!!!",
            "review_date": "2022-04-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "COMEDY ISN'T THAT HARD",
            "content": "Who wrote this garbage!!\nIf i gathered some friends and shot a movie it would've been funnier, there is absolutely nothing funny about it, not even one single scene \"except for king Bach's\", the only good thing about this movie is King Bach actually",
            "review_date": "2020-01-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I thought this was supposed to be funny?",
            "content": "I was really looking forward to watching this since the trailer made it seem worth my while. Good comedy is hard to find. What a complete and utter waste of my time. I'm white, not racist, and found the movie to be appallingly racist, disgusting, offensive, sophomoric, and not funny in the least.I'm not one for walking out of movies, but if I were, this would surely qualify. I keep hanging in there hoping every movie will get better, but this never did. I've read all 4 of the Fifty Shades books and seen the original movie, so I'm completely familiar with the source material.I was embarrassed for and disgusted by Florence Henderson and Jane Seymour for even agreeing to be in this trash. To lower themselves to this level was utterly repulsive to me. I thought they both had more class than that. My opinion of each of them has now seriously suffered.The only other movie I've ever considered walking out of for all the same reasons was Borat, which was equally as bad.There was only one moment in this entire movie that was actually funny, and that was seeing Christian grey, black, red, white, blue, etc. listed in Hannah's cell phone. The rest of the 'humor' was clearly aimed at the highly narrow demographic of 13-year-old boys. What a colossal disappointment.",
            "review_date": "2016-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Do not agree with the movie at all",
            "content": "Found the movie vary offensive and if this was a movie made with white people saying the stuff they said about whites this would be considered a racist movie and I am not happy with how racist this film was towards white people I am no racist at any means I just do not see how this is not a racial movie towards whites I had spoken with the cinema about getting my money back and was unable to I am not happy that I spent my money on this film it was a waste of my money and time I have seen and loved movies from the same writer and this one was not right in any way I left the movie because of the way it was written yes there was some funny scenes but the comments about white people was unacceptable",
            "review_date": "2016-02-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "50 Shades of Nothing",
            "content": "I tried to watch this movie but after only 15 minutes I could not continue to put myself through the assault on my intelligence. If they were going for shock value for the depravity in language, lewd gestures and an attempt at acting they succeeded.Dumb and Dumber which I also disliked is like a literary achievement compared to this movie.",
            "review_date": "2020-07-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "More accurate then the real thing.",
            "content": "I've read the original E.L.James books are actually more accurate to the books than the a real Fifty Shades series using direct quotes and Easter eggs. It is an absolute hilarious film like 'Meet the Blacks'. The postmodernism also was high in this which made its parodorical nature.",
            "review_date": "2017-07-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "0/10",
            "content": "0/10. This is not a movie I refuse to give it that respect as it is undeserving of it. It is meant to be a comedy and it would've succeeded at that if the point of comedy was to make you cringe and cry and s word your pants. None of the jokes land and they all depend on the concept of saying something loud means its funny. The entire movie has no plot and there is no character development and nothing goes anywhere. All of the scenes could have been rearranged in any order and it wouldn't have made any difference. I feel like the entire budget went into CGI nutsacks because there are way too many of them. This is by far the worst piece of media I have every consumed (besides 3 Idiotas). This movie has completely blown my expectations for any movie way out of proportion I genuinely wanted to kill myself and I started crying at several points in the movie I'm so glad its over please help me I am in a state of emotional turmoil.Rajesh does not recommend.0/10\n-Rajesh P.",
            "review_date": "2022-02-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fifty Shades Of Pure Bullshit......",
            "content": "I was expecting a funny parody of Fifty Shades of Grey , instead I got this one and a half hour of bullshit.Watching a snail cross the room is more entertaining than this \"movie\".I loved the Haunted House movie so I was expecting a fun flick instead I got this f**k s**t.I love Marlon Wayans and his movies,he is a funny actor this crap was not expected from him. I was expecting a funny parody of Fifty Shades of Grey , instead I got this one and a half hour of bullshit.Watching a snail cross the room is more entertaining than this \"movie\".I loved the Haunted House movie so I was expecting a fun flick instead I got this f**k s**t.I love Marlon Wayans and his movies,he is a funny actor this crap was not expected from him.",
            "review_date": "2016-05-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst Movie Ever",
            "content": "Why make a parody of a trash movie, of course this was trash don't watch it.",
            "review_date": "2021-09-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Painful",
            "content": "And not in the good way.Literally was hard to watch because of how hard they tried to be funny and failed miserably. Please stop making movies.",
            "review_date": "2021-03-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I hated this movie.",
            "content": "This movie was just terrible. It wasn't funny. We went to the theater and our friend couldn't get in and she got sad. I say thank God she couldn't get it. This movie was bland. Not funny. Just full of sex and torture. I laughed a couple of times when they mentioned the actual Fifty Shades Of Grey movie. He read her the book for torture and Christian Grey was in her phone contacts. Oh, and King Bach. He was hilarious in this movie. The smallest part, but the best part. That's all. I went into the movie theater thinking... \"Oh. Marlon Wayans. This should be funny. I mean he did Scary Movie and A Haunted House.\" He went the totally wrong direction. The Magic Mike part wasn't even funny. It showed feces on his shirt after he rubbed it in his butt. That's not comedy. That's gross. I'm just saying as an avid movie goer, if you hate bland movies that have terrible story lines save your money. Please. Do not contribute to the box office because, in all honesty, I thought Marlon was better than this garbage.",
            "review_date": "2016-01-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Thee Worst Movie Seen In My Life!",
            "content": "What I can say, awful awful, just awful! Only 2 single scenes in the monstrausity provided me with laughter out loud, all of the rest was complete and utter stupidity, made absolutely no sense.Very poorly written, directed, and filming , was just horrible too! Its a shame because I wanted to really like this, because Marlon Wayans, I consider to be a very talented comedian, and his former show on NBC , Marlon was excellent, he was great in that show & acted great in it as well. Thing is he did not write or produce that. MOVIE IS A COMPLETE DISSASTER! I really need the 2 hours of my life back, wasted on this gatbage! Did not pay for it thank Goodness, watched 4 free on a HBO Max trial.",
            "review_date": "2020-12-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "50 Shades of Bad",
            "content": "This movie is so bad that my TV had to throw up. Please don't waste your time on this. When I thought this movie through I realised that is not too hard to write much better screenplay for this movie because the shooting script was awful.",
            "review_date": "2021-01-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "*Shrug*",
            "content": "Like there are bad comedy movies and there are BAD comedies and this is a BAD one! Sure it's funny sometimes but it's just a big no....",
            "review_date": "2021-05-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst comedy ever I seen!",
            "content": "I regret that Cinema City and others can promote and sale such a worst ever parody, same like the genuine movie. Good script. Keep it for yourself! Send a lot of money to make feel people stupid. Now I realize how can see us the people who made, own and promote movies like this. Not all the people are stupid. One movie deadly. Worst ever comedy. Very intelligent writers: Marlon Wayans, Rick Alvarez. Good work! Marlon Wayans false. Kali Hawk never play again, please.This is simply an sexology no action comedy film.I loved the black men, but they are playing so worst.I Have to admit I was suckered in by the trailer, it was exciting comedy packed. I thought they were doing a 1 shade style movie at least, but I was wrong. This was like a long not-ending cheap American comedy show like.",
            "review_date": "2016-02-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Damn, this movie sucks.",
            "content": "This is a long way from the originality of Scary Movie, and honestly, it really was horrible. I couldn't make it through the whole thing. If you really desire to waste 2 hours of your life, you'd be better watching paint dry than watching this movie.",
            "review_date": "2021-05-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A disgrace of the film discipline.",
            "content": "The absolutely worst movie I've seen thus far.As a parody of \"Fifty Shades of Grey\", one only expects cheesy, lewd sex jokes. However, this movie is an absolute disgrace, every single scene felt like a direct and personal attack to my intelligence. Even cheesy parodies can have some intellect and level of tastefulness.Marlon Wayans disgraces himself, his family's brilliant comedy legacy and the also film discipline.",
            "review_date": "2021-11-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not the Best Parody",
            "content": "While the movie had some laughs, overall it wasn't the best parody made by the wayans/alvarez team. haunted house 1 & 2 were funnier and it seemed there was a stronger attempt to not be funny, but the vulgarity was over the top even for marlon; which made the movie not worth being on the big screen. basically, i could have waited for it to stream on netflix. a little disappointed as i am a fan of parodies and especially of the ones written by the wayans...love scary movie 1 & 2 (also 3- 4). minimum length of reviews is 10 lines??? wow. OK. what else can i say about this movie that the 5 previous lines didn't say? marlon wore great suits and i liked the apartment's decor. the female lead tried too hard to be serious/funny, but i never read the books nor did i see the movie of fifty shades of gray, so i don't know if the female lead was like this, but being a parody, i assume she was. oh, i almost forgot, the supporting female was the best character in the entire movie and i wish she had a bigger role. i got my laughs mainly from her, but some may think otherwise, but it is a parody after all; you have to take the good with the bad. OK, i should be at 10 lines now. :)",
            "review_date": "2016-02-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "content": "If you got sense of humor and don't take everything serious you will like this movie, but if you get ofended by stupid things don't watch this movie.",
            "review_date": "2021-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "11% \"\"Fifty Shades of Black\" was hilariously funny enough, but tells an impressive yet very unbelievable story\".",
            "review_date": "2020-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this parody has funny scenes but doesn't save the movie that gives you a bad script",
            "review_date": "2020-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious!!!!!!!! truly a classic. seen it over 10 times...",
            "review_date": "2020-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love how this movie is not serious. Most movies we watch are always serious. This take is a comedic take on the actual movie.  It's funny and fun to watch.",
            "review_date": "2020-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awful movie wouldn't recommend",
            "review_date": "2020-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its bad when a comedy fails to make you laugh once.",
            "review_date": "2020-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really liked it. Wayans funny.",
            "review_date": "2020-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wish my take on this was a hot one, but this really was just an unfunny movie almost the whole way through. It felt like a writer surrounded by sycophants wrote the script and was never informed when a joke didn't seem likely to land. The parts I liked mostly involved the girl's roommate, several of her scenes were good, and the music was decent. Even the cinematography was noteworthy. Roughly 10% of the jokes that Wayans pitched in the movie landed, and the ones that didn't weren't even really appreciable - my facial expression didn't change at all from them.",
            "review_date": "2019-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible movie ever . If anyone seen the original version they will say it is better than this.",
            "review_date": "2019-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "every movie with Marlon Wayans is a 10/10",
            "review_date": "2019-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too obnoxious to be funny.",
            "review_date": "2019-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loathe both the small town of Seattle & the Fifty Shades of Grey book and movie franchise. This movie makes the idiocy of both those pretentious nouns much more hilarious! Marlon Wayans & Kali Hawk are funny as hell.",
            "review_date": "2019-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why was this movie made? Even though I really like the original movies, they still got a lot of hate. So why would they make a parody movie of this. Fifty Shades Of Black is absolute garbage. I really hate this movie. It's laughable, but for all the wrong reasons.",
            "review_date": "2019-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is the movie that destroyed cinemas in 2016. it's so bad it's not worth a penny.",
            "review_date": "2018-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A decent movie. Some of the jokes and comedy was clever and other times it was very crass and rude!!!",
            "review_date": "2018-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "exactly what it's supposed to be... ",
            "review_date": "2018-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You'd be better off watching a dog crap.",
            "review_date": "2017-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Of course in order to cash in on the publicity of the original movie and \"memes\", this couldn't have been a highly produced, well-acted, serious toned movie. Because that's not obviously satirical, this is more of a spoof and would have been better as a traditional satire with hand-crafted humour instead of the machined stuff that continues to jam itself in Fifty Shades Of Black in order to appease \"all folks\" and their purses.",
            "review_date": "2017-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Devoid of a single good laugh, \"Fifty Shades of Black\" has the distinction of being worse than the movie it parodies.",
            "review_date": "2017-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "GREAT FILM. IDK WHY EVERYONE HATES IT. IT'S A PARODY. IT'S SUPPOSED TO BE STEREOTYPICAL AND FUNNY.",
            "review_date": "2017-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hollywood spoof movies haven't been all that good in a long time.  This one really isn't that great either, but I will at least say that it got me to laugh  a few times.  Overall, this isn't something that I could recommend, but it does tear apart the Fifty Shades of Grey movie without any mercy at all.",
            "review_date": "2017-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "lolol so dumb, but the first like 15 mins were kind of funny.  wayans bros still classic",
            "review_date": "2017-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My hubs and I loved this movie & we thought it was hysterical",
            "review_date": "2017-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fifty Shades of Black is a no-holds-barred, incredibly reverent and outrageous parody film.  While mainly a spoof of Fifty Shades of Gray, there are also sketches of other recent hit films (such as Magic Mike).  Marlon Wayans leads the cast and delivers a hilarious performance, and Jane Seymour is hysterical in a small supporting role.  But the crudeness and vulgarity is a bit much, and some of the jokes get beat to death.  It delivers a lot of laughs, but Fifty Shades of Black is unable to strike the right balance of raunch and comedy.",
            "review_date": "2017-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious but stupid at the same time. This is something you watch for an easy laugh and it's. it meant to be taken seriously.",
            "review_date": "2017-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "actually pretty entertaining if you know you're going in good, old-fashioned stupid and vulgar silliness",
            "review_date": "2017-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love Marlon Waynes, but this movie wasn't that good at all. In fact it was quite disturbing. Hope he does not make anything like this again.",
            "review_date": "2017-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible disgusting movie. No humor at all. Don't bother.",
            "review_date": "2017-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "another spoof movie and it's not very funny",
            "review_date": "2017-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fifty Shades of Black is directed by Michael Tiddes, and it stars Marlon Wayans in a spoof comedy about a college student that come across Christian Black (Marlon Wayans), and he come across his interest to her and wanting to be with her, with a paper agreement that Hannah Steale (Kali Hawk) that is. When seeing that there's a parody film of Fifty Shades of Grey be done by Marlon Wayans, is something that makes me worried about, and seeing that it has worse reviews than any of the 50 Shades Series, got me scared. So when seeing the series, of course I am going to watch it and I managed to find it on DirecTV, and while it's the best, it's more pathetic than those films. The main acting is really trying to make those jokes work, which in the right film, Marlon Wayans and Kali Hawk can be really funny together. There are some moments where I was amused like almost every time that King Bach is in this, and then there are some funny moments like Christian Black wrecking things to attack her butt, and when he spanks her butt, Hannah goes back at him, and I think it's because they did something comedic with a scene that I recognize from the film and make it quick enough that doesn't linger on the joke. Those are the only positives thing I can say, as for the negatives, there are some things that I can say. Most of the jokes don't make me laugh, it lingers on like a Family Guy joke that is never funny, and can irritate the crap out of me. There are a lot of character inconsistencies to the point that I just didn't care, and there are some Internet stuff in here that just seem lazy and tacked in. There are some stuff in there that's just gross for the sake of being disgusting, and it's really lame to watch. Fifty Shades of Black is a terrible movie that while it didn't make me as mad as Fifty Shades of Grey, I was just really disappointed that this movie could've been so much better.",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Started off as a funny concept, but quickly spiraled into an intense combination of poorly timed jokes, awkwardness and adolescent toilet humor. I've seen better writing in the comment sections of Pornhub.",
            "review_date": "2017-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm ashamed for laughing in 2 scenes in this movie.",
            "review_date": "2017-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is the only reason why I suffered through the original book and movie. The book started off life as a twilight fan fiction, and then E.L. James got even hornier and decided to make a derivative romance novel, except with BDSM. And an unforgettable, horribly written trilogy was born. Then the movie comes, and during the sex scenes, Dakota Johnson is as thrilled as a kid in a candy shop, while Jamie Dornan is as thrilled as when I have to talk to someone I don't like, and it's incredibly painful to get through, and you should probably get some kind of award if you make it through just the first book and movie. Which brings us to this movie. Marlon Wayans has incredible charisma. However, that does not mean he is a gifted comedy writer. It is by no means a perfect parody. But, it is an extremely stupid comedy, and if stupid makes you laugh, then this will do the trick. It's also a lot less painful, the hour and a half goes by very quickly. The only reason to watch this is if you are a die hard fan of Marlon Wayans, or if fifty shades of grey ruined your life like it ruined mine. That should do the trick just fine.",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Couldn't stop laughing.",
            "review_date": "2017-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Parodying a film like \"Fifty Shades of Grey\" is a strange choice considering that film already feels like a spoof within itself. \"Fifty Shades of Black\" is a disappointing and unfocused mess that fails to offer enough laughs.",
            "review_date": "2017-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I understand this film is shit. But I found it funny! My gf hated it but I laughed a lot",
            "review_date": "2017-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No redeeming qualities.  Obviously a parody of Fifty Shades of Grey, this is about a plain college student (Kali Hawk) entering a relationship with wealthy businessman (Marlon Wayans) that she quickly learns engages in some sordid sexual practices.  Hilarity ensues (but not really).  To every Yin, there must be a Yang, and I believe that if you don't take the time to brave and witness the truly dreadful that Hollywood has to offer, you will be less likely to fully appreciate a great movie.  Also, in addition to that, I want to be able to make a respectable worst of list for the year, which is the entire reason why I chose to watch Fifty Shades of Black.  I've got to say: Marlon Wayans has finally done it.  He has put together a movie that actually manages to make the awful original movie that was ripe for parody look desirable by comparison.  Honestly, it couldn't be all that hard to put together a movie that successfully pokes fun at this silly pop culture phenomenon, but he manages to fail at every single moment in this 90-minute so called spoof.  This movie doesn't do anybody any favors, and it unfortunately ends up being one of Florence Henderson's final roles on film for a really limp Graduate reference.  And everything here is just a lame, underwritten gag that doesn't hit, drenched with buffoonery at every single turn.  It is devoid of actual jokes, and this is a movie that doesn't just pick low hanging fruit, it digs up buried and dead fruit up from underground.  All of the jokes are telegraphed, and it either manages to be a bit without a punch line or a random cutaway non sequitur, like \"oh yeah, I remember when Kim Kardashian had that photo shoot\".  At this point, I've reviewed so many of these parody movies (some of which he has previously had involvement in) that they all just blur together.  From A Haunted House 2 to Superfast!, almost all of them are brain-dead, and they are comedies in name only.  This is not an exception to the rule, and I have no idea why you would even take the time with this, unless you're a masochistic movie reviewer that watches everything like me.  This really is so racially offensive that Wayans manages to set his entire race back by a couple of decades, and I am not just saying that for dramatic effect.  There's an entire bit about whips that he chooses from famous slavery movies, and it isn't funny or clever, it is just sad and filled with cringes.  The movie as a whole is flabbergasting, gross, homophobic and tactless, there's something here that will offend every single race and creed.  The most disappointing part is that I know this man has talent and I've seen him act well in projects before, so it makes it all the more depressing that he spends his days making terrible trash like this.",
            "review_date": "2017-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the funniest movies I have ever seen XD",
            "review_date": "2017-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst movie of the year...",
            "review_date": "2016-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an awful film. I think I chuckled twice exactly during the entire movie the rest I was just plain bored. The jokes are predictable, cheap and unfunny. Most of the performances are pretty awful. The movie is pretty much a scene for scene re-create of Fifty Shades of Grey. Why not use that time to make fun of other different movies? If you thought the haunted house films were laugh riots maybe you'll enjoy this but overall it's a huge piece of garbage.",
            "review_date": "2016-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I laughed more at the unintentional absurdity of Fifty Shades of Grey than at the frantic mean-spiritedness of Fifty Shades of Black.",
            "review_date": "2016-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The sh*t is hilarious. I can't wait for \"50 Shades Blacker\"",
            "review_date": "2016-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Marlon Wayans is Christian Black, replete with every dick and fart joke from the Scary Movie bag of tricks.  As a plus, it is genuinely more entertaining (laughs or otherwise) than the film it spoofs.",
            "review_date": "2016-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Dr. Seuss is my homeboy!\"",
            "review_date": "2016-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love witty parodies but this was a disgrace. Such a lazy writing.",
            "review_date": "2016-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Had a couple laughs  watching this film.",
            "review_date": "2016-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I nearly laughed my butt off! Wayans has his ups and downs, but this flick is definitely one of his better works. Crazy, often even childishly silly, dirty and insanely full of self irony. After 50 shades of GREY won the Golden Raspberry Award for the worst movie of 2015, this nasty shot below the belt by Wayans is surely on the opposite end of the scale. If you like Wayans movies in general, this will surely knock you out of your seat again. 7 1/2 out of 10 points.",
            "review_date": "2016-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review at www.cinemaniacreviews.net",
            "review_date": "2016-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would give it zero stars if I could",
            "review_date": "2016-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hated it.  Least funny \"comedy\" I can recall EVER!!!  Could not wait for it to end.",
            "review_date": "2016-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sometimes these types of parody films aren't that bad (Haunted House 1 and 2 are prime examples), then there are the ones that are terrible. This is one of them.",
            "review_date": "2016-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked it. All around memorable movie. Acting was meant to be comedy. Marlon is half as over the top as he usually is GREAT THING. perfect comedy when youre just wanting to relax unless youre offended by big black dick.",
            "review_date": "2016-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fifty Shades Of Black is obviously a parody of the rather successful but negatively received film \"Fifty Shades Of Grey\", along with the three books that the original film was based on. Honestly, this has to be one of the hardest films I have ever sat through. \n\nThe film centers around a very complex and overall diffcult relationship between African American millionaire Christian Black and usually unnoticed Hannah Steele, mainly because Christian is into BDSM. \n\nThe whole entire film is very racist, sexist, crude, uncomfortable, unfunny, and boring. I really expected Marlon Wayans to be rather funny and overall GOOD in this film, and at least be better than he was in his last production, \"A Haunted House 2\". But really, he's just the same: unfunny. And the real thing I'm worried about is that he actually thinks the stuff that he is doing and saying and portraying in these films are funny. But if you have seen his recent films, you can tell by now he's just not funny or interesting anymore. \n\nThe film started off promising and of course stupid, but in a rather funny way. That was only the first 2 minutes. After that, I had to take off my headphones because some of the things they were saying were things I really didn't want to hear. Yeah, this film is that bad. It's so bad that I gave up watching at about 1 hour and 15 minutes into the film. \n\nIf your expecting something rather funny and enjoyable, you won't get it here. This is defiantly the worst film that Waynes has ever been in. Hugely dissapointing, and unwatchable basically through the whole thing.",
            "review_date": "2016-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Started off thinking this will be funny....then spent the whole film waiting for something genuinely funny to happen and it just got more drawn out and less funny to the point when we turned it off without watching the end. In short ..... Not funny.",
            "review_date": "2016-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst comedy from Jack and Jill, badly acted, poorly directed, is a complete disaster movie, is completely atrocious. Do not know who the hell told Marlon Wayans that this was funny, probably some one who hates him. No it hurts more pay to see this movie or wasted time to see this atrocity.",
            "review_date": "2016-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This had to be the worst Wayans film I have ever seen. It's hard to even imagine how this was greenlighted. There were funny parts, but not enough to justify the time I wasted.",
            "review_date": "2016-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just horrible, absolutely the worst. But as always with the Wayans, there were a few parts I was mad at myself for laughing uncontrollably.",
            "review_date": "2016-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not another \"Scary Movie\". I had high hopes for this because I love the \"Scary Movie\", \"Naked Gun\" type movies, even the ones with less than stellar reviews so I assumed this would be the same. Boy, was I wrong. This has to be the worst movie of this genre I have ever seen. The jokes generally just fall flat and it doesn't help that the movie it tries to parody wasn't a good movie to begin with. Sad, just sad. Stay away.",
            "review_date": "2016-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fifty Shades of Black is spoof movie with mixed results, it's not the worse comedy out there and sometimes it's so stupid that works in most of the time, but overall it's just a generic comedy full of clichês of the genre. (2/5)",
            "review_date": "2016-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst film I've seen in 2016, really tired, predictable humour. About as funny as being caught in  conversation between a vegan and a crossfitter.",
            "review_date": "2016-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very few laughs, not good at all kinda boring",
            "review_date": "2016-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fifty Shades of Grey looks great compared to this.",
            "review_date": "2016-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wanted to like it cause I like Marlon wayans, but it was bad....had to turn it off",
            "review_date": "2016-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just not funny, many decent scenes start fine and end up crappy, they made too much of an effort to make the movie funny as a Fifty Shades of Gray satire, but with no success. They should try to make a better job for the next one, and stop trying so hard.",
            "review_date": "2016-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why did I put myself through this? Fifty Shades of Black is another spoof film from Marlon Wayans (who used to be funny...I think?), this time spoofing Fifty Shades of Grey. I can safely say I did not laugh once, it was like I was dead inside whilst watching this. The gags were horrendous and the majority of them were cringeworthy. Wayans is charismatic, but it's not enough to keep me or anyone else entertained.",
            "review_date": "2016-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We really don't need this black parody of things do we it's really the rasist thing to do",
            "review_date": "2016-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was not actually as inappropriate as other spoof movies out there. Which is surprising because they are usually too sexually explicit for laughs and I expected this one to be so much worse. I was pleasantly surprised at how wonderful this mockery of a ridiculous movie was.",
            "review_date": "2016-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Typical Wayans Movie.",
            "review_date": "2016-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Almost exactly like Fifty Shades of Grey but a spoof, which was hilarious. Sometimes it was over the top and not funny, but that's what the Wayan brothers do. FSOG was a shit film to begin with, so I did like this spoof version in the end.",
            "review_date": "2016-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "- Straight OUTRAGEOUS!!! Fifty Shades Of Black definitely delivered on the funny and then some. The overall plot was a play on Fifty Shades of Grey. I did not see that movie or read the book but I know enough about it to figure out what the real deal was. The story line focused mainly on the extremely unorthodox sexual nature between two individuals and it was kicked up a notch with beyond hilarious additions that only enhanced the complete feel of the movie. At every corner there were jokes that surrounded current pop culture situations which brought the entire outlook of the film to life. From the very start there was no fore playing around. The production team lubed up every scenario and maneuvered their way nice and easy into our hearts with each passing successful scene. This is certainly a \"Must See.\" There was a familiarity with the way the final product was displayed but it also had a new vibe of swagger that felt all new to the game. The moments that the entire theater was not on a roller coaster ride of laughs were when the true substances of the film showed its genuine colors and they sure were bright. Without a doubt lines were for sure tested and almost crossed but the just far enough concept of the entire movie was what kept our eyes glued to the BIG screen with high anticipation of curiosity to what in the world is next. Brilliant insanity is another way to describe what I just willingly viewed. Still to this point my mind is replaying scene after epic scene so to help categorize everything that happened. Even through that, it was good but not great. Awesome but not to the MAX! And for those slight downplays it receives a very sturdy standing of \"3 Stars.\" A truly fun night at the movies. Seriously one of the most unique ones I have EVER had and for that main reason, \"it is all good in the hood.\" YEAH!",
            "review_date": "2016-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still a better movie than Fifty Shades of Gray:)",
            "review_date": "2016-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fifty Shades of Black is crude and uninspired. Marlon Wayans has proven that he doesn't need any help from his brothers to make a truly awful spoof. No matter how cosmically God-awful you think Fifty Shades of Black probably is, I assure you it's even worse than that.",
            "review_date": "2016-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "0.5 out of 10:\n\nHey, if you want a parody of Fifty Shades of Gray with immature and racist humor, than this film is for you.",
            "review_date": "2016-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Warning: Spoilers \n+Few funny moments\n+kingbach was great to see\n-very Few backstory\n-forced and rushed romance\n-stupid and annoying soundtrack \n-very boring at times\n-stupid references that aren't funny\n-Cluster fuck of a story and characters",
            "review_date": "2016-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lol, I'm right along for the ride to make fun of the manipulative abuse drama.",
            "review_date": "2016-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's one of the worst movies I've ever seen. Is that \"humor\" for some people? I'm impressed.",
            "review_date": "2016-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "funniest movie of the year",
            "review_date": "2016-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the kind of stupid movies that i like, like the \"Scary movie\" 1 & 2, but this wasn't enough for me, it had funny moments but the rest of the movie is silly and kinda boring",
            "review_date": "2016-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie was good to me if you really liked scary Movies 1&2 then this will be fine not about to go super deep in details its a wayans spoof their good at it",
            "review_date": "2016-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What happened ... scary movie 1 and 2 hilarious, he needs his crew back bad!",
            "review_date": "2016-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was awesome the producers did a great job",
            "review_date": "2016-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "haha really funny feels like im watching fifty shades of grey thow but i like the black cast actually better then a white cast",
            "review_date": "2016-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Literally the worst movie of 2016",
            "review_date": "2016-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is what the viewer's who did not like the movie Fifty Shades of Gray and made fun of it.",
            "review_date": "2016-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible I want a refund",
            "review_date": "2016-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some parts made laugh so hard but this movie was ultimately shit.",
            "review_date": "2016-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty bad movie but for some reason I made it through.",
            "review_date": "2016-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gross and humourless.",
            "review_date": "2016-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "warning, you have to be super high before watching this.",
            "review_date": "2016-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Marlon Wayans is back to remind us why spoofs are meant to waste our valuable time, yet somehow they just cannot be avoided for what they are; garbage.",
            "review_date": "2016-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the funnier parodies of its kind if you like comedic films that make fun of other movies then this one's a must see.",
            "review_date": "2016-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If Fifty Shades of Grey was a terrible movie, then there is not much left for its spoof Fifty Shades of Black. Clichéd, unfunny and with erratic story, this is a typical Marlon Wayans' delivery (you probably remember him as Shorty from Scary Movie) that shamelessly exploits the success of the Scary Movie 1 & 2.\n\nGenerally a spoof of Fifty Shades of Grey and with references to Zero Dark Thirty and several other recent movies, Fifty Shades of Black is impossible to be described in terms of a story. The most important element for a spoof movie, the humor and the fun, are unfortunately totally missing from the 93 minutes of shameful filmmaking. I could recollect only one single moment in which I actually laughed and this is certainly not enough to justify seeing this disaster. \n\nIn conclusion, Fifty Shades of Black is just another example that spoof movies are not fun anymore and that the makers of this kind of sub-genre should be banned from filmmaking for life !",
            "review_date": "2016-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is so lame & I wouldn't pay to go see it.",
            "review_date": "2016-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'll be honest... This movie is stupid but oddly funny. It's very erratic an jumbled around and forced at more times then it needs to be. I could not stand Haunted House 2 but actually liked Haunted House. I know Marlon can write a good comedy and be very funny. But he needs his family back in the game with him when it comes to these types of movies. This movie is very out there and ridiculous but so was the movie in which its spoofing. When you watch this and rewatch fifty shades and grey, you'll see how this movie hit it on the nose. I wouldn't say this is a great spoof or even remotely close, I would compare it to Date Movie in terms of being a guilty pleasure of craziness and no where in the ball park of Airplane or Naked Gun. I would say watch it but give it a shot and see what you think.",
            "review_date": "2016-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty darn awful and mostly unfunny.",
            "review_date": "2016-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'd give it zero stars of I could. We walked out after 20 min as it nothing going for it.   The trailer had the only good bit on it.  Complete rubbish and a waste of 20 min if our lives",
            "review_date": "2016-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first half of the movie was really funny with the racist jokes, but it the second half runs out of material to talk about.  I think the biggest joke is that black people are allowed to make racist jokes without anyone protesting.",
            "review_date": "2016-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is by far tge worst spoof film I have ever seen. I would definitely not recommend this to anyone.",
            "review_date": "2016-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stupid and unfunny. This movie manages to be a little bit more interesting than the movie it's parodying.\nD",
            "review_date": "2016-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow this movie did better than the fucking oringal",
            "review_date": "2016-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh dear dear dear... Pretty appalling with the occasional funny bit :-)",
            "review_date": "2016-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This garbage is so awful I actually walked out, feeling disgusting.",
            "review_date": "2016-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the worst movie I've seen in a long time.",
            "review_date": "2016-02-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once again, Marlon takes the cake...How they manage to get Florence Henderson and Jane Seymour to do this movie is beyond me",
            "review_date": "2016-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not worth your money. This is fifty shade of bullshit smh",
            "review_date": "2016-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's on par with what it's trying to make fun of. \n\nYou had one job...how could you fail. \n\nIt's not even that hard.",
            "review_date": "2016-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Waste of time and money!!!",
            "review_date": "2016-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I demand my money back.",
            "review_date": "2016-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just because you are another guy that has money and the connections to produce or direct or start in a movie doesn't mean you make an expected bad movie worse , a movie for people with a sense of humor that let's you notice you forced yourself to laugh, or a movie to just watch  or waste the time seem so unnecessary by even missing every one of those possible categories on purpose \n\nIf this sounds familiar it's simply because you have seen movies like Ted and This is the end\n\nWe went to the theater because the guys we think are cool start in them but they rather take the criticism after fooling everyone and make a joke in another terrible movie like Entourage saying he'll make another just like it as long as he gets paid...\n\nCome on Marlon don't go that low\n\nI'm sure that if Ricky Martin sang at bars just to have some extra cash his concerts wouldn't be sold out as much as I think or people say they are and yes Mark you too\n...you are better than that.",
            "review_date": "2016-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this and it was so stupid from thr beginning to the end.  waste of time.",
            "review_date": "2016-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is what it is a piss take of 50 shades of grey",
            "review_date": "2016-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So dumb. A couple of funny scenes. Those can be seen in the trailer.",
            "review_date": "2016-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'll give it zero stars. Not funny...",
            "review_date": "2016-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I laughed.... A LOT. How many of those laughs was I NOT ashamed of? Very, very few.\nBut it was funny.",
            "review_date": "2016-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LOUISA SAYS:\n\n\"Fifty Shades of Black\" is not quite a parody and not quite a spoof. How can you successfully make fun of a pop culture phenomenon that in itself is already one big joke? This is a nearly scene-by-scene recap of the movie version of \"Fifty Shades of Grey.\" It's like a group of giggling 16 year old boys sat in a room, watched the original movie and came up with their own lame gags. Sadly, most of the antics and wisecracks are borderline dreadful.\n\nI'm not saying there's nothing to like here. There's the always charming Marlon Wayans and a fun homage performance from Kali Hawk. There are more than a few surprisingly original, very funny jokes that made me laugh out loud. Jane Seymour, as Christian's clueless stepmother, delivers some of the best material in the movie. The funniest jokes are the ones that poke fun at racism and the s&m / sexism that bubbles over in the original story. At least they weren't lazy and tried to write good jokes. But none of these highlights can save the mean-spirited, clunky attempts at humor.\n\nThis movie isn't nearly as bad as you think it would be, but save your money and wait to rent it on dvd.\n\nMATT SAYS:\n\nSpoof movies usually suck. And not just a little. A lot. The worst are those awful Seltzer / Friedberg reference movie collaborations, like \"Disaster Movie\" and \"Meet the Spartans.\" The Wayans brothers, however, consistently make better parody movies than pretty much everyone else. Not that they're great (they usually aren't), but the writing is pretty much always better than your average spoof. \"Fifty Shades of Black\" is no exception.\n\nNot that \"Fifty Shades of Black\" is a good movie, exactly... it isn't. But it is watchable, which is saying something for a movie like this one. There are some good jokes here, and most of them are not completely lazy. Some actual thought went into writing the script.\n\nThe problem with any parody is that it helps when the film being spoofed was been good in the first place. This is particularly true where, as with \"Fifty Shades of Black,\" the storyline pretty much follows the original. If the original story wasn't that interesting, the spoof usually won't be, either. It's hard to keep an audience's attention when the story itself is dull.\n\nThe filmmakers did the most they could with boring source material, and managed to squeeze some pretty good laughs out of it. That's still not enough, however, to make the movie one to recommend.\n\nA SCREEN ZEALOTS REVIEW",
            "review_date": "2016-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mehhhhh... Ok... It was interesting but it needed a little bit of sweet to be catchy...",
            "review_date": "2016-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a huge pile of ð??©ð??©ð??©",
            "review_date": "2016-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst movie I have ever seen, ever. \nI had to step out of the theater after the first hour to get some air because of how bad it was going.",
            "review_date": "2016-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this movie was hella funnier, funnier than my expectations",
            "review_date": "2016-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was not his best. It a few funny moments but not overall bursting with laughter. If this is his best work I dont want to see his worst. Or maybe I have.",
            "review_date": "2016-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "awww man,i can't believe this movie has such low reviews, well, i enjoyed it, the beginning was super funny, then it kinda tapered off, and picked back up at the end...it's a spoof, and it's friggin marlon wayans, so u get what u expect!!",
            "review_date": "2016-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like Marlon but did not find this movie funny. Really only laughed 2 times in 2 hours and 22 minutes. I should have waited to see it on cable.",
            "review_date": "2016-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Contrary to a lot of the reviews here, I really liked the film. I was kind of expecting a somewhat lame movie, like the one that was done about the video recording in the haunted house, but this was actually much better.\nThe jokes start from the first 60 seconds of the movie, where the wealthy\nmain character is apparently getting assistance putting on his suit, from his butler. But that isn't it at all!  The jokes come thick and fast, and if you are not alert, you will probably miss some of them. You have to be paying attention.This was one of the better and faster-paced movies made as a satire. In the showing I attended, I would say the audience was laughing at least every 30 -60 seconds. I thought they were very clever with the jokes, and even paid tribute to some other movies.........(Pushing or dragging might be of significance if you see this movie, but I won't say why.)",
            "review_date": "2016-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In all honesty, this spoof of the Fifty Shades of Grey movie had much more appeal than the series itself. A film with such content should never take itself too seriously therefore it was ideal material for it to be parodied. Admittedly it helps to have watched the original so you can appreciate the jokes more, but it's not essential. With strong black humour running throughout, this is littered with crude racial innuendos that only the Wayan's brothers could get away with.",
            "review_date": "2016-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just incredibly awful! This has like 1 or 2 funny scenes that made me chuckle but the rest was god awful! Horrible, horrible, horrible!!",
            "review_date": "2016-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fifty Shades of Black Full Movie HD 2016\n\nDownload 1 =>> http://imgur.com/w2YLr4b\n\nDownload 2 =>> http://moviepilot.com/posts/3780246",
            "review_date": "2016-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was a little funny but it was missing something I'm not sure what it was but I'll give it a 1",
            "review_date": "2016-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't understand why anyone who gave a length and vocabulary-filled negative review would take time to write your opinions down, if it was truly that bad and wasted your time. \nI have not watched any of Wayan's movies before, or any of the main character's, but I personally liked this movie, two reasons:\n1. It made you laugh, it was fun. The part where Hannah's friend beat up Christian with excellent Gongfu skills outside the bar, the part where Christian's spanking never worked, and the part where the two chose to communicate in a black way rather than using an emotion-squeezing method. \n2. It beat the sad, sick ending of Fifty Shades of Grey.\nThink about it, was it really a good ending when a girl as innocent and easy-going as Anastasia had to fall in love with a perfect Grey who clings to his personal issues and then had to leave the elevator and say goodbye? \nHowever, in Fifty Shades of Black, the female character successfully got Christian to spill out his childhood miseries and convinced him to work on his issues, though the two were arguing and fighting, but they made it work, eventually! Which is hopeful and nice! \nWho would you choose to be? If you were Anna or Hannah?",
            "review_date": "2016-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was pretty dumb but had a few spots that were funny and all but it's for sure a big spoof movie for sure it is ridiculous.",
            "review_date": "2016-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely a waste of money....even if it was free.",
            "review_date": "2016-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible Movie\nI maybe chuckled at Best a few times.  It was a complete waste of money.  Even if it was free it still would have been a waste of time.  Do not waste your time or money on this movie - big dissapointment.",
            "review_date": "2016-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only 5:24 into the movie and I wanted my money back ð??¡ really it's been a decade when the wayans made funny  movies, now it's like your trying the same jokes that not even kids will laugh bc it's corny. I've been a fan of the wayan brothers but after this movie it's just trying to get money from fans that end up disappointed. Squeeze the most out of the cow while you can I guess.. Get stoned and you just might enjoy the movie",
            "review_date": "2016-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "can i give less then 1 star? don't waste ur time.",
            "review_date": "2016-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was funny but could of been a little funnier!",
            "review_date": "2016-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was an awesome movie, man. At first, I thought it was going to be kinda lame funny, but it knocked out the park. Great movie. Must see.ð???",
            "review_date": "2016-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a lot of jokes missed but i laughed a lot. very similar to haunted house 1&2 (2 viewings)",
            "review_date": "2016-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Trying too hard to be funny but so often failing miserably.",
            "review_date": "2016-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was absolutely terrible maybe three or four funny parts but they just need to stop making fun of movies ...",
            "review_date": "2016-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "while not on the level of scary movie, its not as bad as some people say it is. its actually funny. If you enjoyed the haunted house movies you will enjoy this to some degree.",
            "review_date": "2016-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With jokes and gags that slap you across the face harder than being on the submissive part of an S&M session, this Fifty Shades parody Black-balls spoof films back into virgin territory. In the bland tradition of Date Movie, Superhero Movie, and Meet the Spartans comes Fifty Shades of Black, a one (and a half) note send up of the one-note film spawned from E.L. James' one-note novels. Granted, taking aim at bottom-feeders allows for a ripe proving ground of comedy because these low denominators are unintentionally funny to begin with. Unfortunately, Black aims just as low as it intended victim, trying to wring easy laughs out of material that accidentally ended up to be funny in the source material. If some pointed jokes about race and sex didn't at least hit just inside the dartboard, Fifty Shades of Black wouldn't even rank one (and a half) star. In regards to skewing pop culture, Black is - simply put - whack.\n\nIn this R-rated spoof, an inexperienced college student meets a wealthy businessman whose sexual practices put a strain on their relationship. \n\nNot much was expected of the Wayans's parodic oeuvre, mind you. With Dance Flick and Haunted House having already grabbed very low hanging fruit (think: strip mining topsoil) off of other genres rather than play it straight with clever dialogue a la Airplane! or The Naked Gun, this gratuitous exercise follows in very much the same small footsteps. The leads make the most out of cheap shots but some cameos from Fred Willard, Jane Seymour, and - wait for it - Florence Henderson make for the funniest exchanges. \n\nBottom line: Meh in Black",
            "review_date": "2016-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The jokes were outdated and the cursing just dumbed down the whole script. The scenes were setup nicely, but the execution just wasn't smooth. It had potential with the great cast, but It was bland and distasteful. I witnessed several people walk out of the movie theater.",
            "review_date": "2016-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "an okay parody film with some predictable humor. as a fan of series, it was worth one watch.",
            "review_date": "2016-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is not worth nothing I can't believe a actor took a role in this movie",
            "review_date": "2016-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was dying the out the entire movie.",
            "review_date": "2016-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "DON'T WASTE 2 HOURS OF YOUR LIFE ON THIS MOVIE",
            "review_date": "2016-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was so horrendous and uncomfortable that I will not be watching any new Wayans brothers movies period!!!! \n\nI would have given it a zero rating but lowest I can go is half a star.",
            "review_date": "2016-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wanted to hang my self a minute after the movie started",
            "review_date": "2016-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a big waste of a film. Everything about this movie was a re cut of \"Fifty Shades of Grey\" making fun of it scene by scene , and while that worked for one or two scenes of the film a lot of the rest of this was filled with sex jokes, poop, and other stupid things. I didn't find the film funny on any level. Many of the scenes I felt disgusted by more than anything else. This film is full of stereotypes for African Americans. Trying to be funny but failing on all accounts. I began to wonder why this film was so stupid, and dull for me and then I saw the director. Micheal Tiddes, who also worked on \"A Haunted House.\" How is this guy such a success. His comedy is so out there and dull, and his parody style is so grotesque that I find it kind of insane that he is still around and making so much money off of people. This is a poor film and doesn't deserve the light of day. Sorry Fifty Shades of Black but you have failed the movie business.",
            "review_date": "2016-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible - when you respect yourself first, then others will respect you.",
            "review_date": "2016-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible. was not all that funny. Haunted House was so much better.",
            "review_date": "2016-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "horrible, obscene, lacks taste, and quite possibly the worst movie I've ever seen. Doesn't even deserve 1 star. What a waste of money and poor use of talent.",
            "review_date": "2016-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While I'd be a liar if I said I didn't get a chuckle out of this movie, I'd also be doing a disservice if I said there was anything of merit to this film. Avoid at all costs.",
            "review_date": "2016-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious movie , Marlon Wayans is funny the whole movie",
            "review_date": "2016-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awful is putting it mildly. This movie wasn't even funny. Come up with a better work Wayans. But they said I spent money on watching this movie. I don't think I would even rent it. It is that awful.",
            "review_date": "2016-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this film.  It was funny and sexy, and that's what a gal just needs now and then.  The two leads were so much like the characters in the book, and the plot followed right along.  I particularly liked the shots of (fake) genitalia and the sendup of the hero's sexual prowess -- with a possible explanation for the tastes of the hero of the original.  It's not for everyone -- white guys might pass , but to me, it was just what I wanted.   Not politically correct, BTW.  Which is why it was funny.  Imagine a whip called \"12 Years a Slave\" alongside \"LeBron.\"",
            "review_date": "2016-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was pretty funny and if was defentily better then 50 Shades of Grey and at least this Christian was good looking.",
            "review_date": "2016-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was so obnoxious it got boring.",
            "review_date": "2016-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies ever made, probably wins Worst movie of 2016",
            "review_date": "2016-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stupid movie, so dumb we walked out of it and didn't even finish it!",
            "review_date": "2016-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was exactly as I expected the first 15 or 20 minutes and then the jokes and gags repeated themselves for the rest of the movie.",
            "review_date": "2016-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So awful I feel like the word awful might feel bad for me using it for this movie. I happened to enjoy spoofs from the Wayans too but this was tragic. I almost walked out after 15-20 minutes in. The roommate is the worst, positively annoying in every scene.",
            "review_date": "2016-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies I've ever seen.  I didn't think it could be worse than 50 Shades of Grey but I was wrong, it makes that movie look like a cinematic marvel.",
            "review_date": "2016-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I only gave this one star because zero stars was not an option.   We stomached this ridiculousness for almost forty-five minutes before deciding we had wasted enough of our time.  Too bad we didn't leave fifteen minutes earlier - we could have gotten a refund.",
            "review_date": "2016-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the title is kinda raciest none the less cornie movie. hated it!",
            "review_date": "2016-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not for everyone, but there's fun to be had with this movie.",
            "review_date": "2016-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sooo BAD, that it was funny!",
            "review_date": "2016-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fifty Shades of Black FullMovie\nDownload Now => http://imgur.com/JstRYcI",
            "review_date": "2016-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "funny movie if you love the Wayans it's a must see!",
            "review_date": "2016-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the worst movie I've ever watched but not that far off either. If you're looking to laugh you might a couple of times but that'll be it.",
            "review_date": "2016-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love Marlon Wayans but this was just not as great as his other parodies. You know when someone tries really hard to make you laugh and you're just lookin at them like, \"what the hell is so funny?\".....yeaaaaaa damn shame.",
            "review_date": "2016-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funnier than I was expecting, but only because I've read the 50 Shades books and was likely able to get more out of it than most people. Even then, for whatever reason Wayans makes jokes that are unoriginal and don't really add to anything going on onscreen.",
            "review_date": "2016-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In a string of attempts to produce a laugh, Fifty Shades of Black is hilariously unfunny and barely provides a decent chuckle.",
            "review_date": "2016-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"This film was funny at times and was really nailed the head on some scenes, but for every three or so scenes that were like that you had a scene that went away and put more pop culture references than probably necessary. Other than that though...\"\n\nFull review at: http://cinemasquirrel.blogspot.com/2016/02/fifty-shades-of-black.html",
            "review_date": "2016-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a waste of time sitting through this unfunny movie. People were walking out, which I should have also, but I kept waiting for something funny to happen, but all we got was sick toilet humor.",
            "review_date": "2016-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I laughed once..if that",
            "review_date": "2016-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring!!!  He's funny but this was not a good movie!",
            "review_date": "2016-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If Fifty Shades of Black isn't the worst movie of 2016, it's going to be cinematic torture for me for the next months! Fuck this movie, and fuck you, Marlon Wayans! 0/5 stars!",
            "review_date": "2016-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible...don't waste your life or money on this one... No Good I warn you! No Good!",
            "review_date": "2016-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie is just as garbage as his other \"spoofs\" ignore it just like his other ones",
            "review_date": "2016-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolute tripe. One or two funny moments but not laugh out loud. I felt completely disappointed. Don't go. $12.50 and 90 minutes of your life wasted.",
            "review_date": "2016-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's stunning when a member of he Wayans clan makes a completely unfunny movie, but there is literally one scene that made me even break a smile in 93 minutes and it's a sight gag involving whips.  That is the only reason I give it one star instead of none.",
            "review_date": "2016-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the worst movie I've seen.",
            "review_date": "2016-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i didnt expect much from this movie but it was pretty funny.only watch it if you saw 50 shades of grey,or you will be lost.",
            "review_date": "2016-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was not funny and just plain horrible",
            "review_date": "2016-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie sucked. Don't waste your time.",
            "review_date": "2016-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You would think with all the accumulated earnings the Wayans brothers, Shawn and Marlon, have obtained after being on Television and in films for years that they would invest their money and their time in projects that would be a bit more thoughtful and entertaining. Instead, ever since the runaway success of \"A Haunted House\" in 2013, the two, particularly Marlon, have been keen on making movies that fit the bill for the lowest common denominator of entertainment. \"Fifty Shades of Black,\" a horribly obvious and persistently unfunny array of cheapshots at the erotic novel/film series that is already too easy to joke about, continues Marlon's streak and incredible failing to make something out of his Baby Way Productions company. \n\nI've always found it interesting that while Tyler Perry's films are anything but consistent, and there are about an equal number of bad films in his catalog as good films, he often gets blamed for making films about black people that cater to the lowest common denominator and showcase them in a negative light, yet the recent collaborations of Marlon Wayans and Michael Tiddes go pretty much unscathed. These are films that evoke some of the most putrid and ugly stereotypes about nearly every race and, for that matter, exist simply as unapologetically crude and contrived projects that do nothing but attempt to evoke laughs based on brand-recognition. These films are just a slight notch above the dreaded works of Jason Friedberg and Aaron Seltzer.\n\nAs hinted, \"Fifty Shades of Black\" is a parody of \"Fifty Shades of Grey,\" and it takes pretty much the safest, most convenient route to parody the film by making the jokes largely centered around the absurdity of BDSM and its culture, race and ethnic humor, the ordinariness and \"ugliness\" of its lead female character, and the enigma surrounding its titular character, who in this case, is Christian Black (Marlon Wayans). Christian is a multi-millionaire mogul who begins a sexual relationship with his new intern, Hannah Steale (Kali Hawk) and what entails is a relationship filled with sex, sexual violence, and downright bizarre encounters.\n\nWhile whatever Adam Sandler and his Happy Madison gang is cooking up this year is likely to get plenty of Razzie nominations, Marlon Wayans and his cast of familiar faces such as Affion Crockett, Missi Pyle, Mike Epps, Fred Willard, and more should be looking at the same award. It's incredibly rare to see a cast ostensibly operate on auto-pilot and look like the end product bearing some essence of quality is the furthest thing from their minds, but perhaps given the lazy screenwriting of Rick Alvarez and Wayans himself, this was to be expected. \n\nShockingly enough, \"Fifty Shades of Black\" offers more laughs than both of the \"Haunted House\" films put together, especially during a sequence that parodies one of last year's Best Picture contenders at the Academy Awards. However, in order to get to this sequence, one has to succumb to the drudgery of enough racial and bathroom humor - so much that it gives Laura Mulvey's concept of \"phallocentrism\" a whole different angle to explore - that it ultimately isn't worth sitting through the amount of trivial nonsense to get to that particular scene.\n\nWe're not even in February yet and this year has already been incredibly interesting for comedies. After seeing \"Ride Along 2,\" I didn't think many more comedies of the year would get much worse than that. Then I saw \"Dirty Grandpa\" the following week and I thought the same thing; there was most likely the weakest comedy of 2016 that I would have to sit through. Now, almost exactly a week later, I've seen \"Fifty Shades of Black,\" and if this isn't the worst comedy of 2016, I seriously fear what I have to endure in the coming eleven months.",
            "review_date": "2016-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst movie ever.  No Oscar here.",
            "review_date": "2016-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another annoying, boring pardony movie with pointless plot.",
            "review_date": "2016-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't give a negative rating, so a half a star will do. It sucked! I didn't laugh once.",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To say this movie simply got robbed of an Academy Award Best Picture nomination is the understatement of the millennium.  Forget Citizen Kane, forget the Shawshank Redemption, this movie sets such an incomparable precedent for future films of any genre that I find any kind of comparison simply criminal. Flawless in every imaginable category, this film is not only the clear winner for the best film of 2016 and the 2010's in general, but for the best film of this century.",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's obvious this movie was made with time in mind, not entertainment.",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie was not good, I expected it to be funny. I laughed 3xs throughout the whole movie. Do not waste your money!!!!!",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I did not like it at all. The  language was horrible. If I wasn't with my sisters I would have left. Not a fan.",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "worst movie ever, not funny at all",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was stupid waist of money",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw the comedy spoof Fifty Shades of Black today, and it was a mildly amusing film.\n\nThere were some funny moments in the movie.\n\nI give it a grade of an B.",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's like I'm seeing a porno movie and plus I was very surprised and in shock Mrs. Brady from the Brady Bunch is in it",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A flaccid movie. I walked out.",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is literally the worst movie ever. I'm in the theater right now super bored and I'm waiting for this to be over.",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie sucks a**, I cannot see this movie any more, a few funny parts but is so down playing on women...",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has some funny moments. But, it's very raunchy and has very strong language.  Much of the humor falls flat.",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Holy shit this is the easiest movie to make and somehow they messed it up",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. How the mighty have fallen. Even the fact that they are so racist to white people they were funny movies before. Scary movie was hysterical, the last few they have done were the worst comedies ever and I love raunchy stuff. This was so bad, I wouldn't go again if I was paid.",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't waste your money.... It's stupid and they tried too hard for it to be funny. It's very corny.",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Fifty Shades of Black\" is essentially a shot-for-shot remake of \"Fifty Shades of Grey\" which is supposed to be a parody/spoof. This movie is a mess! While there are sporadically funny moments, it is only because the jokes are so bad that they actually resonate. The sexual humor is over the top and the movie panders to the village idiot who may actually find these jokes funny. This is almost a case of a movie that is so bad it's good, but not quite. I didn't think fifty shades of grey could be re-made any crappier, but this film does just that. I really don't know what to say about this film except that it is just what you would expect from a Scary Movie spoof- a parody of pop culture and other movies that is puerile and laughably bad --------------------------------------------------------- C-",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty terrible, yet it got me to chuckle like twice. 50 shades is such an easy topic to satire though that it pretty much writes itself. I gave 50 Shades of Grey an F and while this film is pretty awful and garbage, if faced with watching 50 Shades of Grey or 50 Shades of Black, I'd watch 50 Shades of Black. Thus I will give it a D-.",
            "review_date": "2016-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Fifty Shades of Black!\" This movie was awesome! One of the Best Movies Of the Year! If You Haven't Seen It, You Need To! This Movie Should Have Been Nominated For 8 OSCARS!  Then THE OSCARS WOULDN'T BE SO WHITE!  THE BEST MOVIE EVER!",
            "review_date": "2016-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie. It was so funny and hilarious especially if you have seen the movie for 50 Shades of Gray. Marlon Wayons is great and some of the characters were so quirky and insane. I was in a mood to laugh and that I did!!!",
            "review_date": "2016-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is so awful and insulting that we along with other movie-goers in the theater walked out halfway through the movie. It deserves no stars. Don't waste your money or your time!",
            "review_date": "2016-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has awesome but not too graphics intercourse scenes. The language is really good because it is over the top and I cannot wait to find a real woman who is emotionally stable and will go for a rougher BJ with cum in it",
            "review_date": "2016-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Ok. Come on. How do you think it was? What would you think I would have to say about it? Can't say it matched expectations. Because there were none. Parody films have been dead for years. You're basically watching every joke you made (or the Internet made) during \"Fifty Shades of Grey\". Literally nothing I can say about this. It's exactly what it looks like. Which is not much of anything.\"",
            "review_date": "2016-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The trailers were so funny, but that was about it. I laughed more during the trailers, than in the 93 minutes of the entire movie. I actually saw it early on Thurs. hoping the audience laughter would not ruin the movie for me. I got my wish for a quiet audience. One star for Marlon/body double's nice body. One star to Hannah's roommate; she was consistently funny. There were funny moments, then preachy moments, then, was that a moral? I'm confused, wasn't this a comedy? To me, the movie also made it clear why male frontal nudity is not customary in Hollywood. The movie also did not seem like a parody, more like \"If 50 Shades Was Black.\" I feel like this movie was written on a bunch of napkins and random notes on phones, then, with the focus of a blind man with Tourette's and ADHD in need of a new prescription... Fifty Shades of Black was born. Thankfully the ending does not seem to imply a sequel!",
            "review_date": "2016-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you have seen scary movie and the like you know what to expect. The movie has plenty of cheap laughs. Cheap, but laughs none the less.",
            "review_date": "2016-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was very funny and it was almost exactly like the  regular movie",
            "review_date": "2016-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst film of the year, tries to be funny but fails miserably",
            "review_date": "2016-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not awful but just more of the same thing from Marlon Wayans. Definitely wait for cable!",
            "review_date": "2016-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Marlon's movies are always great or like this one... Had a few good moments.  I think Marlon is putting out too many movies and has a hard time coming up with good fresh jokes.    Wait for DVD or Netflix.  Not worth the money.",
            "review_date": "2016-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a lot funnier then I thought it would be especially considering how horrible a haunted house 2 was. I actually laughed a lot. It's not something I would pay to see so I'm glad I have my movie pass card lol.",
            "review_date": "2016-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All i can say is this was the most boring movie ever! not funny at all.",
            "review_date": "2016-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Wayans Family has created quite an entertainment dynasty over the past three decades or so. Long before anyone had heard of Tyler Perry, the Wayans Brothers, as most people refer to them, started creating big and small screen entertainment that catered to the African-American audience. The Wayans brought us the sketch comedy show \"In Living Color\" (1990-1994) which, in turn, helped launch the careers of Jim Carrey, Jamie Foxx and David Alan Grier, among others, as well as films like \"I'm Gonna Git You Sucka\" (1988), \"Major Payne\" (1995) and the \"Scary Movie\" horror film parodies (2000-2013).\n\nThe Wayans are mostly known for their parodies. 2016 adds another one to the list with Marlon, the youngest of the original \"Wayans Brothers\", co-writing and starring in \"Fifty Shades of Black\" (R, 1:31). Most will immediately recognize that this film is a take-off on 2015's very successful film adaptation of the book \"Fifty Shades of Grey\". Like most of the Wayans' films, pop culture and movie references abound, but \"Fifty Shades of Black\" duplicates much of the plot of the film that inspired its comedy. You'll see what I mean in the following plot summary (which, by the way, is necessarily risqué).\n\nHannah Steele (Kali Hawk) is an attractive and intelligent college senior in Washington State who fills in for her sick roommate, Kateesha (Jenny Zigrino) in interviewing billionaire business magnate Christian Black (Marlon Wayans) for the college newspaper. Hannah gets flustered in the presence of this sophisticated, supremely-confident and mysterious man. Christian is quite taken with Hannah - and take her is what he soon decides he wants to do. He shows up at the hardware store where she works, takes her out to coffee and even comes to \"rescue\" her when she drunk dials him from a bar. Despite how obvious it is to the main characters and to the audience that these two are very, very different - and despite the title character's own conflicted resistance - these two cannot resist each other. But Christian very clearly states, \"I don't do romance.\" That doesn't stop Hannah from being drawn to this man.\n\nAs Hannah discovers more about the cipher that is Christian, she learns that he is wounded - both emotionally and physically - by his childhood. She seems to want to comfort this man who acts as if he needs no comforting and begins to love this man who tells her that he is only interested in her for sex. Being the woman in Christian Black's life means submitting completely - sexually and otherwise - to his whims. As he eases her towards an understanding and acceptance of his lifestyle, she has to sign a non-disclosure agreement, he convinces her to have sex (actually \"f--- hard\", as he describes it) and then shows her his \"playroom.\" This usually locked room is painted dark red, has a bed and is filled with various restraining devices and implements of sadomasochistic sex play. Hannah is shocked, but not necessarily repulsed. Christian presents his contract which describes Hannah's role as his submissive.\n\nI just did something I've never done before (or even been remotely able to do) in a movie review. The previous two paragraphs are actually cut and pasted from my 2015 review of \"Fifty Shades of Grey\"! Using the \"find/replace\" function in Microsoft Word, I changed the names of the characters and the actors playing them to match those in \"Fifty Shades of Black\" and I shortened the summary, but I did not add or change anything else. (You can scroll down our timeline to my \"Grey\" review to see for yourself.)  \n\nBut rest assured there's plenty in \"Black\" besides just recreating and making fun of scenes from \"Grey\". \"Fifty Shades of Black\" also seamlessly incorporates Wayans-esque versions of scenes from such movies as \"Whiplash\" and \"Magic Mike\". There are also references to a plethora of other popular movies, TV shows and books, plus a generous helping of pop culture satire and some politics. This is the kind of film which is so fresh, it feels like it was written a month before its release, but that means that its humor (and perhaps its appeal) will quickly become dated. Of course, there's also plenty of racial humor, much of it stemming from white actors Jane Seymour and Fred Willard playing the title character's parents.\n\nLike much of the Wayans' work, \"Fifty Shades of Black\" is very funny in spots, but those spots are small and spread out. The few clever/amusing jokes and sight gags and even fewer laugh-out-loud moments seem adrift in a sea of gross-out humor and over-the-top acting which is often not that funny. Still, most Wayans fans will probably enjoy the film and those who've only seen a little of their work may find this one good enough for a mild recommendation. \"B-\"",
            "review_date": "2016-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can you put 0 stars? Complete and utter garbage. Garbage!  It is not remotely funny, oddly edited and a complete waste of time. The 90 minutes drags on and on. Two people left and the guy in front of me checked the time on his phone at least three times. The worst part... it's filled with tasteless racial jokes and language.",
            "review_date": "2016-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's Marlon Wayans being Marlon Wayans. This is not a good movie by any means what so ever. So why did I rate this a 2 instead of a 1? Because he put some effort into this film. As someone who was forced to see Fifty shades of grey, it was kind of cathartic to see someone bash it. Some of the jokes were actually funny. Very few, but some. Do I recommend you see it? F#$& no, but I've seen worse especially from Marlon Wayans.",
            "review_date": "2016-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not the worst movie I've ever seen, but if I'm lucky I'll never watch it again.",
            "review_date": "2016-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only good thing about this movie is it's not that long... Don't even watch this one on bootleg... #garbage",
            "review_date": "2016-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Had is funny parts and very silly.  However,  I have seen much better work by Marlon than this.  This movie was okay.  Would  not buy it and add it to my collection.",
            "review_date": "2016-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An hour and 33 minutes of cotton candy for the brain. This spoof of \"Fifty Shades of Grey,\" is both funny and naughty. The Wayan Brothers not only push the envelope, they seal it and send it. If F-bombs and N-bombs bother you, you might want to take a pass.",
            "review_date": "2016-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Occasionally funny but basically mediocre, at times pretty bad.  However, it is CITIZEN KANE or CITY LIGHTS when compared with DIRTY GRANDPA and RIDE ALONG 2.",
            "review_date": "2016-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OH MY GOD he finally made a good movie with laughs. I says when I the trailer that this is what fifty shades of grey gets for holding of fifty shades darker but this was just a great movie.",
            "review_date": "2016-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well this should garner a lot of Oscar nominations.  LOL",
            "review_date": "2016-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very awkward... but half way through I was laughing so hard I was crying.",
            "review_date": "2016-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'd be stunned if this is overlooked by the Academy",
            "review_date": "2016-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I pull t watch the whole thing",
            "review_date": "2016-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the worst movies I've ever seen. If I could give this movie negative stars I would. I have to admit that I never saw \"50 Shades of Grey\" so there may be some things that went over my head; however, my wife saw \"50 Shades of Grey\" and thought the movie was horrible as well.",
            "review_date": "2016-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visit http://bit.ly/1Td6mrU if you want to watch Fifty Shades of Black Full Movie Online HD Quality :D",
            "review_date": "2016-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is so dam funny",
            "review_date": "2016-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just have that feeling it going to be bad if it's turns out to be good I'll give it five stars",
            "review_date": "2016-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50 Shades of Black\n\nWell I'm just gonna say it this movie is flat out terrible maybe a few stupid chuckles but its just not funny just goes with the same old Shit, Dick jokes and actually showing the dick was not needed \n\nAll Marlon does in the whole movie is lick things trying to be funny \n\nthe saddest thing that pissed me off when they tried to make fun of Whiplash but with Sex \n\nOverall: Just like Vampire Sucks failed for making fun of Twilight this has failed at making fun of 50 Shades of Shit cause 50 Shades of Shit is already a joke itself\n\nOverall Grade: F",
            "review_date": "2016-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was ok not that funny",
            "review_date": "2016-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was actually a good movie but it still could have been a lot more funnier.",
            "review_date": "2016-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"That's right folks, getting mauled by the bear from \"The Revenant\" would be more comfortable than sitting through Fifty Shades of Black\"\nDVD Movie Review: Fifty Shades of Black\nDate Viewed: April 20 2016\nDirected By Michael Tiddes (A Haunted House and A Haunted House 2)\nWritten By Marlon Wayans and Rick Alvarez\nStarring: Marlon Wayans, Kali Hawk, Jane Seymour, Fred Willard, Affion Crockett, Mike Epps, Florence Henderson, Mircea Monroe, Kate Miner, King Bach and Dave Sheridan.\n\nWhich of these three options suits you better? Getting mauled by the bear from \"The Revenant\"? Going out on a date with Republican presidential candidate Ted Cruz? or sitting through \"Fifty Shades of Black\"?. I say getting mauled by the bear because this crass parody of \"Fifty Shades of Grey\" is nearly unwatchable. Despite having vulgar gags involving semen, long hammers and big balls, the MPAA still gave this movie an R rating. \"Fifty Shades of Black\" should've gotten an X or NC-17 rating because if the entire continent of Europe were forced sit through 90 minutes of agonizing torture, they will probably prosecute the filmmakers for psychological abuse against moviegoing audiences. Who is responsible for this dreadfully unfunny spoof? You guessed it, it's Marlon Wayans, possibly one of civilizations most unfunny comics working today. Wayans along with his co-conspirators, co-writer Rick Alvarez and director Michael Tiddes have created a monstrous cyclone filled with disgusting humor and awful comedic performances.\n\nMarlon, don't you have better projects in mind instead of making more terrible spoof movies? Didn't he realize this genre died while he made the first \"Scary Movie\"? To refresh your memory, that movie also had writing credits for Jason Friedberg and Aaron Seltzer who would go on to inflict \"Date Movie\", \"Epic Movie\", \"Meet the Spartans\", \"Disaster Movie\" and \"Vampires Suck\" on intelligent moviegoers. Now Marlon Wayans has gone off to make terrible spoofs on his own without their help. He made the two \"Haunted House\" movies, which weren't any better and \"Fifty Shades of Black\" is just as bad. To nobody's surprise, it wasn't screened for critics on it's opening day because Marlon Wayans always gives the finger to them for hating his movies.\n\n\"Fifty Shades of Black\" tells the exact same story as \"Fifty Shades of Grey\" but with African-Americans in the cast, we follow college student, Hannah Steale (Kali Hawk) who goes for a job interview with wealthy businessman Christian Black (Wayans). He didn't make his money the old fashion way, he made his money through drug dealing and a stint as a male stripper (obviously riffing \"Magic Mike\"). Just when things couldn't get any worse, we meet Christian's brother, Eli Black (Affion Crockett, another Wayans collaborator) who has a \"Weeknd-style\" haircut and a long hammer that can reach the floor, Jane Seymour as Christian's racist adoptive mother who teases Hannah with a taser gun saying \"I'm standing my ground! I'm standing my ground!\" and with Christian replying \"Black Lives Matter\", and in a flashback sequence we meet Florence Henderson doing riffs on \"The Graduate\" and \"Whiplash\" as we see her teach some rhythm  lessons with Wayans. She later says, \"I thought you black guys were all rhythm and have big Ds\". WOW! WOW! WOW! What a comedy this is!\n\nOf course, we get to the S&M scenes and they range from irritating to unfunny to annoying to \"Get me out of this movie!\". In the midst of all this, I ashamed to admit that I laughed once during the whole movie. The joke that I laughed at was when Wayans was reading the actual \"Fifty Shades of Grey\" book as a weapon to torture Hannah, he exclaims, \"who reads this anyway, it's terrible!\". \"Fifty Shades of Black\" is well... How can I say this? All of the above.\nBrutally unfunny, terribly unfunny, dreadfully unfunny, not funny at all, beyond stupid, it's just plain awful.\n\nMaybe it's finally time for Marlon Wayans to switch to Netflix because theatrical spoofs just aren't funny anymore. It was all funny when \"Airplane!\" and \"The Naked Gun\" came to town but now this genre is pretty much dead. I still think \"Dirty Grandpa\" is the most horrific comedy of the year but don't worry \"Fifty Shades of Black\", you'll still show up on my worst of the year list at the end of December.",
            "review_date": "2016-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fifty Shades of Black is a dull parody by Marlon Wayans. I didn't hate the Haunted House series, but I strongly disliked this movie. Let's start with the positives. Marlon Wayans really commits to his role. Even if the joke doesn't work, he really goes for it. The film is very hit or miss. Sometimes, the jokes land very well. But most of the time, the jokes fail hard. There are a lot of gags that are stretched out too long that aren't funny. Also, the film sometimes deviates from the story just to make more gags. I didn't like that. Also, the film isn't that coherent and doesn't give a good plot. Overall, Fifty Shades of Grey actually gives more laughs than Fifty Shades of Black. That really isn't a good thing. This is an unfunny parody where most of the jokes don't land.",
            "review_date": "2016-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50 shades of full retard.",
            "review_date": "2016-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was f**king PAINFUL to sit through. I recommend staying far away from this snoozefest by Marlon Wayans.",
            "review_date": "2016-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, I guess it's what you would expect with a parody movie.",
            "review_date": "2016-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bad in every way.  Only funny parts were in the preview",
            "review_date": "2016-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "stupid funny, I needed the laugh and I got it!!!!",
            "review_date": "2016-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "how does this garbage get made? waste of life",
            "review_date": "2016-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It should be so easy to poke fun at Fifty Shades of Grey. Though there are snippets that seem to make an attempt at critiquing the source material, they are buried beneath an excess of extremely juvenile and unfunny sight gags.",
            "review_date": "2016-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "tried making a comical version of Grey and it SUCKED.",
            "review_date": "2016-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its Not As Good As I Thought! kinda Boring And Not Funny!",
            "review_date": "2016-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than 50 shades of grey, no not even close. This was worse than 50 shades of grey, 50 shades made me laugh more. This movie wasn't to funny but it had a few chuckles here and their but that's about it. Rate 2.0/10",
            "review_date": "2016-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the worst movie I have seen in along time so disappointed",
            "review_date": "2016-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A few funny parts but the movie wasn't all that good or funny.",
            "review_date": "2016-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was horrible and mostly not funny.",
            "review_date": "2016-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "NO! NO! NO! NO!...a haunted house 2 was better than this...PLEASE STOP WITH THE PARODY MOVIES! Marlon Wayne's ...you could do better....I hope",
            "review_date": "2016-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It wasn't terribly unfunny, but it was pretty bad. Though you can't expect too much from a Wayans movie these days.",
            "review_date": "2016-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A few laughs here and there, had so much potential!",
            "review_date": "2016-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm a huge Wayans Bros. fan, but the film felt a bit forced, and just recycling the same stuff over and over again.",
            "review_date": "2015-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "just finish watching the unrated version funny as shit the unrated version of this is not for children",
            "review_date": "2015-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ummmmm so I didn't care for this @ all... I ended up turning it off halfway thru...",
            "review_date": "2015-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funnier than I expected",
            "review_date": "2015-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a joke really but bad joke if this is comedy I 'm president who lost time with this movie..",
            "review_date": "2015-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is it a great movie? No, it was a way to tell your friends you'd seen it. The whole movie was sex. There was not that much detail in terms of the characters and their background it was all the sexy part.  The movie was over commercialized the book made you think more about relationships and how a dominant relationship isn't as appealing as people think. The movie took away the thought of the story and made it a \"let's go see the sexy movie\" and you were cool if you saw it.",
            "review_date": "2015-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While we definitely needed a parody to Fifty shades of grey. Fifty shades of black is not the one. It's less sexist and sick, but more crude and juvenile. While once more falling on dated jokes and pop culture references like so many other failed parody movies have before.",
            "review_date": "2015-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Absolute piece of ****\rHad to sit down through this unfunny, racist, **** movie, like almost every parody, it's just worthless to watch, so childish and uninspired, I heard better comedy when I was in **** middleschool, I expected someAbsolute piece of ****\rHad to sit down through this unfunny, racist, **** movie, like almost every parody, it's just worthless to watch, so childish and uninspired, I heard better comedy when I was in **** middleschool, I expected some sexual jokes, but I didn't expect them to be this bad, if you enjoy this you must be **** drugged or have some sort of mental issue. Money grabbing ****-filled and badly produced+acted, I don't recommend it to anyone. Who would enjoy it? No one.\rFinal verdict:\rPainful to watch, almost the lowest rating possible, I do not recommend you watch it under any circumstances.",
            "review_date": "2016-02-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Awful. This word describes the full movie. Even Fifty Shades of Grey isn't that bad. A dumb movie with jokes that only a brain damaged man will find funny.",
            "review_date": "2016-02-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Fifty Shades of Black doesn't even deserve a review since it  would give credit to the idiots that made the film  that they accomplished something. The fact they had an easy movie to make fun and still failed is truly astonishing. The movieFifty Shades of Black doesn't even deserve a review since it  would give credit to the idiots that made the film  that they accomplished something. The fact they had an easy movie to make fun and still failed is truly astonishing. The movie is garbage from beginning to end, with quite possibly the worst, most vile, and annoying person ever to be put on screen.",
            "review_date": "2016-04-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It was only a matter of time that someone came along and spoofed the widely popular and highly alluring pop-culture phenomenon that was Fifty Shades of Grey. What isn’t surprising is that spoof specialist and kinda, sorta washed upIt was only a matter of time that someone came along and spoofed the widely popular and highly alluring pop-culture phenomenon that was Fifty Shades of Grey. What isn’t surprising is that spoof specialist and kinda, sorta washed up actor/writer Marlon Wayans was the one to do so. Wayans, whose previous parody films include A Haunted House 1 & 2, Dance Flick and Scary Movie 1-4 brings forth a very important question with his newest spoof feature Fifty Shades of Black; is the spoof film finally, officially dead?\r Its hard to believe but, after such classics as Airplane!, Austin Powers: International Man of Mystery and yes, even the original Scary Movie, the spoof film may slowly if not almost entirely die off and be resting in peace very soon.\r The world, currently, is one that is obsessed with social media platforms and media within these social networks. Thanks to applications such as Vine, Instagram, Facebook, Snapchat and YouTube, it seems that audiences everywhere are capable of finding comedy and entertainment, not only within the comfort of their own homes, but as easily and accessibly, within moments, in the palms of their hand.\r When the dawn of the television was upon us, people everywhere thought that televisions were going to destroy Hollywood and the history of feature films altogether; it didn’t. With the rise of the Internet and the quickly developing moment of streaming and illegally downloading films and music online, people soon thought that the future of movies and music was on its way on the decline. Yet, in 2015 no less, two of the highest grossing films of all-time were released, and more than ever, the profitability of music has never been better. So, how and why is the spoof film genre dying slowly but surely?\r The thing about entertainment in 2016 is that, entertainment isn’t merely measured but numbers and margins, but by memories and moments of experience and spectacle, with margins and numbers as well. Entertainment is constantly evolving, and the forms in which we consume entertainment maintains the ways in which we determine whether the entertainment itself is viable, or not. The thing with earlier spoof films like the ones that were mentioned above are, in order to consume such comedy, going to the movie theatres and watching it for yourself was the only way of consumption. Now a days, not only are films, genres and characters spoofed on the daily, but pop culture, with the help of social media, spoofs the crap out of anything and everything. Don’t think thats the case? Think back, just in 2015, to all the spoofs you saw online about Adele’s song Hello, Drake’s music video to Hotline Bling, as well as anything else flooding the front pages of your Vine, Instagram and Facebook news feeds.\r The beauty behind the genius in the earlier spoof films of the 80’s and 90’s was that accessibility was limited and, these films weren’t just spoofing a specific movie, having limited content to work with. Think of Austin Powers for example, it wasn’t just a spoof on spy films and a filmography of more than a dozen Bond films at that time, but also a genre, the unbelievability of a lifestyle or profession little to nothing is known about, as well as providing a fantasy for the possibility of the many beauties the life of what an international person of mystery might really be like. Sure, Black may spoof Kim K for a second, the Weeknd here and there, but overall, these small and insignificant and highly forgettable inclusions did nothing to elevate the plot or humour of the film overall.\r If you’re wondering why I haven’t really mentioned the plot line or story of Black, well, thats because the film is basically a shot-for-shot carbon copy of the original Grey film, with added crass and crude black jokes included, sexual innuendoes juiced up to the max and of course, taking what the original did, and making it funny by stripping away its glamorous and polished exterior; essentially,  making it real world scary for real life people. No matter how you look at it, regardless of how much money you have, any girl would be scared of having a wealthy man stalking you at work asking for ropes and zip-ties regardless how cute he may be.\r What I found super interesting with Black was how the film is slowly accepting and transitioning from movie stars, to social media stars starring within feature films. Sure we’ve seen Vine stars make cameos in films before, like Brittany Furland in last year’s We Are Your Friends, but in Black, social media icon King Back/Andrew Bachelor has a very prominent role as the not so subtle yet hysterical best friend Jesse that wants a piece, like any other straight male friend wants from their female friends. Bach represents not only a dominance of social media within feature films, but perhaps, the next phase and new generation of movies stars tomorrow. Plus, is it just me or does Bach remind anyone else of a younger Will Smith circa his ‘Fresh Prince of Bel-Air’ days.",
            "review_date": "2016-08-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "We saw this movie before 50 of Grey. At first we refused to see FSOG because other reviews and basically didnt want to see \"soft porn\" We walked out of 50 SHADES OF BLACK about 40 minutes in. It was basically a hijack of our sensitivityWe saw this movie before 50 of Grey. At first we refused to see FSOG because other reviews and basically didnt want to see \"soft porn\" We walked out of 50 SHADES OF BLACK about 40 minutes in. It was basically a hijack of our sensitivity senses and allowed black men to use the word **** and \"Sex\" in a real **** made movie and make money off those words.\rWe decided to watch FSOG after viewing black and it wasnt as raunchy and demeaning as we thought it would be. Dont waste your time or money on this flop. Its completely stupid, not even close to being funny unless you are black and enjoy and modern likeness to the series roots. Yes, its a baste and lethargic mental attack on white people. Its nothing like his brothers parodies of other productions. We actually demanded and received our money back from Regal Entertainment and that is why we are still current customers of that company. Hopefully the peekaboo was actually Kali's top, that would be the only justification of the movie getting paid. As far as specifics.. It was rude and disgusting. A dirty rag on both races and you already know the ending...It was the worst movie since \"GIGLI\"",
            "review_date": "2016-02-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This one was super goofy and funny, I don't understand the hate. I guess people now are too sensitive, and racist jokes would hurt their feelings to the point of needing a therapy dog.",
            "review_date": "2018-09-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "No, its not the movie we wanted this year. And yes, this movie is another trash thrown to your face. I gotta say, this movie is actually as bad as the original version. Marlon Wayans is as desperate as all the sex scenes shown In Fifty ShadesNo, its not the movie we wanted this year. And yes, this movie is another trash thrown to your face. I gotta say, this movie is actually as bad as the original version. Marlon Wayans is as desperate as all the sex scenes shown In Fifty Shades Of **** Grey. It's an embarrassment for this to be called Comedy. Jokes that you've heard in Middle school and characters that are as childish as an elementary student. This is no doubt the worst comedy I have ever seen. If you liked this film, than I'm so sorry for you.",
            "review_date": "2016-01-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie makes stupid look amazing. The film is just so dumb, and is actually painful to watch. Please don't waste a cent on this movie, because you will be extremely disappointed.",
            "review_date": "2016-01-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Dumb, unoriginal, and painfully unfunny, this movie begs itself to never exist ever again in a theater you're watching this movie. Even Fifty Shades of Grey was bad enough.",
            "review_date": "2016-01-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "What is WRONG with you people?! This was side-splitting fun! Marlon Wayans was hysterical. This was the most fun I've had watching a comedy in forever! You have to understand that this is a parody, not an Academy Award tear-jerker. It wasWhat is WRONG with you people?! This was side-splitting fun! Marlon Wayans was hysterical. This was the most fun I've had watching a comedy in forever! You have to understand that this is a parody, not an Academy Award tear-jerker. It was made for fun and it delivers big time. Having said that, my wife, sitting next to me just complained it was stupid and maybe chuckled once, so yeh, this type of humor sails right over some/many people's heads. But for those like me, HILARIOUS from beginning to end!",
            "review_date": "2017-04-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Fifty shades of black is one of the most succesful comedies I've seen in a long time, this is one of Marlon Wayans best movies just behind \"haunted house 2\" and \"Little Man\" which are both comedy masterpieces.The story was beyond fantastic,Fifty shades of black is one of the most succesful comedies I've seen in a long time, this is one of Marlon Wayans best movies just behind \"haunted house 2\" and \"Little Man\" which are both comedy masterpieces.The story was beyond fantastic, it had a lot of cringey moments but it's also really boring, which is a consistent tone throughout the movie, this was so good and so bland looking that the film almost made me sleep which is a great accomplishement.The film was also racist and stereotypical so there is a lot to like in the story.The characters were absolutely amazing because they had no chemistry with each other and they were so stereotypical and that made me feel attached to them and the actors were so good that you could tell they made this movie to have a beautiful paycheck.This movie is so amazingly competent and unforgettable, it's bland to look at, creating a beautiful atmosphere, the character were so boring and stereotypical and I loved all of them and the movie was so amazing that I almost slept four times during it, do no miss this film because it's one of the best comedies I've ever seen in my life.",
            "review_date": "2017-08-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "At least Fifty Shades Of Black is better than Haunted House 2 otherwise this is just what you expected this film to be god-awful. Who is this made for? Well if you hate Fifty Shades Of Grey that came out last year, then you might enjoy this,At least Fifty Shades Of Black is better than Haunted House 2 otherwise this is just what you expected this film to be god-awful. Who is this made for? Well if you hate Fifty Shades Of Grey that came out last year, then you might enjoy this, yeah there is no purpose for this film it's just to torture us at this point there is no audience for these types of films (expect idiots). This spoof has clever ideas, and at times it's smart, but overall it's dumb just like it's filmmakers. Marlon Wayans stars/co-writer/co-producer as Christian Black an entrepreneur. Hannah Steele (played by Kali Hawk as the Dakota Johnson role) interviews him for her roommate's school paper. No one enjoys these, Marlon Wayans is a jackass if he thinks we enjoy this crap, these filmmakers are dumb, the only reasons these films exist is because of money so dumb people can pay to see this. But it's at times it's funny and at times they make some clever jokes unlike the \"Haunted House\" franchise. But overall it gave me a few chuckles, and I did enjoy some of the jokes and scenes. And I did enjoy some of the scene it's spoofing. 3 out of 5 stars",
            "review_date": "2016-02-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "While it's not as bad as I was expecting it to be, it certainly isn't very good either. Most of the jokes missed the mark, the constant references weren't particularly funny, the acting wasn't all that good and despite it's short runningWhile it's not as bad as I was expecting it to be, it certainly isn't very good either. Most of the jokes missed the mark, the constant references weren't particularly funny, the acting wasn't all that good and despite it's short running time, the movie was quite boring at times. If this movie proves one thing, it's that Marlon Wayans lost his touch at making good parody movies.",
            "review_date": "2018-08-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie was really wack. I know it's a parody and all, but the story and everything else was just dumb. Maybe it was a bit more funny if I had seen 50 shades of gray, but as I haven't, then I wouldn't suggest this to anyone. Only reasonThis movie was really wack. I know it's a parody and all, but the story and everything else was just dumb. Maybe it was a bit more funny if I had seen 50 shades of gray, but as I haven't, then I wouldn't suggest this to anyone. Only reason why I am giving this 1 instead of zero is because it had some funny moments.",
            "review_date": "2016-07-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I know this is a spoof off Fifty Shades of Grey, but they have to have some funny moments and a natural flow. But this movie fails on every party possible. One of the worst movies of the year.",
            "review_date": "2017-05-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "once again, this offering from the once gifted Marlon Wayans crumbles under the weight of its own stupidity. The guy that made stupid likable has lost his midas touch. now it looks like he is trying too hard to reclaim his former glory withonce again, this offering from the once gifted Marlon Wayans crumbles under the weight of its own stupidity. The guy that made stupid likable has lost his midas touch. now it looks like he is trying too hard to reclaim his former glory with this slapstick over the top humor. if you are laughing, you are not laughing at how brilliant or well thought the humor is. I would bet you a 1000 grand that you are laughing at how stupid Marlon's shenanigans seem to get with each movie he releases. if this is stupid level infinity, I fear for what depths his next movie will reach. we will not survive the flop from this guy. may god save us all. seems I did not say much about the movie and its because there is nothing to talk about. I would rather direct my criticism to the guy so he can wake the hell up! im done here. Peace!!",
            "review_date": "2016-04-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Is Fifty Shades of Black childish and obscene? Of course it is, but if you expected anything else from a fifty shades of grey parody then, really, I think you're at fault. The main problem with the film is that it cannot stand on it's ownIs Fifty Shades of Black childish and obscene? Of course it is, but if you expected anything else from a fifty shades of grey parody then, really, I think you're at fault. The main problem with the film is that it cannot stand on it's own ground - as in, you really need to watch fifty shades of grey first because the entire film is practically a rerun of that film just with jokes added in, and I feel like if you've not watched fifty shades of grey you won't get any of the humour in fifty shades of Black.\r However - should you spend money on this film? No. Wait until you can get it free as part of netflix or something. It's good to watch if it's free, but I felt a little ripped off having to spend money to watch it.",
            "review_date": "2016-09-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Should i call this as a movie, this is so boring and useless, this an awful parody!",
            "review_date": "2018-02-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's smart to make a dull parody of a soporific movie? No, it never will be, especially when the film tries to make people laugh with no good elements, nothing really stands to contribute with the plot and the scatological jokes only stagnateIt's smart to make a dull parody of a soporific movie? No, it never will be, especially when the film tries to make people laugh with no good elements, nothing really stands to contribute with the plot and the scatological jokes only stagnate the pace.It is clear at the end that this really awful movie only sin is to mock a story that was always bad.",
            "review_date": "2017-09-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "yeah this movie sucked but I like ebony porn so i gave it a 10/10.I needs to be 75 characters long **** my ass I needs to be 75 characters long **** my assI needs to be 75 characters long **** my assI needs to be 75 characters long **** myyeah this movie sucked but I like ebony porn so i gave it a 10/10.I needs to be 75 characters long **** my ass I needs to be 75 characters long **** my assI needs to be 75 characters long **** my assI needs to be 75 characters long **** my assI needs to be 75 characters long **** my assI needs to be 75 characters long **** my assI needs to be 75 characters long **** my assI needs to be 75 characters long **** my assI needs to be 75 characters long **** my assI needs to be 75 characters long **** my assI needs to be 75 characters long **** my assI needs to be 75 characters long **** my assI needs to be 75 characters long **** my assI needs to be 75 characters long **** my assI needs to be 75 characters long **** my assI needs to be 75 characters long **** my assI needs to be 75 characters long **** my assI needs to be 75 characters long **** my ass",
            "review_date": "2019-11-15",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "rt_rating": 1.9,
    "rt_summary": "In a spoof of \"Fifty Shades of Grey,\" Hannah Steele interviews entrepreneur Christian Black (Marlon Wayans) for her roommate's school newspaper. The wealthy and eligible Black quickly learns how clumsy the young woman is. As flirtation leads to attraction, Christian invites Hannah to his home and introduces her to his kinky world of S&M. Despite their different backgrounds, the new couple consistently surprise each other with how far they're willing to go to make their relationship work.",
    "meta_rating": 2.3,
    "meta_summary": "A parody of the popular film/novel 50 Shades of Grey."
}