{
    "title": "Meet the Blacks",
    "rating": 0.0,
    "release_date": "2016-04-01",
    "num_reviews": 172,
    "genres": [
        "Comedy",
        "Horror"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "Quite predictable, yet still funny-ish",
            "content": "After watching this film and seeing both sides of the argument. I was left (again) on the fence but a little bit to the good side. A pretty interesting purge parody movie, about a family moving to Beverly Hills during the purge and then getting ransacked.Obviously people will argue that this film is \"racist\", as per usual, and to some extent it kind of is, and obviously during the purge, everyone wants to kill them. But because its a comedy film, we should take everything as satire with a pinch of salt. From my point of view, its a funny comedy that made me laugh quite a lot, and i see no downside apart from the alleged \"racism\". This means, its not for everyone.But at the end of the day, my words to you are: If your easily offended, don't watch it. If your not, then why not give it a shot?",
            "review_date": "2016-08-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tired of people complaining about Parody's",
            "content": "At this point if you are still trying to break down a parody movie from every angle and inspect it then you are wasting your time. Parody movies are literally designed to not be a good movie. The only thing it's for is to make you laugh. Everyone knows this so why every time a new one is made people expect more? Honestly these type of movies are for people who like to laugh and usually don't care how it turns out. I understand some of you may feel if it's a theatrical release then it should be at least worth the money but it's very hard to please everyone when it comes to music and art and it has always come down to a preference thing. I am giving this a 10 out of 10 because it made me laugh the whole time and that's all these movies are made for. I expected nothing else from it and I got nothing else from it.There was no great story line or amazing actors just good Ole parody humor.",
            "review_date": "2016-04-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What!?",
            "content": "So Meet the blacks is a parody of film, the Purge. Most of the comedy that I'm seeing comes from the fact that they are giving the same message as the Purge only being a lot more up front about it. The Blacks stumbled upon some money and moved from the ghettos of Chi-Town to a luxurious space in Beverly Hills, where they thought they made it to a social status that made them immune form the annual purge, but of course when it begins, guess who all the purgers on the block come after. In all fairness, the neighborhood's dislike of the new family lowering their property value is the least of the Blacks' worries. It's works as a look on social commentary the same way the Purge did. It also works better if you think of it as a series of sketches on a comedy show. Not every sketch is good but I got some laughs from George Lopez who played president La Bama ( a Mexican parody of President Obama). The great Charlie Murphy who plays the gangster the blacks stole money from to movie to Beverly Hills, and Mike Tyson who does not need to try hard to be funny. Also like to give a shout out to the the gorgeous Latina they got to play Step-MILF Mrs. Black. From the moment she came on the screen her only job was to be eye candy and she did the job well and excelled. I'm taking the movie for what it is. It's not Scary movie it's Scary movie 5 (which also features Iron Mike). It's not going to win any awards or gain an critical acclaim, but it made me laugh. Job well done.",
            "review_date": "2016-05-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Don't Waste Your Time",
            "content": "I saw \"Meet The Blacks\", starring Mike Epps-The Hangover movies, Resident Evil:Extinction; Zulay Henao-If Loving You Is Wrong_tv, Takers; George Lopez-Spare Parts, Balls of Fury and Charlie Murphy-Are We There Yet?_tv, Night at the Museum.This is a parody of those Purge movies. You know the ones; they were about one day a year, any crime is legal for 12 hours. Mike plays a Chicagoan that comes into some money and decides to move his family out to Beverly Hills, thinking it will be safer among rich people. I know, it's a really thin plot device. The Purge is everywhere, right? Zulay, who is rather gorgeous in a Sofia Vergara way, plays Mike's wife. George plays the President, I think his name was something like El Bama- Hilarious, right? Charlie plays a guy from Chicago that follows Mike to get his hands on some of the money that Mike had come into. Most of the jokes are just dumb, unfunny or even stereotypical put downs of all types of races-they were equal opportunity insulters. There are a few cameos. I remember seeing Mike Tyson and Snoop Dogg. Overall, it's just not very good. It's rated \"R\" for language, violence, drug use and sexual content-no nudity-and has a running time of 1 hour & 30 minutes. I would not buy this on DVD. I would not rent it either. If you really think you want to see it, I would wait until it comes on cable.",
            "review_date": "2016-04-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very funny movie",
            "content": "The folks who think it is dumb, racist, chauvinistic, lots of overused clichés, are wrong in my opinion. It is a really fun movie to unwind after a hard days work, i recommend it truly, especially to age 16-35, older folks would smirk at it, but they love to watch films like Mission impossible or James Bond. This is great movie in all. Made me smile. Now, in saying that, having seen movies like the purge, resident evil, saw movies, meet the parents, walking dead, this movie indeed takes a lot from those , that's why this movie is semi- called a parody. Seems similar to scream 2, scream 3, pretty clever graphics for a crazy family horror comedy. Was at one point thinking it was set near sun, was filmed in a hot weather. In this age of politically correct movies and countless re-makes and dynasty franchise blockbusters this is a nice departure into the world of silliness and craziness , which is a lovely thing and we should rejoice about that fact.",
            "review_date": "2016-04-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awesome comedy",
            "content": "Meet The Blacks is a very funny comedy! I was a little pessimistic at first, I was afraid it would be too stereotypical but it had me in tears from beginning to end. It's a great parody of the movie The Purge (which I also loved by the way). The story: Carl Black moves his family to Beverly Hills thinking there's no annual purge there (a night where anybody can get away with murder); Shout out to Mike Epps, Lil Duval and Bresh Webb who are shining in this film! I did not really know Lil Duval but his role is hilarious! A lot of comedy legends are also appearing: Charlie Murphy, Paul Mooney...even Snoop Dogg is in it! Great job for a low-budget and independent film! I recommend anyone who wants a good laugh to go see it!",
            "review_date": "2016-04-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The annual dirge......",
            "content": "Every once in a while we have a movie that thinks its a comedy because we have a cast of characters being abhorrently racist to one another, because we all know, racism is hilarious!!! Especially when it's the same ethnicity doing it to one another....After obtaining a great deal of money, the patriarch of a black family decides they should move from Chicago to a posh neighbourhood in Beverly Hills. However, they are soon terrorised by home intruders who want them out of the affluent community.......Trying to be a spoof of The Purge movies, the film is one of the poorest films of the year, going back to the dark ages of British seventies sitcom by just throwing every racist joke and innuendo at the screen and hope that everyone gets a laugh, because it's self deprecating because we are doing it to one another.And it's totally rubbish, from the opening credits right until the promise of a sequel, nothing whatsoever raises more than eyebrows in disbelief.Epps plays your Atypical stereotype by shouting really loud, swearing every second, and saying a racial slur about every minute. Epps, you should be ashamed of yourself, this stuff was getting old when Bob Hoskins had a problem having Denzel Washingtons Heart in Heart Condition (and that's 26 years ago).Otherwise, it's just an incoherent mess, we have different people arrive into the house every five minutes trying to kill the titular family because the patriarch is nothing more than a poisonous thief, who has basically ripped off everyone he has ever met.And he's our protagonist!!When a film is struggling, they have to reference a topical film series, and with everything that is happening in the world at the minute, The Purge films are prime rib. So the one homage we have of the original Purge isn't effective, nor funny, and guess what, it ends with a racist slur!!!It's this sort of film that pulls cinema back ten years, Snoop Dogg should stay away from films. Yes, he was mildly diverting in Starsky & Hutch, but this is worse than Soul Plane.Avoid like the plague.It's racist filth and should never have seen the light of day.",
            "review_date": "2016-07-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolutely Horrid",
            "content": "The only reason I give this film two stars instead of one is the fact that the wife and daughter were nice to look at. There was a funny line where Carl says \"lt feels like we're in a horror movie!\" The story is rambling nonsense, acting is terrible and the jokes fall flat. The writing might be the worst I've ever encountered. In fact, it almost seemed like there was no writing, that the actors just made lines up as they went along in every scene. Almost like improv gone bad.The white villains express their racism with the most ridiculous comments. Yes, that's right, ridiculous even by racist standards. References to \"Willis\" from Diff'rent Strokes, New Balance tennis shoes. Ugh.",
            "review_date": "2016-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "You got pieces of ear in your teeth",
            "content": "Carl Black (Mike Epps) absconds with drug money as he takes his family to lie low in a gated community in Beverly Hills. Being a dead beat, Carl has a lot of people looking for him leaving behind including baby mommas. On the night of \"The Purge\" they all come looking for him, even the clown ( Mike Tyson) he stiffed from his kid's birthday party.This is a spoof of \"The Purge\" and perhaps needed a better title. The bulk of the humor is racial and inter-racial as we contrast red bones vs. black people. I would suppose the African-American community will enjoy this comedy more than I did. While the film had its moments, the humor grew old with all the accidental and misdirected deaths.Guide: F-word. No sex or nudity. Zulay Henao in swimsuit for eye candy.",
            "review_date": "2017-11-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hideous movie",
            "content": "Not funny, not a parody, a lot of shouting, shooting and not even a good parody of The Purge, the message is hammered home, they even threaten at the end to make Meet the Blacks 2, hopefully that project never sees the light of day.",
            "review_date": "2018-08-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Half-Baked \"Purge\" Parody",
            "content": "Freshman scenarist Nicole DeMasi and \"Supremacy\" director Deon Taylor do an adequate job of sending up the vigilante franchise of \"The Purge\" movies with their parody \"Meet the Blacks,\" starring Mike Epps, Mike Tyson, and George Lopez. Mike Epps plays Carl Black, a wiring installation expert from Chicago, who steals an African-American gangsta's cash and stash and then moves his family out to live in a mansion in Beverly Hills. Clearly, Demasi and Taylor must have been thinking of vintage CBS-TV series \"The Beverly Hillbillies\" when they came up with his adaptation. It seems that Carl was in a gangsta's house when the police raided and arrested Key Flo (Charlie Murphy of \"Norbit\") and he got away not only undetected but also with Flo's dough. Initially, the black security guard refuses to let Carl drive onto the premises, but he relents when Carl threatens him. Carl has moved to Los Angeles with his new Latino wife Lorena (Zulay Henao of \"Takers\"), his teenage daughter Allie (Bresha Webb of \"Ride Along 2\"), his son Carl Junior (Alex Henderson of \"Creed\"), and former prison inmate Cronut (Li Duval of \"Scary Movie 5\"). What none of Carl's family know is that Carl stole the cash from Key Flo. Furthermore, just about everybody that Carl cheated in Chicago has migrated to Los Angeles to exact what he owes them. The punchline of \"Meet the Blacks\" is Carl gets off scot-free because when they break into his mansion, they do it on Purge night. Mind you, Carl has no idea what The Purge is all about despite what he learns from his family so he believes that he is safely tucked away in Beverly Hills and nobody will find him. Mike Epps is at his hilarious best as Carl Black, but legendary heavyweight boxer Mike Tyson looks and sounds like a buffoon. This lowest common denominator comedy has a few laughs, and you can count them on one hand. Nevertheless, the set-up and the execution is adequately done. The Nicole DeMasi & Deon Taylor screenplay will keep you smiling with its clichés about African-Americans in Beverly Hills and traditional slang-riddled dialogue. George Lopez has a clever cameo as a Hispanic U.S. President with the punny name El Bama. Of course, \"Meet the Blacks\" could have been far funnier, but it isn't too embarrassing as knock-offs go.",
            "review_date": "2016-08-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The biggest problems with this movie were the over used cliché racist jokes & actors didn't look like the wanted to be in it",
            "content": "\"Rich people don't purge.\" Carl Black (Epps) has finally found a way out of Chicago and his dangerous neighborhood. He and him family movie into a huge mansion in a gated community in Beverly Hills. They are just settling in when the thing they most feared arrives. The Purge exists in the richest city in the country, and they are the only black family around. Things can only go bad. This is a strange movie. This is not really a spoof in the usual sense. This is really more of a remake of The Purge movie done as a comedy instead of a horror. Unlike the Scary Movie series it doesn't take from all other movies. There are some funny parts in this but it did seem to drag a little. The two biggest problems with this movie however were the over used cliché racist jokes. We get it, your black so even when crime is illegal you will get caught...very funny. The biggest problem with the movie though is that the actors didn't look like the wanted to be in this. That really hurt the comedy due to the fact that you almost felt sorry for them. Overall, Some people will enjoy this but as for me the movie was only funny in some parts, and only because I saw the original Purge. I give this a C.",
            "review_date": "2016-06-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Really, skip it, very very bad !",
            "content": "This movie stinks. I didin't even make it past the 20 min. mark. Therefore 1/10. A score of 6.1 is totally absurd but that's because there are not enough \"independent\" reviews.\nAbout the content of the movie a lot is already said. Bad acting, bad stereotypes, jokes that aren't funny at all 'cause the writers & producers can't grasp the concept of irony & sarcasm, it's just childish profanity, the camera work is cheap and shaky,... To keep it short, this is not even a B-movie, just low budget rubbish with a quasi stolen title, hoping to squeeze some money out of people with the premise they promise in the description.",
            "review_date": "2018-09-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not a single laugh....Not a single funny line... AVOID at all costs",
            "content": "Other than the paid reviews giving it 9 or 10, the actual rating of this movie should be anywhere between 0 and 1 (out of 10 course). If you like people screaming and swearing and not a word that can be classified as remotely funny, then this movie is for you. Not worth even watching on rental. Overacting and crappy script coupled with equally terrible acting from every single actor...boy o boy this was one horrible movie....AVOID AT ALL COSTS",
            "review_date": "2018-08-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "So bad it's pitiful",
            "content": "This is what you get when the movie is made by people who consider confusing editing a substitute for writing, and allusions to racism and rape-comedy. It's not even a tolerable slasher or \"so bad it's good\" thing. It doesn't step into surreal and seems to play it all seriously at points, which is simply disturbing.",
            "review_date": "2018-08-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The opposite of real life, The Movie!",
            "content": "Have you ever seen a movie that represents reality poorly? Ah, well. It is a comedy, right?I like Mike Epps, but this film might as well have been a cartoon. There were a few short laughs; The biggest laugh by far was Mike Tyson's brief role. He had me rolling. The rest of the comedy was based on \"stuck in the 1930's\" style racist humor.White people are represented as universally villainous and overtly racist; Which is supposed to be a joke, but the lines just seem so unnatural that there is no way it could sound authentic. Its like someone went through the film in post production and tried to ad-lib some racist white people from books written a century ago.I was mostly disappointed in the comedy, bored by the action, and even a great scene with Charlie Murphy couldn't raise the bar on this film. The kids were annoying, the family was deranged, and Mike Epps himself seems too old for the sh*t-head gangsta roles he always seems to get. Casually dropping the N-bomb while looking disinterested and lanky was his main appeal in most films and I think the amusement of that character has run it's course.Mike, you can play roles where the character has an IQ over 70, I promise! Err...I assume you can.",
            "review_date": "2016-07-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ghetto Moves to Beverly Hills",
            "content": "Ah, Beverly Hills. Everyone likes a good movie straight out of the most expensive zip code in the world. This movie follows in the lines of those movies. Many are bad, some are good. It's just the way these movies about the rich and poor usually work.Meet the Blacks is about a man from the ghettos of Chicago who steals drug money after an arrest of its owner. He picks up and moves his family to the Hills. Little do they know that an annual purge is happening on that day. Now, the family must not only defend themselves from the gangsters out to retrieve their money, but also from their rich well to do neighbors.Mike Epps is a really funny guy, in contexts. Here he does an average job of amusing the audience, but it's darn sure he knows how to take the lead place in a film. Everything seems to surround him, and it also gives me the feeling of the \"Friday\" character all grown up and independent from his uncle. The family aspects are there, but do not seem to shine as much as the purge plot. I wish this movie had more normal interactions with the neighbors, so we could see the difference between the rich and poor, and Epps could use his humor in that context. All in all, it was a pretty bad movie.The movie relies a lot on horror. It gets dark really quickly, and we are left there wanting to bring the humor back. It doesn't come back.2 stars",
            "review_date": "2019-12-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just a awful film all the way around - One of the least funny movies you'll watch all year. Watch something else unless you want to waste over and hour of your life!",
            "content": "Mike epps... with this movie he has proved proved he officially needs acting and comedy lessons. His acting is atrocious his ability to execute or tell jokes is practically none existent. Th \"movie\" itself is just a waste of time at best , its boring , its NOT funny at all terrible writing , bad casting , some of the worst acting and the attempts of comedy relief are painfully bad! Its one of the worst movies I've watched all year hands down and honestly its probably one of the worst films I've ever watched...... I wish i could say something good about this i really do , But calling this a comedy is a reach let alone a movie , its sad that anyone would let themselves be part of something they have to know is just a waste of every ones time and trash from the beginning. Money means more then quality , standards , being good at what you do and or love , integrity and especially more then helping others or making other happy... quite sad from any perspective or position in life. i'm only in my 20s and i realize the importance of those qualities and how that if even 1 in 5 people practiced that in there own life and simply learned to be passionate , do the best you can in every situation , have integrity, care for others , and hold ourselves to a higher standard. With that little effort this world would be as amazing as it is beautiful an vast! Imagine...Thats My Review - Take Care Everyone & God Bless ,I Hope We ALL Find Happiness in not only our personal lives but as a whole!Thats a Dream we can all embrace.",
            "review_date": "2016-07-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Utter drivel",
            "content": "I can't believe I wasted my time on this. 90 odd minutes of my life that I will never get back. Stick with the first purge movie, not this toss.",
            "review_date": "2018-10-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Avoid",
            "content": "Not funny at all, had to stop watching this cause it was so bad. Skip it",
            "review_date": "2018-08-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "No.",
            "content": "How hard can you go in on a parody and not have it be a parody anymore? This hard, parodies should work on the rule of \"hey, we're here to poke fun at the plot holes, but still have a sense of structure, and comedic insight.\", this movie had no idea of what it was and why it was doing it. Tryhard humor is probably the clearest reason. How tryhard? White guy with an, I'm not racist, but I'm super racist complex. That's pretty much the rest of the neighborhood actually... Anyways, other than Jackass 3 and The Human Centipede, I have never fought off the urge to vomit as hard, and that's saying something about a movie that doesn't rely on the shock value of fecal matter.",
            "review_date": "2021-09-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "not funny",
            "content": "I smirked a few times. I don't think i laughed once. I quit after an hour (1 viewing, 8/27/2021)",
            "review_date": "2021-08-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Come to expect",
            "content": "This film is a parody of the Purge films where its played for laughs as a comedy. We know what to expect from these type of films. Starring Mike Epps in a role which he has always played, the typical fast talking, overly loud yet often times laid back. The film isn't too funny and the jokes are predictable. Meet the Blacks is in the same realm as the Haunted House films with Marlon Wayans (those are better).",
            "review_date": "2022-06-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst movie I have ever seen",
            "content": "The whole movie feels like someone wrote a script and decided to turn it into a movie before proof reading it. A piece of incoherent trash.",
            "review_date": "2020-04-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Meet the Blacks\" is a semi-humorous, half-way decent parody.",
            "content": "Just since the beginning of this century, filmmakers have asked us to meet the Parents, the Fockers, the Spartans, the Robinsons, the Browns, the Patels, and, every Sunday morning on network TV\u0085 the Press. Personally, I have taken part in most of those \"meets\" – and generally enjoyed them, to varying degrees. Next, we are encouraged to \"Meet the Blacks\" (R, 1:30). Like most of those other examples, this meeting is intended to be comedic in nature and, like the example of \"Meet the Spartans\" (2008), this meeting is a parody of an earlier cinematic encounter. You see, \"Meet the Browns\" is also known as \"The Black Purge\". You can think of the movie this way: What if the 2013 film \"The Purge\" were re-staged with a black family? We're talking the first of the Purge movies – as in taking place in an upscale neighborhood, but where a single family of color lives. Get the picture? The next question is, will you \"get\" the movie? Carl Black (Mike Epps) has suddenly, uh\u0085 come into some money. He (VERY) quickly moves his family from Chicago to a mansion in Beverly Hills. His new wife, Lorena (Zulay Henao, a Columbian actress, playing a sexy Mexican woman and looking like a younger, less-Latina Sofia Vergara), his self-centered teenage daughter, Allie (Bresha Webb), his nerdy young son, Carl Jr. (Alex Henderson) and Carl's ex-con, sex-obsessed cousin Cronut (Lil Duvall) are enjoying their new home – and wondering how and why they ended up here. Lorena is struggling to get Carl's kids to accept her as part of the family, Carl Jr. keeps to himself wearing a vampire costume and sending his remote-controlled toys around the house from a secret hideaway in his closet, Allie is secretly meeting with her boyfriend, Freezee (Andrew Bachelor), who rode a bus from Chicago to surprise her, and Cronut is busy \"fixing\" Carl's new SUV, sexually harassing Lorena and breaking into Carl's safe, helping himself to Carl's secret stash of cash and weed. Carl gets the family out of the house to walk down their street and meet some of their new neighbors (including Phil Austin, Kate Enggren and Perez Hilton), but Carl's timing leaves something to be desired.The Blacks have moved into their new mansion just in time for the annual national Purge – a night of terror during which citizens are free to release aggression, right wrongs and get rid of \"undesirables\". All crime is legal for 12 hours – including murder. Even as President El Bama (George Lopez) announces the beginning of the Purge in a televised address to the nation, Carl assures his family that people don't purge in nice neighborhoods like theirs. He's trippin'. Just as in the film \"The Purge\", even rich people aren't safe from others who are purging, and the family home is soon invaded by criminals, masked strangers and even their own neighbors. But remember, \"Meet the Blacks\" is a parody of that film\u0085 focused on a black family in an otherwise white neighborhood – and Snoop Dogg is involved in the production. So, instead of a family having to fend off jealous neighbors and other anonymous purgers, the Blacks have to contend with people like a drug dealer, a creditor (Mike Tyson), a repo man, a process server, an unhappy president of the homeowner's association and some racist neighbors.\"Meet the Blacks\" is a semi-humorous, half-way decent parody. The mixture of the plot from \"The Purge\" and the fish-out-of-water / racially-oriented comedy is full of possibilities, but not very successfully exploited by up-and-coming director Deon Taylor and the writing team of Mr. Taylor and Nicole DeMasi. What is exploited are racial stereotypes of several different kinds and common racial epithets. If you're not offended by those kinds of terms or sources of humor, you may well enjoy this film. Personally, I found it sometimes funny, sometimes offensive and mostly just mildly amusing. \"C+\"",
            "review_date": "2016-04-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hella stupid!",
            "content": "Don't take it too seriously...it's just a bit of fun!Non-stop nonsense with the same budget as one week's grocery shopping!Mike Epps' one-liners are hilarious though!The trailer for the upcoming sequel looks promising.",
            "review_date": "2021-05-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's funny. It's average.",
            "content": "It has good actors, a good budget, and is funny throughout.It's good entertainment, it doesn't deserve a 2.6 IMDb rating which it has at the time of this review. It deserves about a 6 at least.It's not a hilarious movie at all, but it would be funny to average movie goer. If you like funny movies and merely want to be entertained, it should give you plenty of that. If you are a film critic, you're going to cringe as you watch this movie. That's because film critics are totally different than average movie goers.",
            "review_date": "2016-05-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just a basic racist parody.... AGAIN",
            "content": "The plot of the movie was the same as \"The Purge\" movies (because it was inspired by them). The characters were ok, the location was basic. The kills were fine, for an R-rated parody film. In my opinion, most parody movies use many racist jokes, whick is so annoying and not good. I understand, that parody movies satire the events of the real world, in a comedic way, but the execution isn't successfully done. Anyway, of course some jokes were funny, but there weren't many joke to laugh for. By the way, I don't think that movie deserved a sequel (because I think they have already released a second film).",
            "review_date": "2021-09-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awful movie",
            "content": "Awful acting, awful jokes and some of the parts you can even dare to say: do it the other way around and you'll see the backlash.\nAvoid this at all costs.",
            "review_date": "2020-04-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's not a 1 or 2",
            "content": "Ya it's but the best comedy, but it's a funny movie with plenty of laughs. If you have watched the Friday movies, or really anything else Mike epps has been in and enjoyed then you'll like this.",
            "review_date": "2021-07-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awkward and unfunny",
            "content": "Didn't have any real laughs. The build-up to the purge was kinda ok, though it had many forced jokes already. Once the purge started it got really messy and ridiculous. I really started to lose my attention from there on. The movie hasn't ended yet, but I had to come spill my guts here. I like parodies, but this isn't a good one, no sir.",
            "review_date": "2018-10-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Some funny scenes and quotes...that's as far as it goes",
            "content": "So...as I say in the title..the movie has a couple of funny scenes and a couple of funny quotes (probably the funniest one being the dialogue with Mike Tyson), but this is as far as this comedy / parody goes..not a waste of time...but not a masterpiece of its kind either...something pretty descent to watch when you are on a plane and have nothing better to watch or read..certainly not worthy of a 6!",
            "review_date": "2019-07-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Crap",
            "content": "Mike Epps is no Samuel L. Jackson. He needs to fire his agent and manager. The movies he is in are complete trash. I know he misses the days with Ice Cube, where the movies made money. He's just coming off as desperate these days.",
            "review_date": "2021-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This is for... a special kind of humor.",
            "content": "Okay listen for a minute. This movie is absolutely hilarious, but you do have to a certain type of humor as well. The movie contains a lot, like a lot of profanity, which makes it soooooo much funnier. Give it a try, and if you dont like it the first 10 minutes you will hate the rest, trust me. Personally, have i never laughed this much in my entire life. 11/10.",
            "review_date": "2018-11-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fun Purging",
            "content": "No scary movies anymore? Sound fine, but I reckon we get this instead. And while it does have to say something about racism in America (yes still a thing), it also gets repetitive and sort of boring in its attempts to make fun of the Purge series. The Purge is now so over the top, it should be easy to make fun of it.Way easier than what we see here and while there are some fun ideas thrown at you, not many stick (pun intended). There are a lot of guest appearances, one in particular by Charlie Murphy, that might be uncomfortable for some to watch, considering the fact he recently passed away. But those feelings aside, it does not really have the quality to entertain fully as it could",
            "review_date": "2017-06-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "LOL (Not )",
            "content": "This is the worse film that I have watched this year, I hate giving a bad review, but it's rubbish.",
            "review_date": "2018-10-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I Thought It Was OK",
            "content": "I rate it a 6/10 because it was an OK movie it wasn't bad and it wasn't too good but it is a good re-watch for me i give it that the only parts i didn't like it the movie were like when they didn't say that many funny jokes i only laughed like 3 times thru the whole movie and that's unusual for me but everything good in the movie was that it lives up to the name and it lived up to a way the purge was but there wasn't much bad or good but i do think it was OK i would say buy it just don't buy the blu-ray it ain't that worth it unless it goes down a little bit but all and all its and OK movie i think that if you watch it you will watch it again.",
            "review_date": "2016-08-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "How did no one go to court?",
            "content": "Directed by Deon Taylor, who wrote this with Nicole DeMasi, Meet the Blacks finds that family -- led by Carl (Mike Epps) -- getting out of Chicago after stealing some money from drug kingpin Key Flo (Charlie Murphy in his last role). Once settling in Beverly Hills, Mike and his wife Lorena (Zulay Henao) and kids Allie Black (Bresha Webb) and Carl Jr. (Alex Henderson) discover that they ended up in town at the absolute worst time. Yes, they're here on the day of The Purge.The best joke is that George Lopez is President El Bama, but hey, Paul Mooney is also a Klan member, plus Mike Tyson, Tyrin Turner and Perez Hilton are in this too. It's not exactly great, but the fact that this movie just outright uses The Purge is pretty audacious. If the racial issues of the first few movies were too under the surface for you -- they are not -- this movie goes all out.Not to be outdone, Taylor and most of the cast returned for The House Next Door: Meet the Blacks 2, which is literally Fright Night with Katt Williams as a pimp version of Jerry Dandrige. Maybe this was the movie that Herschell Walker was really watching?",
            "review_date": "2022-12-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "No jokes",
            "content": "I barely laughed. I barely succeeded to sketch a smile. Mike Epps tries to be goofy, but he doesn't make it in the end and the rest of the characters are there just to fill the gaps. I think the movie had to only focus on one genre and not to be both a creepy-drama and a comedy. All the things got messed up and it resulted more in an unsatisfied & unhappy audience. At least these are the feelings that this movie left me.",
            "review_date": "2017-09-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Terrible waste of time",
            "content": "I'm a huge fan of comedies especially parodies. When there done right the laughs can last an eternity. It's movies like these that\nare rushed with a bad script that ruin other parody films.",
            "review_date": "2019-09-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Meet the Blacks",
            "content": "A funny comedy I laughed and enjoyed myself. The cast was awesome, 7/10 it's not meant to be serious. Just a silly comedy that I liked and will watch again.",
            "review_date": "2022-01-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Money is the root of all evil!",
            "content": "All evil stems from money. Carl Black started it all when he stole Key Flo's money and pot stash on the day his house was raided and he was detained. He took the money and improved his life by moving to Beverly Hills, buying a new car, and neglecting his piling up debt in his hometown of Chicago, unaware that vengeance would be exacted. Carl's adversaries resolved to attack him and his family on the night of the purge in retaliation for the devastation he had caused. This movie was funny, but could have been better.",
            "review_date": "2022-05-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Low budget spoof - Enjoyed it",
            "content": "Wife & I started two movies within a short time each was turned off, this was the 3rd try on a cold winter evening. It held our attention to complete it start to finish.I am unsure what all the negative comments are about? No it's not Eddie Murphy but it still had some humor in our opinion. No, I doubt we will watch it again but the same holds true for game of thrones.Just seemed like a low budget spoof on everything, seems like everything was attacked or mocked in some fashion.Watch it while cooking dinner or for a minor background distraction if you want depth this is not going to be it.",
            "review_date": "2022-02-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What a waste",
            "content": "Well folks, I just wasted two hours of my time and the money to rent this stupid movie. Actually thought it would be funny based on a friend's recommendation. It started out okay, but just gets to be all the more lame and dull with non-believable action the entire way through. I kept waiting for it to get better, only wanting to get my money's-worth; yet just wasted time. Bad acting, bad plot, non-adventurous, and just plane lame. It's been a long time since I gave a movie a 1/10. Obviously I'm not the only one if the average rating is 3/10. Wish I'd done more research. Do yourself a favor and steer clear of this garbage.",
            "review_date": "2016-12-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Predictable but good",
            "content": "I liked this comedy make of The Purge and thought that it seemed more realistic than the purge due to how some of the characters acted. I also thought that this was really repetitive however which did take away from the movie for me and I wish they showed more of the background of the Blacks and why they were being hunted but an easy watch.",
            "review_date": "2018-08-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very entertaining!",
            "content": "Looks, 1st of all its already a parody, so its not supposed to be academy award material, but Mike Epps carries the movie to the end, I had a couple of good laughs, worth seeing.",
            "review_date": "2021-06-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Full of xenophobic and racist remarks apparently to be a comic parody.",
            "content": "Meet the Blacks\" is a horror comedy that spoofs the \"Purge\" movies. A wealthy African-American family moves into an upscale neighborhood in Beverly Hills and instantly are subjected to racial discrimination. The director lampoons this concept and has the purgers be people the protagonist owes money to. Though I found the film sporadically funny, I thought it wasn't really trying at all and instead tried to see how hard it could spoof \"Scary Movie.\" The humor is scatological and is embedded in puerile, inane humor that is so dumb and pointless it actually becomes somewhat funny. The script is laughable at best and features some of the cheesiest lines I've seen. It does everything that a horror comedy is supposed to do except have believable acting, realistic humor, and a halfway decent plot.Source: http://www.huludb.com/movies/1562977-meet-the-blacks",
            "review_date": "2016-04-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Actually funny",
            "content": "This was actually pretty funny. One of Epps best movies for sure. It's supposed to be funny and corny y'all... Lil Duval could have been replaced by someone else though. He didn't do the best job.",
            "review_date": "2022-05-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Waste of time",
            "content": "The movie doesn't deserve your time.\nIt is not a comedy or horror, it is just silly.",
            "review_date": "2019-06-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Well then....",
            "content": "Alright! So, my husband and I watched this movie because the trailer looked stupid. But I figured we've watched some dumb comedies before, what's the worst that could happen. Yikes! This movie.....it had moments when I was like this isn't that bad then 2 seconds later I'm like \"scratch that\". But the strange thing was I couldn't stop it. I felt the need to finish it even though there were times that I thought \"I'm never going to get this hour and a half back\". Ready for the real kicker in the end it says \"to be continued...\" and I actually feel like I'm going to watch it. This is why I'd say it's a 5 because it wasn't so bad I wanted to rip my eyes out and ears off but it wasn't something that had me laughing so hard I was crying.",
            "review_date": "2019-01-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "content": "It just bad... A visible lack of effort from the creators.",
            "review_date": "2023-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "meet the blacks its pretty bad but its very funny film and its very funny but the rest of it is pretty good kinda i guess nothing very memory of this movie.the characters are great,all them have there moments and the purge part is really funny actually i don't like the first purge really i think this the discount version but this is pretty fun funny horror movie but this is a 6/10 its a to much a special number for that and the acting is really wired but its fine.this movie is 6/10 but will not watch again just saying maybe but yeah and do not watch that second one and this would have been better ig it was a family arug movie btu its a purge and its not all that.",
            "review_date": "2022-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolute must watch for stoners, good storyline and hella funny I don't give 5 Stars to many comedies and this one definitely deserves it.",
            "review_date": "2021-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good god. Movie is watchable but idk who keeps giving Mike Epps money to make movie. Shit is an unorganized mess. Random music playing, random sounds effects, random nonsense one liners. I first saw the trailer on Netflix years back and skipped it because I thought it was dumb, when I saw part 2 coming out decided to watch it to see may be it was good. It was not. Definitely not my cup of tea but if you like Mike Epps flavor of comedy then knock yourself out.",
            "review_date": "2021-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mike Epps and Lil Duval... a perfect combo for this film. Hilarious!",
            "review_date": "2021-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mike Epps was hilarious, Lil Duval was hilarious, Mike Tyson made a cameo and was hilarious. One big fun parody film for the family! (adults only)",
            "review_date": "2021-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Damn funny. Mike Epps and Lil Duval make a hilarious duo, you can tell they improvised a lot of the dialogue, had me ROTFL",
            "review_date": "2021-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "HILARIOUS! I never heard of this movie until a few months ago but OMG was it FUNNY! Really enjoyed how many comedians made an appearance. FUN movie was raunchy fun all the way!",
            "review_date": "2021-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": " A funny way to show how stupid the purge universe really is. This parody takes something stupid like the purge and makes it more likeable.",
            "review_date": "2020-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's surprisingly a lot more entertaining than I expected but I don't feel it's worth a re-watch.",
            "review_date": "2019-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was funny enough.  I enjoyed the movies like this from the '90s.  It reminds me of that a little which I enjoyed.",
            "review_date": "2019-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The black girl has so annoying voice!\n \n",
            "review_date": "2019-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ugly, boring, and incompetent in every way it's possible to be incompetent, Meet the Blacks is the kind of bad that can't even muster the strength to be unintentionally funny.",
            "review_date": "2019-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing that special.",
            "review_date": "2019-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Five minutes in. Garbage. Just more  black social commentary disguised as bad humor to teach all of us about popular/unpopular black stereotypes and ebonic slang, while implying that the rest of us are generically racist.\n\n\n\nI was almost afraid to watch the movie, because it had the word 'Black' in it and I did not want anyone to think I was misappropriating that word. \n\n\n\nKeep in mind, that this kind of sarcastic obscenity filled prattle is what I hear around me all of the time now, in public and it is only getting worse. \n\n\n\nSo, my recommendation, just to be safe and not hurt anyone's feelings, that might feel the need to throw a victim card, is that this movie sweep all Oscar categories.",
            "review_date": "2019-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Meet the Blacks\" was a very awesome movie with outstanding actors, such as George Lopez, Mike Tyson, Snoop Dog, and Lil Dival. This movie had excellent character development and beautiful cinematography. However, this movie suffers from a sleepy second act.",
            "review_date": "2018-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "funny all through the movie.",
            "review_date": "2018-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "lol mike tyson was funny",
            "review_date": "2018-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Meet the Blacks is a self-deprecating trip.",
            "review_date": "2018-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There was one or two decent laughs, and that was basically that.  Should the cameo of Mike Tyson really be the most memorable part of a movie (better acting than the main cast may I add)?  Very weak movie.",
            "review_date": "2018-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We now have something that has broadened the scale.  This is further over than Bernard Manning in the seventies.",
            "review_date": "2018-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cheesy, nonsense take on the purge, as if they threw people together and made no sense as in most parts just offensive and cringe worthy.\n Ok for a cheap take on the purge, but your time would be better spent on the real purge films. We was looking for a giggle .. not even close!",
            "review_date": "2018-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is thoroughly lazy and dumb, but there a handful of chuckle-worthy bits. Worth a look if you’re a fan of horror spoofs.",
            "review_date": "2018-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not funny, not scary and completely racist. I wanted to quit watching 2 min. into the movie, but I tried to see if it would get better. The worst movie I have ever seen! I have watched for richer or poorer, that was better! I'd rather watch butt hairs grow on Rosie O'Donnell's gross ass!",
            "review_date": "2018-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe I'm senile in my old age by now but this was hilarious!",
            "review_date": "2017-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes, the Family's last name is Black and they're Black'; how original and hilarious. What this movie does is portray African Americans as unintelligent and dumb-witted; also enhancing the already offensive cliches and stereotypes the World has of their Culture in a very unfunny way. \n\nI generally don't waste my time typing my opinions on internet Forums but I felt compelled to make an exception specifically for this movie. There are millions of starving and homeless people in World, yet somehow terrible movies like this still receive more funding than they deserved.",
            "review_date": "2017-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don\u0092t quite understand what I watched.",
            "review_date": "2017-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious movie, once again proving that movie critics are idiots.",
            "review_date": "2017-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny nothing more and maybe a little less than you expect.",
            "review_date": "2017-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only one or two funny jokes in the whole movie very unenjoyable",
            "review_date": "2017-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn't even make it ten minutes in. Absolutely awful.",
            "review_date": "2017-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lil Duval and Mike Epps chemistry worked really well.  Everything else; not so much lol gotta be on a lot of drugs to appreciate this movie as actual cinema.",
            "review_date": "2017-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was really looking forward to watching this as I'm a fan of the Purge films but this spoof comedy is a complete disappointment. Everything about it is not funny including the plot to the script which are the basis of a movie. It's sad to say I couldn't even finish it.",
            "review_date": "2017-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A parody of \"The Purge,\" if you can call it that considering parodies are supposed to be funny, \"Meet the Blacks\" is a flub.",
            "review_date": "2017-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie sucks. It wasn't a comedy or a horror,nobody got scared in the movie,because it waning scary.The jokes were terrible and nobody laughed throughout the whole movie. I would give this movie 0 stars if I could.",
            "review_date": "2017-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This wasn't as good as it should have been.  The two female characters  were my favorite in the movie.  The rest of the cast was weak and I didn't think the writing was that funny.  The two female leads were hot though!",
            "review_date": "2017-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its awesome its funny its just over all a great film! and the actors should keep doing what there doing! (:",
            "review_date": "2017-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never laughed never chuckled never got excited never had hope but pretty cool masks that's where the 1 star comes from ain't buying",
            "review_date": "2017-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible... Just terrible... Whatever you do, don't release a sequal!",
            "review_date": "2017-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A serious comedy about The Purge where a family must fend off various Purgers invading their home and belongs in the franchise despite the tired, old, one-dimensional obsession of racial jokes that plagues nearly every show/movie that contains a Black majority cast. A humorous take on The Purge.",
            "review_date": "2017-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must see film of the year",
            "review_date": "2017-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "0 out of 10:\n\nRacist, unfunny, and stupidity makes this parody of The Purge, which I say is one of the worst movies I've ever seen, worse than the actual dang movie. Also, spoiler warning, not that it matters, the to be continued at the end is never going to happen thanks to this crap fest of a movie.",
            "review_date": "2016-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "funnyist movie in the world",
            "review_date": "2016-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly, the funniest movie I have seen in a long time.",
            "review_date": "2016-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kind of hard to believe this got made.  So this is a universe where the purge exists, one night a year where all crime becomes legal for a 12-hour period.  A father (Mike Epps) moves his family out of Chicago to a gated community in Beverly Hills in the hopes of raising the chances of overall safety.  The one thing he didn't consider was the fact that these mansion owners are even more blood hungry than the people in the Chicago suburbs.  Now I actually like this idea on paper; the modern horror parody nowadays is so jam packed with references that it actually is kind of refreshing to get something contained, even if it is for something as niche as The Purge.  It even has a bit of social commentary, but it isn't long before it crosses that line of offensive too many times to get a pass.  I like Mike Epps as an actor; he's got a certain bit of charm in his performances, even though he never landed himself a role that pushed him to true leading man status.  He also knows how to improvise, and while this movie suffers when it is being obtuse and racially offensive, it does work with offhanded comments that you can tell was made up on the spot.  I did get some laughs out of this, and they almost all came from mutterings dished out underneath the breath of Mike Epps.  It is kind of bizarre to see this, just because I don't know who out there would have thought that this was a good idea.  There just isn't a demand for it, and I am surprised that anybody ended up seeing this at all, which is probably why it popped up on Netflix streaming so quickly.  This isn't the bottom of the barrel, but it certainly isn't good.  It's actually way funnier at the beginning when it does play in the humor that is based on stereotypes.  Meet the Blacks does nothing but lose steam as it goes on, and it really gets bad when it just turns into the movie that it's parodying.  I don't know how much you remember about the 2013 film, but it has some truly awful lighting; you can hardly get scared because you can't tell what is going on.  The same can be said with Meet the Blacks, except there are cynical jokes thrown into the mix.  Add in some pretty random C-list cameos and you have a movie that flounders more than entertains.",
            "review_date": "2016-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Look, I know I've said this before, and will continue to say this as long as spoof films are being made, but this genre has been dead since the 90s after the last Naked Gun movie was released.  But I'm not even talking about the Naked Gun types, that made fun of old school cop show tropes and cliches.  I'm talking about the more specific type of spoofs, where they go after a specific movie or various movies.  I don't think there has been a spoof of this type in YEARS that has actually been good.  I guess you could say Black Dynamite is the only one, but again, that spoofs the blaxploitation film genre as a whole and not a specific movie.  To me, the best spoofs work because there's a level of respect for the material that you are poking fun at.  Like, as I just mentioned, Black Dynamite or Young Frankenstein.  Both of those films, while poking fun at the silliness of their chosen target to spoof, are also very much loving tributes to the films that inspired them to make the spoof in the first place.  And I think that's definitely something to that that needs to be said.  The best spoofs are those that make fun, but also find a way to show their love and appreciation.  I think that's part of why I find the Seltzer/Friedberg spoofs (Epic Movie, Date Movie, Meet the Spartans) are some of the worst spoofs in existence.  Hell, they're not just the worst spoofs in existence, they're some of the worst movies I have ever seen.  The point of those flicks is to be as dumb as humanly possible without actually putting in any effort into actual decent comedy.  Which brings us to Meet the Blacks.  I can honestly understand the way that this movie approached its parodying of the Purge film series.  Unlike Young Frankenstein or even Black Dynamite, the fact of the matter is that the Purge aren't classic movies.  The first one wasn't that good to begin with, but the last two were actually fun genre movies.  So I can understand the film not being a loving tribute to the Purge movies, because those movie just aren't classics.  Particularly not so close to the film actually being released.  But, honestly, this is a terrible movie no matter how you look at it.  When the best thing about it is how great Zulay Henao looks, then you know that the movie doesn't offer much in the way of quality.  Don't get me wrong, though, there's some good ideas here.  I like the fact that everyone that Carl fucked over before he left Chicago is now attempting to purge him.  From his ex, to people he owes money to, to the president of the Home Owners' Association that sold him the house without knowing that he was a black man, yes, to the drug dealer that he stole money and weed from, even the KKK shows up.  Fucking everybody comes after Carl and I liked that concept.  I liked the concept because it pretty much allows the movie to throw just about everything they can out there, no matter how ridiculous or absurd.  So I applaud the film's attempts at absurdity, to keep things from ever getting too stale.  The problems the film has certainly aren't related to the fact that it's a dull movie.  It's anything but.  The problems come in the fact that the jokes in the movie are just no fucking good whatsoever.  The jokes are so fucking bad.  Not to say there aren't some scenes that made me chuckle, but, by and large, 8 out of 10 jokes are misses.  And the 2 that are hits aren't even that good anyway.  Part of the problem is the fact that Mike Epps is a terrible actor.  Just fucking terrible.  I have no idea how he is a stand-up comic, but he almost has to be better, but let's just say that he hasn't made the transition as smoothly as others like Kevin Hart or even Hannibal Buress, albeit in smaller roles.  The fact that we're asked to believe Mike Epps can believably carry a movie on his own, even one as this that's all about the absurdities and not necessarily about actual acting talent, is more difficult to believe than the fact that this universe got to a point where crime was legal for just one night.  That's how bad Mike Epps is in this movie.  Either that or he just didn't give a fuck and he was just doing this movie for the paycheck, which is also very possible.  Nobody in the cast is really that good to begin with, but Mike Epps is on another level of bad.  Like I said, there's some good ideas here and there, but the movie just wastes them with some of the worst jokes you will see all year.  Now that I really think about it, this might actually be one of the worst movies I've seen all year.  It's really that fucking bad.  Not recommended at all.",
            "review_date": "2016-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So I sat down to watch a comedy after doing some exercise and to be honest this was hopeless.\nMeet the Blacks is about a black family that strikes it big and moves to Beverly Hills and then apparently they move to the neighborhood during what is called purge night.\nDurning this night apparently, you can kill people and get away with it.\nThis my first Mike Epps film and I'm not a fan.\nThe funny thing is its a black comedy kinda like scarry movie with like a dark but comedic edge to it that really was not good at all.\nThe sad thing is that there is going to be a second part to this crap.\nI would suggest not to bother with this or part 2 when it comes out.\nNot suitable for the kiddies.",
            "review_date": "2016-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Meet the Black's has a unique twist on the plot of the Purge, but it has overall bad acting, fake blood effects, and racist comments. Do yourself a favor and just watch the Purge!",
            "review_date": "2016-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Meet the Blacks uses one of horror's most timely entries as the basis for a potential-packed horror comedy, but its incomprehensible dialogue, racial stereotypes, achingly overstretched length, erratic pacing and shortage of scares or laughs only underscore its embarrassing lack of competence.",
            "review_date": "2016-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily one of the worst movies of the year. The movie is laugh free with no humor to be found in some really terrible performances. The plot is slapped together trying to be a pardy of other kind of films and nothing in it works. Don't bother with this one.",
            "review_date": "2016-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is honestly really bad. However, it is one of those films in the category of so bad it is good. I know this is not good filmmaking. But I did find myself laughing, and somehow invested.",
            "review_date": "2016-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was amazing, with quality jokes every few minutes, and near episodic style enemies coming for them one at a time.  Bounced on my boy to this for hours (actually for 94 minutes).  I'd highly recommend this to my friends and hope that you all find as much enjoyment in a genera that seems to perpetuate stereotypes as I do.\nVote El Bama 2K16",
            "review_date": "2016-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I found this pretty funny.",
            "review_date": "2016-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that wants to be a spoof of the first Purge film. You'd have more fun banging your head against a wall for an hour 34 minutes (You'd also lose less brain cells)",
            "review_date": "2016-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Being a person that loves parody movies, this falls short. it's vulgar jokes gives you a chuckle here or there as a adult. Then the movie just keeps with the same formula through out, that's when it starts to drag. The characters and acting are good but constant racism makes it cringey. If you wanna see it then find someone that has it already or Netflix it but it doesn't warrant a purchase.",
            "review_date": "2016-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "welp! Never getting that hour and a half back!",
            "review_date": "2016-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched the movie intoxicated and it was still very very very bad.",
            "review_date": "2016-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "dont listen to any of these wannabe critics, this movie was jokes, if you have a sense of humor you will enjoy the movie, don't listen to Christy Lemire,Jesse Hassenger,Keith Uhlich or any of these losers. There just mad cause they have to waste there time reviewing movies because there not professional critics. There a bunch of LAMES TAKING L's, lowlifes rating movies cause they have nothing eles to do, F those sumbags.",
            "review_date": "2016-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I rather see soul plane 3 more times. this is absolute trash.",
            "review_date": "2016-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Waste of time and money. Negative 5 stars",
            "review_date": "2016-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Garbage as expected.",
            "review_date": "2016-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "couple funny bits but apart from that its a piss poor comic take on purge movie. also first 40mins movie is usual black movie full conversatioms that of any white person had we'd all be racists and cunts on our backs.",
            "review_date": "2016-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie wasn't so stupid it was funny, it was just plain stupid.",
            "review_date": "2016-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "movie was so much bad dialogue with mike epps get deep us for that movie.",
            "review_date": "2016-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So bad it's funny half the time, and just plain unenjoyable the other half, it's a weak movie that only manages to make the Purge look worse than it already did. The horrendous editing, \"cinematography\" and stock noises make it appear as if the cast was also the crew.",
            "review_date": "2016-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First off, this movie was a chore to watch through. With the lack of good jokes (this was supposedly a comedy) this movie came out of the gates, ready to fail. This is one to skip.",
            "review_date": "2016-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's okay for the family but needs work w/ the humor in it",
            "review_date": "2016-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the worst movies ever",
            "review_date": "2016-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Meet The Blacks\" tries to be a hilarious, classic parody movie, but does an utterly terrible job at that. The comedy is extremely cheap, and relies on cameos to basically carry the jokes. The characters are very poorly made, the daughter is extremely annoying, and Zulay Henao (Lorena) does a near awful job with her role as the mother. The movie parodies \"The Purge\" but has almost no correlation to it, literally the only thing connecting is the fact that there is a purge in the movie, and trying to be its own movie was a terrible mistake. Almost all the jokes in this movie just centre around the fact that the family is black, which make the jokes extremely dry as the movie goes on. \"Meet The Blacks\" is a very cheap, poorly done wanna-be parody, that isn't worth wasting anyones time.",
            "review_date": "2016-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OK there's race humar and then there's racism. I dont care if the people making the jokes ARE black, this isnt funny... and believe me, im all for black and jew jokes at the best of times! Poorly executed.",
            "review_date": "2016-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "some humor. too similar. not even close to having a story line.",
            "review_date": "2016-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was so bad, I kept watching and hoping it would have some redeeming value -- NOT!!!  Snoop shoukd be ashamed of himself and so shoukd Mike Epps.  This gives black movies a bad name.",
            "review_date": "2016-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny movie but too much profanity!",
            "review_date": "2016-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "-10?? worst movie ever. Don't waste your money.",
            "review_date": "2016-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Meet the Blac\nks is wacky-fun. it's badly produced but Mike Epps carries it well enough. This film isn't for everybody but for those who can enjoy it, kud\nos.",
            "review_date": "2016-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the worst movie I have ever seen. Maybe Marlon Wayans could have done better. The humor was the same as Tyler Perry which isn't funny",
            "review_date": "2016-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was jokes. I don't see many appreciating it doh.",
            "review_date": "2016-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In today's film world making a good (not I didn't say high earning) spoof film is almost never done. In the past they had hits such as Don't Be A Menace and the Scary Movie franchise (at least the first few films) but with films like Meet The Blacks being released it becomes very clear that this genre needs to completely die for quite some time.\n\nFollowing Carl Black and his family after moving out of Chicago into a nice part of Beverly Hills in a attempt to be safer just so happens to fall on the night of the annual purge, where all crime is legal for 12 hours, Carl soon finds out that old enemies as well as new ones are coming to settle everything little thing in his life.\n\nNow basing a entire film off the premise of the first Purge movie (where they are stuck in the house, not the more open world ones) is a tough call, let alone making a good story and in the case of a spoof making sure it's comical. Now Meet The Blacks does none of this right. Towards the end I felt they were just adding side stories and sub plots on top of sub plots as some sort of cruel joke to the viewer. For a story that from the start was already a entirely disengaging one that left me not caring about it in the slightest by the end I was just glad to not have to think about it anymore.\n\nYou'd hope at least the film would be humorous in some aspects. From nonstop pop culture references, name dropping just to name drop, horrible cameos, and the large amount of racist and profanity laced jokes I honestly can say I didn't find myself laughing once. Coming from someone as well that is very lenient on comedy and can laugh at most was almost a award onto itself. As if they comedy aspects weren't bad enough they even try to throw in small portions of what they assume a horror film would have that is just a insult to even the worst horror films.\n\nThe cast couldn't even help as between the actors, characters, and their performances. All the characters are incredibly unlikable, rude, generally mean, and not relateable at all. You have a list of more well known names do cameos that more so just insult themselves and further add into the list of negitives this film has.\n\nIf Mel Brooks saw this movie he would want the spoof genre dead and gone and after seeing Meet The Blacks I agree. Not only will it be one of the worst films released in 2016 but should go down as one of the most painfully unfunny comedies of all time, worst of all is that they actually tried to make it funny too. Don't even bother watching the trailer for this. Just avoid it.\n\n\nScore :\n\n\n0.5/10\n\nhttps://apocalypticdemise.com/2016/07/29/meet-the-blacks-review/",
            "review_date": "2016-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved This Hilarous From Beginning To End.1 Of The Best Parody Movies That I've Seen In Literally FOREVER!!",
            "review_date": "2016-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i want to see this movie in tv its to funny.. Loved it ...lmao",
            "review_date": "2016-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Garage pure garage not worth a half star",
            "review_date": "2016-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a good movie at all!!! I can't see how this movie was even greenlit to be made. Plot was all over the place and very immature and juvenile. I expected more from my favorite stand up comedian, Mike Epps!!!",
            "review_date": "2016-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really have no words. They need to go back to the drawing board and try again.",
            "review_date": "2016-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie funny as hell ??",
            "review_date": "2016-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "at least they tried....",
            "review_date": "2016-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny but too much unnecessary cursing and sexual meanings,not for kids.",
            "review_date": "2016-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "dumb excuse of a film.",
            "review_date": "2016-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Purge is not supposed to be a comedy ROFL. This is a horrible excuse for a film. Glad it has horrible reviews. It deserves them. YESSSSSSSSSSSSSSSSSSS",
            "review_date": "2016-06-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Please, the Purge is already bad enough. This one's trying to be the comedy-friendly version of the Purge... which is completely (not) horrifying. Please save your brain at your house before going to the theaters to see this.",
            "review_date": "2016-04-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "When I watch a movie and consider it the worst movie ever. I mean it, because I think I found the movie that can top Fifty Shades Of Black. First of all, it's another one of those dumbass spoof movies. Trust me, I've seen some so-so spoofWhen I watch a movie and consider it the worst movie ever. I mean it, because I think I found the movie that can top Fifty Shades Of Black. First of all, it's another one of those dumbass spoof movies. Trust me, I've seen some so-so spoof movies and let me tell you. There's more sh*tty spoof movies than so-so. Meet The Blacks will leave you without words because you will feel dumb and confused once you're done with it. I wanted to walk out but I needed more reasons to take a sh*t on this movie. I just hate how these so called actors think they're making something funny when in fact they're making themselves look stupid. Guys, just watch The Purge because that's already a joke. Forget this movie happened.",
            "review_date": "2016-04-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Movie Is So bad. No Acting Plus Mike Tyson is not an Actor . He is Just a Hateful person and due to recent comments he made about Boxer Manny Pacquiao and President Obama. Double standard i think this be the last movie with him featuredThe Movie Is So bad. No Acting Plus Mike Tyson is not an Actor . He is Just a Hateful person and due to recent comments he made about Boxer Manny Pacquiao and President Obama. Double standard i think this be the last movie with him featured in it. Due to his Rape conviction Tyson is banned to travel to some countries so it is very interesting for him to  be in this Movies and critique the current president. Did Tyson really cared about the feelings of the woman he raped. Lets not forget about Mike Tyson who supports Donald Trump and Tyson made very bad comments about president Obama to.   I wouldnt pay the bootleg guy at the beauty shop $5 for that movie. To bad he didnt retire with Grace and SILENCE.",
            "review_date": "2016-04-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I don't know, it wasn't awful and it had a few laughs and made me chuckle a few times. It would have been better if it would have done more with its material than make cliche racial jokes and the actors looked like they cared.",
            "review_date": "2017-05-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Depressing,unfunny and over-all a **** film.This film is 94 minutes long,you will regret it cause it's not worth it,you will feel dumb or stupid when you walk out of theatre cause you've witnessed 2016's worst film.",
            "review_date": "2016-05-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Meet the Blacks is one of those movies where even watching the trailer makes you feel uncomfortable due to all the racist stereotypes present. This is like Friedberg/Seltzer levels of bad.",
            "review_date": "2016-04-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Racist garbage. Do not watch this film. Acting was crappy. The plotline was a ripoff of the Purge. I would definitely skip this movie and go watch something else.",
            "review_date": "2016-06-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The movie for the average middle american and the depressed city masses that will watch anything Sandler churns out. Also the title strikes me as an SJW fodder.",
            "review_date": "2016-04-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is painfully bad and everything about this movie is just god damn awful. Awful actors, awful script, unfunny, very cliche, and worst of all it's super racist. It relies too much on offensive humor to make you laugh but mostly itThis movie is painfully bad and everything about this movie is just god damn awful. Awful actors, awful script, unfunny, very cliche, and worst of all it's super racist. It relies too much on offensive humor to make you laugh but mostly it will probably just irritates you because of how bad the humor is delivered.",
            "review_date": "2016-09-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A complete waste. Utter garbage. Do not waste time and money on this. You are better off sitting in a room watching the paint on the wall age. You will do less damage to your mental health. In fact, this movie should carry a health warning.",
            "review_date": "2016-08-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Is it dumb? Yes! Is it funny? Not really but all spoof movies aren't really funny I liked it apart from the racist jokes  with the Kkk being in it  if you like  spoofs and you like the purge u could maybe enjoy this",
            "review_date": "2016-08-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The “black spoof” genre continues with yet another entry sure to empty the wallets of any black person eager to hear the regurgitation of their victimhood world view.",
            "review_date": "2022-09-30",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "rt_rating": 7.2,
    "rt_summary": "When some unexpected money comes his way, Carl Black (Mike Epps) moves his family from cold and windy Chicago to bright and sunny Beverly Hills, Calif. As the Blacks settle into their beautiful new home, they start to notice some strange behavior in the neighborhood. Nighttime is approaching, and President El Bama (George Lopez) announces that the annual purge is about to begin. Carl and his loved ones must now endure a 12-hour period of lawlessness before they can enjoy life once again.",
    "meta_rating": 7.3,
    "meta_summary": "The Black family is getting out of Chicago in hopes of a better life. After Carl Black (Mike Epps) comes into some unexpected funds, he takes his family and leaves the hustling lifestyle behind for something better. Carl, his wife Lorena (Zulay Henao), son Carl Jr., daughter Allie Black (Bresha Webb) and cousin Cronut (Lil Duval) pack upThe Black family is getting out of Chicago in hopes of a better life. After Carl Black (Mike Epps) comes into some unexpected funds, he takes his family and leaves the hustling lifestyle behind for something better. Carl, his wife Lorena (Zulay Henao), son Carl Jr., daughter Allie Black (Bresha Webb) and cousin Cronut (Lil Duval) pack up and move to Beverly Hills. Turns out, Carl couldn’t have picked a worse time to move. They arrive right around the time of the annual purge, when all crime is legal for twelve hours.… Expand",
    "vibes": [
        "homeless",
        "unintelligent",
        "racist",
        "worthy",
        "comedic",
        "cheesy",
        "childish",
        "shaky",
        "stereotypical",
        "erratic",
        "incomprehensible",
        "rich",
        "particular",
        "unhappy",
        "racial",
        "expensive",
        "normal",
        "critical",
        "immune",
        "luxurious"
    ]
}