{
    "rating": 0.0,
    "release_date": "2016-09-02",
    "num_reviews": 136,
    "genres": [
        "Action",
        "Comedy",
        "Horror"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "How to Spend 88 Minutes of Your Life Watching a Comedy without Laughing",
            "content": "In the 90's, Kevin Smith became an icon with \"Clerks\", \"Malllrats\" \"Chasing Amy\" and \"Dogma\". Unfortunately along his next works, he has never reached the same success again.\"Yoga Hosers\" is probably the bottom of his career, with an unfunny and annoying story. His daughter and Johnny Depp's daughter acting are terrible and they only had this chance because of the influence of their fathers with the producers. The name of Johnny Depp is embarrassing and used to lure the viewers. In the end, \"Yoga Haters\" is a means to spend 88 minutes of your life watching a comedy without laughing. My vote is one (awful).Title (Brazil): Not available",
            "review_date": "2017-01-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Comedy Without Any Laughs",
            "content": "Yoga Hosers (2016) * (out of 4) Friends Colleen (Lily-Rose Depp) and Colleen (Harley Quinn Smith) are invited to a Senior party but they end up having to work at the local convenient store. They invite the boys back to the store for a party by they're attacked by some Nazi sausages.Yes, writer/director Kevin Smith has followed the ultra-bizarre TUSK up with an even stranger movie that isn't nearly as creative. You know, I got the great opportunity to see Smith in person during one of his \"conversations\" and he's a terrific and fun guy. I mean, you gotta admire the man for what he has accomplished in his career and during the chat he talked about people questioning him and that he will do the type of films that he wants. I really, truly and 100% respect that and I admire any filmmaker who wants to take chances and do weird things.With that said, just because I respect the filmmaker doesn't mean that I'm going to enjoy the picture. Sadly, YOGA HOSERS is a really awful movie that doesn't work on any level outside of being weird, strange and in all reality original. Yes, Nazi sausages are on display here and you've got to at least admit that you've never seen that before. The problem is that Smith's screenplay is just weird and for a comedy it's never funny. That's the most shocking thing to me because Smith is one of the best dialogue writers out there yet this film just seems flat and lifeless.I don't know if the point of this film is to give his daughter and Depp's daughter a film to go and if perhaps Daddy Smith and Daddy Depp are just here having some goofy fun. Perhaps that's the case but you still have to have some sort of laughs. At just 89-mintues the film is rather short but it drags on to the point where around the twenty-minute mark I was already looking at my clock. I will say that the two leads are actually good together and have a nice chemistry, which just makes you wish even more that they had something better to work with. Johnny Depp returns to his role from TUSK and adds to the weirdness.YOGA HOSERS is just another flat out weird movie but sadly this one here isn't nearly as effective as TUSK. With the lack of laughs this movie is pretty much dead in the water, which is really too bad.",
            "review_date": "2016-09-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Silly, with tongue in cheek.",
            "content": "I have seen reviews here bashing the movie. Yoga Hosers is no Godfather. This is obvious. I have been watching Kevin Smith movies for nearly 25 years. Instead, look at the fun the actors are having. This movie stars Johnny Depp, his kids, with Kevin Smiths daughter, Johnny Depp's ex girlfriend and mother of his children, Kevin Smith and wife, Jason Mewes, Stan The Man Lee....all of these people friends. It was done for fun, and to poke fun at Canada and millenial culture. If I had the pull and the money, I'd do it too. Kevin Smith does this, every now and then grabs up his friends and makes something silly, and goes back to making the movies that earn huge amounts of money. Does no one remember the line from Jay and Silent Bob Strike Back? You make the safe film, then you make the art film. And sometimes, you make a film for your friends. That is Kevin Smith. Sometimes he just wants to have fun with his friends. The relationship Kevin Smith has with his daughter is one that every father should dream of having. Or am I the only one moved by seeing Harley Quinn Smith in tears when Kevin Smith gave her the bat used by Harley Quinn in Suicide Squad as a gift? And Depp. It is like he has a side of him that reasonates with Kevin Smith. He plays a lot of roles in movies, but seeing him onscreen during one scene with his daughter and cracking wise that she may not be old enough for what he is talking about was great. The movie is not in my top fifty, but it was nice to see friends and family making jokes and enjoying themselves.",
            "review_date": "2018-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "In All Seriousness What Happened to Kevin Smith?",
            "content": "Now when I first saw the trailer to Kevin Smith's (Clerks, Dogma) Yoga Hosers I was a little surprised. Now for those who have not seen the trailer for this film, and are asking yourself \"What the Hell are some Yoga Hosers?\" The trailer focuses on the two Canadian girls from Smith's last film, Tusk. Who work at a convenience store, and encounter Nazi sausages. Seriously. When I saw the trailer, my immediate instinct reaction was \"What the f*ck?\" It wasn't that what the f*ck with anger, it wasn't what the f*ck with confusion, it really was just a simple what the f*ck. Now I love Kevin Smith films. He always seemed like a cool person, he is well spoken, writes scripts with compelling characters and story, and he seems like the kind of guy you could easily talk with. His last film Tusk, in my opinion was his worst film. The films plot was there and it sounded great. What I personally didn't enjoy was the pace of the film and the characters. At least that film had a story wrapped around in it. Most people, including myself love the art form of filmmaking and movies for two main reasons. That being a story the audience can connect to and characters and audience can connect to. In my opinion, Yoga Hosers has very little story, with characters an audience cannot connect to, it isn't that funny, it's annoying, and I personally didn't get it.I do not know if Kevin Smith made this film to mess with critics, the media, and fans. Or is he just this bad of a filmmaker now? Sadly, out there in the world there really is an individual who has a film script. A film script with story, compelling characters, a story that is a breath of fresh air, and a script that is really written with heart. Unfortunately, we may never have a chance to see it, because Kevin Smith had to bring us f*cking Yoga Hosers. Sorry Ah-Boot ThatI don't know where to start with this film. For God's sake, there is even a Marvel cameo of Stan Lee in this! I didn't go into this movie thinking it was terrible. I saw it on Netflix, went in with a clear unbiased mind, and 80 minutes later I'm shocked. The one good part of this movie is Harley Quinn Smith and Lily-Rose Depp. Those two actually to capture the spirit of Clerks in a way. I found them to be a little funny. But the rest of it is just bad acting and really bad Canadian jokes. They run the same joke into the ground over and over and over and over again. I didn't know it was possible to offend and be prejudice towards Canadians. After seeing this movie, well Goddamn it is possible if you're Kevin Smith. We f*cking get it, Canadians say EH (A) ever so often. When they say about, sometimes it sounds like they are saying Ah- boot. At first it is a chuckle. After that, it is just sad; the whole movie is Eh and Ah-boot! That damn title card pops up every ten minutes when they introduce a character is bad! It looks like a want to be Scott Pilgrim and Suicide Squad.The cast is talented, but the story and they way it's written is completely ridiculous. Pucky Charms cereal ever ten minutes in your face, terrible Canadian slang jokes, looks like a 1990s video game in 2016, and this is the director of Clerks, Dogma, and Chasing Amy. There is no way in Hell this movie was made seriously, it is clearly a joke. A joke I personally do not find funny.This film is worse than Tusk. If you enjoyed it, I am more than glad you did. Maybe I just don't get the joke. Kevin Smith's down dude since day one is in this, Mr. Jason Mewes! And even he is in this for two minutes, with the look on his face like yeah I don't need this right now. Really it is a shame, it's a mess, and I will always like and respect Kevin Smith. But recently his work, his legacy, his films have gone so far down the sh*tter I don't think he can cleanly come back up. Sorry Ah-boot that, yeah you should be sorry for this sh*t you call a movie!I believe this \"movie\" earns a\u00852 out of 10.Worst Kevin Smith film.",
            "review_date": "2016-12-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "When a guy goes super manchild, has a daughter and teams up with Johnny Depp and his daughter then writes a script.",
            "content": "I know Kevin Smith is the type of guy that does have a sense of humor, and is good at telling stories that is based on his life. This is basically a montage of stuff put together by Kevin Smith to promote his daughter and to build a bond with Johnny Depp. So he tries very hard to make it funny, edgy, slick, hip, angsty and cool. But it's all just so darn annoying and contrived, and let me tell you...This is a very annoying movie to sit through. I can see what Kevin Smith was trying to do, at least for some of it but it falters in every level. From the introduction of the characters, which he probably tried to rip off of Scott Pilgrim to the awful dialogue. Watching this is like watching an adult trying to relive he teenage years but more difficult to watch. And the two duo which is composed of Kevin Smith's daughter and Johnny Depp's daughter. And they are more irritating and annoying to watch than the duo from \"Ghost World\". At least in \"Ghost World\" it had a purpose but this one does not. And most of the screen time is taken up with the teenage duo doing awkward yoga and awkward singing. It's fine if people want to do these kinds of stuff during their free time but it doesn't mean it's pleasant to watch. You know those people that thinks they are so much cooler than everyone else, so they gossip and talks trash about everyone except the ones that genuinely cares about them. Well that is the two characters in this, sure teenagers can do dumb things. I use to do dumb things as well, but the duo just go beyond that in this. They aren't evil teens just very very very annoying to watch teens. If they did dumb stuff and it was at least clever or funny than there would be a difference. You as an audience won't get a single laugh out of this. Even the laughter from the characters in this flick seemed so forced and fake. As a matter of fact, everything about this movie seemed forced. Johnny's daughter will probably make it to stardom thanks to her father's resources and connections. But I can't say the same for Kevin Smith's daughter. This whole movie is a montage of \"hey guys look what my daughter can do\". Overall, if you want to waste time getting annoyed and irritated for almost an hour and 30 minutes than give this a try. If not, then I highly recommend you stay away from this one.2/10",
            "review_date": "2016-12-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Unwatchable",
            "content": "At first I gave it a chance... I have seen some bad films in the past and endured them to the end but I honestly could not continue the painful experience that this film put me through for 28min. I did skip forward a few times in hope it might get to the point. I doubt though that anyone involved actually knew what the film was a bout. Confusing and badly executed.... I think one star is fair due to it being unwatchable for me... good luck to anyone that makes it to the end.",
            "review_date": "2020-12-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Much ado aboot nothing.......",
            "content": "Colleen Collette and Colleen McKenzie are two teenage best friends from Winnipeg who spend their lives doing Yoga with their faces in their phones, 'Liking' or 'Not Liking' the real world around them. But when these girls are invited to a Senior party by the school hottie, the Colleens accidentally uncover an ancient evil, long buried beneath the Manitoba earth......The second part of a proposed trilogy, coming after the quite entertaining Tusk, Yoga Hosers is one of those rare films that begs the question 'what on earth happened to Kevin Smith?'.22 years ago he was a fundamental part of how independent movies and comedies changed by releasing the phenomenal Clerks into the world on a shoestring budget.That film had wonderful pop culture references, brilliant observations about the real world and self realisation, and it was hilarious to boot.This has a bevy of family members and special guest stars doing nothing more than mugging at the screen, has a villain who does nothing more than spend the final third of the film doing really bad impressions of famous people, and to top it all off, has no coherence whatsoever.So a party unleashes an evil which takes the form of racially incorrect sausages that kill on command, and only Kevin and Johnny's Daughter can save the day, with a little help from Johnny's Son and Ex-partner.If it wasn't for Depp returning as Dupoint, this could have easily been one of the worst films that I have ever seen, but Depp is clearly having a ball reprising his role, and the film goes from downright offensive to mediocre whenever he's on screen.And the use of the word Aboot is tiring when you hear it more than once. It's already been done, over seventeen years ago with the South Park movie, and was a lot funnier.It's a poor excuse for a film, and considering its from someone whom I once considered to be a bit of a genius, it just makes it all that little bit more worse.Horrid stuff, bar Depp's leftfield performance.",
            "review_date": "2016-11-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "virtually unwatchable",
            "content": "I love most of Kevin Smith's movies and I enjoy his recent stuff that steps outside his norms as he plays with whatever ideas intrigue him but this is the one notable exception. The movie had so much potential and fell so far short of it that the movie is virtually unwatchable. The acting sucks, even notable actors gave crappy performances in this. The fake Canadian accents and dialog had me turn the movie off twice before I was able to finally force myself to sit through the rest of it. Hopefully his next venture isn't as fantastically bad as this one was.",
            "review_date": "2017-03-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "So Sorey to Have Seen It",
            "content": "Yoga Hosers is to film what dirty outdoor bum f***ing is to hygiene. To say this film is an insult to bratwurst, yoga, beavers, French Canadians, demon worship, Jean Chretien and the province of Manitoba would be an understatement comparable to calling the Hindenburg a bad day in New Jersey. Years ago, someone must have approached director Kevin Smith with a Brewster's Millions (1985)-type proposition only instead of wasting money he's trying to get his fans to die of embarrassment en mass. The man has constructed a personal brand that embodies and cashes in on the aloof, dropout, knower-of-all, master-of-none, slacker quintessence that made Comic- Book Guy from the Simpsons (1989-Present) such a fan favorite. Then like a common drug dealer, the man sold his brand to damaged people, made a tidy profit and probably sits in a cozy man-cave of obsolescence cluttered with Batman memorabilia, laughing as the good s**t he used to sling is being cut with baking soda.The thing in Yoga Hosers that loosely resembles a plot, revolves around best friends Colleen (Lily-Rose Depp) and Colleen (Smith). They kinda-sorta have a band, kinda-sorta have family lives and kinda- sorta work at a convenience store called the Ah-2-Zed because...Canada. Their existence as terminally flighty, yoga-loving, teenage girls is completely upended when a dark presence threatens to...you know what, I can't. I really can't. Going over the plot in my head and attempting to regurgitate it like a half-eaten poutine is giving me an embolism. Let's just say going over the story beat by beat, would have the same effect on you the reader as the Ark of the Covenant.This movie makes no sense. It doesn't make sense from a narrative perspective, it doesn't make sense from a character perspective, it don't make sense from a marketing perspective or really any perspective that requires you to, you know, have eyes, ears and a sense of self. Smith is clearly gunning for the apparently coveted \"so-bad-it's- good\" slot of your film-going memory that I'm surprised he didn't include a tobacco spitting talking cupcake. And no, Smith himself playing the army of Nazi sausages that are unceremoniously dismembered throughout the film, does not make me feel better about it.The thing about Smith's more than half-over True North trilogy is it throws itself into the realm of badness and asks you to love it, like a fussy, crap-covered toddler who tipped over its training potty. It tries oh so hard to be the next The Room (2003) completely ignoring the fact that not even The Room wanted to be The Room! To accomplish this, the movie hobnobs every tired lounge-club comedian stereotype of entitled Millenials and polite Canadians and mingles them with Nazi scientist clichés, tacky monster effects, View Askew cameos and the jokes your dad laughed at in Robin Hood: Men in Tights (1993).And another thing while we're on the subject of living, breathing examples of eye-rolling lethargy. Kevin Smith can't write; there I said it. Sure he has a penchant for snappy dialogue but there's way more to good writing than characters spewing lines with the cadence of a drumline. Good writing needs character arcs, themes, foreshadowing, mood, structure, all the stuff that doesn't lend itself to a Clerks (1994) callback. Smith sacrifices all that in this film so he can feel a sense of accomplishment, being a 47-year-old man writing two fourteen-year-old's like they're out of a Diablo Cody story. That and to have an opportunity to chew the fat with Johnny Depp for three pointless movies.Yoga Hosers is inept on an almost molecular level. It literally has nothing to offer even the most die hard of Kevin Smith fans, except quite loudly turning the phrase, \"wasted potential\" from a pseudo- badge of honor, to shriek-level mortification. Quite frankly it's a travesty. If this movie were personified in any way, I'd dunk its face in a shallow pool of water until the bubbles stopped.",
            "review_date": "2016-09-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great potential, wasted",
            "content": "It started with a great song, has some charming girls as the protagonists and a ton of celebrity actors that came in to bring their support. Some of the jokes are hilarious and the setup was awesome.Imagine this movie starring the Depp and Smith daughters, with their families in tow: Johnny Depp, Vanessa Paradis, Jack Depp, Kevin Smith and Jason Mewes, with support from the likes of Haley Joel Osment, Justin Long, Austin Butler. Stan Lee is in this movie! And it's a Canadian parody with Yoga hosers chicks fighting devil worshipers and Nazis \"the Yoga way\". Wow!And now jump to the film itself which, with this much going for it, barely scratched the average. After the first 30 minutes I was thinking up funny ways of congratulating Kevin Smith for this funny and imaginative movie. After that, though, it all went downhill.I guess the biggest quarrel with the thing is its inconsistency, jumping from great fun to silly and to plain bad and back again in a matter of seconds. Kevin, I love you, but you need to think your scripts through, man!",
            "review_date": "2017-03-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Even comedies need some realism.",
            "content": "Kevin Smith was good filmmaker. He made Clerks on a shoestring budget. He made the wickedly funny Dogma. And he made the surreal Tusk. But somewhere along the lines he seems to have forgotten certain things. While Sophia Coppola wrote a love letter to Japan in \"Lost in Translation\", Kevin Smith seems to have scrawled something on a bar napkin for Canada in \"Yoga Hosers\". It's frankly a wonder why specifically this movie was made.The story itself, is unremarkable. Two girls, played by the daughters of Johnny Depp and Kevin Smith play the two Colleens who wind up in the middle of some really strange stuff dealing with Nazi sausages. Yes that's right, Bratzis. The girls are cute but they're not great actresses. You really need more if you plan on building a career for these two. But that's not the problem. The problem is why specifically is this set in Canada? Put it in the United States and the story would barely change. The only difference is there wouldn't be all those lame Canadian \"jokes\" that people say when trying to be clever.Yes. We get it. Canadians have an accent. They say \"sorry\" differently. They say \"zed\" instead of \"zee\". And nobody, especially in Manitoba, says \"aboot\". Maybe that's an East coast thing but I've spent time in Canada and never heard anybody say it that yes. Sure, it's different than how we say it in the United States but it's not \"aboot\".But literally that's the joke. Canadians talk funny. Ha ha ha. Get it? If not it's okay, it'll only be hammered home with all the subtlety of a sledgehammer. If you make the mistake of trying to take a shot every time somebody says \"sorry\" or \"aboot\" you'll be passed out in the first 10 minutes.I'll admit it had some decent moments but overall, it was just terrible. I'm really not looking forward to \"Moose Jaws\" because I honestly think it's just going to be more of the same.",
            "review_date": "2017-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This isn't the real world. This is Canada.",
            "content": "Collen C. (Lily-Rose Depp) and Collen M. (Harley Quinn Smith) are sophomores who work at the Canadian \"Eh-2-Zed\" convenience store where they practice their band in the back room. They take yoga at the strip mall from Yogi Bayer. One night Puppetmaster style Nazi bratwurst invade the store....The film is comedy and not horror. It makes fun of everything Canadian, more so than \"Canadian Bacon.\" I originally believed this was made by Canadians making fun of themselves until I saw this was shot in California. Too late. I already laughed. The film also makes sport of our over crazed smart phone teens who love celebrity and everything outside of the real world...also the target audience-whoops. The humor was quirky. I loved \"Pucky Charms\" cereal as well as the girls inability to sing and their gems like, \"Nothing is as bad as Canadian Idol.\" Stupid, smart, and fun. This is not for everyone.Guide: No swearing, sex or nudity. Sexual references. You must do a shot every time someone says \"aboot\" and feel free to stop 10 minutes into the film.",
            "review_date": "2017-09-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An in-joke made by the Smith's and the Depp's",
            "content": "Would have worked better as a \"Grindhouse\" type film. I can tell this was supposed to be comedy, but almost every joke fell flat. There were only minor amusing moments, but they were so scattered across the run time that your search for them would not even be worth it.I wish Kevin Smith wouldn't do all the science fiction elements, because they don't blend well with the established tone. And It makes everything more ridiculous to be honest. I would have enjoyed a more down to Earth comedy. If you wanna keep the weird monsters and over the top scientists, then set the tone up better from the start. Because the first act is like a cheap Rom- com. It just takes you by surprise when it switches gears. I don't have anything against the Avantgarde genre, but here it just didn't work well.What are the positives? There's an entertaining flashback scene with Haley Joel Osment. He is completely over acting and it's one of the few scenes which could be funny to some people. Johnny Depp shows up, and his ex-wife and two of his kids (one is playing the lead) as well. Even Kevin Smith's daughter co-stars. So, this is a family film? Maybe it is nice to see these two families be friends and make a funny movie together. You can see they all had fun and they are not taking it seriously for one second.It feels like the Depp's and the Smith's were just hanging out for a weekend and just for the fun of it decided to make a movie. They invited a few friends too. I guess it's all an in-joke to them, but for the rest of the world? Not so much.",
            "review_date": "2016-10-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "yoga hosers - take off, eh!",
            "content": "WOW - that's it; that's my review. Thank you & good night! Nepotism alert! Nepotism alert! Hey Kevin, please give me my ten bucks, thanks man. Kevin Smith made a student film starring his friends and family. How does this crap get made?! I'll tell you what though, you will be seeing a lot more of Johnny's daughter, she is a great actress (that's pretty much the only positive I've got) Now let me get to this stinkfest: Two Colleen's run a convenience store in Canada(oddly enough they can't speak a lick of Canadian, eh.) They fall in love with a young Brad Pitt wannabe who wants to sacrifice them (well, of course he does)& then the Nazi sausages attack. These guys are the wurst. This is what the movie is a boot.",
            "review_date": "2016-09-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "New low for Kevin Smith",
            "content": "Love Kevin but if he makes stuff like Yoga Hosers he shouldn't be surprised why he's being trolled about the movie.. Even a blind man could tell you this movie sucks with all the puns in the movie and saying \"abooout\" a million times thinking it's somehow funnier each time it's said.. Even Kevin knew this movie won't be liked and he had trash and had to give people a disclaimer that lots of people will hate it and the ratings would be bad.. I know this is Kevin's experimental phase which is a good idea on paper but you're running the legacy you've previously earned with Clerks and etc...It's easy for you to get back the money for the investors because the main reason why people view it is during your movie tour because you talk to them about the movie before and have a Q&A at the end which is why the fans suffered through the movie so they can talk to you and be blinded by Kevin's holiness and secretly some if not most of your die hard fans are lying to them self that they liked it.I'm not a critic but a fan and paid my hard earn cash to watch this to be entertained.. came out disappointed and felt like someone stole money from my pocket and hit me on the head with a hammer and I got knocked out and lost 1 hour and 30 minutes of my life that I'll never get back which is a lot worse than the the money that was stolen Kevin's writing has clearly gone down the hill so here's a tip... try making more movies with scripts that wasn't written by you. It's been awhile since you've made a movie that people like. Read more scripts from fans or try to collaborate with other screenplay writers that you like although it's going to get other to work for you will all your flops.BTW just wondering if Smith is losing his fan boys and is trying to tap into the stoner market because that's what he always talks about that during any interviews he does",
            "review_date": "2016-09-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wankapalooza",
            "content": "I love Kevin Smith. Seriously think he's one of the most engaging, funny, clever people going around. I've been a regular at his Smodcasts, live shows, q&a's, watched all his movies, twitter feed etc etc, so it pains me to say that this is one of the biggest pieces of sh!t I have ever seen. An in joke wankfeast from start to finish, I gave it 2 stars rather than one only to honour the memory of his early funny films and what an all round good dude he seems to be in general. It's great that Kev has the money to do whatever and indulge whoever the f@ck he wants, I'd love to have that life too. But I don't, so I had to put up with wasting 90 minutes of my life being smacked around by the snotty end of Big Kev's fuckstick. The most entertaining part was Ralph Gorman doing his Hollywood BabbleOn schtick without having to do call outs to drunken white trash from the third world suburbs of bumfuck Idaho. When Kevin announced his retirement from movies I was disappointed, but after this unfunny self indulgent Wankapalooza, I'd rather he stuck to the talk circuit where he's still awesome as hell.",
            "review_date": "2016-12-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Two words for Kevin Smith",
            "content": "Grow Up! You are too old to be making naughty teener movies. Maybe there is something to pot affecting your brain, because you had groundbreaking classics in Dogma and Chasing Amy, but this garbage is worse than the indie junk produced by high school kids.",
            "review_date": "2018-08-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Watching YOGA HOSERS is like stabbing yourself in the eye with an ice pick",
            "content": "I watched #YogaHosers at Comic-Con and I ended up regretting it. In fact, I walked out of that place halfway through because the film was so awful, I couldn't even tolerate it. And perhaps I'm not the right audience for it, who knows, maybe it's an acquired taste thing. And I do have a lot of respect for Kevin Smith, I honestly do. If you've seen videos of his interviews or if you've seen him talk, the guy is articulate, he's funny, he's modest, he understands that filmmaking is a collaborative effort, it's like listening to a teacher speak. But YOGA HOSERS has got to be the worst film of 2016, hands down.Part of true north trilogy which is a horror comedy series by Kevin Smith that started with \"Tusk\" and will end with \"Moose Jaws,\" YOGA HOSERS is about best friends Colleens, one is Colleen McKenzie, played by Kevin Smith's daughter who has the coolest name on earth, Harley Quinn Smith, and the other is Colleen Collette, played by Johnny Depp's daughter, Lily-Rose Depp. And so the Colleens have after school job at Manitoban convenient store where an ancient nazi evil rises from beneath Canada's crust.The film also features a lot of people from Kevin Smith's circle, plus a cameo by Johnny Depp whose great talent is absolutely wasted here. Look, to be fair, at the screening I attended, Kevin was there and he said if you like the movie, then that's good, if you hate the movie, that's cool too, man, meaning it sounds like Kevin is at a point in his career where he just doesn't care anymore about good storytelling quality. And sometimes, not caring can potentially be beneficial, sometimes there's power in not caring what other people think about you and your work. But in this case, it backfires.Watching YOGA HOSERS is like stabbing yourself in the eye with an ice pick. Just the super duper tiny villain himself and how he enters the scene are just atrocious, and at one point, the two girls were just fighting these cloned little bastards inside that convenient store, that scene pretty much describes the entire movie, which is a complete farce. You might argue in defense of this movie calling it Canadian \"Clerks,\" but that won't hold up considering how well-written \"Clerks\" was. Perhaps Kevin has lost his mojo, who the hell knows. But I think it's time for Kevin to just make movies based on somebody else's screenplay because I still do believe that he's a good director but he shouldn't do his own materials, he should throw everything he writes out the window and down to the landfill, and just direct either adaptations or somebody else's original story. YOGA HOSERS is an obnoxious movie that nobody should ever see.-- Rama's Screen --",
            "review_date": "2016-08-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sucks",
            "content": "This is not a good movie. It has no story and isn't funny. I liked it anyway. Sorry 'boot that.\nThe two Colleens were fun to watch, and I liked the Canadian setting. I thought I would hate the little Nazi creatures, but they were tolerable. The ending is the worst part--really, the entire final act. I don't know why I was in the mood for this movie or why I didn't hate it, but this seems to happen once in a while. I ignored this movie when it came out because of how crappy it looked, but then one day I just felt like maybe I'd give it a chance. That's aboot it.",
            "review_date": "2020-02-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Dude what were you thinking.",
            "content": "I think I get what Kevin Smith was trying to do. But by portraying young girl the way adults see them is not funny to anyone. The younger people watching will be insulted and the adult will be annoyed. For a small comedic moment I can see it but not for over an hour.Secondly. Kevin Smith REALLY should of made just a little research into Canada. I have never heard that accent in my life. It's not a real one. It's an accent made up by comedians. The only accent that is accurate is Jony Depp. French Canadian from Montreal do speak like that but the rest of the cast just got on my nerves. Also in Canada we have 11 grades then college then university. Speaking of we have world renown University's he didn't need to invent one.Now this part I understand because the U.S. is very patriotic but we really aren't. We love our country and are proud to be Canadian but we don't have beavers, flags, maple syrup, and so on everywhere. Most Canadian can't even sing the anthem by heart. We have no need to shove our patriotism down anyone's throat.And lastly, alto this could be only for \"plot\" sake, the only part we had in WWII in Canada was a secret lab under the university of McGill in Montreal were the atomic bomb was built by Americans.Now if you have no clue about anything from Canada and you don't mind a movie with a weird \"plot\" then sure. If not then stay away. It's not just bad it is, in my opinion, a movie to cast there kids and make money.I am a huge fan of Kevin Smith. From clerks to Dogma and the red state. But this is just awful. I can see Jersy girl being a good movie in his head while doing it but this one I am pretty sure even Kevin Smith didn't think it was good.",
            "review_date": "2016-11-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Shirley and Shirley",
            "content": "Because he had no other choice, Kevin Smith started exactly where he was at... the very bottom, financially... for his black and white crass comedy, CLERKS, which had a great script, a gang of real characters playing fictional ones and a location that really put you there for the action and, on purpose, complete lack of...Which was followed by the much too colorful (and hopelessly vacant) MALLRATS that led to Smith's best venture, CHASING AMY and, years later when his indie magic had dried up and after failing at the conventional box office, he intentionally returned to the slacker's den where, along with a podcast show, there's an attempt to make daughter Harley Quinn Smith a star. But not by herself. Along with this every-girl, just comfortable enough in front of the camera, is pixie model Lily-Rose Depp; the daughter of Johnny Depp, who, between million dollar PIRATE successes and a string of artistic misfires, seems to be doing Kevin a return-favor by appearing in both TUSK and the latest, YOGA HOSERS, as a spaced-out, boil-faced, scraggly-haired private eye (of sorts) named Guy Lapointe, a hybrid of Peter Sellers' Inspector Clouseau, Robert Shaw's Quint from JAWS and Peter Falk's scruffy TV Detective Columbo.The main characters are the two teenage girls, both named Colleen, who, like Dante and Randall in CLERKS, work as... well... clerks at a convenience store; only more liken to a 711 instead of a rural-suburban dive-purgatory...While Smith's two male CLERKS had polar opposite personalities, which is essential in any kind of buddy flick, these girls, staring at their cell phones and, as Canadians, pronouncing, for example, the word \"About\" as \"A-Boot\", are exactly the same...Pop Culture guru Smith, like Quentin Tarantino, is heavily influenced by old stuff... ranging from The Fonz to JAWS... that he grew up on. If only there was more of a LAVERNE & SHIRLEY vibe here... a sit-com where two polar opposite girl roomies continuously kept each other going. Shirley is girl-next-door cute, extremely uptight and on the verge of having a mental breakdown, perpetually guided by the stronger, more experienced party girl, Laverne, who keeps herself out of trouble by keeping her best friend sane. In YOGA HOSERS, Colleen One and Colleen Two are basically clones and hardly even keep each other company. Perhaps the next feature could allow one of the duo to either surpass or digress so there's enough anti-chemistry to make the eventual kinship really mean something.Like with TUSK, which centered on a loser who winds up captive at a madman's manor and then turned into a walrus, Kevin Smith goes so intentionally overboard, it's as if he's giving fans something so bizarre and intentionally-bad to be critic-proof: especially if said critics are uptight party poopers who just \"Don't get it\" to begin with. In HOSERS, the two teen parrots battle a bunch of tiny \"Shatzis\", all played by a computer-animated Kevin Smith, looking manufactured from a student film at a semi-expensive college. The shin high monsters, a cross between the creature Drew Barrymore battled in The General, the third tale in the Stephen King anthology CAT'S EYE, and what probably inspired that episode - Karen Black's famous Zuni Doll from TRILOGY OF TERROR. Herein, the victims all deserve to die, which happens so quickly that, while the girls sit around agreeing on everything that annoys them, it's all just too easy: a maze without corners.Smith new style seems influenced by the chaotic mayhem of SHAUN OF THE DEAD director Edgar Wright, and there are moments to get jovially lost in. But it's Johnny Depp's pointless character who not only ruins a film already heavily marred with banality, but his cadence of speech is paint-drying-torture. Instead of providing necessary exposition, or being a strategic cameo, he rambles on and on: right when things almost begin to roll without him. And not only does he get in the way of whatever story Smith is trying to tell (like in TUSK), he makes it even harder for the audience to get to know the two girls we're supposed to love at this point. But if you want to hear the world's greatest Adam West imitation, standup-comic-relief Ralph Garman steals a \"Lecturing Villain\" scene that's all his own.",
            "review_date": "2018-08-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Still better than Ghostbusters, tho",
            "content": "Okay, let me start by saying that I grew up o Kevin Smith movies. To this day i love DOGMA and Chasing Amy.But this movie was just terrible, I mean freaking terrible. The puns, the story line, the freaking bratwursts, the acting, the direction... what the hell was Kevin Smith thinking?Harley Quinn Smith and lily-Rose Depp do have potential if given a good vehicle to prove it, Yoga Hosers was NOT that vehicle.But I will say tat it was at least more enjoyable than Ghostbusters (2016). Because like many films before it, Yoga Hosers is proud to be such a bad movie, while GB thought of itself as a great movie and is nothing of the sort.",
            "review_date": "2016-11-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What is trully cool in film or in storytelling...",
            "content": "See the unexpected, to be enthralled with a seminal idea, and even, even, even if its totally outrageous and ridiculous, what is the coolest is to see if the creative can make somehow, WORK!I think Kevin here, in this project, perhaps before he stepped up to indite the thing or in the throes of it, or after in the second write I don't know, but somewhere along the lines he said to himself, F - it, I'm going to do something I have never done and see where it all goes and at some other point he said to himself, I want to do something no one has ever done and see if I can make it work!And you know what he did! Ask yourself one question, were you or were you not entertained, was it not an original idea, was it congruent and savvy amidst the writing process? I think so there were no holes, it made sense in its very bizarre world, and lets face it, it kept its unit on the film and us! WTF were those lil' things, and then they transformed to become on big ugly thing! I mean I can't say I didn't love every scene - it funny, raunchy and weird and funny, good combo, and you know what the strangest thing was...I think I learnt something... 101, Don't be too much of a Dick in Canadooo, cause its not abooot storytelling, its aboooot wunderbar neo-maxi-zoom-dweebies!",
            "review_date": "2019-01-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you know what your getting into...Solid fun!",
            "content": "Kevin Smith definitely didn't shoot for the moon, or aim to make this for everyone, or even most...he made this for his fans from the Podcast, and to give his daughter an avenue to stretch her new found skills.The movie is fun. the performances in it all shine at different moments...the two standouts being Johnny Depp as Guy Lapointe and Tony Hale as Lily-Rose Depp's Dad...Solid and funny.The girls grew on me after awhile...which was surprising, only to the fact that watching teen girls on their phones and chatting back and forth...in real life can be annoying...But Smith makes it funny, and paced well.Overall...if the preview intrigues you...see it.If not...it's OK to skip...it's not for you.",
            "review_date": "2016-09-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Yoga Hosers - Movie Review",
            "content": "Kevin Smith has once said that any idea that he comes up (even if it's a bad one) he can't turn down.You should.Yoga Hosers feels more like a bad SNL sketch then an actual movie. Well, South Park can also be thrown in the mix, but even it's bad episodes isn't as annoying or painful than this garbage.But then again, I am just an evil critic who hates everything and everyone. Or that's what Kevin Smiths sees or thinks when reading critical reviews. That's an actual scene in this where a character goes on quick rant on someone by calling them a soulless evil critic who hates everything. Which is basically away for Smith to get all of his anger out from the last critical bombs. Sorry but I think Iñárritu got that across a lot more smarter in a much superior film called \"Birdman\".Oh and there's this tried gag in the movie where every Canadian say ABOOT (about). The reason why I'm bringing this up is because the film literally focuses on this way too much and the running joke got on my nerves quicker then I imagine. Yes I get it they saying it differently. I'm guessing it's suppose to be funny, because of how intentional the actors say it, but even for a joke it's still p*ss poor.Alright I'm done talking about this piece of sh*t. But let me leave you with this.www.youtube.com/watch?v=Wq3U_l_mInA",
            "review_date": "2016-10-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Yoga Hosers, A sort of review",
            "content": "Yoga Hosers, A sort of review So what IS Yoga Hosers, eh? It's a new movie from Kevin Smith, he of Clerks, Dogma and Mallrats fame. Oh, and he also made Jersey Girl. But we'll forgive him for that.The movie is a kooky story of two Canadian convienience store clerks (played by Kevin's daughter Harley Quinn Smith & Lily Rose Depp) who battle cloned Nazi creatures in an attempt to keep their home free from bad things.It also features Johnny Depp (under very heavy prosthetics) playing one of his oddest roles yet, a nazi hunter vowing to help the two girls clean up their town.It's a harmless enough flick that requires little to no brain power to watch and enjoy. Most of the jokes are at the expense of Canada. There are a lot of sight gags and quick references that you won't pick up all in one viewing. So it's a movie you'll probably have to buy on DVD or blu-ray to get the full experience of.Smith himself plays the Bratzi horde (also under heavy prosthetics) and his Hollywood Babble-on cohort Ralph Garman plays the leader of the Canadian Nazi invasion.There are some interesting cameos (including Stan Lee, Vanessa Paradis & Haley Joel Osment) but it's a movie best watched purely for the fun of it. If you are a fan of the Hollywood Babble-on podcast, you'll get a decent amount of enjoyment from the movie (and Garman's stock impressions).Neither of the lead girls are spectacular actressess but they weren't hired for their abilities. There's a lot of nepotism going on in this here movie. Why else is Kevin Smith's wife playing a role? Or his dog Shecky? Or his best friend Jason Mewes? Do I need to know anything about Kevin Smith or his films to enjoy this film? A working knowledge of his humour would help, but it can be enjoyed without that. It is a sequel to his movie Tusk but I haven't seen it and still found this movie enjoyable and watchable.Can I see this movie in a cinema near me? Probably not, it is available on Netflix though.Should I watch Yoga Hosers? If you want 90-ish minutes of fun and mindless enjoyment, hell yes.Is the movie as good as it could possibly be? That's a no, in my opinion. A couple of the scenes with the girls singing could have easily been removed without hurting the plot and shortening the running time.How do you rate Yoga Hosers? Out of 5? I'd give it a 3. Out of 10? I'd give it a 6.5. Ralph Garman's jokes and impressions raised the overall rating for me.",
            "review_date": "2016-10-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "So nein it's definatly a ten!",
            "content": "If you were a fan of marvel's infinity war, you're going to be left speechless by this tasty morsel.Yoga hosers is stunning and brave political commentary in these turbulent and trying times. Bold and unapologetic, which is striking for a film about canada, this film can and should be watched as the shawshank for the millennial generation.If tusk was a perfect metaphor for animal rights activism, Yoga hosers stares unblinkingly into the political climate of modern Canada, diving into the real issues: metaphorical tiny sauerkraut filled brat clones of nazi scientists, and the scourge of art criticism which drives good men to evil.the acting was phenomenal, with Depp again reprising his role as Guy Lapointe, again with the same delicacy and skill expected by such a seasoned talent. The main standout however was Kevin smith, we knew he could direct, but man, what a fantastic actor. The Stan Lee cameo was also the best in any marvel movie thus far, I would explain it, but I don't want to spoil one of the most heart wrenching scenes since Marley and me.The best part, this movie is loosely based on true events, Adrien Arcand being a real person who apparently actually wanted to send Jewish Canadians to the Hudson bay. I had initially thought that this part of the film was a bit far fetched for such a grounded work, however it's just another example of reality being stranger than fiction.don't be sorry about liking this film, it's not the yoga way.",
            "review_date": "2018-11-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Say it ain't so...",
            "content": "Wow, Kevin, what happened? This makes Mallrats look like Citizen Kane (for the record I loved Mallrats; at least that was funny). Not one laugh in the entire film. Spent 90 minute trying to make a Canadian joke (and didn't get there).",
            "review_date": "2018-09-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fun if Unexpected",
            "content": "There has always been a hint of Troma underlying Kevin Smith. That love of the absurd. This film really cuts it loose. I can get where some people wouldn't enjoy it, a lot of people don't get Zombie Ass, Attack of the Killer Tomatoes, and the Toxic Avenger. But, if you do love stuff like that, over the top horror movies who are really sneaking jokes in there, Smith delivers exactly that. It may not be a New Jersey film that flows with quick one liners, but it hits in its own right.I put off on watching this because of the reviews, I kind of robbed myself.",
            "review_date": "2021-07-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Quite possibly the worst movie I've ever seen",
            "content": "I realize that I am not the target audience but I wonder what self respecting teen girl will watch this movie and think it's good and I am a Kevin Smith fan but not a teenage girl. There is something genuinely poor about watching American actors do poor...very poor impressions of Canadian stereotypes. I personally have been in Canada my entire life and have never heard anyone say \"aboot\" instead of \"about\". It also strikes me as odd that the movie pokes fun at the Canuck and is shot in America. If your going to make such fun of Canada it would be nice to put some money into the economy of the country you are so freely jesting about, after all this is the \"True North\" trilogy. I found with surprise Jen Schwalbach to be unexpectedly funny and the bright spot of this...film, this may have been in part that her role plays into what seems to be the \"angry feminist\" persona she seems to have in real life. This seems to be a family pet project movie, a trilogy in which both the Smiths and Depps can make family memories and say that daddy's and daughters made a movie together but this certainly doesn't add stock to most involved. I would also fear that it hurts the image of the average Canadian and seems to make us look like the idiot nice guys however I'm not sure enough people are going to see this movie for me to care to much. Definitely one of the if not the worst movie I've ever seen. Hopefully \"Moose Jaws\" marks either the upswing of a new season in Smiths career or the point in which he is no longer given money to make anymore movies....I'm guessing neither though.",
            "review_date": "2016-12-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I really wanted to like this movie!",
            "content": "'YOGA HOSERS': Two and a Half Stars (Out of Five)Writer/director Kevin Smith's new comedy-horror flick; about two teenage girls that must battle a supernatural force, while still maintaining their after-school jobs at a local Manitoba convenience store. The film stars Harley Quinn Smith (Kevin Smith's daughter) and Lily-Rose Depp (Johnny Depp's daughter); and it costars Johnny Depp, Justin Long, Ralph Garman, Austin Butler, Tyler Posey, Natasha Lyonne and Tony Hale. It's the second film in Smith's 'True North trilogy' (following 2014's 'TUSK'), and it was ravaged by critics and fans alike (marking the lowest point of Kevin Smith's career). I think the movie marks the lowest point in Kevin Smith's career!The story takes place in Winnipeg, where two 15-year-old girls, Colleen Collette (Lily-Rose Depp) and Collen McKenzie (Harley Quinn Smith), both work after-school jobs at the Eh-2-Zed; a convenience store owned by Colleen Collette's father, Bob (Hale). The girls are also huge yoga enthusiasts, and are extremely excited to be invited to their first senior party; by a boy named Hunter (Butler), that Colleen McKenzie has a big crush on. The Colleens are very disappointed to find out that they can't attend the party, when Bob makes them work that night. The girls are also horrified, when they're attacked, at work, by one-foot-tall Nazis (that are made out of bratwurst). They're yoga teachings may have taught them the skills they need to defend themselves though. I really wanted to like this movie, and I have liked all of Smith's other films; to somewhat varying degrees, but usually very much. I'm especially disappointed I didn't enjoy this movie (very much at all), because it does costar his daughter; and both she, and Lily- Rose, are good in the flick. The film is just not funny; it's interesting at times, and has some clever ideas, but it's just not funny (in the slightest). I hope Smith is able to get his career back on track, sooner rather than later; I really want to like the upcoming 'MOOSE JAWS' (the third installment in the 'True North trilogy') as well!Watch our movie review show 'MOVIE TALK' at: https://youtu.be/hx1_SKfiNWs",
            "review_date": "2016-11-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pains me to say this, but this is the first one of his movies that I didn't really like.",
            "content": "\"I'm not even supposed to be here today!\" Colleen C (Depp) and Colleen M (Smith) are two normal teenage girls working at a convince store. When a late night party at the store goes wrong they end up in jail, with a story that no one believes, except for the legendary Guy Lapointe (Depp). Now it is up to two clueless teenagers to try and save the world. I am a huge Kevin Smith fan, and look forward to any movie of his. That's why this pains me to say this, but this is the first one of his movies that I didn't really like. I did enjoy aspects like the callbacks to his older movies and Ralph Garman's impressions. On the other hand the movie really seemed to drag in some parts and really had no point at all. I hate saying this but this is my least favorite Kevin Smith movie so far, and I've seen them all\u0085even Jersey Girl and Tusk. Overall, as a Kevin Smith fan I really only enjoyed the callback aspects of this movie, the rest seemed pointless. I sadly give this a C.",
            "review_date": "2016-11-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I LOVE YOGA HOSERS. Fight me.",
            "content": "I don't care, I love this movie. I thought it was ridiculously funny with it's absurd humor, funnier upon a second viewing. I loved the texting girly teens being in an Anthrax cover band and making \"I'm The Man\" damn near better than the original song. I loved the cheesy 90's horror movie vibe, I loved the set design and the Eh-2-Zed uniforms, and I loved very single last performance in this movie. Literally every actor in this movie took their role so seriously and that made it even funnier and so enjoyable. Particularly Justin Long, Johnny Depp, and the yoga hosers. This is unashamedly, unironically, one of my favorite movies. If you are capable of watching a movie just to have fun in this era of all these pseudo-psychological bs movies that take 80 minutes to get to the plot, then maybe you'll like this movie. If not, go watch Pulp Fiction again. But please don't let all the bad reviews discourage you from checking out this gem. It's genuinely fun. I'd recommend it more to young adults who love badass female characters and great rock soundtracks, but regardless it's just fun as hell.",
            "review_date": "2020-03-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Tale of a True Tortured Artist",
            "content": "Although on surface level this film may appear to be nothing more than an unserious flick, however I would argue otherwise. In order to truly grasp the deeper meaning of this fine film one must turn to the tragic background of the main antagonist - longing to become a world-famous artist, Andronicus Arcane finds himself continuously shot down by harsh art critics that fail to understand his vision.Fed up with continually being lambasted, he withdraws into himself, eventually coming to the realization that he wasn't born to merely be a fine artist, but rather a creator of life. He then goes to work creating bratwurst beings pulled from his own DNA that he then freezes along with himself, timed to wake up within a hundred years. However, his plans take an unexpected turn when him and his bratwurst companions are unexpectedly awoken by the two Colleens.Eventually he decides to unveil his newest sculpture to the Colleens, and upon receiving constructive/good feedback he feels as if at last he has made it. He puts his bratwurst creations into the sculpture, directing his children to destroy his haters. However, things take a dark turn quickly when his own creation turns on him and kills him.It's a tale full of unfulfilled dreams, personal anguish, and pathos. It's a modern Greek tragedy - Frankenstein reinterpreted - a story that delves into the depths of man and his relationship to his creations, and how man has the ability to overstep his boundaries and into the realm of God, only to be shot down for his hubris. The film also discusses the topic of life and art - how art imitates life far more than life imitates art, and how art is the giving of oneself over wholly to expression, whether that form of expression be visual or otherwise. One can only achieve a masterpiece when one creates something that is timeless in its truth, and honest in its perspective concerning the human experience. That being said, I must be obliged to give the film a 10/10, as I felt that it has explored the depths of the human soul and experience.",
            "review_date": "2018-11-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Its supposed to be absurd",
            "content": "I loved it. I loved that it was a family affair all around. Kevin Smith's daughter, and then Johnny Depp, Lily-Rose, and even Vanessa Paradis. Come on, how much fun is that?! I loved Johnny Depp's character, freaking hilarious. I was cracking up at all the Canadian jokes and bad accents. Justin Long and Adam Brody were fun as well. Its absurd, and its a bunch of puns. Which is exactly what I love. Plus it had a pretty awesome Scott Pilgrim feel to it. This a good movie for easy laughs, awesome puns, fun easter eggs, and actually some damn good comedic acting. Its supposed to be over the top and they did it right. #Soarrynotsoarry I loved it!",
            "review_date": "2016-12-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Half Ok",
            "content": "Let's just be honest, this movie was made as a joke right? I saw Voyagers... So maybe this movie was one Lily did for fun with her friend and her dad. This movie started off funny but then it got boring and pointless very quick. Crazy this came out BC (Before Covid) and still sucked. Lily and Harley reminded me of Romy and Michele in this movie. But even that movie was funny, this one was only half funny. Loved Johnny and his constantly moving mole, but his accent and character had me completely lost. If I had a penny for how many times he said \"Like\"! Not sure why he was even in this movie at all, it was not for his acting abilities that was for sure. So no, I have not heard the podcast so maybe that is why the jokes flew over my head. I doubt many others have heard it either. I am not a fan of anything Mr. Smith has done so yeah. At least Justin Long was very sexy as a yogi and I loved his character! Also seeing Stan Lee was a shocker, but then I realized this came out in 2016. I would not recommend this movie unless you just love Long, or Depp like I do.",
            "review_date": "2021-05-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I Loved this!",
            "content": "I love Kevin Smith!!! I saw Yoga Hosers in the theatre and sometimes it's nice to see a movie that requires NO brain power! Johnny Depp did it for me! I love the Guy LaPointe character! I just laugh hearing him talk! I thought it was awesome!",
            "review_date": "2019-03-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An utter waste of time/space/energy",
            "content": "Wow. As a previous fan of Kevin Smith, I am completely gobsmacked as to how this was ever created. This was unbearable. The time, the energy and the money put into this production is a complete and utter waste - and everyone associated with it's existence should be ashamed of themselves. How they managed to get such revered actors to be a part of this production is completely incomprehensible. Kevin Smith - it appears as if you're trying to mock current cultural traits but you have failed miserably to get the message across. You were once absolutely awesome - but seem to be on a steady decline. Shame, man. I hope you find your spark again.",
            "review_date": "2017-06-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Daddy's Little Girl",
            "content": "This film is an hour and a half of everything I can't stand from our society. You know what I'm talking about. These kids who see more of a cell phone screen than they do the real world. They are so desensitized to life that it leads me to believe that the stiff acting from Harley, probably isn't acting at all. So Yoga Hosers is like watching today's youth attempt to work, while in reality caring about nothing more than the next text on their phone, making party plans, and then, oh yeah, stopping an army of Kevin Smith Sausage monsters.The constant puns and jokes relying on people still thinking puns and jokes about Canada are funny, just, well, aren't funny at this point. That era ended with the South Park movie and how long ago was that?For whatever reason, the movie sort of feels dated too. Like this should have been a made for TV movie on Nickelodean in the 90's. It's a family movie that's for sure, but it's a movie for Kevin Smith's family.If you want to make movies just for sake of making movies or creative release, do so, and watch them in your own house. Don't expect me to pay for them. So, to continue on, we are going to be force fed his daughter, not by the movie industry, but by Kevin Smith himself, whether we like it or not.It's cool man you can put out movies with no compromise, I get that, I do, but who are you trying to prove that to?Word of advice... ...I can go eat something I have never eaten before and give my toilet an original never-before-seen piece of crap, but in the end, it's still a piece of crap.My full review: https://www.youtube.com/watch?v=8CScvW0jtvw",
            "review_date": "2016-09-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tasteless",
            "content": "I made it into this film less than 5 minutes, including the production companies. The opening garage band song was supposed to be a \"highlight\" at least, if you wanna listen to a couple of teen girls sing a lame song written by \"The Beastie Boys\". What is with Americans disliking Canada in the first place? A couple of characters using \"ah-boot\" would have been okay, but literally every single one of them? You could have dropped it after the first go, \"Sorry ah-boot that\".",
            "review_date": "2020-10-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Boring nonsense.",
            "content": "I'm giving it 2 stars.One because of Johnny Depp having the bravery to participate in this garbage (father's love earns a star) and Stan \"The Man\" Lee's cameo (Stan Lee always upgrades any movie by one star).That's it.The movie is garbage.You'll never recover the time lost watching it. I know I never will.I'm supposed to write a 10 line review, but even reviewing this movie is a waste of time and web space. I hope the girls find something good in which they can show their talent. My advise to Harley Quinn Smith: Get away from your dad's projects.",
            "review_date": "2017-02-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Didn't completely hate it, but i think is the worst movie by kevin smith",
            "content": "I completely love clerks, mallrats, chasing amy and dogma. I truly do, clerks is maybe my favourite movie ever. I think since jersey girl, the only movies i really liked by him were zach and miri and red state - tusk and clerks too are enjoyable.This one...well it's kevin smith being lazy. The plot is kinda weak, like all the characters. The two girls are atually fun to watch sometimes, i don't think they were that bad acting, but the scenes looked more like mini sketches than truly scenes from a movie. It has a comic book vibe all over it, but if comic books were made in a sloppy way. Most of the jokes were not very funny let's be honest, and almost everyone besides the girls and johnny depp had like 2 lines of dialogue or something.I don't know... there's some positives here, i don't think the idea i bad and i actually liked the chemistry between the girls.However the plot and the other characters should have been better developed, and i think it was just kevin smith not caring about that. Anyway, maybe i'm not major disappointed because i wasn't expecting a big thing oit of it. I don't know if mr.srmith will ever make a great movie again, I'm still hopeful. This one is a light comedy with a very shy horror and nonsense tone that i think it had potential, but it wasn't reached at all. Still, and again, i think the two girls are the best of the movie.",
            "review_date": "2020-03-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Have To know Kevin Smith",
            "content": "These movies are only amazing if you are a true Kevin smith fan which means all forms Of his media. Some of the funnier parts in the movie are references to his podcast. The placement of these scattered through the movie are perfect. Listen to Smodcast, Edumacation, Hollywood babble on and others to really find it funny. Kevin Smith is not in a period of his filmmaking career where he cares about making money. He could Produce the rest of his life and be perfectly fine. He's making movies he wants to make and his podcast listeners want to see. Not as good as tusk, but I think he made this one for his loyal fan base and wanted to work with his daughter.",
            "review_date": "2016-12-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This was great in 2019.",
            "content": "I loved this. I've watched everything kevin smith has made. This was no disappointment. I was in tears at one point. maybe it got a 4.3 because some people have no sense of humor and standards for movies are really high. I'll laugh at anything like the joker 2019. every time joaquin lol so did I. +4twent0 you'll enjoy it just as much as I did. Don't watch the trailer it's better that way.P.S If in NY see WICKED w/4twent. kevin suggested that and it was epic.",
            "review_date": "2019-12-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not that bad",
            "content": "I really can't understand all the one star ratings. I guess people just don't have a sense of humor anymore. Yeah, it's a dumb movie, but that a part of the joke. It's supposed to be dumb. That's the whole idea. Stop taking yourselves so seriously, allow yourself to laugh at yourselves. I enjoyed this flick, the girls were cute as heck and Johnny Depp was a hoot.",
            "review_date": "2020-03-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awesome, ridiculous, Funny as hell",
            "content": "Imagine Clerks meets Ghoulies. It was supposed to be a kids movie, but ended up as a midnight movie that kids can't see yet. It was hilarious. It was weird. It was different. There were callbacks to old movies. You might want to re-watch some of the old stuff before going in to watch this one. There were awesome cameos. The king of cameos makes an appearance. The story is pretty original like most of Kevin's stuff. Killer Nazi sausages try to take over Canada. How high do you have to be to come up with that? Silent Bob high. That's how high you have to be. Johnny Depp, his daughter, and Kevin's daughter had me holding my sides at times. Please see this and enjoy it as much as I did. Huge Kevin Smith fan, so yes I am a bit biased, and I was lucky enough to see this at a sneak preview hosted by the man.",
            "review_date": "2016-06-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you like Kevin Smith content, go see this movie.",
            "content": "Let me say that first and foremost you should absolutely go see this movie if you're a fan of Kevin Smith movies. Being a fan of his many podcasts and TV shows doesn't hurt either because while this is a fun movie, at no point did I as an audience member forget that I was actively watching a Kevin smith film. The best part of this film for me was that it was abundantly clear that the people on set involved in this movie were having a good time making it which is absolutely refreshing. The only downside, though minor, was that it didn't really pull me into the universe that this film lives within as much as it could have. But hey! GO SEE THIS MOVIE AND FIND YOUR OWN OPINION OF IT! Mr.Smith, onto Moosejaws please :)",
            "review_date": "2016-08-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wunderbar!",
            "content": "Definitely not basic! Completely stupid, inane, and wonderful! Take off eh!",
            "review_date": "2021-04-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The cast was excellent and quite funny movie",
            "content": "I noticed most of the other self proclaimed critics here gave very low star's to this movie and I wholeheartedly disagree with their opinion. The lead girls were perfect for their role and I had no idea where the movie was going to wind into ..very good movie ..thank you Kevin Smith for being so entertaining !",
            "review_date": "2019-01-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "In yoga, you're right and they're wrong.",
            "content": "They have targeted two things in this film. Mocking yoga and attacking (film) critics. They knew the film wouldn't be good enough for film critics, so they used an indirect attempt to slam them. And for as yoga, martial arts would have been a better idea, though they wanted the spiritual effect. Especially from the perspective of two current generation girls.\"This is so basic.\"This is a spin-off of the director's previous film, 'Tusk', starring Justin Long and he can be seen in this as well in a different role. A tale of two high school girls who work part time in their father's mini supermarket. They are passionate about yoga and got a best yogi to train them. But when they encounter an unexpected threat, they exploit everything they have learnt to tackle the situation. That's the story, and then follows the conclusion.With this, Johnny Depp's daughter Lily Rose was introduced to the film world. I did not know he was in this, I had to find out after I heard his voice, but he was in a completely unrecognisable appearance. Father, daughter working together, that too in her first film, really wonderful to hear, but the choice of film does not convince. Seems a good concept, but a bad story and execution. Particularly, it was like a 40 minute television episode, so for a feature film it was too short and stupid. At least it is watchable, but not worthy, so I suggest you to make a right choice if you haven't seen it.4/10",
            "review_date": "2016-11-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "good effort",
            "content": "Not exactly sure why so many people dislike this movie. It is a fun horror light movie it is a very good vehicle for the two main stars. It's certainly not redefining any genre or a super deep movie. But what it is, is a movie with charm, fun and memorable moments as well as a bad guy that chews the scenery in all the right ways.",
            "review_date": "2021-12-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Kevin Smith...tisk tisk...",
            "content": "So, if you want to make of us Canadians how about coming here and talking to one. I've lived and been all over this country and we don't sound like the ignorant dialogue in this movie.\nI really appreciate the USA comments sticking up fer us. At least they are aware of their real neighbors from above.\nPull yer head out of yer ass Kevin smith. And talk to some really Canadians.",
            "review_date": "2018-11-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Literally a re-imagined clerks, Kevin Smith's new addition to the true north trilogy places his and Johnny Depp's daughters in a Canadian Quick-Stop, Eh-2-Zed.",
            "content": "In Kevin Smith's \"Yoga Hosers,\" his second addition to his ambitious True North Trilogy, a Canadian, gender-swapped clerks is born! And let there be no mistake, I don't mean that in a \"damn, they did what to Ghostbusters?!\" kind of way, I mean it in the most awesome way there is. It was truly an awesome film, even with some cameos, (Jason Mewes as a rogue cop, Johnny Depp reprising his Oscar-wining role as Guy LaPointe, and the best of all, Stan Lee as an annoyed police dispatcher!) and a nod to his brain-child clerks. When the Colleens are destroying the Bratzis, Harley Quinn yells \"I'm not even supposed to be her today!\" And don't forget the insanely accurate impressions done by Ralph Garman's time displaced Canadian third Reich leader, including Sylvester Stallone and I believe Martin Short. Not sure, it sounded like him. I read something that said \"Kevin Smith's Yoga Hosers is an apology to the critics.\" Don't listen to that, man. The critics should be apologizing to you.",
            "review_date": "2016-08-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I can't give this more than one star.",
            "content": "If you're going to make an ethnicity-based comedy, which I personally think is still fine and the SJW people can get suck their thumb in a corner, then you should at least put a tiny bit of effort into mimicking the ethnicity properly. Right off the bat, if you're going to put your American own kids in the lead roles, take two days to teach them how to pronounce \"about\" the way Canadians actually pronounce it. It's a little like \"aboat\", but there are some extra nuances you can easily learn to copy. Ethnic comedy only works if the stereotypes are portrayed realistically. You can't do Mickey Rooney in Breakfast at Tiffany's anymore. It just comes off as a lazy gimmick, and let's face it, that's all this was: a very lazy gimmick to get two famous people's kids a foot in the door of Hollywood, nothing more.",
            "review_date": "2018-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bottom of the Barrel Comedy, Nonexistent Horror",
            "content": "I'll be frank here, I actually kind of liked Tusk, a little more than Kevin Smith's previous effort Red State, and far more than this cinematic abortion which serves as somewhat of a sequel or spin-off to Tusk as the second film in his so-called \"True North\" trilogy which focuses on various oddball and quirky characters living in Canada and constantly saying \"eh\" and \"aboot\" because that's how Canadians talk right? Well apparently in Kevin Smith's world they do, and that same stale, over-used recycled bilge which quickly got old in Tusk is ramped up to 1000 here.The basic plot, if you can call it that, focuses on the two teenage female clerks briefly seen in \"Tusk\", both named Colleen, played by Johnny Depp's daughter Lily Rose Depp and Kevin Smith's daughter Harley Quinn Smith, who work at some random convenience store in a small town and are forced to use their carefully honed Yoga skills to take down a new reign of terror in the form of 1 foot tall \"Bratzis\" essentially human/bratwurst hybrids who do nothing but shoot Nazi slogans like \"Heil\" and kill people by literally crawling up their ass and into their stomachs. No, I'm not joking, though I wish I was. If that wasn't horrifying enough, you've got two Satan worshipping high school seniors who attempt to murder/sacrifice the two Colleens and have no relevance to the plot beyond that and to add in some more quirky Canadian humor to the mix with some extra \"ehs\" and aboots\" in for good measure.So yeah, that's basically the film in a nutshell, the writing and dialogue and acting uniformly is terrible, although given how hammy this film is I think it may have been intentional. Justin Long and Johnny Depp both return in this film, with Justin Long now playing the girls moronic Yoga instructor and apparently now he's Canadian too, and no mention of the events of the last film are ever mentioned by him or Depp as Guy Lapointe, so it puts the theory that this is a sequel or spin-off to Tusk into question as well, if everything else wasn't bad enough, the film lacks any cohesion or consistency and I personally did not find it funny at all, or scary but I don't think they were even attempting to be frightening. The satanic stuff and the killer \"bratzis\" come off more as a cheap attempt at dark comedy than any legitimate horror.",
            "review_date": "2021-04-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Load of cow crap",
            "content": "This is load of cow crap. its worst than that actually.",
            "review_date": "2018-09-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Yoga Thanosers?",
            "content": "This complete twist sequel to Marvel's Infitey Wars with the goal of answering many of the audience's question's after the end of its prequel while simultaneously entertaining and educating viewer's on Canada's history and culture leave those who watch it hungry for more! The characters' frequent references to the past events in the Marvel cineverse (such as referencing how \"nobody lives in Canada (after Thanos snapped)\" shows how a real western culture would respond to events such as these happening.The referencing of calling Guy Lapointe \"Batman\", as well as Adam West's Batman's role in this movie even further cement this movie in the timeline of other Marvel movies, as does the striking similarities between the cryogenic freezing of Andronicus Arcane and that of Captain America, and the fact that this scientific principle is now being used by a bad guy (and by Nazis rather than against them) instead of a good one is a great innovative twist! The implication of the same serum that was used by Captain America being stolen and used instead by Andronicus as well after his splintering from Hydra leaves the viewer pondering the moral quandaries of cryogenic freezing. After all, just like Steve Rodgers is the first true avenger, is not Andronicus the last true Nazi? The parallels between this and not just Infinitty Wars but Captain America'd movie as well speak to this film's quality.Smith's references to Frankenstein's monster made great connections between the metaphysical morality of man, and modern marvel culture and cinematic consistency. This film is a fantastic addition to any avid marvel fan's collection!",
            "review_date": "2018-11-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Yoga Hosers\"- An often entertaining but fundamentally aimless mess. It's the best Charles Band movie never made.",
            "content": "Maybe the most surprising thing about Kevin Smith's \"Yoga Hosers\" is that despite the onslaught of near-constant dismissal and hatred from professional critics and general movie-going audiences alike... I actually couldn't bring myself to hate this film. It's bad. Oh, it's bad. But it's got just such a quirky sense of spunk and enough likable performances despite the ridiculous material, that I'd be lying if I said the film didn't give me some pretty consistent chuckles and giggles throughout its relatively anemic runtime. True, I could feel my IQ dropping by the minute and there was many a head-scratching moment... but hey, at least I had a bit of fun with it before my brain atrophied into nothing.In a lot of ways, I think that the big problem here is that this isn't really a standard Kevin Smith film. No, this is a classic Charles Band Full Moon picture... along the lines of \"Gingerdead Man\", \"Evil Bong\" or \"Blood Dolls\"- films you go into knowing it's going to be ridiculously stupid but entertaining. It just happens to have been written and directed by Smith, which I think is throwing a lot of people (myself included) off.We follow best-friends Colleen Collette (Lily-Rose Depp) and Colleen McKenzie (Harley Quinn Smith), two teenage Canadian girls obsessed with their phones and yoga, as they are pulled into a desperate struggle against various evil threats in the form of murderous classmates, foot-tall living bratwurst and Canadian Nazis. They must seek the help of the somewhat unhinged and bizarre detective Guy LaPointe (Johnny Depp), a half-crazed man who has a small-albeit-notable connection to the Colleens in the past, to try and save the day.The second in a trilogy of Canadian-themed horror-comedies from writer/director Smith, \"Yoga Hosers\" is an incredibly troubled film that has just enough charm and just enough chuckles to make it worth a sit for hardcore fans, especially as it is now available for free on the streaming service Netflix. It's the sort-of film that if you have an open mind, you will get a kick out of it even if you don't exactly \"like it.\" As I mentioned above, the film has many parallels to Charles Band's filmography, which I think is part of what makes me a bit more forgiving towards it. I kinda knew where Smith was coming from- he was seeking to create a low-budget freak-shot with creatures and critters tormenting a small group of characters in isolated locations with a lot of low-brow humor mixed in, just like many of Band's works. And so I could forgive some of the more obvious flaws.To give credit to the film's strengths, I do think our two lead actresses work quite well for the material and they are both quite charming and witty on-screen. And I do think their relation to director Smith and co-star Johnny Depp lends an additional bit of fun to the proceedings. This stops feeling like an attempt at a legitimate movie at a certain point and starts to feel more like just a group of friends and family having fun, putting on a show that they're making up as they go along. Every person who grew up shooting awful \"movies\" on their parents camcorder as a kid or took a High School class in video- production because they wanted to make movies will likely pick up on this, and it adds quite a bit of charm to the proceedings. I also did find the movie fairly funny, though never quite as consistent as I'd like. This is a case of \"let's throw 10 jokes at the audience and see what works!\" Yes, there's a lot of clunkers and a lot of misjudged gags that fall flat as a pancake, but there's definitely some laughs to be had, and I won't complain. It probably got about a dozen chuckles and giggles from me, in addition to two or three genuine laughs... And those are chuckles and laughs I wouldn't have gotten otherwise.But then the plot and the pacing kicks in, which is where the film falls apart. Look, I'm fine with silly story lines and goofy concepts. I really am. I was perfectly open-minded when I found out the lead villains were living sausage \"Bratzis\", because I like a good B- movie now and again. But the film's structure is just messy, messy, messy. Things don't always add up, some sequences feel wholly superfluous, and the actual plot of the movie doesn't really kick in until the halfway mark, which is pretty troublesome. The pacing is also shaky at best. It rockets by in the most haphazard of ways, there's a lack of natural build-up in tension, and even the climax seems to come and go at random. The film really could have used another draft or two in the writing stage to create a more organic progression of events, and the editing needed to be slowed down drastically.Still, I'd be a liar if I said I didn't have a decent amount of fun with the film. Perhaps it was perverse fun, as I knew the film is one of many flaws... but I had fun nonetheless. The lead characters are just charming enough to keep you invested, the occasionally giggle will likely be enough to keep particularly open- minded viewers engaged... and hey! Like I said, you can see it on Netflix for free, so you can't complain too much.I'm giving \"Yoga Hosers\" a very middle of the road 5 out of 10. Will most people hate it? Probably. But does it have some value and merit? I think so. Maybe not a ton, but for what is essentially just a big, goofy side-show made by a group of family and friends wanting to put on a show... you could do a lot worse.",
            "review_date": "2016-12-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I used to believe in Santa, does that count",
            "content": "Yoga Hosers could only come from Kevin Smith. I'm not sure anyone else has noticed how the movie works on so many levels. Director Smith stars his daughter (as well as Johnny Depp's Daughter) and all boys / men are monsters trying to kill their daughters. There is a subplot about Canadian Nazi Sausage monsters. Everything is satire or works on many levels, like Buffy the Vampire Slayer meets Clerks. Of course there are the usual Smiths tropes: hockey, the same acting family camp, references to other movies, ridiculous monsters, writing that requires dissection. The visuals, though too repetitive, also make an interesting point bout the stare of teenagers addicted to social media and phones. Smith is such a rebel filmmaker that his uniqueness shines bright in a year filled with franchise sequels and unoriginal ideas. Best movie ever? well no, but as a campy vehicle for their daughters, Depp and Smith both shine.",
            "review_date": "2016-12-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Actually pretty good",
            "content": "If you can get past the strange creature going up people's backs then it's actually not a bad movie. The two girls Johnny Depp's daughter Kevin Smith's daughter actually they're pretty good in the movie. You've got some good guest stars that pop up and I don't really understand what all the hate is about.\nOf course I'm a Kevin Smith fan, and I like watching actors act and I enjoy Smith's writing. And I enjoyed the acting in this movie I enjoyed the actors having fun and playing. It was entertaining.\nI would probably give this movie about a seven stars but I'm giving it 10 stars to offset all the ones stars in the haters that just give it one Stars just because they're d!cks. So yeah Kevin Smith's Yoga Hosers 10 Stars",
            "review_date": "2019-11-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "So Bad - Its Good",
            "content": "Saw the \"premier\" in NJ. First off, let me say Kevin Smith seems like a genuinely good dude. Actually - he is undoubtedly a great dude. Listening to him speak about film and the whole process was inspiring. It seemed like I was hearing one of my buddies talk. Very down to earth- but at the same time he'll throw out something ridiculous - but hilarious. Listening to him speak was arguably better than the movie. For the record- I wouldn't consider myself a HUGE Kevin Smith fan. I like him- but you know. I'm not one of the die hard Kevin Smith fans. I respect the hell out of him. I must admit though, I haven't seen his latest films.\"Yoga Hosers\" had its moments. Johnny Depp is almost unrecognizable and had everyone laughing. For him to go from Black Mass to this is mind-boggling. Talk about versatility. The two main girls might not sit well with people - but with Mr Smiths prologue - I understood their performances. They are supposed to be brats who are obsessed with their cell phones. The movie has a bunch of cameos whom people will recognize from the past and enjoy seeing again. It also had a cool 80's arcade vibe. It's obviously not meant to receive Oscars or critical acclaim; but, nevertheless, it's a fun flick- with some interesting performances. The story itself is silly- in that unique Kevin Smith way. I did feel bad after at the Q and A when he kept saying he was a crappy filmmaker and that he has no skill (comparing himself to Tarantino). I know he's being humble, but it just didn't seem right hearing that. Clerks, Dogma, Mallrats? Classics man. He represents NJ well. I wanted to shout out but I was working. I think he just felt it was important to acknowledge the haters, and I respect that.So- yeah. This is a tough movie to review. The best way to put it - it's so bad it's good. I think that's the point. It definitely had funny moments. Even some creepy ones. It is a comedy though - before anything else. It's a movie for all ages really. The theater was sold out and cracking up. I do kinda wish they used less CGI - but for this type of story - it is somewhat necessary. It's a shame people have labeled it as \"a play date\" just because of the father /daughter + father/daughter thing. That's what Mr. Smith said at least. Overall, if you're feeling up for a weird, funny B - movie and you're a fan of Kevin Smith and Johnny Depp- I suppose it's worth a watch. I had a good time. Like I said- it's so bad it's good.6/10P.S. Very cool to learn Kevin Smith and I were born at the same hospital. Riverview Medical Center.",
            "review_date": "2016-08-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "#keepitinthefamily",
            "content": "I was looking at the IMB score and I was completely confused. Did we all watch the same movie? Then I entered reviews to find out what's it all about and now I'm not confused anymore - now I'm pissed! If you've never seen anything from Kevin Smith, or if you did and you did not like it, please, do not even try to watch \"Yoga Hosers\". This film is the second part of \"The True North Trilogy\" (the third part is still not out) and therefore requires that you see \"Tusk\" first. And for a true understanding and complete experience of any Kevin Smith film, it is required that you already saw all of his previous movies. If you did not, you have no right to give negative comments on this one. True, it's not a masterpiece on the level with \"Chasing Amy\" or \"Dogma\", but it's side by side with \"Clerks\" and \"Jay and Silent Bob Strikes Back\".\"Yoga Hosers\" takes place in the same \"world\" as \"Tusk\", and takes a part of the story and several characters from it. The film mocks the teens today and is full of references to many of Kevin's previous films, as well as a bunch of other stuff from pop culture. Johnny Depp has taken the role in this trilogy because \"Chasing Amy\" and \"Jersey Girl\" are his favorite films, and his daughter is the best friend of Kevin Smith's daughter since kindergarten. And guess who plays the main roles in this movie. If you saw \"Tusk\", perhaps you remember a teenage girls working as saleswomen in \"Eh-2-Zed\". These are Harley Quinn Smith, daughter of Kevin Smith, named after Joker's villain lover from \"Batman\", and Lily-Rose Depp, daughter of Johnny Depp and Vanessa Paradis (who also appears as a history teacher). There are also Depp's son Jack and Kevin's wife Jennifer, who's Harley's mother both in the movie and real life. Real family movie. There's also Kevin Smith himself, in the role I mustn't mention to avoid spoilers, as well as Adam Brody, Tyler Posey (Kevin is \"Teen Wolf\" fan and character Gordon Greenleaf is written specifically for Tyler), cameo appearance of Stan Lee, and of course Jason Mewes. The story is \"so bad it's good\", completely crazy and over the top, but what essentially makes this film ingenious is a continuous array of references to all sorts of things, that have led me to tears of laughter. So, gentleman haters, it isn't Smith who lost his genius, but you are the ones who got old in the meantime and lost your sense for humor.8/10",
            "review_date": "2018-04-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "millennial clerks",
            "content": "Start with a concept of a film about a shallow teen subculture. The main highlighted features of this subculture are a high dependency on the so called social networks (and consequently on interfaces such as cell phones), and pretty much a 'basic' ignorance of all things past (anything older than a couple of years), be it history, cinema or music. Basically a narcissistic self-centered and self-absorbed standard view of the millennium generation. Wrap a film around that concept, and make it work on two distinct layers:the film is written by Smith, who has a close but external view of that generation portrayed. On screen we have his surrogates, with Vanessa Paradis, Jennifer Smith and Johnny Depp. These 4 are literally the Parents of the girls (Jennifer is also the on-screen mother). The 4 provide the generational gap which (co)creates most of the jokes;The girls play themselves, with an (intended) ironic twist. They play themselves laughing at themselves.the whole film is conceived as a launching platform for Harley and Lily-Rose. The main setting being a Clerks-like store binds the dear themes of Smith and the new generation. In between layers there are a number of forgettable jokes an sketches about Bratwurst Nazis with Kevin's face, Yoga teachers without self control, Canadian jokes (with the usual American disdain) and imitations of old cinema stars, unknown to the girls (the imitations are really well done). The only actor with a real sense of humor timing and expression is Depp, and the real gap for me here is not between generations, but between how well Depp comes out of this, when compared to the others. Except from what he does, pretty much everything else won't stay.So you end up with a shallow film about a shallow theme, which was, i suppose, the intention.Whether or not you laugh at the jokes will depend on how old are you, how much do you understand the references (as usual with Smith's geek driven films) and where you come from. I didn't get a lot from this.",
            "review_date": "2016-09-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Could Have Used a Script Doctor, Maybe",
            "content": "Two teenage yoga enthusiasts team up with a legendary man-hunter to battle with an ancient evil presence that is threatening their major party plans.Although I know I am in the minority, I actually really enjoyed \"Tusk\". With that in mind, I was sort of looking forward to this film. I was well aware that Smith has had a decreasing batting average over the past 20 years, but every so often he pulls out a gem. This is not, at all, one of them.The Instagram (or whatever) mini bios were stupid, there is far too much Johnny Depp, and the celebrity impersonations -- while funny -- goes on for too long. The Satanic subplot was either completely pointless or I missed something. Hopefully if \"Moose Jaws\" gets made, we see a bit of a rebound.",
            "review_date": "2017-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Should Have Been Straight to Home Video",
            "content": "I really expected more from this movie. Having known going in that Smith would be directing his own daughter and her friend; I thought more care would have gone into the script. I was sadly proven wrong.The jokes fall flat with the repeated jabs at the Canadian accent and Canada in general. The premise is pretty dull which I can sit through if the impending payoff at the climax is worth the wait, but it wasn't. It almost seems as the though the villain was an after thought with the main goal being to showcase the two leads. Now this script is bad and I don't even mean so bad it is funny. No this is bad like I honestly feel for the cast, bad. There was only one scene in the whole movie that I can say I didn't cringe and that was when the girls spoke with their principal. Sasheer Zamata was probably the best out of everyone in the movie.This movie gives the feeling that audiences were not supposed to see it. That this was just a fun home movie for the Smith's and Depp's. As I can see that they had a good time making it after watching the director's commentary.I can easily advise people to skip this one as their are zero redeeming qualities... well unless you like seeing an A-list (Depp) celebrity give one of his worst performances.",
            "review_date": "2019-02-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautifully Bizarre",
            "content": "Alright. This movie is getting a lot of unnecessary hate. I've read things like \"why would they let their kids do this\" etc. Look at this movie for what it is, and stop trying to fit it into a category. It's a family friendly, funny as hell movie, that both I (teen girl) and my father, adore. It's one of the few movies to actually cast the teenage characters as teenagers and not adults, as both girls are 17. The movie isn't intended to be taken seriously. It is not Tusk. I mean for gods sake the monsters are Nazi sausages that shoot up your butt. Does this sound like a movie to be taken seriously? No.It's a parody on life. And it's done well. It's not over sexual, which honestly major props to Smith, because for some annoying reason it's become a staple that all horror movies have to have sex and that's really getting old. It's also not gory, and doesn't contain jump-scares, other things that have become annoying staples lately. The dialogue is dry because it's true to reality. Have you seen the teenage population lately? And no, before you all flip out, I'm not some 35 year old who thinks this generation sucks. I'm 16, and female, and flipping loved this movie. Have you seen a girl separated from her phone? And the bit with the batman impression, and the girls not getting it? That was funny. Because it's true. Both my dad and I were laughing, and I promise you, Depp, and Smith, both father and daughter had a great laugh after it. This movie is also a bonding experience between family's. And it comes through on screen. Yea, the plot may be weak, but that not what this movie is about. The plot for the entire \"Scary Movie\" franchise is weak and no one is complaining there. It's geared towards a special kind of person. Smith himself has said it's more for teen girls, and yes I agree. I can almost promise you, both girls helped him write this script. If you didn't like this movie, than maybe you took it too seriously, or maybe you're just not into that kind of humor and that's OK, but this movie IS Kevin Smith. This movie is beautifully bizarre. And he did so well with it.",
            "review_date": "2016-12-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "weird Kevin Smith",
            "content": "Colleen Collette (Lily-Rose Depp) and Colleen McKenzie (Harley Quinn Smith) are the store clerks from Kevin Smith's previous indie Tusk. The Colleens are best friends for most of their 15 and a half years. The sophomores are excited being invited to a 12th grade party until they face miniature Nazi bratwurst soldiers.This has a few fun moments mostly by the clueless phone-obsessed girlie chemistry of the Colleens. The \"About\" can get repetitive. Kevin Smith is making the broadest of Canadian references like naming the high school Terry Fox. Oddly, he tackles a real name from Canadian Nazi past. Like Red State, he doing political satire in very broad strokes which doesn't really work. He goes down some strange paths which is not to everybody's tastes. If anything, the girls work best doing more realistic stuff like getting their phones taken away. The Colleens are wacky enough that they could exist in a more normal story. It's just that Kevin Smith is on weird trip and not everybody will enjoy the ride.",
            "review_date": "2018-02-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "YUCK.",
            "content": "Alright. So did you have to have that PopUp Instagram Screen introduce EVERY Goddamn character?! Holy s***. Like constantly hearing the Notifications of a strangers phone.\n\"Movie\" was absolutely tripe. Like the worst of the worst 90's Porky's remake with characters and a plot that no one cares about.\nAvoid, Swerve, Run into a bus if it gets you away from this mess. Yuck.",
            "review_date": "2019-04-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sucks",
            "content": "As much as I love Johnny and Lily, this is easily the worst movie I've ever seen. The entire feel of it just made me uncomfortable. Especially the fight scene between the clerks and those weird little sausage things. The acting sucks, the story line sucks, the set sucks, everything about Yoga Hosers sucks. I never want to see this movie again.",
            "review_date": "2021-04-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Crappiest Movie I've Never Seen",
            "content": "I didn't watch Yoga Hosers, but why would I? Millenial kids (who are already a disgusting, narcissistic, phone-obsessed, apathetic generation), Kevin Smith (who lost whatever potential he had years ago, and (blech) it's set in Canada. Perfect recipe for disaster.Not to mention, the trailer is cringy as heck and the acting is atrocious.Avoid this movie at all costs. I would love to say I lost 88 minutes of my life, but I didn't even put myself through the agony of watching this steaming pile of doggy excrement. AVOID AVOID AVOID!!!",
            "review_date": "2017-06-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beware the Bratzis!!!",
            "content": "I was pretty interested in seeing this movie because it looked weird and silly. I watched it with some friends last night and it was in fact very weird. The first 40 minutes were slow to me and filled with Canadian jokes. Some of them I didn't fully understand. This film is a spin- off/sorta kinda continuation of Tusk. The first half of this movie is just about the Colleens singing in their garage band, working at a convenience store, doing yoga, and trying to go to a Senior party. The real fun starts when the little Bratzis show up. (A Nazi in bratwurst hot-dog form) It was so silly and random and saved the movie. Johnny Depp returns from Tusk as his character Guy LaPointe, a bumbling French detective. The Colleens and Guy must team up to defeat the Bratzis and their leader before they take over the world. If you like weird quirky off-beat comedies, you might enjoy YOGA HOSERS!!!",
            "review_date": "2016-12-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What in the Hell did I just watch?????",
            "content": "If I ever meet Kevin Smith in person, I'm going to have to give him one of those insult loaded compliments \"Hey Man, I'm a really big fan of your earlier work!\"What's bad about the film: Just look at any of the 40+ reviews, most of them hit it about right.What's good about it: - Lily-Rose Depp & Harley Quinn Smith have a very natural repartee with one another and would really shine in a better film.Reprising his role from 'Tusks', Johnny Depp initially brings a little more flare to the character, but it does fizzle out after awhile.",
            "review_date": "2017-01-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Insanely funny",
            "content": "If you are offended by \"Family Guy\". or get \"triggered\" by minor offenses, or think Confederate statues should come down, perhaps you should avoid this film.I've seen a number of horror movies that start as comedies. I'm not even sure \"horror\" should be listed as a genre here because, while there are some scenes resembling a horror movie, this never stops being a comedy. It later turns into a comedy/adventure, but horror? Not really. And while there is graphic violence, you can't really consider it anything more than cartoon violence. These are cartoon characters, after all, even if they are live-action.Good acting? I think so. It's never anything more than silly but everyone seems to do quite a good job of being silly. I can't even say nothing is anything approaching Oscar quality. Well, yes I can, because you have to be far better than this to be mentioned for Oscars.The girls are adorable, in an edgy sort of way. Johnny Depp is a quirky Quebecois (or at least he has a French accent). And Ralph Garman, whoever he is (I know the name only the credits of \"Family Guy\"), does really good impressions and gives us a campy ubervillain. Stan Lee, even though this doesn't seem to be a Marvel movie (though it does reference DC's Batman several times), has an effective cameo as the uniformed man who answers a 911 call. And can that really be Haley Joel Osment? I didn't know he was the nutty Nazi until later. Justin Long as the yoga instructor has never been wackier. Or even wacky.Is it family friendly? Nein! Nein! So nein it's almost a ten! Words were bleeped so often in the version I saw that it was occasionally hard to follow the plot. The entire cover of Guy's book had to be blurred and they couldn't even really talk about what it was about. And this movie is anything but politically correct. On the other hand, the Black principal has an attitude, as do so many characters. She reminds the girls their lives aren't so tough, imagining a movie like \"12 Years a Slave\" that describes their ordeals. Insults that made it past the censors include \"basic\" and \"hosers\". Yes, the girls get called \"yoga hosers\" a couple of times.Music? There's a lot of variety. The girls are actually talented singers if heavy metal or rap-metal is your taste (not mine) and especially on soft rock (trying to get on the good side of Colleen C's dad). Despite the angry tone of their music, the girls seem to be enjoying themselves. The girls also seem to like the dance music with auto tune that Justin Bieber does. Classical music shows up for the explanation of the evil plot, including the romantic song in the opera where Elmer Fudd wants to kill the wabbit. I think I also recognized the music from that scene in \"The Shining\". I've only seen that scene. And the Canadian National Anthem gets a metal version.It's a silly mess, but fun.",
            "review_date": "2021-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Funny & Very Entertaining Movie! I loved every minute of it.",
            "content": "It started with a very positive singing performance. Then the story began to unfold very nicely and very clearly. But this is certainly NOT a movie for KIDS! I rate it as an R... or PG-13 at least! The script was really made for adult-thinking persons that's why I say it's so funny... ONLY adults can understand the jokes which are mostly green. The SONGS used were very good especially for the ENDING song which I liked BEST! Watch this and you'll also enjoy it for sure. Please wait for the movie credits to finish 'cause some MORE funny stuff are also there. And NOW, after watching this film, I think I like Canadians more than ever! Lol! Johnny Depp's daughter's (Lily-Rose Depp) acting and singing was wonderful. And Harley Quinn Smith was totally good too! Rating this as a TEN means I think I really GOT my money's worth because it's a feel-good-after-watching movie NOT only for kids but also for TEENS and ADULTS. Thank you for reading my REVIEW.",
            "review_date": "2016-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A solid Gremlins tribute",
            "content": "I know a lot of people will hate me for this, but this movie isn't that bad. The lead girls are cute (not to mention hot), the Bratzis (Wunderbar!) along with Ralph Garman steal the show (Depp was OK). Is it perfect? Of course not. Tusk is better than this. Yet, when you ignore the negatives, the atmosphere is very Gremlins like. All in all, Yoga Hosers is in my opinion a solid and enjoyable creature feature tribute.Now my only problem is Moose Jaws. Not because of the concept, but because of the fact that Kevin Smith hasn't said anything about it. I wish him good luck on his next endeavors.",
            "review_date": "2017-03-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It was definitely... something",
            "content": "After viewing this film, to expand on my previous comment of \"does Kevin Smith even care?\", it truly seems like Kevin Smith is throwing hands with the critics and he is going to continue to make what he wants, whether it is necessarily \"good or bad\" in the eyes of the public. His dialogue in this film, specifically delivered by Ralph Garman playing villain Andonicus Arcane, refers to \"critics of art\" saying terrible things about his work. Which can be seen as a parallel to how critics have received Smith's most recent films... Sorry Kevin, I am mostly going to agree with them on this. 'Yoga Hosers' was not entirely a horrible film but it was no where near a good one. Kudos to Kevin's slam at critics though.'Yoga Hosers' had plenty going well for it like its pop-culture references and the ever-standard crude humor. Early on in the film, it seemed to be on the right track to be a cult-classic stud but that steam would quickly run out as the introduction of the Bratzis came to fruition, and that only took about ten minutes or so. I like to think I have a good tolerance for ridiculousness but 'Yoga Hosers' became a bit too much with its concepts and especially effects. Low budget or not, I can only handle so much cringe-worthy moments and be able find myself entertained.However, I can not say 'Yoga Hosers' is a complete abomination and I have not hinted at that in the least bit. Again, Kevin Smith will always have hidden innuendos to his films and I always have found an appreciation of this. Also, I think Lily-Rose Depp and Harley Quinn Smith (Playing the leads Colleen Collette and Colleen McKenzie) were quite charismatic and engaging in their roles. If anything, this film was a presentation of their talents no matter the platform they were given. I hope to see the two young ladies excel in Hollywood in the nearby future. Lastly, as most would know, Kevin Smith has a trademark style of delivering his comedy. I found it hit-and-miss for me but I can not deny that he made me laugh out loud a couple of times throughout my viewing of the film.-- Oberrated.com --",
            "review_date": "2017-04-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Defensive Yoga",
            "content": "There are way too many negative reviews on this made to be silly movie by Kevin Smith! It's a dark, insane, surreal, quirky comedy. Plus it's an adventure for two fearless chicks that are yoga students to the kewlest yoga instructor ever, played by Justin Long.There is no need to get into the story as there are too many twist and turns to relate. Just be aware that at one point in the story anal invasive Nazi sausages become a real threat and the heroic girls, the two Colleens, must take down these monsters with what they learned in yoga!I laughed!!!",
            "review_date": "2016-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sausage War Party - Wunderbar",
            "content": "Going into this expecting something like Clerks would be a disservice. To the film of course, but most importantly to yourself. Just watch this for what it is. A silly movie who does not take anything seriously. You may like or hate the fact that Smith and Depp have their daughters in this. Some actually are obviously annoyed by the fact they got roles just for being related to someone. But then again, they also had a smaller part in Tusk. As the same characters I may add.Whatever your feelings for the casting process is, will determine your feelings towards the movie itself. Also your willingness to be silly and take the jokes for what they are. The effects are also mostly to be taken with a grain of salt. There is not much of a story, not that you suspected any different ...",
            "review_date": "2017-04-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Oddball comedy/teen/horror with Harley Quinn Smith and an outstanding final act",
            "content": "RELEASED IN 2016 and written & directed by Kevin Smith, \"Yoga Hosers\" stars Harley Quinn Smith and Lily-Rose Depp as teen besties from Winnipeg who enjoy yoga and work at a convenience store. When the two Sophomores are invited to a Senior party they have to deal with Satanic slashers and, worse, a horrible evil buried beneath the earth hailing from WWII. Johnny Depp is unrecognizable as legendary man-hunter Guy LaPointe while the director plays the diabolical one-foot Bratzis. This quirky comedy/teen/horror flick is a spin-off of 2014's \"Tusk\" with the same cast, but I haven't seen that movie yet. Anyway, curvy cutie Harley Quinn Smith is one of the main highlights of \"Yoga Hosers\" and the camera doesn't fail to accentuate her spunkiness and beauty. (There's no nudity or sleaze, thankfully, and understandably so since Harley is the director's daughter). She was 17 during shooting (or ALMOST 17).Aside from Harley, the first 55 minutes are fairly entertaining, but kinda curious in an \"I'm not sure if I'm gonna like this movie\" way. It's the entire last act where this flick soars with ingenuity and laugh-out-loud scenes. Ralph Garman knocks it out of the ballpark as the mad creator of the Bratzis, Andronicus Arcane. THE FILM RUNS 88 minutes and was shot in Santa Clarita & Los Angeles. ADDITIONAL CAST: Justin Long plays the yogi while Tony Hale plays the father of one of the girls and Natasha Lyonne his babe. GRADE: B+/A-",
            "review_date": "2017-12-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "#funmovie",
            "content": "Great, just watched on Netflix after searching \"Kevin Smith\". I loved this. Big stars, fun music. Enjoyable! For those of you seeking deeper thought, (take-off, eh), & just watch this later. #superfun.",
            "review_date": "2018-09-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I have no idea what I just watched",
            "content": "Wow. This is like someone gave Kevin Smith a lobotomy and it worked.\nTerrible acting. Terrible writing.\nCasting your daughter and Depp's daughter must cloud ones judgement.",
            "review_date": "2019-04-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Them goddamn yoga hosers against the bratzis",
            "content": "From a purely objective point of view, ''Yoga Hosers'' could be seen as one of the worst movies ever made. The story is extremely weak. The movie has several big plot holes. The acting performances are somewhere between average and terrible. The characters are quite one- dimensional. The special effects are extremely cheap. The movie is filled with stupid stereotypes about Canadians and Germans. The German, French Canadian and English Canadian accents are also stereotypical and while a few expressions and pronunciations are employed correctly, they are completely exaggerated and annoyingly repetitive. The movie also rips off other films, characters and even actors. Even the soundtrack seems to have been put together in a very odd way where the main actresses perform famous classics in mostly horrid ways.And yet, from my subjective point of view, I adored ''Yoga Hosers'' from start to finish and not only despite but because of its flaws. If you are ready to switch your brain off, have some fun and watch this movie with a few friends, this is an entertaining, light-hearted and surprising party movie. It doesn't have the diversity, intensity and uniqueness of its predecessor ''Tusk'' but it has its very own style and might also have a small but faithful cult following in the years to come.The movie literally got me right from the start. I'm a huge fan of metal music and its diverse sub-genres, so when the film opened with a reinterpretation of Anthrax's famous ''I'm the Man'', I got my first positive surprise. The new lyrics for the song aren't very innovative but they are amusing and the idea itself is quite cool.The characters in this movie are so stupid, stereotypical and one- dimensional that it's actually funny. From the horny, obsessive and possessive stepmother over the angry, closed-minded and severe physical education teacher to the hysterical, megalomaniac and narcissistic villain, you get a whole series of hilariously entertaining characters. I somehow liked the so-called school hottie who actually looks plain horrible and who pretends to be a gentleman and turns out to be a satanist. His slightly retarded sidekick is another stereotypical character that is so over-the-top that I had to laugh about him all the time.Throw in a lot of interesting story ideas and you get a very unusual potpourri. The historic references to Canadian national socialist Adrien Arcand show that the makers of this film are actually familiar with Canadian culture and history. The movie also makes fun of cheap magazines and the obsession of media with stars and starlets in general. The idea to center this story around two bored, cynical and naive female store clerks who are addicted to their cell phones and judge everyone and everything around them is also quite interesting. It's actually interesting to live this story from the point of view of two unsympathetic anti-heroes that symbolize stereotypically everything that might be wrong with the the new millennium's generation. The older generation isn't portrayed in a more favourable way though and is often depicted as conservative, grumpy and prejudiced. The film also lives from its numerous cameo appearances featuring Johnny Depp as weird French Canadian police officer, Justin Long as surprisingly aggressive yoga teacher with weird marketing ideas and slogans and Kevin Smith as the face of an army of miniature monsters made of sausages and sauerkraut.This leads us to the incredible story line. A follower of French Canadian national socialist Adrien Arcand, a doctor from Berlin called Adronicus Arcane, purchases some land in Winnipeg, builds a subterranean palace, creates an army of tiny sausage warriors with sauerkraut blood, places himself into cryopreservation and plans to wake up one hundred years later in order to conquer North America. He wakes up three decades too soon after a power shortcut caused by a band performance in the back-store of a convenience store. He decides to send out his sausage warriors to kill people and get their body parts to build an ultimate monster suit for his sausage warriors. Unfortunately for the villain, he is living below the convenience store of two bored female clerks, naive high school students and yoga enthusiasts who will team up with a strange French Canadian police officer to save their country.Let's put this simple. If the story sounds like a cool idea to you, you will like this movie like I did. If you thing it's the worst thing you have ever heard, do yourself a favour and avoid this controversial cult flick. If you are somewhere in between, watch this at your own risks. I can't wait to watch the final instalment of the True North trilogy called ''Moose Jaws''.",
            "review_date": "2016-12-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Super, preposterous fun! (albeit for a super, preposterously select audience)",
            "content": "I admit I had fairly high expectations before I started watching. I thought 2014's 'Tusk' was overly focused on being odd, in the process letting comedy, horror, and otherwise value slip away - but two highlights were the terrific performance of Michael Parks, and the scenes featuring two drily sassy convenience store clerks. Naturally I was delighted to learn that the Colleens got their own movie, and even observing apparent poor reception couldn't dampen my enthusiasm. I'll say this: I can understand why 'Yoga hosers' hasn't sat well with viewers at large; it's a very particular, weird blend of flavors that Kevin Smith has swirled together for this film. It's a lot to take in, make no mistake - but for all the bizarrerie, I'd be lying if I said I didn't like it. To be sure, it's not the most essential film in Smith's body of work, but as far as I'm concerned this is a whole lot of fun!Smith's comedies tend to be a very acquired taste as it is with their mix of references and insider knowledge, otherwise smart and snappy dialogue, and gross-out humor, all tailored to whatever narrative is on hand. 'Yoga hosers' goes several steps further, bringing in truckloads of exaggerated Canadian mannerisms and amplified or satirical cultural ploys; a parodic take on modern teen and high school interests, behavior, and attitudes; creature feature stylings, a la 'Critters' or 'Gremlins'; lightly making fun of the bare minimal knowledge the least-well read of viewers may boast of German language and history; and cheeky mockery of white people yoga. To all this add pointedly over the top CGI to realize the miniature monsters, though to my pleasure this is also balanced with some practical effects, too. This is to say nothing of embellished graphical overlays in both early exposition and at the climax, and quirks written into the characters, that are unremittingly self-indulgent. I can't specifically begrudge anyone who checks out 'Yoga hosers' and finds it not to their liking - it is, without question, the most flagrantly overcooked amalgamation of wild ideas that Smith has ever conjured. It's surely only a small niche audience that could best appreciate this. For anyone fitting into that group, however, this is an absolute blast!As ludicrous as all this may be, none of it is accidental or sloppy. One could reasonably argue that this is the most carefully, precisely crafted picture of Smith's oeuvre, simply on account of how every aspect of the screenplay blows past convention and reason in such very specific ways. While the broad strokes of the narrative lovingly pay homage to revered horror flicks of yore, the characters, dialogue, and scene writing, and the details of the story, revel in being as outlandish as I think they could be. Every other element of the picture is bent toward building upon that foundation, and shoring it up. More than anything else I altogether adore the cast, as no matter how small their parts are everyone in the impressive ensemble wholeheartedly leans into the bombast and takes advantage of their moment to shine. Above all, of course, Harley Quinn Smith and Lily-Rose Depp are an outright joy as the Colleens, living up the roles of strong-willed and sardonic but ditzy teens. Whether the heroines are miffed at the people around them, having fun together, or neutralizing tiny terrors, Smith and Depp demonstrate fine range and personality that in my mind shows they're capable actors who deserve much more to come their way.Not least with the addition of songs that Smith and Depp themselves sing, there are instances of definite kitsch littered throughout, mostly in the first act as we meet the cast of characters. But I do very much like Christopher Drake's music, and no matter how overdone some touches may be, it all looks great to my eyes. The production design and art direction at large are very well done, along with costume design and hair and makeup work. Kevin Smith's direction is as sharp as ever, and if anything seems even more polished as he arranges some shots that echo genre flicks of past years. Lighting, cinematography, editing, and sound design are all marvelous. Frankly, down to every last facet I think 'Yoga hosers' is utterly fantastic. For my part the most severe critique I would impart is that some aspects are just a tad too much, and would have benefited from a degree of self-restraint. If that's the worst detraction I have to make, though, then I dare say the movie is doing pretty well for itself.The entire feature is effectively a lesson in stacking absurdities, and following through on a vision regardless of how others may perceive it. It's certainly brash to pursue film-making and storytelling in this way, and I've watched no few titles that did so and which, to be blunt, failed to measure up in any meaningful way in my estimation. The broad low regard for this reflects that many viewers think 'Yoga hosers' likewise falls short; I, however, am very happy to say I disagree. All the tomfoolery and immoderation is paired with keen intelligence and wit that far much more so than not means Smith's wacky whims are wonderfully entertaining, where they could have been just downright excessive. From the writing and direction, to the cast and their acting, down to every bit of work that went into the production from behind the scenes, when all is said and done I honestly love 'Yoga hosers,' and I look forward to watching it again! Highly recommended!",
            "review_date": "2022-08-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best movie on a budget",
            "content": "Yoga Hosers is by far the funniest movie I have seen in a while. Based off the title I wasn't sure what to expect, but I was in for a surprise the moment I realized the store was called Eh-2-Zed. As a broke, easily entertained college student this movie was a perfect way to take a break and just laugh. When we realized that the Nazi sausages were called completely we all completely lost it. This movie was so a joy to watch and although people do not like it it can be entertaining to most people. I recommend watching Tusk first, but also don't watch Tusk. Moose Jaws in the next movie in this cinematic universe and it sounds like it'll be good. We're all wondering if it'll be dark comedy like Tusk, comedy like Yoga Hosers, or something completely different.",
            "review_date": "2017-01-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "you want (( Movie ))? watch this ...",
            "content": "see... if you looking to my profile in twitter you will notice I'm considered one of the most biggest movies reviewer in KSA,the problem is that also i'm knowing as hard minded in giving rates to movies people always say to me like 'what i want' in movies and why hardly i give big ratings, there is many things should be in a movie so it make it PERFECT like (( Yoga Hosers )) i will tell you dear reader what those:- 1- acting natural and not being scared at all - Lilly Rose and her friend in movie let you feel that they are not acting at all, the way you see them laugh and stuff you will naturally feel it as they not acting even they post in movie their first takes, also you will feel that they was having fun making this movie, this is important to make the movie even more success! 2- start strong, stay strong & end strong - this movie Literally will not make you get bored all the way till the end, even boring conversations will make you laugh ! 3- more stuff to see - i watch this movie twice, in the second time i discovered stuff that i didn't notice in the first watch... and i don't mind at all watching this movie third forth and fifth time etc...i don't know how to thank team yoga hosers, making something that I really REALLY liked !",
            "review_date": "2017-02-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "By Far His Worst",
            "content": "I generally like Kevin Smith films, namely because they tend to be somewhat different, and sort of go against the grain, but this one really seems to suggest that he has lost the golden touch that he had back in the day. I would say that most directors sort of go through these stages, but the thing is that Tarrentino has never really made a bad film, despite the fact that none of them have really reached the peak that Pulp Fiction had.Another thought that this film was made simply so that his daughter, and Johnny Depp's daughter could have a film in which they were leading roles. If that is the case then I would suggest to both of them to pretend that this film was just something that they did as a high-school project and never, ever, speak about it ever again.Mind you, it doesn't mean that this film didn't have potential - when somebody described it it actually sounded really outlandish, that is until you watch it, or should I say try to watch it. To be honest with you, I stopped halfway through to go to bed and found myself struggling to finish it off, which I did, but I have to admit that a part of me felt that I had literally wasted my life in doing so.Look, Kevin Smith is a pretty good film maker, and he certainly does have a cult following. The interesting thing is that despite his movies bombing at the box office, he still manages to get the money together to make more of them. However, the box office isn't the only measure of the success of a film, just as a rating on IMDB doesn't necessarily dictate how well a film is going to do either (just have a look at Adam Sandler).However, this film was bad, really bad. I suspect it is probably because it was rushed. Personally, Smith should have spent a lot more time developing the idea because it could have worked really well. However, it pretty much ended up bombing. Mind you, that doesn't necessarily mean that I won't watch any of his other films, it's just that I'm certainly not going to be ever watching this one again.",
            "review_date": "2021-11-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not what was expected",
            "content": "Oh wow sausage nazis, reallly? I mean tusk was one thing but this? Idk man, I feel like you could have made this movie without using nazis as a plot device. Good writing for most of the dialogue though. Banter on point, transitions and bios on point. But the whole premise is kinda brain mush. I wanted to like this movie but found it pretty difficult. I like the settings and the music and the soundtrack was good.Most of all of this was good, except the meat and bones, the plot. Nazis= bad is probably one of the most forced tropes there are. Clerks, and Jay and silent bob were awesome, full of adventure and comedy. The comedy in this was okay, but it was all glued to a pinecone which was hard to digest.",
            "review_date": "2021-07-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Aboot\"",
            "content": "Having the Canadian pronunciation of \"Aboot\" as a running gag got old after it was done once. The \"sorry aboot that\" scene a fraction of the way into the movie made me switch off... very disappointing for this huge fan of Kevin Smith. Stick to what you do best instead of writing bad films to cast your overacting kid in, Kev.",
            "review_date": "2019-07-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wunderbar!",
            "content": "More of a 'Tusk' spin-off than a sequel, this second Canada-set horror film from Kevin Smith focuses on the two convenience store clerks from 'Tusk' who find themselves up against teen Satanists and tiny creatures that kill by climbing through human bodies. As a narrative, 'Yoya Hosers' keeps jumping in different directions with certain subplots (the Satanists in particular) deserving of much more screen time, however, Smith knows how to make a zany comedy and the film only gets more interesting as the mythology surrounding the tiny creatures becomes more bizarre and complex. There is also an undeniable wackiness to their chants of \"Wunderbar!\" when exiting their victims and Smith films the clerk girls defeating the critters with lots of energy. The pseudoscience behind the creation of the creatures is incredibly silly though and if the film's low IMDb rating is anything to go by, this is not a film for all tastes. The humour certainly varies in effectiveness; same goes for the attempts to mock the limited cultural awareness of teenagers today and the difficulty of separating teenagers from their phones. The lead actresses are radiant enough though to keep everything chugging along. Some have complained about their casting being nepotistic, but Lily-Rose Depp certainly outclasses her father (Johnny) at least, who is even more over-the-top than he was in 'Tusk'.",
            "review_date": "2017-10-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best Film of 2016!!!",
            "content": "Great movie! Really loved this film probably my favorite film of 2016 so far really funny and unique! Also great acting job from Lily-Rose Depp and Harley Quinn Smith really looking forward to seeing more from them in the future! This is a great film if you love things from the 80s and 90s a really great nostalgia film! And i am a huge fan of Tusk and i think this was a perfect spin off of that and i think it was a really good idea to make a film revolving around the Colleens it was really unexpected but a really great idea! I'm really looking forward to Moose Jaws and cant wait to see where that goes and also i got to view Yoga Hoser at one of Kevin's early screenings and it was a blast!!!",
            "review_date": "2016-07-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "sequel of tusk",
            "content": "Seen it at the BIFFF of Brussels (Brussels fantastic film festival)it is well...quite different from tusk except if you are Canadian because again it is bringing up stereotypes unless you are OK with that kind of humor.Of course again it is a crazy story, has nothing to do with TUSK except the girls and Depp and that it is set in Canada.The story starts with a totally unlikely story, that sets the surrealistic theme.I think of course that a lot of people will not like it, but at the screening most of the reviews were like \"eh? what is that thing??\" or \"wow, i had a great laugh\". Me i laughed a lot especially the WW2 references that are totally nuts.Again as always with his films, go with an open mind, do not expect anything and let yourself drown into his universe.",
            "review_date": "2016-09-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you are not a millennial teenage girl, then this is not meant for you.",
            "content": "I think it's fair to not be too hard on this film because I can see the intent of it, and it's a really nice one.The movie was obviously made by Kevin Smith to give his daughter Harley Quinn Smith and her best friend Lily Rose Depp (who happens to be Johnny Depp's daughter) a bit of experience in acting and the whole process of film making. Some may sneer at that and say it's spoiled Hollywood brats using privilege to get what they want but that's honestly not very fair.Look at it this way, if you had kids would you not move heaven and Earth to give them everything? Would you not use any connections you have to help them follow their dreams? If not then I think you need to question your quality as a parent. Kevin Smith and Johnny Depp, who also stars in the film along with Vanessa Paradis (Lily Rose's Mother) and Jen Smith (Harley's mother), are nothing mote than parents who are working in the business that their children want to enter and so are doing their best to help the with that.Make no mistake though, being on a film set is hard work, learning lines is hard work (Smith is famous for lengthy dialogue) and I guarantee that both girls have been sat down by their fathers and told how hard, cruel and unforgiving this business is before this film went into production and are more than likely being extra hard on them.As for the film itself, well it's not great but then again it's not meant for my demographic (a 40 year old man) as the millennial teen centric theme just didn't click with me at all and I didn't think this was Smith's best work in the writing department either. The two leads are charming enough though with Lily Rose Depp in particular showing some good acting potential (no surprise there) but Harley Quinn Smith is likable and also very good in the film. One must take into account the this is a first time for each girl doing ANY of this and with that in mind it's a strong start. Also bear in mind that most actors worth their salt have made their start in films which have not exactly gotten great reviews.Speaking of reviews, the ones for Yoga Hosers are harsh, but I also guarantee than, like me, a lot of these people will have been around when Clerks was first released and as stated, this film is not for them. With that in mind, I'm sure it will become a firm favourite with girls aged 12-17 all around the world. Maybe something that they will grow out of eventually realise that it's not a great film, but will also be remembered fondly as being good girly fun.It's a shame that given the really good cast the film wasn't up there with Chasing Amy in terms of sheer quality, but this is a fun teenage comedy for fun teenage girls and with that in mind it does just fine. Maybe when the girls are a bit older the content will become a bit more mature.Yoga Hosers isn't a great example of film making, but then again neither was Masters of The Universe, Cyborg or Eliminators - films which, as a young boy I loved and I still love to this day despite their quality. It is however, a shining example of good parenting, and that makes me feel good about the film despite not really enjoying it.",
            "review_date": "2017-11-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not that bad",
            "content": "Interesting take on a spin off of a weird Kevin Smith movie. This movie got a lot of crap for not being Canadian but I don't think that was what Kevin Smith was shooting for. Worth checking out and by far not his worst movie.",
            "review_date": "2020-02-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Yikes",
            "content": "Yikes is all I can really think of to describe this. I love Kevin Smith, and I'm actually a fan of a lot of the people involved in this. But this was just really, really bad. There is no excuse for this to exist.",
            "review_date": "2019-09-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good movie",
            "content": "I really enjoyed it. Made me laugh. It's a movie I have watched again and continued to laugh.",
            "review_date": "2020-01-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Extremely well done.",
            "content": "Extremely well done. Meant to be a gut busting comedy and it is. But a very well known actor gives a masterful performance.In the cozy confines of a convenience store. Violent Nazi sausages have a horrific mission to carry out in this hilarious comedy. That might have a bit of a drawn out ending that is kind of annoying.",
            "review_date": "2020-01-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Colleens are threatened by Satanic dates and kidnapped by Canadian Nazis",
            "content": "The Colleen Coalition are acted by Harley Quinn Smith (yes, Kevin Smith's daughter) and Lily-Rose Depp (Yes, JD's little girl with the gorgeous Vanessa Paradis) in a tongue-in-cheek little movie by Kevin Smith. It's filled with ridiculous visual jokes and repetitive memes at times. However, I rank it in that special category of movies that are so bad, I enjoyed them. Both Depp and Smith family members are cast in this, with fun little cameos by an assortment of character actors. Justin Long as the Colleens' yoga guru, Yogi Bayer shows how capable a comic actor he is. His take on how yoga helps you cope with an uncooperative universe is worth sitting through the movie. If you haven't got a soft spot in your heart for silly Canadian spoofs then this isn't your movie. There's no hidden messages or symbols in the script, the image and the joke are the message.",
            "review_date": "2017-03-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nawt Funnay",
            "content": "A cute, petite blonde, and her dorky friend, mock and make fun of men. If you hate men, you'll like this movie. The film is racist against native Americans, sexist against men; and nawt funnay. It's okay to be irreverent; but it's rude to be mean. And if they think that we should have thicker skin; I'd hate to be the man who meets the cute, petite blonde in divorce court.",
            "review_date": "2022-05-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "witty Canadian teenage comedy with a touch of German Nazi sausages.",
            "content": "I received Yoga Hosers as an Easter gift and I thought at first that it looked really stupid because to me it looked like an Canadian train wreck with tiny German Nazi sausages. I come on IMDb and see that it got an 4.3 out of 10 and then I thought \"ok, this must be really stupid\". But in my opinion, i must tell you that that rating is just messed up. Yoga Hosers was a very, well, whats the word..unique movie directed by the fantastic Kevin Smith. it takes the modern day teenager and adds in its own Canadian flair which makes it one to enjoy. I was also shocked on how many recognizable celebrities were in the movie like Stan Lee, Justin Long, Sasheer Zamata and Natasha Lyonne and their characters made it even more enjoyable. overall, sure this movie did not receive a perfect 10 but i think it deserves at least an 6-8 star review because to me an 4.3 is just plain stupid and they for sure did not watch all the way through. and i still love Yoga Hosers that i have now seen it 2 times.",
            "review_date": "2017-05-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Trash with a fancy bow on it",
            "content": "There's not much to say about this movie: it could have been funny bur it wasn't. It had everything to be funny, yet failed.It could only work for a teenagers sleepover for its trash value.",
            "review_date": "2022-05-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not Smith's best",
            "content": "But a solid movie. It's cool seeing the dad's and their daughters work together to create something original and still likeable.",
            "review_date": "2020-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sorry Aboot That",
            "content": "Sorry that so many people didn't enjoy this movie as much as I did. I love Kevin Smith for bringing his entertaining and fresh (albeit bizarre) vision to a genre that tends to rely heavily on tropes and cliché.Yoga Hosers was more comedy and less horror than Tusk, and while I preferred Tusk for that reason, I can not fault Yoga Hosers for downplaying the gore and body horror and bringing up the laughs. It is stupid humor, it definitely is an acquired taste, but if you go in with an open mind then the movie is definitely worth the watch. Both Colleens are stereotypical teenagers who are obsessed with their phones and social media, but the characters are given just enough endearing qualities and development to make them bearable (and their friendship heartwarming). The movie has a rather star-studded cast and plenty of opportunities for pointing at the screen and saying \"I had no idea they were in this!\" Overall the movie was entertaining to watch, absolutely silly, and filled with A+ puns made off the name Ichabod.What keeps me from giving this a higher score is Johnny Depp's character. He was mostly unwatchable in Tusk and unfortunately he was included in Yoga Hosers even more. While the movie itself is supposed to be pretty ridiculous, Depp's character is just nails on a chalkboard. Scenes that include him heavily will most definitely make you want to turn off the movie. But if you can get through his performance then Yoga Hosers is a good movie to get drunk to with your buddies and enjoy.",
            "review_date": "2017-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Inside joke, and a few interesting cameos",
            "content": "My quick rating - 5,2/10. This is a very campy comedy/horror flick made by Kevin Smith. A couple years ago, Smith made a movie called \"Tusk\" which again was very outside the mainstream and really quite weird. Anyway, in that flick we were introduced to a character named Guy Lapointe (Johnny Depp) who reprises his role as a bumbling investigator looking into a case where a man is ripped apart from the inside (all I am going to say). He stumbles across two teenage girls who work at a store that happens to be the place where the dead man was last seen. The lovable \"Colleens\" have recently been tasked with watching the store instead of going to a big party, so the decide to bring the party to the store. Well, the party is all of two guys looking to get laid, or something along those lines. Maybe murdering them, who knows. But this is all more or less the subplot of the history of this store and the evil dolls that are roaming around killing people. If I sound confused, I am not, I am being somewhat vague and the movie is really just weird. This is not a bad thing, it definitely has its moments. This is obviously an inside joke for Smith and the whole group. Looking forward to part 3, now that I know there is one coming (end credits) so take this one in, check out Tusk first to be caught up, and next year will be \"Moose Jaws\" with the Colleens back again.",
            "review_date": "2016-11-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just Enjoy The Ride!",
            "content": "If you go into this movie trying to judge Kevin Smith as a movie maker and direction or editor or whatever, then you're gunna have a bad time. This movie has the feel of something done in a very lighthearted manner. It is more or less a movie made by Johnny Depp and Kevin Smith that is starring their blonde teenage daughters. Take this movie at face value and nothing else and you will enjoy it. I will say, if you enjoy poking fun at Canadians then you will enjoy this movie all the much more. That is essentially the heart of the film. But just enjoy the beauty of the stars, the ridiculous guest appearances, and the music is actually pretty good. It should come as no surprise that this movie leans much more on its unique cast than its ridiculous plot, but this also gives the film a much needed layer of comedy. As in, seeing these famous people in such ridiculous roles (Haley Joel Osment was my favorite). Overall, a fun movie to watch late at night or after a joint or two.",
            "review_date": "2017-02-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's A really Bad one",
            "content": "It's A really Bad one , I felt that I Lost my time on such a movie like this",
            "review_date": "2019-07-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Kevin Smith, what are you trying to say?",
            "content": "You can't take this movie seriously, as the story makes no sense at all. It's like a demented/absurd comic book, yet it's not fun. In the end, it seems Kevin Smith is trying to pack another story with tough females triumphing over stupid/inadequate males. Every male in the movie is an idiot, from the band's drummer to the nazi scientist, down to the police inspector. OK, this movie is probably aimed to teen or pre-teen girls, stimulating their riot attitude, but all in all it has a mid-late 90's feeling which can hardly appeal to teen girls in 2016. I wonder if anyone actually liked it.",
            "review_date": "2019-08-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Generic B Grade Nothing",
            "content": "Being a full Depp family outing, mum included, you'd think some effort would be put into lifting it to something above the bland. But nope - just plain bland B-grade horror-comedy which typically means its really neither to boot.And do you really want your little brother/son to play a walk-in obnoxious kid in his first screen outing? Hmm.Could have been something of a cultish kitsch. But nope. Wasted opportunity.",
            "review_date": "2022-06-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not Good-Bad, just Bad-bad movie",
            "content": "\"'Yoga Hosers' was a hate crime against Canada.\" -YouTube commenter debating the merits of Kevin Smith's MotU with meAnother one of those movies that's like, \"Who is this made for?\"",
            "review_date": "2021-12-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I've definitely seen better... but I've also definitely seen worse.",
            "content": "Watched it today. Harley and Lily were charming and did good. I wouldn't mind seeing them in other projects, ones that didn't involve their Dads. It was more odd than funny (or scary). But I didn't hate it.·",
            "review_date": "2017-03-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "nah",
            "content": "Are invited to a Senior party but they end up having to work at the local convenient store. They invite the boys back to the store for a party by they're attacked by some Nazi sausages.",
            "review_date": "2021-12-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's all aboot the sarcasm",
            "content": "Never heard of or seen anything about this movie, but was hooked from the start. \nIt's a satire that the critics don't get or maybe they just don't like it when they are called out for some of their work. \nOh well if you want to watch a movie that doesn't make you think to much but want to have a good laugh I highly recommend.",
            "review_date": "2018-10-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Poor Jonny...his career in free fall",
            "content": "Best part was at the end, when Canadian anthem was played...only great because it put an end to this rediculous movie...any comedy that involves Nazi's ...well...u Kno...is gonna suck...",
            "review_date": "2020-05-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The next Generation of Jay and Silent Bob",
            "content": "I think those girls are the next Jay and Silent Bob. Seriously, write some more (better) films for those two girls. Nepotism or not they've got talent.As for the movie itself, it wasn't my favorite Kevin Smith movie, but it wasn't my least favorite either (Jersey Girl anyone?). The Instagram character intros were spread out too much and Instagram wasn't really part of the movie other than those intros.I also think the Canadian jokes went a little too much. Eh? I'm not Canadian and I know that the stereotypical Canadian says \"Eh\" all the time, but I don't think it's really that much.Overall, I enjoyed the movie. It had much of Kevin Smith's normal humor and those girls really had great chemistry as best friends.",
            "review_date": "2016-12-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Expecting this to be terrible but was entertained",
            "content": "Lilly Rose & Harley are really funny in this movie & have such great chemistry together. The movie is silly but I was entertained & thought it was a fun film with some great jokes. Lilly Rose & Harley shine on screen & both are extremely talented. Watch Tusk first then watch this spin ofg.",
            "review_date": "2022-06-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's not for everyone...",
            "content": "I have to say, I really enjoyed this movie. I was entertained. At the end of the day, that's what a film is supposed to do. Is it a well crafted story? No. However, Kevin Smith himself has said this was supposed to be like an 80's B-movie and I think he achieved that. It did what it set out to do. If that's the case, can you really call it a failure? Obviously this film isn't for everyone, but that should be common knowledge with any Kevin Smith movie at this point. If you're up for a campy, ridiculous good time late at night, this is a solid choice.",
            "review_date": "2017-10-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Judge It For What It Is",
            "content": "I put this movie off forever. Not because I thought it would be bad, but simply because the story didn't seem like it would appeal to me. I'm going to break down everything into pieces because it seems most people are judging this as a \"Kevin Smith\" movie first and \"just a movie\" second. An artist doesn't have to stick to a niche just because you want them to.The acting: It's definitely passable. Some moments of the girls remind of iCarly, but it's not bad acting by any means. You notice moments when the kids (side characters included) really get into the head of their own characters with subtle movements and vocalizations. The one moment I didn't care for is a scene where Kevin Smith's daughter is talking to her mother, it simply lacks poise. Fix that and it's good.The directing: Kevin Smith is on my honorable mention list when it comes to my favorite directors. When asked, I usually place him somewhere in the top 10 for convenience sake because I watch everything he releases. There are a few things I think he could have shot better, however there is undoubtedly more good than bad. You can definitely tell he had fun with this project - and that alone made me enjoy the ride. He takes chances with angles that really pay off. Then a couple here and there that throw me out of the flow.Special Effects: Green screen played a big part in this film (which is common nowadays of course). To avoid spoilers, this could have been done better. Tracking is off a lot of the time and the effects stand out - though not painfully, but they do stand out.The writing: The God's honest truth is Yoga Hosers could have used one more draft before being shot. The dialog is King, per norm with Kevin Smith, but the story structure doesn't sweep you away like you want it to. It is also, by far, one of the most original movies you're gonna find out there today. That alone may make or break it for you.From a technical aspect, I'd give it a 7/10. From an entertainment aspect, around a 6/10.",
            "review_date": "2017-02-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nod to the Past",
            "content": "We explore the stars, imagery, and sounds of the past interspersed with some millennial culture. But there is a twist! Yeah, sorry-boooot that.Experience the Ready Player One of media. I would say Kevin Smith likes to share some iconic moments of the past with his friends, family, and fans. It is a fun twist on the \"kids these days\" dialog.I recommend this movie to the 80s child and those who heard the stories from their parents about the media they enjoyed growing up. If anything grabs you, find the reference and explore that part of history!",
            "review_date": "2021-01-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This movie is exactly what it wants to be.",
            "content": "Anyone who tells you this movie is horrible went into it with expectations of this movie being Clerks, and it never pretended to be. Smith made a movie that you can tell he made for exactly one reason, to have fun making a movie with his daughter, and there is nothing wrong with that. It's a movie that at times is so bad it's good.",
            "review_date": "2017-04-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Cast List is like a Family Reunion",
            "content": "From Producers to stars, to co-stars, to cameos... this movie was clearly a way for Kevin Smith and Johnny Depp to get their families together, and their best friends and costars, for some good laughs and fun.If you are a fun of either, respect this for what it is. Hollywood families bringing their family and friends together for a good time on camera, shared with us for some smiles and fan fare.You can stop reading here.Really, my only complaint, is that I could have written this review with several less sentences, without some of my extra descriptive wording, and yet I was required to get a minimum number of characters to post the review.",
            "review_date": "2023-02-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Basic Movie",
            "content": "That pretty much sums it up! It was not funny or clever- just a waste of time really. I fell in and out of sleep during the last 30 mins. Don't waste you time!",
            "review_date": "2021-09-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Dumb? Yep. Worth a watch? Yep.",
            "content": "I gotta say, this movie is ridiculous to the extreme. The plot doesn't make any sense, and the acting (probably more the writing) is just not good. But I had a great time watching it, and that's what movies (as far as I'm concerned) are all about. A fun hour and a half, but I don't think it will win any awards. If you have a couple hours to kill, give it a watch. I also like the backstory of the actors involved, that the main actresses are actually best friends since childhood. I've always been a big fan of Kevin Smith movies, and although I have not yet seen the previous movie in this line (\"Tusk\"), I don't think it necessarily needs to be seen before this one, as they provide plenty of references to it.",
            "review_date": "2016-10-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "???",
            "content": "WTF did I just watch? I refuse to include this in films by Kevin Smith...",
            "review_date": "2019-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Love Colleens/Hate Nazis",
            "content": "Haven't seen Walrus pic yet. Looking forward to it but enjoyed Yoga Hosers as a stand alone. The two girls are both adorable as actresses and in their roles. I predict film futures for both. Powerful focuses and presence. Drumming/Drummer what a major treat. Music perfect for entrance of satanist boyfriend. Totally enjoyed the peek into Canadian culture, products, anthem, sport. Probably have watched ten times and slowly picked up on silly details. Polka dots and missing beavers! JD inside another charming character! What's next? Enjoyed the Bratzi crawling up the stomach effect and the girls beating the sauerkraut out of them. On to creative yoga classes, I imagine Yogi Bear and Boo Boo would have enjoyed joining the girls in such fun. I have to mention Vanessa Paradis' role as Honors History teacher! What a voice, accent and all around beautiful actress! Downloaded some music there. Thanks to Kevin Smith for a fun adventure and bringing forward the impersonator education.",
            "review_date": "2022-07-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not that bad heh!",
            "content": "I actually enjoyed the film. Don't get me wrong, the film is very silly, has an odd pacing and some scenes stretch for too long. However, if you're in a good mood, in the right mindset or with friends around, you can actually enjoy the movie for what it is. The numerous cameos and the ever moving mole of mr lapointe can make your evening a bit lighter. Not a must see by any means, just an ok plan B.",
            "review_date": "2020-08-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Yoga Rules",
            "content": "Wierner babies my goodness Lough out loud funny! It took a bit to get into but goodness the celebrities that cameo are hilarious. I loved Jay and silent Bob among all the others. If you are not into those you are not gonna like this.It's gonna be a cult classic in like 10 years when the references are no longer relevant. I love that's it set in Canada! one thing to put it over the top it is just missing one person, Justin Timberlake! Make sure you have a back up phone. Yoga rules.It a boot time we have another movie like this that is just what it seems to be. Silly funny crazy odd relevant and updated for this generation. Think Bill And Ted.",
            "review_date": "2016-12-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "content": "I love how rediculous this movie is!",
            "review_date": "2022-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What were you expecting going into a Kevin Smith movie that is tied to the f'n walrus flick?! When you build a universe that's wild and cringe you're going to tend to be just as outlandish when extending that universe. \n\nDid people not expect a goofy, slap stick, weird, cringe movie after watching someone turn someone else into a fucking Walrus? \n\nSometimes people need to remember to not take things so god damn seriously! To me, this movie was a breath of fresh air that reeks of weed.",
            "review_date": "2022-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm dumbfounded. I knew this movie was gonna be bad, but jesus christ I never thought it would be THIS bad. The script is cringe, the acting is so bad, the editing is out of place and lazy, etc, etc. I cannot believe they dragged Stan Lee into this god awful movie. The only redeeming aspect of this film is Johnny Depp's performance, to no one's surprise. Nonetheless, this movie is just the Smiths and Depps sucking each other off to get their friends and family some spotlight lmao. Also, the \"insta cams\" completely ruin the flow of the scene ever. single. time. I hate them!!!",
            "review_date": "2022-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What some dads will do just to get their daughters a part. Be thankful kido. Your dad took a major bullet for you here.",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Trending, it wasn't bad, but then it kept going. And wow... drugs are a crazy thing....",
            "review_date": "2021-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am not sure what I just watched.  I would try to recap the plot, but it would just sound non-sensical.  Apparently, Kevin Smith and Johnny Depp took their families on vacation, and for fun, shot a movie while ridiculing Canadians?  And not just with a camcorder - like with somewhat decent production values and some special effects.  If you are in on the joke, I bet it is funny as heck.  If you are watching from the outside - huh?",
            "review_date": "2021-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If your looking for a fun,entertaining Movie a funny dumb movie then this a movie for you. Personally I liked it!!!!",
            "review_date": "2021-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best friends who are clerks at the Eh to Zed convenience store in Manitoba played by Lily Rose Depp and Harley Quinn Smith are put to the test when their store becomes overrun by miniature Bratzi's run by their sinister leader played by Ralph Garman.  \nThis is what happens when Kevin Smith gets high and comes up with an outlandish concept during his podcast.  It does have its charm and the leads are both likeable and do a fantastic job investing you into the nonsense of the movie itself.  Not my favourite Kevin Smith movie but it's growing on me.",
            "review_date": "2020-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Almost impossible to believe Jonny depp allowed his daughter to be in this piece of detritus, because this is surely among the worst attempts at horror/ humor genre ever conceived.\nAnd perhaps even more breathtaking is the idea that someone green lighted this project to the tune of a few million bucks. Perhaps the worst part of this whole ordeal is the fact that Kevin smith, of Clerks fame apparently wrote this and then allowed himself a credit rather than using a pseudonym. Smith has reached his nadir with this joke of a movie which isn't just unfunny but less than stupid.\nI dare any cinephile to watch this the whole way through as a matter of gauging just how much visual and auditory torture they can endure",
            "review_date": "2020-12-26",
            "source": "rt",
            "lang": "en"
        }
    ],
    "rt_rating": 3.4,
    "rt_summary": "Two teenage yoga enthusiasts team up with a legendary man-hunter to battle with an ancient evil presence that is threatening their major party plans."
}