{
    "rating": 8.8,
    "release_date": "1980-09-19",
    "num_reviews": 230,
    "genres": [
        "Drama"
    ],
    "summary": "Tormented by guilt following the death of his older brother, Buck, in a sailing accident, alienated teenager Conrad Jarrett (Timothy Hutton) attempts suicide. Returning home following an extended stay in a psychiatric hospital, Conrad tries to deal with his mental anguish and also reconnect with his mother, Beth (Mary Tyler Moore), who has grown cold and angry, and his emotionally wounded father, Calvin (Donald Sutherland), with the help of his psychiatrist, Dr. Berger (Judd Hirsch).",
    "reviews": [
        {
            "content": "The story and archs of every member of the family go in the exact direction that they should go. While it does have some 80s cheesiness that doesn't hold up a ton, it still felt genuine and real enough. The drama was brought out in certain scenes very well and I feel like this was a kind of prototype movie for what would become Goodwill Hunting. The son and father in particular shine in this movie and the son's and mother's relationship are fascinating (I especially thought so since I have members of my own family who reflect both of them in characteristics and how they choose to express themselves). Ultimately, it is a beautiful story about realizing oneself and acknowledging hard truths in life. It's a truly important movie and I'm glad that I heard about it from a mental health training seminar!",
            "review_date": "2023-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great, profound, moving movie.",
            "review_date": "2022-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An enduring film about the spectrum of grief and how money, society or even intelligence do not allow anyone a free pass from travelling its path. The filmmaking itself is filled with sensitivity and warmth, from the sound right through to the colors of every scene. Well seated in its time with references to the famous extra martial hit of its day, Ordinary People is as relevant now; in world filled with grief and in a society where a great number of people consult a therapist.",
            "review_date": "2022-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(Spoilers) The bloom has come off the rose since 1980 when this was considered a shattering, incisive melodrama.  It's not as stunning now. \n(Teen suicide is no longer the issue du jour like it was in 80).  But as a drama it still works. \nThis is still quite a beautiful study of what one viewer called \"a particular species of American family.\" Oddly enough, this is really a love triangle; not in the romantic sense; in the familial sense; it's a battle in the sense of who will survive this trauma?  It's like a three way wrestling match: Who will survive the family trauma intact; and who will get beaten; and fall by the wayside.  How will this play out?  Credit the movie for not tacking on some predictable ending where Beth changes at the ending; hugs Conrad and apologizes and promises to be nicer.  We see that coming and yet it never does.  Judith Guest and Robert Redford allow for the messier ending when the greifstricken Beth walks out; aptly punished for her abusive behavior to Conrad.  But she is also probably facing a breakdown; which makes the whole thing trickier; and harder.  Echoes of Checkov and other epic family melodramas of the past abound.   Like Look Back in Anger; and the works of Arthur Miller; (All My Sons and Death of a Salesman); and Edward Albee (Who's Afraid of Virginia Woolf); or Woody Allen's 1978 family melodrama Interiors; with it's own tales of broken mothers and suicide which this movie closely resembles.  Also considered a remake in many ways of the 1936 Rosalind Russell melodrama Craig's Wife: where Rosalind plays Harriet Craig; a beautiful but pushy and materialistic housewife who withholds love from all the other people in her life; who self-destructs as the story progresses.  In spite of all this and because of all this Ordinary People is still great.  It's still a warmly intense; \n beautifully acted and written film; crisply directed by novice Robert Redford.  It's still arguably one of the best family dramas ever made.",
            "review_date": "2022-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible dialogue. Personal study of a family in grief.",
            "review_date": "2022-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A quiet, decent film. It sounds boring but watchable throughout. Surprisingly the actor of Conrad is a supporting role. Hard to empathise with the mother...",
            "review_date": "2022-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ordinary People is a beautiful film that pulls off saying so much with so little and leaves a big impact on you as well as a love for the life you've got. Mary Tyler Moore's deserved Oscar-winning character is nothing short of brilliant as the depth for her is there, you've just got to dare yourself to find it. The film is simple, yet complex. It's about self-discovery and forgiveness and I can say for sure that they don't make films like this anymore and it's a shame.",
            "review_date": "2022-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have seen this film three times.  I first saw it in the early eighties and again last night.  It is as fresh and relevant as the day it was first released.  The older one becomes the more painful it is to watch as people die around us.  Mary Tyler Moore was a surprise the first time because she was a situation comedy actress and Timothy Hutton was a newcomer.  Donald Sutherland was, as always is fantastic.  Anybody who watches it must really have a box of tissues handy as it deals with the emotion of grief in a very adult way.",
            "review_date": "2022-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Paul Rudd was not in this movie",
            "review_date": "2022-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartbreaking and uplifting... first saw this movie in me teens and rewatching it is just as powerful and relevant in my 50s. A remarkable film... ",
            "review_date": "2022-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is supposed to reflect psychological disturbances of a boy who lost his brother in a small sailing boat in a stormy sea, and he feels responsible, and guilty for the loss of him.\nAnd then his mother's looses her affection against her husband and younger son after death her elder son.\nPsychological disturbance of the boy as a result of guilt feeling is not convincing.\nMother displays a character of an order freak at home, and acts like a resentful robot against her son.\nAll acting in this movie looks amateurish. And plots are sooo boring.\nFrom the beginning to end, for every actor, one feels that casting was wrong. \nNo one is impressive. \nAnd I remember of nothing of the soundtrack if there was one.",
            "review_date": "2021-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An emotionally heavy and insightful family drama about a family's troubles coming to terms with the death of one of their own. Its performances are outstanding, Robert Redford's direction is very impressive considering it was his directorial debut, and the way it touches on its themes of grief and family problems are unlike any movie I've seen from the era and I don't really see it that much from movies that came after it. And like a movie I watched just before it, Kramer vs. Kramer (1979's Best Picture winner and this being 1980's winner), it is a tearjerker but not in a way that feels like its being manipulative, it handles its emotions in a realistic and compassionate way and its one of the most powerful dramas from the 1980's I've seen.",
            "review_date": "2021-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Robert Redford's directorial debut promptly won him the top prizes for Best Director and Best Picture at the 53rd Academy Awards in 1981. Until then, Redford had been known for his acting performances. He finally shook off his reputation as a pretty boy with Ordinary People. The film tells the story of the Jarrett family, shattered after the death of their eldest son and the subsequent suicide attempt of their youngest son, who try to deal with their grief in a variety of ways.\n\nTimothy Hutton won the Oscar for Best Supporting Actor for his role as the son Conrad, who has just been released from a mental institution, although he is actually the central character of the film. Especially at the beginning, he appears in almost every scene and the tragic events are told from his point of view. From the beginning, he has a hard time finding his way in his new, old life and you always have the feeling that he could fall off the wagon again. From a point where he realises he wants to get his life under control, his parents come to the fore. Donald Sutherland as father Calvin and Mary Tyler Moore as mother Beth could hardly be more different. Calvin is an eternal optimist who talks everything up even after such a tragic incident, but in reality is very worried about his stricken son and the family. Beth, on the other hand, is trapped in a bubble where she detaches herself from any emotional attachments and acts cold and emotionally unavailable towards Conrad in particular. The character is by no means a sympathetic one, but Moore's acting is so close to reality that you can relate to her perverted way of grieving and loving. Sutherland and Moore have the chemistry of a couple growing apart, as you see so often in real life. But the best chemistry in the film is between Hutton and Judd Hirsch as Conrad's therapist Dr Berger. Initially rather toxic, the internally broken Conrad confides more and more in his helper, whereupon a genuine friendship develops. The interplay between friend and psychotherapist seems relatable at all times due to Hirsch's authentic play of a tough but fair mentor.\n\nThe great strengths of Ordinary People are its outstanding cast and the realistically written script. The dialogue and sometimes monologues get to you and sometimes even have unexpected wit, which does the devastating plot good. For his first directorial effort, Redford has also shown a good hand. Instead of telling a melodramatic family drama in a suburb, he has chosen the subtle way and taken the necessary time for all essential characters. This tediousness also hurts the film, especially in the first half. It's hard to get into the story and the build-up seems tough, which means that the plot only affects you to a limited extent at the beginning. Towards the end this improves and the final act is as heartbreaking as the whole film, but is well and adequately chosen. Overall, Ordinary People is not a film that stands out nowadays, but for its time it was a hit in terms of realism, grief processing and family and group dynamics.",
            "review_date": "2021-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is probably the greatest film ever made. Every single scene adds to the story. The acting is perfect. In this film, a young man, played by Timothy Hutton, seeks out a therapist to help him resolve some troubling emotions. The therapist is wonderfully played by Judd Hirsch. Directed by Robert Redford, this film has had a profound impact on my life in a very positive way. Winner of the Academy Award for Best Picture in 1980.",
            "review_date": "2021-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ordinary People is not a particularly groundbreaking movie, nor as its title suggests does it set out to be one. It tells the lives of an affluent family in the wake of their teenage son's suicide attempt and repercussions of the death of their other son in an accident before that. The movie makes some unremarkable observations, but ones that society should be reminded of once in a while. Teenagers are awkward in their formative years. Teenagers try to distinguish their own preferences and it's made difficult given societal expectations from institutions, their family and their friends. Bad things happen to everyone regardless of whether they are rich or poor. People are affected by grief, guilt, regrets and loss in different ways and some people never recover from tragedies. Now, some viewers might find the movie plodding, but it is nice to see the nuances of different characters in different situations and Timothy Hutton does steal the show as a teenager that's ill at ease in the world. The more interesting insight that the movie delivers towards the end is that the reason why tragedies are so jarring is that individuals are forced to re-evaluate what is important in their lives. What they are doing and why they are doing it. This forced and unexpected change in perspective is psychological painful, because in order to deal with it requires the utmost honesty and to not do so is to invite anguish. It turns out that those that are affected by tragedy have to establish a new normal and this is done by recognizing that in order to 'regain control' one has to first and foremost keep restating one's personal feelings and aspirations which might or might not harmonize with those around you anymore, but will ultimately result in genuine and lasting connections as it has before.",
            "review_date": "2021-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Robert Redford's academy award winning directorial debut is uttterly heartbreaking. Sorrow and broken family ties give the actors (Donald Sutherland, Mary Tyler Moore, and the sensational Timothy Hutton) all the fuel they need to deliver tour de force performances. Sensational.",
            "review_date": "2021-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never understood the appeal of this film. To me it belongs on the Lifetime Channel, not in theaters. The acting is okay I guess. The story is forgettable.",
            "review_date": "2021-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Ordinary People\" is a powerful and real family drama. What I loved about this movie is how it jumps right into the aftermath of a tragedy and allows the viewer to piece things together. This makes the movie inherently more engaging. I think this movie is a tough one to watch but the performances across the board are outstanding. Timothy Hutton is the standout in the movie and it is no surprise he won an Oscar at an early age for this film. His performance is raw and devastating and despite what the Oscars might have you believe, is the lead performance and the heart and soul of this movie. The movie has a surprising ending in that,t not every character learns a lesson, and that felt very true to how real life can be sometimes. Overall, this is a gripping and sad story but also one with some uplifting elements that make it a well-rounded story. In my opinion, it is one of the most well deserved Best Picture wins I have seen until now.",
            "review_date": "2021-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very confused by where exactly the first half of the film was heading. It really is an hour long scene setter and the second half ramps up into a very adult fly on the wall of an ordinary family trying to recover from grief. It wasn't judgemental at all and the shrink holds the characters together sufficiently for them to unwind their thoughts coherently. Very tidily done without the perfect happy ending.",
            "review_date": "2020-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A mature, thoughtful look at tragedy, grieving and coping, Ordinary People is about an upper-class family attempting to rebuild after the sudden loss of their oldest son. Donald Sutherland and Mary Tyler Moore are sensational as the parents trying to recover from death of one son and the near suicide of another; however, the film's best moments are the therapist (Judd Hirsch)—patient (Oscar winner Timothy Hutton) sessions, which are both emotionally draining and inspiring. Highly recommend.",
            "review_date": "2020-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it. Powerful narrative, well cast and engrossing character drama.",
            "review_date": "2020-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To belatedly commemorate screenwriter Alvin Sargent, let's discuss Ordinary People. The film follows the Jarrett Family: the father Calvin (Donald Sutherland), the mother Beth (Mary Tyler Moore), and son Conrad (Timothy Hutton). Conrad emotionally distances himself from the family due to his younger brother's death from a boating accident and visits a psychiatrist Dr. Berger (Judd Hirsch). On the opposite spectrum, Calvin is emotionally shut down, flowing passively through Beth's tunnel. Meanwhile, Beth represses the memory of her son, thereby burying it and controlling every aspect of the Barrett Family. The significance of Robert Redford's directorial debut is the emotional turmoil buried being masked by the happy autumn red societal merit, becoming ordinary people. Both Calvin and Conrad must let out their rage and treasure the memories by seeking help from an outside source. Beth, resenting any change and taking the wrong route, buries the treasure by cleaning the house, frequently going on trips and sending Conrad to a mental hospital. As Calvin finally confronts Beth about his feelings, she secretly leaves him and flies to Houston, again, distancing away from her hang-ups. Ordinary People truly is one of the finest and powerful family dramas about survivor's guilt and identity crisis in the last forty years. \n\n(4 ½ French Toasts out of 5)",
            "review_date": "2020-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really powerful with some fantastic performances.",
            "review_date": "2020-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though Hutton's performance is the one that is most commonly singled out (and it is certainly solid), the gradual erosion of the marriage between Moore and Sutherland is to me, the more compelling aspect of the film; the golf course scene in particular is a well-conceived and well-acted segment. The film overall takes a premise that seems like it sprang from the mind of a first-year film student, but treats it with a degree of complexity that really makes it feel sincere. That's not to say that Ordinary People doesn't stray into territory where it seems to provide license for excessive performances that feel less like the result of a pot boiling over, but like a sporadic exhibition of acting capability; it certainly does, particularly in the latter half. (4/5)",
            "review_date": "2020-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Timothy Hutton won a well deserved Oscar. It surprises me that he won in supporting when he carries the film on his shoulders. He has the most pain, the most suffering.  He outshines Donald Sutherland and Mary Tyler Moore who are fine as his parents. Its a powerful story and we slowly get to know what happened to Conrad as we delve into his mind through his regular meetings with his father. It take a lot for him to open up and admit the only one thing he did wrong was surviving. Its not a perfect film by any means, i never fully feel Sutherland and Moore totally convince. There is patience to be hard for watching and listening. Some may find it bores and it did feel some elements did. The relationships is where the film shines. With parents, with friends and even watching his parents try and act normal with their friends. Conrad will always blame himself and can't open up to people so becomes more introvert.  Many people can relate to this. Moore's character is very harsh and very cold. Has she lost love once her son died? She doesn't want to talk about things, she hides. Sutherland's character does not know what to do right with both his son and wife. Always feeling like his is doing something wrong. The ending was something that could have been enhanced, the wife leaves but doesn't say anything to her husband. I wanted them to talk, i wanted them to have some resolve, ultimately i feel disappointed. There are many powerful scenes, from the Doctor and Conrad finally getting to the important elements, and Conrad finally expecting being hungry for breakfast. Hutton is the star, in areas well written, some scenes were flat, but i did feel sad.",
            "review_date": "2020-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An incredible directorial debut for Robert Redford, who brings us a story of suburban superficiality and deep personal guilt. Tommy Hutton earns every bit of the praise he received for his role as Conrad, a teen transformed by grief and his inability to come to terms with the tragedy which shook his family to the core. It's a performance that's very intimate and close, with lots of subtle ticks and gestures. Nothing in the film feels overblown or hammy, yet its never dull or lacking in urgency. It's a window into the lives of those who care only for outward appearances; those who will do anything to hide the shame and disappointment they truly feel. Its influences can be seen in movies such as American Beauty and Good Will Hunting, the former for its depiction of families falling apart behind the scenes, and the latter for its sympathetic portrayal of psychologists, who were usually relegated to secondary bad guy roles at the time. Judd Hirsch encourages our hero to forgive himself and accept the past for what it is, and the scenes with Hirsch and Hutton carry the heaviest emotions, as well as the best acting. It might seem dated, superficial and cliched by modern standards, but 40 years ago elements like this were rarely seen, so they're only cliched because people used them so much. If you're a fan of heavy drama, Ordinary People is a film I'd highly recommend.",
            "review_date": "2020-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Robert Redford's 1980 directorial debut Ordinary People is a powerful character study about a family dealing with grief. The film's title tells the audience what to expect, a film about ordinary people who normally live ordinary lives, assuming that one considers ordinary people to be white, upper-middle-class Americans who live in the suburbs. Whatever the audience's own background however, it isn't hard to empathise with the film's characters.\nThe simple story concerns the Jarrett family, whose members are trying to cope following the death of eldest son Buck and subsequent attempted suicide of younger son Conrad. This back story is revealed through the dialogue and occasional flashback as the plot focalises through Conrad and his personal journey throughout the movie. The film's great strength is the believability of is central characters, chiefly Calvin and Beth and their son, but also psychiatrist Dr Berger as well as the Jarretts' various friends, all of whom act realistically awkwardly towards the grieving family.\nAlvin Sargent's screenplay – based on Judith Guest's novel of the same name – is masterfully written, teasing out the conflicting and often suppressed emotions of the characters with complete plausibility. It is the acting however that really brings the story to life. Donald Sutherland, Mary Tyler Moore and Timothy Hutton are effortlessly convincing as Calvin, Beth and Conrad, each struggling in his or her own to way to come to terms with what has happened to their family. Hutton is especially impressive as the traumatised Conrad, through whom the film is focalised. His naturalistic performance resulted in him becoming the youngest ever actor to win the Academy Award for Best Supporting Actor. He's remarkable throughout, but never more so than when he finally has a cathartic session with Berger and admits that he blames himself for Buck's death and is angry at him at the same time. The contrast between Conrad and his friend Karen is interesting – he tells her he misses things about the psychiatric hospital, whereas she claims she does not and with forced cheeriness insists that she is alright. She ends up committing suicide, in contrast to Conrad, who comes to terms with his grief and loss.\nDonald Sutherland and Mary Tyler Moore are equally impressive. Sutherland conveys Calvin's desperate desire for his son to be all right and for his family to pull through, before ultimately realising and accepting that his marriage is coming to an end. The party scene and its immediate aftermath are striking: Buck's death is the elephant in the room, and Beth is furious when Calvin tells one of their friends that Conrad is seeing a psychiatrist, resenting any intrusion into her fiercely guarded privacy. Moore's emotionally brittle performance reaches its zenith during the golf-course argument before culminating in her final scene with Sutherland, as Beth is confronted with her own emotional distance and chooses to simply walk away. Judd Hirsh meanwhile is perfectly cast as psychiatrist Tyrone C. Berger, a great character who gradually earns Conrad's trust and is consistently supportive without being judgemental.\nBehind the camera for the first time, Redford realises that the character-led plot doesn't require flashy direction, but rather solid, clear film-making that gives the actors and the material space to breathe. Cinematographer John Bailey uses shots that frame the actors in ways that reflect the emotional distance between them, for example during a scene in which the family has dinner and makes banal small-talk. The more dynamically shot scene of Buck's death is only ever glimpsed briefly in flashback, making it all the more powerful whenever Conrad remembers, as it intrudes into his memories however much he would rather it didn't. Ordinary People makes an elegant first feature for Redford, and its strength lies in his admirably low-key, intimate approach and the talent of the cast and crew he assembled.",
            "review_date": "2020-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While I believe Raging Bull should've won Best Picture, if there was any film from 1980 that's almost as deserving, it's this.",
            "review_date": "2020-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ordinary People is the directorial debut of actor Robert Redford. The film is an adaptation of a novel by Judith Guest and is the story of a family torn apart by tragedy. Timothy Hutton (who won Best Supporting Actor), Judd Hirsch, Mary Tyler Moore and Donald Sutherland give amazing performances in this Best Picture Winner.",
            "review_date": "2020-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mary Tyler Moore delivers a WASP version performance that could have inspired Nancy Marchand's formulating of Tony Soprano's mom. Equally effective were the male leads who similarly never totally emerge beyond such a dreadful force so distanced from underpinnings of a lost humanity.",
            "review_date": "2020-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A gut-wrenching classic film that captures the pain of conditional love in a dysfunctional family pretending otherwise.",
            "review_date": "2020-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An Oscar-worthy film with a simple plot, extraordinary cast, and non-fancy visual effects. Enjoyed the dynamic between Mary Tyler Moore and Donald Sutherland where their portrayal as a couple seemed realistic and heartbroken to see. Timothy Hutton's act was Oscar-level with the right amount of emotion and it rocked the inner feeling out of me, from the mental pain of the loss of his brother to a transition of hope, while also experiencing isolation from all sides (school and family).",
            "review_date": "2019-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie because it has many truths about depression, in it that I feel people should hear about. For a class, I am taking we looked at a handful of movies and analyzed the aspects of family within them. This movie has many correlations to the class. The way the family interacts with each other and lives shows many things. The movie shows class, as they are upper class and can afford to have therapy sessions when they need them. There are also gendered expectations, such as Conrad is expected to handle it because he is a man, and also it shows themes of separation.",
            "review_date": "2019-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ordinary People is a 1980 American drama film that marked the directorial debut of actor Robert Redford. AAW GGWD 1001",
            "review_date": "2019-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid performances with all actors. This is one of my favorite films.\n\nTimothy Hutton's performance, represents the best I have seen in a character actor\nand deserved an Oscar for Best Actor in a Leading Role.\n\nWhat differentiates this film from a soap opera (which it could easily have become) \nis that each character is given the dramatic opportunity to keenly discern what they can  \"control\" and  most importantly, what they simply cannot control.",
            "review_date": "2019-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful, rip-your-heart-out acting. Timothy Hutton's vulnerability is heartbreaking perfection. Thank you, sincerely, Mr. Hutton.",
            "review_date": "2019-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this film again recently and have even more respect for it now than I did in the early 80s when it was first released.  Perhaps because I was so young, I didn't really get the film entirely then.  But, now, after being married and having matured, I see \"Ordinary People\" not so much just a film about a family dealing with a tragedy.  But, more, it's a snapshot of a dysfunctional American family. Sutherland's character (Calvin) indicates several times during the movie that there were problems before Buck died.  Like a glass bottle that had fractures before, Buck's death shatters them into pieces.  And, while the family tries to maintain the same appearance as the happy \"normal\" suburban family after his death, they never really were \"happy\" in the sense as they ever tried to portray it.  With Buck gone, all the layers of the onion are peeled back and now there is no escaping what the family really is - dysfunctional, disjointed and not happy.  They cannot escape the truth anymore.  Also, I like how we see the varying degrees of personalities and how they handle adversity:  Beth is incapable of flexibility and will not face the fact that there could be issues; Her son Conrad is a mess and tried to commit suicide; Her husband Calvin is somewhere in between - trying to keep up the facade for her sake, but hurting and trying to go about life while seeking help from professionals.  A great film that wears well.  I hope the younger generation of fans make a point to see it.  You can't help but be touched by it.  A+",
            "review_date": "2019-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fractured families have always been a favorite subject of mine when it comes to literature and film and this is considered one of the best family dramas of the 1980s. The two other films that Robert Redford has directed that I've seen, Quiz Show (1994) and A River Runs Through It (1992), were both fantastic and managed to explore tenuous family dynamics in detail. The reputation of this film as a Best Picture winner seemed to be negative because Raging Bull (1980) was released in the same year and was also nominated for Best Picture. Personally, having seen both films, I preferred this one but I know that's just personal taste because I was more interested in the themes explored in this movie than I was in the brother relationship in Raging Bull.\n\nConrad Jarrett, Timothy Hutton, has survived a recent suicide attempt but struggles to adjust to everyday life as he is traumatized by memories of his brother Buck's death and comes into conflict with his mother Beth, Mary Tyler Moore. Beth is obsessed with keeping up appearances and refuses to discuss Buck's death even as Conrad begins attending therapy sessions with Berger, Judd Hirsch, that help him tackle some of his guilt about his brother's death. The relationship between Beth and Calvin Jarrett, Donald Sutherland, suffers under the weight of their differences in parenting Conrad and Beth's refusal to express her emotions.\n\nThe majority of the film is just tense conversations between family members, friends and patients and psychiatrists but it was so compelling and so well acted that it was more engaging than any thriller moving at a breakneck speed. Alvin Sargent adapts Judith Guest's novel of the same name judiciously as he cuts out unnecessary subplots and leaves enough unspoken between family members for the dialogue to seem lyrical but natural. Redford has the ability to draw the characters clearly and gives all of his actors opportunities to do some of their best work. Scenes like Conrad and Jeanine, Elizabeth McGovern, having their first date and engaging in an uncomfortable conversation about his suicide attempt feel true to life and like an honest depiction of the strange moments that would occur in the life of a teenager who had made a suicide attempt.\n\nThe performances stand out as each actor seems to have crafted a character full of life with a rich backstory that informs their treatment of those around them. Moore received an Academy Award for Best Actress nomination for her shock performance as a cold, emotionally distant mother and wife who chooses to abandon her family instead of facing her pain. She is terrific as an icy woman whose put together appearance is clearly a faÃ§ade for the damaged woman lying underneath and her refusal to admit this is at once infuriating and sympathetic. Sutherland would have absolutely been deserving of a Best Actor nomination although nobody would have beaten Robert De Niro as Jake LaMotta. In his final scenes Sutherland plays a man who is wistful for what he once had but has accepted the fact that he needs to move on and tries his hardest to support his son.\n\nHutton won the Academy Award for Best Supporting Actor, although he is the lead actor in this film, and he does show inner torment with relatively little dialogue and subtle facial expressions. One performance that surprised me was that of McGovern as I didn't like her in Once Upon a Time in America (1984) and was confused by her Best Supporting Actress nomination for Ragtime (1981) but here she is very good as the girlfriend. The date scene allows her to play confident and charming but also uncomfortable and awkward as her reactions to Hutton's provocations seem like those of a regular teenager. Hirsch was decent as the intelligent, probing psychiatrist but he hardly warranted any awards attention.\n\nThis is a great film that takes a story that could easily be too dark or difficult for most directors to adapt but Redford's touch makes the film watchable even as it is depressing. The performances are stellar with Moore and Sutherland really shining and the themes of the film serve as a nice follow-up to the previous year's Best Picture winner Kramer vs. Kramer (1979).",
            "review_date": "2019-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie! Real, complex, challenging people. Timothy Hutton shines. And Donald Sutherland is again the backbone of the film, and was robbed of an Oscar nom. Truthfully Hutton should have been lead and Sutherland supporting. One of my faves from the decade, and very deserving of all its Oscars (yes, even over Raging Bull. Scorsese directs the same characters in similar scenes, over and over). Redford’s work here is a revelation. The scenes between Moore and Hutton, attempting to communicate, are worth Best Picture on its own).",
            "review_date": "2019-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best, GREATEST movie ever made!",
            "review_date": "2019-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my favorite movie of all time.  It won the 1980 Best Picture Oscar, and Robert Redford won Best Director.  Timothy Hutton won an Oscar for Best Supporting Actor, but that could have just as easily gone to Judd Hirsch, who plays Dr. Berger.  Mary Tyler Moore and Donald Sutherland are also fantastic as the parents of Timothy Hutton.  Don't watch it if you dislike emotional intensity and dysfunction.  For those who do, the next time you watch this movie, note details such as early on when Mary Tyler Moore is setting the table, with perfect precision; she hates \"messes\" of all kinds but loves order, which is why she can't deal with her emotionally messed-up son, who has survivor's guilt following a boating accident that kills his brother.",
            "review_date": "2018-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a great film that has aged well.",
            "review_date": "2018-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not so ordinary and not so people-alike..\n\nOrdinary People\n\n3 And A Half Out Of 5\n\nOrdinary People is a plot driven feature about a writhing family that may or may not remain stable for a longer period and the journey that has got them here. The scrutiny justifies the hype that is offered in here and not because of its complexity but its layered material that it brings along with it whether then it be its unexpected consequences or eerie perspective. \n\nIt is short on technical aspects like background score, art design, sound department and cinematography although is perfectly edited. The writing is strong if not gripping, it's thought-provoking and intriguing enough to keep the audience invested in it. \n\nThe adapted screenplay by Alvin Sargent is smart and has covered adequately every bits of the material without stretching it or over-stuffing it. Robert Redford; the director has done a decent work on pulling off this burdened dysfunctional family and their day-to-day life that is clearly not mundane. The performance by the lead cast is plausible like Donald Sutherland and Mary Tyler Moore who are supported nicely by Timothy Hutton and Judd Hirsch. \n\nOrdinary People is not so ordinary and not so people-like and yet is grounded with humane emotions and actions that helps the audience connect with them swiftly.",
            "review_date": "2018-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An hunting movie about grief, loss and family, with an impeccable performance by Mary Tyler Moore.",
            "review_date": "2018-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "JUST SAW THIS FOR THE FIRST TIME AND WHAT A GEM!\nIT IS A RARE MOVIE WHERE YOU CAN SEE THE CHARACTERS TRULY EVOLVE BEFORE YOUR EYES IN THE MOST AUTHENTIC AND RAW WAY.  THIS IS ONE OF THOSE MOVIES.  EACH PERFORMANCE IS AMAZING, AND THIS WAS HUTTON'S FIRST BIG FILM!",
            "review_date": "2018-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A family tragedy drenched with emotion. Easily one of the greatest films of the 80s. Beautifly directed, acted and written.",
            "review_date": "2018-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this movie in 1980 I just saw it again in 2018 now I like it more such a fantastic movie with broken family and acceptance sad movie but reality. ",
            "review_date": "2018-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very cheesy movie, with cheesy acting and cheesy dialogue. I can´t imagine anyone playing this movie outside of a middle school class.",
            "review_date": "2017-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie about a family dealing with the tragic death of their son/brother. Like in real life, everyone deals with tragedy in different ways. Some stay strong for the sake of others, some become distant and others simply cannot handle it at all. Ordinary People handles this theme with grace and confidence.The father stays strong, the mother keeps trudging along, but makes it obvious that she lost her \"favorite\" son in this accident without ever speaking the words and the brother is inconsolable. \nUsually in these kinds of films, the person lost is very young and is used as a manipulative plot device to try and get those tears flowing. Here, the person dead was in high school, who died in a boating accident and aside from a couple flash-backs, the fact that he died is rarely discussed by anyone. \nA must see for anyone who appreciated well written dramas.",
            "review_date": "2017-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its a small movie in scope, but a BIG grand movie in it's emotions and scenes. It's a masterpiece drama with rich characters, a strong Oscar winning screenplay, and A+ performances.",
            "review_date": "2017-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "9 out of 10:\n\nDespite feeling like a soap opera and a predictable ending, Ordinary People is still wonderfully acted, well shot, and moving.",
            "review_date": "2017-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So emotionally honest.",
            "review_date": "2017-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think it's genius the beginning scene, how all these people are entertained by this play that's going on and it's about this couple that seem to be getting along and humoring one another and the audience is laughing. I think it's genius because it's ironic. All these people watching the couple interact as if life were one big sitcom and then they're real lives are probably one big mess. It's the very thing that everyone wished they had in a relationship. And the icing on the cake is Donald Sutherland's character finds it so boring and not amusing that he's sleeping throughout the play. \n\nThere's this almost impalpable feeling in the air during this movie that anytime Conrad could kill himself or something awful will happen to him. There's a certain tension throughout. Depression and uncertainty are a really dangerous combination and this movie does a great job at highlighting that. You can clearly see that the main problem comes from the mother and how distant she is. You can tell that her first son's passing away really affected her. It's like she's trying to ignore what's really going on without really confronting what she's really feeling. \n\nIt's interesting to see how the characters interact with one another. especially in the scene where Conrad scares his mom when he gets home and she's in the room of her deceased son. The acting is phenomenal because you get to see just how awkward and socially inadequate the other and son relationship is. It seems like Jared just wished his parents, especially his mom, would just show him some love. \n\nIt's almost painful to watch how much Conrad is trying to make an effort to connect with his mom but she's just so distant and almost brushes everything to the side. Things start to lighten up once Jeanine comes into the picture. It's really interesting to see how as everyone starts going to the psychiatrist, they start to figure out there problems. I really like Dr. Berger's way of how he approaches helping people. It's as if he talks to them like they were friends. All the guys are getting there problems dealt with when it's really Beth, the mother, who needs it the most. It's almost like she goes through life and the way she communicates is like the play that they were watching at the beginning, almost like a sitcom. \n\nWow, you imagine feeling guilty of your brother's death. That would eat up anyone on the inside. Wow, Beth really pissed me off even in the end. One of the most realest movies I've seen in a while. It didn't even have that happy of an ending. I really hope Beth learns something along with her departure, that emotionless bitch. \n\nThis movie did a brilliant job at storytelling, really great writing from whoever wrote it. It's a very real take on something that I feel everyone goes through which is what makes it such a great movie, everyone can relate to it.\n\nReally really brilliant movie with phenomenal acting!",
            "review_date": "2017-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A deeply - moving family drama that doesn't add too much sadness.",
            "review_date": "2017-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies I've ever seen,  Redford's directing, and the performances of Sutherland, Moore, Hutton, Hirsch, and McGovern are all impeccable.",
            "review_date": "2017-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent and intelligent drama about a WASPy family trying to deal with the loss of a family member.",
            "review_date": "2017-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Robert Redford's directorial debut benefits from great performances from its cast, which elevates a tender family drama.",
            "review_date": "2017-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hutton is very enjoyable. I liked the film less when it focused on the parents but when it followed Hutton's journey to acceptance the film was very strong.",
            "review_date": "2016-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Deeply moving,  outstanding acting from every single actor.  Unmatched as far as acting- in my mind., but especially Mary Tyler Moore and Timothy Hutton",
            "review_date": "2016-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing performances all round but Donald Sutherland broke my heart.",
            "review_date": "2016-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very forceful drama, extremely well acted with topping Timothy Hutton performance which just can't leave you impartial.",
            "review_date": "2016-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In a film that has all the makings of the standard coming-of-age drama, Ordinary People tackles sensitive subject matter with poise and a rewarding sentiment.\nMainly following the life of Conrad Jarrett (a powerTimothy Hutton), we watch a a regular, suburban family adjust to normal life after the death of one of their children. We are introduced to a seemingly normal, functioning family with Conrad at its focal point, from the audience's view at least. He engages in normal teenage activities: he rides to school in the backseat of his rowdy friends car, attends swim practice, and goes home to eat dinner with his pristine mother (Mary Tyler Moore) and his soft-spoken father (Donald Sutherland). All seems right on the surface but the film's uneasy tone never wavers as the frailties of the family slowly begins to unfold.\nThe film moves at a somewhat leisurely pace but it is never tiresome. In fact is effortless and allows each character to reveal their intricacies without bombarding the viewer.\nThe film deals with tragedy and suicide with care, and does not dwell on melodramatic expose. Each character's insecurity is hinted at but it is never too explicit where the audience need not discover it for themselves. Redford allows the viewer to empathize with each character by their own notion and presents the events in a way that shows without telling.\nMuch of these emotions and complexities are drawn out by a family psychologist Dr. Berger (Judd Hirsch) who operates with a calmness and assurance that couples well with Hutton's performance. Hirsch does a marvelous job here as the seasoned doctor who meets with Conrad and evokes his true emotions about his brother's death not by textbook questions but by establishment of trust and transparency. Hirsch and Hutton work well here and the dialogue is natural and effortless, reminds me of a young Matt Damon and Robin Williams conversing in a similar setting in Good Will Hunting. \nAnother couple that work well together with matching acting prowess is Tyler Moore and Sutherland. Playing the dichotomous couple who battle between acceptance and catharsis in the face of the tragedy, both actors nail their roles as the conscientious mother who struggles to create an intimacy with her son, and the quiet, agreeable father who attempts to find a common ground between the two polarized members of his family, respectively. Tyler Moore is unforgiving and tragic in her own sense as later scenes in the movie reveal but the film never leans in her favor. Alvin Sargent and Nancy Dowd, who wrote the screenplay, never neglect to give each character their own light and allows each character to operate effectively in separate scenes. \nHowever, the best scenes in the movie I think involve the supporting characters. the most revealing instances are between Conrad and his two female interests. It's here we are able to connect with Conrad and get a real feel for his pain. One scene has Conrad meeting with his friend from the psychiatric hospital Karen (Dinah Manoff) and they share the details of their life after their encounter. We can see Conrad's struggle discern his own condition in comparison to Karen's. We can see for ourselves the insincerity of his upbeat attitude and his attempt at normality. Director Robert Redford helps bring vibrancy to the film and we see a part of the story develop rather than unfold. It's at these moments we understand the struggle Conrad face's with his own emotional turmoil and we can see his only two connections with happiness left; although one character embodies happiness in the past, the other in the future. \nAt the beginning and end, a version of Pachelbel's Canon rings out; a beautiful, grand composition that works as a synecdoche. To dip into musical terms, Pachelbel utilizes counterpoint, or a feature of music where every section plays their own tune at different times, yet the entirety of the piece sounds in harmony. It's a nice testament to the film, where each roles resonates solo and fortissimo, anchored by the unwavering performances of the cast. Yet the true genius of the film does not just lie in the players, but by the sure-handed direction of Robert Redford in his extraordinary debut.",
            "review_date": "2016-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though it's expertly directed & acted, this is definitely a one-time watch for me.",
            "review_date": "2016-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ordinary People is great because it could be released today or 50 years from now without losing its power or relevance. Even though its shown from the perspective of white middle and upper middle class characters, the realistic portrayal of how the withholding, denial, and repression of emotions and thoughts can effect families has universal relevance. It also offers keen insight into how our society processes death in all forms and why simply opening up ourselves to the ones we love can be so hard. Those familiar with Mary Tyler Moore only as a perky sitcom actress will have difficulty recognizing the ice cold loveless mother she portrays here. A young Timothy Hutton is wonderful as a teenage boy coping with the tragic death of his older brother, and Donald Sutherland is excellent playing a father who uses blinders to shut out the slow disintegration of his family.",
            "review_date": "2016-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exploring the dark side of suburbia is nothing new at this point. Some would even argue that it's a rather passé subject to discuss after so much of the world has changed. Well then what makes Ordinary People stand out? There are plenty of things sure, but the most prominent would be its earnestness. A film like this could be easily be written off as Oscar bait from afar. But when you really break it down and watch these wonderful actors giving excellent performances, Robert Redford providing some very subtle direction, and this story of tragedy and recovery moving along so naturally, you may just reconsider that notion. In short, Ordinary People is a grim and heartbreaking examination of some very unordinary people trying their very damn best to be ordinary. Every performance is fantastic, every shot is masterfully crafted, and the themes explored are tastefully done while still unrelenting. Perfect.",
            "review_date": "2016-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "an exceptional movie. still waters run deep.",
            "review_date": "2016-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ordinary people was the 1980 winner for best picture. Having seen the film I can say that it is warranted as this is an extremely powerful drama. A teenager (Timothy Hutton) feels guilt and blames himself for his brothers death which occurred during a boating accident. The father of the family (Sutherland) does his best to keep his son's health in his best interest and to keep the family together. As Sutton seeks therapy with a psychiatrist (Judd Hirsch) he discovers himself and struggles to get better. As the film progresses the characters really unfold and you see them for who they truly are. Redford masterfully directs this in a such a manner that shows you how different people react to tragedy. Some people might not like this film due to inability to relate to the characters, or have not had such a tragedy in their own lives, but anyone that has will really relate to this film. Mary Tyler Moore does an excellent job as the mother as well. Tragedy can have such diverse effects on somebody, but its a part of life and this film captures how it can make us stronger or really expose your true character.",
            "review_date": "2016-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ordinary People is one of those Best Picture winners that gets a bad rap. It's easy to write the film off because it's a simple, though powerful, vision, and it went up against one of the most highly regarded films ever (Raging Bull). But you can't, or at least shouldn't, completely ignore a film this good. It's complex and moving, but not in an overly sentimental way. For the 90% of the film, Robert Redford (in his directorial debut, nonetheless) doesn't let his characters take the easy way out. The raw emotions on hand feel real because they are complicated. The ending feels like a cop out, which brought the film down just a bit, but the rest of the film and its strong performances more than make up for it.\n\nThe film begins about a six months after the Jarrett Family has been brought to its knees when Buck, the elder of two Jarrett siblings, died in a boating accident, and shortly thereafter, the younger brother, Conrad (Timothy Hutton), tried to commit suicide. After a lengthy stint in the hospital, Conrad still hasn't fully recovered and is still haunted by dreams of the accident. His parents, on the other hand, aren't quite sure how to handle him. His mother, Beth (Mary Tyler Moore), is very cold toward him. His father, Calvin (Donald Sutherland), simply wants to return things to normal.\n\nOrdinary People isn't all that different from films like Rabbit Hole or In the Bedroom. Its characters are all complex, as are the emotions they are dealing with (or in some cases, not dealing with). Easily the most vivid character is Conrad. He definitely has a lot of issues he's dealing with (in the film, he regularly visits a therapist played by Judd Hirsch), and the way struggles with them directly drives the plot. Despite what the Academy declared (Hutton inexplicably was nominated for and won a Best Supporting Actor Oscar), Ordinary People is Conrad's story.\n\nWhere the film has a problem is with its ending. To be fair, there's only so much you can do when your source material is a beloved novel, but what happens with this film's ending is that it loses sight of just whose story this is. It simplifies things in the hope of providing a pat resolution for those we sympathize with. And worst of all, it completely disposes of one vital character. What happens to this character is a shame, for her or she (don't want to spoil it) provided the film with much of its complexity. I wish the film ended more strongly, for it definitely could have been a four-star picture.\n\nThe film is an acting showcase. Timothy Hutton's Oscar was well-deserved. I adored the way Conrad wears his emotion on his sleeves, and the fusion of intensity and vulnerability within the character commands your attention whenever he's onscreen (which is for most of the film). Mary Tyler Moore is astonishingly good as the mother from hell. She genuinely doesn't care for her son, and she repeatedly forces her husband to choose between her and Conrad. She's a character who typically would be sympathetic (suffering mother who has undergone a tragedy), but Moore makes her seem downright despicable. Finally, there's Donald Sutherland, who's the good guy in the bunch. He just wants to bring everyone he loves back together, and he struggles admitting to himself that it might just not be possible.\n\nOrdinary People's Best Picture win is typically not looked upon with great favor, but compared to many of its fellow 1980s winners, it's a triumph. The film is emotionally honest and I was pleased by how often it restrains itself. There are a few moments of over-direction, as well as a weak ending, but on the whole, it's a worthy motion picture that deserves more praise than it typically receives.\n\nhttp://www.johnlikesmovies.com/ordinary-people-review/",
            "review_date": "2016-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Raw and human. Robert Redford made a surprising and intense breakout into the directing scene with his first film, Ordinary People. He portrays the story so realistically that for some it may appear slow and boring. Human emotions are so complex and he plays on that beautifully in collaboration with a great source novel. Outstanding.",
            "review_date": "2016-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie that shows what happens when family isn't there for you (not a spoiler) and why you can't hide anything (not a spoiler).",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An entertaining and skillful film. Bravo, Bob Redford! Great script and memorable performances by Timothy Hutton, Donald Sutherland, Mary Tyler Moore and all!",
            "review_date": "2015-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In a film that has all the makings of the standard coming-of-age drama, Ordinary People tackles sensitive subject matter with poise and a rewarding sentiment.\nMainly following the life of Conrad Jarrett (a powerTimothy Hutton), we watch a a regular, suburban family adjust to normal life after the death of one of their children. We are introduced to a seemingly normal, functioning family with Conrad at its focal point, from the audience's view at least. He engages in normal teenage activities: he rides to school in the backseat of his rowdy friends car, attends swim practice, and goes home to eat dinner with his pristine mother (Mary Tyler Moore) and his soft-spoken father (Donald Sutherland). All seems right on the surface but the film's uneasy tone never wavers as the frailties of the family slowly begins to unfold.\nThe film moves at a somewhat leisurely pace but it is never tiresome. In fact is effortless and allows each character to reveal their intricacies without bombarding the viewer.\nThe film deals with tragedy and suicide with care, and does not dwell on melodramatic expose. Each character's insecurity is hinted at but it is never too explicit where the audience need not discover it for themselves. Redford allows the viewer to empathize with each character by their own notion and presents the events in a way that shows without telling.\nMuch of these emotions and complexities are drawn out by a family psychologist Dr. Berger (Judd Hirsch) who operates with a calmness and assurance that couples well with Hutton's performance. Hirsch does a marvelous job here as the seasoned doctor who meets with Conrad and evokes his true emotions about his brother's death not by textbook questions but by establishment of trust and transparency. Hirsch and Hutton work well here and the dialogue is natural and effortless, reminds me of a young Matt Damon and Robin Williams conversing in a similar setting in Good Will Hunting. \nAnother couple that work well together with matching acting prowess is Tyler Moore and Sutherland. Playing the dichotomous couple who battle between acceptance and catharsis in the face of the tragedy, both actors nail their roles as the conscientious mother who struggles to create an intimacy with her son, and the quiet, agreeable father who attempts to find a common ground between the two polarized members of his family, respectively. Tyler Moore is unforgiving and tragic in her own sense as later scenes in the movie reveal but the film never leans in her favor. Alvin Sargent and Nancy Dowd, who wrote the screenplay, never neglect to give each character their own light and allows each character to operate effectively in separate scenes. \nHowever, the best scenes in the movie I think involve the supporting characters. the most revealing instances are between Conrad and his two female interests. It's here we are able to connect with Conrad and get a real feel for his pain. One scene has Conrad meeting with his friend from the psychiatric hospital Karen (Dinah Manoff) and they share the details of their life after their encounter. We can see Conrad's struggle discern his own condition in comparison to Karen's. We can see for ourselves the insincerity of his upbeat attitude and his attempt at normality. Director Robert Redford helps bring vibrancy to the film and we see a part of the story develop rather than unfold. It's at these moments we understand the struggle Conrad face's with his own emotional turmoil and we can see his only two connections with happiness left; although one character embodies happiness in the past, the other in the future. \nAt the beginning and end, a version of Pachelbel's Canon rings out; a beautiful, grand composition that works as a synecdoche. To dip into musical terms, Pachelbel utilizes counterpoint, or a feature of music where every section plays their own tune at different times, yet the entirety of the piece sounds in harmony. It's a nice testament to the film, where each roles resonates solo and fortissimo, anchored by the unwavering performances of the cast. Yet the true genius of the film does not just lie in the players, but by the sure-handed direction of Robert Redford in his extraordinary debut.",
            "review_date": "2015-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The whole film itself is not a particular favorite of mine, being dark and bleak from start to end, but Timothy Hutton delivers one of the finest performances by an actor I have ever seen and is backed by a strong cast.",
            "review_date": "2015-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fantastic portrayal of a families struggle to survive after a tragedy.  Really shows how depression and mental health were a very taboo subject in the past, even more so than they are currently.",
            "review_date": "2015-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A match made in Heaven of Hutton and Redford. Hotton's portrait sure do inspire many, who is about to make history in Hollywood.",
            "review_date": "2015-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Uh, what an emotional film. This definitely deserved to beat out raging bull for best picture. Donald Sutherland and Timothy Hutton are marvelous in their roles, and Robert Redford creates such a story that seems to lose all hope, even though it doesn't. Magnificent!",
            "review_date": "2015-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sad movie about dealing with loss. Feels dated, but a direction from Robert Redford and the performances help elevate it.",
            "review_date": "2015-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though well-meaning and emotionally complex, Robert Redford's Ordinary People is thoroughly manipulative on a terribly injudicious scale, and populated with self-pitiful characters.",
            "review_date": "2015-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Robert Redford's directorial debut remains a potent examination of a teen and his family grappling their way through loss, grief, guilt and rage. Alvin Sargent's script only falls into cliche in the way Judd Hirsch's character interacts with the suicidal teen. The skill of both Hirsch and Timothy Hutton rise above that and make it feel painfully realistic. Redford's film is often surprisingly restrained, tightly edited and utilizes John Bailey's exceptional cinematography enough to prevent the movie from falling into a sort of soap opera. But the truly magical aspect of this film's core is Mary Tyler Moore's performance as the mother/wife. Her performance is so brittle and yet uncomfortably realistic -- it often feels too intimate. The incredibly effective and intensely disconnected on-screen chemistry she and Hutton create is so brutal it can be hard to watch. With well over 30 years hindsight is interesting that Mary Tyler Moore never again managed to do what she did here again. It is one of Robert Redford's major feats that he was able to so subvert such a cultivated cultural iconic persona to such potently uncharted waters capturing such a sad and all too realistic depiction of a seemingly permanently damaged maternal relationship without making us hate her. We can't fully understand her struggle, but we can empathize. Despite its dismissal by the film elite -- this movie is uniquely masterful and so much more than a tear-jerker. And, Sutherland plays his role so well --- his character's helpless ability to understand either his son or his wife almost makes his character unforgettably disconnected to point of being invisible. Close to brilliant.",
            "review_date": "2015-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not bad, but \"Ordinary People\" marked the beginning of the chain of forgetable movies to win best picture in the 80's.",
            "review_date": "2015-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "82% on my Tomatometer.",
            "review_date": "2015-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A family film that deals with the aftermath of death. What Robert Redford focuses on in his directorial debut on how death affects us in the aftermath of what we wish should have been then what is. We all go through this time and it is a rough experience we face.",
            "review_date": "2015-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First half of the film I was thinking that not only the people are ordinary but also the film. However, the film improves a lot in the 2nd half and the characters evolve and the story unravels to reveal a quite heart wrenching plot.",
            "review_date": "2015-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very well acted story of a family imploding after the eldest sons death.Good picture but better than Raging Bull or Long good Friday?????",
            "review_date": "2015-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a good movie, great acting and directing. But this movie is slow, be prepared so not watch this at night. I liked this movie the drama is fun but at the end of the day a slow movie can bore people. To me it was good but not excellent.",
            "review_date": "2015-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lot of people were mad when this movie won best picture over Scorsese's Raging Bull. While I agree that Raging Bull was a better movie, the fact remains that this is still a good movie and there are definitely worse best picture winners(Titanic, Shakespeare in Love and Dances with Wolves). The cast were very good in this movie and thus they made the tension between the family members very believable. There are not a lot of drama movies that are better than this.",
            "review_date": "2015-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As much as I like this film it is one that I feel did not deserve a best picture Oscar. The acting nods were well deserved but the plot limped along and I was waiting for it to get its point across.",
            "review_date": "2015-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Conflicted and emotional with power, Robert Redford at his directorial debut resulted to be excellent when his skills done a nice presentation that ended in a acceptable note for the better without any resolution while the cast performed great. (A-)\n\n(Full review coming soon)",
            "review_date": "2015-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I only had time to watch the last 20 minutes before it expired from Netflix Instant tonight. But what struck me on this viewing is how great the editing is with those quiet flashback scenes intercut with characters processing the memories. The images just feel so authentic and emotional. Powerful stuff that holds up 35 years later. And of course the performances are still fantastic. The film is a little heavy handed at times, but for the most part, it holds me and brings me into this damaged world in such a strongly relatable way.",
            "review_date": "2015-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is there really such a thing as an \"ordinary person?\"",
            "review_date": "2015-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mary Tyler Moore is the star here",
            "review_date": "2015-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great understated drama.",
            "review_date": "2015-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very great movie with spectacular acting, a great story, and it is very emotional. I just thought it was a bit too long.",
            "review_date": "2015-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A character study/intimate look at a decaying American family. The performances are extraordinary. Donald Sutherland and Mary Tyler Moore are phenomenal as the struggling parents, one more sympathetic than the other. Timothy Hutton's performance, however, is one for all time. Conrad is one of the most interesting characters of any movie I've ever seen. He's complicated, thats why. Complicated like any teenager he represents. Few films shed light on these kinds of domestic issues, and especially, the complicated realm of depression.",
            "review_date": "2015-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very powerful film that will stick with you for years. Ordinary People is filled with great acting and a great story. I don't have much to say about this film but it's very good. The acting of this film just felt so real I didn't see actors playing characters I just saw real people and how they in real life because that's what this movie gets right it just feels so real like this actually does happen to a family when they lose someone in the family. If you like movies that deal with serious topics then your going to enjoy this movie. I really don't have much to say but go check this movie out.",
            "review_date": "2015-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one is special... Very special..",
            "review_date": "2014-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have to do my final on this film as a clinical analysis.  I actually ended up falling in love with the realness in the acting and writing.",
            "review_date": "2014-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Jarrett family is well-realized and Redford's direction is solid, but the script is overlong and its side characters are more like caricatures.",
            "review_date": "2014-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie was very boring and hard to follow. Not worth watching and definitely not worth winning the Best Picture Oscar of 1980!",
            "review_date": "2014-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "***Due to the recent RT changes that have basically ruined my past reviews, I mostly only giving a rating rather than a full review.***",
            "review_date": "2014-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most important film ever made. It is so hard to review this movie because it's devastatingly emotional and realistic in every scene. Overall it is among the best acted film ever and my god Timothy hutton was absolutely exceptional, actually he brings everything about how difficult it is to be a teenager at times when you're in such situation. This film seriously opened my mind. One of the best ever, A True Masterpiece.",
            "review_date": "2014-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Robert Redford's directorial debut deserved every Oscar it received and truly was best picture of 1980.  Essential.",
            "review_date": "2014-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Robert Redford's directorial debut doesn't transcend the label of \"Oscar Bait\", but it is a well-acted and often heart-felt film about family tension.",
            "review_date": "2014-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A compelling and perceptive examination of depression and familial issues",
            "review_date": "2014-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"I've seen all ordinary people turn their heads each day! So satisfied, I'm on my way!\" I'm not going to reference the John Legend song that is actually titled \"Ordinary People\", nor am I going to reference the more fitting song of the same name by \"The Kinks\", because I think everyone would kind of like to forget about the \"Soap Opera\" album. Man, as weird-looking as Mary Tyler Moore looks now, and as weird-looking as Donald Sutherland and Judd Hirsch have always been, I don't know how ordinary these people are. Not even the film's director looks like an ordinary person, although, outside of Hollywood, you might be more likely to find people who look as funny as the leads sooner than someone who looks as pretty as Robert Redford, which would explain why Redford chose to hide behind the camera with this film. Seriously though, I'd say that this was a pretty successful debut for Redford as a director, although, in all fairness, we are talking about Robert Redford, and in 1980, everyone was still on a high for films about brutal family dysfunction from \"Kramer vs. Kramer\", so of course the Oscars dug it. It helps that the film is actually good, at least about as much as it can be, even with its natural shortcomings.\n\nThough plenty interesting, this film's subject matter is relatively simple, with certain major characters whose intrigue is not truly realized until they really find their place into a tale of dysfunction which has only so much momentum and extensive consequentiality, and isn't even unique. I joke about this being some sort of an answer to \"Kramer vs. Kramer\", but this film takes from a lot of distinguished dramatic properties in its vein and time frame, being almost hopelessly predictable, particularly when it goes so deep into formula that it loses subtlety. The subtlety lapses are rare, and hardly considerable once they do fall into play, but whether they be within some theatrical writing, or within obvious imagery, they stand overemphasizing ambitious themes, at least until Robert Redford's direction overcompensates for the dramatic missteps. As a matter of fact, I don't know if extremes to the directorial thoughtfulness so much overcompensate for the subtlety issues, as much as the subtlety issues break up overly subdued direction, whose consistency begets flat style and sober atmosphere that gets fairly dull upon find a point in storytelling in which material really falls out. I've already dealt with how simple this story is in a lot of ways, so, naturally, the runtime of over two hours is a little questionable achieved through a whole lot of inconsequential, or at least meandering material whose excessiveness is stressed by its getting to be just plain repetitious, if not monotonous after a while. The film takes so long to get its points, losing a sense of progression that more it circles around a formulaic and relatively simple path in a limp manner that wears you down, almost to the point of driving the final product into underwhelminginess. The film would have made that descent if all of the meanderings weren't punctuated so sharply by solid heights in storytelling which shine a light on just how worthy this drama's subject matter is.\n\nThe film's story concept is familiar and rather straightforward in its dramatic momentum, but the themes of this drama are of great importance, focusing on how terrible of an impact a tragic event can have on a family and its individual members, on an emotional and cerebral level that is by no means as ordinary as the victims of these personal turmoils supposedly are. Considering the subtlety and intimacy of this drama, a lot of the effectiveness rests on the shoulders of screenwriter Alvin Sargent, whose script is rather monotonous in its dramatic and structural excessiveness, but clever enough to carry respectable grace, and a degree of subtlety with it, which humanizes thorough characterization and dramatic scene structuring as genuine. Sargent's script is tasteful and obviously inspired, yet it, quite frankly, is not especially remarkable, with Robert Redford's direction seeming a bit more inspired, even if it's debatable whether or not it has more flare. There's not much style to Redford's debut directorial performance, hardly ever even utilizing a score to liven up the thoughtfulness which all too often dulls down momentum that cannot afford to fall too much, - considering the natural shortcomings of the story and the monotony of the written storytelling - but goes pretty deep when it does hit, breaking up a few obvious visuals with genuine subtlety that ranges from tenderly engrossing to piercing. Those subtlety touches go a long way, not simply in establishing powerful highlights in this audacious, brutally realist drama, but in transcending natural and consequential shortcomings enough to resonate with real, honest emotion, and tight intimacy that, as one can imagine, largely thrives on the performances. If nothing manages to save this film as compelling, then it is the cast, and even then, the thinness of the drama results in a thinness in acting material, made up for in the case of Donald Sutherland and Mary Tyler Moore through electric charisma and chemistry, punctuated by glowing dramatic highlights that are more recurrent in the lead performance of the then-up-and-coming Timothy Hutton, whose quiet, but powerfully convincing portrayal of a depressed young man seeking peace of mind over traumatic situations, and settle ground with loved ones, is the true heart and soul of this subdued drama. These gifted talents truly bring life to the impact of this film, whose subtlety could have meant its downfall, but is largely realized enough to make an adequately compelling and often powerful final product.\n\nBottom line, the simplicity of the story is stressed by clichés, a few lapses in subtlety, a number of bland spots in direction, and dragging to storytelling, thus, the final product runs a strong risk of collapsing into underwhelmingness, transcended through the important themes, extensive scripting, heartfelt direction, and strong performances - the strongest of which being by Timothy Hutton - which secure Robert Redford's \"Ordinary People\" as an ultimately rewardingly sound study on the struggles of dysfunction and facing harsh realities about what can happen to good people.\n\n3/5 - Good",
            "review_date": "2014-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can see why this film won its Oscars.",
            "review_date": "2014-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit dated, but still potent melodramatic study of a family in crisis. Timothy Hutton has never been more effective and Mary Tyler-Moore is simply outstanding.",
            "review_date": "2014-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A look into the human psychology and heart of depression is something hardly anyone likes to express. Not only does it tell the suffering of a privileged family trying to paint a perfect, disingenuously stiff picture of a \"normal\" household, but also the sufferings an everyday human being may encounter.\n\n   Ordinary People is about the Jaretts. They are printed as this wealthy, standard and ideal family living an \"American Dream\". This was something people wanted in the seventies and eighties that was difficult to achieve and now it is more common. Calvin and Beth are the heads of the family while Conrad and Buck are their sons. One of them was the favorite and the other was underappreciated. In a matter of sudden tragedy, Buck dies when he drowns in Lake Michigan. \n\n   Conrad was with him that day trying to save him, giving him an intense set of grief and trauma, which leads to a probable PTSD. After the death of his idolized brother, Conrad is suicidal and depressed, can't help but thinking he should have been the one that lost his life. Worst of all, his parents, Beth in particular, doesn't give him support of discarding that belief but virtually, yet unintentionally encourage it. It is clear that Beth loves her son but one can tell that she adored and was proud of Buck, expressing conflicting matches with Conrad and that reveals her bitterness and how she deals with a parent's worse nightmare.\n\n  Calvin on the other hand is passive, seeming to be in the middle of his wife and son. As the head of the household, on what the husband should do according to fixed mindset of the seventies, fathers and husbands are not supposed to express grief or emotions period. They are \"supposed\" to protect the family. With his other son's death, Calvin feels like he failed ultimately as a protector and as a father. He doesn't show it right away, though. He doesn't know how to deal with the effects of a death because the Jaretts are so busy trying to look like shiny gold to others that they are actually disintegrating their family.\n\n  Moore plays a hardened, bitter part that is disliked as a character but audiences, especially women that have been in Beth's shoes, feel empathy for her. It is a great role for her. Sutherland is also spectacular in Calvin's submissive behavior. He creates a fine, quiet portrayal as a stuck husband and father. But it is Hutton who breaks the ice. He gives such a raw and emotionally devastating performance, not only capturing the mental illness and emotions, but embodying Conrad's humanity. He deserved the Oscar, though he was the lead, I guess Sutherland and Moore were more famous and were top billed and Robert De Niro's stupendous turn in Raging Bull would have hurt Hutton's chances.\n\n  Robert Redford is another extraordinary aspect of the film. He takes careful consideration and rich emotion that he draws you into the movie with such grace that gave him the Oscar for Best Director.\n\n Ordinary People also won Best Picture, though many people were bitter that Raging Bull was \"robbed\", I would have also chosen Ordinary People. Raging Bull deserved the award as well, but Ordinary People hits right at home with people forced to deal with this heavy reality.",
            "review_date": "2014-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The performances are good and the directing is good but when it all comes together it's just eh. Timothy Hutton is wonderful and so is Mary Tyler Moore but there was something missing from this movie but I don't know what",
            "review_date": "2014-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beutiful and strong willing movie. Crude truth, no one is always open to handle",
            "review_date": "2014-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's very little interesting about upper-middle-class white people being angsty and having Big Family Problems, but I guess this did it as well as any.",
            "review_date": "2014-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Timothy Hutton's performance had impressive depth for someone who was only 20 years old at the time, though I can't help but feel as if this film would have been greater if more scenes were devoted to Dr. Berger.",
            "review_date": "2014-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most people who watch \"Ordinary People\" today, 35 years on, surely do so because they're Oscar completists. For most people making their way through the list, it's probably one of the last Best Picture winners they make themselves sit down and watch. It's acquired an unfortunate reputation as being one of the Academy's \"mistakes,\" since it beat the more stylistically-challenging \"Raging Bull.\" The reason that's unfortunate is that it's unfair to the movie, which taken on its own terms is a perceptive examination of a family's grief.\n\nIn honoring \"Ordinary People\" with the Best Picture and Best Director statues, Hollywood awarded for the first time one of its most genial figures, Robert Redford. As his directorial debut this is, appropriate enough, a genial movie. But it is difficult to explain why it is a good movie without explaining why it is not a great movie. It is a serious film that deals with death and suicide and broken homes, but it must be acknowledged even by the sympathetic reviewer that its handling of these issues is not much more serious or creative than a \"Very Special Episode\" of some '80s or '90s TV drama. It focuses squarely, all too squarely, on the \"humanity\" of its characters, and it hand-holds the audience through the plot all too gently. It feels, if not preachy, then like a therapy session that we've been assigned to attend because we have not been sufficiently attentive to the pain within ourselves and others. The always-on, always-sensitive tone of this kind of storytelling can be exhausting because it lacks the temporary relief that a little cynicism and distance can provide. The movie demands that you care for all of its characters all the time. This is a tough ask under the best of conditions, but especially when the characters hew too close to stock stereotypes. The high school students all fall pretty neatly into the standard categories of brainless jocks and quirky loners, and the parents are the overly-busy, clueless, grown-apart kinds we've seen before. At the beginning, Redford's directorial style, with its straight-on symmetrical shots of a dining room table and a camera that looks back and forth at people having a conversation like a crowd looks at a tennis match, seems equally unoriginal, but this decision actually pays off toward the end when the same pace simplicity are used to cross-cut a flashback sequence. In the latter case, the person having the flashback is really having a long-delayed, straightforward dialogue with himself, and the visual style suits this culmination well. Yet it is, after all, much like other revelatory and epiphany-creating flashbacks in film and TV.\n\nThe ordinariness of \"Ordinary People\" is probably held against it more than it would be had it not won its Oscars, but at the same time far fewer people would probably watch it today had it not won them. And that would be a shame, because despite its shortcomings, it is an occasionally very perceptive film. For all the times it is too \"on the nose\" with a song choice (\"Hallelujah\" when a character is happy) or a line of dialogue (how many times has \"I miss him too, you know!\" been declaimed on screen?), there are also moments of real observational insight, as when an introverted character presses the \"close door\" button on an elevator rather than risk a social encounter. That rings true, and thankfully it happens without being directly commented upon. The movie also casts Donald Sutherland and Mary Tyler Moore against type, which is interesting to see. To watch \"Ordinary People\" is to be reminded that Redford is, by all appearances, a refreshingly warmhearted and compassionate celebrity in an industry that too often rewards egoists and borderline sociopaths. I may be in a minority, but I frankly think it's nice that movies like this can and do win Best Picture over movies that are superior in technique but colder and bleaker in outlook.",
            "review_date": "2014-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant character-driven drama.  Incredibly emotional and psychologically intense.  Explores how one event can change the lives within a family, and the repercussions of those changes.\n\nScript is solid but it is Robert Redford's direction that makes the movie.  The lingering, haunting looks, the perfect body language of the actors, the pacing.  Despite being a movie with little \"action\", so to speak, mostly dialogue, there is no padding, or drifting.  It is never boring, and always very enthralling.\n\nGreat performances all round.  Nobody puts a foot wrong.  Timothy Hutton, in only his second cinema movie, got a Best Supporting Actor Oscar, though he was arguably the lead actor in the movie.  \n\nMary Tyler Moore got a Best Actress nomination and Judd Hirsch a best Supporting Actor nomination, and both of these were well-deserved.  Moore's performance was probably the standout in the movie, especially as she was predominantly a comedy actress.  There was nothing funny about her performance here: its intensity sets the tone for the movie.\n\nDonald Sutherland's performance is no less great, despite the lack of nomination.\n\nGood support from Elizabeth McGovern and Dinah Manoff.",
            "review_date": "2014-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ordinary People is perhaps an unusual choice for Best Picture given the Academy's history. But the film remains relevant with strong performances from the cast, an engaging story and an excellent directorial debut from Robert Redford.\n\nOn TV's House, Wilson's office is decorated with movie posters - originally Orson Welles' Touch of Evil and Alfred Hitchcock's Vertigo. But when questioned at a press conference, actor Robert Sean Leonard said that Ordinary People was a poster he would like to see in an oncologist's office.  One of his personal favourites, Leonard has called the film \"a fascinating study of human relations and familial relations and human interaction\". For a doctor who duels with a disease that destroys lives and families, often as much a counsellor as a physician, Ordinary People is a film his patients may be encouraged to know he is a fan of. The producers of House soon added an Ordinary People poster to the set.\n\nAs for the film itself, it is quite right to call it a fascinating study of a family struggling to move on from the tragedy of losing a son.\n\nInitially it seems that their surviving son Conrad, (Timothy Hutton) is the one having the hardest time coming to terms with the death of his older brother, Buck. Conrad was with Buck when he died in a boating accident and has just been released from a psychiatric hospital following a suicide attempt.\n\nThe normal teenage dilemma of finding his identity compounds his struggle to resume his life from before his brother's death and his suicide attempt as he questions his taste for his previous interests and what, if anything, he has in common with his old friends. At his father's insistence he starts seeing psychiatrist Dr Burge (Judd Hirsch) who delivers a tough-love approach of challenging Conrad, with understanding but without pity, in scenes that remind one of those between Robin Williams and Matt Damon in Good Will Hunting. Increasingly willing to turn a new leaf in his life Conrad begins dating Jeannie (Elizabeth McGovern), a girl from his school.\n\nBut as the film progresses, we see that Conrad is not the only one struggling for peace. His father Calvin (Donald Sutherland) is also finding it difficult to take an interest in his former career and friends. An awkward nice guy who is afraid of confrontation, Calvin feels he is the only thing holding the family together. Caught between a son self-destructing and a wife in deep denial, the family rift tears Calvin apart until he begins to question whether the family can or should be held together at all.\n\nMother of the family, Beth, is probably the most interesting character in the film, wonderfully portrayed by Mary Tyler Moore. She stubbornly resists any external show of the emotional turmoil she undoubtedly feels. She inexplicably gives priority to keeping up appearances and wants to give no one outside the family any inkling of their troubles or to create scandal or reason for gossip. But her pretence extends within the family where her denial comes across as cold, disconnected and utterly uncaring, particularly as she seems to have elevated her dead son to a position of saintly perfection that only exists in her mind and leaves her surviving son feeling unloved and unable to live up to the image of his dead brother. Calvin increasingly has to play referee between his wife and his son until Beth faces a choice between finally confronting her misery or breaking up the family.\n\nOrdinary People became a box office success and produced career turning performances for a number of participants. Judd Hirsh and Mary Tyler Moore, previously best known for their work in TV sitcoms, managed to challenge preconceptions with stirring dramatic performances. The film gave Elizabeth McGovern, now best known for her role in Downton Abbey, her first major role. Most of all, the film is Robert Redford's directional debut. Redford shows considerable maturity, restraint and subtlety to allow the characters, their dialogue and the plot to speak for themselves rather than spoil the story with over-direction, misplaced innovation or unnecessary emphasis. Instances that may seem cliché to a modern audience - such as where Calvin jogs, his mind burdened with thoughts until he stumbles overwhelmed - are few and forgivable.\n\nThe film was well acknowledged with six Academy Award nominations in 1980, winning four - Best Adapted Screenplay, Best Supporting Actor (Hutton, although it could be argued that his was the lead role), Best Director for Redford and Best Film over The Coal Miner's Daughter and Raging Bull.\n\nThis was a strange time in the history of the Academy. The previous year, another family drama, Kramer vs. Kramer, cleaned up over the brilliant and much fancied Apocalypse Now. It is difficult to elucidate exactly what went on here and why the academy got a sudden taste for private familial dramas of ordinary people over its usual preference for historical events, biopics, epics and stories of overcoming social injustice.\n\nMost likely nothing was going on here and both Kramer vs. Kramer and Ordinary People represent no deviation from the Academy's usual taste for solid performances and safe choices. The success of Ordinary People certainly befits the solid performances in writing, acting and direction.",
            "review_date": "2014-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ordinary People definitely deserved the Oscar nominations for acting, but how did this movie win Best Picture? Keep in mind, 1980 was also the year that The Empire Strikes Back, Raging Bull, Airplane! and The Shining and were released in theaters. Timothy Hutton gives a remarkable performance as the troubled Conrad Jarrett, but the story is flat and the editing is a bit sloppy. What is with the Academy Awards in the early 80s?",
            "review_date": "2014-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Redford's classic was deserving of praise. From the score to the acting, this remains a powerful film and likely inspired hundreds of inside looks into how family members interact with one another.",
            "review_date": "2014-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest discoveries are internal ones, and this intelligent script portrays the inner adventures of a young man named Conrad and the people important to him. We quickly learn the family lost their oldest son, but we don't know how. Only Conrad can tell us and that's unlikely since he was recently released from the hospital after trying to end his own life. Over the course of the film, the skill of unprejudiced listening is introduced, treasured, and honed. Director Redford practices what the story preaches, allowing us to sit in silences with the characters and listen to the truths - something perhaps too risky for modern movies.",
            "review_date": "2014-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What I've always liked about the movie is that it never has any delusions about the characters so the ending doesn't have an false notes.",
            "review_date": "2013-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ordinary People = rather ordinary movie.\nIt's a drama about a family trying to cope following the death of one of the sons. The acting is very good, especially Timothy Hutton who won a Supporting Actor Oscar, but I felt the movie would have been more powerful if the family weren't of an affluent background.\nPersonally, I can't believe this won the Best Film Oscar over Raging Bull!",
            "review_date": "2013-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely incredible movie.",
            "review_date": "2013-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Staggeringly powerful. Ordinary People is a psychological masterpiece; a true gem.",
            "review_date": "2013-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Redford nails it in his directorial debut in that he so skillfully is able to allow anyone from any walk of life to relate to this upper middleclass family's dysfunction in dealing with tragedy and its aftermath. Redford so superbly shows how the characters are able and unable to empathize with the ones they supposedly care the most about. .  It is a definite blast from the past that proves itself timeless in our quest to be human and to, sadly, relate to those, even in our own families, that cannot be tolerable. It was a 180 departure for Mary Tyler Moore - who we all fell in love with as lovable Mary Richards from the Mary Tyler Moore show who Redford transforms into Beth Jarrett, a self absorbed phony who has no capacity for love and is only concerned about outward appearances which trumps the health and well being of her own son.",
            "review_date": "2013-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beth Jarrett  (Moore) is a repressed mother whose favorite son died, leaving her with another (Hutton) she can barely tolerate. Redford's  directoral debut is impressive, and an absolute must see. Oscar winner for picture, director, actor (Hutton) , and screenplay (Alvin Sargent).",
            "review_date": "2013-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies I've ever seen",
            "review_date": "2013-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies I've ever seen",
            "review_date": "2013-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Donald Sutherland and Mary Tyler Moore give stellar performances. Robert Redford's dramatic depiction of upper middle class life is a teensy bit soap opera-ish",
            "review_date": "2013-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a cold character Moore plays. Great characters in this movie. Sad how ppl care so much about what other ppl think that they would rather let the ppl they care about destruct. Great lessons in this movie.",
            "review_date": "2013-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe it was the filmmaking style but the pace of the film was very monotonous. Aside from that performances were great especially from Mary Tyler Moore. Her parental choices and attitude are conflicting - making her character very interesting.",
            "review_date": "2013-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting and moving!!",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ordinary People may be overrated, but it's great acting and relatable story are undeniably classic.",
            "review_date": "2013-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The course of the events is mostly clumsy and despite some very good scenes, the whole directing work is static, annoying and trivial.\nThe screenplay isn't also one to remark.\nHowever, the realism of some moments, the interaction between the characters seems so real, mainly thanks to the stunning performances of the three main actors, that the film could remind moments of someone's own life.\nWe also find some forgettable scenes, untruthful ones, saved by the very emotive ones. Those make this film worth watching.",
            "review_date": "2013-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You know those movies you watch in which it's so depressing, you have to watch some cartoons just to cheer you up? Yeah. This was one of those movies. \nAnyway, a fantastic wave of character development here, as well as story progression. Extremely impressed, but maybe forever troubled.",
            "review_date": "2013-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all time favorite movies. Emotionally powerful and engaging.  And for many who grew up in that time so very very easy to relate to.  Mary Tyler-Moore is the consummate actress and indeed all the cast are truly wonderful.",
            "review_date": "2013-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Before watching Ordinary People, the directorial debut form Robert Redford, all I knew was it was the movie that beat Raging BuIl at the 1980 Oscars.  Not just for Best Picture, but also beating Scorsese for Best Director.  This has gone down as one of the great cock-ups in Oscar history, possibly only outweighed a decade later when Scorsese was again beaten.  This time it was his undisputed masterpiece Goodfellas, losing to the Kevin Costner wank-fest Dances With Wolves.  It must have taken the entire Academy working together to make a mistake that big.\n\nSo, does Ordinary People deserve to be remembered for more than just ruing Martin Scorsese's night in March 1981?  The answer is...  Sort of?\n\nFULL REVIEW AT\nhttp://boredanddangerousblog.wordpress.com/2013/06/19/movie-ordinary-people-1980/",
            "review_date": "2013-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would give this movie four stars, because I think it was that good. But man, it was just hard to watch. So angst-ridden. I have trouble with those movies, but the acting was so, so good. Mary Tyler Moore was awesome, so were Sutherland and Hutton. Deserving of all the accolades, just not up my alley.",
            "review_date": "2013-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is almost as sad as it is well acted.",
            "review_date": "2013-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sad, at times depressing story, but a well-directed, beautifully acted film. Robert Redford made his directorial debut with his adaptation of Judith Guest's novel \"Ordinary People,\" and the movie is at times hard to watch, but it accurately captures the lifestyle of a family coping with a terrible loss. The whole cast is terrific, but it's Timothy Hutton's Oscar-winning performance that sticks with you the most.",
            "review_date": "2013-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Timothy Hutton gives one of the best acting performances I've ever seen.",
            "review_date": "2013-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A drama filled movie about ordinary people who grieve, come with baggage and often misunderstand each other. Meanwhile everything looks good to people on the outside.",
            "review_date": "2013-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hasn't age well at all.",
            "review_date": "2013-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fabulous acting by Timothy Hutton. Sad story",
            "review_date": "2013-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excellent portrait of the damages of a distant and socially obsessed mother.",
            "review_date": "2013-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nigh-perfect direction, script, and performances with fantastic editing and camerawork make Ordinary People a masterpiece.",
            "review_date": "2013-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay next on the 80's we have the first one that won from that decade, so here's Ordinary People.\n\nPlot: The film revolves around a high school boy named Conrad and his parents. After the death of his older brother Buck, Conrad has attempted suicide and has been in a psychiatry hospital for four months before going back to school and joining the swimming team. Meanwhile his mother tries to live life as if the death of Buck never happened by trying to keep the family as it once was while his father has trouble trying to connect with both of them. Eventually, Conrad begins to see a psychiatrist to try to deal with post-dramatic stress disorder and survivor's guilt from his brother's death.\n\nI don't want to start by just saying that with a good movie considering how simple that is to say...but I can't help it. It was. It had a nice story, the characters were very well acted, it was deep and sad and it was just...really good. They very clearly displayed what each character goes through after Buck died and it really shows how the rest of the family is tormented by it. Timothy Hutton as Conrad especially gave out a performance that make it very little wonder that he won an Oscar for his performance... except that his Oscar was for supporting actor and not leading. I say that because personally I felt he was the real main focus of the story. I mean Of coarse Beth and Calvin are part of the main focus of the story, but Conrad was more the person to pay attention to in my opinion. He was there when Buck died, he's the one that tried to commit suicide and is seeing a psychiatrist, he's trying to make things a little better for him at school with quitting the swimming team and starting to date a girl he likes, all while still being haunted and tortured by the stress and guilt of his brother's death. So with all that, I felt he was the main leading character and not really anyone else. But that's just my view on it. And even if he isn't, Beth and Calvin were still very good as the leading roles. Calvin especially I liked during the very end. One of the things I remembered really liking when I last watched the end of this film up till now was his last scene with Beth. I just really liked his monologue when he was talking to her - it was just really well written to me and he acted it out in a way the really went deep into who her character is and how he feels about it.\n\nAnd that's my review for Ordinary People. It had a good story, great performances, a little bit questionable as far as who are the leading or supporting roles but is altogether an enjoyable film.",
            "review_date": "2013-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A little dated, but good performances and they didn't back down on the ending.",
            "review_date": "2013-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Starts slow.  Strong theme and performances.  This kind of movie wouldn't even be made today (except by Independent Filmmakers) let alone win the Oscar for Best Picture.  Doesn't mean it's not good.  It's really good -- a time when filmmaking took its time with the story and characters.",
            "review_date": "2013-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What works for Redford's domestic dissection of a family burdened by trauma and strained relationships, is an adamant vow to not descend into the sentimental abyss of cliches that such a story can invite. Hutton is the backbone in what is obviously an actors movie. Although outdated in some aspects and maybe even outdone in recent times, it's deserving of the accolades given the era.",
            "review_date": "2013-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is not a fun movie by any means...but definitely a heart-wrencher. Does anyone else think the psychiatrist / patient relationship in this movie looks an awful lot like that in \"Good Will Hunting\"? Matt, Ben, what do you have to say for yourselves?",
            "review_date": "2013-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably quite good if you can get past how horribly depressing it is.",
            "review_date": "2013-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Robert Redford's family melodrama certainly drags in spots, but it's expertly crafted and well acted.",
            "review_date": "2013-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One year after Kramer vs Kramer wins best picture another family drama takes it home with Ordinary People. Out of fellow nominees I saw I preferred Elephant Man strongly, and I'm not sure about Raging Bull, but I still have deep respect for this film. It follows a family on the brink of a long built up crumble. I don't really like doing a synopsis, but what the suburban family has gone through was rough. A few scenes once the passiveness was over, had me on the brink of tears. I especially liked the dads performance, which I found like the whole film was genuine. The silent opening credits set a tone, and the film kept its heart the whole way through. The characters became more frank as the movie progressed and the character development was prestige. I felt some character confusion between Karen and the girl Conrad goes bowling with, but other than that it felt like a pure imitation of a family. Powerful family drama, and I'm glad I watched it.",
            "review_date": "2013-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ordinary People is a really good movie.  I like films that get better and better as they go along, and Ordinary People is a great example of a film that the last half hour was way better then the first half hour.  I also like it when a scene is intense, because of the acting, dialog, and emotion in it instead of just because there was a lot of action in it, and because it was suspenseful.  This film had a lot of really intense and really good scenes.  It is also one of the most well acted movies I have ever watched, and the acting to me seemed like it must have been the hardest type of acting to do.  The acting was very emotional and intense in the film, and that was why the film was so great.  The scene where Conrad (Timothy Hutton) talks to his therapist after he learns that his friend from the hospital just killed herself is one of the best scenes I have ever watched in any movie.  The final scene is also a great scene, but I won't spoil them for you.\n\nConrad (Timothy Hutton) has a lot of problems.  His older brother died in a boating accident, and drowned right in front of him so he has survivor's guilt.  It is a lot like the movie Stand By Me, because the brother was a star athlete and everybody loved him, so the younger brother feels like it should have been him who died.  The film is shows what the death of a child can do to a family.  He tried to kill himself and he was in the hospital for it, and he got held back a year in high school for it.  He has flashbacks of his brother drowning, and they show more and more of it as the film goes along.  He see's a therapist named Dr. Berger (Judd Hirsch), and his therapist is a really good one that is able to get a lot out of him.  However therapy was looked down on at the time.  During the time, people thought that you were weak if you saw a therapist, but now it is the opposite.\n\nHis mother Beth (Mary Tyler Moore) is really cold to him.  One scene he gives her a hug and she can't even hug him back.  Mary Tyler Moore does a great job of making you really dislike her, and I found myself hating her but you are supposed to.  She tries to act like everything is all right in the house, and she refuses to talk about their problems, and does everything she can to hide them.  She doesn't want anybody to know that Conrad is seeing a therapist, and the fact that he tried to kill himself was a big embarrassment to her.  She just makes matters worse for the family because she is so self-absorbed.  Conrad begins to think that she hates him.  There is a lot of intensity that builds up with that.  The fact that Conrad is so close to his father Calvin (Donald Sutherland) makes her look even worse.  Conrad and Calvin are both suffering, and the fact that she is so self absorbed catches up to her in the end, and they start saying things to her.  She just ignores all of their problems, and she hurts them by that, because she refuses to try to help herself, or her family.  She gets mad if one of them reveals any of their problems.  I found that I really liked everybody in the movie besides her.\n\nIt is a thought provoking film, and the stuff with Conrad made me think, like the fact that he said to his friend from the hospital that he misses the hospital made me think.  I think he missed it, because his home life is so bad that the hospital must have been better.  Plus because the mother was stubborn about admitting or facing any of their problems, he couldn't be helped in any way.  But at the hospital he was constantly getting help, and I think that is why he misses the hospital.  The girl who he was friends with at the hospital made me think about weather or not she was happy like she said she was.  It felt like she was putting on a mask, and hiding her struggles and it turned out that she was.  The film shows what will happen if you are always wearing a mask and if you are hiding your problems.  The film teaches that you should always be seeking help no matter what you think people will think of you.  That was the message or lesson that this film taught.\n\nThis was a great movie that had a secret message that you needed to think about, and figure out for yourself.  The message was one that all humans should learn if they don't already know it, because it will really help you.  The acting is phenomenal, and I felt like Donald Sutherland, Mary Tyler Moore, Judd Hirsch, and Timothy Hutton gave performances that were good enough for academy awards.  Timothy Hutton did win an award for best actor, and Judd Hirsch, and Mary Tyler Moore were nominated.  The film won best picture that year, and Robert Redford won best director, and it was his directorial debut that he won for.  Alvin Sargent did win the award for best screenplay too.  I must say that I thought the film deserved all of the awards it got, and it was a great one.  Somebody may not like it, because it is slow, and it is sad, but if you are ok with that you will love it.  I would definitely recommend this.",
            "review_date": "2013-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nice but rather, well, ordinary film.",
            "review_date": "2013-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie, I hated the cold hearted Mother,  its a movie that's kinda sad.. I liked the ending.",
            "review_date": "2013-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really can't say much. Only that this is my FAVORITE MOVIE OF ALL TIME.",
            "review_date": "2013-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great performances, but lacks style. Definitely feels like Oscar bait, but it's still a pretty good story nonetheless.",
            "review_date": "2013-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A dreary yet compassionate film about, to put it bluntly, what's wrong with the world.",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is simply a film every family should watch, as it gives so much psychological insight into family dynamics.There is a great theme to this movie and that is forgiveness of self. A very powerful film.",
            "review_date": "2013-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent. Almost in tears. Outstanding performance by all characters.",
            "review_date": "2013-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An American Movie Classic! Raw and realistic performances.",
            "review_date": "2013-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Robert Redford's \"Ordinary People\" is a somber, solemn, poignant drama that almost takes the form of a stage play at times, but that never makes it feel like any less of a film. The acting from Donald Sutherland, Mary Tyler Moore, Timothy Hutton and Judd Hirsch is nothing short of amazing, and it's their multi-layered performances that give the film a majority of its emotional complexity. It ends without much closure, which is kind of aggravating, but \"Ordinary People\" is still an important, powerful film.",
            "review_date": "2013-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Redford should be credited for not only directing a solid family drama, but for pulling it off with low quality actors. Although, I've always liked Judd Hirsch, who probably would have been taken more seriously, if not for 'Alex Reiger.'",
            "review_date": "2013-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. That is one of the most powerfully moving movies I've ever seen. It took a while to build up to it, but it packs one of the hardest punches around.",
            "review_date": "2013-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One powerful movie-going experience",
            "review_date": "2013-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film that stole the title from my beloved Raging Bull,\nturns out to be a powerfully emotional tale about family, love, and life. A simple and delicate punch to your tear-ducts.",
            "review_date": "2013-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a complete movie.  A compelling story of grief and how it manifests itself in a middle class illinois family after the death of sibling.  Brilliant characters, acting and storytelling.",
            "review_date": "2013-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie gets to me everytime, an emotional powerhouse with top notch acting.",
            "review_date": "2012-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saturated with grief and regret, Ordinary People is a riveting, superbly acted directorial debut for Robert Redford.",
            "review_date": "2012-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a brilliant picture and a powerful directoral debut for Robert Redford.  Timothy Hutton and Donald Sutherland both play their parts well, but it is Mary Tyler Moore who truly shines.  In her subtle and painful performance, she truly drives this film.  This film is neither grand nor epic, but it still holds its power and its pertinence some 30 years later.",
            "review_date": "2012-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have no words. It is for sure one of the top 10.",
            "review_date": "2012-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Winner of 4 Oscars (including Best Picture), \"Ordinary People\" features Robert Redford's excellent directing on a not-so-ordinary family after the tragic death of a family member. Tense/sorrowful acting, dramatic story, & beautiful, yet sad music make this film one of the best of the 1980s!",
            "review_date": "2012-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderfully acted, nicely approached, with incendiary dialogue and fully fleshed characters, Ordinary People is a magnificent and poignant film that captures the messiness of human emotions and familial struggles in a fascinating way and it is a deserved Best Picture winner, even in the year of 'Raging Bull'.",
            "review_date": "2012-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This wasn't rated R when I saw it.",
            "review_date": "2012-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This wasn't rated R when I saw it.",
            "review_date": "2012-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring! Now no one mistake for someone who doesnt watch slow-paced films, all about the dialogue and acting...those are my favorite kind of films. But i draw the line somewhere...and this EXTREMELY slow film, with its soap opera acting and technically boring direction, is one of those films where i draw the line. Ordinary people over Raging Bull? I'm stunned and I wasn't even born yet.",
            "review_date": "2012-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After reading about the magic in the making of this film - through the eyes of the cinematographer (in an article he'd written for Psychoanalytic Inquiry, 1998) - I just had to revisit. Amazing to see so much of the story arc happening in emotional space, yet within such small physical confines. Not common these days. Very well done.",
            "review_date": "2012-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe not having any sign of extravagance and maybe playing it safe in some cases, Ordinary People is strong in what it does with the story, one that most can relate to along with great performances and the best portrayal of a teenager from Timothy Hutton.",
            "review_date": "2012-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original, perfect tragedy drama.",
            "review_date": "2012-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Considering its evident undeserving triumph over Raging Bull in the 1981 Academy Awards, this is a spectacular film that is unfortunately mostly remembered as that, an undeserved victory as Raging Bull was stamping itself on film history's front page. While pop culture and public opinion has made the true victor clear, Ordinary People should never be forgotten, and with a single viewing it never can be.",
            "review_date": "2012-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good emotional drama, but one of the weaker best picture winners.",
            "review_date": "2012-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WAAAAY ahead of it's time",
            "review_date": "2012-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bit depressing, but great work by all involved.",
            "review_date": "2012-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When i see a movie with an over abundence of 4-5 star ratings, My impulse is to see what all the hype is, Ordinary People was just average.\nIt's only Highlight was Timothy Hutton and Donald Sutherlands performance. I don't blame the actors- the fault lies with the Director.\nSure the movie covered some really serious and tragic matter, Honestly it was no deeper then Pollack and his overrated paintings. I shed no tears and felt no sympathy.",
            "review_date": "2012-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Normally not the type of movie that I like, and while I didn't think that this film was great, it kept my interest all the way through.  It's just a story of people dealing with their emotions (or in some instances, not dealing with them).  Therefore the movie lends itself to melodrama, which can get old, but mostly you keep watching to see if their lives completely fall apart.",
            "review_date": "2012-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Chilling. Absolutely chilling, even haunting. Some of the most realistic writing I've ever seen, with flawless acting to showcase it. Robert Redford seamlessly transfers  from an actor to a director.",
            "review_date": "2012-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie a perfect example of art imiating life. its such a raw and real movie about the average person and there family no wonder its called ordinary people, marry tylor moores acting was brilliant as well as timothy huton and donals southerland the ending scene with the father and son even made me cr because there are uch few people in real life have those feeling but never say them, i loved this movie.",
            "review_date": "2012-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ordinary People is a poignant and well crafted character study with fine performance from Moore and Hutton and thoughtful direction from Redford.",
            "review_date": "2012-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"ordinary people\" is a very well acted film from robert redford. the drama is often uncomfortably over dramatic, and it weakens the performance of the actors at times. there are a few minor plot holes that feel bigger than they really are, but for the most part, this is a well made and intelligent film.",
            "review_date": "2012-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fine example of subtle but affecting performances, Ordinary People is a fine film that keeps its audiences attention through out the families destruction.",
            "review_date": "2012-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfectly acted family drama, with professional direction from Redford. Unfortunately, Oscar winner Hutton would never pull off a performance like this again. And also just as unfortunate, to many moviegoers this will be remembered as \"the movie that robbed Raging Bull of a Best Picture\".",
            "review_date": "2012-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ordinary People doesn't pack the same emotional punch that it did back in 1980 because many films have mirrored the themes since then, and actors such as Judd Hirsch and Mary Tyler Moore are relatively unknown to today's generation so their branches-out performances don't seem as surprising to audiences, but since it's an exploration of emotional frailty amongst a \"normal\" family and is constantly realistic, it succeeds as an emotional venture into the psych of various family members.\n\nRobert Redford's directional debut is beautifully made with great film editing, proper cinematography and am unforgettable musical score. The story begins with shots of an ordinary neighbourhood while an emotionally rich song plays over the background, and from there we know that its going to be a simple and sad story. His direction elevates this story above mere melodrama and makes it artistic. He did an excellent job as a first-time director with a budget of only $6 Million, and he provided a front for actors to launch their careers or branch them out which is one of the best things a film can do for it's stars. His creation managed to give new meaning to the term \"Ordinary People\".\n\nDonald Sutherland takes the lead as the supportively unstable father of the Jarrett family and really plays the part convincingly, never overdoing anything or trying to be anything more than a caring father. His chemistry with various characters is what holds them together as a convincing family.\nTimothy Hutton however, is the man who steals the screen. In his film debut, he displays the ability to act as if he has been working in films for years, but in actuality it's all new to him. He brings tremendous strength to the role of a psychologically damaged teenager attempting to cope with several issues as if he is really still a boy that has gone through all of this and is being forced to relive it in Ordinary People. His performance displays raw talent that's difficult to find in film youth, and the fact that his career has been low profile since then is a terrible injustice, because I also loved his work on Taps.\nI've never seen The Dick Van Dyke Show or The Mary Tyler Moore show do my understanding of Mary Typer Moore is nothing, but her performance here as an emotionally fragile mother is a depiction of one that we all feel as if we have at one point in life. The facade Beth Jarrett puts up for her family is a difficult thing to deal with for her family, and it just brings a whole new level of drama to Ordinary People. Her performance was great.\nLastly, straight out of Taxi is the talented Judd Hirsch in an unexpected dramatic turn which is the kind of performance that can only be described as redefining. For once, a film features a psychiatrist in a more positive light as a friendly person, not just one trying to crack open someone's head for $200 an hour. Hirsch supplies great strength to his role as Dr. Tyrone C. Berger and is really the only consistently friendly character throughout the film which makes the tone a little lighter.\n\nOrdinary People is a difficult film to watch if you're emotionally weak, especially because of the emotional trauma of the characters and the ending, and since there's a constant sense of realism it may be found to hit a little close to home for some people, but it appeals to others for these same reasons, so Ordinary People is a very emotional venture that I wish I had seen when I was young so that I could learn more from it than watching it today.",
            "review_date": "2012-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic movie. Exceptional acting, and a story that is real and unexagerrrated in the way it is portrayed. It tells of how a family members death can tear a family apart. Macabre-like in a sense, and may not appeal to people who lean towards comedies. Near the conclusion, where Donald Sutherland is weeping at his dining room table (telling his wife that he doesn't know if he loves her anymore), is one of the best acting scenes I have ever seen. That scene presents about as real a dialogue as you will ever find.",
            "review_date": "2012-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie blows my mind.",
            "review_date": "2012-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's pretty sorrowful, but without Robert Redford's directing and the lead performance from the young Timothy Hutton, Ordinary people wouldn't be the same film it still is, an Oscar-worthy drama.",
            "review_date": "2012-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The performances were excellent but the story was so tedious that I desperately wanted the end to arrive. Sadly i had to wait over two hours.",
            "review_date": "2012-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All time favorite film...\n\nA sobering look at one wasp family's grappling- or lack thereof -of a family tragedy that ultimately brings truth to light.\n\nFilmed in suburban Chicago during the 1980s, Redford brings us into these peoples' lives without cliches.",
            "review_date": "2012-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "FIrst World problems.",
            "review_date": "2012-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Ordinary People' describes the family relationship in real sensitive matter that it almost becomes too much for the viewer to handle. Timothy Hutton plays the son dealing with his brother's death in a way that seems genuine, while Mary Tyler Moore and Donald Sutherland play the parents who try to hold back all attachment to their grief, which leads to a somewhat unsatisfying ending. But with Robert Redford's direction it's all displayed with a gentile touch.",
            "review_date": "2012-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good movie all around.",
            "review_date": "2012-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was one of those wire movies but good",
            "review_date": "2012-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shattering and brilliantly acted, Ordinary People uses the power of emotion and characterization to bring this painful story to life",
            "review_date": "2012-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "if you were ever to see this movie you would probably most likely want to comit sucide",
            "review_date": "2012-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is moving...if your not touched, your dead.",
            "review_date": "2012-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Holy cow. Good story, directing, and amazing acting in EVERY SINGLE SCENE.",
            "review_date": "2012-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good movie but not the masterpiece that critics made it out to be.  Great performances, especially by the frighteningly cold Mary Tyler Moore.  A solid directorial debut from Redford.",
            "review_date": "2012-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent! I haven't seen Raging Bull yet, but I think this film may have deserved Best Picture. I had never heard anything about this film other than that fact it \"stole\" Best Picture from Raging Bull, but I'm so glad I finally watched it. It's a timeless classic, that is among my favorite films of all time!\r\n\r\nThe title \"Ordinary People\" alludes to one the strongest elements of the film, the reality in it. The film basically follows a family after the tragic death of a son, and the attemped suicide of another son. The emotions, attitudes, and overall conflicts were so real. I truly felt like the film could have been about any ordinary person.\r\n\r\nThis film is perfectly acted! Timothy Hutton gives an absolutely phenomenal performance for which he received an Academy Award for Best Supporting Actor. His performance is one of the reasons this film is among my favorites. Mary Tyler Moore gives a completely missunderstood performance as the mother. It's probably a career best for her and she definitely deserved the Oscar nomination. Also, excellent performances by supporting actors Donald Sutherland and Judd Hirsch. All around, perfect main cast with a strong supporting cast as well.\r\n\r\nBravo, Robert Redford! \r\n\r\nWinner of 4 Academy Awards including Best Picture, Best Director, and Best Supporting Actor. Memorable performances, brilliant direction, touching, emotional...this is a powerhouse drama film that everyone needs to see. I completely recommend this masterpiece!",
            "review_date": "2012-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thoughtful, powerful and very emotional. Despite being 30 odd years old this film really didn't feel dated. Why can't Redford make films as good as this anymore?",
            "review_date": "2012-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Who knew that Mary Tyler Moore could be such a bitch... Good movie for a rainy Saturday overall",
            "review_date": "2012-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This saga of survivor's guilt, based on Judith Guest's poignant novel, was the first film directed by Robert Redford. It revolves around an \"ideal\" family that is forced to cope with the death of one of their own in a tragic boating accident. The focus is on Conrad (Timothy Hutton), a teen who can't shake the feeling that he should've been the one to perish instead of his brother. While he's helped by a psychiatrist (Judd Hirsch) and a blossoming romance with Jeanine (Elizabeth McGovern), his stricken parents (Donald Sutherland and Mary Tyler Moore) are unable to give him the support he needs. Ordinary People, which features a staggering performance from Moore, is a compelling film that is a bit overlooked considering that it won an Oscar for Best Picture.",
            "review_date": "2012-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At some point, the people you're watching cease to be actors and become a family facing an emotional crisis.",
            "review_date": "2012-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When you consider this was Redford's directorial debut and it won for Best Picture, you knew he'd be giving us many more outstanding films.  In addition, this was one of Judd Hirsch's first dramatic roles and he proved his broad acting ability.  Finally, I have always loved MTM, but it's her dramatic roles I love the most.  She always portrays her characters with such conviction.  \n\nGreat story about a family and their inner struggles to cope with tragic events.  Highly recommend this film.",
            "review_date": "2012-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good template for every indie drama that's come since, but Ordinary People hasn't aged so well itself. It actually comes across as a bit dull. Still, it's smart material and Timothy Hutton is up to the task. If only the 80s produced more like this one...",
            "review_date": "2012-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I decided to end my ordinary day with another look at the Oscar winning film \"Ordinary People\". I would have given the Best Picture Oscar that year to \"Raging Bull\" (as many also think), but one cannot defy the emotional power of \"Ordinary People\". Extraordinary performances from Donald Sutherland, Mary Tyler Moore, Judd Hirsch, and Timothy Hutton who won a Best Supporting Actor Oscar for his work. And to this day, \"Ordinary People\" is Robert Redford's best directorial effort.",
            "review_date": "2012-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was such a good book and a really good movie!",
            "review_date": "2012-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great cast in a long winded film.",
            "review_date": "2012-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Robert Redford's \"Ordinary People\" is an excellent film about love, family-ties, and moving on. This is an extraordinary film that explores deep and thoughtful messages with undeniable precision. Robert Redford directs his very first film with integrity and understanding of the subject. Redford leads this film with a highly perceptive and realistic approach. The cast is absolutely brilliant. Timothy Hutton delivers a terrific performance as a teenager who's guilt-ridden after his brother died. Hutton is powerful in many scenes and was deserving of the Academy Award he got for this film. Donald Sutherland and Mary Tyler Moore are great as the teenager's parents. This film can be hard to watch, because of the emotionally heavy subject matter, but otherwise there's no reason at all to miss it.  One of the greatest movies ever made about a family in a mid-life crisis.",
            "review_date": "2012-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A family drama carried by solid performances. While the story is rather straight forward, the movie is emotionally resonant like few others.",
            "review_date": "2012-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A touching film that doesn't quite stand the test of time.  Redford's direction is subtle and effective.  An actors' film above all else.",
            "review_date": "2012-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful film revolving around a family of three dealing with the death of a son lost at sea. Redford delivers a fine directorial debut with three powerhouse performers in the many ways a person deals with his/her grief.",
            "review_date": "2012-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a sad movie! MTM was unlike the lovable young MTM we all know!",
            "review_date": "2012-01-28",
            "source": "rt",
            "lang": "en"
        }
    ]
}