{
    "rating": 9.3,
    "release_date": "1980-05-23",
    "num_reviews": 170,
    "genres": [
        "Horror",
        "Mystery&thriller"
    ],
    "summary": "Jack Torrance (Jack Nicholson) becomes winter caretaker at the isolated Overlook Hotel in Colorado, hoping to cure his writer's block. He settles in along with his wife, Wendy (Shelley Duvall), and his son, Danny (Danny Lloyd), who is plagued by psychic premonitions. As Jack's writing goes nowhere and Danny's visions become more disturbing, Jack discovers the hotel's dark secrets and begins to unravel into a homicidal maniac hell-bent on terrorizing his family.",
    "reviews": [
        {
            "content": "It's not perfect at all, but it handles terror very well and is very entertaining. Jack Nicolson's performance is awesome!",
            "review_date": "2023-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly a masterpiece of Cinema! REDRUM",
            "review_date": "2023-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well it's a classic movie for horror. A must watch.",
            "review_date": "2023-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a must see!",
            "review_date": "2023-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably not terrifying compared to modern standards, but the set design, acting and overall filmmaking behind it definitely make it one of my all time favourites and something certainly worth watching.",
            "review_date": "2023-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best horror movie ever written, this is a true masterpiece of a thriller that is scary, thought provoking, and amazing with amazing cinematography and one of the first artsy movies I enjoyed. You must watch this movie at least once in your life.",
            "review_date": "2023-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An enthralling, almost hypnotizing experience.",
            "review_date": "2023-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible film by Stanley Kubrick. I don't watch movies often, but this surely was one to remember. It is different from the common horror film in it's slower progression, which i'm sure many didn't like, but the progression, atmosphere, and camerawork of this movie make it truly unique. It's take on horror is more gradual, deep, and connected, with actors who were purposefully chosen due to their \"imperfect/ugly\" appearances. Overall though, The Shining is a good movie for if you want a movie which is LESS like the original book with it's unique plot, and more of a different story with different characters overall. The movie also promotes many theories and leads to speculation, which if you don't look up the answers to them, can be a difficult challenge to try to answer yourself.\n\nDefinitely a good movie to watch with friends, and a great beginner horror-fan movie as well.",
            "review_date": "2023-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Horror Classic. The acting is phenomenal with perfect casting and real unease and tension amongst everyone that builds throughout. Jack Torrance is one of the best villains in any film with a beyond memorable performance that lingers well after the credits role. This film easily is not as iconic and memorable without Jack Nicholson being cast. Wendy & Danny are excellent also. The cinematography is phenomenal in making a bland location extremely memorable with amazing well framed and lit shots with terrific camerawork throughout. The music is incredibly creepy, memorable and varied which is a tremendous accomplishment as well. The pacing is flawless with the tension not just coming from the creepiness, music tone changes and surreal images but really the tension amongst Jack and the others as they slowly crack. The climax of the door axing is incredibly terrifying. The only problem is the editing and the abstractness that runs throughout this film from the middle to the end. While they are incredibly well done scenes on their own being very creepy and unsettling, they don't form or take away from the narrative at times. Perfect examples are scenes like Room 237, Mr. Grady, Wendy and the two guests in the room at the end, The Shining subplot, Redrum meaning, etc. I feel the ending shot should've been the only abstract scene left in similar to the open ending to The Thing (1982) and focused squarely on Jack going insane and leaving things sparsely open to interpretation as to why. This would've let the viewer fill in the gaps and because this is so well done it would've been easy for them to pain a picture far more terrifying than abstract. Key scenes like Jack at the bar and him writing should be left in to leave enough breadcrumbs for a viewer to form their own opinion but it definitely needed to tone down on the weird abstract scenes. It left me more scratching my head afterwards than terrified. Though it did that very well throughout as well. Anyone who is a Kubrick fan, a fan of any actors in this, or Horror films in general will love this.",
            "review_date": "2023-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has historically been criticized for not being \"too scary\" but that doesn't necessarily have to be a bad thing. It is still a peculiar thriller, and with the exception of a few fictitious elements, it could've counted as realistic. This is the problem; the decision was not clear on whether to take the fiction into consideration while writing the plot, or just use it as an appendage to an already-consistent plot, which resulted in a bit of hollowness. However, with taking the aforementioned into consideration or without it, Stanley Kubrick's pure artistry in filming should make The Shining a must-watch.",
            "review_date": "2023-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best Kubrick film.",
            "review_date": "2023-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The shining is so slow to do anything at first and then right when the “action” picks up its confusing and doesn’t make any sense ",
            "review_date": "2023-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Shinning(1980)\nBy: Abby Dickson \n\tAfter recently viewing The Shining (1980), directed by Stanley Kubrick I believe that it was spectacular. It was one of the scariest horror films I have ever seen. It is very unlike it novel by Stephen Kings The gorry music gave me chills all over my body, \n\tThe Shining is about the Torrance family Jack, Wendy, and five-year-old Danny. They go to a hotel that certainly has a supernatural presence that is affecting the family.\tThe movie details their tragic experience at the hotel and the toll that it takes on the family members.\nThe film was overall a great hit. Jack Nickelson's role was outstanding and when first seeing him, he seemed a little weird he is so light-hearted in the senses, especially the scary and horrific ones. In some sense, he uses so many quotable lines, but as we watch his sanity break down by whatever this presence is at this hotel is riveting. I loved the sense where we watch him stalk Shelly up the stairs.\nThe imagery in the film is by far haunting. From the twins at the end of the hallway to the blood coming out of the elevator. As well as the musical tone. It is very gorry and almost unsettling.    \n\tIt shows a bond between a family and goes on to appeal to the fear they feel while experiencing their horrific time at this hotel. It is a film that has inspired generations of horror film creators and directors. \n\tIf you are a horror guru then this movie is for you. It is by far one of the best horror movies I have ever seen. Although I do not recommend it as a family horror movie. The content in this film is for sure for older viewers. This film is overall amazing and very well expressed throughout. It is one of the top horror movies of all time.",
            "review_date": "2023-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie I will be reviewing is The Shining, directed by Stanley Kubrick.  The genre of this movie is horror, thriller, and psychological.  I love horror movies, and I have seen this a few times.  I enjoyed The Shining because it makes you think about what you're watching and keeps you on your toes.  The movie is based on the book from Stephen King.  \n\tThe main characters, Jack, Wendy, and their son, Danny go to an abandoned Overlook Hotel in colorado.  Jack is a writer and goes there to cure his writer's block.  Danny has visions and they start getting worse the longer that they are at the hotel.  Jack starts discovering the hotel's dark secrets and goes into a manic state, causing him to terrorize his family.  \n\tI like this film because of the horror and psychological sense of it.  I like the chilling feel that I get from the ghosts appearing in the hotel.  The uneasy music in the background adds to the eerie feeling.  The acting in this movie is unreal.  They really capture the characters from the novel.  The emotions that the actors provide are amazing.  The clothing is fitting for the time period and suits the theme.  For example, Danny has a spaceship on his shirt, and they show him playing with toys to provide the innocence of a child.  The movie really captures how a normal family can switch instantly.  \n\tThe theme that I got from The Shining is fearing paranormal activity and isolation.  The themes showed me how paranormal activity can be very sinister.  The isolation theme showed me how much isolation can cause a manic state.  It shows how being alone can cause you to do things that you never thought of doing.  I think others can learn how isolation and paranormal activity can cause mania, and others can see what it's like for people to switch like Jack does.  \n\tIf you love psychological and horror movies, The Shining is a great movie to watch.  I would recommend this movie to horror movie lovers.  I wouldn't recommend this movie to people who feel uncomfortable with seeing mental illness decline, and people who get spooked easily because it could cause a ton of uneasiness.  Overall, The Shining is a great film to watch if you love horror and psychological movies.  \n Rating: ****",
            "review_date": "2023-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite horror movie I watched a hundred times very good despite being all that and a great movie",
            "review_date": "2023-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I`ve decided to rewatch this movie after many years of watching it for the first time and to be honest its not as good as i remember, the movie is pretty average and hardly horrifying, Story is not interesting and the only good thing in the movie is Jack Nicholson acting he is phenomenal and fit the maniac character very well with his facial expression and the way he behaves its just great however the other cast are nothing but mediocre, I'd like to say the beginning shots of the movie with the scenery and mountains and throughout the movie were beautiful.\n\nthe main reason for rewatching it is because im planning to watch Doctor Sleep and wanted to recollect what happened in the first movie. \n\ni can't really recommend the movie unless of course, you want to watch it for the sake of nostalgia then go ahead but for me i found it to be boring and long \n\n5/10",
            "review_date": "2023-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In all honesty, this was only my second time ever watching this. I felt like I might have watched a different version of the film this time. I didn't connect to it as much this time around, and it was a lot shorter.\n\nI absolutely love how the film opens up. That opening shot in the mountains, was just beautifully done.\n\nI've always heard about how Shelley Duvall was bitter about this movie cause of the way she was treated and that all the accolades fell on Jack. She has no right to be mad about that. In my opinion, she doesn't deserve any praise for this role. Her performance was mediocre and forgettable. She should be happy that people remember her at all. \n\nWe all know that this movie is all about Jack. He was a walking highlight reel in this role. He did no wrong in this movie. His subtle facial expressions, his breathing, the way he walked, every little thing he did was just spot on. \n\nMy favorite scene was the confrontation between Jack and Wendy in the Colorado room. Jack mimics Wendy, and repeats the \"as soon as possible\" line. \n\nAfter this second viewing, I currently feel like this movie isn't worth all the hype. I need to watch the regular long version again in a few months, and write another review. \n\nDo I seriously need to recommend this film? Of course you should watch this. Just make sure you're watching the king cut.\n\nThis film gets a LennyReviewz Score of: 7/10",
            "review_date": "2023-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is the best movie ever!",
            "review_date": "2023-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love how Kubrick uses camera angles and technical tools to make this movie. Altouhh ot was produces 40 years ago, I think think it still holds up.",
            "review_date": "2023-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it has a good plot story with no explanation its the shining thing which drove the dad insane but it is only used at the house but it can be seen in other times outside it but the son has the same thing he doesn't go insane and neither does the guy who used to keep the house in shape but it my be a genetic thing explained by the person who was living in their he said his grandma had it to but it explains why the mother doesn't have it its mostly likely genetic but why did the dad go insane he was seeing stuff but i think maybe it is a curse but i don't know",
            "review_date": "2023-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie was Boring. Just a free trippy scenes. Ñofi bro a la merfi",
            "review_date": "2023-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A piece of art that never gets old. Always a good option for an horror movie.",
            "review_date": "2023-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stephan King does another amazing movie! Not very scary(in fact I haven't seen any horror movies that actually scared me) but during the final fight and stuff it was so intense! I highly recommend this movie to people!",
            "review_date": "2023-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Shining is a horror classic that has stood the test of time. Jack Nicholson gives a wild, unforgettable performance as Jack Torrance, a struggling writer who takes a job as a caretaker at an isolated hotel. His descent into madness is both chilling and captivating, and Nicholson's performance is nothing short of legendary. Shelley Duvall also delivers a strong performance as Jack's wife, Wendy, who becomes increasingly terrified as her husband's behavior becomes more erratic. The film is a masterclass in psychological horror, with its eerie atmosphere, unsettling imagery, and a relentless sense of dread. The film directed by Stanley Kubrick, who creates a visually stunning and suspenseful movie that is iconic in the horror genre. The Shining is a must-see for any fan of horror, and it's a film that will stay with you long after the credits have rolled. 9/10.",
            "review_date": "2023-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie was a thing to pass the time and it did in a very slow way. No joke, the movie goes so slow at times I swear if I were to go into the future by 10-20 minutes, the movie would have gone no where. Even Stephen King said he was disgusted in how the movie based on his book came out to be. Pretty Disappointed in Jack Nicholson and Stanley Kubrick in this one.",
            "review_date": "2023-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok unpopular opinion here.  Loved the book, hated the movie.  First off, let me state not a huge fan of Jack Nicholson, so that probably jaded my opinion.  I always think he plays one character.  Shelley Duvall is good as Wendy, as she feels like a woman who has had to deal with her abusive husband, and has been battered down by him.  Danny Lloyd was good as Danny, with it being his powers that bring the hotel to life.  But overall, I didn't care about the characters, it didn't seem too deep for Jack to fall, possibly because, to me, Jack seemed deranged anyway, before the hotel was able to get inside him.\n\nAnd don't get me started on the conspiracy nuts saying this was Stanley Kubrick saying he shot the moon landings...",
            "review_date": "2023-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Shining is a chilling horror film from the late, lauded director Stanley Kurbick, who deserves praise for faithfully adapting Stephen King's novel for the screen while offering viewers practically everything they could hope for in this kind of genre. Jack Nicholson gives a superb performance as Jack Torrence, a writer who slowly descends into madness as a result of being influenced by the dark, wicked spiritual forces that haunt the remote hotel in the Colorado mountains where he and his family are residing as wintertime caretakers. As a guy who is going insane because of the malevolent spirits that haunt the hotel, Nicholson is convincing as Jack. As Jack's wife Wendy, Shelley Duvuall is adequate but unmemorable.\n\nNote: 1 hr 59 min (119 min) (European) (cut)",
            "review_date": "2023-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Remarkably effective, The Shining doesn't contain as much gore and visual horror as most modern movies do, yet successively builds a troubling psychological experience thanks to its actors' performances and gloomy decor. The amalgamation of terrifying scenes that make up this masterpiece demonstrate Kubrick's skill, while also marking the viewer. Not to mention the film's score, which I believe is one of the best of its kind. A horror classic that has remained very frightening over time.",
            "review_date": "2023-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Suspense and terror film, with a voyage to the world of gory madness as background.  Made great by a legendary performance by Jack Nicholson.",
            "review_date": "2023-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good movie. Would recommend ",
            "review_date": "2023-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought Jack was a madman until I saw She-Hulk had a higher rating than this movie on Rotten Tomatoes. Now I relate to him",
            "review_date": "2022-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Shining is a horror film directed by Stanley Kubrick based on the novel of the same name by Stephen King. It tells the story of Jack Torrance, a struggling writer and recovering alcoholic who becomes the winter caretaker at the Overlook Hotel in the Rocky Mountains, accompanied by his wife Wendy and young son Danny. As they become isolated in the hotel during a snowstorm, Jack becomes increasingly erratic and violent, while Danny exhibits psychic abilities and begins to experience disturbing visions. The film explores themes of domestic abuse, failed fatherhood, and the impact of trauma on a family. It is known for its immersive cinematography, using the Steadicam to create a sense of momentum and disorientation, and its use of musical scores by György Ligeti and Krzysztof Penderecki to enhance the atmosphere of unease. The film has become a classic of the horror genre and has been analyzed for its various themes and symbols.",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A modern masterpiece.  Rightfully called one of the scariest movies of all time.  This is the undisputed paragon of haunted house epics. The Shining is essentially Stephen King's reboot of Shirley Jackson's 1959 haunted house epic The Haunting of Hill House; also about an evil supernaturally possessed house that draws people into it; a house with a sordid dark history and many deaths; with the purpose of absorbing people into it's lair; thereby absorbing their powers.  In both stories the inhabitants of the house have ESP; which is why the house has chosen them; and why it is trying to destroy and absorb them into it's interdimensional vortex.  The book is also inspired by Stephen King's experiences staying at the infamous Stanley Hotel in Estes Park Colorado; nestled in the heart of the Rocky Mountains.  He and his wife Tabitha stayed there in 1974 for one night; staying in the infamous room 217; and he was instantly transfixed and brainstormed the Shining story based on his real life creepy experiences there.  In addition the book is an allegory about King's own substance abuse; which was careening out of control in the late 70s; the story itself being a projection about his own fears about his illness, and the effects it could have on his wife and two small children.  So from all that we get The Shining.  The story is about the Torrance family;  Jack, Wendy and Danny;  and how they move into the Overlook hotel; a Colorado ski resort in the Rockies where several murders and mysterious deaths have occurred in the past.  Eventually it becomes clear the house is possessed and very much alive; and is attempting to manipulate Jack to kill Wendy and Danny; so that it can absorb Danny's considerable ESP powers.  The movie follows Jack's Exorcist-like deterioration from a mild mannered freelance writer to a demonic psychopath; who is being helped in his nefarious plot by the spirits in the house.  The grand sweep of Kubrick's direction is absolutely stunning; rare for a horror film to have such virtuosity behind the camera.  Kubrick infact helped invent and develop steadicam technology for this movie which continues to have an impact on film today.  King famously hated this movie; which makes sense; he is a fundamentally different artist than Kubrick.  Kubrick was an absurdist; and King is a romantic, (of the Edgar Allen Poe type).  And admittedly the movie isn't very faithful to the book.  But Kubrick's downcast scorched earth perspective; dissecting the characters from a microscope like a merciless scientist dissecting a squirming bug under glass; absolutely adds to the drama.  So much of the movie's effectiveness is just that devastating; psychotic mood; tension filled and terrifying; tension so thick you can cut it like a knife; which fills the screen as soon as the movie starts.  No one could have accomplished this dazzling, transfixing and terrifying mood better than Stanley Kubrick.  Inspite of King's misgivings about him; Kubrick was actually born to direct this movie. And there are so many stunning horror set pieces here.  The British Grady twins chanting in perfect, eerie unison; Danny big-wheeling across the miles of hardwood resort floors like he's in the Indiana 500; seeing horrific phantasmagoria all around him; Wendy stumbling upon the spirit of Horace Derwent and his bear-suited employee in compromising positions; and on and on; so many terrifying, effective scenes.  The movie is pitch perfect; there is not an off-key scene in the entire opus; they are all masterful and all work beautifully.  Easily one of the best movies ever made!  Highly recommend!",
            "review_date": "2022-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fails at horror and jump scares but succeeds in brilliant acting and directing.",
            "review_date": "2022-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "watching it was so pleasant even though it's supposed to be a disturbing movie. The direction was amazing and the acting plus the sound effects created such a scary atmosphere. You should put watching this movie in your bucket list, seriously.",
            "review_date": "2022-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty Good Honestly. All The Iconic Scenes and Moments With Jack and Danny in The Hedge Maze. However The Ending Is a Bit Confusing and Weird/Stupid. Jack Just Sits Down In The Maze and Freezes. Then We See Him Inside The Party. Idk Maybe it's Just Me But Overall It Was Really Good.",
            "review_date": "2022-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nicholson is amazing in this. Funky and interesting story. Great effects for its time",
            "review_date": "2022-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is one of the best thrillers that Abdul has seen in his life.\nJack Nicholson is an amazing actor and he makes this role very well.",
            "review_date": "2022-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Other than Andrei Tarkovsky and perhaps and handful of others, it's hard to imagine a director with more visual awareness than Stanley Kubrick.  While not his best film, The Shining is filled with unforgettable imagery – beautifully composed shots, remarkable camera movement, perfectly blocked scenes.  Set in the snowy mountains of Colorado, Jack Torrance (Jack Nicholson), teacher and writer, accepts an assignment as a winter caretaker at a remote luxury hotel with a macabre history.  With wife (Shelley Duvall) and son (Danny Lloyd) in tow, things soon begin to spiral out of control.  On top of the visuals, the acting is top-notch and the score is appropriately eerie.  Does it drag at times?  Certainly.  Is it for all tastes?  No.  But even in the dull moments, it is beautiful to look at.",
            "review_date": "2022-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Took me 28 years to finally watch this movie. It was long, not very scary. Truthfully don't know what this movie was trying to do. Glad I watched it but it wont be in my rotation.",
            "review_date": "2022-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film so horrifyingly shot and convincingly acted that the very ground on which you walk seems haunted in itself. Perhaps the greatest horror film ever made.",
            "review_date": "2022-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best if not the best horror movie ever made. Jack Nicholson plays the part to perfection as does Shelley Duvall.",
            "review_date": "2022-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The  film is amazing  Stanly kubrick  could epic itis unfortunate that the academy awards jack Nicholson not nominated   jack Nicholson was worth nominated l am Egyptian",
            "review_date": "2022-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've seen this movie many times but my most recent viewing I really analyzed it and came to the determination that it's really not that great of a movie. I know that Shelley Duvall was basically harassed by Kubrick while shooting the film but her character is nevertheless annoying to watch and basically just cries and screams throughout the movie. The pacing of the film is also kind of slow and could have been sped up while still building suspense. The storyline is also confusing, did Jack go crazy because of the isolation of being in the hotel or was he reincarnated as a person who had already been at the hotel 60 years previously? And does Wendy see the blood and ghosts at the end because she also has \"The Shining\" like Dann y",
            "review_date": "2022-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't get what people like about this movie.",
            "review_date": "2022-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My all time favorite film, can’t get enough of it. Always have to watch it in theaters every time it comes back.",
            "review_date": "2022-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliantly done scary horror movie.  A must see!",
            "review_date": "2022-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly horrifying movie that sends chills down my spine whenever there's 1920's music being played in a building. The plot's quite confusing, but the acting is superb.",
            "review_date": "2022-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My major problem with this film is that Jack Nicholson already looked crazy and its hard to fully grasps his character depths into madness.",
            "review_date": "2022-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "100% a must see for everyone",
            "review_date": "2022-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have no idea why anybody enjoys this movie.  The impact of the book hinges entirely upon the beautifully written and deeply fraught relationship between Jack and his son, Danny.  The true horror of the story is how the Overlook exploits Jack's love for his family coupled with his deeply human and relatable flaws ultimately culminating in supernatural possession.  The excreble Kubrick eschews this in favor of Jack Nicholson behaving like a drunken brute who cares nothing for his son and has contempt for his wife from the outset.  The later events of the movie have no impact because Jack was a drunken mean brute to begin with.  The only reason why this movie gets 1.5 stars rather than the .5 star it used to deserve is because doctor sleep managed to salvage something workable from the wreckage.",
            "review_date": "2022-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The shining is not a movie but an emotion for me. Right from the opening shot to the end credits, there is a very unsettling tone captured in the film and trust me as the movie reaches its exhilarating, tense and horrific finale, we are left glued to the screens and praying for our beloved characters to make it out alive from this nightmarish ordeal. To this day the words \"Here's Johnny\" sends shivers down my spine.",
            "review_date": "2022-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting is, for the most part, so... flamboyant, for lack of a better word. Some of Jack Nicholsen's faces create more hysterical laughter than hysteria. The scenes with Danny, and the girls, are equally ridiculous and comical. However, even during the laughs, there's a lot of tension building throughout, and it's the scenes with the family together, especially with Shelley Duvall, that are most unnerving. The greatest horror of the Shining is the tension between the family, cramped into a giant hotel. \n\nIt's a brilliant movie. The Shining didn't age well because it's scary. Older horror and thriller movies lose the horror with time. The best scary movies provide the best thrills. The Shining still provides the best thrills.",
            "review_date": "2022-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Underrated by some, overrated by many others. In the end, it's memorable, classic scenes, classic Jack performance, and achieved legendary status -- a film everyone should see at least once.",
            "review_date": "2022-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have never seen the shining so watching it on the big screen is the best way to watch a movie for the first time.",
            "review_date": "2022-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not only cited amongst the best movies by Stanley Kubrick and one of the greatest releases of the 80s, it has also often been hailed as one of the greatest horror films ever. Although there are several (big) chances from Stephen King already exceptional novel, the Shining offers incredibly deepened characters, a mesmorizing performance from Jack Nicholson and is filled with intense moments and creepy athmosphere.",
            "review_date": "2022-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quick paced and tense with an unknown man pulling all the strings, Phone Booth remains a tense thriller. Colin Farrell delivers a realistic and gritty performance that's perfect and believable for his character and the film conveys his everyday man sensibilities in a troubled world, quite well. Not just a look at Stu Shepard's life, but humanity in general and the issues involved and those opposed to it. Highly Recommended.",
            "review_date": "2022-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite scary movies.",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was so boring. I slept through most of it. Not scary at all. Most overrated film ever.",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"| Ratings Categories |\n{Characters (9/10) ; Cinematography (10/10) ; Plot (8.5/10) ; Acting (9.5/10) ; Pacing (9.5/10) = 93%}\"",
            "review_date": "2022-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the WTF horrors but I like psychic horrors like silence of the lambs so its a must see horror movie of every horror fan",
            "review_date": "2022-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best horror movies I've ever seen in my life.",
            "review_date": "2022-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "too good for this world, Me cant wate to see this on desney plus.",
            "review_date": "2022-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very loosely based on the book, which is very chilling and shocking, this is a great film. Having seen The Shawshank Redemption, Stand By Me and It and liking all three of them, I knew I should check out the Shining. I did feel that Jack Torrence's hallucinations, apparitions and time-warps were introduced a little too quickly and the build up to the ending was rushed too. But it is very stylishly filmed, making perfect use of an amazing set built at Elstree and a gliding Steadicam, and the music is atmospheric. The story is also effective, and there are really nice touches in the script. Kubrick here tries to be different, and I think he does a superb job at it. The Shining is more chilling rather than shocking, the blood flowing from the doors and the old woman in the bathtub made my hairs stand up on the back of my neck, and is constantly discomforting in an eerie sort of way. Jack Nicolson gives a barnstorming performance as Jack, a performance that is both hammy and disturbing, and Shelley Duvall does decently in a somewhat thankless role. Young Danny Lloyd is superb as Danny, his chanting of Redrum especially became increasingly hypnotic and distorted. The film concludes with a fairly suspenseful ending, and is overall a film with one or two problems and a very loose adaptation but it is a chilling adaptation with Kubrick succeeding at being different. 9/10 Bethany Cox",
            "review_date": "2022-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it\"s a absolute smash, very clever movie with good script and good cast.",
            "review_date": "2022-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unapologetically my favorite film of all time. There is literally nothing wrong with this movie (and it shouldn't have been nominated for a Razzie or even compared with the book). From a filmmaking perspective, the shots and directing shines from the very beginning to the very end, one of the best movies ever made by the legend himself Stanley Kubrick. Also one of the best performances ever on screen: Jack Nicholson.",
            "review_date": "2022-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "September 16th, 2022",
            "review_date": "2022-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overrated but amazing ",
            "review_date": "2022-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most overrated movies of all time. A beneficiary of the undeserved \"mad genius\" status of Kubrick which is really just a sort of pretentious nihilism exacerbated by OCD. \nThis is one of those movies that tricks normal people into thinking it was any good at all by it's many nonsensical and pointless plot threads that are never explained and never go anywhere. You're meant to believe it's all so very deep and artistic, but in reality, it's just poor and lazy writing. There are so many Chekhov's guns in this movie, I lost count. \n\nAs Solzhenitsyn once wrote, \"It's all so arty, there's no art left in it.\"",
            "review_date": "2022-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't think this is the scariest film ever made, but it's certainly well-made by Stanley Kubrick, a master of his craft. Jack Nicholson's unhinged performance is captivating. Shelley Duvall's character simpers and flaps around the place in a rather boneless manner, which is a little annoying, on the other hand. The Shining is a strange one. In many respects it's an excellent film in its own right, but it's a terrible adaptation, with Stephen King famously saying he hated it. Many changes, large and small, are apparent that ride roughshod over King's novel - but still have strengths of their own. As an exercise in film-making and as a film with buckets full of suspense, it is an undoubted success, but it isn't flawless.",
            "review_date": "2022-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "top 10 best movies of all time",
            "review_date": "2022-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a very atmospheric and distinctly chilling film, with an unsettling and somewhat claustrophobic feel to it throughout. There are numerous hints about what's to come from quite early on and it has a somewhat slow plot but I'd say that works in its favour, for this film certainly as it leaves the viewer trying to second guess when things may suddenly 'come to a head', as it were.\n\nIts certainly not an utter gorefest throughout, as horror films go but as you may have guessed, it is very tense at times and I really liked the way the wide-angle camera (pan) shots and the music (quite old fashioned, spooky music certainly, often featuring strings (stringed instruments - it has a Hitchcockian feel to it)) go well together. The cast does a good job, certainly Jack Nicholson as John Torrance and Shelley Duvall as his wife, Wendy. I can understand why this is regarded as a classic horror film, with both of their performances being quite memorable. Wendy's look of sheer terror when things come to a head is quite chilling and certainly memorable, as is Jack's when he embarks on the infamous rampage.\n\nIf your a fan of horror films and the like, then I'd definitely recommend this film.",
            "review_date": "2022-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all time favorites. Jack Nicholson plays a great psycho. Glad Look Theater took it way back and showed it!",
            "review_date": "2022-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Of that was cats level rotten",
            "review_date": "2022-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "2 years ago- An utter classic that is brilliantly directed while Jack Nicholson steals the show with a descent into psychosis.",
            "review_date": "2022-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's hard to imagine their are still people who haven't seen, or even heard of, this film.  A true horror classic, regardless of what Stephen King himself had to say about it.  Only Stanley Kubrick could have made this movie, and only Jack Nicholson could have played Jack Torrence.  Stunning set-pieces, framing and visuals.  Great music score, which really sets the tone from the beginning.  Probably the last great Gothic horror film.",
            "review_date": "2022-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although it removes most of the story from the book itself. The Shining creates its own version that create a horror movie and one of the greatest horror line \"Here's Johnny\"",
            "review_date": "2022-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie to watch around the Christmas season!",
            "review_date": "2022-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this on a fat flat screen with a surround sound system from the God’s themselves.. the music/score for this film (especially for it’s time) was just greatness. I also was captured by Jack’s uniqueness. ",
            "review_date": "2022-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The single greatest film ever made. Infinitely rewatchable. You will be left with many unanswered questions at the end, but that is part of the experience of this film. The sets seem mundane and cold - much like real life in a hotel like this. I normally hate sets that are overly realistic and somewhat boring. But not all of them are here, just the apartment, the kitchen, the ranger station, Durkin's... I mean a lot of them are, but the maze and the Colorado lounge and the Gold room are great. \n\nHowever, none of that matters. The performances are extraordinary. The story is intriguing. Hidden within much of the mundane dialogue are subtle clues as to what's going on. But the tasty dialogue, like just before Jack gets hit on the head, is some of the best I've ever heard. Nicolson is amazing as Jack. It's a must see, esp for actors and wanna be actors. Jack Nicholson earns his reputation here. He's a marvel.",
            "review_date": "2022-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An *old horror movie which holds up solidly today. The slow descent in to madness and terror all covered in ambiance is an amazing watch. The music will brand your ears through-out.",
            "review_date": "2022-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best horror movie ever and imo Stanley Kubricks best film.",
            "review_date": "2022-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, all around. Stephen King is an amazing author, and this movie is an incredible reflection of his work. Jack Nicholson was insane, as was Shelley Duvall (who somehow won a Razzie for her performance in this film). Truly one of the greatest films of all time.",
            "review_date": "2022-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this picture! It scared me when I first saw it when I was a kid.",
            "review_date": "2022-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While this movie version of the Stephen King novel is not exactly pure in its telling of the original work it is still very, very good. In fact, it created a defining and memorable look at horror that has Kubrick's stamp all over it. Jack Nicholson masterfully plays the lead role. The visuals and the cinematography are so eerie and so memorable they are haunting. Kubrick does wonders with images. This film is no exception. This one changed the horror film genre forever.",
            "review_date": "2022-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After rewatching this again I can definitely say I've gained a greater level of respect for this and Stanley Kubrick, who's working his way up to being one of my favourite directors. Jack Nicholson gives one of the best performances that transformed horror, by using his pure talent to create real and natural horror through body language compared to the conventions of Slashers. Shelley Duvall also adds to this by giving a true to life depiction of complete fear, and although she can be annoying in this it never comes across as inherently bad, unlike the child actor who just was very meh, which I don't blame him for ,after all he is just a child. I still find this to be very cryptic and mysterious which I like, but at the same time I want to understand it more and it comes off as being too cryptic for the sake of it rather than being a bit easier to interpret, but maybe that's just the way I process it. There's a lot of truly iconic scenes and true horror that just isn't done anymore, choosing to cop out with jumpscares instead was truly the death of modern horror, anyways way better on a second watch and can't wait to finish Kubrick's filmography.",
            "review_date": "2022-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "9.6/10 \nBesides the few scenes where they cut away from the camera and ruin any tension building up I think this film is a masterpiece. Jack in the 2nd half of the 2nd act and the 3rd act is entirely is bonkers and his first conversation with Grady in the bathroom is so good.",
            "review_date": "2022-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cinema at its best. A Stanley Kubrick classic.",
            "review_date": "2022-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stanley Kubrick is not for me. If you are a fan of his other works than you will love The Shining. But to me almost the whole movie felt slow and boring.",
            "review_date": "2022-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is in my top 25 favorite films. You need to see this twice before u die!",
            "review_date": "2022-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wildly overrated. Plot is weak and first half is slow but it at least pays off in the end.",
            "review_date": "2022-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The opening of \"The Shining\" says it all: a vast landscape that is majestic and yet ominously forbidding; a desperately isolated car winding its way ever deeper into the madness of the terrain. As the film progresses, we are drawn ever more fully into a disorienting labyrinth of primordial evil, cabin fever, and mysteriously intertwined fates until a consuming terror is evoked which is characteristic of Kubrick's perfectly calibrated kaleidoscope of unholy lunacy and suffocating claustrophobia. In true Kubrick fashion, we are left with the sense of an evil that we cannot name, born equally of the tenuous limitations of our own sanity and the fabric of a sinister spirit world lurking beneath the everyday surface. Although departing considerably from Stephen King's own vision of the material, \"The Shining\" is a terrifying, hallucinogenic experience that befits the best of the horror genre.",
            "review_date": "2022-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First saw this when I was 13. Terrifying. Gave me nightmares for two weeks. Watched it again last night. Still terrifying. Not many horror movies can do that.",
            "review_date": "2022-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horror masterpiece that holds up well decades later.",
            "review_date": "2022-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Being a huge fan of the novel, this film had a lot to live up to. But this is a rare instance where I think the adaptation is better than the source. Stanley Kubrick's directions makes this film a hypnotizing experience. Topped with the horror and tension that the original story had and made even better by the performances of the actors. This is horror at its best.",
            "review_date": "2022-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LOL, so funny, creepy and romantic!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While some people consider it to be the greatest horror movie of all time, I consider it the worst. The book is 100 times better. Jack Nicholson does a perfect job playing the role he was given, but Shelley Duvall performs a mix between a crybaby and a headless chicken. Danny Lloyd, Scatman Crothers, and the cinematography are the only good things about this movie, so I give it a half star.",
            "review_date": "2022-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not a bad movie overall mainly because the atmosphere in this big, empty hotel up in the mountains is scary. However, large parts of the movie are boring and disappointing due to all the reasons why the book's author Stephen King dislikes this movie. For example, (1) Jack Nickolson appears (almost) insane from the start, rather than initially being a loving father and then slowly succumbing to insanity, (2) the movie does not give much reason to like and care for the family, (3) Shelley Duvall's character Wendy is mostly scared and weak, rather than stronger and more resourceful as in the book, and (4) the movie omits the book's climax in which Jack fights off his madness long enough to allow his family to escape.",
            "review_date": "2022-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The score was chilling; definitely one of the best. Maybe it was because I watched it in the middle of the day, but, for a horror movie, I was a little surprised how unscary this was. The movie started off very strong but slowed down towards the middle for me. Acting was great. Felt like the type of movie I'll need to watch again for it to get better.",
            "review_date": "2022-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the attention to detail that makes Kubrick one of the greatest directors of all time, and this one of his greatest films. This is a movie that transcends both horror, and the book it was based on.",
            "review_date": "2022-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite horror movie of all time when I look at this movie I can't find a weakness. The acting incredible, direction great, atmosphere great, and the ending great.",
            "review_date": "2022-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily one of the most masterful pieces of horror ever to be filmed. From the brilliant acting to the suspenseful filming, Stephen King's chilling novel is taken to the screen in the most dramatic, knee-wobbling way imaginable. The Shining's star, Jack Nicholson, embraces the role of a mentally insane Jack Torrance in a fashion that terrifies the audience, and demands the complete and uninterrupted attention of every viewer. Perhaps the most effective scare tactic used by director Kubrick is the slow-paced movement of the camera, capturing and savoring every moment of this film's nearly 2 hour and 30-minute time span of sheer terror. This film is a timeless masterpiece of modern horror, sure to give the creeps to every generation who watches it.",
            "review_date": "2022-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An instant classic that puts Kubrick's style of direction on full display without it ever feeling overlong or boring. \"The Shining\" stands as one of the best horror/suspense films of all time, providing several iconic moments and lines still used widely today. The characters are done very well, and the atmosphere has a very eerie tone from the get-go. Perhaps the best part of this film, however, is the way it was shot and filmed: pure art that keeps you on the edge of your seat. The soundtrack is also fantastic in developing the creepy feel of the whole movie. It does get a bit boring at parts, however, I still absolutely loved the end result.",
            "review_date": "2022-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The visuals and soundtrack are of course brilliant, but I was a bit underwhelmed by the actual plot. Also, Shelly Duval was unfairly maligned for her performance—she gave a chilling and sadly realistic portrayal of an abused wife.",
            "review_date": "2022-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although it did not agree with the book, it has so much detail and easter eggs with limitless possibilities of theories. One of Kubrick's best films.",
            "review_date": "2022-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "81%. Very well done for a horror film. Considering it's a horror film, I should probably give it a better rating, but need to judge everything with the same criteria. Not overly scary but just a creepy film. The kid seems the creepiest at first and then jack becomes scarier. Thought that just he and his son were shiners but then Wendy hallucinates a bunch also so just a strange story",
            "review_date": "2022-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Shining is amazing movie that is a deserving classic. This is a must see horror film",
            "review_date": "2022-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When i saw this years ago i tought it was amazing but now upon rewatch i realize its not a good movie. It takes so long to get to the actual point of the movie and when it does it executes it terribly",
            "review_date": "2022-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very loosely based on the book, which is very chilling and shocking, this is a great film. Having seen The Shawshank Redemption, Stand By Me and It and liking all three of them, I knew I should check out the Shining. I did feel that Jack Torrence's hallucinations, apparitions and time-warps were introduced a little too quickly and the build up to the ending was rushed too. But it is very stylishly filmed, making perfect use of an amazing set built at Elstree and a gliding Steadicam, and the music is atmospheric. The story is also effective, and there are really nice touches in the script. Kubrick here tries to be different, and I think he does a superb job at it. The Shining is more chilling rather than shocking, the blood flowing from the doors and the old woman in the bathtub made my hairs stand up on the back of my neck, and is constantly discomforting in an eerie sort of way. Jack Nicolson gives a barnstorming performance as Jack, a performance that is both hammy and disturbing, and Shelley Duvall does decently in a somewhat thankless role. Young Danny Lloyd is superb as Danny, his chanting of Redrum especially became increasingly hypnotic and distorted. The film concludes with a fairly suspenseful ending, and is overall a film with one or two problems and a very loose adaptation but it is a chilling adaptation with Kubrick succeeding at being different. 9/10 Bethany Cox",
            "review_date": "2022-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Masterfully done, showing the slow dive into madness very well, creates the perfect sense of unease that keeps you on edge the entire movie.",
            "review_date": "2022-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film has some of the most mesmerizing imagery and performances in film history. The film addresses themes of childhood emotional abuse, spousal abuse, violence, insanity, and facing horrors/tragedy from the past.",
            "review_date": "2022-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a wonderful classic! It is a story that is not identical to the book, but has similar scenes. The story manages to provoke enormous tension, coupled with Jack Nicholson's sensational acting and sinister music, it becomes a masterpiece. Another great work by Kubrick.",
            "review_date": "2022-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just a wonderful movie, it's one of my favorite",
            "review_date": "2022-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it was disappointing that the hedge animals that come alive in the book are replaced by a hedge maze; the film is fantastic.  \nShelly Duval is perfect as the abused spouse and her scene with the baseball bat and then telling her child to run is a true star turn but probably not understood by people who have not experience attempted murder by a spouse or parent.\nShe is then perfect in the scene at the very end as is the entire cast\nCritics being usually male do not like the film's naked view of domestic valence but that is typical they did not like Taxi Driver either.\nThe idea of women/girls and children prevailing over rapists   and murderers who are usually male appears to be too much for most critics who are typically male and most women statistically have experienced violence/sexual assault by a male partner \nMost hyper educated critics do not deign to interact with those caring out the day-to-day tasks portrayed in the film.\nWhile a bit of a harsh take on blue color people that is the fault of the books author, the film is as lurid and realistic as a ghost tale can be about what happens in magical reality when a hotel is built on a native American grave yard.",
            "review_date": "2022-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "now, the people say this movie is not a horror movie this is because of the current jumpscare scares and I think The Shining is a very reactionary movie with a lot of mystery in it.",
            "review_date": "2022-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watch it during October and kick the fear /emotional factors to 100.  It really gets you.  The turmoil is over the top and Jack Nicholson can really spike the drama to new levels.  The only reason I give it 3 stars is that scenes a drawn out long and the film could be shorter.",
            "review_date": "2022-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bland story that had very little to tell. The motives of the characters were underwhelming. The film seemed to parade around its twists and climaxes that were also underwhelming. The runtime was bafflingly long. The ending was insultingly lazy. Would not recommend under any circumstances.",
            "review_date": "2022-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I mean... It's The Shining...??? What can I say? It's a good movie...?? Wow, hot take there.",
            "review_date": "2022-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is awesome and I love how Jack Nicholson shows the psychotic path of jack torrance, soundtrack is good and the scenes are beautiful",
            "review_date": "2022-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'll absolutely never get tired of rewatching this, the perfect winter holidays movie if you ask me. The acting is insanely good  (Quintessential Jack Nicholson), the locations and sets are beautifully chosen/put together and the plot keeps you on the edge. Stanley Kubrick's attention to detail is evident here, it's like watching a live painting. 10/10 Forever",
            "review_date": "2022-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Shining is a true horror movie classic, with chilling performances and really scary moments, despite not being faithful to the Stepen King novel and having some plot holes, the movie is a fantastic piece.",
            "review_date": "2022-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Here it is: my favorite movie of all time! I truly believe this is a 5-star movie if you understand the context around it, which is kind of a lot to ask. There's a lot of drama, conspiracies, and history surrounding the development of this movie, but once you dive down the rabbit hole, there is so much to understand and appreciate.\n\nJack Nicholson is the only person who could have ever played this role. There's a unique insincerity behind his eyes throughout the whole film which made me uncomfortable even before the fucked-up stuff starts happening. I'm still mad that they tried to recast him for Doctor Sleep. Shelley Duvall is iconic and underappreciated, with her shrill screams and haunting desperation.\n\nThe story itself is fairly minimal, mostly due to the film's tendency to Not Fucking Explain Anything, which is part of what I love about it. It doesn't wrap everything up in a neat little bow (to the dismay of Stephen King), instead leaving everything open-ended and mysterious. There are clues here and there and a lot of valid headcanons, but the uncertainty adds to the unsettling feeling you get throughout the whole film.\n\nIt took me a few viewings of this movie to really appreciate Wendy as a character. She gets a lot of hate in the horror-movie community for being sort of incompetent when it comes to escaping her pursuer. But I'm finally realizing that the movie, at its core, is about Wendy coming to terms with her abusive relationship and building up the strength to leave. It's wrapped up in a twisted haunted house story, but that's really the root of this incredible film.\n\nNow, do I wish they hadn't used the N-word unnecessarily three times in a row? I sure do. But this is undeniably a groundbreaking, gut-wrenching, utterly terrifying tale with impeccable direction and acting. And that's why it's my favorite movie of all time.",
            "review_date": "2021-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Shining is one of my favorite movies of all time because with each viewing, I notice new things with the story and set design.  Shelley Duvall is so hauntingly beautiful and fit the role so perfectly. Jack Nicolson is a master at his craft and with the direction of Kubrick, this truly is one of the best horror movies of all time.",
            "review_date": "2021-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Shining is a classic for its terrifying, ambiguous nature, Kubrick's sleek direction, his ability to create a character out of the setting, and the stellar performances.",
            "review_date": "2021-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best horror movies of all time. A MASTERCLASS in visual storytelling. To this day I have no idea how Steven King dislikes the film... Infinitely superior to the book.",
            "review_date": "2021-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching the film from an alcoholics prespection Watching the film from an alcoholics prespective and knowing the original book the way I do, I must say, Danny was a lucky kid before the hotel took his father. Mr. Torrents fought his demons and he was as good as a father as he could have has been. Sounds silly, I know. But he really tried hard and he really loved his son. It ended tragically, for sure. But without the influence of the hotel, he was a very clever man who loved his family. In a way, the film story was quite unfair to Mr. Torrents for making him a senseless murder. When in fact, it was the hotel´s influence, which could have broken even a better man.",
            "review_date": "2021-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stanley Kubrick can make your own living room seem creepy.  Therefore it should come as no surprise that the freak out factor is high in the adaptation of Stephen King's novel.\n\nAt first, the film feels empty.  Jack seems nutty from frame one, providing little arc for the character.  Each character sees visions, leaving the audience no easy points of identification.  The apparitions seem to know more about the story than we do, fostering real twists and turns.  Kubrick constantly pulls the rug from us in relation to what is real and not.  This is one of the scariest movies of all time and not for the faint of heart.",
            "review_date": "2021-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is nothing more than a horror movie that, even if it is good, does not justify the unnecessary turns of the camera and an ending without explanation",
            "review_date": "2021-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was not my favorite, but I would watch it again if I had to. For anyone who is watching they're first horror movie, I think this is a good one. The plot itself was suspenseful, but the script was boring. Halfway through the movie I got pretty bored. You pretty much knew what was going to happen from there. Despite its bland script, I would rewatch it if I had to. I watched it on Prime Video.",
            "review_date": "2021-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Scary and artistic, The Shining still maintains its title as one of the greatest horror films in history, and for good reason.",
            "review_date": "2021-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow burning masterpiece and legend",
            "review_date": "2021-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece. Here's my favorite movie of all time.",
            "review_date": "2021-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everyone should watch this film at least once & read the book for balance.\nThat trepadatious feeling slowly builds into absolute horror & the symbolism is fascinating. A work of genius  100% Fresh.",
            "review_date": "2021-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I haven't read the Stephen King novel, which was supposed to be much better. But it's easy to see why he would have objected to this movie production.\n\nFor one thing, the caretaker is supposed to be a normal human being who slowly becomes mad as he stays at the hotel. But Jack Nicholson's character seems sinister from the beginning. Instead of slowly going mad, he seems to have been that way from the beginning with nobody else noticing. Yet the movie implies that the ghosts of past residents are for real, as one was able to physically free Jack from the pantry. Did they drive him mad, as they presumably did to the previous caretaker? And what would be their motive? Nothing is hinted at.\n\nAlso, there are elements such as the child talking to his finger, a blood-filled elevator, and two ghostly twin girls who appear sporadically, none of which (according to other reviewers) appear in the novel. What purpose do they serve, since they don't advance the story in any way? The \"shining\" is presumably how the boy telegraphs his sense of danger to the man in Florida, summoning him, but why he has it is never covered.",
            "review_date": "2021-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I honestly hate this movie. Having read the book, I think it is/has been offensive for this movie to carry the same title. Not in the usual \"the book is better than the movie\" kind of way. The movie is a brilliant stand-alone thriller and nothing more. \n\nKubrick didn't even try to portray the most terrifying parts of the book. I understand that inner turmoil is difficult to put on film, but Jack Torrance is not the ultimate villain that the movie portrays him to be. The movie does nothing to delve into what \"shining\" actually means. The creative liberties taken by cast and crew have made an iconic film but I am, and will forever be, hugely disappointed by this film.\n\nI will continue to cringe whenever someone tells me that \"The Shining\" is a great movie. \n\nMany condolences to the cast that suffered through the filming. I will forever toast you for being in that movie that, to me, was the worst book adaptation of all time. No offense to you. The screenwriters are the ones that I would gladly take out back and shoot like a rabid dog.",
            "review_date": "2021-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So many scenes are a part of popular culture that it is difficult to watch The Shining as a truly blank slate like the original audience might have, yet it still delivers a uniquely chilling depiction of the descent into madness. The acting performances of the Torrance family are top notch, especially Shelley Duvall's character. The build up and payoff of one scene in particular (Mr. Hallorran) was an emotional rollercoaster in a way I haven't felt in a long time",
            "review_date": "2021-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Shining, the most recognizable, iconic, influential and one of the most perfectly made horror movies of all time. This movie at the time received a ton of backlash and was heavily misunderstood. But now it's getting the respect it deserves by critics and casual watchers alike. Though what makes this movie so perfect? Well first of all the symbolism. This movie symbolizes that when us as humans work to much we can ruin our lives or just have no fun and drive ourselves into insanity. This is shown when Jack Torrance is a writer and usually just works on novels all day. Though when Shelley so much as wants to spend time with him even he gets pissed he just wants to focus on work and not have fun. This is also shown through the phrase \"All work and no play makes Jack a dull boy\"  He gets so pissed off in fact that he says that he works so hard to have a good life while he's really just working his life away and going insane. Which leads him to want to kill his wife and kid. Another great aspect of this movie is the cinematography. This is a beautifully shot movie and was as perfect as it could be. Stanley Kubrick  (a producer of the shining) would often retaken shots numerous times just to get it exactly as he envisioned it In his head. For example the most notorious is the staircase scene which was shot 127 TIMES. That SCENE WAS AT LEAST A MINUTE SO THEY SPENT AT LEAST 2 HOURS. ON. ONE. SCENE. Plus Stanley Kubrick would push his actors to the limit and often bully them just to get a \"realistic\" performance. However out of all the actors he bullied Shelly Duvall the most. He constantly made her think that she was wasting everyone's time, that she was bad at acting, and just overall bullied her badly. This resulted in her crying so much they had to keep WATER BOTTLES on set because she ran out of tears and lost chunks of her hair. But this resulted in a lot of the shots in the movie being beautiful like the shot where Jack is bleeding out in the maze it's beautiful. The acting in this move is semi-realistic but that's kinda the best you can do in a horror movie. If it was realistic it would be as long as a Regular Show episode. How do you think the Child's Play franchise would've happened without this principle? There were some times were Shelly could've just walked out with her son while Jack was locked in the freezer but ok. But the acting is good for a horror movie. Especially in Jack he is portrayed amazingly as a character. Also this movie is so iconic and influential. It's in the Simpsons and Seed Of Chucky just to name a couple. The line \"Here's Johnny!\" is a line anyone over 5 knows. Also it's still remembered today and regencies it's held up for 40 years without a sequel, It has to be good! While U really like the idea of The Shining power how you can see and hear things others can't and telepathically talk with other people with \"The Shining\". I also love how Danny uses it to mess with him constantly. Also it's just a fun concept with room 237 and everything it really adds on to the movie. It's great how it connects two characters that are not connected in anyway and makes you get a little attached to them and forms a relationship between them and that other character. Overall this movie is great in what it tries to do, extremely  iconic and a myst watch for people who love movies in general especially symbolism. 10/10 Watch It Now.",
            "review_date": "2021-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I decided to finally watch this movie because it has been \"iconic\" forever. So I was expecting a very interesting and scary movie. Unfortunately it was terrible. I was so bored when watching this movie. I was never scared once. All I really did was laugh at the movie. I don't understand the hype over this movie and I wouldn't recommend it.",
            "review_date": "2021-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie! A classic",
            "review_date": "2021-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that lives in infamy, and rightfully so. With expertly crafted suspense, frightening moments, and legendary moments galore. Jack Nicholson plays Jack Torrance expertly, and portrays a man on the absolute edge, desperately trying to stay together. A truly legendary film, that will never, ever, be forgotten.",
            "review_date": "2021-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Shining is the perfect storm:\n\none of the greatest horror films of all time that might in fact just be one of the greatest films of all time by one of the greatest filmmakers of all time starring one of the greatest actors of all time based on source material by the greatest horror writer of all time.\n\nWhat more needs to be said?",
            "review_date": "2021-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The rare horror movie that's genuinely horrifying, The Shining eschews gore and jump scares in favor of claustrophobic dread.  The insane perfectionism of director Stanley Kubrick and excellent performances by all four of the principal characters enabled it to set a standard for psychological horror that's never been topped.",
            "review_date": "2021-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I realize it's cliche to say \"the book was better,\" but in this case the book was better by an order of magnitude.  It's disappointing that Kubrick seems to have missed all of the nuances of the characters, and instead has Jack Nicholson portray his character as an obvious nut job on the edge of violence from the opening scene.  And his wife displays none of the courage or inner strength of the original character.  The black custodian - well let's just say he is a major and important character in the book, but Kubrick disregarded that entirely. There are two scenes that Kubrick added that weren't in the book that are genuinely unsettling.  But other than those, Kubrick's movie is an over acted and under imagined swing and a miss.",
            "review_date": "2021-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first horror movie I enjoyed, and still one of the only ones.",
            "review_date": "2021-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never disappoints. So glad I got to see it on the big screen!!",
            "review_date": "2021-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "overall,  good classic horror/suspense movie.",
            "review_date": "2021-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just watched this recently, became one of my favorites in an instant. The acting is great, the ending is great, basically everything about this movie is insanely spectacular!",
            "review_date": "2021-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie is a classic and glad I was able to watch it in theaters",
            "review_date": "2021-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Shining is one of the most classic horror films, and for good reason. It is a movie which truly defined the genre of psychological horror, using atmosphere and symbolism throughout to thoroughly unsettle its audience. It follows Jack Torrance, a struggling writer, and his family as they spend the winter as the caretakers of a large, empty hotel. However, when Jack's son, Danny, starts having psychic visions of terrifying murders and ghosts that haunt the hotel, it quickly becomes apparent that there is something very wrong. \n\nI feel that what makes The Shining such an effective psychological thriller is the extensive use of mise-en-scene to create the atmosphere. For example, the hotel layout as shown in the movie is impossible- the rooms and hallways twist and turn to make a space that is much larger than the physical hotel. This creates uncertainty, and unsettles the audience. In the famous scene where the child, Danny, rides around on his tricycle, the camera glides low and close behind him as he pedals through the halls. We don't know what lies beyond each corner- we see what Danny sees, when he sees it. The suspense is masterfully constructed, and we have no choice but to watch in fear as Jack spirals down into madness. \n\nHowever, where it excels at being extremely unsettling at points, The Shining isn't necessarily a scary movie. In fact, I would argue that all of the actual \"horror\" parts of the movie fell flat. For all of the build-up to the part where Jack finally snaps, the actual reveal and everything after was a complete letdown. Earlier on in the movie, Jack sustained an injury which gave him a pronounced limp- but so pronounced that any character who could break into a light jog could easily outrun him. This effectively got rid of any sense of urgency and fear, and turned something that should have been the terrifying final chase into a tedious run-around. On top of the already poor pacing, the use of plastic, Spirit- Halloween reminiscent skeletons and cobwebs added a layer of absurdity, sharply contrasting with the artful use of props throughout the rest of the film. It's almost as if the last 20 minutes had a different director altogether, which ended the movie on a rather disappointing note. \n\nIn summary, if you're looking for a straightforward horror movie with jump scares and gross-out terror, The Shining is definitely not your movie. That being said, this movie does contain some truly brilliant, unsettling scenes. As a long-time horror movie fan, it was interesting and fun to have a horror experience that is so different from the typical ghost/demon/monster fare. Despite its faults, The Shining has an atmosphere to it that makes it such a classic horror film- and one well worth the watch.",
            "review_date": "2021-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest horror films ever made. All of the actors are fantastic but Jack Nicholson in particular is absolutely wonderful. There is so much tension in this movie and it spills over into occasional violent horror but there are also some moments of dark humour which add a little sparkle to the mix. The music is extremely eerie and atmospheric and every shot is beautiful filmed. There is a great use of colour throughout the film. An unsettling but immersive experience that can be savoured again and again.",
            "review_date": "2021-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can't beat this film for suspense and atmosphere.  A descent into madness that you feel involved in.",
            "review_date": "2021-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the slow burn, the long takes, the intense music, and the phenomenal performances in \"The Shining\", which makes it a near-perfect horror film.",
            "review_date": "2021-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Shining is a cult, psychological horror film starring Jack Nicholson. In the film, struggling writer Jack Torrance agrees to be the winter caretaker of a hotel where a murder had taken place some years ago. During his stay with his wife and his son, Danny, Jack begins to feel a sinister atmosphere. Danny starts to have a series of disturbing visions and Jack's writer's block worsens. As a result, Jack goes on a murderous rampage, targeting his family. To start, the film is excessively long. If Kubrick and his editor had taken a \"less is more approach\" and cut the runtime to about 100 minutes, the story's pacing would better suit the tiny cast and limited settings.\nWith that being said, Kubrick was a master of horror and suspense in his day, and this acclaimed classic proves that he deserved his rank. The composers of this film also did some immaculate work, providing the world of cinema with one of the greatest soundtrack themes in history. The film also boasted several displays of stunning cinematography during scenes like the one filmed in the never-ending hedge maze. And though compact, the whole cast gave huge performances. Then rookie child actor, Danny Lloyd, specifically delivered a great performance despite the long hours and extensive takes. You've gotta hand it to the little dude... I enjoyed this classic; but unlike most of the film's cult following, I appreciated the film more so for its superb technical aspects rather than its adjudged, iconic creepy twins or Jack Torrance's mental breakdown one-liners. That isn't to take away from these elements of the film, though. These elements made The Shining legendary, but the entire pre- and post-production team deserve their accolades, too. In conclusion, you should see the film at least once in your lifetime. Try to avoid the hype until you have, though... 82%!",
            "review_date": "2021-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it does take many risky liberties with King’s source material, Kubrick’s adaptation is a non stop, slow creeping fright fest in it’s own right. It’s all in the film’s atmosphere, its sense of isolation, its creepy visuals and its equally creepy soundtrack that makes “The Shining” the scariest movie ever made. ",
            "review_date": "2021-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everyone who says this movie is a masterpiece needs to stop lying to their self. It's a weird match of bad acting, bad writing and overly long scenes that make the whole experience a weird couple of hours that you can never get back.",
            "review_date": "2021-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though this film changed most aspects of Stephen King's novel of the same name, it really is stunning to watch. The tone is slow and introverted, which will cause the viewer to feel as isolated as the main characters.",
            "review_date": "2021-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic, so maybe see it? It's not bad, but really not my thing. Also, it just seems random most of the time. Some scenes were pretty good though, but I'm not going to give it a solid two.",
            "review_date": "2021-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was a little weirded out by a few random things and it was very confusing but Jacks transformation steals the show",
            "review_date": "2021-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Iconic lines, symbolic color palettes, remarkable production design, great performance, chilling score. The Shining is easily rewatchable, always finding something new in each viewing. I recognize its achievements in a technical standpoint, but the lack of emotional connection one can't seem to have towards a film in general keeps me from a perfect rating. Regardless, I acknowledge it is one of Kubrick's finest.",
            "review_date": "2021-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you're a horror movie fan, this is a must see BEST MOVIE  EVER! This movie is scary without being gory! It's not a monster movie but of some one who becomes a mental MONSTER!",
            "review_date": "2021-08-30",
            "source": "rt",
            "lang": "en"
        }
    ]
}