{
    "title": "Special 26",
    "rating": 8.0,
    "release_date": "2013-02-08",
    "num_reviews": 149,
    "genres": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "summary": "A gang of con-men rob prominent rich businessmen and politicians by posing as C.B.I and income tax officers.",
    "reviews": [
        {
            "review_title": "Special Chabbis (and not twenty six) \u0085 a special entertainer for all movie lovers",
            "content": "After having watched \"A Wednesday\" by Neeraj Pandey innumerable times, I stepped into the cinema hall with high expectations from his latest movie Special Chabbis. And Pandeyjee has managed to pull off another amazing entertainer with a fast-paced & exciting plot. This is one of those movies which keeps on lingering in your mind even after the climax and you keep going back to the brilliant sequence of events and how they were executed throughout the plot.The movie is set in 1987 based on a true incident when a person posed as a fake CBI officer and robbed a famous jeweller at the Opera House in Mumbai. This incident forms the basis of the plot and how a group of conmen conduct false raids as CBI or IT officials to con politicians, businessmen and high profile people to rob them of their money. These heists are never reported as most of the money is black money and none of these high profile people want to be in the news for wrong reasons.Neeraj Pandey after his directorial debut with A Wednesday completely redeems himself with Special Chabbis and reaffirms his position as a master director. He is definitely not a one film wonder and a director to watch out for in the future. The best and the most noticeable part of the film is the period that it has been set in. 1980's have been very effectively portrayed in the movie, whether it was the cars running on the roads or the streets of Delhi especially well known areas like the Connaught Place, whether it was the print style of the newspapers or the clothes and jewellery worn by the actors. The whole movie seems to be set in 1980 and all credit goes to the art director along with the director. I am still wondering how he shot in the heart of Delhi with all these props from the 80s.The casting is perfect and each character in the ensemble of great actors delivers are powerful performance. Akshay Kumar has always been a great actor for me despite critics and so-called intelligent viewers writing him off. As the linchpin of the team he is subtle, intelligent and still manages to be funny in his own earthly way. This is definitely another feather in his cap with his long list of successful movies. Anupam Kher as a vulnerable supporter of the leader and a lustful old man (considering his long line of children) is superb and reminds of a perfect Punjabi uncle. Rajesh Sharma (Munjal from the movie Khosla ka Ghosla) as the third character fits perfectly into the well oiled team as the big guy from a Purani Dilli joint family. Kishore Kadam as the oppressed husband though a reserved role makes an impact. Jimmy Shergill's portrayal of a frustrated suspended police officer is very believable and you can't fail but empathize with the character of Sub- Inspector Ranveer Singh. But, Manoj Bajpayee is the actor which never ceases to amaze me. You put him any role and he shines, sometimes more than the protagonist. As a no nonsense CBI officer he again steals the show and gives another honest performance worth a standing ovation. Kajal Aggarwal (from Singham) is a pretty girl and looks pretty, however her character's contribution to the story is a little frivolous.The climax hits you in typical Neeraj Pandey style which I am sure is fast becoming his signature style in his movies. Full marks to him for great direction, amazing portrayal of all characters, great plot, superb casting and above all perfect detailing.Go and watch it, and I definitely can again. This one definitely lived up to my expectations and left me hungry for more (I waited till the end of casting hoping there would be another surprise scene at the end).",
            "review_date": "2013-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great acting makes special 26 more special...",
            "content": "Special 26 is a heist movie based on real life incidents of 1987...I considered watching this movie because of the director of A Wedesday..NEERAJ PANDEY..and he didn't fail to deliver...Heist movies in bollywood are generally filled with crap like glamor,show-off and pulling off practically impossible stuff...and thats where special 26 stands above all....Great direction, incredible acting, perfect screenplay and a great script made this normal heist-kind off plot into the very best of its kind that bollywood has never seen....This fake CBI based concept is perfectly executed and what makes it standout is really good acting.AKSHAY KUMAR( who i consider bollywood's best)has finally found a good movie to do and he does it to perfection.But its ANUPAM KHER and MANOJ BAJPAI who steal the show with their perfect portrayal of difficult-to-play roles...the supporting cast does a fabulous job...except KAJAL AGARWAL...there was really no need for her character in the movie...Special 26 will keep you at the edge of your seat throughout 2.30 hours and an incredible climax will make you appreciate the movie...Except for AKSHAY-KAJAL segments, which were really not needed in the movie, Special 26 is perfect in every department and regardless of the business it does at the box office(I really don't give a damn about that),this movie is one of the all time greats in bollywood for me...",
            "review_date": "2013-02-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Special 26 Is A Super-Over-Smart Movie With Traces Of Buffoonery!",
            "content": "\"A Wednesday\" made me watch this and boy, was I surprised? Was I entertained? Hell yes, Special 26 is 2013's first serious cinema with no cheap humor, ridiculous stunt sequences or the typical B'wood masala. While Akshay Kumar is known for Housefull & Rowdy Rathore, this one plays different with a sharp plot-driven story and an even amazing execution on a real-life incident!Cut out the romance, and this is one gripping, fabulously woven heist drama parallel to what we see in Hollywood flicks. Anupam Kher couldn't get more thespian while Jimmy Shergill & Manoj Bajpayee complement the cast. Direction, screenplay (so that you don't get bored through 2.5 hours), score, acting and every other film factor is thoroughly scrutinized in this. Now, what's even more Special about this movie is that - since the time gap between decent, \"movie-wala\" movies is so vast, that you just can't get enough of it. Paisa Vasool!Originality in the thefts, corruption, authentic depiction of Indian locations and what-not, I could praise this movie and write a book moreover because it is 2013's one decent try.BOTTOM LINE: I should not reveal much and spoil the broth. Because Special 26 cannot be missed. 100% Recommended but if you are a logic- ridden cinema-goer, you may despise it! Except some dumb plot holes and serious anachronisms, it is a good thriller. But don't expect it anywhere near to what \"A Wednesday\" was. 10/10Can be watched with a typical Indian family? YESLanguage: Mediocre | Sex & Nudity: No | Violence: No | Smoking, Alcohol & Drugs: No",
            "review_date": "2013-02-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Special Neeraj Pandey's another special one.",
            "content": "He did it again. Though budget was seven times than \"A Wednesday\" (first masterpiece directed by Neeraj Pandey ) still it wasn't much hyped one ( or may be i don't watch TV these days). I came to know about this notorious saga when one of my friend messaged me to watch it . Thanks to her!! Its being ages since I watched well crafted ingenious Bollywood thriller( recommended to get over with trauma of Race 2). And that to con classic is a really a treat. And what makes it more interesting is \"Based on real story\" factor (though definitely more fiction).The movie is set in late 80's (specifically 1987). For starting 10 minute never felt that its a con movie. Thought of some kind of vigilant drama. But then subtle revelation made it clear. Story moves with introduction of all characters. One thing which was perfect about the movie was the feel of 80's. Airports, roads, vehicles, hotels,places where people use to hide money, panoramic view of cities, clips of events from 80's, demeanor of characters (Pleat pants wore by Bajpai,simple sweaters even the watch wore by Akshay was 80's item). The perfectly executed raid scenes with money shelled out from imaginative places. Brilliant and unpredictable climax. All adding stars to this con epic.Only week points were repetition of some scenes which were unnecessary, lady love of Akshay Kumar as per Indian Rule book, boring songs.Good to see Akshay Kumar doing something good (small trivia Neeraj waited for this movie almost 3 years just because he wanted Akshay to play lead role and in return benign Akshay charged only half of his normal fees), Anupam Kher and Manoj Bajpai at their best. Others playing their part.Final verdict : Watch it for intelligent con thriller, horse and buggy Indian days and Stellar Akshay Kumar's performance.Rating : 8/10.",
            "review_date": "2013-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Intelligent Script With Best Performances",
            "content": "After A Wednesday, Neeraj Pandey is back with an intelligent script on a true life incident against corruption. It is a story of con men who looted black money of politicians, bureaucrats and businessmen by posing either as CBI or income tax officials. Power of this flick lies in tight script with a last minute twist. This is a perfect answer to Ocean franchise, we can expect sequel as well. After a long time, Akki shows his acting talent in totally new avtaar. Anupam & Jimmy plays his role very well. Manoj is full of power & very well lifted his role. There is no need of female character in script. Loose Point: songs, as there is no need to waste 10-12 precious minutes. Best Dialogue: Asli Power dil me hoti h. Last Words: It is an intelligent movie with best performances. You would not regret watching.",
            "review_date": "2013-02-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "worth watching more than once !",
            "content": "Finally 2013 has its first Awesome movie. Its been an year with all crappy movies so far. Special 26 steals the show easily.The characters and actors have been so well chosen. Each actor has got the perfect character. The casting could not have been better than this. The direction is superb. So is the Art Direction. The story does not lag anywhere. So its a superb story with some really good editing.Talking about actors -Akshay Kumar - comes out of his day to day roles of khiladi and joker stuff. This is serious cinema which makes him a complete actor.Anupam Kher - reminds everyone that he is still very much the same awesome actor as the one in 90s.Jimmy Sheirgill - chooses the right kind of role finally. He perfectly fits the role of SI Ranvir Singh and also fits well in the 1987 plot.Manoj Bajpai - as good as ever. Special 26 ka CBI inspector Waseem Khan is as good as Wasseypur ka Sardar Khan.Kavya - hardly any role for her. Shes in the movie for songs only.Divya Dutta - standard supportive role. does well.Others - very well done.Art direction for Delhi steals the show. the 1987 Delhi has been brought alive. details have been worked out well. 1987 Mumbai disappointed. I guess it was very tough to recreate that so the director and the VFX team chose the green screen. Thats the shoddiest part of the movie and hence i gave the 9/10 and not a full tenner.Verdict : The movie can definitely been seen more than once at a theater if you get the tickets. It is gonna be a houseful for some days.",
            "review_date": "2013-02-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Special and Epic",
            "content": "Movie name says it all, its special for movie lovers, awesome story, perfect movie. Everyone gave their best, there are no OTT actions or cheap comedy, no unwanted songs, not a remake from south, original script from perfectionist Neeraj. Akshay Kumar made an u turn with this movie, he should choose more movies like this instead of comedies where he can show his real talent. Manoj and Anupam was awesome. Bolly should make more movies like this then soon Bolly will be compared with Hollywood. the climax of this movie will make u speechless, awesome twist at the climax. Neeraj is perfectionist, his debut A Wednesday was awesome, now he delivers Special 26, like A Wednesday we can watch Special 26 again and again and can say What A Special Movie This Was. One word for the movie EPIC",
            "review_date": "2013-02-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A mind boggling thriller by man who made a ordinary day SPECIAL as A Wednesday",
            "content": "You don't need almost 832 twists in a script to make it look slick and classical thriller. Neeraj Pandey proved it with Special 26. AND one more thing : All PANDEYz of bollywood please stay aside as this PANDEY is something extraordinary with his hand on script and direction. lets move back to film. film starts with a bang (Heist) which stuns you more because of body language of characters and the direction (ofcourse background score should get the praise too) film moves to some rom-com plot suddenly but without making you bore. First half was good but when the second half starts it takes it to another level. beyond our imagination and a amazing climax leaves you thrilled. film keeps you on the edge of seat throughout the 2 and half hour. astonishing sets,superb background score,tight script,marvelous performance and NEERAJ PANDEY. lets say the later NAME is enough to make you expect the unexpected. lets have a look to the performances : Manoj Bajpayee is amazing. one more time he gave his BEST and i don't think its necessary to say he is one of the most talented actor bollywood ever have. Anupam kher is also awesome with all his body language and dialogue delivery stuff. BUT this man AKSHAY was the show stealer. He did something out of the box and did it so brilliantly that you will remember him as his character name AJJU more than akshay. A film not to miss this weekend. All the abusive words got silenced and its a clean family entertainer with all the element to entertain and thrill you. missing such a cinematic experience will be a crime for a movie buff and bollywood lover. Rating : ALL THE STAR IN SKY",
            "review_date": "2013-02-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Nutshell Review: Special Chabbis",
            "content": "It's been almost seven years before writer-director Neeraj Pandey decided to go back to the director's chair for what would only be his second feature film to date after making his debut with A Wednesday. And Special Chabbis, or Special 26, is indeed that special project that would lure him back, being once again a film inspired by true events, around a time in the 80s where identities of the taxman, and the policeman, were utilized by thieves in their respective heists against corrupt businessmen and politicians whom they know would not breathe a word on the loss of their ill gotten gains.Akshay Kumar plays Ajay, whom we see as a Central Bureau of Investigations (CBI) officer, together P.K. Sharma (Anupam Kher), Joginder (Rajest Sharma) and Iqbal (Kishor Kadam) performing a raid in New Delhi together with local policeman Ranveer Singh (Jimmy Shergill) against a prominent minister. But soon this facade soon gives way that Ajay, Sharma, Joginder and Iqbal are none other than con men of the highest order - confident in execution, meticulous in detail, and able to cover their tracks really well in their many heists together. This is like Danny Ocean and his Ocean's Eleven, except that Ajay relies on a much smaller crew in their attempts to fleece, relying on quick wits to turn unexpected situations into opportunities of gain.The crux of the story, once we get out of the extended introduction, is the cat and mouse game between Ajay and his crew, and that of CBI officer Wasim Khan (Manoj Bajpayee) who is determined to track them down and bring them to justice for ruining and embarrassing the good name of CBI officers everywhere. And in part this key assistance comes from Ranveer who had been duped into helping Ajay and crew, and possibly being the only one who can help identify all the perpetrators, who have so far stayed below the radar after the completion of each heist.Neeraj Pandey knows just what it takes to make a heist film, utilizing key requisite scenes such as the planning, and execution, tossing in surprises along the way to keep things fresh and engaging for the audience, never for once knowing just how each attempt would play out, at times for light comedy, but most times in admiration just how an escape strategy got formulated, with audacity. What's best here is of course the true meaning behind the title's Special 26, where once it's fully explained, will wrap up the brilliance of the entire caper, which proved to be that ace up Pandey's sleeve, with a pace that never lets up, save for moments where he felt he had to balance the testosterone levels with the introduction of Kajal Aggarwal's character Priya, serving as token romantic fodder for Ajay.I felt Akshay Kumar was badly in need of a hit, and a film that didn't requite him to play the joker. His filmography in 2012 was rather weak throughout, and for a hardworking actor who appears in more than a handful of outputs, 2013 might be off to a great start for his fantastic performance here as the master thief and schemer who is into his final lap, so that he can retire with his lady love and ride off into the sunset. It's not the first time Akshay's playing a thief, but it's clearly one of his best roles in recent years. And added to that is Anupam Kher's ever reliable performance in a supporting role, as the one amongst the gang who has the most to lose, given a large family to support, and the one who gets put in a spot to decide whether he should give in to the law, or stick by Ajay and his grand plan.Special Chabbis / Special 26 is that crime caper that's all smart and serious, but never without a light touch when the situation calls for one. Perhaps the only weak points here were the song-and-dance interludes that felt forced and necessary, but would have done heaps better without these pauses in the narrative, mostly for romance to take place, and to flesh out more depth to the Ajay character. But in all honesty, it's the audacity of the crime that's being committed that we're here for, and to see just how, in true Ocean's Eleven style, these robbers get to wriggle their way out of trouble. Recommended!",
            "review_date": "2013-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Akshay fooled Manoj and Neeraj fooled the audience",
            "content": "Special Chhabbis (a group of twenty-six specially chosen people) is based on the real life event of the loot of the jewellery showroom of Tribhuvandaas Bheemji Jhaveri in the Opera House of Mumbai (then Bombay) on 19.03.1987. The specialty of the loot was that the robbers had posed as CBI officers giving the loot the look of a CBI raid on the showroom, taking away jewellery worth millions in the shape of the forfeiture of the unaccounted goods. For this purpose, the robbers had used 26 fake probationers of CBI, 'recruiting' them through a fake interview just one day before and telling them that this raid was a 'practical test' for them. This incident gave Neeraj Pandey,the filmmaker a plot to make a thriller movie which has come in the form of Special Chhabis.Neeraj Pandey has shown that there is a group of four conmen who pose themselves as CBI officers or income tax officers and conduct sudden (fake) raids on the business houses and residences of corrupt govt. officials and ministers. The 'confiscated' currency notes and jewellery is their booty with which they vanish in the thin air without the robbery being reported to the police because of its being black money. They are fond of slapping people also while conducting the raid nay robbery. And they are very much proud of this act of theirs too as if they were doing something laudable. Coming from different cities, they assemble only for this joint venture of themselves whenever it is planned by their leader - Ajay (Akshay Kumar). After such a raid at the residence of a minister in Delhi on the Republic Day of India in 1987, the matter reaches the real CBI and an honest and dedicated CBI officer - Wasim Khan (Manoj Bajpayee) starts trailing them. By taping the phone of one member of the gang - P.K. Sharma (Anupam Kher), he comes to know of a big robbery planned to be conducted in the jewellery showroom at the Opera House of Mumbai (Bombay) and also the drama of recruitment of 26 youngsters to use them as ignorant accomplices in this loot. But despite his knowledge of everything, the loot takes place. His team of 26 cops proves to be the Special 26 for the robbers (and not the recruitees) which is used by the mastermind as the ignorant accomplice for the job. Instead of the showroom, the workshop of the owners gets looted where the jewellery of the showroom had been shifted by the real CBI.First let me jot down the pluses of the movie in a nutshell (because their trumpet has been blown by several reviewers quite loud). The filmmaker has created the period of the eighties with almost perfection on the screen which is a great job and deserves high accolades. The performers have done exceedingly well especially Manoj Bajpayee who from every angle, appears to be a no-nonsense CBI officer. The movie contains good humour and Ajay's demonstrating his quick-wit in an unexpected adverse situation is highly impressive. The director has maintained the momentum of the narrative throughout keeping the audience hooked (with the exception of the utterly superfluous romantic track). It's a very interesting movie, no doubt.Almost all the viewers and the reviewers got so much carried away by the entertainment value and the bringing the era of the eighties alive on the screen that they (perhaps unknowingly) bypassed the minuses of this movie which are no less in number than the pluses.The filmmaker has not bothered to explain the reason behind this robbery act of the characters except a (probably false) explanation furnished about Ajay's failing to make it to the CBI years back which led him to become a fake CBI officer. Very less is told about the personal lives of these foursome except the family life of P.K. Sharma containing his wife and several children. Besides, he has glorified the crime as if it were some noble cause. The real CBI officer shifts the jewellery of the showroom to the workshop, replacing it with imitation jewellery. Why ? When the robbers were going to be caught red-handed, what's need for that ?Neeraj Pandey has tried to create an unexpected twist in the climax of this movie in order to give a shock treatment to the audience. However since in case of this movie, the story is a real life incident, he had to amend it to create the desire shock value. This shock is less for the real CBI officer who has been made a fool by the conmen, more for the audience who has been fooled like anything by the filmmaker. It is revealed in the end that the cops who were posing as the ignorant accomplices of the con-gang are actually fake and their real accomplices. How can one digest it because the fake cop (Jimmy Shergill) himself brings the case to the real CBI and himself furnishes the identity and the Chandigarh address of P.K. Sharma (Anupam Kher) enabling the real CBI officer (Manoj Bajpayee) to tape his phone and thereafter trail and nail him ? This is as good as hitting axe on own foot. Besides, when the actual address of Sharma is known to the CBI,how can he escape now ? He has a very large family and establishment behind him. Neeraj Pandey has challenged the intelligence of his audience and fooled them. In no review of this movie (except the one on Koimoi.com) did I find this flaw of the movie being highlighted. What does it mean ? Do we enjoy being made fool just because the filmmaker has entertained us very much ? And is this why that instead of complaining, we start going ga ga over the movie and singing praises for the conman, i.e., the filmmaker ?",
            "review_date": "2013-04-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very Special Chabbis......",
            "content": "An amazing movie with a very good twist in both the starting and the climax part. All actors have performed well and the movie is worth watching. The amazing weekend blockbuster starring Akshay Kumar, Kajal Aggarwal and supporting actors Manoj Bajpay, Anupam Kher and Jimmy Shergill. This movie marks the comeback of the greatest action star Akshay Kumar in his amazing comic role + serious role. This movie depicts four characters who looted the money of rich people like ministers and jewelery shop owners who were corrupt by claiming themselves to be CBI and in other case as Income Tax Dept. This issue is shown in the movie which refers to actual occurrence of such robberies in the 1980's in India.",
            "review_date": "2013-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Must See!",
            "content": "Neeraj Pandey's 'Special 26' is A Must See! A nail-biting thriller, that borrows its premise from true events. Its a solidly written, superbly directed & sharply acted film! 'Special 26' is based on a real life group of con artists who pulled off many clever robberies during 1980's, and robbed famous businessmen and politicians by pretending to be the CBI or Income tax officers, and on the pretext of conducting raids they would take away all the black money.'Special 26' has an engaging first-hour, but a spectacular second. The twist in the tale is highly shocking but cleverly executed. Neeraj Pandey, Writer/Director of the 2008 cult-classic 'A Wednesday', delivers another winner with 'Special 26'. His Screenplay is solid, while His Direction is simply superb. Cinematography by Late Bobby Singh is excellent. Editing is good. Art & Costume Design are good.Performance-Wise: Anupam Kher is gloriously scene-stealing. The veteran plays the paranoid yet sly fake CBI Officer with remarkable ease. Akshay Kumar is a terrific actor & he's in serious form this time around. Manoj Bajpai is exemplary, as always. How good can Bajpai get? Jimmy Shergill is restrained. Kajal Aggarwal is fair. Rajesh Sharma is impressive. Divya Dutta sparkles in a cameo.On the whole, 'Special 26' is a gem!",
            "review_date": "2013-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best hind films ever. One of best heist dramas ever!!!",
            "content": "Amazing film, best Indian heist drama ever. One of the best Hindi films I have ever seen period. Its a gripping thriller,story keeps you on the edge of the seat, loads of laughter also. Acting wise Akshay Kumar is the best, his best performance ever. Manoj Bajpyee, Anpuam Kher and Jimmy Shergill are amazing, award worthy performances, career best for all. Direction, Screenplay and Script wise Neeraj Pandey is beyond belief good, should be pick up all bollywood awards and national award. Won't reveal anything about plot because would ruin the film but its must watch movie for everyone, not enough words to explain this masterpiece. 10 OUT OF 10 5 OUT OF 5ASIL POWER DIL MEIN HOTA HAI!!!",
            "review_date": "2013-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Traits of several movies, yet an overall amazing movie",
            "content": "I just have to say that they have got traits of several movies (Oceans Trilogy and The Illusionist to be exact). But they have woven a great story around a perfect plot so well, that one would enjoy every aspect of it. Yet another great work from the magician named Neeraj Pandey. Even Akshay Kumar's presence has been good, amazingly. Anupam Kher also have done a marvelous job, and so has Manoj Vajpayee. The cinematography and the BGM shot off the hook, while the special effects were quite lame.The overall screenplay has so been so beautifully shot, and the basic plot being excellently set, one would actually enjoy this movie to its core. This is a great watch for all movie lovers. From within, I told myself while watching this movie, \"Finally, an entertainer. And that too a proper one...from Bollywood, after a long period of time.\"",
            "review_date": "2013-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Akshay Kumar is back with a bang",
            "content": "After an excellent 2012, Akshay starts 2013 with a fantastic film. Special 26 was the one movie the Khiladi needed as even if his previous films were successful, they weren't great. Baring OMG:Oh My God, his other films all depended on solid one liners, superb action, and word of mouth. I have nothing against Masala movies, they are quite entertaining but, it is not as good as a realistic films like Kahaani, Taalash and the recent Special Chabbis. The movie isn't successful only because of Akki, other people have contributed quite a lot to the film. What doesn't the film contain? Powerpacked performances, funny dialogs, decent songs, a proper flow in the story.The story is based on some true incidents that happened in the late 80s, it's about how certain people raided officials like ministers as fake CBI. These fake people would steal all their goods and money and leave the place, make it look like a real incident and leave. They would go to a secluded location and change their identities, from their they would part their own ways.The movie has something called a proper storyline, it also has a good flow in the storyline. There are hardly in clichés and plot holes in the storyline and everything is well directed. The only cliché would be the forced romance of Akshay and Kajal which doesn't fit well with the story. Other than that, the whole storyline has been well handled.Performances are first rate for the most part, Akshay Kumar does a brilliant job and it doesn't look made up. Being an Akki fan, this movie was a must watch for me. After a decent 2012, the Khiladi does a brilliant job in a realistic and well made film. Kajal Aggarwal looks gorgeous and acts properly though her part wasn't needed in the film. Even then, she does a good job as the heroine. Anupam Kher does a brilliant job in a supporting role and the same goes for Manoj Bajpayee. Jimmy Shergill is fabulous and the twist involving his character nearing the end is extremely well handled. The rest provide good support and do what is required.Music is decent, Gore Mukde Pe Zulf Di Chavaan is good(Kajal Aggarwal looks beautiful in that song), Kaun Mera is slow and melodious, Mujhe Me Tu(Sung by Akshay Kumar) is fabulous, it is so nice to listen to. The rest are good fillers for the movie.Direction and story by Neeraj Pandey is superb, he handles the whole movie properly without any rough patches. Even if the romantic angle is forced, it is well handled as there is no overacting and boring moments in the romantic bits of the film too. Kudos to Neeraj for giving Akshay the well directed and well scripted film he needed. Because besides OMG, none of his films were well scripted though the entertainment made the film worth watching despite the films being silly in parts.On the whole, Special Chabbis(26) is a brilliant film scripted and directed by Neeraj Pandey with Akshay Kumar and Kajal Aggarwal in the lead.",
            "review_date": "2013-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wow wow wow Super wow movie watch rush to near theater now..Double paisa vasool movie",
            "content": "All i say its more than worth to watch this movie.Super movie with full of entertainment and drama. Kajal aggarwal was not up to the mark in movie but standing ovation for Akshay,Jimmy Divya Dutta and last but not the least Manoj ji tremendous job by all of them.All i say Kajal does a bakwas job she was better in singham. But movie full of twist and drama and u do not think to leave your seat. Bit boring part is the chemistry between Akshay and Kajal. And all four team members does a tremendous job. After a long time such a movie come. When 2.40 hrs gone i didn't come to know. My 3 favorite Dialogues:- 1. Asli power Dill main ho ti Ha. 2. Asli kaam to yeah kar rahe Ha hum to bus apni.... 3.full form of CBI is \"Central Bank of India\"One time must must watch u will definitely have a great memory.:)",
            "review_date": "2013-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Crisp and Flawless",
            "content": "This one comes from the director of the classic 'A Wednesday', so the expectations were high and the question arises is does it stand up??It does and does so well that you may well end up watching the end credits .The movie starts with a sequence of fake CBI Interview wherein the intensity of both Anupam Kher and Akshay Kumar builds the movie further with fake CBI Issues piling one on another.The high point of this dramatic satire is that there are no dull moments.Even the scenes between Akshay and Kaajal are ain't boring.Since the movie stars well acclaimed actors there was seldom chance of bad performance. Manoj Bajpai , Anupam Kher , Akshay Kumar top notch. Great Supporting cast from Jimmy Shergil and Divya Dutta.All in all its a movie recommended to the class of different genre movie lovers.Great to see AK in a different role after long time.Rating:Unimportant",
            "review_date": "2013-02-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent heist film to come out from bollywood. Wud hav rated 10, but the unnecessary romance angle prevented me.",
            "content": "Written n directed by Neeraj Pandey (A Wednesday). Cinematography by Bobby Singh (Gangster, Life in a Metro). Edited by Shree Narayan Singh (a Wednesday- excellent job in that film but don't know y he dint cut the romance angle from this flick). The film takes its foundations from the robbery of 19 March 1987, when 26 people posing as income tax officials raided a jewellery store in Opera House, Mumbai. Nice thriller marred by bad n unnecessary romance angle. Nevertheless, I enjoyed this movie. Akshay was OK. Can't act. Anupam stole the limelight. He was too good in this film. Perfect Indian heist film. Loved it man.  Akshay shud do more films like these n avoid baby, houseful n holiday kinda films. Manoj bajpai was excellent as usual. Even Shergill acted well. Good attention was paid in detail (very rare to see in Indian films), good character building. Best was the cat-and-mouse chase between the conmen and the police. Nice twist.",
            "review_date": "2016-04-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brilliant plot, hats off to Neeraj..",
            "content": "I have to say that this is the best con movie Bollywood has ever produced; and yes I've seen Doom I & II. After watching Neeraj Panday's directorial debut A Wednesday, expectations for this film was already sky high and he didn't fail to meet our expectations. An excellent plot backed by great acting from the whole crew except Kajal Aggarwal. I don't want to reveal anything about the plot in fear of divulging those great twists in the process. The songs were really poor and irritating and was interrupting the general flow of the story; the romance angle was a complete failure; and though Neeraj did a great job in picturing the gritty real life scenes but in some places they felt a bit dull and lack-lustre. Without those horrible unnecessary soundtracks and romance, this movie could have been bold enough to be compared to OCEAN'S ELEVEN. But overall, this movie is no doubt quite impressive and a must watch for all con movie lovers!!!",
            "review_date": "2013-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "First hit of 2013",
            "content": "The movie is 2.5 hrs long (yes, I checked!) which could have been easily shortened to 2 Hrs. Just remove all those good for nothing songs, few flashbacks (collage of scenes which you've already seen) and one or two more unnecessary scenes.BUT, but, don't go by that negative starting, this is a good movie and may be first hit of 2013 from Bollywood. Neat(well, 98% neat) script, short and smart dialogues accompanied with powerhouse acting of Manoj Bajpayee, Anupam Kher and Akshyay Kumar(I've never thought I would say Akshyay and good acting in one sentence, ever!)Go, watch it...you'll definitely enjoy it.",
            "review_date": "2013-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A fine heist thriller which is enjoyable if you are willing to ignore its big open loopholes.",
            "content": "A Neeraj Pandey film post the classic A Wednesday cannot escape two major things associated with it unarguably. One is the huge amount of expectations among the viewers from his second film and the other is a comparison in their minds with his debut movie which was acclaimed all over unanimously. This time the basic theme revolves around few shocking true incidents of 1980s wherein four people posing as CBI or Income Tax department men robbed several businessmen and politicians in the broad daylight and nobody even reported those fake raids due to the fear of revealing their unaccounted black money. The subject is no doubt a well chosen one which also has been made into a fine exciting thriller which would surely entertain majority of viewers interested in this particular genre. The fantastic initial 30 minutes impress you a lot and then you get into the mood of watching an engrossing heist tale of four entertaining con-men who plan & execute their brave heists with great intelligence and confidence.To begin with, SPECIAL 26 has an uneven first half with a forced in love angle and few good songs (taking you again into the clichéd Punjab) which I was never expecting in a film from the maker of A Wednesday (a song-less masterpiece). Anyway, to say the truth, the film would have been a much better, focused and inspiring tale to watch without all these silly, forced in sequences.In the second half, though there is another song to continue the avoidable teasing, still Neeraj gets back on his track soon and then gives you a shocking climax in the end breaking all the norms of such con-films made in Indian Cinema till date. The twist in the tale makes you sit straight and forces you to think that how they actually did it. Yet here once again I would like to say that S26 will surely be appreciated more by the lovers of this particular genre only because the film has a major part of its content without dialogues with just the pulsating background score keeping the energy alive and the actors performing their act on the screen silently. Hence it's basically a film, which is more concerned about its rare plot in the script and less about the actors performing their roles on the screen (as it should be).Apart from its exceptional execution SPECIAL 26 also excels in its department of Cinematography and Art Direction showing the cities of Delhi, Mumbai and Calcutta in the late 80s almost perfectly. To give you the feel of that developing era, the essence of those times is well taken care of with all Maruti 800s, Fiats, Black Autos, the old Connaught Place (partially), Best Buses & Bus Stops in Bombay and Trams in Calcutta shown clearly in all the long and close outdoor shots taken elegantly. Further its also nothing short of an achievement made by the director that despite of being a film about con-men, police and thieves performing some big crimes, there is not even a single scene of blood- shed, murder or gun-shots. So visually too it's a great work done by the team lead by the talented Neeraj Pandey which needs to be watched keeping in mind the obvious points (like there were no communication sources at that time other than the fixed line government allotted telephones in our homes).Musically, S26 didn't require a romantic plot and the songs at all even if they do give you some listening pleasure for few moments (like Kaun Mera) . The songs hinder the pace of this crime-chase thriller hugely and they have clearly been added to suit the image requirements of the lead hero.Akshay is in terrific form in the film and emotes well in all kinds of scenes in the script, which is far different and ahead than most of his recent mindless comedies. But in case, the romantic angle was in reality forced by him only then its pretty evident that he was not 100% confident about the genre of S26 and its success right from the beginning. Both Manoj Bajpayee & Anupam Kher give another splendid performance of their bright careers as expected. Jimmy Shergill is efficient and same can be said about Rajesh Sharma and Kishore Kadam who mostly remain silent throughout the film.Kajal is wasted in a forced role and Divya Dutta shines in her small cameo.Having said that the film still has many big flaws(like the real identity of Anupam and his residence already known to Police, still he manages to fly away with his wife) which force me to rate it a bit lower than desired. However one can enjoy it surely if he wishes to ignores these big open loopholes in its entertaining script. So due to that very reason SPECIAL 26 remains a fine heist thriller from Neeraj Pandey which can surely be considered as A TUESDAY after his A Wednesday and not A THURSDAY.",
            "review_date": "2013-02-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best Con Movie That Bollywood has ever produced",
            "content": "This is undoubtedly the best con movie Bollywood has ever produced. Bunty & Bubli, Bluffmaster all take a back seat when compared to this gem. The details with which every con job has been portrayed along the engrossing Background Score keeps you on the edge of your seat for most part of the movie. The romance angle was quite unnecessary though. They should have stuck with Oh My God & Paan Singh Tomar approach. If your story is good enough Indian audiences can forgive the director for not including forceful romantic angles in every movie. By interval you will be unknowingly rooting for the Bad Guys. The way the story ends leaves you in quite an awe. Good times await for Indian audiences and this movie is an indication for the same. Must Must watch for all.",
            "review_date": "2013-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very Impressive...",
            "content": "Special 26 is a very impressive film from start till end with minor bumps which if edited would have straight away landed it as the Best film of 2013 without even waiting for rest of the movies which will release. Neeraj Pandey has done it again, very talented Director. I am already waiting for his next flick.Special 26 is executed really well with top notch performances from the actors. This movie will keep you waiting for something to happen. Will the elite CBI officer catch the smart con its better you watch it yourself. The movie has its share of light moments which are situational. Songs are not great and the love angle would have been presented better maybe but then you feel it more due the adrenalin the director has already built up.Akshay Kumar is fantastic, Manoj Bajpee is as usual good, Anupam Kher great. Overall the movie is presented very well with the climax being the best a thriller/suspense movie can have. I am sure you will try and guess the climax but rest assured you will be served with a delightful climax which will leave you with may be a Smile on the face or \"Hell man he is a genius\".I will go with 9/10 and you will know why the lone star is missed.",
            "review_date": "2013-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Special 26 is a must watch taut, racy, realistic thriller which plays on war-of-wits",
            "content": "With talented directors' innovative bend of mind we are subjected to some brilliant cinema off late (though the 100Cr trashes still rules the marquee).Neeraj Pandey is one of such avant-garde story teller who wooed the audience with his flawless directorial debut \"A Wednesday\" half a decade ago. After a hiatus he is back and back he is with a Bang! Special 26 takes us back to the era of 80s (not the loud inane \"Himmatwala\" kind) when things were less convoluted and people still used to have faith on fellow sapiens. In terms of technology life was simpler and people had the time to use their wit to the summit. The film is about an team of four intelligent con men who used to impersonate CBI officer (or Income Tax officer) & raid corrupt ministers, businessmen to loot their \"black\" money. Their confidence & acuteness gets tested when pitted against equally capable Wasim Khan, a dynamic CBI officer. Therein begins the war of wits which becomes more captivating with the progress of the film. Based on real events it is heartening to see that someone had the wit & balls to con those who are conning the whole nation.Neeraj Pandey should be showered with awards for this brilliant script which keeps you on the edge. There are many con films being made in India but this will feature amongst best Heist & Con drama made in Hindi so far. Pandey's film is one rare script-based gem that plays on the wit and gives a realistic touch to the proceedings. The detailing used to re-create the 80s deserves accolades. Every city shown in the story gives you the feel of the by-gone era and with usage of orange-brownish colour the tone of the film becomes more accurate. From telephone sets to car to newspaper the effort given in detailing oozes out from every scene. Dialogues like \"Ye juicer grinder kya hai\" hints on a subtly how mechanical we have become. The brilliant script is complimented with sharp dialogues with layered humour. One master stroke was when Akshay points on so many children of Anupam kher to which he replied that there wasn't any TV for entertainment in those days. At least there we have a reason for this gigantic population of ours ;) The script of \"special 26\" throws light on why Neeraj took 5years to make his second venture after a stupendous debut & now he stamped the fact that his maiden attempt wasn't a flash in the pan. Special 26 raised the bar & full marks to Pandey for making a commercially viable yet realistic, intelligent racy heist thriller that can proudly rub shoulder with world cinema.Late Bobby Singh's camera-work coupled with Reddy's art direction brings alive the 80s distinctive flavour with honesty and reality. Narayan Singh's editing gives the edginess to the narrative keeping us glued to each scene. The visual graphics used to recreate the 80s are commendable.Neeraj persuaded Akshay for the role and he excels as an astute con-man who let his brain speak rather than muscle. It is a rarity for Akshay who sheds his superhero image and gives an earnest performance. (How i wish he does more Speicla26 & OMG rather than the housefull rowdies. Also this film should force Sallu & Devgan to do at least one meaningful film).Manoj Bajpei is one of the finest actors around and we can only expect the best from him- whether it is revenge stricken Sardar Khan in GOW or a upright dutiful officer Wassem Khan in this film Bajpei is superlative. Even when he isn't speaking he is emoting through his posture & expression. Anupam Kher gets a meaty role after a gap & he pounce on to it giving a phenomenal performance. Jimmy Shergill had a strong yet understated character which is of extreme significance to the narrative & he doesn't let you down. As a dismissed confused police officer vowed to unmask the con men he adds more spice to the chat-pata narrative. Divya Dutta shines in an interesting supporting role. Rajesh Sharma is ever reliable and he made his presence felt in a role which is far cry from nutty Tikku mama from \"Luv Shuv tey Chicken Khurana\". Kajal Agarwal looked good but her character was forced and could have been done away with. The rest of the cast were restrainedly exemplary.Neeraj Pandey gives a winner again after \"A Wednesday\" and this is not to be missed. An earnest, honest and realistic heist drama which comes once in a while in Hindi. Good to see brainy films for a larger audience are getting made nowadays. Let us help this superb film to cross the 100 Cr mark to show respect to this kind of films. Indeed a special experience for cine-goers who are bored with typical 'race2' kind of films.",
            "review_date": "2013-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A W E S O M E 26 - Very - Good Movie",
            "content": "amazing entertainer with a fast-paced & exciting plot. This is one of those movies which keeps on lingering in your mind even after the climax and you keep going back to the brilliant sequence of events and how they were executed throughout the plot. Every one done his job very well in this movie.Neeraj Pandey after his directorial debut with A Wednesday completely redeems himself with Special Chabbis and reaffirms his position as a master director. He is definitely not a one film wonder and a director to watch out for in the future. The best and the most noticeable part of the film is the period that it has been set in. 1980's have been very effectively portrayed in the movie, whether it was the cars running on the roads or the streets of Delhi especially well known areas like the Connaught Place, whether it was the print style of the newspapers or the clothes and jewellery worn by the actors. The whole movie seems to be set in 1980 and all credit goes to the art director along with the director. I am still wondering how he shot in the heart of Delhi with all these props from the 80s.The casting is perfect and each character in the ensemble of great actors delivers are powerful performance. Akshay Kumar has always been a great actor for me despite critics and so-called intelligent viewers writing him off. As the linchpin of the team he is subtle, intelligent and still manages to be funny in his own earthly way. This is definitely another feather in his cap with his long list of successful movies. Anupam Kher as a vulnerable supporter of the leader and a lustful old man (considering his long line of children) is superb and reminds of a perfect Punjabi uncle. Rajesh Sharma (Munjal from the movie Khosla ka Ghosla) as the third character fits perfectly into the well oiled team as the big guy from a Purani Dilli joint family. Kishore Kadam as the oppressed husband though a reserved role makes an impact. Jimmy Shergill's portrayal of a frustrated suspended police officer is very believable and you can't fail but empathize with the character of Sub- Inspector Ranveer Singh. But, Manoj Bajpayee is the actor which never ceases to amaze me. You put him any role and he shines, sometimes more than the protagonist. As a no nonsense CBI officer he again steals the show and gives another honest performance worth a standing ovation. Kajal Aggarwal (from Singham) is a pretty girl and looks pretty, however her character's contribution to the story is a little frivolous.The climax hits you in typical Neeraj Pandey style which I am sure is fast becoming his signature style in his movies. Full marks to him for great direction, amazing portrayal of all characters, great plot, superb casting and above all perfect detailing.Go and watch it, and I definitely can again. This one definitely lived up to my expectations and left me hungry for more (I waited till the end of casting hoping there would be another surprise scene at the end). you will enjoy every single minutes ....",
            "review_date": "2013-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A smart film that's well worth your time.",
            "content": "No kidding, Akshay Kumar has finally broken his self-imposed jinx and has taken up a film which doesn't demand him playing an overtly boisterous character. \"Special Chabbis\" is a welcome relief from the usual gibberish we've come to expect from the Indian film industry and a film that lives up to every promise it makes. Literally. From the fresh breed of young filmmakers that took over the new phase of the industry, director Neeraj Pandey's voice soared higher than anyone else's with his stunning debut \"A Wednesday\" four years back. And now, with \"Special Chabbis\", I can solemnly state that he could well be the next big thing.In the late 1980s, a group of four con-men dress up as fake CBI officers and conduct raids on corrupt ministers and run off with millions before the unsuspecting ministers figure out that they have actually been robbed. Since the money involved in these raids is brought in by scams, no one dares to report this to the police. The group consists of Ajay (Akshay Kumar), the real brains behind the raids, the timid Sharmaji (Anupam Kher), Joginder (Rajesh Sharma) and Iqbal (Kishor Kadam). While the group commits daring daylight robberies, the helpless CBI cannot do anything but look on. Finally, SI Ranveer Singh (Jimmy Shergill), a disgraced police officer who had helped the felons in one of their raids oblivious to the fact that they're actual robbers, agrees to help CBI officer Waseem Khan (Manoj Bajpai) to track them down. Ajay and Sharmaji agree to commit one last robbery- their biggest- and then disappear. But unbeknownst to them, Khan is eavesdropping on their telephonic conversations and wants sufficient evidence to nab them. The game of cat-and-mouse boils down to a tense climax where no one wants to be the one on the losing side.Bringing a real-life incident to the big screen is never easy but Pandey, working from a wonderfully twisty script, handles the camera with assured confidence which is evident from the way he builds the suspense. Recreating the events that transpired in great detail, the urgency with which the film is narrated is a perceptible sign of a man who knows what he's doing. The story is smoothly told with a consistently flowing narrative and the infusion of wry humor only helps to add to the delightful pleasures of its marvelous execution which can only be relished. The film is supremely funny in parts which, I admit, was an unexpected surprise from the director who had last directed a thriller which strived on palpable tension.In a film which boggles us with its sheer energy, a romantic angle threatens to cripple the narrative. That has unabashedly been the tragic biography of thrillers in the Indian film industry for decades and it's no different now. I cringed at the unnecessary use of songs and a half-baked romantic plot which is completely trivial to the story. So, why lace the film with them? No idea. I reckon the makers couldn't resist banking on the love story to set the cash registers ringing a little loudly than they would've ringed otherwise.Of the performances, Akshay Kumar is reliably excellent, as is Manoj Bajpai. Anupam Kher is terrific in the role of the timid Sharmaji, providing much needed chuckles with his mousy demeanor. Jimmy Shergill does well in a small role. Kajal Aggarwal's role is a trivial one, vastly underwritten and a balmy decision on the part of its director. \"Special Chabbis\" is a smart film which greatly respects the intellect of its audience and which audaciously attempts to bring an arduous anecdote to life and succeeds in keeping us hooked for 150 minutes, a film whose superb script triumphs over the credentials of its makers. How can anyone resist that?",
            "review_date": "2013-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Well-Made Thriller",
            "content": "Neeraj Pandey has directed 3 movies as of 2015 and all of them have been thrillers. Special 26 is no exception and it is based on a real life robbery that took place in Opera House, Mumbai in 1987. A trademark of Neeraj Pandey's movies is the brilliant cinematography which makes the visuals exceptional. As the movie is set in 1987, the filmmakers have made a lot of effort to recreate that era and it can be seen in the production design. The movie tends to veer towards the direction of typical Bollywood movies but for the most part it is a taut thriller with solid acting performances. Manoj Bajpayee is the pick of the actors and he is authoritative as the CBI officer. My overall impression of the movie is positive and it is definitely recommended.",
            "review_date": "2015-06-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent movie must watch",
            "content": "This is really excellent movie done acting by Akshay. His role is CBI officer and acted brilliant in the act. He is not an original CBI officer , he was the thief in the same movie.Special 26, also known as Special Chabbis, is a 2013 Indian thriller heist film directed by Neeraj Pandey. It stars Akshay Kumar in the lead role with Manoj Bajpayee, Anupam Kher, Kajal Aggarwal, Jimmy Shergill and Divya Dutta in supporting roles. The film is inspired by the 1987 Opera House heist where a group posing as Central Bureau of Investigation (CBI) officers executed an income tax raid on the jeweler in Mumbai. Special 26 released on February 5, 2013 to widespread critical acclaim and was regarded as one of the best films of 2013",
            "review_date": "2015-11-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Special Chabbis is truly Special",
            "content": "Special Chabbis is truly Special ..Special in terms of Acting, Screenplay, Cinematography and above all is the flawless Direction..Neeraj Pandey has picked it up from where he left in 'A Wednesday'. He has successfully quenched the expectation and hype which was created for this movie.The film is based on late 1980s which works as another high point for the movie. AK is awesome and his controlled yet subtle emotion looks like he has reincarnated himself as AJJU ..Not that this is his career best performance but a performance we have been longing for Specially from him. Manoj Bajpayee and Anupam Kher are Special too as i cant think of anyone who could do a better justice to the characters they played. Jimmy Shergil and Divya Dutta are underutilized. The villain of the film is the Romance angle which looks immensely forceful and acts as a major Speed Breaker to this pacey thriller (1st Half). Overall this is brave attempt by our Director which seems to have worked. Kudos to Neeraj Pandey for raising the standards of film making in Bollywood.",
            "review_date": "2013-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very entertaining",
            "content": "When I went to the theatre yesterday, I did not know this movie was by Neeraj Pandey (\"a Wednesday\" fame). (Interestingly, I was also watching \"a Wednesday\" (yet another time) later yesterday night on TV after watching Special 26.) I had hoped on this based on the trailer and Manoj Bajpayee. I didn't know it was based on a real life incident.I expected only entertainment and got only entertainment.The plot is fast paced and starts off right in the beginning. You kind of get the introductions later. It took me a while before I realised this was a period film with no mobiles and with old (now illegal) vehicle number plates.The plot is not very tight and there may be small holes here and there, but overall, it is executed with precision. The acting of Akshay, Anupam, Rajesh Sharma, etc, were top notch. Manoj Vajpayee does a fairly good job, too.The only character that did not impress me was Kajal Agarwal's. Neither did her acting. She had trouble speaking Hindi, too and many a times, I felt her sequences were unnecessary. But the movie goes on at a pace that can make you ignore this aspect altogether.Overall, I give it 8 for entertainment and direction.",
            "review_date": "2013-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Simply Superb",
            "content": "Another classic from Neeraj Pandey. After The Wednesday I was actually waiting for his next movie. This time, its a Con Game. and he pulled it with a class. Be it the simple things like Telephones in 80's or Contessa, Premier Padmini car's, or the nostalgic colors. From the first scene to the climax, its a thrilling ride. You would be glued to your seats until the last scene. One thing that kind of not liked a lot is the love track, but i guess its part of story and again its my personal opinion.I guess I am not even qualified to comment about the actors in the movie. Superb acting, great storyline and excellent background score.Overall Simply Superb. Don't miss it",
            "review_date": "2013-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Average treat that could have been scripted better!",
            "content": "Tone, Script & Story: The story highlights how a fake CBI teams loots the wealthy. It highlights few of the loot scenarios.It was in my mind that this team loots the money from officials like those in government i.e they loot from corrupt officials but their last raid highlights something else and that was an ethical drawback for me.Direction, Screenplay, Cinematography: Neeraj Pandey is one of the best directors. Although not as good as Baby, A Wednesday or M.S.Dhoni: The untold story, still special Chabbis is good enough. I would like to highlight something more than any of the factors like writer, cast, music, etc the factor that gets me going the most is direction. Neeraj has his reputation in that in good sense. Music: Music is average. Acting: Acting is justified.Final Verdict: Average treat that could have been scripted better to be ethically strong.",
            "review_date": "2018-08-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Despite Getting Bogged Down By Forgettable Dance Segments, A Kitschy Romantic Subplot & A Hollow First-Half, Special 26 Gains Momentum Post-Interval And Wins Big With Climax",
            "content": "Special 26 begins well, ends better. Neeraj Pandey knew exactly how he had to surprise his audience, and so he probably wrote the rest of the movie hurriedly, only highlighting the key dialogs, because he knew that even if the audience remained less complimentary towards Special 26 till the interval, they would love it by the end because of the twist ending they had never expected. Before the interval, Pandey does not really have much to tell and so he inflates all his scenes till he can get sufficient footage for the average runtime of a Hindi film, and in the endeavor he wastes a lot many frames on forgettable song and dance sequences and a kitschy romantic subplot. After the intermission, although he begins with the same mistake of tarrying too long on unimportant sequences, once he gets to the section that justifies the film's true purpose, Pandey's approach becomes smarter, subtle and succinct. His screenplay required more of the crackling wit and dark humor which movies like 1986s Bette Midler starrer Ruthless People had, and some of Special 26's cast could've enlivened their roles with more spontaneity, yet Neeraj Pandey pulls off a successful heist film with his flair for unexpected climaxes. The best thing about Special 26 is the title: while you may have a fair idea about what the title stands for in the film from watching the trailer, you would be surprised by how well the title serves as a motif in the film. The motif not only acts as an aid for the game-changing climax but it actually sacrifices itself for the climax. You won't get what I'm telling right now but understand it after watching the film. I'll put it this way: The Special 26 in the film serve little purpose in the film except to become scapegoats for the actual purpose of the movie. The main plot of the film involves a group of crooks posing as CBI agents who raid the filthy-rich and escape with the black money. The two lead crooks are played by Akshay Kumar, who plays Ajay Singh, and Anupam Kher, who plays P.K Sharma; the duo joined by Joginder and Iqbal find this job extremely profitable and easy to execute because in most cases, the aggrieved parties do not file FIR fearing that their name would be tarnished if they do so. One of their successful targets shown in the film is a minister who stashes multiple bundles of notes behind library books and in large containers under the praying area.The group is accompanied by police officers Ranvir Singh (played by Jimmy Shergill) and Shanti (played by Divya Dutta) who too mistaken them for real CBI officers. After the group successfully escapes, the two officers are left shame-faced and are suspended by their superior. Ajay Singh and the rest then decide to go Kolkata for their next fake operation while Shergill (and Dutta) teams up with real CBI officer Wasim Khan to track the impostors down. On PK Sharma's insistence, Ajay Singh decides that they need to do something big, and for that they shall need additional help, and so they begin recruiting the 'Special 26'.Throughout the raiding sequences, we see money tumbling out of many unexpected places. Some are stashed under the back seat of a dusty unused car. Some are found in locked cupboards. Some are kept in hidden rooms. All throughout, we see the wrongdoers (as in those who've stashed the money and are in turn getting robbed) plead and give the silliest of excuses to prevent further raiding. For example, the minister's wife begs to the officer not to search the temple area as God's peace would be disturbed. These sequences needed more sparkling humor, and I can think of one person who would've got this humor while still retaining the central objective of the film: Paresh Rawal. All we get here is characters going \"What is this we have here?\" \"Sir, look what I've found!\" without getting more punch lines. And although Akshay and Anupam do a fair job at playing their characters, I believe the film would've been much different had for example, Ranbir Kapoor and Pankaj Kapoor or Naserrudin Shah or Rawal played the leads. Akshay Kumar plays Ajay the same style in which Ben Stiller played the lead role in Tower Heist: he seems to be there in every scene, he speaks each line clearly yet he does nothing extra to make him more believable as a street-smart, dexterous con-man who's capable and smart to execute complex plans. And worse are his unsuccessful attempts at creating chemistry with the inept \u0085; Pandey could've easily trimmed the entire film to a brisk ninety minutes by removing much of that time-wasting subplot. While Special 26 succeeds whenever it exclusively focuses on its core plot, it disappoints when it deviates to back-stories and subplots. People are raving about this movie as if it's something they've never seen in Indian cinema, but I'd like to remind that there was a similar film which achieved resounding overall success in its execution some years ago – Hera Pheri.",
            "review_date": "2013-02-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "bang on target!!!!!!!!!!",
            "content": "this movie \"Special 26\" is really a special movie for akshay kumar in a long long time...neeraj pandey's previous directorial movie \"A Wednesday\" was an awesome thriller drama film and he has done the same amount of justice with his latest special 26..the movie doesn't bore u anywhere during its 2 and a half hour run and ends with a decent climax.!! manoj vajpeyee as usual have done justice to his role and not to forget anupam kher who is very special in this movie!! jimmy shergil, once again have proved himself in a short role as he did in \"a Wednesday\"!!! a treat to watch for intelligent film lovers.. \"WELL DIRECTED AND VERY WELL ACTED\"..",
            "review_date": "2013-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A well written and ill executed film.",
            "content": "A well written and ill executed film.For most of the time, people are walking in the film and that too as if in stop motion, where the slow motion comes and disturbs the interest. The climax is more or less predictable just that it had a few hints by the end and an avid film goer might have predicted it. OK, the performances are good and I must say, post MOHRA this is the first film of Akshay Kumar I had seen in theatre and I was actually happy as it did not have fights or unwanted action sequences and instead had some brain thing. Thanks to Neeraj Pandey for not putting heavy action sequences for Akshay Kumar. Manoj Bajpai and Anupam Kher fared well. Kajal Agarwal was not needed at all, and this could have been better if the romantic track and those songs were not there. Coming to Neeraj Pandey, the director I was very disappointed, coz post Wednesday, it gave some hope that this man may churn out some non commercial flicks and would raise the bar, but he disappointed me with the song dance number, and the love track that made me just wait to go to the real plot. It was written with a good intent but it just did not fit in as a whole. Technically, the best thing is the meticulous production design of the Mumbai and other places of the 1980's and for this itself I would give an award to Sunil Babu. The editing falls flat and please cut off 30-45 minutes and increment the pace by making the walking as they are and take off the slow motion and for 75 minutes, you will get a wonderful ride otherwise it made a just above average flick. The time of nearly 135 minutes was made for the sake of making and I did not see any real purpose behind that. A generous 2/5 for a well designed film more than anything else. Neeraj, you disappointed me big time, need to see what you got up your sleeve next.",
            "review_date": "2014-09-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best heist movie of Bollywood !",
            "content": "Hollywood has been famous for its incredible heist movies all the time. It is not often that Bollywood tries this type of concepts in its movies. Yet it took the risk, and this one was totally worth it. This movie is based on a true incident that happened in 1987 in present day Mumbai.A group of con men posing as CBI officers carries out a fake raid at a minister's house successfully, fooling two police officers in their way. They then get back to their way of continuing with their natural lives. They continue to do their operations. But the police whom they fooled first is determines enough to take the gang down, and thus contacts the real CBI, seeking their help. Thus begins the cat and mouse chase which forms a major part of the film.Ajay (Akshay Kumar) leads the gang of four, and is quite perfect in his role. He is accompanied by P.K. Sharma (Anupam Kher), Joginder (Rajesh Sharma) and Iqbal (Kishor Kadam). They all truly justify their roles in the movie. But the casting of original CBI officer Waseem Khan (Manoj Bajpayee) is the best decision that. His acting, expressions as the determined officer is phenomenal.The film has cool period flavour in everything from the costumes to the musical score. Even the chase scenes combining with the background score are quite interesting and succeeds in the creating the tension in the scenes. Unexpected twists also add to the movie's flavour. There are certain scenes which also minimize the tensions created with their comical mood. Although not intolerable, the dance scenes serve as an extra weight to the movie, which is typical of any Bollywood movie that you will ever find. But they don't reduce any of its good aspects.Overall, this movie truly justifies its genre and is one of Bollywood's finest movies. This movie is recommended to anyone who loves heists and crimes and also enjoys watching Bollywood movies.",
            "review_date": "2020-05-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "High potential but failed to deliver",
            "content": "This movie could have been a lot better. It supposedly based on a true story, and had potential to be a unique, gritty and thoroughly enjoyable thriller. However, the movie is bogged down in unnecessary romantic angle,silly cons and no character development. This con movie has songs, dances, silly jokes all it is missing is smart characters that are required to carry out such cons and their interesting lives. The movie spend very little time on 3 out of 4 con-men, so we have very little window in their lives or back story about their initiation into such high risk business. Most of the con seems too easy and exaggerated. It is sad commentary on Hindi cinema where such mediocre movie is considered - unique, epic, grand and exciting.",
            "review_date": "2014-04-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Heist movies have come of age in Bollywood!",
            "content": "In the recent past, Akshay Kumar has mostly been seen in comic flicks, barring the odd stunt-based brain-dead crass films like Rowdy Rathore. Amidst all this, 'Special Chabbis' comes as a welcome break with director Neeraj Pandey delivering yet another gem after his much acclaimed 'A Wednesday'. The film is inspired by the real life 1987 Tribuvandas Bhimji Zaveri Jewel heist where a middle-aged conman had posed as an Income Tax Officer staging a raid with 28 'newly recruited' officers who were told that they were doing a mock-raid as a part of their training. The thief, who called himself Monsingh disappeared with the Jewellery and was never caught. To date, this is said to be an 'unsolved mystery'. While portraying a single event would have looked like a documentary, the writers have added more meat to the film through events and developing each of the key characters, presenting most aspects of their lives, love interests, family, etc., Sure, the storytelling has repeated shots of people walking or driving for dramatic effect, which gets tiresome after a point. But then, the story doesn't lose pace. The first scene shows a walk-in interview to recruit CBI Officers. Cut to flashback, Ajay Singh (Akshay Kumar), PK Sharma (Anupam Kher) along with Joginer & Iqubal are seen raiding a Minister's house in Delhi assisted by a cop Ranvir Singh (Jimmy Shergill). After they have recovered lakhs, it is revealed that the four men posing as CBI officers are actually fakes. The four soon disappear into the crowd with the loot. Fearing loss of face, the minister refuses to lodge a complaint, much like most of their earlier victims. It is revealed that the conmen use the fear of law to loot black money whose owners would never want the public to know that they had it in the first place. Soon, the news of the loot reaches the real CBI where Wasim Khan (Manoj Bajpai) is tasked with finding them. He is helped by the now-suspended cop Ranbir Singh.What follows is a very interesting chase across cities, peppered with the right dose of comic lines delivered at the right time. In a way, the movie reminds you of Tom Hanks, Leonardo DiCaprio starrer 'Catch Me If You Can' and the famous 'Ocean' series and packs in adequate drama. Although many Bollywood filmmakers have heist flicks before, only a rare few could get the formula right and 'Special Chabbis' is a good one!Some may argue that the film surely has a moral dilemma angle to it. One, that it makes heroes out of conmen. But the other argument would be that the people they robbed were bad anyway. The weakest link is probably the love track which rather delays the film, and some repeated footage that could've been avoided. On acting, the best among them is Anupam Kher who plays the greedy old man, which is closely followed by a predictably good performer in Manoj Bajpai and Akshay Kumar demonstrating that he hasn't forgotten acting. Kajal Aggarwal, as Akshay Kumar's love interest, at best is a pretty distraction and hardly has much to do. Jimmy Shergill as the cop and Divya Dutta who plays his assistant perfectly fit their roles too. The single biggest achievement in the film, is its production design: portrayal of 1980's India with traffic free roads, no cell phones, no modern cars, etc. And this had to be repeated for all the cities that the story is depicted in. The best of such scenes is an overhead shot of Delhi's Connaught Place which zooms down to Manoj Bajpai riding a scooter. There are some other scenes that are tacky, but can be pardoned. Take my advice and don't wait for it to come on TV. With tons of advertisements to interrupt the show, the chase drama would lose its charm. For all the good screenplay, intelligent dialog, occasional humor and some twists, make sure that you don't miss 'Special Chabbis', what many believe is the Indian answer to Ocean's series!",
            "review_date": "2013-02-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Must Watch",
            "content": "Special 26 starring Akshay kumar, Manoj Vajapayee, Anupam Kher in lead roles, is a brilliantly scripted and beautifully directed movie. It shows a series of heist happened in 1980s by a group of skilled thieves posing as CBI, IT Officials. Its a wonderful amalgamation of some serious burglary and comedy sequences. Most of the time it is pacey but director could have given more favor to chop off few songs. From acting wise, Manoj vajapayee and anupam kher being seasoned actors have performed brilliantly. But akshay kumar stole the show with his believable facial expressions , authoritative outlook and superb dialogue delivery. At last he is doing some good sensible movies after a series of rubbish ones like rowdy rathore and tees maar khan. He should concentrate on great and original scripts like this one, only then he can show his true self. He is a brilliant actor only if his choices can match that brilliance. Rest of the actors, Jimmy Shergill, Divya dutta and Kajal aggarwal have done well in their short supporting roles. All in all first good movie of 2013, i hope it crosses 100 crore mark and should set an example, other vise senseless movies like Ek Tha Tiger are the ones breaking records. I will give 8/10 for this gem of a movie.",
            "review_date": "2013-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very very special entertainer",
            "content": "After a deluge of sloppy fare, Special Chabbis is like a breath of fresh air, the best movie till date in 2013, and quite simply, the best heist movie that Bollywood has ever churned out. With edge of the seat excitement all throughout, earnest performances and a super tight screenplay, this is one movie that has tons more entertainment than the usual Bollywood hit parade that overflows with formulaic bawdy comedy plus over the top stunts.Based on a true story where Tribhuvandas Zaveri Jewellers store was robbed in broad daylight by a gang posing as CBI agents, Special Chabbis hurtles through with a raid on a minister's premise led by Ajay Singh (Akshay Kumar), and P.K.Sharma (Anupam Kher), and unknowingly assisted by SI Ranveer Singh (Jimmy Shergill) and Shanti (Divya Dutt). Not exactly Robin Hood but CBI reject Akshay is the mastermind of a gang that poses as fake CBI officials and conducts raids on politicians, and businessmen relieving them of their wealth.This act, however catches the attention of ace cop Wasim Khan (Manoj Bajpai). Wasim wants to catch them in the act, and the remainder of the movie is one hell of a cop and robber drama, with the gang trying their final big bang heist and the police hot on their heels. Director Neeraj Pandey is Chulbul Pandey of the directorial universe- he gave us the excellent A Wednesday 4 years back, and follows it up with similar levels of intelligence, intrigue and emotion in Special Chabbis. For a Bollywood movie set in the 80s, the attention to detail is magnificent. While they did not have to change much for the Kolkata sequences, since the city still looks the same as it looked 25 years ago, the Delhi scenes really transport you to an era long gone. The cars, the props, the shops- how did he make Connaught Place look that way? The pacing is brilliant too- the movie has some songs, and there is the mandatory romantic angle thrown in (Kajal Aggarwal looking pretty in a thankless role) but even that adds to Ajay's purpose. The humor is mostly delivered with a straight face to sledgehammer effect by all the actors, and is infectious- the Special Chabbis selection scene is worth many viewings- in typical Pandey fashion we have a twist out of nowhere, and the background music is a zingy throwback to the masala flicks of the 70s. And what about the casting coup? Akshay Kumar reported cut his fee by half to shine in his most intelligent movie and is great as the leader of the pack, but it is Discover India with Anupam Kher (Official)nd Manoj Bajpai that take the acting honors. Kher is stupendous as the bumbling partner in crime, while Bajpai nails it by being more police than actual police. Not long back he was running around trees romancing half his age girls, thankfully he has turned a corner post Gangs of Wasseypur and now is focusing on good character roles.Pick any day- weekday, weekend, Valentine day. Pick anyone- wife, girlfriend, friends, mistress or yourself- please go and watch Special Chabbis if you have not already done, a cent percent recommendation. Beautifully scripted, excellently paced, clean family entertainer. Movies like this can only make us proud of our film industry- that there are some folks still there with their thinking caps on. 100 crores or not, this is one heck of a ride, a very very Special Chabbis!",
            "review_date": "2013-02-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worth watching",
            "content": "Movie was awesome. every thing was there which make you stick to seat. Good combination of drama, suspense & thrill. Movie is really based on true incidents. I would give 8 stars to this movie. Dialogue delivery was great. Actinng of actors is really good especially Anupam Kher and Jimmy Shergill. A bit of romance is added. Kajal's role is too less. Kajal is looking very beautiful but not as beautiful as in Singham. Mind of Akshay Kumar's role is really admirable. Akshay Kumar's quick reaction is good. This Movie lacks only one thing that is action. A very little action is added that too cant be called as action. A little action must be added to make it more interesting. Overall you can go to have a good weekend. I would prefer to say go and watch it.",
            "review_date": "2013-02-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Akshay Kumar should do more stuff like this!!",
            "content": "Well, tell you what, after seeing tens of dumb movies being done by Akshay Kumar I thought \"This man is gone, I won't ever watch his movies now\", but he proved me wrong in \"OMG! Oh My God\" last year & this year its Special 26.Story/Script - I'll give 10/10 to story since its the backbone of the film & really impressive & not so complicated.Direction - I'll give 9/10, because some things could have been done better or cut out but I think that's more of Editor's job. Overall it's excellent.Acting - Now this part takes you by surprise because all actors have done some fantabulous work including Akshay Kumar :) 10/10.Music - Ohh man, I hope Indian Directors learn something that for movies like this its not necessary to include songs.. Music is no doubt good but songs were not required at all, would have saved some 10-15 mins. I'll give it 7/10.Overall I think the I have just watched the second good movie from Hindi Film Industry this year (First being Matru K B K M). Akshay Kumar should do more movies like this one.",
            "review_date": "2013-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It is a dilemma between fiction and real",
            "content": "Score 3/10 It is hard to believe that it is from the same director Mr Neeraj Pandey, who had delivered a master piece, as movie \"A Wednesday\". Very often creative person just got stuck to a particular idea while knowing that it is not coming out as a good script. I think it is the same case. The subject was very clear by promo and trailer. You can say they revealed the suspense before releasing the movie. The fake CBI issue is the main subject. It is well known. I was expecting some unusual and interesting presentation of this interesting subject but got disappointed. They only shown the same old thing which had been exposed by media so many times. Director Mr. Neeraj Pathak just fails to impress this time. Screenplay does not provide any excitement. Dialogues are also not impressive. Performance wise Manoj Bajpai and Anupam Kher are superb. Akshay Kumar is OK. Nothing to say about main female lead. Music and lyrics are also not impressive. They served very ordinary stuff while the promise was for something special. It fails to carry director's masterstroke legacy.",
            "review_date": "2013-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Special26...very special movie..complete entertainer",
            "content": "Special 26 is a best heist movie of bollywood i have ever seen.It is based on real life incidents of 1987. I considered watching this movie because of Akshay Kumar and the director of 'A Wedesday' Neeraj Pandey. Strong script, great direction, brilliant acting and perfect screenplay made this into the very best of its kind that bollywood has never seen.The first half is good but second half of Special 26 will keep you at the edge of your seat and an incredible climax will make you appreciate the movie. Special26 is an excellent Heist film filled with wild humor, thrilling moments, and incredible acting from an all-star cast. Ajay Singh is played with excellent charm by Akshay Kumar. Manoj Vajpayee is great as CBI Officer(real) and Anupam Kher as Sharmaji is icing on the cake..Sharma ji as a IG Police, Sharma ji as a CBI and Sharma ji as a father of uncounted children..brilliant performance.. I am going to watch it again..\"Asli power script me hoti hai\"",
            "review_date": "2013-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Special Chabbis:Excellent movie!",
            "content": "Special Chabbis directed by Neeraj Pandey is an excellent movie!The movie is based on a real life incident which took place during the 80's.The movie has excellent performances,amazing dialogs and water-tight screenplay.In a nutshell,Special Chabbis is an excellent movie,which you ought not to miss!Story:The film is based on a real life group of con artists who pulled off many clever robberies during 1980's, they robbed famous businessmen & politicians by pretending to be the CBI or Income tax officers, on the pretext of conducting raids they would take away all the black money hoarded by them, the film also takes its concept from the real-life daring where the same group posing as CBI officers executed a daylight income tax raid on the Opera House branch of Tribhovandas Bhimji Zaveri in Mumbai, and disappeared with jewelery worth millions.The direction by Neeraj Pandey is marvelous.The screenplay is watertight.The dialogs are amazing.The cinematography by Late Bobby Singh is stupendous.The editing is fine.The music is good.Performances:Akshay Kumar is superb.After many years he is portraying a serious character and he portrays the character with panache!Manoj Bajpayee as Wsseem Khan is efficient.Anupam Kher as Sharmaji is excellent.Jimmy Shergill is very good.Kajal Aggarwal is wasted.Rajesh Sharma and Kishore Kadam are good in their respective roles.Vipin Sharma is apt.On the whole,Special Chabbis is a movie,which one should not miss at any costs!I am giving it a nine on ten.Strongly Recommended!",
            "review_date": "2013-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Asli power dil mein hoti hain! Aur asli movie yeh hoti hai.",
            "content": "Special 26 is a wittily written story. Akshay Kumar plays a rogue con who was not selected in CBI. To avenge this, Ajju and anupam kher and two other guys con wealthy but greedy businessman and sometimes a politician and take away their money and run away with it. They carry out this con by portraying as CBI officials and a fake one at that. What brilliant stuff! The last time i saw a movie like this was Oye Lucky! Lucky Oye! which was a pretty good one. Kajal is just there for singing songs and being an eye candy.Akshay and Manoj and Jimmy with Shantiji kept us on the edge of our seat, for most parts, tweaking the events to finally unveil a thrilling end. After a remarkable debut with the political thriller 'A Wednesday', Neeraj follows it up with a notable 'Special 26'.",
            "review_date": "2013-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Special 26",
            "content": "Neeraj Pandey, a 40 years old(young) man from a Bihari family background who shocked (pleasantly) many by his socio-dramatic thriller, the story of a common man, A Wednesday, is now narrating a story of 'con-men'\u0085'Special 26' based on the real incidents of 80s where a group of people posing to be CBI & IT official raided (robbed) many politicians, businessmen across the country without getting caught & also without any complain on the police records. The story is predictable, as it is based on real incidents, but the film being a Neeraj's baby was bound to surprise you in the climax, going by the standard he set through his previous film. (it may remind you of Ocean's series of George Clooney & Brad Pit). Never the less, the script, the art direction, pacey screenplay, wittiness of the characters & a BANG ON background score by Sanjoy Chowdhary are they key elements other than the performances which will keep you hooked. The vision of Neeraj about the look of the film is also stealer\u0085 I haven't seen Connaught Place of 1987, I haven't seen Delhi roads of 1987, and many have not seen the Zaveri Baazar of 1987 in Mumbai, Delhi airport, Howrah Junction, Chandigarh Airport\u0085.Neeraj showed us all\u0085Maruti 800, Maruti Van, Chetak Scootar, Matador, the telephone sets, & yes.. Ajay (the one who can never be defeated) played by Akshay Kumar carrying 'white pair of Shoes'.Since, the film is based on the real events and because of that the director had restrictions as far as the plot and its execution was concerned. He had to stick to the actual happenings leaving almost negligible scope for taking cinematic liberties. Still, he made facts look like fantasy.Performance wise, Akshay Kumar was well composed, did something refreshing, never went over the top (like he do most of time, and you blame only SRK)\u0085 he played a Khiladi, here as well. Anupam Kher is a master, was good as a 'fattu' conman. Jimi Shergil is good. Kajal Agrawaal, played the love interest of Akshay, has pretty face, but has not got substantial role in this thriller. I believed Manoj Bajpai when he said that we haven't seen even 20% of him as an actor. This movie, once again, proves that he is among the finest we have. The rest of the actors did well with whatever they were given.Music of MM Kareem is soothing. It's not a musical, 'Mujh me tu' stands out. The background music, as I already mentioned, is another leading character of the film.Overall, Special 26 is a well-made, entertaining thriller with a little hiccup here and there which you may ignore considering other things about it. ***1/2",
            "review_date": "2013-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Neeraj Pandey's Gripping Script and Direction has made SPECIAL 26 a very very SPECIAL movie!!!",
            "content": "Neeraj Pandey's Special 26 is an amazing drama thriller film which challenge the classic genre movies to be the part of it.The main key points to watch this movie are: 1. Script: Brilliant and Intelligent script by Neeraj Pandey after A Wednesday is the key point of the movie.2. Direction: Again, Excellent and Perfect direction by Neeraj Pandey has made it watchable again and again and again..............................3. Acting: Akshay Kumar, Manoj Bajpayee, jimmy sheirgill and Anupam Kher with a very large number of supporting casts has done it!!!!!! 4.Cinematography & Background score: Remember, It is a PERIOD film. so the role of Cinematographer is very important to feel the audience that it actually happens in 1987. And the Background score is another key point to the film which feels the thrill that what is going.I HIGHLY RECOMMEND THIS TO ANY HUMAN BEING AROUND THE WORLD",
            "review_date": "2017-11-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Must Watch",
            "content": "I generally do not write review after watching this much review but I was practically forced to do it. Forced by the film \"Special Chabbis.\" this movie stand handsomely above all kind of expectations. It has been a while that this type of perfect movie was made in Indian film industry. It was a treat for all my senses. Practically I do not remember when is the last time I watched this much flawless movie.First the script is well written and more awesomely executed. It was a full proof script what will take your breath way. Throughout the movie I knew there was a plan B, there must be a plan B. But till the final act i had no Idea that how will they show that. It was simply mind blowing. The script is almost without any loose end. It contains a bit of comedy also. Too much comedy would have been ruin the movie for many viewers. Secondly the cast selection was very decent, the actors knew what they were doing , how they are doing. Actresses has no particular act throughout the movie like most of the Indian movies.Finally ,one Sentence. \"Watch the movie again ;)\"",
            "review_date": "2013-02-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not the best,but good thriller with awesome climax",
            "content": "Trailer was quite intriguing,but movie did'nt go as per expectations.It takes a patriotic start with republic day celebration scene and displaying strength of our armed forces and army.The first raid scene mesmerizes the audience and increases the interest for more to come.Here it fails badly.After the fake CBI team get off-work next 30 minutes have nothing to do with it.Thanks to Manoj Bajpai and 2nd half which reignites the interest.The climax is awesome making it a paisa vasool movie.Screenplay and direction are great.Neeraj pandey proves himself again. Performances are good too with Manoj bajpai at his very best.Anupam Kher reminded me of his roles in Wednesday and C kkompany and does his job well.Akshay acts as a soft spoken serious character and is good.Jimmy shergill was offered less than what he deserves.Divya Dutta impresses with her desi style.What left me pondering was that why it was titled special 26.?There was nothing special about those 26 as they were easily be fooled by the fake CBI team.It would have been better if film was titled special CBI as it had done justice on part of both CBI teams,real and the fake.Never the less it is a good one time watch flick..I will rate it 6/10",
            "review_date": "2013-02-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Special 6",
            "content": "The only other Neeraj Pandey film that I'd seen was 'A Wednesday' which I thought to be seriously overrated as I found it preachy and pretentious. Moreover, I had given up on Akshay Kumar thinking that he wasn't capable of doing good films anymore. But then again, it's got actors like Manoj Bajpai, Jimmy Shergill and Divya Dutta so perhaps it's worth a shot. 'Special Chabbis' came as quite a pleasant surprise. It's well written, edited, directed and acted in by the principle cast. With this film, Pandey shows tremendous improvement. He sticks to the main theme and has written a tighter script.The main flaw is the Kajal Agarwal track and the songs (especially that first wedding song). In my opinion, 'Special 26' should have been a songless film and either the romance angle should have been better developed and linked to the main story or removed completely. But there's much more good in the overall film that compensates for the flaws.Performances by the main cast are brilliant. Akshay Kumar and Manoj Bajpai do a superb job in leading 'Special 26'. I hope Kumar doesn't fall back into the rubbish he's been doing all these years as he's taken a leap towards the positive here. Anupam Kher, Jimmy Shergill and Divya Dutta (offers good comic relief in a brief role) provide fine support.The art direction, costume, hair and makeup department deserve mention for creating the 80s look (the film takes place in the mid-late 80s) and giving it an earthy look.Whether one likes 'A Wednesday' or Akshay Kumar or not, shouldn't be the basis of the decision to watch 'Special Chabbis'. It's an overall solid film with a few flaws.",
            "review_date": "2013-09-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Special Indeed!!!",
            "content": "‎'Special Chabbis' is one of the finest heist films in recent time and is good in almost every department. The film is intelligently scripted with superb acting by its principal casts. The story is fast-paced and thoroughly gripping and enthralling. The weakest part of the story is the romantic angle which looks like a forced inclusion. Special mention of Anupam Kher and Manoj Bajpaye for there fabulous job. Neeraj Pandey is a director with substance, remember \"A Wednesday\" and now \"Special Chabbis\". Its like a rare combination of real-life credibility and cinematic flamboyance. This is the film that lives up to its name \"SPECIAL\"!!!",
            "review_date": "2013-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Well written and executed movie",
            "content": "What a film... not a minute i got distracted from the story. I feel sorry for the Real CBI and Real Police, but, the climax was mind blowing. If the real police or CBI holds the criminals, then there is no kick in the story. I got the real kick at climax. Kudos to the director. The art work is exemplary. It gave the feeling as if we are really in 80s streets. Heroine was not necessary in this film, but its okay. I never got a iota of doubt about Jimmy Shergill's role. It was a shocker. Nice and mature work by director considering that it is just his second film. Special mention to Manoj. he set the stage live with his powerful acting. Overall great movie.",
            "review_date": "2014-04-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great comeback",
            "content": "Neeraj Pandey who gave us a terrific film A WEDNESDAY(2008) makes a terrific comeback with Special 26. First and foremost, the film also is a comeback of Akshay to good cinema after doing rubbish like Khiladi 786, The film has a good ensemble cast from Jimmy Shergill, Manoj Bajpai, Anupam Kher to Divya Dutta The film is based on a hiest that happened in 1987 surprising it was also shown in Khel(1992) before which also had Anupam Kher Finally we have a thriller that doesn't follow trademark of bollywood, except one lengthy chase scene The film keeps you hooked throughout except a few shortcomings The love angle which is ridiculed by all critics the twist in the end does leave several loopholes but yet the film manages to thrill you and doesn't end up being a messDirection is superb Music is okay, Mujhme Tu is superbly rendered by Akshay rest all songs are forcedThe art direction, camera-work depicting 1980s is superb Anupam Kher shows his versatility yet again, handling the character and changing expressions and body double like a pro Akshay Kumar is superbly understated, a true relief from his loud acting in the recent times Manoj Bajpai is terrific in his role tailormade for him, it's nice to see his popularity too increasing Jimmy Shergill is terrific in his role which sadly isn't given much prominence, Divya Dutta too is superb Rajesh Sharma is superb, Kishore Kadam is good too Kaajal Agarwal after Singham does an okay job not having much to do",
            "review_date": "2013-04-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A very \"Special\" movie",
            "content": "This movie is truly one of the modern day classics. The quick wit, the tension and the most important part of any movie, the scripting of the movie are really good.Based on the Opera House heist in 1987, the movie starts off with a CBI team raiding a minister's house with the help of two police officers, and when the cops realize that the minister has been conned and his black money hoarded away, the hunt to trace the fake team begins. This movie has many good things going for it. Firstly, the script. There is never a dull moment in the movie. Secondly, the dialogues. A Neeraj Pandey hallmark. It is quick witted and it is great. Thirdly, the performances. Akshay Kumar gives a brilliant performance as the leader of the pack, Anupam Kher is sublime as the nervous wreck, Manoj Bajpayee uses the deadpan to great effect, Jimmy Shergill is amazing as the cop trying to correct the wrongs. Kajal Agarwal gives a sweet performance and so does Divya Dutta. If I were to nitpick, the love track between Akshay Kumar and Kajal Agarwal, albeit nice and sweet, felt slightly unnecessary. And the songs too felt out of place. The editing is slick, and the setting is brilliant, giving you the feel of the 80's. The cinematography is great as well. And the background score is very good too. This shows that adaptations of real life incidents, in the right hands, can make for an intelligent and thrilling movie watching experience. You would not want to miss this movie.",
            "review_date": "2017-03-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Recommended 👍",
            "content": "Awesomely made movie, good quality production a must watch from me 👍👍",
            "review_date": "2020-06-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ok",
            "content": "This movie is ok only one time watch but thief is thief sins",
            "review_date": "2020-08-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sharp, intelligent and thoroughly enjoyable thriller",
            "content": "Watched this movie on Friday - Absolutely Loved it!! And loved that there was NO nudity or raunchy women or item﻿ songs! Rarely you will find such a great film which is entertaining as well as intelligent.The performances of its caste are of first rate. Akshay surprised with his﻿ acting and does a commendable job after so many years. This type of cinema goes with his personality. Anupam Kher is excellent. Manoj Vajpai is meritorious; we all know what he is capable of. It's sure to get listed as one of the most gripping heist dramas based on real life occurrences. A film that's sure to win accolades, acclaim and awards...Hats off to Neeraj Pandey who delivered again after Wednesday..and yeah \"Asli Power Dil Me Hoti Hai\" :)",
            "review_date": "2013-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Superb movie",
            "content": "The concept of this movie is just amazing, acting is also superb. Very good story line.",
            "review_date": "2020-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good thriller",
            "content": "Good bollywood thriller. Unique story and its interesting how it unfolds.",
            "review_date": "2021-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Must watch",
            "content": "Special 26, also known as Special Chabbis, is a 2013 Indian heist crime thriller film directed by Neeraj Pandey. It stars Akshay Kumar in the lead protagonist role with Manoj Bajpayee, Anupam Kher, Kajal Aggarwal, Jimmy Shergill and Divya Dutta in supporting roles. The film is inspired by the 1987 Opera House heist where a group posing as Central Bureau of Investigation (CBI) officers executed an income tax raid on the jeweler in Mumbai. Special 26 released on February 5, 2013 to widespread critical acclaim and was regarded as one of the best films of 2013. Now we move to social engagement. All campaigns are always around business objectives. We need to visit the popular website – www.IMDb.com and create an account. Choose any 5 popular movies. Write movie review of 3-4 lines for each movie. I have now started finding better movies through www.flickstree.com. It not only suggests great movies to watch, it also tells where you can watch the movie online.. Highly recommended.",
            "review_date": "2016-10-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "MY REVIEW: Special in every sense!!",
            "content": "Hollywood specializes in heist drama. Now bollywood explores this genre and does very well. Convincing screen-play, top notch performances, detailed production design, delicious dialogs and most importantly not overdoing anything. Anupam Kher plays a middle class man making money as fake CBI officer and does not stop surprising you with his versatility as an actor. Manoj Bajpayee gets another memorable role. Akshay Kumar restrains himself to the core. Kajal Aggarwal as his love interest is a not required addition to the movie. Divya Dutta gets few lines but all worth clapping. Movie did not require those songs either. But nevertheless A Wednesday fame director Neeraj Pandey entertains you in full in his second outing. He is one of the director to watch-out for in future. Special 26 is special in every positive sense.",
            "review_date": "2013-05-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The another heist one.",
            "content": "In this time, the heist'ing' time, we are all connected with the web series the Spanish one Money Heist which is gone for number 4th season I must urge all of you to another heist movie. Special 26 is something like that. It's about a brilliant game playing by four commoners to the biggest notions of our society. A thrilling one that keeps up awake all the time and alerts us to know about how their game plan is going to happen. It's bit alike Neeraj Pandey debut work, A Wednesday that also a good movie and I can also shelve this one to it. A nice thriller to watch.",
            "review_date": "2020-06-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Neeraj Pandey's second great achievement!",
            "content": "During the 1980s, the advent of wealth indicators such as televisions, Marutis, Fiats, Bajaj scooters and gold was partly attributed to the growth of substantial black money among politicians, businessmen and celebrities. Such wealth always brought with it the risk of exposure leading to the CBI and IT officials being viewed with trepidation. One con man, along with his partners, took advantage of this fear and conducted a series of intricately planned raids in the name of those agencies. Director Neeraj Pandey ('A Wednesday') tackles an intelligent subject after his acclaimed debut thriller and lives up to the promise of his distinct talent. Special 26 is a witty entertainer, based on true events in the same period and has its bases well covered with superlative performances by its actors, a credible, chronological script and screenplay with adroit direction that keeps the momentum under control between the seriousness, suspense and fun. Ajay (Akshay Kumar) intricately plans the raids and executes them rapidly, covering every detail and improvising spontaneously with his accomplices that include Iqbal (Kishore Kadam), Joginder (Rajesh Sharma) and of course, the brilliant Anupam Kher. Their first raid humiliates Inspector Ranvir Singh (Jimmy Shergil) who supported it unknowingly, thus leaving him distraught and determined to apprehend them. He passes on leads and information to a real CBI official who approaches the case in a diligent, critical manner with focused tenacity. Manoj Bajpai as Wasim Khan is the formidable force that can disrupt all those intricately planned heists and while they're made aware of their fake raid making it to the news, Ajay plans one big raid at a jeweler in Bombay by recruiting 26 more 'CBI interns'. Little does he know that Wasim Khan is a step ahead of his plan..... or is he really?Neeraj Pandey depicts the screenplay at a racy pace except for the occasional romantic escapade involving Ajay and Priya (Kajal Agarwal). Pandey's attention to detail is conspicuous in almost every scene with regards to the vehicles, structures, fashion and background score. But the film's strengths are its well directed storyline and the performances by its A-list of actors. While the director manages the balance between the seriousness of a raid and its fun result, the actors have their own fun portraying varying shades of themselves within moments in the screenplay. Special 26 could not have come at a better time for Akshay Kumar. Just when all his films started looking the same and his role in them hackneyed, along comes a genre in which he excelled ('Hera Pheri', 'Aankhein'). As a lead con man, his dedication and sincerity result in a convincing portrayal of the character while there is a complete lack of other nonsense that he has subjected his fans to recently, including item songs, jarring dialogues and ridiculous action. Manoj Bajpai plays a character that is yet distinct for an actor of his caliber, which in itself is remarkable. His ferocity in a chase sequence, composure while being in a commanding situation and natural reaction to adversity are notable traits in his laudable performance. Pandey maintains his conviction in one of India's finest actors, Anupam Kher, by casting him alongside Akshay Kumar and what a masterful delivery of versatility it was! His dialogue delivery varies in tone and confidence as he appears as the CBI Officer P.K. Sharma and as the tense con man who fakes it all. He thus provides most of the humorous moments without having to jump around or being obtuse. Among the supporting cast, Jimmy Shergill delivers an act so convincing that we all buy into his Inspector Ranvir Singh. Kadam and Sharma, as the other two accomplices are realistic actors for their roles whereas Tiku Talsania was at his comical, cheery best in a cameo.In terms of MM Kreem's score, the Akshay Kumar sung Mujhme tu is soothing but breaks the fast paced screenplay. Gore Mukhde is a fine bhangra number, to be listened to on an evening drive along Carter Road. With two critically and unanimously acclaimed films in his hat, Neeraj Pandey will have added pressure to deliver even better. Meanwhile, his team of Special 26 has achieved something that most films and film makers struggle with..... - Pure entertainment. This one should not be missed.8.812 on a scale of 1-10.",
            "review_date": "2013-03-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not As Good As Expected",
            "content": "Because of the reputation of the director from his previous movie, I was hoping for something better than what I watched. However, the movie is not all bad. It is fast paced, enjoyable and funny at times. Only major problem with the movie is the story. You need to ignore several unbelievable incidents in the movie to enjoy it properly.Acting by lead actors is good. In particular Anupam Kher and Manoj Bajpayee were very good. Akshay and supporting cast were OK. Music was not impressive. First Half of movie is good but it is the second half, specially the end when you feel that something is not right.This movie could have been better if the story was a little better and believable. Needless twists and trickery shown in the movie really let it down.",
            "review_date": "2013-03-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An out of the world ending!",
            "content": "One of the most entertaining films ever and amongst those that I have recommended to every person who watches Bollywood films. It has got tremendous pace and there is never a dull moment throughout it. The most praise though should be reserved for its out of the world, mind-blowing, amazingly brilliant ending. It is amongst my all-time favourite films.A special mention has to be reserved for Manoj Bajpai. That guy is beyond words and has that amazing ability to make a film look like absolute reality just with his facial expression alone. Very under- rated sadly, but I can't think of a film in which his performance hasn't added to it. The way he stands there at the end and laughs and claps, I can't imagine anyone else being able to pull it off better than him. The reason behind myself typing out this review is different though. It is to explain the reason behind my rating of the film missing out on one whole star. It might not be big deal but it is for me given my history of being too generous and giving 10 out of 10 to many films. The reason here is the guy shown in it who stuttered throughout in his scenes. No, I am not against the role per se, what annoyed me instead was that it was approached in a way of fun. It gave the impression of his disability being mocked in the film. Maybe it's just me and that the film-maker might not have intended to show it that way, but I didn't like it to be honest.",
            "review_date": "2015-08-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Intelligent Plotline, Good Performances",
            "content": "I have been recommended this movie quite a few times. The basic premise is very interesting. Con men posing as CBI officers and conducting raids on hoarders of black money. The story is written in such a way that you immediately start rooting for the \"bad guys\". The characters are well sketched-out and likable. The performances were very good, especially Akshay Kumar and Anupam Kher. Jimmy Sheirgill and Manoj Bajpayee enrich the cast further.This movie is written very well and not much felt out of place. The build-up was good and the pace was commendable. The songs seemed really unnecessary though. I did not like the female lead as much. The interactions between Kumar and Kher were funny. Overall, a good movie. Very smart script and great performances. Will keep you at the edge of your seat.",
            "review_date": "2018-08-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An underrated Gem !!",
            "content": "Special 26 is a rare film in Bollywood. It boast of a superstar Akshay Kumar but in the movie, the script is the king and the director tells a fabulous tale.Based on some events of high profiles raids by some fake Govt officials in the 1980s, the movie starts off beautifully. And its a joy ride to be precise with a deadly cat and mouse game as the climax. Its less about guns and violence and more about two brilliant men trying to outwit each other without a bit of violence. The men in question are Akshay Kumar and Manoj Bajpai. Kumar who most people doubt about his acting skills is brilliant. He finally gets an author backed role and he shines. Bajpai, one of India's most under rated actors is fabulous as the honest CBI official. The men have just one scene in the film together and its a class.The rest of the cast including Kher and Shergill are good in their roles. The director beautifully constructs the 80s India and I loved the old world charm in the movie. Pandey, easily one of India's under rated director makes a fine film different from his serious and thought provoking debut classic A Wednesday.The only flaw in the film is Akshay's love story which slows the pace a few places. But ignore the love story and its an Entertaining Intelligent Film.",
            "review_date": "2014-08-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Special 26",
            "content": "With Special 26, the much acclaimed director of 'A Wednesday',Neeraj Pandey fame makes a comeback to celluloid after a hiatus of 5 years. His heist drama, which is based on the real life incident of 1987 where a squad of con-men cleverly robbed the businessman and politicians by pretending as CBI or IT Officers across the Indian geography, evokes the same kind of urgency and thrill that was prominent in his first venture.Pandey builds the tempo right from the inception where the con-team carries out its first raid at a politician's haveli , also keeping the humor quotient intact.The mastermind, Ajay Singh(played by Akshay kumar) along with Sharmaji(Anupam Kher), Rajesh Sharma and Kishore Kadam loot the victims off all their black money with so much of perfection and confidence and then decamp with the booty. However, things take a dramatic turn when the real CBI led by the upright and no-nonsense officer ,Wasim Khan (played by Manoj Bajpayee) with the aid of the suspended cop, Jimmy Shergill decide to nab the scamsters during their last heist. A cat and mouse game ensues which keeps the viewer constantly hooked till the twisty climax!Special 26 works primarily because of the tight roped plot , terrific chase sequences and brilliantly chiseled-out characters.The USP of the film is its ensemble star-cast which pits Akshay Kumar , the epitome of what we call as Blockbuster Bollywood against actors of substance like Bajpayee and Anupam Kher. Pandey also helms the arduous task of recreating the 80's – a testimony to his eye for details while keeping his obsession for rooftops and aerial-shots alive, and thanks to late Bobby Singh's immaculate cinematography for resurrecting and giving a 80s feel to the metro cities. The background score is much reminiscent of the bygone era and is top-notch.While I would say that few of the sequences practically stand out – like the job interviews for the 'fake' CBI team or Bajpayee's encounter with Anupam Kher, the romantic track between Akshay and Kajal lacks depth and seems off-narrative.Akshay Kumar is restrained and controlled this time and he is superb as the leader of the gang.Its immense fun to watch the man brazenly carrying out the raids in the broad daylight.Anupam Kher is terrific and he fascinates you with his transition from a weak soul to a tough cookie.Manoj Bajpayee shines here and gives his character the much need gravitas.Jimmy shergill and Divya Dutta are natural.Rajesh Sharma doesn't get any lines to rattle.Kajal Agarwal is kind of redundant in this enterprise.I go with 4/5 for this unapologetic crime caper – it provides you hearty entertainment and the same does not endorse to crime!Regards, Ahwaan",
            "review_date": "2013-03-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "very entertaining-catch me if u can...!!",
            "content": "akshay kumar is the one actor who's capable of doing action adventure- drama-comedy too...and he's very adoptable to his roles. he's best n right choice for this movie....anupam kher deserves accolades for his balanced acting-mainly in a scene where manoj bajpayee interrogates him-and anupam trying to b calm although he's subjected to police interrogation./kajal agarwal fully wasted and i wonder what made her to accept such an role-may b because it has akshay n acclaimed director??film is very entertaining from start to finish...climax is almost very guessable still film holds us....perfect movie to watch n laugh loud this weekend...go n watch it..rest assured.....!i give 10/10it deserves it... even more....",
            "review_date": "2013-02-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "nice performances and good script sums up special 26",
            "content": "The film is different from other bollywood movies because it don't have any trash. Anupam kher and Manoj as usual are a treat to watch. Especially the climax scene where Manoj laughs just explains why he is the best choice for the role. It is a clean and neat film which doesn't need hot songs, action sequences to impress the audiences. As one of the online review said, \"watch it for pure cinematic orgasm\". The 1980's setup is well shown on screen. Female lead's role is okay and Kajal done it well. I found the interview episodes of the special 26 very hilarious. Music by M. M. Kreem is good. The Punjabi song in the first half came out very well.",
            "review_date": "2013-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mind blowing",
            "content": "SPECIAL 26 is not one of those mindless masala entertainers with leave- your-brains-at-home attitude. SPECIAL 26 encompasses three startling cases that sent a shiver down the spine of many a businessman in the 1980s. What makes the film tick is the manner in which Neeraj Pandey integrates these episodes in a sequence and develops a clever cat and mouse saga between law breakers and law enforcers. Like A Wednesday, SPECIAL 26 also sets you thinking.Yet, it's sharp, intelligent and thoroughly enjoyable. On the whole, SPECIAL 26 is an intelligently woven, slick and smart period thriller with its subject matter as its USP. It's sure to get listed as one of the most gripping heist dramas based on real life occurrences. A film that's sure to win accolades, acclaim and awards. Also, box-office rewards!",
            "review_date": "2013-08-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Kind of movies we need from Bollywood",
            "content": "I can't call it a legendary film. It was good but maybe a bit too slow which causes a little lack in continues suspense. But other than that it was pretty nice. We need more films like this from Bollywood which is commonly known for ridiculous plots.",
            "review_date": "2021-05-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Truly special",
            "content": "A visual treat and what a change in Akshay Kumar's choice . I knew from the trailer itself that the movie has something to offer and indeed it did . Superb direction by Neeraj Pandey and not to forget Anupam Kher and Manoj Bajpai.",
            "review_date": "2021-05-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "--Spoilers----Analysis of whole Plot----",
            "content": "As I read somewhere in threads some users have point out that ---\"After Waseem found out what the plan was, they changed their Plan A\" !!!!It was not the pure Luck of real CBI that Waseem found out their Plan. It was deliberately done. As you can understand from the things that Jimmy was accompanying them and he find out the Anupam kher records. Also when Manoj Bajpayee got to know from the Jewelers' owner that Fake CBI have raided their workshop -- Bajapayee understood all their plan in flashback scenes. So they had deliberately involved CBI in this raid\u0085.Thus it was indeed the plan to involve CBI, now there are lots of plot holes here like ---1) What was the need of involving Real CBI? I could understand that Akshay Kumar wanted to show them that he is smarter than real CBI guys , but still it involved lots of risk.2) How could you be sure that the real CBI will definitely not arrest you before your final attempt to rob the jewelers shop? It could have been a good logic in US/UK where you have to caught the thief red handed to prove their crimes but here in India the Real CBI could have under- arrested the whole gang and then with normal torture/practice would have made them accept their robberies. Even few Businessman/Netas could have made to identify them. \"So it was a stupid idea to involve real CBI that too by sending your own goon\". Otherwise you could easily have gone at the jewelers shop and have looted that. There is no point of taking this much of risk to show that you are smarter than the real one!!!!! (I would have liked the movie if the Jimmy character would have been genuine as then it shows that the Real CBI worked hard to get behind those cons and finally in the end these cons were too smart and fooled them. But it this case it' bulls**t !!!!! 3) OK. I accepted.....you want to fool real CBI that' why you involved them. But then again --(god knows from where they got this intuition/ surety that)the real jewellery would be deposited in workshop.... This is not understandable. As lots of ppl have made this point that the better option was to keep the jewellery at some place in showroom like any vault. So again you have jeopardized your last raid by involving the Real CBI that too by yourself.......4) It was never shown how they were able to siphon-off the money they looted to other country. As after these fake raids they would have amassed lots of Money/jewellery which was not that easy to siphon-off. I know in terms of Movies or even real world it' small thing but they should have shown that where and how they were dumping the money esp. the raids outside of Delhi/Mumbai where one of the four con was located.5) Again the real CBI case - by involving them they have risked their family. At-least as shown in the movie (don't know the background of real con from where this movie is inspired) but here they have shown the big family for Anupam Kher & Joginder (Rajesh Sharma) and even for Iqbal (Kishor Kadam). Only Akki was the man with only a dumb sweetheart. So their family could have been an easy target of CBI esp. since you fooled their best officer.6) Last the Jimmy Shergil plot --- To make it feel genuine what director has shown (i) The Politician would definitely have called the SP after the fake raid even as shown in the Movie. So now either I should assume that SP was also fake or they all were so dumb to know that Jimmy was a fake Inspector. Even that fake Inspector can be suspended!!!!! And then this fake Inspector can go to CBI and told their top boss that he himself is investigating the case with 19 such sort of cases. So in all this process the whole REAL CBI/ REAL police was so dumb to find out that he was a Con \u0085\u0085\u0085 Overall the first half was very beautiful and engaging but the 2nd half/End and suspense was very stupid....For me --expectations were very high - As I watched movies mostly on the base of directors and not on the base of Star Power so had high expectations from Neeraj Pandey after \"Wednesday\". But was disappointed.Let'see with the next director Abhishek Kapoor -whose 2nd Movie is also releasing next week -Kai po che! after the marvellous début with \"Rock On\"",
            "review_date": "2013-02-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Special Chabbis is a must watch!",
            "content": "The film A Wednesday certainly put Neeraj Pandey on the Bollywood road map, and Special Chabbis does nothing less than make him out of the finest new directors in the industry. What is so special about Neeraj's work, and especially Special Chabbis? Perhaps that it does not rely on star power! Neeraj does not require a SRK, Salman, Aamir or Hrithik to lead the main male roles, but simply someone who can portray the role. He has done that twice now with Anupam Kher and Jimmy Shergill. Special Chabbis starts off slowly, but after the intermission you are glued to the screen to see what happens next. Akshay Kumar plays his role with simple ease. For such a seasoned actor, such a role was never going to be a problem but he has done it fantastically. Anupam Kher will always be one of my favorite actors and this performances reminds me why. Manoj Bajpayee is out of this world! Why does he not do more films?! He is a powerful actor with his screen presence and dialogue delivery. Another notable performance is that of Jimmy Shergill, who is one of the most underrated yet talented of Bollywood. Divya Dutta and Kajal Agarwal don't get much scope in their roles, but do a reasonably good job. The music of the film is pleasant, and very much MM Kreem's work, but far from his best work. Kaun Mera by Papon is by far the best song in the album. Don't underestimate this film like I did before watching it. IMDM viewers have rated it an average of 7.7 out of 10 while I write this, which is no mean feat as I can see it has an higher average than the 3 biggest films of the year 2013 - Krrish 3, Dhoom 3 and Chennai Express.",
            "review_date": "2013-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Special 26 is a special one!",
            "content": "This is second film by director Neeraj Pandey who first directed A Wednesday!!. Special 26 is based on true incidents which happened in India in 1980's, a group of people used to raid(rob) politicians, businessmen posing themselves as CBI , Income Tax Officers. In simple words it is a chor-police drama. Special 26 lacks pace, content and dialogues (now-a-days dialogues can survive a film even if there is no content), but don't be mislead that this film is not a good one. Actually all this lacking is fulfilled by superb performances and some good background score. If you look at movie's promotional poster you will get a feel that Akshay Kumar is the lead here and he will carry this film on his shoulders but Akshay is just big on the poster. This movie has 3 heroes. 1. Ajju (Akshay Kumar) is the lead of fake CBI who plans their targets. This is one of the best performances of Akshay Kumar. 2. Sharmaji (Anupam Kher) is Ajju's deputy. I was amazed by how quickly he changes his roles. In one moment he is hesitant con-man and next moment he is fearless CBI officer who has the guts to slap a minister. Anupam Kher is the real star of this movie. 3. Waseem Khan (Manoj Bajpai): The real CBI officer. Mr. Bajpai never fails to impress and in this movie also he has done a fabulous job as CBI officer. Jimmy Shergill has played his part but there is nothing much to mention about it. Songs act as hindrance but apart from that director has done a brilliant job . Best part of the movie is there is no masala action , not a single gunshot is fired still the plot grips you and makes you clap for the heist. Special 26 is really a special one!Ratings - 7.5/10",
            "review_date": "2013-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A good suspense thriller film set against the backdrop of the 1987 period.",
            "content": "A good suspense thriller film set against the backdrop of the 1987 period, telling the story with suspense from beginning to end. The film manages to capture the essence of old-fashioned Delhi, Mumbai and other cities.When telling a story on a suspense thriller label, the director does not forget to include all the restraints and other ingredients in the film.Many people had given their heads to fake raids without even knowing who came and what they are raiding.Neeraj Pandey has written the story and screenplay of the film based on the real life experiences of some prominent personalities who faced such a fake CBI ride.Some moments, we assumed that everything that is shown in the movie may actually have happened in the past. Because every scene is so authentic.The director very clearly portrays the plight of the people who fall victim to the ride. Undoubtedly, the director was an important factor in the success of the film.Akshay Kumar, Anupam Kher and Manoj Bajpayee have done well as.",
            "review_date": "2021-10-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Asli power dil me hoti he...",
            "content": "A movie, in my opinion, in a given running time should be able to involve us in its world and should do justice to what it's trying to be. That's all I ever want from a movie, whether it is commercial, non-commercial or any weird stuff.\"Special 26\" directed by Neeraj Pandey (A Wednesday fame) is a cleverly written commercial drama/thriller/heist film that managed to suck me into its world and kept me hooked till the end.Inspired by a real-life heist that took place on March 19, 1987 where a group posing as CBI officers executed an income tax raid on the Opera House branch of Tribhovandas Bhimji Zaveri in Mumbai, this commercial flick kicks into action from the word GO but unapologetic-ally takes pit stops for some appalling & unconvincing love angle.Peppered with witty one-liners and some good 'chor-police' drama, the film with its running time of two and a half hours feels aptly paced and only bogs down in parts.If a film says its set in 1980's India, it has to be shot well enough to make you believe. Late cinematographer Bobby Singh succeeds in creating an authentic world that looks real and convincing.The booming background score by M. M. Keeravani and Himesh Reshammiya though mediocre makes sure that you don't look away from the screen but the lousy songs add nothing to this film.But what keeps this film alive is the charming performances.Akshay Kumar , Jimmy Shergill, Manoj Bajpai and Anupam Kher and even actors playing little characters play their parts well with an exception of Kajal Aggarwal who sticks out like a sore thumb.\"Special 26\" wouldn't be half as good as it is if not for the director who succeeds to keep you on the edge of the seat with some good direction.Though not as effective as the director's previous venture \"A Wednesday\", this film has more than enough wit for a commercial cinema.Final Verdict: Entertainment guaranteed. :)",
            "review_date": "2013-02-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fun of Bollywood heist thriller",
            "content": "The CBI officers raid a politician's house. They break a cupboard lock, and find corrupt money inside. They go on to an altar, bookshelves, a ceiling, backseats of a car, finding money everywhere. Being upset, the politician offers a bribe and asks them to let him off. The chief Sharma slap him twice, and tell a colleague policeman with dignity, \"True power comes from the heart\".Back in their car Sharma tell his partner Ajay how he was scared. The car arrives at a hideout and each man leave with his share of money. They are fake CBI!Maybe it's the first time I watch a Hindu movie, and it is to me a series of amazement. Having never been to India, just watching characters walking through the alleys, or camera looking around the city's landscape from a rooftop, is fun.After the heist, Ajay, the handsome, manly, and shrewd protagonist, dabbles in a romance with a neighbour girl, with a sentimental love song suddenly starting to play. Then he goes to Sharma's daughter's wedding. Among the joyous crowd, he dances with girls in saree of pink, green, and yellow swirling. It's certainly pleasing to the eye.Ajay plans the last and the biggest heist targeting a jewelry shop. He holds a fake CBI recruitment to team up decoy officers, called Special 26. The job interview scene is the most hilarious.The true CBI officer Khan detects the plan, and devises a trap. Which is to outsmart?Heist scenes are always with Mission Impossible-like suspenseful music. But I'm not sure how much I should take it seriously. Everything is funny and exciting simultaneously. I love Sharma played by Anupam Kher, whose fake determined expression soon breaks into upsetting. Heading to the showdown, it becomes a real gripping thriller, where every twist makes you gasp.",
            "review_date": "2020-04-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A breath of fresh air from bollywood!",
            "content": "India should be bursting with original stories.But Bollywood remains wedded to the big fat wedding formula and its hackneyed variations.Of late, there is a tendency to present the same stories in new settings, using one of the many accents of Hindi, to add color to the dialogues.Such films tap into the need to hear and see \"authentic\" local characters going about the same business of giving us a typical Bollywood musical or gangster saga.That mob flicks are also musicals is a giant folly, a case in point the highly stylized Gangs of Wasseypore, which had excellent songs but they ideally belong outside the film,as a part of its marketing ecosystem.Special 26 is directed by Neeraj Pandey who made the audience favorite A Wednesday. This time he makes a heist film based on the urban legend of fake CBI men raiding and walking away with black money in the mid 80's.Its a great idea, we need our own Oceans 11 and since India has a jumbo population he gives us Special 26, the more the merrier! In fact one of the characters PK Sharma (Anupam Kher) has a huge battalion of children, he tells the mastermind Ajay Singh(Akshay Kumar), that there was no TV in his time, a lame excuse to make babies for fun.And the condoms called Nirodh distributed by the government were melted down to make flip-flop's in a scam!Pandey gets the India of the 80's right, down to the street scenes strewn with Maruti 800s and Premier Padmini's. When he briefly shifts the action to Kolkata he must have sighed with relief, not much has changed there.The movie begins with stock footage of a Republic Day parade, Rajiv Gandhi accompanied by a portly Giani Jail Singh and Narasimha Rao in white shoes. How I enjoyed those white shoes.In this wimpy political climate we see PK Sharma and Ajay Singh raid the bungalow of a minister, posing as CBI officers.They have two other accomplices and a few real police officers to lend credibility. The raid looks authentic, this was a good way for CBI and Income Tax officials to make money back then.My memory of a raid on my family came alive, but between us dear reader, we proved to be a waste of time for the IT guys.(Back then IT meant income tax)PK Gupta is getting old and wants to retire.Like all good scamster's they want to melt away into the Dubai sunset with one final big job.Ajay too is tempted, lady love is teasing him in the form of Kajal Aggarwal.He is getting old too and wants some action, PK Guptaji has already produced a cricket team, and his bio clock is ticking.Meanwhile the cops who inadvertently assisted them in their raid on the minister are in trouble and Jimmy Sheirgil ,the inspector, wants to clear his name.He joins forces with CBI hotshot Waseem Khan played by Manoj Bajpai to track the gang down. Waseen Khan is brilliant and energetic.Watch him chase down a bad guy on his Lambretta.Ajay thinks up a big one, a huge jewelry store in Mumbai. But wait a minute, why should the owner hand over all his ornaments just because a CBI team is raiding him.This is the exact reason why Tribhovandas Jewelers deny to this day that they were the victims of a heist.Films involve suspension of disbelief and we should happily do so here, the rewards are quite refreshing. Does this faux docudrama morph into a genuine heist film? I will leave it up to you to find out.Special 26 loses pace occasionally due to the love angle and the songs which are its love children.There are a few genuine laughs here and the cast delivers a rock solid performances. The back stories of some of the other players should have been explored further as well as the genesis of this gang.How they find a target would have made for a wonderful subplot but sadly that strand is not explored here.Doing all that would mean sacrificing the holy songs.The color palette of film, costumes, set design and background score all add up to a very well crafted film. The locations are atmospheric, no credit to the line producers of Kolkata though.There is a wonderful scene staged in front of a small Indian Airlines plane.Ajay and PK talk, people think he is a govt. big shot.There used to be this Vayudoot airlines run as a subsidiary of Indian Airlines,serving remote parts of the country, mostly to ferry government officials while the losses were absorbed by the Civil Aviation Ministry.To pull out one of those little planes is a masterstroke.And oh the golden age of Beetel land phones(manufactured by Sunil Mittal of Airtel), a single cellphone and the plot would collapse like a pack of cards.Small and effective heist films have become international classics like the good old French Rififi(1955) which had a nail-biting 20 minute silent safe cracking sequence and the Argentinian film Nine Queens(2000) which has been remade many times.Special 26 is a very good film, and delivers an authentic 80's feel with an engaging plot. A fundamental rule of cinema is three good scenes, no bad scenes.Neeraj Pandey delivers more than three good scenes, several, in fact. Its 2 hours very well spent, the rest 30 minutes you can fiddle with your smart phone, take a leak, buy popcorn. Neeraj Pandey is one of our smartest directors and is improving with every film.Thats really exciting.",
            "review_date": "2013-03-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not good",
            "content": "I don't like this movie Story Boring character also boring",
            "review_date": "2019-07-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awesome movie.. But one goof caught",
            "content": "This movie is one of the classics by neeraj pandey.. There are lots of goofs caught in the movie. One particular was that while checking the security, Manoj Bajpaye ask constable to check the cctv camera working or not in last robbery scene at Tribhovan jewllers. But at era of 1987 cctv was not discovered yet.. :) Yet this was much exciting and edge of the seat thriller movie by Neeraj Pandey and all actors are superb.. Complete entertainer. And the main part of story is that the person on whose life this stroy is based is still not caught by police. He is mohan lal and he made the robbery as per last scene in real at opera house Mumbai with help of 26 CBI candidates. Which were recruited by himself with fake interview. Even these candidate didn't know that they have been fooled and unknowingly help this man in robbery.. Hatsoff to this brain",
            "review_date": "2015-11-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Smart well-made thriller",
            "content": "Special 26 is a smart, suspenseful action thriller, albeit without any \"action\". Most of this movie, based on the true-life TBZ heist, takes place at a very cerebral level, and makes the audience actually think about what's going on. Too bad this is not what the average viewer wants, but missing this movie is the average viewer's loss.The movie stars a very low-key Akshay Kumar, who perfectly inhabits the role of the suave and sophisticated Ajju, the mastermind behind many con jobs. Ajju and his accomplices pretend to be CBI investigators or income tax officers, and thus scam corrupt politicians and wily businessmen out of their ill-gotten gains. No Robin Hoods, Ajju and his gang live life extra-large! Ajju's deputy is played by Anupam Kher, finally \"acting\" after Saaransh. The scene where he breaks down in the face of interrogation - that alone is worth the ticket price.What spoils an otherwise perfect movie is the absolutely unnecessary romance angle - apparently mandatory as per the Guidebook to Bollywood Movie-making. A simpering Kajal Agarwal stars as Ajju's love interest...and this takes away the impact of the movie. In addition, her youth serves to underscore Akshay Kumar's advancing age, and their romantic scenes are laughable. The movie could have done without this, and without the two attendant romantic songs as well.The others actors, including Manoj Bajpai and Jimmy Shergill play their roles to perfection, being suitably understated and appropriate foils to the lead actors.The fact that this is based on a true story is an added attraction, especially for those of us who are old enough to remember reading about it in the news!",
            "review_date": "2013-02-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Serious Stuff With A Touch Of Lovely Humor!",
            "content": "Special 26... An amazing movie with a marvelous climax. One of the best movies of recent times.A team of four fake CBI officers are involved in several raids. But this time they're planning something big. Will they succeed? Or the real CBI officer will catch them? To know you have to watch Special 26. It's one of the best films of Akshay Kumar. I loved his 'catch me if you can' attitude. He doesn't beat up people on a go, nor he does any mindless comedy. He will make you fall in love with him by his calm and cool act. And there is not a single doubt about his personality, charming looks and enthusiasm. 'Kisi ki nazar naa lage Akshay Kumar ko'!! Akshay Kumar haters.... Here comes a kickass Akki movie.... So beware of barking next time when you even think of any nonsense for him. We need more such films from you Akshay Kumar.Anupam Kher is outstanding as Sharmaji. His character entertains us in two shades. One, when he's serious raiding and second where he is a bit fearful & hesitant.Manoj Bajpayee is stunning as 'the real' CBI officer.Jimmy Shergill & Divya Dutta play their roles perfectly.Kajal Agarwal has no scope of showing her acting skills as her character in the film was needless.The supporting cast is perfect.Hats off to Neeraj Pandey for such a wonderful direction. The film is set in 1987 and believe me you won't even figure out whether you're watching a 1987 film or 2013's movie. He has brilliantly written the script. It's so tightly written that you'll get glued to you're seat start to end. The first half takes some time to build up the characters where the second half is pacey.The first fifteen minutes are too good when they raid at a politician's house.If you're thinking that it's a serious movie, then let me tell you that it has a lovely touch of humor too. I've not laughed this much in any comedy movie of recent times.There are only two flaws in the movie. One: songs are out of place. Two: bad computer graphics especially in the second half.The music is average. Dharpakad is my favorite from the album.I'll rate it 8/10. I request each and everyone to watch this flick. 'Asli power script mein hoti hai'! Unmissable!!!",
            "review_date": "2013-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Neeraj Pandey rises to the best in Hindi Cinema",
            "content": "If I were to think about a Hindi heist movie by a Indian filmmakers, it would be stupid of me not to consider that movie a Hollywood remake, a bad one mind you (cough .. Players .. cough). That was before I saw Special 26. This movie and it's makers depict everything that is in constant revolution in Indian cinema. It's conception and subject is something that is very endearing, especially to an Indian heart.Before I start putting un-colloquial words on this post let me just confess that I have seen enough heist movies.This all so mighty nature led me to believe that I knew the ending well enough 20 minutes before the climax. I even with intellectual air up in my head try to tell my engrossed friend how the movie will end, to which I was served with enough verbal abuses. But then something happened and I was left totally flabbergasted with the turn around in story. That air up in my head disappeared like a shamelessly coward dog.The movie is good because it has what it's story demands – a tight screenplay. Apart from the 2 song sequence, it guides uninhibitedly, making it's patterns quite like the popular heist movies. With the subtle humour of it's characters and intelligent direction, the movie has a lot of scenes to get amused and laugh at. There is that scene where officer (Manoj Bajpai) tells the suspended policeman that he wont get fooled by this gang like he did and with that you know that this will be a good tom and jerry chase and the imminent win of one over other. There is also the savoring scene of interviews where young people come with very funny lines on why they want to join CBI. Neeraj Pandey with his promising debut comes forth with another movie that is enjoyable, witty, intelligent and has enough to make your moneys worth. He has augmented his reputation to another level, maybe the one of the best filmmaker in contemporary Indian cinema.Performance wise it does with what little it has to offer. Akshay Kumar plays the subdued part well in accordance to the story and it's his characterisation. But those of you who might carry the notion of his best performance yet need to slow down a little. The pick of this movie are two persons who with their portrayal make this movie so much fun to watch. Manoj Bajpai with his angry man attitude gets the part so well even with his overconfident nature of portrayal. It might seem like he will growl at you for passing a stupid comment and then he comes with the most quirky dialogue. Anupam Kher potential as a actor is far from recognised. The way he shifts his mannerisms from serious to devil-may- care attitude is worth applauding. This is just a opinion but I think that if Anupam Kher would have done something like 'Do dooni Char', it would have been all the more relishing (No OFFENCE RK). He just gets the common man attitude and attire. Rest of the cast did commendably good in supporting the story. Oh and yeah watch it l so for the art direction and portrayal of cities in 80s especially Delhi.A must, must watch.",
            "review_date": "2013-02-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Illogical plot drowns the movie",
            "content": "I remember watching Special 26 in the theaters when it released and coming out thinking the plot was so absurd.Now watching it again, I noted those 4 or 5 illogical behaviours which if a character/s had not made, the movie would have ended probably in less than an hour.The movie being rated '8' on imdb is a dis-service to some actual amazing movies that are made in India. I wonder what was going through people's mind when they rated this film as 8 or above.It's a good change to see Akshay Kumar in character. The overall movie premise is also good and the film is stylishly shot and is inspired by a true event.As I said, the convoluted plots drown the movie inspite of some good acting from Akshay Kumar and Anupam Kher.Eg. A character who is the part of the robbery gang alerts the cops for no reason or compulsion. The cop knowingly allows them to proceed with their plan so that he can catch them in action, instead of actually apprehending them.There are couple more such silly scenes that totally drowns the movie.Neeraj Pandey, who debuted with the brilliant 'A Wednesday', could never repeat the tightness of his debut film in any of his following films including Special 26 and Baby.Special 26 a major let-down. Watch at your own risk.",
            "review_date": "2019-09-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "simply we can say",
            "content": "This is kumar's 4 against daniel ocean's however?really good bollywood gem's noir genre.",
            "review_date": "2021-04-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Special 26 is truly special and one of the best con movies in India",
            "content": "A great movie I must say. Industry greats like Manoj Bajpai, Anupam Kher and Akshay Kumar have done a very good job here. This is the first movie I personally liked of Akshay Kumar after a long time. Story telling in India is getting truly professional and better by the day. This is the only movie I've liked after the Gangs of Wasseypur series.About the movie, this is a Catch Me If you can meets Oceans 11 kind of movie. The con artists are willing to pull off a dare that not any one can comprehend. A brilliant twist at the end of the movie. The con artists start small and go undetected till some news is printed about them, instead of getting dejected and discouraged, they get more and more bold. They are now prepared to pull of the biggest con job in India. Very nicely scripted, to actually believe that this movie is based on real characters, is an amazement in itself.",
            "review_date": "2013-02-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Special 26: special indeed!",
            "content": "An air of urgency, a wave of 'what next' with a little heat of 'why the romantic angle and songs' is what summarizes Neeraj Pandey's latest outing, 'Special 26'! Till a little after intermission, one wonders why the movie has been titled so. Well, there is more beyond the name. Let's delve into the special nuances:\u0095 Performances: Whoa! Neeraj, yet again manages to extract real feel from the reel characters! Whether it be the mastermind, shrewd, opportunist Akki or the more suave but vulnerable yet impressive veteran Anupam Kher. Manoj Bajpai is a treat to watch! The GOW actor is again at his best here whether it be his puns, mannerisms or body-language, all changing as chameleon with the requirements of the story. Jimmy Shergil does full justice to his erratic role. Other supporting actors like Divya Dutta, Tiku Talsania, etc. look well-suited to their characters. Kajal Aggarwal, the so-called female lead of the film is perhaps there to add G-quotient. However, her character only slows the otherwise crisp, high-voltage drama.\u0095 Plot and treatment: It's the unusual plot and its execution which score the highest marks for S-26. Bole to, film Ki asli power inhi me hai! The film has a realistic feel of the 1980s be it the gadgets of that era, or the hardly crowded roads or fashion statements. The film is said to be based on true con-incidents that occurred before the license- raj ended in India in 80s. On a macro look, it might look like a normal Chor-police story, sans the high-fundooism and macho-factor of a 'Dhoom' series. However, as the movie progresses, you will find it more amusing, captivating and hair-raising yet entertaining to the core with some taali-mar dialogs!\u0095 Music: was not required upfront, though there were 3-4 unrequired songs without which S-26 could have been crispier. However, the background score is one important ingredient in the film as it adds pace to the happenings and gives the 200 mts race, speed of a 100-mt!\u0095 Cinematography: Decent enough to make the terrains, places, locations believable and realistic to suit the era and the demand of the story.\u0095 Flaws: Yes, S-26 is not short of any flaws. Unnecessary romantic angle and songs I have already mentioned about. Also, a couple of shots filmed with Mumbai sea in background look very artificial. Perhaps, the director wanted to film them in the 80s the ishtyle only!In all, Special 26 is no less special for a watch. After a long time, the climax of a movie didn't disappoint. It's not another 'A Wednesday', but definitely worth a watch. Go for it guys, paisa-vasool hai!",
            "review_date": "2013-09-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Masterpice",
            "content": "One of the best film in 2013\nOutstanding acting Akshay Kumar\nAnupm kher\nDon't miss this movie\n⭐⭐⭐⭐⭐",
            "review_date": "2020-04-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not at all the kind of movie which will want you to leave your brains at home! Thats what I like!",
            "content": "~NO SPOILERS~I wanted to watch Special 26 coz of 2 reasons, 1) Neeraj Pandey who wrote and directed 'A Wednesday' 2)The trailer of course. Special 26 is a film based on the main theme of heist done by a group who act as fake CBI officers. The group is headed by Anupam Kher and Akshay Kumar. Also a love angle is introduced between Akshay Kumar and Kajal Agrawal to spice up the entertainment value. Manoj Bajpayee and Jimmy Shergil also play important roles.Pros- Acting wise Anupam Kher was absolutely brilliant. The first slap given by him to the PA of a minister is the highlight of his confidence, while a particular conversation wit a gun pointed towards him by Manoj, shows his variations and finesse as an actor. Next comes Akshay kumar who has finally done a sensible movie according to me after ages(OMG was good too). This is one of his best acts. He exudes wit, confidence, love and a quirky sense of humour. Manoj Bajpayee is the perfect cast for his role. I liked him more in this movie than Gangs of Wassepur. Jimmy Shergil did good job. Kajal Agrawal is a beauty to watchout for. The casting of every role is so precise that the whole cast keeps up the mood of the movie with their amazing dialogues. The writer, director Neeraj Pandey has again done full justice with the story and the movie. Well done. He has now emerged as a director to look forward to. The costumes and ambiance will remind u of late 80's. The camera work is good. The screenplay is fast and you won't be bored, except for a few songs which are OK. The only song which lingered with me was 'Mujh mein Tu' sung by Akshay Kumar. Its nice. The only think which bothered me was too much use of background music in long 'walk' sequences, which gave them more exaggerated feel rather than being realistic. Besides this little con, the whole movie is something not worth missing. The climax is brilliant but not too brilliant(ask me the difference) as I could judge it well in advance, but still an amazing screenplay attempt. Similar to the climax of Don (2006) or Race (2008) in terms of the unthinkable twists and turns. Finally the title seems funny when you will see the film. Special 26 is a special suspense, thrilling heist film. Must watch!",
            "review_date": "2013-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Little less than being perfect",
            "content": "i watched this movie one week after its relaease and during this one week i heard a lot of good reviews about this movie from critics to users.the first thing to say about this movie is the extraordinary performances of 3 people-akshay, manoj and anupam kher... honestly they took this movie to next level and has been perfectly used by the director neeraj pandey. the second but equally important person is the director himself - neeraj pandey who had woven the storyline so perfect that made it so gripping and entertaining at the same time. though the movie is inspired by true events its completely the director who made it nearly perfect. Jimmy shergill has enacted his role very well. the background score and music by MM.KREEM is appealing as well. The 1980's theme was perfectly shot tooNow why i called this movie was nearly perfect was that there is no role for the female lead kajal in this movie except for some songs and yes there are few flaws in this movie which i am not revealing in my review and leave it to the audience to notice.",
            "review_date": "2013-02-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Races to an exciting finish!",
            "content": "Gosh, this was flawless! Special 26 is like a vintage and authentic fantastical story that is executed with simplistic brilliance. One would rarely see time itself playing a character! Neeraj Pandey makes you travel back in time with apt detailing. Whichever actor comes in the frame becomes the best performer. Electric performances by Akshay Kumar, Manoj Bajpayee and Anupam Kher and able support from Jimmy Shergill, Divya Dutta and all others make it as real as it could get. Background score is consistently racy and makes you run with the movie. Taking a breath or batting an eyelid is not an option in this 'catch me if you can' con feature. Not watching this one is not an option either!",
            "review_date": "2013-02-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What a brilliant movie with a brilliant story",
            "content": "I had been postponing watching this movie for so long but I'm glad I finally got to it! This movie is an absolute delight and lives upto it's hype. In fact, it's underrated. It's brilliant story. Brilliant direction. Brilliant actors. Akshay Kumar, Anupam Kher, Jimmy Shergill, Manoj Vajapayee, Divya Dutta - all were brilliant. Not sure how Kajal Aggarwal landed here. 'overacting ke 50 rs katne chaiye uske'. It's one of those movies which makes you sympathies more with wrongdoers. Anyway. What a brilliant movie. Perfect fun for your brain.",
            "review_date": "2022-02-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "SPECIAL 26",
            "content": "Awesome movie . Storyline direction is too good. Actors acting is superb speciallys Anupam Khers and Manoj bajpayee . They have given absolutely true message that 99 percent people are earning in black money example industrialist , politicans, film stars, police officers, prime minister's ,. President's etc. They are not proper tax payers. That's why they are leading luxurious life style and getting protection from police and we public's are doing worship of them. They are hiding their money in house walls so that no one can notice that they have lots of money. These movie is based on real life incident.",
            "review_date": "2021-12-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mindblowing thriller",
            "content": "This movie will not let you close ur eyes for seconds. Good suspense movie after a long time.",
            "review_date": "2020-07-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Must Watch",
            "content": "Mousumi Chakrabarti\na year ago\nAwesome movie . Storyline direction is too good. Actors acting is superb speciallys Anupam Khers and Manoj bajpayee . They have given absolutely true message that 99 percent people are earning in black money example industrialist , politicans, film stars, police officers, prime minister's ,. President's etc. They are not proper tax payers. That's why they are leading luxurious life style and getting protection from police and we public's are doing worship of them. They are hiding their money in house walls so that no one can notice that they have lots of money. These movie is based on real life incident.Don't miss it.",
            "review_date": "2020-08-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Special treat for cinema lovers.--Maharishi Verma",
            "content": "Neeraj Pandey comes in the category of most trust-able and creative directors of Bollywood. After \" A Wednesday\", he successfully manages to involve viewers in a taut heist thriller.Set in 1987 this film is based on the robbery performed by a group of intelligent con artists,based on true events the movie's art direction is very good it gives you the feel of old Delhi. Akshay Kumar portrays his character brilliantly.His looks his style ,there is not a single shot where you feel that he is overacting.Anupam Khmer is good enough to support, Manoj Bajpai's acting is also very good ,the tension on his face looks very real.Jimmy Shergil is a surprise package,he is fabulous.But there is a minor mistake in its climax,which could've been better.Overall, it's a must watch heist film since Aankhen(2002) and Kaante(2002).",
            "review_date": "2016-05-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Superb film",
            "content": "An awesome plot with no lags . All actors were great .\nAwesome climax and well executed script",
            "review_date": "2019-04-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Its not a Akshay Kumar film, but a Neeraj Pandey Film",
            "content": "Bang on Target is this Director, who is just one film old. And believe me, he didn't disappoint. A very well explained, executed and scripted movie. As the summary says \" Its not a Akshay Kumar film, but a Neeraj Pandey Film\".The movie is based on real incidents that took place in 80's. There was group which used to con big politicians and businessmen in the name of fake CBI , Income Tax, etc. Acting - Manoj Bajpai is a very good actor, but with this film he has proved that he is excellent. He deserves an award for his acting. He pulled up his role very well. Anupam Kher was great actor and will remain so. Very well acted. Akshay Kumar- Finally i got to see some acting skills of Akshay kumar after doing some useless comic roles in last 2 movies. And he has carried his role pretty well. Kajal Aggarwal- She is a good actor down south but her role was not worth in this movie. Her acting needs improvement. And no idea why she was in this movie. Her character was not required at all. Jimmi Shergill- He is a good actor and has carried of well in this movie. Divya Dutta- Good acting and is good to watch. Review- After Kahaani, this is the thriller that one should/must go and watch. But still didn't get why Kajal Aggarwal was there in the movie. Had she not been there, movie might have scored 10/10.",
            "review_date": "2013-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Intentionally cheesy?",
            "content": "I had to pause movie within first few minutes and recheck that it indeed is 8/10 rated on IMDB as I found it to be overacted and cheesey right away. Editing seems random throughout- what's with republic day long scene, or first real CBI chase scene, or even last cricket stadium scene?! Less said about the background music the better. Even walk to nowhere and non-event scenes are accompanied by thriller score. What about logic? Police had Anupam Kher's house address so what stopped them even if they were deceived by robbers? And if Jimmy wasn't real cop then what were initial scenes? And scene with SP of Police in front of minister where he dismissed him? It's little thought through ad-hoc scripted story.It is said to be based on true events but how much of it is true I don't know. One good thing is that I think it managed to portray 1980s India authentically.",
            "review_date": "2020-04-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Prety bad direction",
            "content": "When the story is inspire from true story than it should remain true most of the time but if you want to see this movie with any sense than don't see it. Police is shown stupid no working sense at all. Many thing shown in the movie is fake not even taking care on the costume people wears Levis/Polo T.Shirt in 1987 good.Showing charter plan as Indian airline plane where it not required to show.If someone loot a person in the name of CBI than all the money is not black money so if they steal 10 Lack he can report the robbery of at-least 1 but no one had reported strange.FAKE FAKE FAKE",
            "review_date": "2013-02-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "well done team 26",
            "content": "I have seen the movie with lots of expectations. I am amused. .... AKSHAY got his character so nicely .... multi-talented ANUPAM KHER .... did his job .... acting was the fuel for this movie .... screening .... direction by NEERAJ ...... liked it ... love it .... from my views ... I could say from the beginning of the year to July ..... SPECIAL CHABBIS ... is the 3rd best for the Bollywood industry ... 2013 ..... expectation fulfilled ... well done for the music .... PUNJABI music attached me with its resonance... Last but not the least .... MANOJ BAJPEI .... did awesome ..... reminding me a talented officer ...... his talent reflects on his acting .... I cant remember the lead female role .... she was nice .... and absolutely have no over acting like others ........ sweet romance ... enjoyed it .... Comedy ... after a long time .... I actually laughed at the comedy thriller .... audition arrangement was so good that .... I have review the scenes quite a more .... Overall .... its a noticeable contribution from NEERAJ and AKSHAY ...",
            "review_date": "2013-07-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just out of the box storyline and climax",
            "content": "Must watch movie of Bollywood. Outstanding performance by all cast and great direction by Neeraj Pandey sir.",
            "review_date": "2021-06-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Intelligent plot with hard hitting climax",
            "content": "It is one of the finest movie our hindi cinema ever produced.\nAn intelligent script with marvellous performance by all actors.",
            "review_date": "2018-09-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Super Hit",
            "content": "Amazing suspense and thrilling movie.\nStory line is amazing.",
            "review_date": "2020-09-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A MUST-WATCH TOM & JERRY TYPE THRILLER",
            "content": "This film will be liked by one and all. From the very first, to the end... You will be asking why the name \"Special 26\" - you will get the answer at the climax scene. \"Asli Power Dil Mein Hota Hai\" - \"Ajju kehte hain Aaj tak koi paida nahi huya jo usse pakad sakta hain\" -Some of the best dialogues.This film has been remade in Kollywood by Suriya and even in Sandalwood by Kichcha Sudeepa. It's a masterpiece from Bollywood.",
            "review_date": "2020-11-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Indian \"catch me if you can\"",
            "content": "Wow.Such a nice film. Worth watching...loved loved loved it.",
            "review_date": "2021-04-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Cool Caper Crackles",
            "content": "Special 26 (2013) | India, 153 minutes, Rated PG (ON) NR (QC) | Reviewed 02/13, © Stephen BourneBollywood triple threat superstar Akshay Kumar is wily career con artist Ajay Singh in acclaimed director/screenwriter Neeraj Pandey's incredibly captivating 80s crime drama that co-stars Manoj Bajpayee, Jimmy Shergill, Kajal Agarwal, and Silver Linings Playbook (2012) SAG Awards ensemble cast nominee Anupam Kher, as intensely dogged Central Bureau of Investigation agent Waseem Khan, Senior Police Inspector Ranvir Singh, Ajay's love interest Priya, and his aged pokerfaced partner in crime P.K. Sharma, respectively.Originally entitled Special Chabbis in its homeland India, Special 26 is reportedly inspired by a notoriously bold 1987 Mumbai jewelry store robbery valued at an estimated 3.5 million Rupees (approximately $150k Canadian.) Pandey's meticulously crafted screenplay adopts several aspects of that unsolved daylight heist, including these actual scamming masterminds posing as CBI agents and running a newspaper ad leading to the recruitment of locals to unwittingly join their latest jewel-snatching scheme as fake Government of India security officers.Kumar is phenomenal here, effortlessly shedding the hammy, goofball screen personas of his many previous movies to tightly define Ajay's consistently cool charisma while carrying the lion's share of this 153-minute caper. As well, take note of the soundtrack's wonderfully haunting love song Mujh Mein Tu, sung by Kumar throughout. Kher and Bajpayee also pull in thoroughly astounding performances here, deftly squeezing out every morsel of character definition and drama from this cleverly twisty script for moviegoers of all ages to enjoy. The fun cinematic touches and CGI trickery used in recreating India circa 1980s are virtually seamless and truly inspired. Sure, there are flaws. The pacing at times feels unnecessarily drawn out and unintentionally comical, particularly during early scenes that seem intent on heightening dramatic anticipation. The accompanying incidental boop-boop instrumental doesn't help. It's also disappointing that Agarwal's role as Priya and that of Divya Dutta as Shantiji play out as little more than peripheral human eye candy unimportant to the over-all storyline. Also disappointing is that there's no official website for this big budget effort, apparently relying exclusively on a simple Facebook page and Twitter account for its online presence.Absolutely check out Special 26 for the outstanding performances led by Akshay Kumar, and for this subtitled, masala-tinged crime drama's clever and thoroughly satisfying story. Awesome! Reviewed 02/13, © Stephen Bourne.Special 26 is rated PG by the Ontario Film Review Board for occasional use of words such as darn, damn, hell, limited embracing and kissing, and restrained portrayals of non-graphic violence, and is not rated by la Régie du Cinéma in Québec.",
            "review_date": "2013-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A wonderful movie from the makers of \"A Wednesday\"",
            "content": "First i must congratulate the makers of \"Special Chabbis\" for making such an entertaining movie. Pulling off such a brilliant concept after an epic movie \"A Wednesday\" truly deserve the accolades. Brilliant acting, Retrolook of the actors and an awesome direction summarizes the movie. A special mention of Mr. Anupam Kher for proving again that he is such a versatile actor.Manoj Bajpayee and Akshay Kumar excel in their respective roles.Jimmy Shergill as a rookie cop does well. Just like \"A Wednesday\" this movie also excels in twists and highly recommended for everyone to watch. This movie deserves 9/10 and a must watch.",
            "review_date": "2013-02-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Don't Watch",
            "content": "Sad story line, first half has couple of irritating songs,before beginning of second half u will know the ending. Torture. Waste of a good cast. All they needed was a good script writer, why does no one spend money on that. Script has n number of goofs, lacks continuity. In the end you realize the whole story is so stupid. Total waste of money. Comedy is some relief, Only few alive patches in the otherwise dull movie. I was wondering whether reviewers before me were paid. How can u rate such a sad movie as great. They are trying to make meaningful cinema but the result was very bad. Yes it had no usual mas-ala, no dis-hum dis-hum, no exposure, no item songs(though there are songs which are torture). But they blew it up..",
            "review_date": "2013-02-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "'Special 26' is not so special",
            "content": "The film starts with the bang - Akshay, Anupam Kher and two of their guys with the help of local police do a high profile CBI raid in a minister's house. Later, the police and the minister realise that they were fooled and the minister was looted. The first few minutes gets our full attention, albeit we are aware of gist of the story that the duo are frauds.Every heist the gang of four carry out is exciting. Not to mention their sudden fake raid to a traders' business in Kolkata is met with the real CBI already present there. The situation is fantastic when the real CBI stares at these fake CBI in long silence and the cons get nervous unknowing what to do next.Meanwhile Sub Inspector of local police station (Jimmy Shergill) who unwittingly helped the cons in minister house heist was suspended and is ashamed. He knocks the doors of CBI for help to find and put those cons behind the bars. That's when well talented CBI officer played by Manoj Bajpai comes into the scene. With SI, he embarks on to hunt them down.While we are excited on how the story went on in realistic slick manner in the first half, the second half becomes Bollywood-ish. There are redundant and unnecessary scenes. For instance, SI going on the flashback mode for describing the events that led to Minister house heist which brought SI disgrace. Dear Director, may be CBI Officer needs those flashbacks but not the viewers!The gang at last decides to retire with a final job of robbing a big jewellery store, unaware that CBI officer was tracking every step they take.The plot which happens in 1987 is loosely based on 'Tribhovandas Bhimji Zaveri' jewellery store heist by a mysterious con man posing as RAW officer along with 28 other people. The case is still unsolved.The film deviates from the plot when conmen in the guise of CBI conduct interview to recruit 26 people for their final big heist. The interview scenes, reminding of goofy people in the auditions of nowadays' reality shows, are hilarious.When the conmen are not in action, they would be in their hometown villages doing household works(!). I'm baffled. What did they do with the hell a lot of money (more than 50 heists as said by overacting Anupam Kher) that they still can't afford to live well!Every morning after leaving his son in school van CBI director returns home and stares at his wife's busty chest and asks her to wear dupatta over. I don't understand why does the director wants to depict. This is shown more than once in the film. Or is it just a fill for the sexual void created by the lack of \"item numbers\". Director only knows. Probably this is why the film got U/A certificate, otherwise there is no other objectionable material in it.Akhay kumar's romance with southern actress Kajal Agarwal is another unnecessary gap filling sub plot to run the film for two and half hours - the typical Indian film running time.The film which was realistic in the start takes a wrong theatrical turn in the middle and ends with another bang. The second half of the film is unconvincing. In the later half, even Anupam Kher is overacting and Manoj Bajpai comes around with frowned look rest of the film. But the film doesn't fail as an entertainer.Fast paced Cinematography and apt editing elevates film even whenever the story lags. Background score is overbearing at times. \"Mujh Mein Tu\" is a soft solo romantic song which might be played repeatedly. Other songs are forgettable though they are all melodies.Having an interesting plot 'Special Chabbis' could have been as punchy as 'A Wednesday' is, if the frills were avoided and if it didn't try to be a crowd pleaser.",
            "review_date": "2013-03-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Well done",
            "content": "Special 26 is not one of those mindless entertainers with leave-your-brains-at-home attitude. You may assume it's one because Akshay Kumar is synonymous with films like Housefull series, Rowdy Rathore and Khiladi 786. Special 26, which borrows from real-life incidents, is a heist drama, has no forced humor, no South-styled stunts, no song-and-dance routine with foreign dancers in the background. Special 26 is more of a 'treatment' movie, a plot-driven fare. So, there! Special 26 may be a fictionalized account of events that occurred in the 1980s, but Neeraj ensures it does not transform into a dry film/documentary that focuses completely and absolutely on the incidents. The film has the soul of a thriller and the director makes sure that it not only enlightens to the present-day viewer, but entertains as well. While the volatile plot and enthralling drama catches your attention, the execution of the written material, besides proficient performances from each and every member of the cast, makes Special 26 a game changer, a worthy follow up to the director's A Wednesday.Akshay Kumar does a complete U-turn with Special 26. Deviating from the comic/action roles he is recognized for, Akshay truly reinvents himself with Special 26. No two opinions on that. This is, without doubt, one of the most challenging roles in his career and the seasoned actor enacts it with complete authority. Not only will Akshay's fans adore him in this new avatar, even the skeptical types will applaud this superb act.",
            "review_date": "2013-02-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's a masterpiece.",
            "content": "Mind blowing movie. Akshay Kumar - Neeraj Pandey duo never disappoints. Same here.\nA must watch movie.",
            "review_date": "2020-12-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "???Special Chabbis???",
            "content": "This week's release is something special , something intriguing , enough to keep your brain nimble as a goat. Why shouldn't it be ??? Afterall , it's a project of 'NEERAJ PANDEY' – the director of 'A Wednesday'. Now excuse my 'Tarantino Mania' but I can't resist to use this word i.e rambunctious. Yes , like 'Django' was in 'Django Unchained' so was 'The Common Man' in 'Pandey's' first venture. But do we see that 'RAMBUNCTIOUSNESS' in 'Special Chabbis', let's see.STORY The story has been already known to us thanks to those idiots who made the trailer under tutelage of 'Neeraj Pandey' , why am I calling them idiots?. The answer is quite simple in the first half of the movie we see the descriptive trailer or one can bow down as token of respect to those producers and director for showing the first half in television for free. You are right the first half makes you feel going like the current G.D.P of India. But it is okay. I won't spoil the story as you are already miserable but I can say you will enjoy the second half to the fullest. But to those cynics and hard critics 'You can view the silhouette of almost everything coming'. When the film takes it to this altar, I mean playing with the C.B.I you can say that this flick is not one of the run-of-the-mill at least I say that .PERFORMANCES Talking about performances \"Anupam Kher\" leads . Sorry to upset 'Akkians' but that's my verdict. Isn't this little strange. You see the January movie 'Matru Ki Bijlee Ka Mandola'. In that also the so-called lead actor 'Imran Khan' was dull compared to 'Pankaj Kapoor'. So the question rises what about our star's former performances which were stellar and spectacular hit among the critics? The screen time of 'Kajal Agarwal' is quite short and it is also quite boring. Sometimes you may feel that the couple is blathering. Maybe the director used it as a side dish in a quest to attract the masses, but frankly speaking that the love story was a square peg in the round hole.'Jimmy Shergill' was perfect for his character. 'Manoj Bajpayyee' our beloved \"Sardaar Khan\" was as usual superb. Others were good.MUSIC Music in this film is a bit let down except the song 'Mujhme Tu', but it does play with the sanctity of the mood and hence deters with the pace . The music is not been provided in the demanding sections . Of course eyebrows will be raised regarding the level of dexterity of the music director. It could have been used as a prophylactic measure in the first half even if it cost the ludicrous marriage cum 'Bhangra' song.THE LAST WORD The last word 'DON\"T IGNORE IT BECAUSE IT IS SPECIAL'. And please after seeing this movie do say what is 'SPECAIL CHABBIS'? My rating- 3.5/5",
            "review_date": "2013-02-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great thriller but not without flaws",
            "content": "Special 26 Directed by Neeraj Pandey is a thriller drama you can't afford to miss. Its about a gang of four people conducting heist posing as CBI officers.The thriller is greatly directed, well performed with Manoj Bajpayee doubtlessly being the best being followed by Anupam Kher. The rest of the cast also performed well.But there are some major flaws in the movie\n1. Firstly, why the unnecessary love angle\nbetween Akshay and Kajal. I mean it would have been ok even if it was brief but it actually is carried with romance, emotions and four songs, I mean why??2. The lack of depth provided into the heists of the officers as in how they got the information, how did they convince people about them being CBI officers, They are living a complete mediocre lifestyle after conducting about 50 raids, How did they got the paper verification done???, etc.?3. Her, we are being made to route for the bad characters, but why by showing the actual CBI not smart. In the last segment, they didn't kept any trusted security in the warehouse. We know they were sure about the raid that would be conducted in the actual shop, but still if they are shifting gold at the warehouse, it turns out quite silly that they didn't keep any strong security at warehouse.4. There are also wrong historical references.",
            "review_date": "2021-04-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An opportunity for a potentially good movie is now wasted",
            "content": "Having watched A Wednesday, Special Chabbis was a must watch for me. Alas! I was disappointed. This movie is based on real incidents but is not entirely truthful about them. The plot is interesting, but the story telling is slow. The movie has a confused mood. Sometimes it is dead serious, other times it tries to be funny. Then there are songs which are out of context of the main story line. They could have done away with the side stories. This way they would have done justice to characters involved. As usual Manoj Bajpayee has delivered excellent performance.You should watch this movie, but don't expect too much from it. This movie is nothing like A Wednesday.",
            "review_date": "2013-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "2013 opens on a special note..",
            "content": "special 26 has ensured again that there are people still out in the industry who can make some realistic and sensible cinema ( looks like people are also finally coming off the typical masaala films.. good to see)... NEERAJ again shows his class.. as for this movie .. the movie inspired by the true incidents of late 1980s is about a bunch of con men headed by AKSHY KUMAR who pose as cbi and income tax officers and loot the rich (and corrupt) people all over the country and how they play cat and mouse game with the honest cbi officer WASEEM KHAN khan(manoj bajpai) who is assigned their case..definitely MANOJ BAJPAI is the show stealer ..he so easily carries of the role of waseem khan.. AKKI at his best (luckily acting deptt this time ) back on his way to some sensible roles than so common mass movies.. anupam kher is good as usual.. rest of the cast do their jobs nicely.. KAJAL AGGARWAL though has been wasted.. definitely the story is not devoid of loopholes but can be easily ignored..no worth mentioning minus points except that songs could have been avoided easily and background score at many scenes seems forced.. overall it is a more than nice experience..not to be missed (after all we don't get to see meaningful cinema much these days..)",
            "review_date": "2013-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A must see classic!",
            "content": "Whenever you're having a bad day, watch this movie. Whenever you're having a good day, watch this movie. The acting, plot and screenplay are all 10/10!",
            "review_date": "2021-10-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Fantastic Dark One",
            "content": "A fantastic thriller by Akshay Kumar. BABY and SPECIAL 26, 2 thriller masterpieces of Akshay. EVERYONE CAN WATCH",
            "review_date": "2021-01-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Special Chabbis is a Special Affair",
            "content": "Special Chabbis is really a Special Movie. Fist Half with \"Gode Mukhde Pe Zulfan Di Chhawa\" and prolonged Character Introduction may seem a bit of Drag but the Second Half Compensates every complaints anyone can make and you only end up laughing and clapping after the Movie Ends!!Story wise Special Chabbis is Awesome! A gripping Screenplay and Fantastic Acting make it a treat for everyone. Akshay Specially is a delight as he puts in a long unseen effort. People who had admired him in Sangharsh, Janwaar, Khakee, Aan, Waqt, Aankhen, Namastey London will know what they have been deprived of during this gap of 5 years (2007-2012)The Movie will find appreciation among every class of Viewers and will go the OMG_ Oh My God! way at the Box office i.e. a slow start with a rapid pick up and a Huge Success! I'll go with a 9/10 for the Movie!A must watch and the Best Start for the Year!",
            "review_date": "2013-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mind blowing...Simply Awesome",
            "content": "It's masterpiece...Edge of seat thriller..Akshay kumar at its best. Must Watch.",
            "review_date": "2020-06-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Well written fast paced and engaging",
            "content": "This is one of those rare movies that come out every few years and are worth watching a few times. It is genuinely well written and keeps you engrossed till the very end.",
            "review_date": "2021-01-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What's with the slow motion scenes!?",
            "content": "This movie is so cliche that it's almost unbearable to watch it, it seems to me that this guy Neeraj Pandey summed up all the movements or camera tricks of each one of the trendy directors that exist in Hollywood and put them in a single movie. All of them! Okay, these are fashionable things, I suppose, but the slow motion? It is excessive, unnecessary and uncomfortable to watch it. And since the movie uses so many over used resources, the movie ends up being very obvious. You see the big finale coming from a mile away. Anyway, the idea is not bad, but the execution is horrible and undermines the movie itself. At least, this is the way I see it.",
            "review_date": "2021-02-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": null,
            "content": "Excellent film, great shooting and great acting. Suspenseful though some scenes can be cut, and good use of humour.  A bit more sophisticated than most bollywood flicks. Check it out if you are a fan of suspense, drama and plot twists.",
            "review_date": "2013-07-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Special 26 is a great movie! I really loved this movie. Akshay Kumar has well done in acting, some of the scenes may seem boring but don't let the 50 village voice review fool you. The trailer shows nothing. The real fun comes on the movie.Special 26 is a great movie! I really loved this movie. Akshay Kumar has well done in acting, some of the scenes may seem boring but don't let the 50 village voice review fool you. The trailer shows nothing. The real fun comes on the movie. So, 10/10 is my review. MUST WATCH....",
            "review_date": "2013-02-17",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "meta_rating": 8.5,
    "meta_summary": "Set in 1987, this heist comedy focuses on a group of thieves who pose as members of the CBI (India's Central Bureau of Investigation) to stage robberies of dirty officials, but when a real member of the CBI learns of their scheme, they become the targets.",
    "vibes": [
        "foreign",
        "proficient",
        "skeptical",
        "synonymous",
        "volatile",
        "quick",
        "authentic",
        "alive",
        "magnificent",
        "sloppy",
        "thankless",
        "dumb",
        "whole",
        "unwanted",
        "meticulous",
        "famous",
        "stunning",
        "needless",
        "hesitant",
        "charming",
        "handsome",
        "joyous",
        "pink",
        "pleasing",
        "sentimental",
        "upset",
        "requisite",
        "appalling",
        "lousy",
        "sore",
        "weird",
        "mandatory",
        "worthy",
        "enthralling",
        "corrupt",
        "innumerable",
        "amusing",
        "crisp",
        "erratic",
        "earthly",
        "frivolous",
        "hungry",
        "lustful",
        "adverse",
        "foursome",
        "ignorant",
        "noble",
        "practical",
        "superfluous",
        "thin",
        "adequate",
        "dead",
        "moral",
        "tiresome",
        "descriptive",
        "former",
        "ludicrous",
        "miserable",
        "nimble",
        "rambunctious",
        "stellar",
        "particular",
        "aerial",
        "intact",
        "reminiscent",
        "unexpected",
        "extra",
        "least",
        "joint",
        "impossible",
        "commercial",
        "unapologetic",
        "angry",
        "colloquial",
        "constant",
        "imminent",
        "mighty",
        "overconfident",
        "verbal"
    ]
}