{
    "title": "The Starving Games",
    "rating": 0.0,
    "release_date": "2013-10-31",
    "num_reviews": 401,
    "genres": [
        "Comedy",
        "Sci-Fi"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "For fans of Scary Movie and related spoof movies",
            "content": "I don't really understand what people expect to find when they decide to watch movies like this. I do know what I can expect, because they are always the same. If you like this type of ridiculous, non-intelligent, dirty comedy, good. If not, why do you bother?I had a good few laughs with this movie, and it entertained me more than other films that apparently are great (see pacific rim). This movie is not pretentious nor tries to amuse you with new, all fantastic jokes. It doesn't need much budget and it's something I appreciate. It's also better than other predecessors such as Disaster Movie or Epic Movie (those were actually quite bad). As I said before: if you like the Scary Movie saga and related spoof movies, go for it.Now, 10 is probably a bit overrated, but I can't stand the 3 or so score that this movie shows at the moment, while other trash is in the 7s range.I expect a lot of clicks on the NO button regarding if this review was useful to you. Please, be my guest, I wouldn't have it any other way. The day I am loved by the masses will be the day that I start rating movies like twilight with a score of over 5.",
            "review_date": "2013-11-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "You won't burn any calories watching this laughter-free \"spoof comedy\"",
            "content": "It is not as if spoof comedies are terrible, on the contrary there are some brilliant ones out there like ones from Mel Brooks(Young Frankenstein) and Leslie Nielson(Airplane), even Scary Movie and Loaded Weapon 1 were fun if not quite in the same league. Like a lot of people, I do think Friedberg and Seltzer are hacks and not one of their previous five directing-writing efforts with Disaster Movie, Epic Movie,(two of the worst movies ever made), Meet the Spartans, Date Movie and Vampires Suck have been good. Curiosity and that there are some good examples of good spoofs out there were the sole motivations of seeing The Starving Games in the first place. This said after viewing, The Starving Games really is no improvements over the previous Friedberg/Seltzer collaborations though it doesn't quite stink as badly as Disaster Movie and Epic Movie. There are three fairly small bright spots, Maiara Walsh's game performance and the cute Angry Birds reference and Taylor Swift serenading a dying contestant moment(though that only raised a very meek smile). Visually, it's amateurish stuff, the impersonation costumes are also pretty good but that's it, the production values have low-budget TV quality all over it coupled with (thankfully sparse) poorly rendered effects, too many reaction shots(manipulating us into supposing to laugh) and some really choppy editing. The soundtrack feels thrown in and poorly placed, just there for the sake of it which makes it tiresome and sometimes tedious, that it isn't very catchy in the first place doesn't help either. The toilet-humour-heavy dialogue is vomit-inducingly crude, childish and unfunny is the best it gets which is testament to how truly terrible it is. The parodies themselves are no better, like Vampires Suck there is a main gag and other ones that are not as prominent. The parodies and impersonations are just tired, painfully predictable and often irrelevant, reeking of Friedberg and Seltzer just throwing like the most unsubtle of sledgehammers things in with no relevance or structure to them. And the jokes are drawn out especially the lottery draw one and the tasteless sex scene to the point of slowing the movie down. There was at least a story, unfortunately it comes across as a very thin one and is completely lost within the humour, which explains why some scenes were drawn out. The characters are just caricatures and nothing more, and despite Walsh's efforts you feel no shred of empathy for the lead character. The acting is awful, ranging from over-the-top(Diedrich Bader) to vacant. All in all, incredibly lame but is not Friedberg and Seltzer's worst. 2/10 Bethany Cox",
            "review_date": "2014-01-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Run and tweet this",
            "content": "A few weeks ago, upon discovering known and universally panned parody filmmakers Jason Friedberg and Aaron Seltzer were making a parody of the popular franchise The Hunger Games, I sent out a message on Twitter I thought would be seen as encouraging to some. It read, \"Encouragement to young filmmakers: whatever you're writing now is infinitely better than the new parody film The Starving Games. Soon after sending the tweet, I received a reply from the film's official Twitter reading, \"Great! We're working on The Starving Games 2!\" The fact that the PR/marketing campaign for the picture needs to reply in a smarmy way to negative feedback online about their film shows about as much maturity on their part as the film at hand. Unsurprisingly, The Starving Games is another miserable endeavor of a parody movie, directed by Jason Friedberg and Aaron Seltzer, the same men who have brought you Date Movie, Epic Movie, Vampires Suck, among other installments of the dead parody genre. That's right, I'm referring to the genre as dead now. Consider my reviews of A Haunted House and Movie 43 (which I'll throw in the same genre since it revolves around many self-referential skits and lampoons A-list actors) the genre's funeral service and this one a visit to its gravesite. What has happened to a genre so promising and so filled with life? The simple answer is it has been reduced to what appears to be a cinematic competition between writers to incorporate as many pop culture and movie references in one film as possible. In the first few minutes of The Starving Games, we are annihilated as viewers by the abundance of references thrown at us, as if it's a commercial break on Television in mid-December and we're trying to decide on what toy to buy our children. The Friedberg and Seltzer formula is to have no continuity, no logic, and no wit in their story. Just clobber together every successful film character, pop culture icon, current celebrity, etc into roughly eighty minutes and string it along with a loose plot and hope someone laughs (or enough sales come through to cash a large check).As inferred by the title, the film is one long parody of the popular book/film franchise The Hunger Games, with the protagonist of Katniss Evergreen now under the name \"Kantmiss Evershot,\" an inept archer who now must fight for her life in the game where her and another opponent must kill one another in The 75th Annual Starving Games. The winner receives an old ham, a coupon for a foot-long sub sandwich, and a partially eaten pickle. The person who sits through this film in its redundant, eighty minute glory gets nothing but a shorter amount of time left in their day.With all the disgustingly unfunny references, I'm glad this film was shot, edited, and completed before Miley Cyrus and the \"twerking\" phenomenon became mainstream. If I had to witness something of that caliber in a film that already breathlessly tries to include the \"Gangnam Style\" musician Psy, the whole Avengers squad, Harry Potter and his friends (who are told to get out of the film because their franchise has ended), and the cast of action movie legends from The Expendables, I would've probably given up.The reason why I resist discrediting or shattering the likely large egos of directors Friedberg and Seltzer is because, well, why bother? They have found a formula that pays big money and have capitalized off of the lowest common denominator of wit and intelligence there is in the cinematic world. I am anticipating reviews of The Starving Games that consist of death threats, comments about the devolution of humor because of the directors' films, and remarks of their worthlessness because of their filmography. Reviews of their films have become as predictable as the films they make, so why bother attacking them? All I can say is be grateful this one is confined to a video-on-demand released and a very limited theatrical release, as opposed to their other films which garnered wide releases. Let's hope their window of release just becomes smaller and smaller over time.The Starving Games and films like it don't make me angry anymore. They just make me sad. It makes me upset to see films like these gain an audience of young teens who are already experiencing shorter attention spans thanks to Television and the internet. I'd let my twelve year old child watch the original Halloween before a film by Friedberg and Seltzer. Or, better yet, the original Airplane! or The Naked Gun series, both starring the gifted comedy actor Leslie Nelson. Those films worked because they spoofed their own genres and didn't try to incorporate every current celebrity and movie figure that has rose to prominence since their last film. There is no reason anyone should see The Starving Games, but, oh, people will.Run and tweet that.Starring: Maiara Walsh, Brant Daugherty, and Cody Christian. Directed by: Jason Friedberg and Aaron Seltzer.",
            "review_date": "2013-11-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Of course it's bad! But it's very funny in places",
            "content": "What does one really expect regarding this kind of spoof outing? The Hunger Games is certainly an above-average target given how serious it takes itself. What's too bad in terms of the humor used in The Starving Games is the amount of low-brow fart/elimination/kick-to-the-nuts stuff that seems to show up in lowest-common-denominator humor. Yes, it's a bunch of sight gags, but many are fun and well-done. The leads are pretty/handsome and very well matched to the characters in the Hunger Games. I imagine this movie benefits from lots of beer with some amount of pizza...so you won't starve while watching this outing and a bit of judicious inebriation will certainly help elevate this movie.",
            "review_date": "2014-07-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "About what we've come to expect from dreck like this.",
            "content": "\"The Starving Games\" is yet another film in the idiotic teenager parody genre. This overused genre consists of many movies currently on IMDB's Bottom 100 list....with the likes of \"Disaster Movie\" (#1), \"Epic Movie\" (#12), \"Date Movie\" (#24), \"Scary Movie V\" (#50), \"Fifty Shades of Black\" (#65) and \"Extreme Movie\" (#99). \"The Starving Games\", incidentally, is #44 on this infamous list of badness.These films are all essentially the same...each one parodies dozens of different movies and rarely, mostly by mistake, they actually provide one or two laughs. But they also provide dozens and dozens of unfunny, crude and stupid 'laughs' that make you cringe. A few examples are names of characters...such as Hugh Janus and President Snowballs. And, as is true of the genre, plenty of fart, poop, wedgie and testicle 'jokes'. Intellectual fare, this sure isn't!So is this worth seeing? No.",
            "review_date": "2018-11-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Typical Friedberg & Seltzer fare",
            "content": "I'm a sucker for spoof movies. And although I am of the opinion that Aaron Seltzer and Jason Friedberg are a pair of talentless hacks, I keep buying their movies on DVD, in the faint hope that one of these days they will produce something half-decent. I decided to give them a fair shot this time around and actually sought out the real thing - \"The Hunger Games\" before I stuck Friedberg & Seltzer's offering into my DVD player, so at least I would have some idea of what they are trying to spoof.The result is fairly typical Friedberg & Seltzer fare - grab a bunch of unknown actors who bare a passing similarity to the more talented originals, throw in a bunch of gratuitous pop culture references that are way too late ('Harry Potter', 'Gangnam Style', 'The Expendables', 'Avatar' etc.) and try to tell your story in under 80 minutes, including 20 minutes of bloopers and credits. In that respect, \"The Starving Games\" doesn't disappoint and nothing in this movie will come as a surprise to those of you who have seen other works by Friedberg & Seltzer.This is their sixth collaboration as directors (sadly, there are more in the pipeline - next up is a spoof of Fast & Furious) but alas, they are not really getting much better at this sort of thing. The only decent movie they were ever involved with was back in 2000 as two of the six writers on 'Scary Movie'. Based on their career track since then, it is clear that it was the other four writers who actually had the talent.That this film hasn't been picked up by a proper distributor and has basically gone straight-to-video says it all. I'd love to know where Friedberg & Seltzer get the money to keep financing this stuff. It's probably all my fault, as I keep buying all their DVD's! If we all stopped watching, maybe they'd go away and get a real job. The thing is though, I can't help myself. I *knew* this film would be pants. I just had to see it for myself just to see how bad it really was. I'm desperately trying to think of something positive to say about this movie. How about - \"It's not the worst of the six films they've made?\" A final word to Maiara Walsh - you're better than this.",
            "review_date": "2013-12-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Really not that funny! 2/10",
            "content": "Review: This movie was totally not funny. For a spoof movie, I was expecting at least a couple of laughs, but the director must have been about 2 years old because the whole thing just seemed immature and silly. The only thing that a found a little amusing was the Pink bearded Mr. T lookalike, but that was about it. Some parts go really over the top, and make you wonder if they actually watched the movie before they brought it out, which was why it went straight to DVD. You won't be seeing most of the actors again, so there isn't much to comment about there performances. At the end of the day, it's just another spoof movie. Disappointing!Round-Up: As there dint that much out on DVD, I thought that I would give this movie a go, but I knew what to expect. I didn't really pay that much attention to the film after a whole because I just couldn't find anything funny. There are a few references to some other movies like The Avengers and The Expendables, but the director didn't do that much with the material. If you want loads of laughs then this is definitely not the movie for you, but if you want to play \"Name That Film\" then you should give it a go. A total waste of time and budget.Budget: $4.5million Worldwide Gross: N/AI recommend this movie to people who are into there spoof movies, but don't expect much from this a Hunger Games make over. 2/10",
            "review_date": "2014-01-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Better than their previous attempts, but still far from good",
            "content": "Yet another 'modern spoof' by Jason Friedberg and Aaron Seltzer, 'The Starving Games' has as its main focus of parody the 'Hunger Games' film. Alongside it, multiple references/spoofs of other hit films like 'The Avengers' or 'Expendables', or popular culture in general.Friedberg and Seltzer have for very long tried to copy the parody style of David Zucker, with varying degrees of success: 'Scary Movie' was very good (though I believe that was more due to the other screenwriters involved, like the Wayans' brothers), as was 'Wrongfully Accused' to a lesser degree (though that was more due to Nielsen than their writing), but the rest of their works tend to range from regular to terrible; in fact, their more aimless, messy spoofs ('Epic Movie', 'Disaster Movie') are amongst the worst films I've ever seen.'Starving Games' falls in the second category, with some genuinely funny moments (like the aforementioned 'Avengers' and 'Expendables' spoofs) but with a lot of bad ones (including, for example, the rather tasteless sex scene). Friedberg/Seltzer try so much to cram as many 'hip' references as possible, that by the end the final product is an unfunny, idiotic-looking mess. The fact no actor here managed to give a good comedic vibe, which could save some scenes (something Leslie Nielsen was very good at), makes this worse than it could have been; the actors don't even seem to try at all, and no one has any charisma (especially the main actress).Unfortunately, while this is a slightly better attempt, It doesn't give me hope for their future career. The fact their comedies seem to keep having a degree of audience success means they will keep with this formula. Guess I will just have to learn to stop bothering with their films.",
            "review_date": "2013-12-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "DON'T HATE THE PLAYER, HATE THE GAME",
            "content": "I rate films on how well I enjoy them and not on their quality. There were scenes which admittedly had me ROFL. The film does not only satire \"The Hunger Games\" but also satires other films as well as modern society, an aspect which I liked. The humor was indeed stupid and even crude at times. One line from the film about a past game:\"No one could anticipate Oprah would eat all the other contestants.\"The speech given at the end by the Samuel L. Jackson character actor had me in tears. Maiara Walsh who played the star Kantmiss Evershot reminded me of Zooey Deschanel more than Jennifer Lawrence. The actual film is short as it has a sad 10 minute blooper reel at the end.I enjoyed the film, it reminded me of \"Your Highness\" minus some of the crudeness. Other films spoofed include, Oz, Potter, LOTR, Avatar, Avengers, Expendables, plus more.Parental Guide: No F-bombs, but does have a lot of adult language. Censored sex scene. Male streaker with rear nudity.",
            "review_date": "2018-08-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Can't wait for \"The Starving Games: Catching Farts\"",
            "content": "Can't agree more with Lomedin. If you don't like fart jokes and are looking for artistic quality, don't watch it. I loved it.It really helped me to have just watched \"Catching Fire\" so I was in the right frame of mind to see this. I just sucks all the tension right out of you.The books are about a very serious subject and the films are trying to do them justice. The first film was slightly off target and too much about production values and less about the story than it could have been. But \"Catching Fire\" was more in tone with the books.So if you approach \"The Starving Games\" with the serious attitude the books (and films) would like you to take, then that's what makes great satire. It just blows the pretentiousness of the first film all to hell. And that's the whole point.",
            "review_date": "2014-06-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mindless comedy exactly as advertised",
            "content": "If you did not see Hunger Games, see it before watching this movie.This is a parody of Hunger Games, and it does that perfectly. Humor is dumb, but it is supposed to be dumb. If you watch Beavis and Butthead, you do not expect Mike Judge to make it a masterpiece, it is what it is. This movie is that sort of humour. Besides, it has half a second of Gangnam Style and Gangnam Style makes everything better. When I came to rate it, it was standing at 3.1 on IMDb. That is just not right.Overall it is a 5 or a 6. I only give 1 or 10, so since it is a movie I think lot of people would enjoy, and which I enjoyed watching with pizza and friends, I gave it a 10.",
            "review_date": "2013-11-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Parody Appropriate for it's Source Material",
            "content": "One of the main criticisms of this parody/spoof is that it is of low quality, but to me I found it spot-on appropriate given it's source inspiration. \"The Hunger Games\" is written with plot & dialogue for the broadest marketable audience - functioning 9-10th grade literacy (even with aging unchanged decades later). \"Starving\" exposed all the dialogue, acting, set and action sequences for what they were - improbable dumbness. \"Starving\" even tossed in a few gibes at similar audience favorites, e.g. \"The Expendables\" super badasses, Marvel superheroes and Taylor Swift, Potter and more in their equal opportunity funning. The cross media \"Angry Birds\" and \"Fruit Attack\" turned reality app attacks were a total-hilarious surprise. There is the basic slapstick improbabilities (breadstick arrow); the brief crudeness (a streaker). But, most poignant, in a \"Daily Show\" way of exposure, is Starving's behavior burlesques of the whole \"Hunger\" milieu - the hunt & kill sequences, the cameras, the basic scientifically impossible dome with it's computer controlled environment. The pun work was spot-on or should I say \"Kant-miss\" on \"Every-shot\". So, \"Hunger\" fanatics, watch this great parody to see \"Hunger\" for what it is.",
            "review_date": "2014-03-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fans will like it",
            "content": "If you get all the references you're sure to get a chuckle or two. The lead actress looks startlingly like Jennifer Lawrence at times. There's a few good one liners.",
            "review_date": "2020-12-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Starving Games left me hungry for some quality film-making.",
            "content": "Oh boy. This was something else. No longer are we experiencing the tolerability of 'Date Movie'. 'Meet The Spartans' now an echoing far cry for assistance. Stranded, isolated, and alone. Friedberg and Seltzer have somehow managed to accomplish the impossible, bettering their previous efforts in creating one of the worst possible parody features available. This is undoubtedly down there, burning in the hellish fires of Hollywood's underworld with 'Movie 43' and their own ironically titled 'Disaster Movie'. Solely spoofing 'The Hunger Games', this parody was instantly exhausted of ideas right from the very first second. Kantmiss Evershot? Was that supposed to be funny? No, seriously. Did I miss something whilst I gleefully bleached my eyes?This time around, the directors seemingly gave up trying to be hilarious and instead insisted on presenting as many advertisements as possible. Angry Birds, Fruit Ninja, Starbucks, Subway, Apple, McDonalds, Nike and a plethora of other brands. Atleast their previous parodies actually attempted to mock films (it's a back-handed compliment...) and not feed into corporate monopolisation. Then there's the outdated pop culture icons that were ham-fisted into this grotesque rectum of a film. The Annoying Orange, PSY and LMFAO to name a few. Playing on nostalgia isn't funny. It's death-worthy. The Starving Games wasn't in first gear to begin with. Heck, it wasn't even in neutral. It was reversing! The film was laughing at me for watching it in the first place!Peter is a device for an elongated homosexual joke, an unhealthy obsession that the directors have had in all their features. Sexual crudeness was included to, yet again, satisfy all those lonesome virgins \"fapping\" to their TV whenever Kantmiss repeatedly forces a teen to \"motorboat\" her. Looping scenes by masquerading them as highlights, from shoving a foot up someone's poop chute to a guy battered by a cannonball and exclaiming \"my balls!\" in slow-motion, functioning as a minor lethargic effort to ensue laughter. Then, the real kicker, the final five minutes of the runtime comprised of a blooper reel! As if the film itself actually wasn't funny, they thought the outtakes would surely inject some hilarity! Yeah, no. Tears were certainly visible. Tears of regret. Technically speaking, there are no positives. Acting? Terrible. Visual effects? Borderline obnoxious. Directing? Wait, there's direction? Costumes and makeup? Cosplayers.To sum up this travesty in one sentence: The Starving Games is a bunch of blindingly white-teethed attractive models running around in their overgrown back garden, attempting to parody 'The Hunger Games', but instead obliterated their careers before they had even manifested. There. Done! Move along...",
            "review_date": "2020-04-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best Spoof movie ever",
            "content": "As spoof movies go this is great. Well worth watching it, lots of laughs... (Bla bla bla.....) what am I going to say in this review? This time out, Friedberg and Seltzer stick closer than usual to the plot specifics of their primary target, and only sporadically attempt collateral damage by skewering other pop-culture phenomena. Maiara Walsh does what she can to preserve her dignity while gamely shouldering the lead role of Kantmiss Evershot, an archery-adept heroine who proves improbably resilient while competing in a nationally televised kill-or-be-killed survival game.The young woman warrior is just one of several figures intended as parodies of characters in \"The Hunger Games.\" But with the arguable exception of the autocratically tyrannical President Snowballs played (not half-badly) by Dietrich Bader, Kantmiss is the only one that comes even close to hitting the mark as an on-target satirical creation. (Oddly enough, there is no equivalent here for the cynical ex-champ played by Woody Harrelson in \"The Hunger Games.\" Maybe the filmmakers figured they couldn't come up with a name that would sound nearly as funny as the original's Haymitch Abernathy.)",
            "review_date": "2013-11-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awful attempt at parody",
            "content": "\"You know, we could run away from here. We could live someplace else.\"Why would someone want to spend 4 million dollars to produce a film like this? That's not even the right question I should be asking, it should be: Why did I actually waste my time in watching The Starving Games? I was simply skipping channels on my TV and this film was about to start so I decided to give it a go. Perhaps the adolescent teenager living inside of me would appreciate it. I'd seen Aaron Seltzer and Jason Friedberg's other spoof films such as Vampires Suck and Meet the Spartans and I had hated both of them so I wasn't expecting anything different here. I don't know how they manage to do it, but their films seem to be getting worse when you'd think it would be an impossible achievement to go any lower. At least some of their prior films have a funny joke during the opening sequence, but this film falls flat for its entire runtime. There is no creativity whatsoever here and the jokes are all recycled. The spoof genre seems to have been dead for quite some time now and there is simply nothing entertaining about it. I can't think of the last time I actually enjoyed one, but having recently seen Dr. Strangelove my heart really sinks to how low we've fallen. This film tries to throw everything at you: the Expendables, the Avengers, Harry Potter, Oz, Avatar, and even Taylor Swift, but nothing about it is remotely funny. I won't even spend more time writing a full review because it's not even worth it. I just wanted to spend some time ranting about how films like this are given the green light and why some audiences might find this material funny, because I think a ten year old could come up with the ideas for the jokes in this film. http://estebueno10.blogspot.com/",
            "review_date": "2015-10-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best parody movies ever.",
            "content": "I'm not going to lie, this is quite possibly my favorite low-budget parody film I've ever seen. Most of the jokes are on the money and catch you off guard just the way they're supposed to. And I'll be honest, even the acting was good. I've seen good actors try and act poorly before but this cast delivered. Speaking of the cast, Maiara Walsh is gorgeous. I hope she can break out of the low-budget niche film market and onto the big scene a bit because she's legit. If you're looking for a serious film, this obviously isn't for you but this is definitely a movie worth watching if you're looking for a cheap laugh or two or twelve.",
            "review_date": "2014-06-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A solid effort, with lots of great gags",
            "content": "Firstly, there is a sex scene in the middle of the film which ruins it. Up until this scene, i was planning of loaning the DVD to my brothers and sisters who love the Hunger game films. I cannot do this now. This is not a film to watch with family because of that scene. Which is sad, Because for the most part, this is a cleverly written parody with some great gags. It surpasses the last few Scary Movies and Haunted House film which all got cinema releases and is the best of the straight to video releases ever made. However many of the jokes are topical and based on cultural references which means it wont work for too long. In five years time for example, most the references will be outdated and subsequently the film will not be as funny. Scenes involving the Expendables, Avengers and pop stars will age quickly. I recognised a joke parodying the Sherlock Holmes films which not many others will get or understand. I applaud them for not telegraphing the reference and trusting their audience with knowing what it was parodying. But it is a gag that will be less understood the further we move away from its reference material release date.There is a minor reference to a gay relationship but it doesn't last long or dwell on it. A couple of deaths were rather gruesomely visual which may be a problem to some viewers. But my main issue was the sex scene as previously mentioned. It doesn't outstay its welcome at 80 minutes but still feels long enough to be happy with. I will happily watch it again and the writers did a great job in a genre often tarnished with toilet humour. Other than the one scene, it had very little of that in it, and featured mainly higher quality jokes. I strongly recommend watching this film, especially if you like the Hunger Game films, or parodies in general. But it earns the 12 rating it got for a reason so know this going in. I hope the writers continue making films like this, and preferably original parody moves (not based on cultural references) also.",
            "review_date": "2013-11-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Almost decent",
            "content": "This is way better than many other \"parodies\" of recent years. It doesn't make it the best and it doesn't even come close to the classics, but you could do worse than watching this. The obvious story line is that of Hunger Games that gets spoofed here. But there are occasional other movies thrown in for good measure (like Harry Potter to name but one of them).Some things might not work in a couple of years because it is based on current events, that's one major difference to something like \"Airplane!\". It would be unfair to set the standards that high though. So if you liked the Scary Movies (even the latter ones that lost a bit of their appeal), you will like this too. You might also like this if you didn't like the Hunger Games (another thing it doesn't have in common with the classics, but rather with new parodies, is not respecting the \"source\" material)",
            "review_date": "2014-08-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "2",
            "content": "It supposed to be a comedy but it's not even funny. Huh those reviewers who're giving 10/10 should be banned from this site because they're literally stupid...",
            "review_date": "2018-12-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A fun ride if you didn't like the hunger games.",
            "content": "Yeah, it's not perfect or big budget super special effects, but it works, and works well on satirizing the plot holes of the original story. The humor is witty enough, but some of it is too 2013 only. It doesn't drag on with the setup and quickly goes straight to the game. Fun if you didn't like the hunger games.The flow from scene to scene is good. The forest is an actual forest. The actors are having fun with their roles. Love the announcers, the blue guys and the pink lady. No joke overstays its welcome for too long, except for the small gag with the toilet humor, but it's only in two parts of the movie. Some hated memes get destroyed. It might not make you laugh, but it will make you smile.If you are a fan of the hunger games book or movies, don't even bother, because you most likely don't have a sense of humor about yourself to enjoy this movie.",
            "review_date": "2014-01-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Why do I spend effort in reviewing a movie that didn't spend effort in ANYTHING ?!",
            "content": "With a career of all horrible comedies, how come that Jason Friedberg and Aaron Seltzer are still in business to this day?! It could be the most confusing mystery in the modern history!While The Starving Games (2013) is a parody of a weak movie named The Hunger Games (2012), it's weaker than it. Rather, it hit the bottom of \"weakness\", whether as a comedy, or as a movie!Saying that it has laughs is like saying that there are birds in space. There is no fun to be seen. It's like a horror of weird stuff, shown successively, with the least talents. Actually there is something creepy about poor movie that enjoys mixing blood, farts, bad jocks, terrible bore, and cinematic primitiveness!There is clear laziness and dullness in everything. Look how the heroine runs haphazardly into The Expendables, The Avengers, and The Lord of The Ring's leads. It's a pathetic way to mock at these movies, especially when the result is always dry micro-sketches that have no smart line, no stars as cameos, and no criticism for any ironic fault in these very movies!At one moment, the heroine's colleague has a deep wound in his back, which the movie oddly focuses on its sticky repulsive sight, and at another no less repulsive moment, the heroine spits heavy blood. Then, the movie loves the 2 moments to the extent of showing them AGAIN in the blooper reel. Let alone that there is more than one scene for human and animalistic excretion. Well, in my book, when a movie succeeds in making you nauseated; then it's not a comedy at all!And while it pocks fun of an action, how come that it's more violent than it?! Seriously, the original movie doesn't have half of this parody's violence where many killings, by arrows or spears, are shown shockingly and bluntly. You can argue that this is a black comedy. But according to the movie's lQ; it's color blind!It even ends abruptly, like it's a sudden death!But still one matter that kills me. Why repeating the shots?? I mean, the catatonic mother, the sequence of beating the competitors by different weapons, the copious unchangeable cadres of President Snowballs, his assistants, and the stage's wealthy viewers while they're watching the games.. Why to repeat all of this FOR ALL THE TIME??!! It's an agony before being another source of stupidity!Trying to be objective here, and find any positive points to talk about, needs superpower, but I'll try: Maiara Walsh and Diedrich Bader have charisma, and delivered something close to good performance. The first scene of President Snowballs, with the goofy introduction and speech, was the only time where I smelled \"effort\". Bringing up matters like the degeneration of some reality TV shows, and begging sequels by simply adding a lesbian love story in other shows, was into the point satire. Else that, and with all the superpowers in the world, you won't find an extra iota of positiveness in this!The Starving Games is ugly and sanguinary comedy that has no comedy in the first place. So how come that Friedberg & Seltzer are paid money for making comedies with nothing funny like that, while - notice well - others have to pay for watching that itself?!!As for my title's question, the answer is: \"It's my fate\". And as for the rest of my questions concerning Friedberg & Seltzer.. I have no answer whatsoever!",
            "review_date": "2016-12-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "My first Seltzer/Freidbergowitzgoldstien experience",
            "content": "(one star because there is no option for zero)Let me start by saying that I have a passionate hatred for The Hunger Games. So, when someone told me there was a movie whose purpose was to make fun of it, I thought I had died and gone to heaven. After witnessing the first six minutes of The Starving Games, I quickly realized that I was in hell. The movie starts terribly and progressively gets worse from there. I must also admit that I avidly watch terrible films just to see how bad they are. Therefore my initial reaction was to finish the film to see how crappy it was as a whole. Try as I did, I could only make it through 45 minutes of this excruciatingly unfunny steel cage grudge match before tapping out.With jokes consisting of a girl pooping, or said girl using a fire extinguisher to. . . wait for it. . .put out a fire, I feel that I could find more humor in self immolation. A good comedy must be a product of clever writing. The Starving Games, however, is written with all the finesse of a bull trampling a typewriter into manure laden mud. It would not surprise me to find out that this writing duo had never actually read a book. They obviously do not understand the definition of the terms spoof or satire. As a substitute for spoof we get things like a kid dressed as Harry Potter. It seriously only works on that one level. . .\"hey that kid was dressed like Harry Potter.\"The ultimate decision to turn this movie off is that I found myself hating it for the same reasons that I hate The Hunger Games. It is a poorly crafted cinematic mistake, ripe with uninteresting poorly acted characters, who plod through substance so heavily \"borrowed\", that in most civilized countries it is considered plagiarism. And don't forget boring. . . oh so boring and predictable.Though unintentional, The Hunger Games proves to be the better comedy of the two. That at least coaxed up some hard guttural laughter, at times accompanied by leg slapping and shortness of breath. With The Starving Games, I found myself staring blankly at the screen until I came to the realization that I was in hell, there is no god, and Seltzer/Freidbergowitzgoldstien is the devil.*Spoiler Alert* This movie has been proved to cause cancer in laboratory mice.",
            "review_date": "2013-12-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Jason Friedberg and Aaron Seltzer's best movie yet!",
            "content": "'THE STARVING GAMES': Two Stars (Out of Five) Another movie spoof from the writing/directing team of Jason Friedberg and Aaron Seltzer. Friedberg and Seltzer also helmed such loathed film parodies as 'DATE MOVIE', 'EPIC MOVIE', 'DISASTER MOVIE', 'MEET THE SPARTANS' and 'VAMPIRES SUCK'. They also co-wrote 'SPY HARD' and the first 'SCARY MOVIE'. This time they chose to poke fun at the immensely popular youth book adaptation film 'THE HUNGER GAMES'. I think it's their best movie yet but that's of course not saying much at all.The directing duo chose actress Maiara Walsh to do her best job imitating Jennifer Lawrence in the film. She's no Jennifer Lawrence and she doesn't really look or act like her at all but she does an OK job in the role all the same. Walsh plays Kantmiss Evershot and Cody Christian and Brant Daugherty co-star with her as Peter Malarkey and Dale. Diedrich Bader also co-stars in the movie as it's main villain President Snowballs. The film takes place in a post apocalyptic future (much like that of 'THE HUNGER GAMES') in which the 'Starving Games' are in their 75th year. Kantmiss volunteers in the 'games' to save her sister and has to compete to the death with other teenagers (like Malarkey) in hopes of being the sole survivor. She also could win a coupon for a Subway sub, a half-eaten pickle and an old ham.Unlike other blockbuster satires from Friedberg and Seltzer this one mainly just parodies it's main source material ('THE HUNGER GAMES') and doesn't detour from that plot line. It briefly makes fun of other popular movies (like 'THE AVENGERS', 'THE EXPENDABLES 2' and 'HARRY POTTER') but those jokes take up just minutes of the movie (or less). To be fair I've only seen 'DATE MOVIE', 'VAMPIRES SUCK' and the original 'SCARY MOVIE' (out of the other films on the filmmakers' resumes) but I did think this one was the funniest of those four. Perhaps just because I like the movie it's making fun of the best. It's a bad satirical comedy flick that's mostly unfunny but it's not painfully unfunny like those other films.Watch our movie review show 'MOVIE TALK' at: https://www.youtube.com/watch?v=JSU_hwOQSWQ",
            "review_date": "2013-12-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Xa Xa :)",
            "content": "I enjoyed watching the movie, but it is obvious from its name and poster that it is a terrible movie. I don't regret watching :)",
            "review_date": "2021-08-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Travesty Beyond Belief",
            "content": "Okey, I have to admit that I knew this movie would be horrible. Just by seeing Jason Friedberg and Aaron Seltzer in the directing and writing- credits made me cringe, why on Earth are those criminals still making movies? Or a more specified question; Why on Earth are people still paying money to see these poor excuses of entertainment?! Anyways, let's talk about the movie.By now, you have probably understood that 'The Starving Games' is a parody of 'The Hunger Games'. We follow the female protagonist Kantmiss Evershot (f*cking genius) from the poor district 12 in a dystopian future where the evil president Snowballs reigns from the wealthy Capitol. From the beginning we're introduced to her attractive friend Dale (whose performance definitely deserves an academy award), as he pops up unexpectedly in front of Kantmiss aiming at a bird made in paint with her crossbow, making her blind fire her arrow out in the wild and hitting the wizard of Oz in a balloon. The element of comedy is ingenious.Well, I can't really explain every bad joke in this movie, that would basically make me re-create the entire script. I didn't laugh one single time. Is seriously toilet-humor still fun? Probably for Friedberg and Seltzer's brilliantly intelligent minds. There are some absurd scenes where Gandalf the Grey and Gimli pops up from nowhere attempting to molest Kantmiss and Peter Malarkey (Gay version of Peeta actually). Towards the long-awaited end Nick Fury and the Avengers steps on some land mines, blowing up, made me cheer as I knew those horrendous parodies were over. If you thought Epic Movie, Disaster Movie, Meet the Spartans and Scary Movie were beyond hilarious, you'll probably die laughing at this horrendous excuse for a film. Can't wait for their \"Superfast\"-movie, where Friedberg and Seltzer spoof Fast and the Furious, will probably be a runner up for the academy awards in 2015.",
            "review_date": "2013-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Oh god",
            "content": "This movie is bad. It's unfunny and cringeworthy jokes and lack of wit make it a disaster",
            "review_date": "2019-10-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Where did the laughs go...?",
            "content": "The good spoofs are rare and far between, sadly \"The Starving Games\" is not amongst the good spoofs, not even by a long shot.Granted, I have not, nor will I, watch \"The Hunger Games\", so I am not sure of how much in \"The Starving Games\" was actually a direct spoof on the events in \"The Hunger Games\". But it hardly matters, because this movie failed on the most important aspect - raising a laugh.I didn't laugh once throughout the entire movie. It was only when the bloopers were running that I was laughing. And as such, then \"The Starving Games\" was a failure and as far from entertaining as a movie almost could be.The acting itself was good enough, but people had very little to work with. And there were some great enough talents to the cast list, but ultimately no one really shined on the screen.It is as if the makers of these spoofs are way off chart, because spoofs are not what they used to be back in the days when \"Hot Shots\", \"Airplane!\" and the likes of those were out.\"The Starving Games\" gets a mere 3 out of 10 stars from me, given some of the talents in the movie, and the fact that there was actually some effort put into the production. But entertainment-wise and laughter-wise, then \"The Starving Games\" failed miserably.",
            "review_date": "2013-11-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It was funny at first but the crude humor was just pathetic and disgusting",
            "content": "I hate The Hunger Games for various reasons; I've read the books, seen the movies and have had many bonfires afterwards (the only things those books and movies are good for is landfill bait and kindling). It's an extremely overrated and frankly stupid waste of time to pay attention to, set up for the sheep to follow, so sooner or later a parody was bound to pop up. The Starving Games is one such parody, and don't get me wrong, it started out as hilarious, making fun of every bad part of the Hunger Games series (which was 99% of it). There was some swearing at first but nothing too crude, and I was laughing a hell of a lot throughout the first few minutes.Soon though, the sex jokes and fart jokes came up, and I'm not a prude but I hate crude humor. It's disgusting, vulgar, degrading and only appeals to the idiots in society, the people who find those \"fail videos\" on youtube with fat people falling over to be funny. As the movie went on the fart jokes just kept getting more and more frequent and a bunch of pervy sex jokes followed. A majority of the movie was spent with scenes such as cheerleaders dancing around wearing plastic funnels in their shirts, the two main parody characters having sex behind a picture of the president's face (only to have Gandalf and Hagrid from Lord of the Rings and Harry Potter show up like perverts), people getting kicked in the crotch and a girl hallucinating about being a character from Avatar (another popular movie) and having sex. It just wasn't funny. I hate The Hunger Games but all those nasty jokes was going WAY too far.That being said, I liked how it made fun of a few other overrated trendy movies and internet videos in the background (someone should have done that a long time ago) and this parody had potential. I think if the production company tried again with some other movie and held back on the crude humor they could create something very funny if they tried.",
            "review_date": "2014-12-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Don't subject yourself to this",
            "content": "I was at work this morning and during a lull, my boss put on this movie. I wasn't really paying a lot of attention to it but I eventually had to ask him to watch the rest of it at home.I'll be the first to admit that parody films are not my forte. I don't like gross out humor and I find a lot of them to be completely immature. But I'd seen The Hunger Games so I figured I could just glance over every once in a while if a joke was funny. I like the 5 minute parody videos on youtube (you know, How It Should Have Ended and such) so I figured it would be like that.I was wrong.Some of the jokes were nonsensical. And by that I mean I was trying to figure out what the joke was and why it was supposed to be funny. Jokes that make me wonder if the writers just threw in random inside jokes without explaining them are not jokes at all. They're just random events the movie treats like jokes.Some of the jokes were needlessly gross. I will never understand how anyone finds this kind of humor funny but I thought surely professional writers would know how to actually write something that could be funny to someone other than themselves in their addled state of mind. I was wrong. The ridiculous sound effects made it all the more difficult to tune out by the time I knew this wasn't going to be funny. Even the jokes that did have punchlines that pertained to the actual movie it was parodying were so predictable, I literally said \"called it\" at one of them after it was said.No one in this movie looks like they care at all about what they're doing. This is such an obvious attempt to cash in on a popular franchise, it's shameful. I get that movie studios are businesses and they need to make money to keep afloat but at what cost? Nothing about this movie showed any effort whatsoever. I would have thought, for a movie parodying The Hunger Games, that they would have at least made fun of the dim lighting of that movie instead of just making everything brightly colored. Was this so you could see every disgusting physical joke more clearly? It doesn't come off as a parody if you can't even make fun of things that actually lend themselves to humor.I hate movies like this. 4.5 million dollars and there was no talent or effort in this movie. I'd seen the actress who played the Katniss mockery in other things so I know she can act. I felt a bit sorry for her that she actually thought this would be anything but embarrassing. As someone who would love nothing more than to be a screenwriter, it's an insult to people who put real thought into their writing when these kinds of movies get made. There's Hunger Games fanfiction better than this. And anyone can write fanfiction.I know what you're thinking, how dare you judge this movie when you didn't even finish it. But have you ever watched a movie that started out badly and finished as a masterpiece? Because I haven't. And if there was clearly no effort in the beginning, there's no way there was suddenly effort at the end.I really hope Hollywood learns from movies like this and the genre dies out. In the meantime, I'm hoping this review dissuades anyone with a sense of humor and any class whatsoever from watching this terrible, terrible movie. Or even listening to someone else watching it.",
            "review_date": "2015-11-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Someone out there must have made an unreleased parody of Hunger games, and this is terrible parody of that.",
            "content": "Just reviewing this movie is a spoiler. I am betting about a year ago there was an ad in one of the lesser Hollywood trades that read something like : \"Do you do a great impersonation? Well come on down to our open casting where you can tell us what your impersonation is, and we will fit it into our movie.\" Yes this is kind of what you expect now days from a movie made by the people who made so many other \"Movie\" movies, but ... (and there are a lot of them) This one truly does suck. Most of the last few have though so I guess you have to forgive it then right? They have so given up, this is no longer about making a great movie that is a parody of another bunch of movies that people like, now it is just a nipple twisting gross out fest that forgot the fest. I am getting nostalgic for Scarface loving forest creatures. If you go in knowing all this you just might get a chance to Enjoy it.",
            "review_date": "2013-11-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "May the odds be never in your favour (especially if you watch this movie)",
            "content": "OK, so let me start off by saying that I know this movie is gonna get bashed on by critics and other people. And I went into this movie expecting the worst movie since Grown Ups 2. Now it's not as bad as Grown Ups 2. But ladies and gentlemen let me just say. This is one of the worst movies I have ever seen in the history of my life (and any other movie I've seen before my birth). This movie has no credibility in anyway. The acting is ridiculous, the overall 'spoof' is just a lie. By 'spoof' they mean chance to make pop cultural references. Like PSY, The Expendables and the Avengers. The only good thing about this movie is that it is 80 minutes long. Unfortunately the minutes do not fly by because you are left sitting to watch poop jokes, sexuality jokes and many more things that can be considered offensive or disgusting. The reason I wanted to watch this movie was I wanted to see a bad movie. But I didn't think it would be this bad. Ladies and gentlemen, never watch this movie1/10.",
            "review_date": "2013-11-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Sad Attempt at Humor",
            "content": "I was curious about this movie. I didn't know the creators, and I'd seen an advertisement for it somewhere and thought \"I should give that a look\". So when it appeared on Netflix I decided to give it a watch. As you have probably already guessed, it was terrible. The movie is completely reliant on its humor. Considering its a parody I think that it's quite clear that this movie isn't going for a good plot or characters, so I'll just talk about the humor.The beginning of the movie is pretty funny at points, and that's about it. Everything else is absolute garbage. The funny parts at the beginning were dark and unexpected at times, and I assumed that that would be how the rest of the movie was. Considering the Hunger Games is about people killing each other, you'd almost just assume that it'd all be dark humor. But that's not the case. After that everything is either random crap that only children would find funny or pop culture references, and it's quite clear that this movie isn't for children. The pop culture references aren't funny though. It feels like the movie just throws in it and says \"Haha get it, it's funny because we mentioned Nikki Minaj. Haha get it? Get it?\" Something isn't funny just because it's there. Sometimes things just being there are funny, but only if done right (yes, there is a specific way to make things funny by just existing), but that's all this movie is. It's funny because you know what it's referencing. That's like saying that The Pianist is funny because it's about the Holocaust and you know what the Holocaust is and it's well-known. No, that's not funny, right? That's basically what this movie does. Now while it doesn't say the Holocaust is funny (because I think that everyone knows that it isn't), that's what its getting at. 'It's funny because its famous' is all the movie is. It's hard to explain because there's really nothing amusing about it, nor is there any reason why it would be funny. So why would anyone think that this movie is funny? I have absolutely no idea. Now while I look back at some of the random jokes and think they were funny, watching them is anything but. They're better remembered then watched. Although I try not to think about this movie as best I can, because it's better not remembered. I almost felt bad about laughing at anything by the end or else I'd lower myself as a person, so even if anything actually humorous happened in the end it was lost. Overall The Starving Games is about as funny as a steaming pile of poop. It's funny at first to a handful of people, but after that it's just a giant turd and now you have to clean it up and forget about it because otherwise your weekend will be ruined. It's funny for maybe ten minutes at the beginning, but after that it's 'funny' because famous. And that's it. It doesn't make sense (even the sentence structure doesn't, yet there's no other way to explain it), and yet it still passes as entertainment. In the end there is not a chance I would ever recommend this movie. If I were you I'd wipe any research of this movie from your internet history and just try to forget about it. Even if you're interested, don't. If you're extremely interest, don't. The only time anyone should watch this movie is if it's a matter of life and death, and even then it'd have to take a lot of convincing to make anyone watch it.",
            "review_date": "2016-01-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Friedberg and Seltzer fail to make this parody hilarious due to the low budget and gross out humor.",
            "content": "I don't mind a little bit of gross out humor in a movie. But when you use it too much in a parody movie or comedy, it makes it not really funny but disgusting.Friedberg and Seltzer's latest film features a 60000 calorie burger, a black guy with pink facial hair, Taylor Swift killing someone with music, and Psy getting shot by a arrow.This is The Starving Games. But the movie should have been called Audience Reactions: The Movie. Because thats basically what this movie is. Nearly half of this movie is an audience being grossed out, hungry, or just laughing.The movie starts out with what I think is a really funny joke where she shoots Oz with a bow and arrow. This joke is really funny but we get very few of these laughs throughout the movie. Its basically Kat- I mean Kantmiss Evershot trying to survive The Starving Games with Peeta or whatever.This movie's plot is rushed and it should have been longer because they should have more time to parody The Capital instead of The Main Arena. The movie is also very low budget. The effects look very cheap even for the gross out scenes. Characters are not very likable ranging to stock characters from the used section that include cowards, tough guys, jealous guys, tough girls and more stock characters.I think Friedberg and Seltzer have no clue what to do with the parodies or comedy scenes so they just decide to put in some audience reactions, deaths, gross out scenes and more. Its not really much of a parody then a depressing attempt to make The Hunger Games more funny. Even the bloopers aren't funny even though they do have fun making the film as they go along.I like Friedberg and Seltzer as I am in that minority of people who like low brow comedy. But Starving Games is very unfunny due to the fact they have nothing to do. I love you guys. But this movie is a fail.52/100 C",
            "review_date": "2013-11-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's everything we've come to expect from the Seltzerberg",
            "content": "I think it's fair to say that 2013 has not been the best year for comedy. In this year alone, we've had to suffer through Movie 43 (Cringe- Inducing), A Haunted House (Subpar), Grown Ups 2 (Insufferable) , & Scary Movie 5 (Excruciating). After Scary Movie 5, I thought to myself \"This is it, this is as bad as any comedy can get, it's all uphill from here\". Well, turns out that I was wrong, because believe it or not, The Starving Games is EVEN WORSE Than all the movies that I just mentioned. If you've seen/survived Jason Friedberg and Aaron Seltzer' s past movies, then you know what to expect. It's a series of juvenile gags, dated pop culture references, lame celebrity impersonators, cheap production values, and scenes stolen from movies that have nothing to with what they're supposed to be spoofing.The only good thing about this movie is that it's in limited release, so that no one can spend their money on this garbage.",
            "review_date": "2013-11-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Unwatchable",
            "content": "I am all for spoof movies but this is one of those that is totally unwatchable - I am embarrassed for the cast, especially those with a smidgen of talent such as Diedrich Bader (get a new agent!) - I stopped watching when the angry bird appeared. I would imagine if this film even had aired in theaters even the seats would have walked out. \"Starving Games\" falls into the lowest category of spoof films, it's not funny, it's not occasionally funny, it's not so bad it's funny...just plain unfunny throughout. This is further proof that the duo of Seltzer and Friedburg are pretty much THE worst that Hollywood has to offer right now. Anyone even considering watching this film should be warned - it's a complete waste of time.",
            "review_date": "2014-03-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Weird",
            "content": "This movie is a satire of all other decently made movies, I would bet Mel Brooks would think this movie's outtakes were much more laughable than the movie itself I watched and rarely laughed at all But when the outtakes were viewed I found them more entertaining. Sad to see someone try too hard to make it funny it wasn't. I have seen funnier stupidity in other films that were satires. This one does not hit the mark. If the producers and writers sat down and watched other satires that were real box office gems They would then perhaps make something far more entertaining. Just stop with the boom boom and the Viagra jokes. It would work if they took some of those outtakes and pasted them in the movie. It would then be far more funnier.",
            "review_date": "2015-02-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you take it for what it is, you'll like it more",
            "content": "It's a spoof movie. If you liked Scary Movie and are a Hunger Games fan, you will certainly like this. It's idiotic with crude humour throughout but that's funny to some people. And I am one of them.",
            "review_date": "2019-09-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Starving for some comedy. Here's an hors d'oeuvre",
            "content": "Spoiler Alert. Enjoy the movie first if you don't want to be sullied by the opinion of another. M 7+ Not quite an 8 because ever since \"Scary Movie\" (Only the first one and maybe the third.) his form requires absolute surprise. Also, from the old \"Police Squad\" days comes a plethora of knock-offs that try hard but just don't make it. The parodies of Narnia related movies come to mind. But as can be seen in the number of parody failures, it's a difficult art form. Maybe more difficult that outright comedy. But his movie hits on several levels and while being no Mel Brooks or Faralley Brothers or Coen Brothers production, some of the lines are well written. Unfortunately they are poorly acted. Others just miss but a few hit. The throwaway line is a great comedic vehicle but timing is of the essence. In \"The Starving Games\" the timing is just a little off with some of the gags. Some were spot on but others fell flat because of terrible comedic timing. Otherwise, an enjoyable movie with just the right amount of quotes from other movies but with a twist. The gay references were so obvious that they just didn't work. The whole Intro to the games scene where the lead male falls for his male counterpart was so obvious that it really wasn't funny at all. Either was the reference to Cantmiss' misunderstood \"hit\" on the young girl. It just didn't work. Maybe we've become so used to gays as a fact of life that the whole \"gay\" thing has little surprise left. One expects something referring to same sex relationships and thus the whole \"gay\" thing has the same impact as a SURPRISE heterosexual relationship. The explanation of the attire was great. Lady Gaga mixed with Mikki Menage (?). One could see it and it was a nice touch. Those places show that the duo can write. Lots of mugging from all and I don't care if I never see a blue haired man bent over backward in laughter. All that mugging was bad direction and did not help sell the good lines in the film. And there are some good lines and funny verbal plays. Bringing in Stallone, Schwartznegger, and ail the other \"action\" stars like a super A-team was a good surprise. I think a better ending would be if they all behaved as if they were in the games and killed each other instead of the boyfriend shooting them all as he bursts onto the set. A good twist was bringing in the Avengers to recruit Cantmiss as a member. Some funny stuff there. Obviously the directors also thought some of the comedic timing was amiss because they included in the film a series of outtakes about the games. Most of it was not that funny. I hope the two director/writers get another shot and learn from the few mistakes made here.",
            "review_date": "2013-11-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Why",
            "content": "I have absolutely NO IDEA why my parents let me watch this as a kid.",
            "review_date": "2019-11-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "sleep,sniff,drink, read or have sex but don't waste your time with this crap",
            "content": "i cannot believe how crap is...i must say that i never saw anything worse than these...i was tensioned from the beginning to the end...but because i was annoyed...i choose to see a movie and this is a waste of time and money...i like the scary movie series but please do not compare that with this... from the begging to the end is a predictable story with nothing than bad taste... It supposed to be dumb but not like that..this doesn't have any type of humor.I would like to be asked after the movie what i think about it and if i want to be refunded.I think that is fair.is about my time and my money and same as me was lots others disappointed by the movie.It was advertised in a way that make you to come and see it, but since now i will be reserved...i will read some reviews before going for a movie..it really ruined my evening..",
            "review_date": "2013-12-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pretty dumb even for this subgenre",
            "content": "I always try to watch these kinds of movies but truthfully never hold up.There's a curious infrequency of actual jokes and they're nowhere near as weird or risque as they could be. And when they devote themselves to one franchise you miss out on the kooky plots that made Scary Movie 3-5 so good.I can watch this but even for the parody movie genre it's pretty flaccid. I wish there were movies that could be a happy medium between the gay abondone of this kind of movie and the schmaltz of the other contempories pseudo-comedies.",
            "review_date": "2019-03-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Does what it sets out to do, just a funny parody of 'Hunger Games.'",
            "content": "This movie is not as bad as the IMDb rating would indicate. It has very many \"1\" votes for no reason at all. It sets out to spoof the popular 'Hunger Games' movies and it does it very well. Also it was filmed mostly in the Hammond, Louisiana area which pleases this Louisiana native! The actress playing the Katniss role is cute and capable Maiara Walsh as Kantmiss Evershot. Archer ... every shot ... can't miss. I think it is a very clever character name. Anyway the opening scene sets the tone for the rest. In a very serious start Kantmiss is tracking wildlife and sees a chicken on a tree branch. She pulls back and as she is about to release the arrow a friend of hers jumps up and surprises her, the arrow goes way off its mark, towards a man in a balloon gondola, hits him in the chest and he falls dead to the ground.So the rest of the movie is similar in that scenes start rather seriously but quickly go into absurdity. For those of us who don't take the 'Hunger Games' movies too seriously this is a fun diversion, just to see the clever parodies. Of course there are butt jokes, boob jokes, crotch jokes, and excrement jokes but all done in fairly good taste as evident with the PG-13 rating.The movie runs less than 90 minutes and even the closing credits have a few outtakes in it. I viewed it on Netflix streaming movies.",
            "review_date": "2015-09-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "More of the Same",
            "content": "Awh, man. I'm a big fan of the whole parody/spoof genre, i loved all the classics like \"Spaceballs\", \"Airplane!\", \"Top Secret\", \"Scary Movie\" (not actually a classic, but still) Even the terrible ones like \"Vampires Suck\" and \"Superhero Movie\" gave me some laughs. But, this one is just... awh, i don't know how to describe it. OK, \"The Starving Games\" as the title suggests, is a parody on the hunger games saga and follows the same plot of the first one. However, it does nothing actually funny with it source material, and it could. All the jokes are so dumb, old and pointless i really doubt the writers thought they were funny. The first \"joke\" of this movie is Kantmiss, the main character, hunting in the wood, when her boyfriend pops up from nowhere making her accidentally shoot an arrow at a balloon with a \"the great and powerful Oz\" character at it. HOW? How is it supposed to be funny? Do the writers really think just showing a familiar face is funny? And that's my problem with Friedberg and Seltzer, they don't even try. All of them spoofs just show some famous character or celebrity being hit by something or popping out of nowhere like that's funny. Here's an example in this movie we see LMFAO and the avengers exploding, in another scene Psy is shot by an arrow, Taylor Swift appears and starts singing, an Avatar parody in the middle of the film, with no good reason, A man uses Siri for throwing \"angry birds\" and fruits at a character and she cuts the fruits in a \"fruit ninja\" way. Why all this? Because the writers really think the audience is dumb enough to laugh at something just because they recognize it.",
            "review_date": "2016-11-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "hideous",
            "content": "Its got a tittle that's bizarre, the content is hideous and quite frankly, I didn't like it.Honestly woud've felt more if I was one of the dead people in the movie",
            "review_date": "2019-04-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Lots of fun.",
            "content": "More effort was put into this movie than the movie that its parodying. True, the overall look of this movie is cheap and a lot of the humor is a bit crude, but it all works in the movie's favor. This masterpiece is a parody of the mess that is the Hunger Games and as a result there is a fantastic movie. I don't want to say a lot about this movie in the review. Its well worth just watching.",
            "review_date": "2018-03-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Better than the original.",
            "content": "As far as spoof movies go, this one isn't so bad. It has all the campy humor one would expect. But one overlooked aspect of this movie is that it is actually better than the movie that it spoofs. I know, a lot of people won't agree with me here. It is my personal opinion that the Hunger Games are in fact a bad series of movies with only three saving graces. One, it had great acting. No question about that. The stars did a terrific job. Two, the casting was great and I don't think anyone can really argue that as being wrong. Finally, third, the movie was way better than the terribly written and poorly thought out book. So, again, as far as spoof movies go, this one wasn't so bad and I'd rather watch this ten times more than to sit through any more of the horrible tripe that is The Hunger Games.",
            "review_date": "2021-04-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A slightly stronger effort from its infamous directors, \"The Starving Games\" does land a few jokes and has a very likable lead... but still suffers a poor execution.",
            "content": "Let's just get it out of the way... Jason Friedberg and Aaron Seltzer are not good filmmakers. In fact, they are bad filmmakers. Dreadful, even. Responsible for some of the worst comedies of the past ten years. Heck, even arguably responsible for at least one of the worst comedies ever made with their shockingly terrible \"Disaster Movie.\"But that being said... (And I can't believe I'm saying this)... their latest film, \"The Starving Games\"... isn't terrible. In fact, I would even go so far as to say it's \"not TOO bad.\" Oh, it's still bad. But it's nowhere near the level of infuriatingly awful that many of their other films reach. In fact (And I REALLY can't believe I'm saying this)... I actually laughed at a few jokes in this film, which is a first. Out of their other directorial efforts, I've only gotten maybe one or two chuckles. Never a full laugh. This one... it gave me about two laugh-out-loud moments, and a couple of good chuckles.Bravo Friedberg/Seltzer. Bravo.Essentially a send-up to the uber-popular \"Hunger Games\" franchise, \"The Starving Games\" is a parody (in the loosest sense), following Kantmiss Evershot (Maiara Walsh), a young woman who is forced to take part in the annual \"Starving Games\" death tournament. Along the way, she encounters wacky circumstances, contrived pop-culture references and bad jokes galore.In all actuality, this film really isn't too much different from other Friedberg/Seltzer duds. It follows the same formula (a central storyline that generally is modeled after one or two popular movies, peppered with random pop culture references and caricatures of recent popular characters from film and TV), and it definitely does have their stamp with some awful jokes and nonsensical references. But somehow, it just doesn't feel as painful this time. It is mainly due to an extremely likable performance from lead star Walsh, who is not only cute-as-a-button, but has a great sense of comedic timing, and seems very open to do whatever it takes to try and make a joke work, no matter how silly (or even exploited) she has to become. She pretty much saves the film from being another intolerable mess. In addition, as I said above, there are a few jokes that do actually work here. Heck, I'd even argue that they managed to actually work in one of their random pop-culture references in a way that was actually funny for the first time in any of their films. (A reference involving Kantmiss being asked to join \"The Avengers\", which despite coming out of nowhere, worked because it felt like one of the post-credits scenes from the Marvel movies, where characters randomly show up to talk about \"The Avengers.\")But that faint praise being said, don't think I'm necessarily recommending this movie. Because I'm not. A likable lead and a few decent jokes can't save what is otherwise a pretty big mess-of-a-film. As in Seltzer/Friendberg's other work, the characters and plotting are far too shallow, the direction is cheap and lacks creativity, the production values are sub-par, and the reliance on random references is far more grating than amusing.It just isn't QUITE as bad this time around.I give \"The Starving Games\" a sub-par 4 out of 10. I'd say if you can catch it for free on Netflix or cable, that you could do far worse, and might wanna give it a shot. But it's not worth spending money on to rent or buy.",
            "review_date": "2014-04-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hunger , Starving",
            "content": "These games were better than the hunger games , their salute said it all! I cried,,,,,,, laughing!",
            "review_date": "2020-06-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An Amusing Spoof for the Most Part",
            "content": "I watched this spoof of The Hunger Games with no expectations or preconceived ideas of what it should be like. And I enjoyed it! Not every joke hits the mark but for the most part its kinda funny, kinda silly, and mostly harmless. Maiara Walsh does a good job imitating Jennifer Lawrence and has nice comic timing of her own. Diedrich Bader, who I never could stand watching on the Drew Carey Show due to his general lameness, plays an amusing President Snowball, a parody of The Hunger Games' President Snow. He doesn't bother trying to imitate Donald Sutherland and as a result comes off kinda funny.There's a slow, odd, and unfunny sex scene with LOTR characters thrown in that really didn't fit and I fast forwarded through most of it.These kind of parodies require one quick gag after another in order to keep us watching and for this most part this one succeeds. Worth watching if you have a Saturday afternoon to kill.",
            "review_date": "2013-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of Hollywood's Mysteries",
            "content": "I could give this a 1/10, but why, I knew what I was getting into before I pressed play. These parodies are low-brow and largely unfunny. I watch just to see if somehow they stumble onto something funny.Allow me to sound like an old man for a second.The parodies used to be watchable back when Leslie Nielson was the spoof king. Heck, they were good up to \"Scary Movie\" and \"Scary Movie 2.\" After \"Scary Movie 2\" it's been all downhill.As can be gathered by the title, \"The Starving Games\" was a parody of \"The Hunger Games.\" Like all spoofs you get some other pop culture insertions in the movie as well. In this case there was LOTR, \"The Expendables,\" \"The Avengers,\" \"Avatar,\" \"Sherlock Holmes,\" Taylor Swift, Lady Gaga, Nicki Minaj, Honey Boo Boo, Tim Tebow, Siri, Skittles, Subway, and more.One of the big failings with this parody and others is the copious use of CGI. It's made an already bad product worse. And maybe I shouldn't say that the CGI has made them worse, it's more like the discount brand of CGI they use has made them worse. I get it, they don't expect good returns on these movies anyway so they have to keep costs to a minimum. What I don't get is why they keep making them knowing that the movies will flop like a freshly caught salmon. Just another of the mysteries of Hollywood I guess.",
            "review_date": "2022-03-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Silly but it was expected",
            "content": "This film is based on the Hunger Games. Unlike other previous parody films directed by Jason Friedberg and Aaron Seltzer, the Starving Games focuses on one main film with its typical insertion of pop culture gags and other popular Hollywood movies.Still the film really isn't funny and the jokes aren't clever or anything special but there were some positives.It isn't as completely forced. The attires and outfits of the cast members do look well enough and the celebrity impersonators are good enough.Maiara Walsh is one of the bright spots as she is definitely engaging as the lead.The Avengers spoof was mildly entertaining, as was the audience in the theaters watching the show and the two table broadcasters (mainly Cleaver).Overall the film isn't great but if comparing to other Friedberg and Seltzer films (Epic Movie, Disaster Movie, Meet the Spartans), it is better and shows an improvement.",
            "review_date": "2022-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good for a few laughs...that's what it's all about, right?",
            "content": "Crude, juvenile humor perfect for a ho-hum weeknight. This is not humor you need to think about, which is exactly the point if I'm not mistaken. You really, REALLY do need to see the original Hunger Games to understand the jokes, though, which I think is the problem with many of the bad reviews. The people who come here to rate this flick with 1 star and proceed to type 10 or 12 paragraphs detailing all the reasons and every scene why they thought is was \"so bad\" either don't have a sense of humor, are to intellectual to allow themselves to \"get\" the humor or haven't seen the original movie the spoof is based on. This is low brow, gag comedy, folks. Don't compare it to Shakespeare! Enjoy it for what it is!",
            "review_date": "2014-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not so good",
            "content": "A movie as beautiful as it is funny that has only and only useless and senseless scenes with a few really funny parts, for the most part it is boring. So in conclusion it is the usual parody seen and reviewed.",
            "review_date": "2022-01-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "So awful it is good",
            "content": "I think the best thing about this movie is that the actors seem to be completely dedicated to making this an irreverent mockery of the original. Starving Games keeps the same rough outline as the hunger games while dropping a few references in from other movies, and has the usual mix of idiotic jokes, occasional clever humor and generally the more intoxicated you might be, the more you will enjoy this.This is not meant to be Titus, the GodFather, or GWTW, this is a ridiculous spoof by actors enjoying themselves, and is one of my favorite wastes of about 90 minutes.If you are looking for serious acting, or originality, pass this by, it is not meant to be these things. If you want a bumbling waste of time to leave a smile on your face, and kind of clear your head of any serious thoughts, but want to keep clear of some of the worst of the spoof series, this rates near the original Scary Movie I, II, levels of humor in my opinion. I'll admit I occasionally skip a few scenes that get old after the first time or two, but this is one of the few spoof movies in the past twenty years that genuinely made me laugh.If you're stuck home in bad weather, can't get out and are looking for a quick cheerup to pass the time, I would highly recommend this movie.",
            "review_date": "2022-10-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "ROTFL-funny like \"Airplane,\" but with kids killing kids",
            "content": "This movie is hilarious, every second. The more you know about the Hunger Games book trilogy, and the 2012 Hunger Games movie, the more you will laugh. The actors whom they got to impersonate Effie Trinket and Seneca Crane look like the originals.",
            "review_date": "2018-04-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "OK/bad",
            "content": "OK, lets just start out by saying, I did not like the Hunger Games movies, i just didn't like them. I preferred the books, but when i saw this i had heard of a book parody and I thought \"Hey, maybe this is a movie for the spoof book!\" But i was wrong, I didn't find much of it funny except a little chuckle here or there. I did find that some of the acting was OK, the actress, Maiara Walsh, for Kantmiss was pretty but not the best actress ever. I didn't really enjoy the movie but i sat through it. The only real reason i did not like it was the references to old viral videos/series. The annoying orange reference ticked me off because i hate that thing and they call it annoying for a reason. Also i hated the Double Rainbow, Just because it was funny 4 to 5 years ago does not mean it is still funny.",
            "review_date": "2014-05-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Funny, and thats the point!!",
            "content": "I have read all three books of Suzzane Collins and I liked them all. But on the same time I liked this movie which someone can say that it makes fun of the book and the Movie.I saw this on a trailer, and Immediately I knew that it should be a stupid-funny movie. And that's exactly what it was about! That's why I give a good voting! Doesn't mean its a disrespect for the book as I read from others.!There lots of moments of lots of laugh for me. Lot of random things that make you laugh!! It made my day:)I can even say that I liked this movie more than Hunger games and Catching fire, why? because on this too books, I expected like a copy of the book, and every little change from the original was bad for me, but now, I knew that they gonna have lots of differences, so I quite enjoyed it more!P.s The actor that plays Katniss, is prettier than the one playing in the hunger games and caching fire.!",
            "review_date": "2014-01-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brings new depth of meaning to the word inappropriate.",
            "content": "The overall level of the humor is really low. The piñata sequence, for instance, was stupid beyond belief. The multiple references to excrement were not all that clever, nor were the endless product placements, nor were the face slaps to other movie franchises. The obnoxious 12-year-old competitor who wanted to form an alliance with Kantmiss seemed more like a target. The clip where the unarmed Kantmiss kills five armed opponents was ludicrous.'When are they going to kill each other? I'm getting bored,' was the line that summarised the film for me.Will there be a sequel to this satire? Let us hope not.-----Scores-----Cinematography: 6/10 Hand-held sequences were irritating as always, but most of the camera work was fine.Sound: 3/10 Besides the many leveling problems, the musical accompaniment was odd at best.Acting: 2/10 Screenplay: 2/10 Well, it was a satire, so there was not much to expect. I suppose the hundreds of continuity errors were intentional. Finishing the film with a long set of bloopers just completed the implementation of 'who cares?'",
            "review_date": "2014-06-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Consider the source material",
            "content": "I enjoy good parody. This is not good parody. However, consider the source material: The Hunger Games. That movie in itself wasn't exactly Oscar material.This flick starts with a poor source to parody (although if you're going to parody... certainly parody a bad movie). It's like parodying people dying of cancer; it's just not likely to be all that funny.In this case though, the jokes were crude, lame, gross and predictable. If your idea of funny is poo jokes and open running sores, boy are you gonna love this.Seriously, this is an entire film that resembles 3rd graders telling bad jokes. The sex references are simply crude, and the violence \"jokes\" aren't funny. It's just one really dumb skit after another with an ending as stupid as a... a... well as the writers who wrote this slop. One has to wonder how much weed they smoked to think this stuff was humorous.This is a swing and a miss and dropping the bat in a pile of guano. (See what I did there? Bat? Guano?) Yes, this movie was just that funny. What we need is a spoof of this spoof. Or \"How The Starving Games Should Have Ended\".",
            "review_date": "2021-05-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Silly, fun, and better than \"Hunger Games\" by far",
            "content": "It has parts that are just dumb and not that funny, but some parts are really funny.If you really thought \"Hunger Games\" was awful, and you like standup comedy, this is worth the watch and you will enjoy it.",
            "review_date": "2022-02-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "How do you rate such an awful movie?",
            "content": "I suppose with how it left me feeling after watching it. The actors are not that bad considering they are spoofing the original and exaggerating everything. The problem is with the jokes and visuals are more offensive than funny. With all the adult material I cannot believe it received a PG 13. This is an R movie most definitely for the content. It shows that those in charge of the movie had no sense of good satire or the audience they were going for.That is not to say they did not have their moments. Unfortunately, the good jokes were far and few in-between. It shows that they did have some good sense in humor although the rest of it was just pure garbage. They missed the mark completely in making this movie. This should have been an easy and simple satire to pull off. Instead, we got this mess.",
            "review_date": "2021-11-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A pitiful pitiful movie",
            "content": "Will someone please tell Aaron Seltzer and Jason Friedberg that they should stop making movie? They're not good at it! I picked this one off the list at Netflix and thought, why not? Terrible jokes, poor acting and a sh!tty script are reasons why not. This is not a parody as parodies contain some wit; this did not. It was the same lame jokes that you'd see in F and S's other alleged parodies. It makes me wonder if fart jokes are pre-printed in the beat sheets when they start story development.The acting was a step above a cold read (if that much). The jokes are heavily forced on you. And most are rehashed from every other F and S movie.",
            "review_date": "2014-07-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Jokes are layered for celebrity geeks",
            "content": "I see a lot of people knocking the Expendables, and Avengers appearances, but they're missing the irl jokes about the original cast. Liam Hemsworth, who played Gayle in the original Hunger Games was suppose to be in the Expendables, but was written out last minute. Dayle kills the Expendables. And he was going to be cast as Thor, but lost the role to his brother. Also, Nick Fury recruiting Kantmiss was eluding to Jennifer Lawrence's appearance in the X-Men pre-boot since the Avengers die after Kantmiss agrees.I'm not a celebrity geek, but I'm sure there are similar tie-ins for other parts of the film.",
            "review_date": "2014-05-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Eh. Ha ha. Eh. Cringe. Eh. Eh. Ha. Zzzzzzz.",
            "content": "Only laughed at maybe 10% of the places where I was supposed to. I cringed at the others. Only see this \"spoof\" if you can't find anything else to watch. I rated it 4 stars because the actors at least tried. The writers didn't. Too bad.",
            "review_date": "2021-09-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Terrible, unimaginative and has one funny joke... but it is a good one.",
            "content": "So this is replete with examples of other movies parodied in the most obvious and boring way imaginable. Most of the jokes rely on gross out humour and I guess \"hey I remember that better movie they are referencing\" humour?Anyway this is not funny, quite boring actually. The actress is pretty and not a terrible actress and this has one good joke with a parody of Chuck Norris in but I will admit that one actually gave me a belly laugh. All of the rest of the jokes fall flat though and I wouldnt recommend sitting through the whole movie for that one joke. Avoid.",
            "review_date": "2018-11-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Happily surprised",
            "content": "So it's a Friday night during lockdown here in the Uk, a year odd into the world pandemic and I see this movies on my tv . I had never heard of it before and as every other channel was full of repeats I flicked over......and with in seconds I was laughing out loud .\nIt's total nonsense but perfect viewing for me at this exact time . Ive seen a few of these parody movies over the years that just sucked but this one I honestly found totally silly & funny. A perfect movie for me at the perfect time . Thanks",
            "review_date": "2021-02-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "a Lousy yet Terrible Spoof Movie",
            "content": "I sat through an hour watching this on Netflix and it is yet to be the most terrible parody movie in recent years that something Mel Brooks or Jim Abrahams the director of Hot Shots! would have direct.",
            "review_date": "2021-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Spoofy fun",
            "content": "Well, I don't like spoof movies and my rating is compared to all the other movies out there. But if you consider this just as a spoof film, well, it does its trick. It has its funny moments and it does manage to decimate the original hunger games movie in a really funny way. If you really like the spoof genre, you might wanna take a look at this. Hardcore Hunger games fans may wanna kill the produces for making this movie. On the whole, this movie does what it is supposed to do - take a movie and take it apart piece by piece as much as you can and put it back in together after destroying each piece (I mean it in a funny kind of way). Anyways, I guess if you keep idealistic expectation from this movie, you won't be much disappointed.",
            "review_date": "2014-07-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Really stupid with some laughs",
            "content": "There are some dumb but funny moments in this movie. It's satire and you can tell a lot of effort was put into the jokes. Some land and others don't. It's well made decently acted (for a parody). Some of the jokes are crude and juvenile but that's part of the fun. Relax, have fun, and enjoy it does what it is.",
            "review_date": "2021-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "83 Minutes of Garbage",
            "content": "Before I watched \"The Starving Games\" last night, I had never before watched a parody film. And now, after having watched the aforementioned film (if one can even call it that), I probably never will again.This so-called \"comedy\" now has the dubious distinction of being the only movie from said genre to fail at evoking so much as even a chuckle from me. This isn't so much a film, as it is a collection of gross-out gags, terrible special effects, and dated pop culture references.If you're looking for a decent comedic plot, look elsewhere, because the plot of \"The Starving Games\" is basically non-existent. The only way the \"plot\" of this \"film\" will make any sort of sense is based on the viewer's prior knowledge of \"The Hunger Games\". The direction of the film is downright horrendous and it is a wonder that Aaron Seltzer and Jason Friedberg continue to make these atrocities. The dialogue is absolutely terrible and some of the cringe-inducing jokes are repeated ad nauseam. Never before has a movie had me cringing the entire time I watched it. However, if I had the ability to give this movie a zero out of ten, I wouldn't. The reason for that is because of Maiara Walsh, who plays our heroine Kantmiss Evershot. Despite being stuck in one of the worst \"films\" ever made, she has the potential to break free from this side of Hollywood and even showcases a bit of talent, if only for brief flashes.Filled with pathetic attempts at humor, a nonsensical plot, terrible writing and directing, and mostly wooden acting, \"The Starving Games\" is the worst \"film\" I have ever seen. Never before has a comedy film failed to make me laugh. Do yourself a favor and watch anything else out there. It's bound to be better than this abomination (unless it's made by these guys.)1/10",
            "review_date": "2014-07-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "a nice movie but not that funny",
            "content": "I saw this one Recently i d'ont like it very mush.\nFrankly, it was not a big film but even less than average.\nTechnically the movie was a joke and Artistic It was average.\nI laughed a little when watching the movie.\nThe black point was the bad acting and an maybe the average directing.\n4/10",
            "review_date": "2018-01-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's great it was shot in LA",
            "content": "They could have embraced the badness. They could have used MST3K guys to narrate. Instead they tried to kinda tell a story via special defects, like old school after affects. The body paint was good, and the acting wasn't bad. Maybe it's used for something cool like money laundering breaking bad style...80% shot with extra queazy cam, at least through first half.",
            "review_date": "2022-03-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I'm sick to the stomach (Part 2)",
            "content": "I do NOT like how they (Kantmiss and Peter) had the 's-word'. That's just disgusting! In the original movie, they just cuddled for warmth so Haymitch would send them food and medicine. I HATE how they decided to add the Avengers, Annoying Orange, and the Angry Birds. I didn't even watch the movie and I already feel like slapping everyone who was part of this production.I totally agree with the critics and Rotten Tomatoes. The people who actually like this movie either haven't watched the original series or are in a different reality.",
            "review_date": "2018-12-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I'm sick to the stomach",
            "content": "I was reading the plot, and felt nauseous reading it. It's an abomination of a well-crafted movie franchise! I'm disgusted.",
            "review_date": "2018-12-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "content": "Look, if you're not in the mood for a stupid movie this sucks, it has no merit. But if you and you're friends want a stupid and silly movie to watch it's honestly so funny in the dumbest way possible. If it has the correct context it's amazing.",
            "review_date": "2023-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was incredible hilarious would recommend for immature people like me go watch it tonight",
            "review_date": "2023-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful, the greatest movie of our generation. Truly inspirational.",
            "review_date": "2023-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "if you didn't like this you are lying to yourself",
            "review_date": "2023-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "absolutely fantastic, so long as you don't take it too seriously",
            "review_date": "2023-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think that the so-called \"Starving Games\" is a really bad rip off of the \"Hunger Games\". If you want to watch something better I suggest you watch the Hunger Games.",
            "review_date": "2023-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't believe the comments that rate this movie 3/10 (or lower), this movie is a 7/10 at least, (10/10 from me). Individuals with such low rating have no sense of humor. This movie had me ROFL since the very beginning. The original Hunger Games movie was understandably too serious at certain parts of the film, such as \"I Volunteer as Tribute scene\". While watching this scene and others all I could think of \"wouldn't it be funny if this and this happened\". I'd share these thoughts with my friends and we would have a good laugh at the movie theater. What's interesting is some of the spoof movie ideas my friends and I had were portrayed in this movie, such as - what if two tributes were to enter a sexual intercourse in the Arena? Forget the life & death/ survival tools from sponsors such as spile or sleeping syrup. What if some sponsor were to send them condoms?? To have their romance take a completely different turn on live television. In a real world that's how it would happen. And such scene actually occurs in the Starving Games between the Katnis and Peeta parody characters. Hilarious. Watch this movie, on a bad day or if you really want a good laugh. 3/10 rating for this film is highly inaccurate and individuals that gave this review have no understanding of what spoof comedy is.",
            "review_date": "2023-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was better than disaster movie (by a lot) it was still dumb as any spoof film by Jason Friedberg & Aaron Seltzer. It was funny at times still and I'd recommend if your down for watching a spoof movie and being high/drunk. It's just stupid-funny, but what'd you expect.",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A hilarious parody of a great movie. However no the best effects.",
            "review_date": "2022-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you are younger you'll definitely find it way funnier then an adult. It is more teenage comedy and I found it really funny to watch ´.",
            "review_date": "2022-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hello! This Goofy Ahh Review was written by Lilratshat. I was forced to write this by berny sanders spy drones. It took 69 hours, so please don't IP ban me. Without further ado I present Lilratshats Starving games Review! (Pls Unban Sophia Mcshitty K thx)\n\n\n\n\nThe starving games are by far the worst movie I have EVER seen. Anyone who participated in this should really be ashamed. The starving games could be compared to a boiling steaming rotten runny pile of fresh shart. It's so bad, that I want to give myself 69 swirlies in a gas station bathroom and pretend I'm constipated by screaming my head off, so the whole neighborhood can hear my howls of pain after watching this movie. It was so bad, that I regret spending 91 minutes of my life watching this completely disgusting film. Really, what were the directors thinking… \n\nOn the other hand, people who have watched or read the Hunger Games Movies and books may want to see more. The starving games are a remake of the original Hunger Games, but they are way better. It is like the original movie, but it has more humor and delightful moments, making it quite interesting over the old depressing hunger games. \"I didn't get picked, I didn't get picked, No more Starving Games for me!!!\". This movie is truly one of the best I have ever seen, and I recommend it for all ages.\nThe starving games is a movie about 24 kids who compete in the starving games for a great reward. The fight takes place in an arena, and the children are given weapons. The games are very unpredictable but are loved by the capital people. Children could be attacked by a wide range of creatures, or they could receive weapons ranging from guns to spears or swords. In the starving games, anything goes. The movie features some absolutely golden GEN-Z humor, which makes it a perfect fit. This is a spoof, so if you do not enjoy these types of things, I suggest you do not watch it\n\nThe story is about Kantpiss Evershot, who enters the games in place of her sister who she would protect at all costs. In the games, she meats the love of her life peter malarky. At home, her other love dale will do anything to break them apart, including entering the games and trying to kill peter. President snowballs also wants kantpiss dead, because he believes she will lead a revolution.\nEven though the creators of this amazingly hilarious film were shunned, I still think this is by far the greatest movie to ever exist. Some people just don't understand the plot and the humor. This movie was purposely made to look bad, and I think it does a really good job of conveying that message to the public. Even as a spoof people hate it, but to me, it's really great. People may hate Jason Friedberg, Aaron Seltzer but I think they are extremely good at directing.\n\nThis movie is similar to other movies, but mostly the hunger games because it is a remake that is meant to be more funny and enjoyable. Some people say the original hunger games took inspiration from battle royal, even though the author has repeatedly denied it. Either way, it is pretty obvious that the starving games is a direct copy of the hunger games, except it has different humor, and gets a lot more hate.\n\n\nOverall, I can understand why people hate this movie so much. The humor is extremely childish, which will most likely not entertain adults. Some parts of the movie are just plain bad. The quality is not the best, and there are some flaws and unneeded parts in the storyline. An example would be superheroes at the end who die within 3 minutes. Overall, it's pretty bad. But someone with screwed-up GEN-Z humor would absolutely love it. I think it's good, others may disagree.",
            "review_date": "2022-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is absolute steaming shart but in the best way possible. While watching this movie i felt as if I was watching my ferret vomit out his own feces, this is an amazing movie. The jokes are elegant and I feel the need to run around screaming about how hilariously sussy this was. The acting is top notch, this is much better then the original. The original is actually a horrendous copy of this movie created by Putin's  team of spy drones. The sussy scenes in the movie are ultra realistic and I ship the rat found at 1:18 and the KatPiss (miss) together, they would make a great pair. In conclusion this movie is a cinematic masterpiece, I am so glad my Discord kitten reccomended we watch this because I was in awe at the time and effort put into this suspicious movie.",
            "review_date": "2022-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super epic movie better than squid game",
            "review_date": "2022-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolute waste of my life. Movie references for no reason, and with a moderately based budget of just over 4 million dollars it still had no potential. Dissapointing, not funny at all.",
            "review_date": "2022-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The childish humor rears its ugly head right from the beginning and never grows up.",
            "review_date": "2021-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best movie of the 21st century",
            "review_date": "2021-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was so Funny i couldn‘t stop laughting😆😆😆😆",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "comical heaven \nnever laughed so hard at something so dumb 100% recommend",
            "review_date": "2021-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this shit was bussin. it was so funny i found myself searching around me for some hit man because i didnt feel like i was worthy enough to watch this film. youtube free with ads is the sexiest thing ever created.",
            "review_date": "2021-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was so bad it's hilarious. Cringe inducing, but you can't stop watching like a train wreck. Low score for the movie, recommend watching it for the experience.",
            "review_date": "2021-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The cinematography was comically bad, but the directors played on the low budget to create a modern day slapstick comedy. The cheap laughs are reminiscent of the hunger games' own shortcomings as well as those of today's popular television.",
            "review_date": "2021-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing new here.... Move along",
            "review_date": "2020-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hate hunger games, but I love hungry\n games with passion, it has very good and funny characters and script, I love this movie and I watch it every day.",
            "review_date": "2020-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Idk why people hate this so much. I find it comical and sucky. Like it's suppose to be. If you say this film sucks then put a 3+ star. That's what the creators meant for it to be.",
            "review_date": "2020-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unfunny, offensive, gross, dated, cliché, derivative, lazy, poorly acted, silly, ridiculous and overall terrible attempt to be a parody film that should have never been made.",
            "review_date": "2020-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why? Why I do that to myself? Just... WHY?",
            "review_date": "2020-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film for a spoof. I didn't really like all the humour, innuendo and mocking the hunger games too much. Still I do NOT recommend this film that barely made me want to see it again. This film was one of the worst films I've ever watched in my life.",
            "review_date": "2020-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never watch this. You'll waste 1:22:35 of your life.",
            "review_date": "2019-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing so good better than hunger games by a hundredfold! We really need catching on fire and Mocking Jay",
            "review_date": "2019-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's ridiculous, outrageous, and rather stupid, but there's enough weird, obnoxious humor to keep ME entertained, at least",
            "review_date": "2019-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a movie as beautiful as it is funny that has only and only useless and senseless scenes with a few really funny parts, for the most part it is boring ",
            "review_date": "2019-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It does not make you laugh too much, although some laughs, but not the adequate ones and besides that when they want to put a reference they do it badly.",
            "review_date": "2018-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "such a original movie, the ending made me cry though.",
            "review_date": "2018-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The usual horrible schlock from these two hacks. nothing is parodied but is only referenced. You've got people dressed up in costumes randomly walking in just so they can go \"hey look! remember this here thing we're referencing?\" and you have the typical witless fart and toilet jokes.\n\nI wish these two would just go away already. Everyone hates you.",
            "review_date": "2018-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie  ever!!!!! Better than the actual hunger games movies!! Highly recomend!",
            "review_date": "2018-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is great! It is not meant for old movie critics and set out to win oscars. This is a good laugh for teens and is a hilarious take on the hunger games!",
            "review_date": "2018-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lol This movie was so funny XD",
            "review_date": "2017-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I tortured myself watching this movie. UGH!",
            "review_date": "2017-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not to be taken seriously.  Haven't laughed at a spoof like this since scary movie 3.",
            "review_date": "2017-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "F+\nAt least 'The Starving Games' tries to satirize the tropes of the usual Blockbuster movie with 'Spaceballs' levels of merchandising meta-humor, gags at the ridiculousity of action team-ups ('The Avengers', 'The Expendables'), but it is so full of continuity errors that made me baffled over 'Epic Movie' (also directed by Jason Friedberg and Aaron Seltzer), and has gags that barely earn a laugh.",
            "review_date": "2017-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is great if you want to watch a movie that's funny because its so bad. If you want to watch an actually good movie then don't watch this.",
            "review_date": "2016-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unfunny, unpleasant and unwatchable.",
            "review_date": "2016-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "actually a pretty funny parody of The hunger games.",
            "review_date": "2016-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny and entertaining, everything a spoof should be",
            "review_date": "2016-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wtf did I just watch",
            "review_date": "2016-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Starving Games a mockup of The Hunger Games franchise is like all the other spoof comedy movies that make fun of the original. The movie is not great but its ok does justice to the original makes fun of all the right things.\nDo I recommend it not really a movie that does not keep all your attention and you can have a nap in the middles of is not that great.",
            "review_date": "2016-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "please stop making these kind of movies!!!!",
            "review_date": "2016-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "60%     Those who enjoy the overly stupid, silly and ridiculous comedy that The Starving Games dishes out will find plenty to enjoy in this dumb-fest. Those who don't however, will find it is a comedy that is more irritating than funny.",
            "review_date": "2016-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "oh my was this the opposite of a good parody",
            "review_date": "2016-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WOW why the middle finger",
            "review_date": "2016-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Half a star is the lowest rating it allows so",
            "review_date": "2016-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was one of the worst parodies I have ever seen. It wasn't funny, it was cheap and it made no sense!",
            "review_date": "2016-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well this settles it, I can't stand 90% of spoof movies. This had a few chuckles, but the rest wasn't clever or fun or funny or interesting. The costumes and lookalikes were the most interesting thing. I wasted 90 minutes of my life :(",
            "review_date": "2016-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, what a horrible movie. Full of horrible bathroom gags, internet references bound to be outdated by 2017, and about as many laughs as a funeral. This movie would probably fail to make a 13 year old laugh. As if we needed more proof that cinematic parody is dead.",
            "review_date": "2015-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What I got to say about \"The Starving Games\" is an insulting in every meaning of the word, that's how bad this movie is. \"It's not funny at all.. It's horrendous.\" The performances by the whole cast is awful. The directing and screenplay by Jason Friedberg and Aaron Seltzer is unbelievable. The cinematography is okay but could have been much better. Finally, the score and effects are not good at all. \"I have to report that \"The Starving Games\" is not worth watch at all.\"",
            "review_date": "2015-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is by far one of the stupidest spoofs you'll ever see. Do you even consider this a movie? The jokes were unfunny, and the comedy was just plain immature. The acting was alright, though, but the characters were just stupid. Some spoof scenes tried way too hard to be funny, and even just kept dragging along, hoping the audience would laugh. To be honest, I don't recommend this god awful movie to anyone, because trust me: you don't want to watch it.",
            "review_date": "2015-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A parody for people who thought Hot Shots and Scary Movie were comic genius.  This one's just as much a satire of pop culture and America's social media obsession as it a play on Hunger Games.  Besides, any movie with Diedrich Bader is guaranteed for a few hard laughs.",
            "review_date": "2015-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have grown tired of these reference movies that do nothing but make reference to pop culture, it's not funny to just reference it, you have to have fun with it. This movie did have it's pop culture references, but it also put fun twists on many things from the Hunger Games. I loved watching this movie, and I've already watched it a couple times more. I would recommend that it not be completely looked over as an average Friedberg and Seltzer movie, I think they're improving.",
            "review_date": "2015-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wanted to understand why directors Friedberg and Seltzer have such a bad reputation. Now I know. \"The Starving Games\" is downright embarrassing for everyone involved in both the filming and viewing of this film. This is among the worst films I've ever seen and I've seen some notoriously bad films.",
            "review_date": "2015-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible, but at least it's trying to be.  This film knows that it's supposed to suck, and at least embraces this idea openly.  And to its credit, from what I've seen in this, it does have a couple of moments that are genuinely funny.  But yeah, it sucks lol.",
            "review_date": "2015-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the best, I liked it as much as I liked Disaster Movie, but the jokes were going to be extremely obvious, like the middle finger joke, and they used stuff that was popular in 2012 (such as Angry Birds) and thought it would work.",
            "review_date": "2015-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is is a stunning example of integrity and courage. It truly takes an intrepid soul to forge a masterpiece such as this. God have mercy on those who were born without souls, for they are the staunch detractors of this important film.\nThe Hunger Games has got to be the biggest travesty of our generation, and this parody, the scrappy underdog that it is, backs it into a corner and bloodies it up. In the end, the lead-poisoned populace will declare the winner to be The Hunger Games, but the two films know what happened on the battle field. They will both remember who held their ground in spite of all odds and who was valiant only in theory.\nUnlike the Hunger Games, this film does not try to deceive you by making you feel like you're the only one intelligent enough to understand its social commentary, nor does it rely on the mass retrograde amnesia that made the world forget about The Running Man, Battle Royale, or Stone Cold Steve Austin's film that also shared this tired old concept. This film is unabashedly sincere. It is not afraid to take it's place in hell.\nI implore all of the lonely, all of the oppressed, and all of the underdogs of the world to see this movie. Those who prefer to have the world against them will find solace in this film. It is a beacon of hope in a world that takes mediocrity much too seriously.",
            "review_date": "2015-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cheap Cash Grab that does not deserve to be called a Film",
            "review_date": "2015-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funnier and Juicer then expected. This was a good parody of the Hunger games.",
            "review_date": "2015-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was really dumb and wasn't funny.",
            "review_date": "2015-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "http://letterboxd.com/zbender/film/the-starving-games/\n\n\nProbably worse than watching this movie is trying to come up with five sentences for a review. We all know the works of Jason Friedberg and Aaron Seltzer. There was a time where I shamefully would tell you that I enjoyed these films in middle school. How did I? The humor is appalling in every aspect. It's always been lazy, disgusting, abhorrent, idiotic, and quite frankly not worth writing at all about. I picked this film for the scavenger hunt to see if any of the middle school of me resided in there. It died just like how Friedberg and Seltzer's movie careers should have been dead by now.",
            "review_date": "2015-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible picture, terrible screenplay, terrible visual effects, terrible comedy, terrible..., terrible....\n\nEverything is fcking nonsense, full of goofs, and illogical actions. Some scenes repeated (more than) two times.\n\nThe worst move I've ever watch. Really wasting my 91 minutes",
            "review_date": "2015-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very funny at some parts, for who already saw the Hunger Games's first movie,  but poorly acted, predictable and with a lot of cliches that can make us bleed of despair. Weak argument, ridiculous narrative.",
            "review_date": "2015-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very funny at some parts, for who already saw the Hunger Games's first movie, but poorly acted, predictable and with a lot of cliches that can make us bleed of despair. Weak script, ridiculous narrative.",
            "review_date": "2015-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So stupid and cheesy",
            "review_date": "2015-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is absolutely awful. It seems to have been written by 12 year olds. I think they made their money from this in product placement knowing that it wasn't really going to make any money. They must have known.",
            "review_date": "2015-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie ever f you have a weird sense of humor and it is now my fave movie ever mostly because of my jacked up senses of humor lots of sexual scenes though",
            "review_date": "2015-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow so this is a real movie...I thought it was a bad Japanese commercial.",
            "review_date": "2015-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bottom of the barrel stuff.",
            "review_date": "2015-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although slightly more amusing than the average parody, The Starving Games is a horribly conceived comedy that does not deliver more than three or four smirks in its full run. \"Starving\" properly referring on the laughs.",
            "review_date": "2015-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How bad can these jokes get?",
            "review_date": "2015-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i looks kinda low budget in some parts and the movie is not that funny",
            "review_date": "2015-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5 stars, because most people underrate this movie. I found this movie quite entertaining AND frankly it has more logic than the \"hunger games\" and far less plot holes.",
            "review_date": "2015-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There was some absolute crap in this movie (like a rodent on whom they\ndigitally added googly eyes ..) but this movie was just spilling over\nwith joke after joke after joke, most of them lame, but honestly some\nof them had me laughing out LOOUUDD. No comedy has made me laugh that\nhard since I was a kid, 20+ years ago. This was a good comedy. And it\nwas a very bad movie. And a good movie. And I thought it was awful. I\nrecommend it.",
            "review_date": "2015-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't waste your time.",
            "review_date": "2015-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yeah, it's got some silly, funny moments in it. But let's not beat around the bush; this is yet another movie that was set out from the beginning to be a guilty pleasure piece of trash with juvenile pop-culture humor and cartoony gags. \nThe effort in these kind of films is beyond lazy and we need to stop giving them attention, lest they continue to make more like this.",
            "review_date": "2015-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "we really can't stop those two dirty bastards can't we?",
            "review_date": "2015-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh dear, what an awful movie",
            "review_date": "2014-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This isn't a good movie but it's an improvement for Seltzer and Freidberg and I laughed a couple times 98 percent of the jokes fall flat, but I was mildy entertained and chucked a couple times. This is a slight improvement but still An awful comedy.\nGrade D+",
            "review_date": "2014-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was very boring, cheesy, and the jokes just weren't funny. Waisted my time watching this",
            "review_date": "2014-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this movie high but still i didn't even smile once\n.",
            "review_date": "2014-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not worthy to even sit and pay attention, boring, bland jokes, predictable, stupid puns, and painfully unfunny characters.",
            "review_date": "2014-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good example of what a spoof shouldn't be like. No laughing part.",
            "review_date": "2014-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is shit, it's stupid, it's dumb and uninspired but it was entertaining. It was ok to say the least. C+",
            "review_date": "2014-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only watch if you like movies like meet the spartans",
            "review_date": "2014-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So silly, but I guess it'd be entertaining for someone who's into the whole spoof genre; unfortunately I'm not one of them. There were some decent impersonations of the Expendables, in terms of mimicking their voices, towards the end.",
            "review_date": "2014-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Corny just like all the other make fun movies.",
            "review_date": "2014-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some funny moments. But helps if you've seen The Hunger Games first ;)",
            "review_date": "2014-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So very awful and dumb!  What the hell happened to spoof films in the last 20 years?  This is just a train-wreck.  It only gets a few points for a few decent gags.  Still, the majority of it is pure crap.",
            "review_date": "2014-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really stupid but really funny! It's nothing like the book and has avatar, that's weird and crazy. Ketchup entertainment is a cool name and make funny movies.",
            "review_date": "2014-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In this spoof, which is a much better version of The Hunger Games, Kantmiss Evershot (Maiara Walsh) must fight for her life in the 75th annual Starving Games, where she could also win an old ham, a coupon for a foot-long sub, and a partially eaten pickle.\n\nalso stars Brant Daugherty, Cody Christian, Ross Wyngaarden, Dean West, Deidrich Bader, Josep Aviel, Lauren Bowles and Nick Gomez.\n\ndirected by Jason Friedberg and Aaron Seltzer.",
            "review_date": "2014-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My GF wanted to watch this, but had not seen the HG original. I insisted on seeing the HG first. We watched this the next night. I thought the Hg was based on a stupid premise and found this spoof the be somewhat stupid also... but hilarious in many places in pointing out how ridiculous the original was. As far as spoofs go, I thought it was well done and we actually laughed out loud many times. I would normally give it 3 stars, but will go 4 to bring up it's average. I would like to see the directors do another spoof soon (Django Unshackeled?)...",
            "review_date": "2014-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I laughed my butt off.its not supposed to be taken seriously,it's supposed to be stupid.",
            "review_date": "2014-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has enough jokes to make up for its trash plot, but overall it falls into the \"its so bad that its good territory\".",
            "review_date": "2014-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So Dumb that I felt like Crying!",
            "review_date": "2014-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved it. it was so funny",
            "review_date": "2014-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst movie I have ever seen.",
            "review_date": "2014-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was alright, I enjoyed the sattire...however, they were missing Haymitch. Where was Haymitch? He could have been the perv that hit on Kantmiss, Like. What??",
            "review_date": "2014-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just another showcase of why the spoof movie genre needs to die.  While the first two Scary Movie films did their job the rest are less thought out (if that was even possible).  While there are a few laughs to be had I pity anyone who spent money to see this.",
            "review_date": "2014-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Before I watched \"The Starving Games\" last night, I had never before watched a parody film. And now, after having watched the aforementioned film (if one can even call it that), I probably never will again.\n\nThis so-called \"comedy\" now has the dubious distinction of being the only movie from said genre to fail at evoking so much as even a chuckle from me. This isn't so much a film, as it is a collection of gross-out gags, terrible special effects, and dated pop culture references.\n\nIf you're looking for a decent comedic plot, look elsewhere, because the plot of \"The Starving Games\" is basically non-existent. The only way the \"plot\" of this \"film\" will make any sort of sense is based on the viewer's prior knowledge of \"The Hunger Games.\" The direction of the film is downright horrendous and it is a wonder that Aaron Seltzer and Jason Friedberg continue to make these atrocities. The dialogue is absolutely terrible and some of the cringe-inducing jokes are repeated ad nauseam. \n\nNever before has a movie had me cringing the entire time I watched it. However, if I had the ability to give this movie a zero out of ten, I wouldn't. The reason for that is because of Maiara Walsh, who plays our heroine Kantmiss Evershot. Despite being stuck in one of the worst \"films\" ever made, she has the potential to break free from this side of Hollywood and even showcases a bit of talent, if only for brief flashes.\n\nFilled with pathetic attempts at humor, a nonsensical plot, terrible writing and directing, and mostly wooden acting, \"The Starving Games\" is the worst \"film\" I have ever seen. Never before has a comedy film failed to make me laugh. Do yourself a favor and watch anything else out there. It's bound to be better than this abomination (unless it's made by the same guys.)\n\n1/10",
            "review_date": "2014-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think it could of done a better job at being funnier as a parady of the hunger games, but it had some funny moments, it jus seemed a little bit childish at times. I liked the spoofs of characters from other movies like lord of the rings, harry potter and the expendables because they were pretty realistic,  and hilarious.  worth watching if ur in the mood for a goofy comedy, it will be hit or miss for most.. I just thought it was ok.",
            "review_date": "2014-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everyone but Walt died sadly",
            "review_date": "2014-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm serious people. Dead f**king serious people. It's bad. It's really, really, really bad. Jason friedberg and Aaron Seltzer have made yet another fart feast filled with dated pop culture references, disguising and unfunny humor, and over the top nonsense, just they fill the theater with 13 year old's and hopping they get a quick buck out of it. Plus a lot of the actors they had are completely wasted in this and I felled so sorry for them half the time. Now I did laugh at least one or two times in this, but that's not saying much. This is still a very bad film that's I should suggest that you should stay out of it as soon as possible.",
            "review_date": "2014-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not only is this one of the worst comedies I've ever seen, but it is also a complete insult to The Hunger Games license and it perfectly shows what is ugly and wrong about parody films and comedy, in general. Friedberg and Seltzer, for the love of god, stop making these movies! Stop it!",
            "review_date": "2014-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is pretty much worthless...",
            "review_date": "2014-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "has it moments but in all not a great movie",
            "review_date": "2014-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie had a few LOL moments but for the most part its like a lot of spoof movies where the jokes are expected or over the top. My favorite part would have to the bloopers at the end.",
            "review_date": "2014-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(*): [img]http://images.rottentomatoes.com/images/user/icons/icon13.gif[/img]\n\nEven at just over 90 minutes, it feels like it lasted 3 hours.  Very little laughs here.",
            "review_date": "2014-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I HATED THIS MOVIE!!! It was so terrible I drop crap in the toilet every morning better than this!",
            "review_date": "2014-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know what I was thinking when I decided to try and watch this film. Where the Scary Movie franchise at least had a few good laugh, this spoof (I refuse to call it comedy) is one of the worst movies I have ever seen and that says something considering the movies I've seen. (ex: Birdemic, Food Fight, Violent S**t 4) This movie has no humor, is filled with mindless and random pop culture references, and has just some of stupidest things that will make you turn off the movie, go to your bathroom, take a cold shower while still dressed crying your eyes out as you try to process the stupidity you just saw, take the movie, put it in a fireplace, let your dog pee on it, unload a mag of your colt 1911 on it, curse it with the Necronomicon, impale it with your lightsaber, call your friends and do a whole \"Office Space printer-beat-up-montage\" on it, setting it on fire, and giving it the good old one finger salute as it burns until finally crawling into your bed and curling up into the fetal position for about 4 hours.",
            "review_date": "2014-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not going to lie, this is quite possibly my favorite low-budget parody film I've ever seen. Most of the jokes are on the money and catch you off guard just the way they're supposed to. And I'll be honest, even the acting was good. I've seen good actors try and act poorly before but this cast delivered. Speaking of the cast, Maiara Walsh is gorgeous. I hope she can break out of the low-budget niche film market and onto the big scene a bit because she's legit. If you're looking for a serious film, this obviously isn't for you but this is definitely a movie worth watching if you're looking for a cheap laugh or two or twelve.",
            "review_date": "2014-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was pretty dumb and to think it was hilarious, it wasn't. The whole point of this movie was dumb overall.",
            "review_date": "2014-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ever since my school district decided to pick the first book of the Hunger Games as a \"One book one School\" read I had this reaction to this book. Thankfully, someone (the makers of \"The Starving Games\") understood. I loved this movie.",
            "review_date": "2014-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cheesy, but I was in the right mood to appreciate the humor",
            "review_date": "2014-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, but with a few too many gross parts.",
            "review_date": "2014-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "...and the trend of horrible crapfest that Hollywood has been trying to pass off as a spoof continues with this big steaming pile of donkey crap.",
            "review_date": "2014-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Darn you Jason Friedberg and Aaron Seltzer. You guys never learn from your mistakes.",
            "review_date": "2014-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the worst movie I've ever seen in my life.",
            "review_date": "2014-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One line summary: Brings new depth of meaning to the word inappropriate.\n\n------------------------------------\nThe overall level of the humor is really low.  The pinata sequence, for instance, was stupid beyond belief.  The multiple references to excrement were not all that clever, nor were the endless product placements, nor were the face slaps to other movie franchises.  The obnoxious 12-year-old competitor who wanted to form an alliance with Kantmiss seemed more like a target.  The clip where the unarmed Kantmiss kills five armed opponents was ludicrous.\n\n'When are they going to kill each other? I'm getting bored,' was the line that summarised the film for me.\n\nWill there be a sequel to this satire?  Let us hope not.\n\n-----Scores-----\n\n    Cinematography: 6/10 Hand-held sequences were irritating as always, but most of the camera work was fine.\n\n    Sound: 3/10 Besides the many leveling problems, the musical accompaniment was odd at best. \n\n    Acting: 2/10 \n\n    Screenplay: 2/10 Well, it was a satire, so there was not much to expect.  I suppose the hundreds of continuity errors were intentional.  Finishing the film with a long set of bloopers just completed the implementation of 'who cares?'",
            "review_date": "2014-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Darfur, Syria, New Jersey.\"",
            "review_date": "2014-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty much what you would expect.  You have to be familiar with the story or you won't get half the jokes though.",
            "review_date": "2014-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is enough for some laughs!",
            "review_date": "2014-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is funny no joke",
            "review_date": "2014-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So funny... not for the kids!",
            "review_date": "2014-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "so trashy and so good",
            "review_date": "2014-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Starving Games(2012)\nReview\nI can see why it has a zero percent it makes Robert Benginis Pinocchio look good.",
            "review_date": "2014-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just as good as the Hunger Games!!",
            "review_date": "2014-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps the worst parody film I've ever watched",
            "review_date": "2014-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It gave a good try at trying to be like the spoof movies (like scary movie series) but it was not too successful.",
            "review_date": "2014-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "can I give this no stars?",
            "review_date": "2014-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "some jokes one can luagh at i guess, but it fails to keep your attention the whole time",
            "review_date": "2014-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "congratulations, you did it. you made a movie worse than rubber which i didn't think was possible.",
            "review_date": "2014-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "movies not good but Maiara Walsh is much hotter than Jennifer Lawrence in the real hunger games even with the makeup trying to copy Jennifer Lawrence . Im not sure why they cast women like Jennifer Lawrence and Kristen Stewart in Snow White and the Huntsman co staring with a male costar like Chris Hemsworth. Must be so the women in audience can feel like they are at least as pretty as the main star.  Why can't the regular chick films give us guys, eye candy like Maiara Walsh.  I don't mind watching the film, but seeing a guy that's a 10 with a woman that's maybe a 4 is kinda distracting.  Like you keep saying is that really the best you could do?",
            "review_date": "2014-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aside from a few funny and entertaining moments, The Starving Games is an absolute disaster.",
            "review_date": "2014-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An unnecessary film which still fails to even be a good parody. It actually looks like a school project. (D+)",
            "review_date": "2014-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You could sit down with 3 of your friends and write a better parody movie in 15 minutes.",
            "review_date": "2014-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was so terrible, I couldn't even make it through the first 45 minutes.",
            "review_date": "2014-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I admit this was better then I thought it would be. These type of movies have been on the down for awhile now but this made me laugh abit.",
            "review_date": "2014-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just like any other Friedberg-Seltzer \"comedy,\" this is an atrocity in every sense of the word.  Do yourself a favor and stay far, far away from this one.",
            "review_date": "2014-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought it had quite a few good gags, very random. If you are irritated by the hunger games like me, you will love this movie mocking the whole thing!",
            "review_date": "2014-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know why I bother with the director/writers of the new spoofs. I think it's because maybe they will hit a good spoof and make me laugh at least once but the more I watch, the more I feel like my IQ is dropping. Every joke is beyond dumb, the over the top stupidity of the attempt to make something work just doesnt. I feel these guys are worse then Uwe Boll and that is by far hard to do. At least Boll made one good movie that I can honestly say I enjoyed.\nSkip this piece of crap!",
            "review_date": "2014-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I LOLed all the time. But maybe I just had a superficial happiness while watching this. haha",
            "review_date": "2014-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I only laughed when Arnold Schwarzenegger appeared.",
            "review_date": "2014-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't see this, if this movie gets money, we will get part 2 and it gets money and we will get part 3.",
            "review_date": "2014-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is amazing",
            "review_date": "2014-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My question is: How did they get these second rated actors to participate in this Z-movie? Absolute garbage, I actually regretted watching this film. It's like they don't even bother trying to make a good movie at all, just throw in random (lame) movie references. I cracked up for 2 seconds in the entire film about Oprah eating people but that's it. Don't even bother.",
            "review_date": "2014-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that gets old really really fast. The immature side of my brain told me to smile from time to time but that doesn't excuse the film's stupidity. This movie could be an amusing, breezy, and short YouTube skit and I wouldn't mind at all. But considering how it drags on with constant stupid humor spoofing everything popular eventually becomes incredibly unfunny. Its sad to say that movies like this still get made when there clearly isn't a demand for them. I'd skip this one, it'll make you laugh a little, but otherwise its just not entertaining or funny enough to waste 80 minutes of your time.",
            "review_date": "2014-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unlike the decent 'Hungover Games', this is just a very poor spoof of The Hunger Games with pop culture references mixed in.",
            "review_date": "2014-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know why I put myself through these horrid parody movies. They're always so terrible. No wonder why this was straight to DVD.",
            "review_date": "2014-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "★1/2 (out of four)\r\n\r\nA comic and lame version of \"The Hunger Games\"? No, it's not \"Divergent\".  It is the mosly and sadly unfunny spoof of the hit movie franchise.  There is a rare and occasional laugh...not not many.\r\n\r\nKantmiss Evershot (Maiara Walsh) is chosen to represent District 12 in the annual starving games.  She will compete against all the other kids from other districts.\r\n\r\nThe plot is obviously the same as \"The Hunger Games\", but its approach is totally different.  I think the movie franchise is ripe for skewering, but it needs to be actually funny in the process.\r\n\r\n[img]http://content8.flixster.com/rtmovie/10/96/109614_gal.jpg[/img]",
            "review_date": "2014-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(Okay, but not quite the best comedy film)\nThe Starving Games is a spoof of The Hunger Games obviously. There's ups and downs.\nLets start with the ups. The ups is that: It has comedy moments, it can be  funny at times, it has action contained within the comedy storyline, the acting is decent, the special effects and visual effects are both okay and the cinematography was good. The downs is that the comedy moments were not that great or strong. This is 40 is much better. The acting wasn't terrible, but it came off as fake here and there. So it's not one of those great films. It's just your average everyday film. This could be an independent film in my opinion.\nThe casting was unknown to me. I have not seen any of these cast members in any film except this one.\n\nSadly, this film doesn't rank high. It is as we all know it, a pretty low quality film. Laughs are here and there, but there is no wow performances. So all in all it gets a 2 and a half stars for the acting. But for everything else it's a 2 rating. My advice is rent it. But do not buy it. Sorry folks, but to me, this film is bad except for the film's moments of comedy and acting.",
            "review_date": "2014-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was one of the worst movies i've ever seen when it comes to making fun of other films. you're not supposed to try to laugh at something. it's not at all funny.",
            "review_date": "2014-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A partly entertaining, incredibly ridiculously funny and supremely silly spoof flick that manages to pack up most of the randomly inspired set-pieces that a spoof can ask for, even if the ending lands with a thump a bit. A few things are certain, it's better than The Hunger Games and the one of the previous spoof comedies, Vampires Suck!",
            "review_date": "2014-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worth just to see Brant Daugherty. Fucking hot kid. Other than that, it's the basic, \"L.A. made\", low budget produced trash. Not a funny part. Most irritating: Cut scenes of some of the characters \"reacting\" to something that just happened, repeating through the movie several times and not even their backgrounds matching with what was just shown. Terrible.",
            "review_date": "2014-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Here's a bunch of references, now laugh",
            "review_date": "2014-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Help me. I can't stop laughing. Now, I am serious when I say that this movie is incredibly cheesy, but it has a lot of humor in it. Now, unlike my other review where I put it into a bunch of paragraphs, this one will only have three, and the third one starts right now.\n\nHow was the overall camerawork? Throughout the whole film, I was laughing way too hard, but I was able to keep up with every single camera shot.. In short, the camera work was adequate, but not really fit for a true comedic film. I think that there should have been clearer shots especially during the chase scenes, as there were too many blurs.\n\nThis is a fairly short review because I just laughed harder than I should have. If you are looking for a cheesy Hunger Games spoof, and you have a great sense of humor, this film is for you. Give it a try, and may the odds be never in your favor.",
            "review_date": "2014-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's safe to say that no one in their right mind would find any of (this) clever or entertaining. I say SKIP IT!!!",
            "review_date": "2014-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "horrible and amazing",
            "review_date": "2014-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The jokes are not as good.Not so funny.",
            "review_date": "2014-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the 1970's, Mel Brooks and Monty Python made spoof films a fixture in American movie theaters. In the years that have followed, we've even seen franchises like, Scary Movie, Date Movie, Epic Movie, and Superhero Movie, but when was the last time you saw a spoof that was actually any good? Because of my love of the Hunger Games, I actually gave it's spoof a chance and I'm sorry I did. There were a lot of things here that could have been made fun of, but they weren't. The film gets so desperate that they actually turn to Avatar, The Avengers, and the action star of the Expendables, to make the thing long enough to be a full length film. I understand that the purpose behind spoof films is to be so ridiculous, that people laugh at how stupid it is, but there is a point where it is so beyond stupid and childish, that no one finds it funny anymore. The Starving Games quickly crosses this line and doesn't go back. It's a comedy making fun of one of my favorite series of all-time, a series I know like the back of my hand, and I hardly laughed. The only thing this film does well is cast actors who closely resemble the cast of the Hunger Games franchise. Beyond that, the acting is terrible, the jokes wouldn't even make children laugh, and the story is so out there, that eventually you're not even sure what they are doing. While spoofing big movies has become big business, this one does nothing but annoy everyone who was dumb enough to watch it.",
            "review_date": "2014-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "complete and utter garbage.",
            "review_date": "2014-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "remakes of the hunger games smh",
            "review_date": "2014-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its a film that is trying to be bad funny, So in that way it works and I did laugh at how stupid it was - 2/10",
            "review_date": "2014-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was horribly inappropriate, but it delivers some great laughs.",
            "review_date": "2014-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It sucks sucks sucks",
            "review_date": "2014-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kind of dumb, but with a few chuckles.",
            "review_date": "2014-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "54%\n\nNot completely retarded, but almost.",
            "review_date": "2014-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The starving games is an OK parody movie that makes fun out of the Hunger Games and avatar in other movies like The Avengers. Some stuff is funny . Some stuff is pretty stupid.B-(2013)",
            "review_date": "2014-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's so funny and so wrong in so many levels. It's a parody that went horribly wrong. Could have been wonderful if the spoofs weren't 'too' over the top and if they hadn't stopped by at silliness ville so many times. It was painful to watch indeed, but at least it made me laugh... I think.",
            "review_date": "2014-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Knew it was going to be bad but that was the point. Its not any different than Scary Movie and all the others. Why would you ever expect anything other lowbrow humor and fart joke? It got me to laugh and thats all that matters, I'm not watching this for its artistic merit s. Its just a movie thats a spoof and nothing more. Good for few quick laugh.",
            "review_date": "2014-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A complete waste of time... but it did have a small amount of laughable scenes that lasts for 2 seconds...",
            "review_date": "2014-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would rather watch two potatoes fight than see this so called \"movie\"",
            "review_date": "2014-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A parody movie.  This really was not good, the parody movies stopped being good some time ago.  This wasn't as bad as most, though, so... there's that...",
            "review_date": "2014-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spoofs can either be really funny or really stupid... It had it's moments. All in all, a waste of time. Could have been funny... but it wasn't. Disappointing.",
            "review_date": "2014-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely amazing. I laughed all the way through. Anyone who rates less is out of their mind. Best movie ever",
            "review_date": "2014-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My Consensus:\n\nAudience Reactions: The Movie (AKA The Starving Games) is possibly the end of parordies (spoofs) from Seltzerberg which suffers from a Low Budget, unoriginality and a overload on gross out humor that has no point in being here but just to show dumb reactions from the audience in District 12.\n\n53/100 C",
            "review_date": "2014-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing less than a outdated disgusting parody",
            "review_date": "2014-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing but a lame excuse for a comedy.",
            "review_date": "2014-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I went in knowing it would be ridiculos but this movie took that to a whole new low level.",
            "review_date": "2014-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't care what other people say I like when they are in the cave because they  have sexual time and it is very funny I love sex and I am 11 years old",
            "review_date": "2014-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "May be my favorite movie of all time.",
            "review_date": "2014-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You know what, Jason Friedberg and Aaron Seltzer has produced such attrocities of a movie out of it's ass and all of them are bad, even Pauly shore can do better, Suzanne Collins would hate to see a movie like this, There are soo many bad references that it's horrible, This shit is worse than the Permian mass extinction, This game is Starving, because with nothing good in this film to eat!",
            "review_date": "2014-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny but so stupid.",
            "review_date": "2014-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seriously, spoof comedies are NOT going to work these days.",
            "review_date": "2014-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really stupid movie, fun it had some funny parts.",
            "review_date": "2014-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Other people might not like this film but I thought this was hilarious to the point where when I saw the first and second film back to back I laughed all the way through the first one.",
            "review_date": "2014-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm going to lie, a bit of the movie did indeed suck. But of the 4 times or so I've watched it with my friends, our immature minds found extreme comedy from it. There were a few different things I noticed personally that got on my nerves. For example, the re-using of scenes right after each other. For example, /SPOILERS/ the part where she is running from the fireballs, they use the same fireball flying towards the camera over again /CLOSESPOILER/ \n\nAnyway, back to normal reviewing. I personally love spoof movies, as they make me laugh like none other. I mean for gods sake, I loved the movie 'Postal' by Uwe Boll. That's something NO ONE loves. \n\nIf you enjoy crap comedy where you don't have to think and just have to watch and laugh, I highly recommend this movie. The acting was surprisingly good for most of the characters. They at least knew how to act.",
            "review_date": "2014-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I want the Patriots to win against the Broncos, about 35-17.  I don't want NFL to rigged that game for Peyton Manning because that is so overrated to have that football player like that.   I think the charisma, balance, and talent are doing good than last year like Tom Brady, Chad Ochocinco,  Rob Gronkowski, Don'ta Hightower, LeGarrrete Blount, Stephen Gostkowski, and Vince Wilfork.\n\nAnd i think The Starving Games is better than American Hustle and Her combined because Annapurna can't make a original movie and Her is a copycat to Electric Dreams (1984) that should be disqualified for Best Picture.",
            "review_date": "2014-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too stupid to give a good rating, but too funny to give a bad one. May not be for everyone, but the cheap gags are a guilty pleasure.",
            "review_date": "2014-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie! Absolutely loved it it laughed so hard",
            "review_date": "2014-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review:\nThis movie was totally not funny. For a spoof movie, I was expecting at least a couple of laughs, but the director must have been about 2 years old because the whole thing just seemed immature and silly. The only thing that a found a little amusing was the Pink bearded Mr. T lookalike, but that was about it. Some parts go really over the top, and make you wonder if they actually watched the movie before they brought it out, which was why it went straight to DVD. You won't be seeing most of the actors again, so there isn't much to comment about there performances. At the end of the day, it's just another spoof movie. Disappointing!\n\nRound-Up:\nAs there dint that much out on DVD, I thought that I would give this movie a go, but I knew what to expect. I didn't really pay that much attention to the film after a whole because I just couldn't find anything funny. There are a few references to some other movies like The Avengers and The Expendables, but the director didn't do that much with the material. If you want loads of laughs then this is definitely not the movie for you, but if you want to play \"Name That Film\" then you should give it a go. A total waste of time and budget.\n\nBudget: $4.5million\nWorldwide Gross: N/A\n\nI recommend this movie to people who are into there spoof movies, but don't expect much from this a Hunger Games piss take. 2/10",
            "review_date": "2014-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched it with my brother and his friends and they enjoyed it but I didn't really see the joke. In my opinion, it is a silly movie that will only tickle teenage boys due to its toilet and sexual humour. There were a couple of tiny bits that I thought mildly humourous, but the rest of it was like - ok? So in conclusion, if your looking for a silly film that your sons/brothers/boyfriend will like then this is the one (but only if they're young teenagers), but if you're looking for a genuinely funny film to watch with the whole family, this wouldn't be a wise choice.",
            "review_date": "2014-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i usually give this type of movies a try since you can get some cheap laughs in some of them. this is not the case.",
            "review_date": "2014-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've seen better spoof movies... It was good enough for me to watch to the end",
            "review_date": "2013-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A funny movie from the guys who created Date Movie, Meet The Spartans, Vampires Suck and Disaster Movie. The Starving Games has really funny, stupid and amateurish scenes, but in a spoof movie that is not always a bad thing. I really enjoyed it.",
            "review_date": "2013-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "2009 Was 4 Years Old In 2013.",
            "review_date": "2013-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great. More crap from Jason Fuckwad and Aaron Shitface. It's sad to see that there are people in society who like this shit.",
            "review_date": "2013-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow is kantmiss Jennifer Laurence' sister she was good, Oscar worthy",
            "review_date": "2013-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny and awesome story, also \"Huge Janis\"l lol",
            "review_date": "2013-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my opinion this was much better than I thought it was going to be. It made me laugh quite a lot but there were some really crude humour that wasn't that funny.",
            "review_date": "2013-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This has all of the problems of a Friedberg and Seltzer movie. There are too many references, too many poop jokes, too much product placement, and too little plot.\n\nSo why did I give it a 2?\n\nThree reasons:\n\n1. There is more violence in this movie than the actual Hunger Games movie\n2. The love triangle is handled better here\n3. There are glimpses of actual satire in this. One joke made me laugh out loud which is more I can say for most of the other comedies this year",
            "review_date": "2013-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good as a movie to watch with the guys and a few beers",
            "review_date": "2013-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I feel like lambasting the duo of Friedberg and Seltzer has gotten to the point of beating a dead horse. I've been railing against their misbegotten sense of comedy (really just pointless and soon-to-be-dated pop-culture references) for years, declaring three of their terrible spoof movies as my worst film of that year. There is no love lost between me and these two men, and yet I feel the sense to restrain my ire when it comes to their latest, The Starving Games. It's another witless comedy caper, this time using the popular Hunger Games series as its skeleton to hang its desperate jokes upon. These guys don't know what parody is, don't know the particulars of comedy and how to build and payoff a joke. It's the same pattern of ineptitude that will never change. Yet while sitting through all 80 laborious minutes of Starving Games, I felt like Friedberg and Seltzer have come to the realization that the end is nigh for their spoof careers. This last movie didn't get a theatrical release and the production values look chintzy even for them. They used to crank these lousy films out one a year; hell, in 2008 they gave us two. Now they've released two in the last five years. Usually they'll pack a celebrity or, barring that, MadTV alums. Even those are absent. That's right, even this movie couldn't snag a MadTV alum or D-list celeb. Perhaps, as I'd long prayed, the public has grown sour on Friedberg and Seltzer's misunderstanding of comedy and matured enough to realize that pointless references are not the same as parody. In all fairness, I did laugh two times in The Starving Games, both related to Diedrich Bader as President Snowballs. The lead actress, Maiara Walsh, displays a lot of potential. She's a good comic actress, has a tremendous smile, a memorable face, and sturdy poise to slough through this mess. She deserves a better movie and more opportunities.\n\nAt this point, you know what you're getting with Friedberg and Seltzer, and that's all you're going to get. However, I just looked online and discovered they have two movies scheduled for release next year, one a Fast and Furious parody (goody), and the other an honest to God spoof-free straight comedy. I'll be fascinated to see what these two have to offer when it comes to non-spoof comedy, but their background fills me with equal parts dread and derisive excitement. Hey, it can't be worse than InAPPropriate Comedy, could it?\n\nNate's Grade: D",
            "review_date": "2013-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aside from seeing Maira Walsh in a bra once, this has absolutely nothing going for it.",
            "review_date": "2013-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No punchlines, no joke alright? I am just gonna say that this movie is dogshit. I ragequit the damn thing around 25 minutes in because it was so damn bad. It could've been a great Hunger Games parody but instead it became a sex joke and slapstick filled diarrhoea on a stick.\n\nWasted potential. Then again, what could you expect from the Epic Movie and Date Movie team?",
            "review_date": "2013-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pointless, stupid, yet so stupid its funny. As in I laughed at how bad it was.",
            "review_date": "2013-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jason and Aaron really have lost their funny with this low budget nonsense, what we have here is more crude jokes around films and pop culture stuff. If you're thinking getting this on DVD to add to your comedy collection don't bother.",
            "review_date": "2013-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie sucked!!! i wish i could give less than 1/2 star",
            "review_date": "2013-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This spoof or parody written and directed by Jason Friedberg and Aaron Seltzer, creators of other similar \"works of art\" can easily fulfil the criteria for the \"Worst films of the year\". Not many things in this movie were funny, and some of them will make you cry - how low can they go! In this film I could recognize The Hunger Games, Harry Potter and the Deathly Hallows - Part 2, Sherlock Holmes - A Game of Shadows, The Avengers, Avatar, The Great and Powerful Oz, The Hobbit - An Unexpected Journey and The Expendables... but I wish I didn't. This was a movie made on a lowest possible budget: it was around $4.5 million dollars, and the shooting lasted only one month! \r\n\r\nIt kind of goes without saying that the writing and direction here is abysmal, with the only bit of coherency coming from the viewer's prior knowledge of The Hunger Games... If you like to lower your IQ, and to be annoyed by bits in the movie that aren't satirizing the source material, instead merely pointing at it and saying, \"Hey, remember this?\" - watch it! I already wasted too many words on this... enough.",
            "review_date": "2013-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now I understand why I never watch any of these spoof movies. There were some parts that made me laugh but overall it was gratuitous and stupid.",
            "review_date": "2013-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's exactly what you would expect from a Friedberg/Seltzer film...just another hit-and-mostly-miss comedy film with little to no brain used in viewing [C]",
            "review_date": "2013-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As with all their movies, this was another completely unfunny film that had a far better looking cast than the real Hunger Games. Bonus points there, but holy God... why are these people allowed to put this crap out!?!? I have actually farted funnier lines!",
            "review_date": "2013-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mildly entertaining and worth an occasional chuckle.  Keep in mind that this is a parody that is not to be taken seriously.",
            "review_date": "2013-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was exceptional , I really liked what they did to it. Def better than HAUNTED HOUSE and this years movie spoofs. I believe this is gonna be a string of spoofs that will get better ratings than other sagas.",
            "review_date": "2013-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I always knew this was going to happen eventually but I just didn't expect it so soon.",
            "review_date": "2013-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Apple iPhone Siri? Seriously? Siri-ously?",
            "review_date": "2013-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even less tolerable than \"Vampires Suck\", watch \"The Starving Games\" only if you want to say, \"This movie is awful,\" every ten minutes.",
            "review_date": "2013-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst parody ever!",
            "review_date": "2013-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay, I'm not gonna lie. Yes, it does have some funny moments in there, but an endless amount of pop-culture references (including the movie they're parodying), and gross-out and very subpar humour outweigh the rest of the film.",
            "review_date": "2013-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At this point among filmdom (or whatever you choose call it film planet, film world, film committee, etc.) it's common knowledge to avoid anything by the duo of Aaron Seltzer and Jason Friedberg. These two greatest contribution to cinema have always the years they didn't release a film. Unfortunately at this point in these the duo along with the people giving them jobs refuse to use their brains make a competent comedy.\r\n\r\nThe Starving Game is about Kantmiss Evershot fighting for her life in the 75th annual Starving Games. Like the duo previous films its plagues with the same issues; outdated film references, no comedic consequences, no pacing, non existence plot, absent of characters, to stupid to make fun of, beating a dead horse with every joke, and wasting the audience time. That's the whole film in a nutshell, but where it fails the most is being a basic parody of \"The Hunger Games\". It does not understand the definition of the word parody. That would have been asking to much from the writers who predict Lady Gaga will become president in the future. Instead of poking fun the film \"shaky cam\" by simply having a film crew capturing the action why not make a semi-political allegory on the Hollywood system downgrading intellectual properties. Then again, asking for actual minimal effort from the writers that only use \"The Expendables\" and \"The Avengers\" as throwaway gags instead of actual participants is a bit too much to expect. Now that I think about it that would have been a whole lot better, but who am I to judge the brilliance of movie where Kantmiss missing Peter as a giant cake next to her in the middle of the woods. Well to the writers credit they did copy the stupidity of that scene from the actual movie...though that's not a good thing either since it had no punch line in its delivery. Much like the film structure it seems my brains cells were not present in this paragraph. \r\n\r\nNarratively how does it all play out? If you seen \"The Hunger Games\" try to imagine the same plot points only brain dead slowly killing your brain cells being filled with unfunny overused jokes. Kantmiss offers herself to participate in the Starving Games (although everyone looks well fed, another miss point to satirize), Kantmiss faking her romance with Peter, underdeveloped little girl who helps Kantmiss gets kicked to death (let that sink in), underdeveloped romance, Kantmiss and Peter in a standoff finale. Talk about being uncreative stealing directly from the source material this duo is \"satirizing\". I will admit this film did make me laugh one time with a fake commercial for a hamburger (a mixture of pizza, ice cream, buns, vegetables, and other things). However, that joke is soon forgotten when M.I.A. appearce play the earrape known as \"Sexy and I Know It\" and the I don't understand humanity anymore popularity of Gangnam Style being killed off. Not that these musical references (including Taylor Swift) have no comedic purpose other than being completely superficial to the film just like its creation. Filled with incoherent sight gags, fart jokes, pointless pop culture references, and anything you could imagine from a duo set on destroying any fiber of humor. At least the acting talent despite being given awful material are okay. Diedrich Bader, bless him, who despite the godawful material he's given, still commits to his every line. Likewise, star Maiara Walsh has brief glimpses of talent, but they're usually spoiled a few seconds later by whatever cheap trick the movie has her doing next (like bird poop being thrown at her).\r\n\r\nThe Starving Game like it title will suggest leaves it does not fill its audience stomach for comedy. Saying this is for the lowest common denominator is an insult to the lowest common denominator. Even at under 83 minutes it fails to have enough material to support itself let alone entertain an audience. In vein of a bad rehashed sequel the duo rinse and repeats every mistakes they committed unable to comprehend the basics of how comedy works.",
            "review_date": "2013-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfectly stupid and funny.",
            "review_date": "2013-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good parody with plenty of laughs,",
            "review_date": "2013-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An obviously idiotic film. But still offers some entertaining gags",
            "review_date": "2013-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too stupid but laughable..",
            "review_date": "2013-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you liked Vampires Suck, then you'll like this movie as well. The plot is about as high brow as a midget with hypertrichosis. That being said, I loved it. An hour and a half of 2 to 3 minute sketches strung together into something resembling a proper movie.",
            "review_date": "2013-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is absolutely one of the worst movies of the year competing with titles like Sharknado and R.I.P.D. This movie tries way too hard to be funny and just isn't! If you want a good spoof movie, watch Scary movie 2 or Not another teen movie! Go anywhere but here guys",
            "review_date": "2013-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible excuse to make a few greens. Literally like nails on a chalkboard trying to watch this in its entirety.",
            "review_date": "2013-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A pathetic attempt as a spin off from the Hunger Games. If the twilight spoof movies weren't bad enough, they had to attempt to take the \"mick\" out of one of the greatest franchises of our time. It has very bland acting, humour that was crude and stupid, and a extremely bad choice of names for each character \"Peter malarchy\" \"kantmiss evershot\" \"dale\" I mean, seriously! They were just trying too hard... I certainty do not recommend this movie.",
            "review_date": "2013-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the parody has some points at times, you just cannot excuse the awfulness of the film.",
            "review_date": "2013-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ha ah I love these daft comedies",
            "review_date": "2013-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "don't care what anyone says, i found this one funny, i really like friedberg and seltzer's work, i find them super funny.",
            "review_date": "2013-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Actually, Maiara Walsh should be a better \"Katniss\" than Jennifer Lawrence.",
            "review_date": "2013-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hahaha, that ending is more realistic.",
            "review_date": "2013-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Describing this movie as the work of Satan is just an understatement.",
            "review_date": "2013-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I do not want to talk much about this movie. The one thing this movie has going for is that it is the front runner for the worst movie of the year, and I thought Vampires Suck was bad.",
            "review_date": "2013-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It can be worse ?????",
            "review_date": "2013-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok this was pretty dumb but I still laugh at it cause wow they will spoof anything now won't they but it had it's moments of really come on",
            "review_date": "2013-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring and painfully unfunny.",
            "review_date": "2013-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cannot give 0, but if ever a  movie deserved it, this is the one.  Completely unimaginative and not funny at all.  Jokes are grossly outdated in some instances and in others, the actors are trying too hard to get the laugh.  The movie as a whole tried way too hard to make light of a film most people love and it does not accomplish that goal.  What is does accomplish: spoofing every movie of the last year to some extent, even if only for literally a brief second, and not in a successful way.  Credit goes to the look-alike characters, some are indistinguishable from their counterparts.  Overall, a 0/5 and a movie i would recommend no one waste money on like i did.  This movie needs to die and soon.",
            "review_date": "2013-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not so much a \"film\" as \"83 minutes of terrible things happening on a screen.\" This is literally the worst parody ever made! Terrible story, terrible ending, terrible everything! It's not even funny, it's lame... I haven't laughed at all during the movie. If you want to spend 80 minutes watching this lame shit go ahead, but I would not recommend it for everyone...",
            "review_date": "2013-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Trailer looks hilarious! And the main people look like the originals. WTF is with all the trash talk? If you don't like spoof movies, don't watch them!  And this movie isn't even out yet! What's the benefit of writing crappy comments when you don't even like the idea, and don't want to see it?  Have you nothing better to do?  So tired of people just bitching in these comment sections with no constructive feedback or intelligent opinions.  Give the film makers and actors a break- they are just trying to make a living, and lots of people enjoy their efforts.",
            "review_date": "2013-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's too soon for a spin-off, and too late for satire like this to be considered imaginative.",
            "review_date": "2013-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "dumb but somewhat funny!",
            "review_date": "2013-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would rather watch two potatos fighting than this movie...",
            "review_date": "2013-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I never really had plans to see this, but with nothing better to do on a Sunday, I decided to rent it. Thankfully, I has a free rental so I didn't waste any money on this garbage. After sitting through Scary MoVie earlier this year, I thought that the spoof genre couldn't get worse. I was wrong. Friedberg and Seltzer (some guys that mainly make spoof movies and don't have a good movie to their names) shoot out as many boring pop culture references and gross out gags as they can and try to pass them out as a comedy. However, most, or maybe even all, of the jokes don't work and make for a painfully bad time. After this, I'm hoping that I never have to hear about those two morons ever again.",
            "review_date": "2013-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wish I had my hour and twenty minutes back.",
            "review_date": "2013-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stupid and funny! I laugh and chuckle. It funny like Scary Movie series!!",
            "review_date": "2013-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not bad, but not good. It was just strange more than anything else.",
            "review_date": "2013-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "there's never a single moment in this movie that comes close to funny.",
            "review_date": "2013-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst movie of the year. This movie does not try to being funny it feels lazy and not smart.",
            "review_date": "2013-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Your lack of comedy is disturbing.\r This movie is a bust, after five months it will be forgotten with all the other meaningless parodies(Most were made by the same people, be original, guys!). Ever since the mainstream \"Scary Movie\" inYour lack of comedy is disturbing.\r This movie is a bust, after five months it will be forgotten with all the other meaningless parodies(Most were made by the same people, be original, guys!). Ever since the mainstream \"Scary Movie\" in 2000(Which was good, actually) parodies have been nothing original, same slapstick-turned-wired comedy and randomness that does not seem so random anymore. It seems like that overtime, the genre has been losing what sense is left in the plot and focusing on parts that will make you say \"What the f*ck?\" and then laugh with your friends. This movie(along with other parodies) are not meant to be watched alone, but with friends, then talk about the funny parts with other friends and so on. Overall this movie lies within all the other parodies of the 2000's- A conversation starter.",
            "review_date": "2013-11-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is one of the worst movies ever made. I have no problems with parodies but if they were done bearably, \"Scary Movie\" franchise got down the hell but for the most part it was passable. \"The Starving Games\" seems like those YoutubeThis is one of the worst movies ever made. I have no problems with parodies but if they were done bearably, \"Scary Movie\" franchise got down the hell but for the most part it was passable. \"The Starving Games\" seems like those Youtube parodies that are noticed when the movie goofed is forgotten.",
            "review_date": "2014-03-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Alright, I'm serious here. I found this funny at some parts. Some jokes reek of utter unfunnyness but some jokes make me laugh. If you're easily amused (like me) you might like this a little bit. If not, it seems like you'll despise this movie.",
            "review_date": "2014-07-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "if you dare to watch this, watch with absolute vodka to kill the pain because This movie is absolute garbage! probably the worst movie that has graced our eyes this year Scary Movie V was unfunny but the startwas pretty hilarious, movie 43if you dare to watch this, watch with absolute vodka to kill the pain because This movie is absolute garbage! probably the worst movie that has graced our eyes this year Scary Movie V was unfunny but the startwas pretty hilarious, movie 43 gave me a few laughs here and there..BUT THIS!? REALLY?! DONT WATCH THIS  DISASTROUS PILE OF GARBAGE!",
            "review_date": "2013-11-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I am sick of seeing this film!!!! My 8 year old thinks it's hilarious & has made me sit through it on numerous occasions. Personally I would rather gouge my eyes out with a rusty spoon, it really is that bad! Don't bother watching it, do theI am sick of seeing this film!!!! My 8 year old thinks it's hilarious & has made me sit through it on numerous occasions. Personally I would rather gouge my eyes out with a rusty spoon, it really is that bad! Don't bother watching it, do the dishes instead!",
            "review_date": "2014-01-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If you think the Starving Games is a great Hunger Games spoof, something's definitely wrong with you. At least take your time to watch it again to prove how bad this movie is.",
            "review_date": "2016-02-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is so terrible that it made me laugh at it. Does that count as a good movie?This is one of the worst movies i've ever seen, of course, but...that's why I love it.I can't rate it too high or too low. I'm so confused.",
            "review_date": "2021-04-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If you think this film might be alright, you might want to seek therapy, if you have friends that want to see this film, check them into an insane asylum, if you get tickets to this as a gift or a prize BURN THEM and post them on Twitter.If you think this film might be alright, you might want to seek therapy, if you have friends that want to see this film, check them into an insane asylum, if you get tickets to this as a gift or a prize BURN THEM and post them on Twitter.\r This film is an absolute abomination, its a cringeworthy fest from start to finish made by the same guys who did Date Movie, Epic Movie, Meet the Spartans and Disaster Movie who recycle the same jokes with pointless references and prop gags, and they haven't gotten any better with out of nowhere poorly animated Angry Birds and a pointless PSi appearence with no context whatsoever.",
            "review_date": "2013-11-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Poor CGI, poor acting says it all doesn't it? One would think that after a couple movies the directors would be better but boy was I wrong. Don't get me wrong though, the movie has it's moments such as when a bad spoof of the Annoying OrangePoor CGI, poor acting says it all doesn't it? One would think that after a couple movies the directors would be better but boy was I wrong. Don't get me wrong though, the movie has it's moments such as when a bad spoof of the Annoying Orange appears, would be much better with the original one. There were a few jokes that made me laugh but all together the movie was not fun.\r It's supposed to be a comedy movie but making poor jokes, poor spoofs is not the right way. When The Expandables crew appears it's just plain stupid as the guys playing the crew can't even act specially not \"Chuck Norris\". This movie is not worth the time and if you think you're gonna have a blast, think again.",
            "review_date": "2013-11-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I'm not going to lie, this is quite possibly my favorite low-budget parody film I've ever seen. Most of the jokes are on the money and catch you off guard just the way they're supposed to. And I'll be honest, even the acting was good. I'veI'm not going to lie, this is quite possibly my favorite low-budget parody film I've ever seen. Most of the jokes are on the money and catch you off guard just the way they're supposed to. And I'll be honest, even the acting was good. I've seen good actors try and act poorly before but this cast delivered. Speaking of the cast, Maiara Walsh is gorgeous. I hope she can break out of the low-budget niche film market and onto the big scene a bit because she's legit. If you're looking for a serious film, this obviously isn't for you but this is definitely a movie worth watching if you're looking for a cheap laugh or two or twelve.",
            "review_date": "2014-06-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Mildly funny, but I still strongly dislike it. Better than Disaster Movie, and that's, a step up.",
            "review_date": "2020-04-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "My review:\r Waste of money, time and breath.\rCalling this a comedy is dishonest for other good comedies.\r [I am just filling this area because Metacritic wants so.]\r [Thank you for your attention]",
            "review_date": "2014-11-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "i usually give this type of movies a try since you can get some cheap laughs in some of them. this is not the case. so give this one a pass and check out something else",
            "review_date": "2014-01-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Wow, this is literally the dumbest thing I've ever seen. After the first few minutes you can tell how bad it's going to be. Only 2-3 funny moments in an hour and a half long movie. Most of it was spent with my face in my palm.",
            "review_date": "2014-03-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "What has happened to movie parody's? Its gone from being a legitimate genre, thanks to movies like Airplane and Austin Powers, to this!\r In all honesty I am not quite sure how the creators get away with almost copying a movie scene forWhat has happened to movie parody's? Its gone from being a legitimate genre, thanks to movies like Airplane and Austin Powers, to this!\r In all honesty I am not quite sure how the creators get away with almost copying a movie scene for scene without infringing on some sort of copyright, unless the addition of random pop cultural references makes it OK.\r The only positive is the acting is better than other similar movies.",
            "review_date": "2014-07-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I watched for 25 minutes, i then threw the film in the trash, the acting is forced and terrible, the effects are extremely sub par, and overall it makes for a incredibly none funny film, it is just plain bad.",
            "review_date": "2013-11-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "In the 1970's, Mel Brooks and Monty Python made spoof films a fixture in American movie theaters. In the years that have followed, we've even seen franchises like, Scary Movie, Date Movie, Epic Movie, and Superhero Movie, but when was theIn the 1970's, Mel Brooks and Monty Python made spoof films a fixture in American movie theaters. In the years that have followed, we've even seen franchises like, Scary Movie, Date Movie, Epic Movie, and Superhero Movie, but when was the last time you saw a spoof that was actually any good? Because of my love of the Hunger Games, I actually gave it's spoof a chance and I'm sorry I did. There were a lot of things here that could have been made fun of, but they weren't. The film gets so desperate that they actually turn to Avatar, The Avengers, and the action star of the Expendables, to make the thing long enough to be a full length film. I understand that the purpose behind spoof films is to be so ridiculous, that people laugh at how stupid it is, but there is a point where it is so beyond stupid and childish, that no one finds it funny anymore. The Starving Games quickly crosses this line and doesn't go back. It's a comedy making fun of one of my favorite series of all-time, a series I know like the back of my hand, and I hardly laughed. The only thing this film does well is cast actors who closely resemble the cast of the Hunger Games franchise. Beyond that, the acting is terrible, the jokes wouldn't even make children laugh, and the story is so out there, that eventually you're not even sure what they are doing. While spoofing big movies has become big business, this one does nothing but annoy everyone who was dumb enough to watch it.",
            "review_date": "2014-03-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Aaron and Jason are two people who clearly don't know how to make a film. The Starving Games is a parody of The Hunger Games and a really bad one. It's like watching Katniss sh*t on Conan.  This film is horrible and made by the people whoAaron and Jason are two people who clearly don't know how to make a film. The Starving Games is a parody of The Hunger Games and a really bad one. It's like watching Katniss sh*t on Conan.  This film is horrible and made by the people who made Date Movie, so don't watch it period.",
            "review_date": "2013-11-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Usually, people on Metacritic with a review under 3 have a personal hatred and biased opinion towards what they review. But when a movie as bad as The Starving Games comes out, all the 0 and 1 reviews are shared. Only time will tell whenUsually, people on Metacritic with a review under 3 have a personal hatred and biased opinion towards what they review. But when a movie as bad as The Starving Games comes out, all the 0 and 1 reviews are shared. Only time will tell when Jason Friedberg and Aaron Seltzer decide to stop making awful parodies of great movies and kill themselves.",
            "review_date": "2013-11-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Essentially yet another Seltzerberg film (after Vampires Suck, which premiered in 2010). This, like all of their other films, manages to use the same, tired formula of referencing every film from the last 18 months with little to no satireEssentially yet another Seltzerberg film (after Vampires Suck, which premiered in 2010). This, like all of their other films, manages to use the same, tired formula of referencing every film from the last 18 months with little to no satire done whatsoever and whatever satire they try to do results in infinitely worse gags that only make the viewers realize how good whatever films and media being spoofed are thanks to lazy, nasty slapstick. You might think that in the 3 years between this and Vampires Suck their creativity and talent improved, but no, it just gets worse. To sum all o f this up. Seltzerberg is the Christian Weston Chandler of film, and their movies are their Sonichu, as they written with neither creativity nor talent. It seems that when they decided to direct a film, they looked over to Christian Weston Chandler for help and instructions on how to write and direct a film.",
            "review_date": "2013-12-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Actually, although one of the worst comedies ever, it tries hard to make you laugh, it doesn't technically succeed but you giggle a bit throughout, not because it is funny, but by how bad it is. The \"special\" effects are anything butActually, although one of the worst comedies ever, it tries hard to make you laugh, it doesn't technically succeed but you giggle a bit throughout, not because it is funny, but by how bad it is. The \"special\" effects are anything but \"special\", the characters are annoying and insulting to the protagonists of the spoofed movies. Is it recommended for everyone? No, it is hardly recommended for anyone, it is one of the worst, but if you are dying to watch it, it is only 69 minutes without the 7 minutes unnecessary bloopers. Avoid.",
            "review_date": "2014-03-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The sixth directorial effort from the serial killers of the spoof genre writer-directors Jason Friedberg and Aaron Seltzer, tackle a  sci-fi hit \"The Hunger games\" the title  \"The starving games\" is not clever it's witless, the acting isThe sixth directorial effort from the serial killers of the spoof genre writer-directors Jason Friedberg and Aaron Seltzer, tackle a  sci-fi hit \"The Hunger games\" the title  \"The starving games\" is not clever it's witless, the acting is terrible and the film is pointless. The humor in the film barely gives the  laughs, the filmmakers put effort in trashing it, instead of putting it into the script. Okay the film does have a few chuckles but it's replaced with dumb characters and it's one liners. Grade D-",
            "review_date": "2015-06-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Unwatchable. A mess of humor, acting, story, and everything cinema has worked an entire century for. I had to take a long, cold shower after watching this. And the worst thing is there will be more of these.",
            "review_date": "2014-07-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Nothing memorable, just complete stupidity.  Although it could be actually very funny at some points, nothing clicks and it's just a garbage film.  Easy to make fun of.Rating: F",
            "review_date": "2018-04-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Did you know that this movie was made by a teenager who won the lottery? That was a joke, a joke that I hope was funnier than this entire movie. Sure, there are a few genuine laughs, but those don’t make up for the sea of forced pop cultureDid you know that this movie was made by a teenager who won the lottery? That was a joke, a joke that I hope was funnier than this entire movie. Sure, there are a few genuine laughs, but those don’t make up for the sea of forced pop culture references and crude jokes that Cartoon Network would be above. If I can give the filmmakers props for anything, it would be that the sets and costume designs look very much like the ones from the original film that this one parodies, “The Hunger Games”. Bottom line don’t waste your time on watching this.",
            "review_date": "2021-11-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Honestly, this movie has some decent writing. Its so bad it’s good. It’s like Spaceballs in the sense that the jokes are so unfunny, that it’s funny. The CGI is so bad it’s funny. All in all, it’s a great parody",
            "review_date": "2023-01-30",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "rt_rating": 2.3,
    "rt_summary": "Spoofs \"The Hunger Games,\" \"Avengers\" and Harry Potter.",
    "meta_rating": 1.7,
    "meta_summary": "Set in the most depressing corner of a post-apocalyptic future, our hero Kantmiss Evershot (Maiara Walsh) volunteers to take her manipulative younger sister's place in the 75th annual Starving Games. In doing so, she must leave behind her smoldering just-a-friend Dale (Brant Daugherty) and team up with the geeky baker's son Peter MalarkeySet in the most depressing corner of a post-apocalyptic future, our hero Kantmiss Evershot (Maiara Walsh) volunteers to take her manipulative younger sister's place in the 75th annual Starving Games. In doing so, she must leave behind her smoldering just-a-friend Dale (Brant Daugherty) and team up with the geeky baker's son Peter Malarkey (Cody Allen Christian) in a fight for her life. But wait, there's more! She could also win an old ham, a coupon for a footlong sub at a six-inch price, and a partially-eaten pickle! [Ketchup Entertainment]… Expand",
    "vibes": [
        "latter",
        "unfair",
        "predictable",
        "satirical",
        "impossible",
        "ripe",
        "rare",
        "random",
        "minor",
        "angry",
        "worth",
        "immature",
        "elegant",
        "suspicious",
        "unknown",
        "sexual",
        "fat",
        "frequent",
        "vulgar",
        "adequate",
        "pointless",
        "uphill",
        "bad",
        "irreverent",
        "rough",
        "successful",
        "ridiculous",
        "aimless",
        "due",
        "messy"
    ]
}