{
    "rating": 9.3,
    "release_date": "2004-02-12",
    "num_reviews": 170,
    "genres": [
        "Drama"
    ],
    "summary": "Cahit (Birol Ünel) stumbles from bar to bar in Hamburg, Germany, lost in an alcoholic haze. The boozy Turkish immigrant crashes his car into a wall, which lands him in a mental institution. There he meets the suicidal Sibel (Sibel Kekilli). She convinces him to marry her, because otherwise her family will arrange her marriage to a Turkish man of their choosing. She proposes a deal to Cahit: She will cook and clean for him and they can see other people. Thus begins their strange romance.",
    "reviews": [
        {
            "content": "First prison I've ever seen with wall-to-wall carpeting.\n\nHead-On is an example of a particularly well-trodden Hollywood premise (a mismatched couple in a marriage of convenience legitimately falling in love) and making it a legitimate drama - contemporary social conflicts, humor and barbs in equal measure, and protagonists with flaws that highlight a sense of realism without sacrificing their likability. What makes the film work most of all is the time dedicated to allowing the characters to grow as a direct result of their exposure to one another, transitioning from a slapdash engagement to a genuinely complementary dynamic that sees the two fluttering between longing, perplexity, affection, and melancholy. There's a degree of legitimate suffering in the film that makes the audience actually invested in the fate of the two characters without feeling exploitative; when the pair are left in a hotel room conversing in short, pained sentences, writer-director Fatih Akin earns that moment. Really solid performances from Birol Ünel as Cahit and Sibel Kekilli as Sibel. \n\nObligatory \"HEAD-ON: APPLY DIRECTLY TO THE FOREHEAD.\" (3.5/5)",
            "review_date": "2022-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, that was quite a movie. I'm not sure what to say so I'll give a quick rundown. The cinematography is awesome, so is the acting. The storytelling on the other hand, can be a little difficult to follow, though its not so bad as to ruin the movie, and in a way gels with the chaos of the characters lives. \n90/100",
            "review_date": "2021-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The characters are so self destructive that it's hard to watch at times, but it's rewarding. The kind of movie that sits with you a while.",
            "review_date": "2020-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two despicably selfish characters, yet it is their selfishness that reminds us so often of ourselves...",
            "review_date": "2017-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lovely characters in despair, lives full of contrasts. Pace changing from frenetic to slow, just like the incredible music, in order to give you an even better idea of the clash between cultures.",
            "review_date": "2016-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest film of all time. Not for everyone.",
            "review_date": "2016-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very raw and emotional love story.",
            "review_date": "2016-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "someones misery depicted at it's best form and one of the best non-English movies ever ?",
            "review_date": "2015-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Head-on\" (Gegen die Wand), is one of those films that you won't probably find in your local cinemas. This film made by Fatih Akin, German citizen from Turkish inheritance, made the perfect mix of tradition and culture in this story. Two self-destructive people, that made a convenience marriage by her requirement to escape from her parents' home breaking the tradition, to live a more occidental style of life. The story has an end that is far different from the typical Hollywood romantic drama. Is very original the music group that play during the film around every 15 minutes of footage, linking with the story.",
            "review_date": "2015-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have seen this film by mistake, as I messed up with the program of my favorite cine club. Never a mistake was so welcomed.",
            "review_date": "2015-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is a cinematic rush from the first frame to the last one... True film experience - see it! :-)",
            "review_date": "2014-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jaw dropping movie from a young German-Turk director!!!!!!!!!!!!",
            "review_date": "2014-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting and intense movie about two people who meet, love, and live on.",
            "review_date": "2014-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The power of Akin's film, which is considerably aided by the two lead performances ... comes from the spectacle of people developing feelings for each other even through numbing layers of mutual narcissism, self-loathing and raging terror of intimacy.\"",
            "review_date": "2014-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe this film was too raw and edgy for me to truly like it but I will acknowledge that it is a very interesting film with some extraordinary commentary about immigrants and cultural identity. Here two misfits fall eventually fall in love through extenuating circumstances despite being stuck in the in between space between Turkish and German cultures. Certainly not for the faint of heart.",
            "review_date": "2014-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this movie is overrated. First problem: the main character is ridiculously underdeveloped. Very few detail of his past is revealed to the audience. Second problem: the relationship between the two characters is underdeveloped also. Yes, every guy can understand jealousy when it comes to your partner's relationship/sex with others. But how did he fall madly in love with this woman? because she fixed up his apartment and made him a couple of nice meals!? And then, the lead woman character turns from a wild character to a normal woman. that transformation itself is believable given what happened to her, but, again, no detail is revealed to the audience as to the process of transformation. The movie certainly has very dramatic moments. But i got the feeling that they were there just for the sake of having dramatic moments. But they didn't tie together or to a larger story. But hey, maybe that's life. A lot of stuff happens without ever making a huge sense or impact on your life. The music is used effectively to double the drama of the moment. Camera work is awesome. But at the end of the day, I think this movie is overrated. and to be honest, I think a reason for that may be that it has lots of nudity/soft porn. It's worth a watch.",
            "review_date": "2013-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great acting with a fantastic script.",
            "review_date": "2013-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "was a lil _ initially thinking it was \"just another love story\". but this german-turkish offering was more than that;  liked that it didn't attempt to tie everything up nice and pretty. \nthat sibel kekilli chick is ridiculously attractive , and why does she look so darn familiar too?",
            "review_date": "2013-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "we can say it's complicated.",
            "review_date": "2013-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fatih Akin's stylish drama that fearlessly mixes sexuality and suicide is set in the Turk community of Germany and is about two young Turks getting married for convenience so he can get a young and cute housecleaner and she can move out of her oppressing traditionalist Muslim household. There are contrasting cultures and themes in this film which create drama but do not sacrifice a poingant dose of black humour, as well as compelling and crude visuals of violence and sex.",
            "review_date": "2013-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can I tear my eyes out now?",
            "review_date": "2013-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Head-On really isn't afraid to go to places most films about love wouldn't touch, thus making it fresh, and thought provoking",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ozil will cry while watching this ...",
            "review_date": "2013-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I suppose I just don't get it. Suspension of disbelief is just impossible in this case. I dig the message this movie is trying to convey and all...",
            "review_date": "2013-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "are you thirsty\nyes pal,\nthen y r u drinking beer,drink water\ni'm not an animal.....!",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Winner of the Golden Bear at the 2004 Berlin Film Festival, This is not just another typical immigrant drama, Impressive with good  perfs",
            "review_date": "2012-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fictitious movie, about self destructive Turks in Germany, I did not get it, didn't believe plot, Turkish girls wants to have have sex with strangers, but family too conservative, so she gets married to a stranger with an agreement that she will just screw around? Hmmm, who would take a deal like that? They fall in love guy gets jealous and kills someone goes to jail....They lost my interest in the plot. Lotta nudity, sex, drunken, drugged out darkness, I swear I saw the ghost of Ayn Rand in it...her philosophies and influence all over this movie..",
            "review_date": "2012-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of those, How did this get in my Netflix queue movies.  It's a strange movie that often feels like two different movies. The first half feels like a black romantic comedy and then the second half goes totally dark.. I didn't love it, but especially the first half kept my attention.",
            "review_date": "2012-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "T.T when that \"'ll wait for you\" fails.",
            "review_date": "2012-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(*** 1/2): [img]http://images.rottentomatoes.com/images/user/icons/icon14.gif[/img]\r\n\r\nIntriguing and well-acted.",
            "review_date": "2012-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This overrated and overestimated movie disappointed me a little: too many sex scenes, too little of turkish culture, but the annoying choir in the movie, flagging a change in time and space. I though Sibel was at first a sort of lunatic, but at the end she makes the right choices, and my sympathy went to her. I found Cahit a little too influenced by Mickey Rourke life, something the director maybe didnt even think about.",
            "review_date": "2012-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "have a sense of an ending. Sad",
            "review_date": "2012-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harsh yet soothing tale of two self-loathing narcissists who find a way to cope with themselves.",
            "review_date": "2012-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "PLEASE SEE THIS FILM! You have those movies that immediately have all your attention from the start. This movie is one of them. A really great opening that set high expectation that gets delivered! It is a modern love story in a sad and difficult part of the European society. It's really special that it doesn't get sentimental during this (nicely) long story. Perfect performance by Birol Ãnel and Sibel Kikulli who turn the good script into a moving movie. The music combines very well and underlines the right emotions.",
            "review_date": "2012-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Germany and Turkey, two countries, one with no identity and the other one with a strong one. Two quiet different cultures with different traditions and rules. There's four million Turks living in Germany, and one of them is Fatih Akin who made this film called Head-On which is a film about the strong Turkish identity and how it's affecting them in a country that is far from their native mother land, and how it don't prevent them from following the religious dogmas and rules about family honor from their country.\n\nCahit Tomruk (Birol Ünel), an alcoholic homosexual Turkish immigrant has just ended up in a hospital after a failed suicide attempt where he drove a car right into a wall. On the hospital he meets a young Turkish girl in her early twenties, Sibel (Sibel Kekilli). She's also there because of a suicide attempt, in order to escape her extremely traditional parents. She then ask Cahit to marry her so that she can get her parents of her back. Cahit is against it at first, but agree's on the condition that they both can live their separate lives. But after all Cahit begins to develops real feelings for her, and she does the same, but one day Cahit hits Sibel's former lover with a bottle out of anger, and he ends up in jail, while Sibel who is now a dishonor to her family is in danger of being killed by her own brother. She then escape to Istanbul to live with her cousin Selma, but her longing for Cahit makes her want to ease the pain by using narcotics. How will it end? Is there any light in the end of the tunnel?\n\nHead-On is a heavy lightning down to earth dark film about individuals who have given up on life and have sunken as low as possible. It sort of reminds me of a Rainer Werner Fassbinder film in that way that we follow the lowest creature in the Hierarchy, pretty much like in Fox and His Friend where a young hustler who finds himself in company with a bigger elite, and is out of touch with this community and don't fit in. It's the same in Head-On, only this time it's all about Cahit's Turkish identity that is the question when he's involved with a family of Turks, while Cahit's Turkish is kind of rusty. He is out of touch with his own Turkish Identity, basically he doesn't belong anywhere.\n\nSibel is like Cahit, a rebel. But she doesn't have the same background, plus she's also more pubertal, because she's grown up in a more liberal society than her parent's. She wants to brake free from her family traditions, or as she herself put it \"I want to live, I want to dance, I want to fuck... and not only with one guy\". But she also get to see for herself what to much harm freedom can do to a person.\n\nWhat's so special about Turkish/German films is that their Motherland is always in their mind and is sort of like a place for escapism. Head-On is a strong film about this Turkish identity and how it effects people's lives. It show us how low a person can sink because they want to deny who they really are. Head-On clearly shows this in a brutal way by drug abuse and adultery. It's a strong film, well crafted by a great screenplay and some marvelous realistic acting, specially by the two leads Birol Ünel and Sibel Kekilli who have such a great chemistry that every actors should have. A big thumbs up from me.",
            "review_date": "2012-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love can redeem a wasted life, even if it doesn't last.",
            "review_date": "2012-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good film in every means possible ... but left me with a negative impression ... not because of a certain thing that bothered me ... but simply I wasn't fascinated by the film",
            "review_date": "2012-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good film in every means possible ... but left me with a negative impression ... not because of a certain thing that bothered me ... but simply I wasn't fascinated by the film",
            "review_date": "2012-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A convincing immigrant story that provides an elegantly portrayed reflection on the parent culture - Turkish - and how this is also reflected in Germany. Beautifully, sensitively made story that can only end unhappily.",
            "review_date": "2012-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant film. The story revolving around the relationship between two marginal Turkish migrants in Germany is heartbreaking and uplifting at the same time. I found the characters' struggle with their own personal demons and the new challenges placed before them by their unfolding relationship very captivating. Should be required viewing.",
            "review_date": "2012-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Turkish-German cinema has reached a great turning-point. Gone are the days when the films produced by Gastarbeiter directors pointed a huge, dirty finger of blame at Germany for the troubles of the Turkish community. Gegen Die Wand takes the original approach of blaming the problems of the inability of Turkish people to come to terms with their own identities. Thus, despite being a German film, set in Germany, with much German being spoken, this film is essentially Turkish in spirit. It's about two Turkish Germans who live very different, but similarly restricted lives. Sibel is restricted by her ultra conservative and traditional family, whereas Cahit is restricted only by himself and his addiction to drugs and alcohol. Sibel, desperate to break away from her patriarchal family, begs Cahit to marry her. Eventually, he does and so begins a vicious tale of star-crossed lovers. I don't want to reveal too much about the film's plot, but it's excellent and engrossing.\n\nThe acting in Gegen Die Wand is exceptional. Birol Unel is tremendously effective as Cahit. He speaks German like a German would and speaks Turkish with a heavy accent, perfect for his role of a Turk who has lost all sense of Turkish identity. His is a tough, grotesque role, but he plays it really well and is definitely one of the memorable parts of the film. Sibel Kekilli also gives a stellar performance in the film. She plays a character who switches between her German and Turkish identities as it suits her and this ever-changing attitude is reflected well by Kekilli's acting. The supporting cast is less effective but that's only because their role in the film is quite a bit smaller than those of Cahit and Sibel.\n\nAkin, as a director, is undoubtedly excellent and his direction in this film is first rate. He delves right into this controversial subject matter and is not afraid to make deep, influential statements about anything he has an opinion on. In the \"Movie Info\", it states that Akin is a \"German-born Turkish filmmaker\". Well, no, he's actually a German filmmaker with Turkish roots. He said himself about this film that it is \"a German film with a Turkish soul\". These words describe it better than anybody else could do.",
            "review_date": "2011-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "âHead-Onâ\u009d or âGegen die Wand,â\u009d the 2004 Turkish-German film, is a sad recounting of self-destructive behavior, deception, and gratuitous violence in a relationship among Turkish-Germans that ultimately leads nowhere.  Its receipt of European film awards merely tells how differently some of the folks over there must view the world.",
            "review_date": "2011-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most original and complex love stories put to film in the last ten years (alongside Eternal Sunshine of the Spotless Mind and Y Tu Mama Tambiem). Head-On is by turns brutal yet blackly humorous, blatant yet ambiguous, minamalist, yet epic, and tragic but ultimately life-affirming. Those that have a Netflix account are well advised to catch this while it's still streaming.",
            "review_date": "2011-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strong, sad, funny. You got it all in this movie.",
            "review_date": "2011-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most realistic & powerful love story. A near perfect movie.",
            "review_date": "2011-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What happens  when two destructive personality joins together in a bizarre relationship ??! One day this simple yet powerful psycho analytically socio drama yet a powerful but simple one will be considered as a landmark of movies new arena, mark my words. In love with 'Fatih Akin', a wildly talented gift to us in this recent brainless time ! one of my top favrts..",
            "review_date": "2011-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not bad, I just didn't always sympathize, I guess.",
            "review_date": "2011-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"If you want to end your life, end it. You don't have to kill yourself to do that.\"\nI didn't expect it to be as intense as it was. This is easily Akin's most graphic film yet still one of his best.\nPlot: Cahit and Sibel are Turkish immigrants living in Hamburg. Cahit is an alcoholic drug addict and Sibel comes from a family that strictly follow Turkish customs and are extremely religious. Both have tried to commit suicide before. To break free of her family, Sibel and Cahit marry. At first they don't love each other but as time goes on their love for one another begins to grow, but so do their problems.\nDirected by Fatih Akin( The Edge of Heaven, In July, Soul Kitchen), Head-On is one of those intense dramas that sticks with you. With subject matter dealing with attempted suicide, sex, and jealousy, there are a few disturbing and very intense scenes. But despite it's graphic content, this is still a film that shouldn't be missed. The characters are solid and evolve greatly over the course of the story. The problem now a days is that by the end of the movie the character is the same person as he or she was at the beginning. This is not the case in this. This is just a very original film, have none of the Drama/Romance clichÃ (C)s. There is something about all of Akin's films that make them so interesting to watch. This is supposed to be Akin's best work, but I found In July to be better. Total score: 9.2/10",
            "review_date": "2011-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic German drama about two troubled Turkish people who meet in psychiatric out-patients and get married mighty quick to escape their lives.  Both leads are magnificent, compelling despite their flaws, and the story packs a punch thats hard to forget.\r\n\r\nOne star deduction as I'm still hoping for a drama with a strong sexually-independant female lead who DOESN'T get raped somewhere along the line.",
            "review_date": "2011-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outstanding love story!",
            "review_date": "2011-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films I've ever watched. Who said foreign movies suck?",
            "review_date": "2011-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My first Fatih Akin film and I am already struck by the unique & powerful style.The chaotic cultural flavor dominates the movie and is aided by Akin's eclectic choice of background score and slapdash camera work and when two tempestuous characters doomed for destruction are thrown in the mix, you have in your hand a roller coaster ride of love and tragedy.",
            "review_date": "2011-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wow, amazing movie. all the praise for the director Fatih akin.",
            "review_date": "2011-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hats down to Fatih Akin!",
            "review_date": "2011-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The sure thing about this movie is that it is really intense.Comments about the direction of Fatih Akin are needless and the way that he composed the movie was beautiful.You can see how many social stereotypes still exists and were the pressure from home can lead.Love in his roughest form prevailed.A simply wonderful movie.",
            "review_date": "2011-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully illustrates the principle 'Self-destruction might be the answer' from Fight Club. Great story and acting paired with an absolutely symbiotic soundtrack.",
            "review_date": "2011-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Part of me wishes to rate \"Gegen die Wand\" higher, because the first half is quite memorable and contains great character interactions, but the second half feels so disconnected from the first and takes so long to build up to events that we know will occur anyway that I can't.",
            "review_date": "2011-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Doesn't really take itself seriously enough.",
            "review_date": "2011-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another fantastic film by Fatih Akin. Conflicts between cultures, languages and countries. Superb acting and intense emotions.",
            "review_date": "2011-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Head On collision between raw emotions and harsh reality. Incredible!\n\n\"I feel you, your sun it shines,\nI feel you within my mind,\nYou take me there,\nYou take me where the kingdom comes,\nYou take me to and lead me through Babylon\"",
            "review_date": "2011-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Have no recollection of how this wound up in my Netflix queue, but I'm happy it did",
            "review_date": "2011-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No words. Watch it. -.-",
            "review_date": "2011-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked this movie the most from Akin, no wonder about getting the golden bear. A nice love story built around imperfection, convenience and dead bodies in people,s hidden basement.",
            "review_date": "2011-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How two suicidal can make an awesome love story? Wanna know the answer.. WATCH THIS FILM! \nPersonally I am biased when it comes to love stories.. I say love stories cause, here you won't find romance, so nothing romantic about it. \nYou will be amazed as to how writer and director has covered multiple elements in this beautiful film. \nWhen one loses hope and is thrown to a corner by life, s/he can find someone as alienated as him/herself there.",
            "review_date": "2011-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "impressive modern-cinema movie, perfect casting, great acting",
            "review_date": "2011-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "sprightly and stylish...superbly acted",
            "review_date": "2011-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fascinating story, masterfully told. I was totally blown away by this movie. Fatih Akin is now one of my favorite directors.",
            "review_date": "2010-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i'd never heard of this until tonight when a customer recommended it. glad he did! pretty powerful stuff.",
            "review_date": "2010-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that didn't fall into the \"Genre\" trap. At parts comedy, at parts erotic, at parts violent, & at parts tragic. This \"Folk Song\" film is engaging and marvelously performed.",
            "review_date": "2010-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is not a pretty film, but rather a blatantly harsh portrait of two suicidal maniacs that cross paths with thundering consequences. Sibel and Birol are ferocious together.",
            "review_date": "2010-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A dysfunctional romance with a number of unconventional twists and turns, and a surprising amount of violence (used to good effect). Well worth a look.",
            "review_date": "2010-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ã\u009cnel did an amazing job in this film, as did Kekilli, but the characters were so raw and messed up that, at times, it was hard to actually like this film.  An interesting take on the Turkish immigrant experience in Germany.",
            "review_date": "2010-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rating: 3.6/5. Very good direction by Fatih Akin. Performances are good also by Birol Ã\u009cnel and Sibel Kekilli. It is very raw, straight to the point. I loved the Turkish music pieces in between certain scenes relating to the mood of the film. Watch it!",
            "review_date": "2010-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love changes everything.",
            "review_date": "2010-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This has some very intense performances by Birol Ã\u009cnel and Sibel Kekilli whose characters are debauched, self-destructive Turkish-Germans who decide to marry out of convenience (so Kekilli can get away from her conservative parents) but end up falling in love. The film, I think, portrays German youth hedonism AND Turkish immigrant traditionalism as both fairly empty and stultifying, equally inimical to self-realization.  It is a very compelling film; two main performers make it work and make the  viewer invested in their plight.",
            "review_date": "2010-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jun 2010 - (with Hadi & Bahar) This is an excellent depiction of the turkish immigrants in Germany. Different possibilities for them and how they all get intertwined in a complicated and novel like drama. I loved the musical breaks in the middle of the movie. The reality is boldly presented and the acting is fantastic. The plot is a bit cheesy but if that's the price of showing so much, I have no problem with that.",
            "review_date": "2010-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a bunch of morbid jerks.  I liked the breaks for the traditional Turkish love songs more than the annoyingly gritty grittiness and juvenile bursts of violence.",
            "review_date": "2010-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such touching story of how life can be so unpredictable and precious.  A classic IMO!",
            "review_date": "2010-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just don't see the Golden Bear in it...\r\nMaybe it's my fault that I saw 'The Edge of Heaven' first, because the latter is a million times better.\r\n\r\nWhat makes this movie worthwhile is the mild originality at some parts, though it felt like the theme suddenly split into 2, and I couldn't reflect the songs played by the Turkish band onto the events, maybe I've missed something, but the movie left out too many things towards the end, he tried so hard to be politically correct and not judge the characters, which made me feel so indifferent towards them, especially the girl.\r\n\r\nThere's nothing noteworthy technical-wise, just one scene I really loved when Cahit goes to Selma and talks to her about how he was dead when he met Sibel, it was really beautiful and I wish it had lasted longer.",
            "review_date": "2010-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fatih Akın doesn't mince matters. Frightening film about the 2nd generation of turkish guest workers in Germany. About how they try to find their identity or struggle in doing so.",
            "review_date": "2010-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly a film that has no boundaries. Excellent direction, superb performances and haunting story. Grade: A",
            "review_date": "2010-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Raw and in-your-face movie on how two people from Turkish heritage are bound together in their destructive character. About the immense gap between east and west and the people whose lives are influenced by it. Love Fatih Akin.",
            "review_date": "2010-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very crazy drama.. stunning.. astonishing relationship between a girl wanting to escape her hell life with her conservative hipocratic family and a man who survived an suicide..\r\n\r\nso, finally what happens???\r\n\r\nVery moving",
            "review_date": "2010-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "essentially a film about an attention seeking depressive and her dopey victim. however it's well shot & has some random turkish music inserted every now & then in an effort to make it a bit different... so at least it's not totally boring!",
            "review_date": "2010-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is sad ,heavy but original!!!Perfect performance by Birol Ã\u009cnel and Sibel Kikulli who turn the good script into a  moving movie...",
            "review_date": "2010-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i watched this movie a week ago & i can`t get it out of my head! very good!  i really liked it!",
            "review_date": "2010-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Edgy, gritty, real. A very, very good film and a nice change from all the trite, plastic Hollywood trash that is about.",
            "review_date": "2010-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fabulous. As strange a love story as they get.\nAkinÂ´s Germany is the most interesting slice of Turkey (no pun intended; really).\nWith Akin, you can never go wrong. Hard to pick a favorite, but this one is right up there.\nImpresionante. En Uruguay, videolandia.net y te la llevan a tu casa...",
            "review_date": "2010-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fatih Akin and another great movie",
            "review_date": "2010-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a small gem that really is thought provoking and touches the watcher's feelings.",
            "review_date": "2010-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A shocking and touching story about desperation, self-destruction, friendship, hope, love, cultural pressure & family traditions.",
            "review_date": "2010-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only criticism I have about this is some of the dodgy editing. One of the best films I've seen in a long time.",
            "review_date": "2010-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's \"one of those\" films.",
            "review_date": "2010-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just don't see the Golden Bear in it...\nMaybe it's my fault that I saw 'The Edge of Heaven' first, because the latter is a million times better.\n\nWhat makes this movie worthwhile is the mild originality at some parts, though it felt like the theme suddenly split into 2, and I couldn't reflect the songs played by the Turkish band onto the events, maybe I've missed something, but the movie left out too many things towards the end, he tried so hard to be politically correct and not judge the characters, which made me feel so indifferent towards them, especially the girl.\n\nThere's nothing noteworthy technical-wise, just one scene I really loved when Cahit goes to Selma and talks to her about how he was dead when he met Sibel, it was really beautiful and I wish it had lasted longer.",
            "review_date": "2010-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my most favourite films of all time..Fatih Akin is a master director. \nMy review is short and simple - Go watch the film..",
            "review_date": "2010-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shocking, yes.  Fatih Akin's \"Head-On\" blew me away.\r\n\r\nHead-On (2005) - 9.0/10\r\nDirector - Fatih Akin\r\nCast - Birol Unel, Sibel Kekilli, Catrin Striebeck, Given Kirac, Meltem Cumbul, Cem Akin, Aysel Iscan, Demir Gokgol\r\n\r\nI've watched some excellent films the past month but one film gets the \"wow treatment\", and that's Fatih Akin's \"Head-On\".  Wow, just wow!  I was just completely blown away by this shocking but truly absorbing film.\r\n\r\nSet in Hamburg, Germany \"Head-On\" the story follows two Turkish immigrants.  Cahit (Birol Unel) is a 40 year old boozer and loser who loves punk rock music.  After a drunken binge he crashes his car \"head-on\" into a wall.  At the psychiatric hospital he meets 20 year old Sibel (Sibel Kekilli).  Sibel had just slashed her wrist in a botched suicide attempt.  She just wants to get away from her very traditional, restrictive and conservative Turkish family.  She isn't really interested in Cahit as a husband in the truest sense but needs a Turkish man to marry so she can escape and lead a much more adventurous life.  Cahit, in need of change himself, eventually agrees.  What follows is anything but a traditional love story.  Sibel spends her evenings clubbing, sleeping with other men.  Cahit, when not in a drunken stupor, spends his time with a hairdresser.  Husband and wife don't sleep with each other.  But over the course of the film Sibel and Cahit begin to have genuine feelings for one another.  However the self-destructive nature of each threatens to destroy the one meaningful thing they have.\r\n\r\nWow,  Okay I said that already.  I just think this film is freaking amazing!  Ironic considering neither Cahit or Sibel appear to be likable characters.  And on the surface they are anything but likable.  Cahit is a boozing, grumpy loser.  Sibel is carefree and selfish.  They appear to mix like oil and water.  But beneath the rough exteriors lie two complex and very human characters.  You learn to like them despite all their warts.  And over the course of the film you understand why they need each other.  No this isn't your typical fluffy Hollywood romance.  It's deep, dirty and often downright disturbing.  It's also brilliant and daring filmmaking!  \r\n\r\nThis is my first experience with Turkish/German director Fatih Akin and there will be more soon.  It's as relentlessly honest as it is enertaining.  The film can be brutal and bloody at times, but just when Akin exhausts you emotionally he cuts to an orchestra playing traditional Turkish music by a river.  The music is cheery and hopeful and a welcomed contrast to much of the film.  Late eighties/early 90's music plays a key as well, with songs by Depeche Mode and the Sisters of Mercy used brilliantly.  The acting by the two leads is absolutely stellar.  Birol Unel and Sibel Kekilli are riveting and play off one another extremely well.  It's rare to get two performances this good in one film. \r\n\r\nAkin also does an excellent job of showing how Western culture impacts cultural mores by blending both attitudes and music with traditional Turkish music and morals.  Sibel feels suffocated by her tradition while Cahit has, over time, become so westernized that he struggles to speak his native language.  But over the course of the film Akin shows how important these Turkish roots really are.\r\n\r\nOverall I can't recommend this one enough.  It may be too brutal (and honest) for passive viewers but for those looking for a challenging relationship film \"Head-On\" is well worth a watch.",
            "review_date": "2010-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched 'The Edge Of Heaven' some time ago and could not wait to see another Fatih Akin film. Took me a long while to get there. Head On/Gegen Die Wand is so compelling I clapped spontaneously after it finished. Imagine doing that by yourself in your own living room. This is more than just a drama with sexually explicit scenes. It is a story about love and how it can also destroy you, change your life and take you on a journey where you have no idea what is coming around the corner. It is also a story about migration, cultural compulsions and behaviours and how displaced communities behave, how they connect back to their land of origin and what part that plays in your life. When I think of why Sibel behaves the way she does after Cahit goes to jail is because she is dead for her parents. No love, no support, no empathy-all to maintain family honour. This film took me through all kinds of emotions. From anger to sadness, laughter at the funny moments, exasperation and ultimately reflection.",
            "review_date": "2010-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "too much violence and blood for my taste, but I guess this movie is actually all about passion, and so it all fits in it.",
            "review_date": "2010-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film whose queasy, kinetic euphoria gradually gives way to a different register that's harder to pin down. It's constantly surprising, and romantic in the purest sense of the wordâ\u0080¦ an accidentally perfect Valentine's Day watch.",
            "review_date": "2010-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i stumbled upon this movie on tv, and just couldn't take my eyes off of it. beautifully done.",
            "review_date": "2010-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Head-On is a moving drama about sex, class, culture, desperation, drugs, and many other things. Like most good films, you could probably make a list of over twenty items that could be argued as themes of the film. \r\nThe film is highly stylized, and each scene is very meticulously designed, propped, and colored to render the atmospheric underground world the characters inhabit. The camera work is very well done, focusing the viewer's attention to the realistic aspects of the story. I personally found the interludes of the Turkish music to be a nice touch, probably because I really enjoyed the music of the film. \r\nThe story is well-paced, rife with conflict, and undpredictable yet engaging enough to maintian the viewer's undivided attention throughout. The casting of Head-On is almost perfect. Each character looks, feels, and acts very naturally in their specific role. \r\nThe presence of Western lifestyle and Turkish culture almost become their own characters in the film. These two entities are at conflict with each other, and this clash serves to add depth and specificity to the context of the story.  \r\nHead-On is a fiercely involving drama that will no doubt leave a biting resonance in the viewer, even if they don't \"like\" the film. The level of graphic violence may be distasteful to some viewers, but I thought the violence was artistically rendered and relevant to the story. There were no wasted scenes in this film, unless you consider the Turkish musical interludes to be superflous. But like I said before, I thought the musical interludes made contributions to the film.",
            "review_date": "2010-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very powerful film. I enjoyed this tremendously.",
            "review_date": "2010-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was surprised to see a movie by Turkish director ( Fatih Akin) to show so frankly dark sides of traditional Muslim mentality, to reveal how young Turkish men in Germany manage to combine their traditional believes with dirt speeches about prostitutes. Remember Cahit's question, \"Why don't you guys f-ck your own wifes\" and their reaction? Next to Cahit I wonder how this false and dishonest survives together with tradition and believe. As almost any Russian-speaking man who encounter Chechen guys, I saw similar behavior there.\r\nBirol Unel (who plays Cahit Tomruk) is wonderful actor, Sibel Kekilli (plays Sibel Guner) is beautiful and talented too. They both strike by their frantic characters and their unstoppable will to freedom (Sibel!).\r\nAt the same time, Fatih Akin managed to keep this story very realistic and moral too. I really like this movie.",
            "review_date": "2010-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was surprised to see a movie by Turkish director ( Fatih Akin) to show so frankly dark sides of traditional Muslim mentality, to reveal how young Turkish men in Germany manage to combine their traditional believes with dirt speeches about prostitutes. Remember Cahit's question, \"Why don't you guys f-ck your own wifes\" and their reaction? Next to Cahit I wonder how this false and dishonest survives together with tradition and believe. As almost any Russian-speaking man who encounter Chechen guys, I saw similar behavior there.\nBirol Unel (who plays Cahit Tomruk) is wonderful actor, Sibel Kekilli (plays Sibel Guner) is beautiful and talented too. They both strike by their frantic characters and their unstoppable will to freedom (Sibel!).\nAt the same time, Fatih Akin managed to keep this story very realistic and moral too. I really like this movie.",
            "review_date": "2010-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shocking here and there, but amazing acting, impressive movie!",
            "review_date": "2010-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another good movie by Fatih Akin.",
            "review_date": "2010-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a complicated story about love btw 2 unlikely characters, jealousy, growing-up, self-discovery but worth hanging on til the end.",
            "review_date": "2010-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "oh this movie blew me away...",
            "review_date": "2010-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "as good & emotional as akin's more well-known movie edge of heaven... probably more \"explosive\"... more rowdy... also more blood & violence... many recognizable features of akin's style",
            "review_date": "2010-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Anyone interested in German cinema will not get past this work of genius. Absolutely essential.",
            "review_date": "2009-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Every scene of Fatih Akin's Head-On contains something shocking, something funny, and/or something heartbreaking.  \r\n\r\nAt the risk of divulging too much of the brilliantly simple story and deceptively complex characters, the critic will note that Head-On is a well executed, serious tale of the appeal of self-destruction, the unfortunate gravitational pull of family and cultural mores, the hazards of emotional decision-making, the hazards of emotionless choices, the joy of hedonism, and the perils of hedonism.  \r\n\r\nCahit and Sibel simultaneously rise from the deepest emotional bottoms and proclaim, \"Punk rock is not dead!\"  Head-On is their punk rock love story, as evidenced by the image of the tuxedo-clad groom downing a tall boy before he saunters to his wedding.  He is a uniquely hesitant husband-to-be; neither he nor the open-minded viewer is prepared for the agonizing voyage to catharsis the marriage will facilitate.",
            "review_date": "2009-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The actors in this movie is what makes this movie. I don't think it would be half as good if these roles were played by anyone else. Absolutely loved this film. Beautiful and romantic in such a dark way. I totally recommend this movie to everyone.",
            "review_date": "2009-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I dont like love stories, this was an exception a really good one infact, quite different and much better from what i had expected, the german pop culture to turk culture, excellent performances and direction",
            "review_date": "2009-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow-paced but a well developed drama.  Great cast.  Aside from the musical interludes that annoyed me, there's really nothing to complain about this film.",
            "review_date": "2009-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most realistic picture of Turks in Germany. A generation belongs nowhere. They are neither a Turk in Turkey nor a German in Germany. And that causes a self-destructive personality. And with the characters of the movie, audience heads on to the wall of cultures conflict. Performances are awesome. Especially Birol Unel is spectacular. And Fatih Ak?n, a brave director really.",
            "review_date": "2009-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonder why people are sometimes so crazy.... But if it exits, it is reasonable. You should accept that. But I still feel that it is a drama..... cannot imagine that would happen in the real life.....",
            "review_date": "2009-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptionally well-made film! Fatih Akin brings to cinema his quirky, wild, rebellious side and gives us Head-On. \r\n\r\nAbsolutely stunning camerawork (esp coz most of the scenes were shot with available light), honest performances, interesting premise and brilliant score.\r\n\r\nThis movie defines \"cinematic masturbation\"",
            "review_date": "2009-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My kind of love story two suicidals meet in a hospitol and they marry within days but this is no regular marriage Enjoy!",
            "review_date": "2009-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crazy, weird relationships. I love it.",
            "review_date": "2009-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that hits you in the face, just like the name. I intend to watch it on and off while doing something else, but I end up sitting down and watch the whole film. The ending does make you feel empty.",
            "review_date": "2009-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic performances; intense and definitely not for the mainstream-type audience.",
            "review_date": "2009-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Punk meets Turkish culture. a violent, sexy, and mature movie that shocks the viewer, but overall one of the most original romantic movies in the past years. Provocative and visually fantastic, this is a movie not to be missed.",
            "review_date": "2009-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touching and vibrating!",
            "review_date": "2009-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This being the third of German/Turkish auteur Fatih Akin's films i've had the pleasure of watching, i must say, he has cemented himself in my mind as an exceptionally gifted story-teller. Head-On explores grief, anguish and recovery by exposing us to the sordid life of Cahit who spends his days soaking in alcohol and illicit drugs, only to be met (and suddenly betrothed) by Sibel, a young German/Turk woman who is eager to truly live her life, free of the persecution of her culture. \n\nAkin directs this couple beautifully throughout the film, with no emotion or nuance lost on the audience, leading us down a path of ever growing affection, tainted with jealousy, but grounded in the genuine surprise of new beginnings. The turn of events was saddening, but if there's one thing i can depend on Akin for, it's the realism that Hollywood lacks!",
            "review_date": "2009-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Turkish German director Fatih Akin's fourth feature. Someone recommended his films to me. This one is very \"contemporary\" and very \"European\" film. It's contemporary not only in terms of something visible like the style of cinematography, editing, and the way of portrait of drug and sex, but also in terms of its theme and the director's viewpoint on things like love and culture. The period in which country meant identity of film (\"French\"/\"German\"/\"Italian\"/etc.) in Europe ends, and European Films are getting more and more diverse, and Akin, considering his identity, is probably one of the symbolic figures of it. I feel very good about his stance of telling a story, because he rather makes characters first and lets them move and make a story than makes a story first and puts characters into it as if they are men of chess. I, however, couldn't assimilate myself with characters well, probably because they are people in the world I am not too familiar with... What the film deals with, something universal, does move me, but I could not get into the world of the film much at this first time of watching it. Also, I felt when it gets closer to ending, it seems to be in hurry developing the story, especially episodes of the heroin after she gets to Istanbul are little bit too jumpy. Someday, after I will have visited Turky and Germany, I'd like to watch this again.",
            "review_date": "2009-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How do you say boring in Turkish? Dull and pointless in German? Seems to me the first job of any movie, or any other story, is to make you care about the main character. But who can stand this obnoxious alcoholic? I\u0092ve seen enough self-centered, self-serving, self-dramatizing drunks in real life. I don\u0092t want to see one on the screen, unless the story is amazing. This one is not. What is the idea behind this movie? We\u0092ll show an obnoxious loser who feels sorry for himself and that\u0092ll grab the audience?",
            "review_date": "2009-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "beauty of being on the edge",
            "review_date": "2009-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "for me one of the best german movies ever",
            "review_date": "2009-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the best film i've ever seen",
            "review_date": "2009-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Misleadingly promoted (at least on the UK DVD) as arthouse sexploitation, this is actually a sweet, elliptical, love story set within Germany's 2nd generation Turkish community.  Performances are excellent all round (not just the leads,  the supporting cast too) and the direction is stylish without being obtrusive.  If you like European cinema with a thoughtful bent, this is well worth a look.",
            "review_date": "2009-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i saw Edge of heaven like few weeks ago N this movie was in my mind...i got chance to watch it last week N i shud tell u this dat its an amazing movie....Faith Atkin is definitely one of the best in the world....now I'm waiting eagerly for his new movie(New i love you)...well M nt sure if M gonn like it after watching the original french version( paris i love).....",
            "review_date": "2009-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great soundtrack. Everything about this film and it's characters was rebellious (even the tradition vs contemporary attitudes, music, life), yet not over done. The compassion I felt toward the characters grew, as did my respect for them. It was a very moving and sad love story - I liked that it didn't give me what I expected. I'm not sure if \"Two Lovers\" was trying to tell a similar story, but they ended in a similar way.",
            "review_date": "2009-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a bad effort by Fatih Akin, considering the low-budget video production available. However, this film pales in comparison to Akin's masterpiece \"The Edge of Heaven\", one of the best films ever made. \"Head On\" gains an extra half star for it's sobering ending and a cast of characters that are masters of their game.",
            "review_date": "2009-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intensity. That's the word to describe Gegen die wand. A story about self-destruction, a weird tale about discovering your soul mate, the importance of the \"moment in which someone is and the paths we follow to discover who we are. Passion, violence, the weight of tradition, the yearning for a freedom that is impossible to define but it is far from when you supposedly came from, redemption and love. Rough, edgy, powerful to the extreme and provocative. Astonishing acting and filmaking. Really recommendable.",
            "review_date": "2009-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting plot with great characters. It's about love, hope and changes. The story is touching and pretty brutal and the same adjectives can be used to describe the main characters. The drift of it is great and it gets better and better until the very good ending.",
            "review_date": "2009-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great Fatih Akin movie. Quite brutal though.",
            "review_date": "2009-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Graphic, Graphic movie",
            "review_date": "2009-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An intense love story which starts off wrongly and goes downhill from there. Sible Kekilli somehow overshadows the strong performance of Birol Ã\u009cnel, both purposelessly searching for aimless love. Someone please give Fatih Akin an Oscar!",
            "review_date": "2009-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Full-on! A culture clashing violent mix of sex, drugs and rock 'n' roll with love desperately attempting to put an end to the self-destruction.",
            "review_date": "2009-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "beautifully thought and played",
            "review_date": "2009-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RAW - done well. Hence the five stars. It kept my attention throughout - RARE. There were some parts I felt unneccessary, slightly pointless - but most scenes, poignant.",
            "review_date": "2009-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a hard film to watch - it's way too melodramatic for my taste.  But there are some interesting ideas here, however, the story tries to do way too much and loses its potency.  My favorite thing about the movie was the musical interludes.  The cinematography was also fantastic.  All in all though I was very disappointed because \"The Edge of Heaven\" by Akin was an absolutely brilliant film and I expected more from this film.",
            "review_date": "2009-06-09",
            "source": "rt",
            "lang": "en"
        }
    ]
}