{
    "rating": 9.4,
    "release_date": "2004-12-22",
    "num_reviews": 210,
    "genres": [
        "Drama"
    ],
    "summary": "Hutu Paul Rusesabagina manages the Hôtel des Mille Collines and lives a happy life with his Tutsi wife and their three children, but when Hutu military forces initiate a campaign of ethnic cleansing against the Tutsi minority, Paul is compelled to allow refugees to take shelter in his hotel. As the U.N. pulls out, Paul must struggle alone to protect the Tutsi refugees in the face of the escalating violence later known as the Rwandan genocide.",
    "reviews": [
        {
            "content": "\"Hotel Rwanda is a powerful and moving film that tells the story of the 1994 Rwandan genocide. The film is an important reminder of the atrocities that took place in Rwanda and highlights the bravery of ordinary people who stood up against violence and hate. Don Cheadle delivers a powerhouse performance as Paul Rusesabagina, the hotel manager who risked his own life to shelter refugees from the conflict. The film is emotionally charged and brings to light the important issue of humanity and the responsibility to act in the face of injustice. Hotel Rwanda is a must-watch film that will leave a lasting impression and inspire you to stand up for what is right.\"",
            "review_date": "2023-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite the controversy surrounding the man behind the myth, friendly reminder that Paul Rusesabagina was sentenced to 25 years in prison by Rwanda in 2018, and the UN maintains that he was kidnapped, tortured, and subsequently convicted in an unfair trial. As of today, he is still a prisoner.\n\nOne of the most heartbreaking and brutal civil conflicts in modern times, a narrative of manufactured hatred that boiled over into genocide while the rest of the world looked in the other direction. While Cheadle certainly displays his leading man chops here and the film itself is well-intentioned (bringing American studio money to a major nonfiction event), Hotel Rwanda suffers from being sanitized for mass consumption, sacrificing authentic brutality to avoid turning stomachs so tickets could sell. Rusesabagina feels to be too saintly of a character in this depiction, and the film keeps insisting on drawing him into difficult decisions before offering a lifeline at the last moment that avoids moral complexity or even showing any explicit violence; in a butchering that resulted in hundreds of thousands of deaths, to smooth over these details dulls their impact and the lessons that can be taken from the horror.\n\nExamples of media inciting violence are shown here that Americans seemed so sure in 2004 they would be immune to, which are now making inroads into the mainstream and creating their own culture wars. (3/5)",
            "review_date": "2022-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don Cheadle is undeniable in Hotel Rwanda but the film as a whole feels like it's missing something.",
            "review_date": "2022-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most moving films I've seen. Powerful, wonderfully acted, and thought-provoking",
            "review_date": "2022-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don Cheadle did very well in this movie and while some of the details of the plot may not even be the most historically accurate (if there are in fact any details that aren't), it's still a solid movie that one can easily get emotional over. It's no Schindler's List but even so, the brutality and suffering that the Tutsi and moderate Hutus experienced should never be forgotten and people should be educated on it so that something like this never happens again.",
            "review_date": "2022-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest 02 hours: and 01 minutes ever!!!!!!!! Based on the integration of the segregated Hotel Rwanda in Central Africa!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie helped me to understand what people go through outside of the US cushion.",
            "review_date": "2022-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is chilling and inspiring.",
            "review_date": "2022-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's propaganda film but I still enjoyed it",
            "review_date": "2022-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie a must much for anyone who wants to feel the tragic and emotional weight of the Rwandan genocide.",
            "review_date": "2022-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good movie. My world history teacher showed me it and it was great. I would watch it a second time. Maybe a third. not a fourth tho.",
            "review_date": "2022-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "History Told! fantastic Acting a must see! Keeps you on the edge of your feet the whole time even more so when remembering that this is a true story!!! A classic!",
            "review_date": "2021-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I actually saw this movie in class for a project, I enjoyed it and it was sad to see what was happening to the citizens.",
            "review_date": "2021-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film does a great job helping us to better understand topics such as refugees, interconnectedness, globalization, human rights, and the role of intergovernmental organizations such as the UN. The actors were cast well, and convey the tragedy and desperation present during the genocide.",
            "review_date": "2021-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excellent, emotional film on a horrible horrible subject, but this amazing story had to be told",
            "review_date": "2021-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "74 people who had stayed in the Hotel during the Genocide. Their accounts provide an alternative take to the portrayal of Rusesabagina's actions as seen in the film many of the survivors criticise Rusesabagina in their interviews. this is a very fake and distorted movie.",
            "review_date": "2021-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful film that will really connect with the viewer...Cheadle puts in an exceptional performance...this film wouldn't have made it without him",
            "review_date": "2021-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's cruel & bloody, genocide are sick man... for what? It's all sad story & try to survival",
            "review_date": "2021-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great performances bring this haunting tale to life.",
            "review_date": "2021-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Given current events, this felt like a timely watch. \n\nThis does a great job depicting the senselessness of this mass violence, and it does so by grounding us in the perspective of a Hutu man (Don Cheadle) who desperately leverages his position as a hotel manager and the connections he's made within that role to provide temporary refuge to his family, orphans, and other Tutsi civilians who are targeted by genocide. \n\nThere are really affecting moments in this film: The whispers of \"cut the tall trees\" over the radio when he's driving. Him driving through a dense fog and hitting a rough patch in the road only to find that the bumpiness is because bodies litter the street. Him charging through the hotel looking for his family and then dreadfully realizing that he needs to go to the roof because he told his family to jump if the Hutu soldiers came.\n\nIt's a well-made film that tells an emotionally resonant story with historical accuracy. Can't go wrong.",
            "review_date": "2021-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Set during the genocide in Rwanda, Hotel Rwanda tells the story of a hotel manager and his efforts to provide refuge to those targeted to be killed.  There is some debate as to whether Paul Rusesabagina (Don Cheadle) was a hero or a profiteer, but this is irrelevant in the larger scheme of things.  Hotel Rwanda is a powerful film about mankind's inhumanity to his fellow man and an indictment of the majority of the rest of the world who turned their collective back on the atrocities being committed.  Cheadle gives a strong performance, as does Sophie Okonedo in an Oscar-nominated role as Paul's wife. While not as graphic as one might suspect, the movie remains a powerful indictment of those who failed to act.",
            "review_date": "2021-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is another one of my favourite films that really opened up my thinking and encouraged me to learn about post early 20th century genocides and how they continue to arise in post WW2 conditions.",
            "review_date": "2021-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film recounts the fateful tragedy surrounding the Rwandan genocide in 1994, when the rivalry between the two major ethnic groups, Hutu and Tutsi, escalated into a bloodbath resulting in around one million deaths. The hotel manager Paul Rusesabagina, who took in thousands of potential victims in his hotel and thus saved many lives, became a celebrated hero.\n\nRusesabagina is embodied by Don Cheadle. Initially a successful manager with a homogeneous family life, he is constantly tested by the constant threat of Hutu soldiers against his loved ones. Being Hutu himself, he is never really affected by this threat. Cheadle's fragile performance permanently gets under your skin. His character has to deal with betrayal, impossible choices and sacrifices throughout the film. Cheadle's close acting also means you always buy into his suffering. Sophie Okonedo gives an even more emotional performance as Paul's wife Tatiana. She is constantly intent on protecting her children by any means necessary and suggests this form of fear in a very subtle way. Her chemistry with Cheadle is very authentic and makes this unconditional love for each other very clear. Joaquin Phoenix and Nick Nolte, who plays a commander, don't appear very often but shine in their few scenes with thought-provoking dialogue.\n\nHotel Rwanda brings viewers closer to a subject that has received too little attention and care in world history. This is done in a very extreme way, because some of the images are very hard to watch during the two-hour running time. Therefore, this is not a film that you necessarily have to see several times. It is nevertheless an absolute must-see, as the harsh reality is communicated here to the point. Even tribes from the same country can cause huge damage. The greatest danger does not always come from an external enemy. Hotel Rwanda is brutal, very real and rounded off by its human performances to make a very meaningful historical drama.",
            "review_date": "2021-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I actually loved this movie. I think it has great acting, it is emotionally powerful and the story itself was interesting to me. I think people often judge this movie the wrong way. I believe it is not trying to serve as a documental, so judge it as it is: a movie. If you want a completely accurate depiction of the Rwandan genocide, go watch a documental or read a full report about it. However, I look at this movie as a story that is based and/or inspired from certain events that actually happened in real life. Sure, it uses the same characters (for example, Paul Rusesabagina really exists in real life) but it doesn't necessarily needs to be completely accurate becasue it's a movie. It was great for me. It has moments that make the tension rise a lot, it makes you feel worried at times, and makes you cheer at others. In general, this is a must-see for me.",
            "review_date": "2021-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bunch of lies. In the true story Paul Rusesabagina charged large sums of money from those who sought refuge in his hotel. The Ibuka group of Tutsi survivors has stated multiple times that this film is completely false, and that in reality Paul is a mobster who has already been arrested with international endorsement for financing subversive and terrorist groups (search him on Google).",
            "review_date": "2020-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring, overrated movie. Not worth your time.",
            "review_date": "2020-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's so crazy how they nailed the whole feel of the mid 90's with all the camera work and movement. It feels as if the movie was made in 1994. Jesus that must be terrifying to know that things are going to go to shit at any time and that there's going to be a war fought right in your neighborhood. That's so fucked up how they just left the Africans to fend for themselves while all the white foreigners and UN soldiers fled. It's so fucked up and unfair how the powers of France, Belgium and the U.S. don't want anything to do with what's happening in Rwanda. And I have a sneaking suspicion that it's because it's not profitable for them. \n\nI can never and will never understand the hatred that exists in this world. I don't understand how people from the same place can be so hateful towards the other just because they're from a different tribe and because their skin is lighter. Goddamn, that entire road was filled with dead bodies. That's horrifying. Paul was a hero sheltering all of those refugees in his hotel. \n\nA very sad and tragic moment in history but also hopeful.",
            "review_date": "2020-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a movie it's great for a viewing; but as a story, it must be remembered for as long as there is wrong-doing in this cruel world.",
            "review_date": "2020-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am not sure the script captured enough of the true horror but the performances were fantastic.",
            "review_date": "2020-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "just great, remarkable.. what movies and life are all about",
            "review_date": "2020-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hotel Rwanda is a powerful story of perseverance in the most grim of times, further enhanced with superb acting.",
            "review_date": "2020-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartbreaking, yet leaves me wanting to stir up change.",
            "review_date": "2020-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This drama was great. Don Cheadle and the rest of the cast did a great job in this movie. This movie that's based on a true story was very dramatic and intense. What happened in Rwanda was a real tragedy, but Paul Rusesabagina risked his life to help people survive in a war torn country. That shows a lot of courage. I would definitely recommend this movie. It's worth seeing.",
            "review_date": "2020-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched again 03/21. Such a good moving. Very gut-wrenching. Super intense the entire time. Just a terrible but very moving story. The main guy basically saved 1200 lives. Incredible",
            "review_date": "2019-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mostly intense but not my cup of tea.",
            "review_date": "2019-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie succeeds at conveying the horror of the genocide.",
            "review_date": "2019-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is definitely not a light watch. Full of deep meanings.",
            "review_date": "2019-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gut-wrenching film about the mass genocide that happened in Rwanda in 1994. This movie is incredibly humbling to watch. You want to break down and cry and still are so angry and outraged that this ever happened. It's incredibly well acted, especially by the lead. Im my opinion everyone should watch this movie. ",
            "review_date": "2019-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dons best performance to date and a powerful true story. Inspiring stuff man and very sad. What a messed up world we live in. ",
            "review_date": "2019-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely bad acting. Worst/most boring movie Iï¿ 1/2 1/2(TM)ve ever watched .",
            "review_date": "2019-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best, GREATEST inspiring movie ever made!",
            "review_date": "2019-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Immediately after watching The Killing Fields (1984), Hotel Rwanda made me feel overwhelmed.  Too much genocide, too much sadness about human nature.  Again, we follow a particular individual, Paul Rusesabagina (played by Don Cheadle), as a way of gaining entrance and insight into what otherwise might be a horrific but depersonalised tragedy, full of statistics about how many died but lacking a hand to hold onto.  To show us the Rwandan conflict between Hutus and Tutsis, director Terry George follows Ruesabagina, the manager of a Belgian hotel in the capital Kigali who takes in Tutsi and other refugees, offering them asylum in the hotel (as armed forces and youth gangs hover outside).  Ruesabagina is Hutu himself but his wife is Tutsi, making him a âtraitorâ? in the eyes of the Hutu coup leaders.  He is a wheeler-dealer of sorts, always keeping the power elite happy with gifts and favours â\" but he finds that they are no longer there for him when war breaks out.  Nor are the Westerners who soon flee the country and fail to send aid.  Nick Nolteâ(TM)s UN colonel does his best in an impossible situation but it is Rusesabaginaâ(TM)s quick thinking that keeps (some) people alive.  Cheadle is good in the central role, as is Sophie Okonedo who plays his wife (and a number of other actors in Rwandan parts are also convincing, whether they be corrupt generals, warlords, or hotel workers).  In the end, however, the enormity of the crisis, its woeful tragic effects on innocent people, tends to dwarf the story of Paul and his (Herculean) efforts to save people.  As a(nother) history lesson about what can happen when the world isnâ(TM)t watching (or caring), this is an important document.  And as a demonstration of moral courage in the face of evil, letâ(TM)s hope we could all be so brave.",
            "review_date": "2018-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am not a history buff, and I have a nasty habit of missing out on current events, so I wasn’t all that familiar with this tragic story from Rwanda’s past. While I don’t read up on events like this, I am always fascinated to learn about them in film (even if some of the facts can be slightly distorted in order to make a good script.) Hotel Rwanda is a devastating film because it takes you right into the heart of the Rwandan genocide, and makes you come to grips with the underlying evil that can sprout up in humans. There were a number of scenes that made me sick to my stomach, and I had to keep reminding myself that the reality was probably even worse because they have to sanitize things to some degree in order to show them in a PG-13 film. Don Cheadle gives a great performance as a man who feels caught in the middle of all this tension in his nation. I felt like I was faced with these same moral dilemmas along with him, and his devotion to his family and the people of his nation was admirable. I also thought Sophie Okonedo was excellent as his wife, and she had a lot of tough emotional scenes to perform. Most of the other sympathetic characters were well-acted, and I was surprised how powerful the handful of scenes with Nick Nolte felt. My one complaint with the cast was how little we saw Joaquin Phoenix. His character seemed to have an arc that happens almost completely off-screen, and yet he could have brought something interesting to the film if he was in there more. Hotel Rwanda is not the kind of movie where I would say I enjoyed watching it. It contains a lot of dark stuff, and it’s hard to take when you know we’re just getting a taste of the actual horror that occurred. However, it is the kind of movie I can say I’m glad I watched. Not only was it informative, it also did a good job of honoring a man who did what was right against frightening opposition. This isn’t a seamless biopic, because you can sense some of the creative liberties that the writers took to give it a proper dramatic narrative, but there was enough authenticity in the feelings and emotions to make up for any tweaks that were made. This is the kind of movie we all should watch just to remind ourselves how disgusting hate can be, and the stupidity of some men’s reasons for hating one another.",
            "review_date": "2018-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies I've ever seen! It was so heart felt for me. I was only 9 at this time, but after seeing what these people went through I wish I would of been old enough to help. I live in the U.S. while this awful war was going on I was safe and cozy with my family. I would never wish this on anyone. When I finished watching this movie, I prayed so hard for all these people involved. I prayed for their peace and happiness, I prayed for their health and wellness, I prayed for their finances and fears. I wish with all my heart I could of helped but I was only 9. I wish the people in that country could see my comment and hear my heart felt prays for them. Im so sorry for what people, and the children had to see and go through. I'm so sorry we didn't help more then we did, I'm sorry we turned our backs on you, I'm sorry for all the family you lost. It's just absolutely awful. If I as one person could of changed that and made it go away I would have. I wish I could of. We sit around here complaining about everything that we don't like or doesn't go our way and look at what they were going  Through! Shame on us! Like the actor said \"Jesus Christ, I am so ashamed!\" ME TOO! Everyone should watch this movie, feel what they felt, maybe we can change the world. Until then, I will continue to pray, pray hard! God be with these kind, brave people and their families!",
            "review_date": "2018-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With emotional drama and powerful international hands at the helm, this African civil war story is as important to hear as any that are still going through the same today.",
            "review_date": "2018-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie and acting by Don Cheadle!",
            "review_date": "2018-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "there's always room..\n\nHotel Rwanda\n\nTicking for around 2 hours, the material offered to the audience is concrete and interesting enough to invest and this is where it excels as it demands attention from the first frame hitting hard and fast. The screenplay writer and director, Terry George might be the weakest link in this feature for it needed a better execution. And on performance side, Don Cheadle has got it covered and doesn't even require any support for he is capable and does carry it all on his shoulder. Hotel Rwanda; if excels on explicit writing and stellar performance, the objective somehow seems a bit distracted as it fails on captivating the audience and create the anticipated drama on screen.",
            "review_date": "2018-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films of Don Cheadle",
            "review_date": "2017-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Film shows us how great and underrated is a freedom! Don Cheadle is Amazing!!!  You must feel this.",
            "review_date": "2017-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don Cheadle's performance in this movie is nothing short of stunning greatness. Although this movie could have gone a little farther in holding the U.N, the U.S. and U.K at serious fault for turning their back's & doing nothing, this movie chose to focus more on Paul Rusesabagina's (Cheadle) humanity, human decency and care for others in the face of a brutal genocide.",
            "review_date": "2017-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An important film that brings the horrors of the Rwandan genocide down to a human level.",
            "review_date": "2017-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film is about civil war in Rwanda.The hotel manger Paul saved many  people.I like the film, Although it is about the war,but at last everyone in the hotel is  safe.If you like history, I recommend you watch this film.",
            "review_date": "2017-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie because it was based on a true event. The main character is very smart and brave. He helped a lot of people survive a bad situation.",
            "review_date": "2017-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hotel Rwanda is one of the most comprehensive and accurate ways we can understand the attitude of a couple of people in the face of the disaster, in which Paul Rusesabagina (Don Cheadle) lived the massacre of hundreds of thousands of civilians, including relatives, friends, neighbors and colleagues on account of the racial conflicts between the Tutsi and Hutu ethnic groups in 1994 in Rwanda. A magnificent story that stands out for the incredible character and humanism of its main cast before what could be the worst nightmare anyone could live.\nA truly inspiring film from which to learn, albeit a little to be more aware of the events that today shake so many countries in the international community and those are conflicts that still do not end and from which we choose to ignore. Terry George efface the typical cliches of the war and focuses on few characters and their work. Without great effects, it is possible to consolidate a film that studies the psychological character of humans and their racial and ideological conceptions that on a collective plane result in unimaginable facts. The way in which Cheadle protected his family, in addition to the hundreds of children and elders he guarded at the Hotel Mille Collines is an act that no one could do; He risked his life at all times.\n\n\"The world ignored Rwanda when we really needed it. Unfortunately, even now the world is still ignoring us\" - real Paul Rusesabagina. 93/100",
            "review_date": "2017-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very heartfelt movie about a terrible event that went down in Rwanda. Don Cheadle steals the show and gives one of his best performance's ever.",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow this is very heart-breaking. :(",
            "review_date": "2017-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hotel Rwanda is a deeply-touching movie that features terrific performances from Don Cheadle and Joaquin Phoenix.\nThe story is insightful and it is told and portrayed at a high level of accuracy.",
            "review_date": "2016-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hotel Rwanda is a powerful film with strong performances and an unflinching look at prejudice, hatred, apathy, and human decency in the midst of it.",
            "review_date": "2016-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good, with a good performance from Don Cheadle, but nothing next level",
            "review_date": "2016-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would have loved to hear the real story, instead of this bastardised, Hollywood version.",
            "review_date": "2016-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film filled with strong acting from everyone in it about one of the worst genocides ever in history. I was constantly interested in the plot of the film, I was not alive when this event took place, but heard about it often. The acting was really good like I said, especially Don Cheadle and Nick Nolte. Joquanin Pheonix was in this too, but essentially as a cameo, and I was interested in his character and would've liked to see more of him. The biggest issue with the movie I had was that it felt a little long and drawn out to me, but it was never that bad, I just feel like 10-15 minutes could've been sliced off and the film would've been just as good. Hotel Rwanda is a good time, and an eye opening experience.",
            "review_date": "2016-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brutal and violent yet accurate depiction of Rwanda's genocide in 1994 fueled by a down-to-earth performance from Don Cheadle as a deglamorized hero.",
            "review_date": "2016-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hotel Rwanda (2004) ??? 1/2\nTrue story about hotel manager who housed over a thousand Tutsi refugees during their struggle against the Hutu militia in Rwanda. Powerful drama benefits greatly by a charismatic, excellent performance from Don Cheadle.",
            "review_date": "2016-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just like \"Schindler List\", this movie shows that how brutal, cruel the genocide is, and how a human changed from capitalist to humanitarian. It is a sad movie, but it leave some hopes in the end of the movie. This is a massacre that is unknown to most of the people, but lets not forget every massacre for the humankind is heartbreaking and it is against the law of nature.",
            "review_date": "2016-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "s/o to my history teacher",
            "review_date": "2016-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original and better version of beasts of no nation.",
            "review_date": "2016-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intense story that everyone should see! Not the best movie before sleep.",
            "review_date": "2016-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While how exactly the refugees were treated in the hotel and the manager's motivations might be more fitting history to a narrative rather than fitting a narrative to history, I think that the movie went about capturing what it would be like to be holed up in a hotel while genocide goes on around you well. Don Cheadle's performance was very good. One of those movies that's very good but I'm not sure I'd watch it again.",
            "review_date": "2016-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It transitions from a political thriller to a historical drama whilst creating a similar atmosphere of another crisis, with hard emotions and courageous inspirational spirit that drew enough aura to be affective and felt by the viewers, especially how Cheadle performed at his best in the center of the aura casting. It truly is a sad one as you would expect, but the value of it reached up to a rating of being really good based on its power. (B+)\n\n(Full review coming soon - with better wording probably)",
            "review_date": "2016-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An important story to tell....just semi-muddled storytelling.  Had to visit Wikipedia to better understand all the little nuances of the story.",
            "review_date": "2016-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not a bad movie but a bit depressing.",
            "review_date": "2016-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The genocides in Rwanda are an often neglected topic of political discussion. This movie depicts what ordinary people will do to protect others.",
            "review_date": "2016-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic piece on the Rwandan genocide that felt like it placed you in the hotel also.",
            "review_date": "2016-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartbreaking, and gripping from beginning to end.",
            "review_date": "2016-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A favorite of mine. An inspiring story told well with great performances.",
            "review_date": "2016-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a good movie, but its just too rough of a subject for me at this point in time. With all this talk of refugees in this country and what not, its just a reminder of how horrible the world is.",
            "review_date": "2015-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film about courage in the face of evil. The makers want to inspire people that bravery, and the belief in the dignity of all human beings, can overcome hatred.",
            "review_date": "2015-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hotel Rwanda is a deeply-touching movie that features terrific performances from Don Cheadle and Joaquin Phoenix.\nThe story is insightful and it is told and portrayed at a high level of accuracy.",
            "review_date": "2015-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sometimes, one good man in this world can make a huge difference to the lives of many. Why do humans periodically go on insane genocidal killing sprees? Why do so many people turn their backs when it happens? \n\nThis movie is at times a tearjerker. If you watched Schindler's List and felt it was important, that it told a tale of many who are no longer around to tell their story, this is the same sort of thing, about what happened in Rwanda not that long ago. To see the difference that one person can make, when willing to take a stand and do SOMETHING, is inspiring. Prepare to be inspired.",
            "review_date": "2015-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some of the worst atrocities in the history of mankind took place in the country of Rwanda--and in an era of high-speed communication and round the clock news, the events went almost unnoticed by the rest of the world. In only three months, one million people were brutally murdered. In the face of these unspeakable actions, inspired by his love for his family, an ordinary man summons extraordinary courage to save the lives of over a thousand helpless refugees, by granting them shelter in the hotel he manages.",
            "review_date": "2015-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good, but depressing. I can't really recommend it for entertainment value, but if you are interested in the true events that this is based on, then give it a try.",
            "review_date": "2015-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easy to see why Cheadle wonderful performance was nominated for best actor and this movie is hard to watch but easy to appreciate.",
            "review_date": "2015-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is very disturbing. That's what I was looking for. An entirely different kind of movie than Shindler's List or The Killing Fields. This movie is brutal, brutal and disturbing. Nolte sucks as almost always.",
            "review_date": "2015-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a strong performance by Don Cheadle, Hotel Rwanda is a heart-rending story based on the massacre in Rwanda",
            "review_date": "2015-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptional movie and sad events that show how humanity is lost in this world and the apathy by other countries is frightening.  One man saved so many, one man who didn't know he had it in him.",
            "review_date": "2015-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hotel Rwanda boasts two exceptional lead performances that give heart to a true story so horrific (albeit so amazingly told) it might be easier to pretend said story did not happen. But then the majority of humanity did do that, didn't they?",
            "review_date": "2015-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true story that surprises everybody on how a man saved thousands in a hotel",
            "review_date": "2015-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One time watch, not bad but something was missing",
            "review_date": "2015-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brutal reminder to the world that didn't do anything about the horrible crimes in Rwanda.",
            "review_date": "2015-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a beautiful telling of a horrific moment in history.",
            "review_date": "2015-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "91%\nWatched this on 25/3/15\nHotel Rwanda is a well made film about a holocaust in the recent times in world history. It has the tension, devotion to the characters and a terrific performance from Don Cheadle. It feels more or less like Schindler's list and the film doesn't even have a single bad moment.",
            "review_date": "2015-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film is powerful and moving, but that's got more to do with knowing the horrible events actually took place -- not because of anything special about the film making (other than possibly Cheadle's understated Paul).  Cheadle's acting was exceptional, and everyone else was good with the notable exception of Nolte who played his role as if he were a caricature of a gruff-but-lovable military careerist.  It's worth seeing to remind yourself that this genocide really happened and the rest of the world really didn't care that much.",
            "review_date": "2015-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An inspirational tale of survival, \"Hotel Rwanda\" showcases a grim narrative to a world event many of us have, likely, never heard of.  Overall, a fantastic showcase of a horrific genocide.",
            "review_date": "2015-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film does some things very well.  It does a good job of establishing what the conflict between the Hutus and Tutsis was about, including it's pointless arbitrariness and it's roots in colonialism, and does so with a minimum of expository dialogue.  It also gives a very clear idea of the scale and sheer terror of the events in Rwanda, without wallowing in bloodshed.  It also depicts an interestingly different hero.  A man who saved lives really by playing the enemy's game and being willing to bargain and even compromise his dignity to save lives.  It's not something you see very often on film.  What it doesn't do very well is break out of the overly earnest \"issue film\" mood that drags it down for large segments.",
            "review_date": "2015-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Paul's story is a very powerful one. As a character, he has a great development arc and very defined personal traits: he is clever, strong, a caring father and husband, and perhaps too kind for his own good. One particularly emotional scene shows Don Cheadle's ability as an actor. \n\nThe events are paced about as well as a true story can be. I feel like it is a shame that it took me this long to find out about the terrible events that took place in Rwanda, and I feel better having seen this inspirational story come as a result.",
            "review_date": "2015-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pathos and hope comprise the main building blocks of Terry George's \"Hotel Rwanda,\" a film that attains greatness - not just for its effortless storytelling ability, but also because of the significance that that story happens to possess.",
            "review_date": "2015-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don Cheadle is incredible in his role, with the supporting cast really 'supporting' his performance at every turn. Sort of like a baby Argo.",
            "review_date": "2015-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very gripping and powerful movie displaying the atrocities and struggle of a very dark and sickening time flawlessly.",
            "review_date": "2014-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a well-done film, but most importantly a highlight of just how terrible the international community failed Rwanda.",
            "review_date": "2014-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing film that really shows the struggles of civilians in the middle of their war torn country.",
            "review_date": "2014-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's an ugly not-my-country-not-my-problem tattoo stamped on the U.S.'s backside.  At times, they thoroughly believe in that tattoo; but in others, they gaze at it with a tinge of regret.  I'm sure America has felt that potent remorse when reflecting on the Holocaust or the Cambodian genocide.  But as one character in \"Hotel Rwanda\" puts it, the majority of our nation hears of the crimes, says \"that's awful,\" turns right around, and finishes their dinner.  I'm guilty of it, you're guilty of it; we're all guilty of it.  There is no one to blame in particular - an ordinary person can't simply drop everything and become a humanitarian - but in \"Hotel Rwanda,\" the that's awful mentality is transformed from a mere numbers game to a stinging reality.\n          In 1994, millions of Rwandan citizens were killed in a response to the snapping of the racial tension between the two predominant ethnicities, the Hutu and the Tutsi.  When Tutsi rebels assassinated the country's dictator, Juvénal Habyarimana, the slowly growing mentality that the Tutsi, who migrated to Rwanda early in its foundation, were not natural-born citizens and therefore a threat to the country finally hit its climax.  In response, Hutu soldiers began exterminating Tutsi civilians without even batting an eye.  \n\tBut amidst any atrocity there is always a hero; in the Rwandan genocide's case, that hero was Paul Rusesabagina, the manager of the Hotel Des Milles Collines.  By allowing scores of would-be victims to stay in the fluctuating rooms and hallways with no charge, he saved nearly 1,300 people.  The film presents him not with the rugged exuberance of a John Wayne type, but rather with a man who feels the need to do the right thing and has the means to do so.\n\tWe are only given glimpses into the barbarities that took place in the varying neighborhoods and regions, but \"Hotel Rwanda\" succeeds in the fact that it's not a lecture or an in-your-face history lesson.  It's by turns enlightening, grim and affecting.  Because Rusesabagina is Hutu and his wife is Tutsi (therefore his kids are in grave danger as well), there is an added franticness that makes every second more precious than the last.\n\tRusesbagina is portrayed by Don Cheadle, his wife by Sophie Okonedo, with Nick Nolte playing a conflicted French Canadian colonel who is forced to make tough decisions in an environment where there isn't any time to make tough decisions.  Cheadle's performance is so poignant because he is willing to risk everything he has in order to save others, despite the fact that he may die in the process.  To go from fledging hotel manager to a saint within a matter of hours isn't a smooth task, but he accents Rusesbagina's integrity with a devout spirit.  What should he do, send every Tutsi out into the street to die? As Rusesbagina's wife, Okonedo is the emotional core of the film, fearing endlessly for her kids and her valiant husband.  Okonedo lays every sense she has down on the table; we feel what she feels.\n\t\"Hotel Rwanda\" is a terrifically acted and tremendously vigorous account of a monstrous part of our history.  Even though the majority of countries looked away, the film places us at an uncomfortable distance to the heinous event, making us rethink that entire not-my-country-not-my-problem philosophy.",
            "review_date": "2014-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An inspiring tale of courage in the face of a strong current. A classic movie about a war-torn nation. It is true what they say about other nations that hear the cry but stand by and watch.",
            "review_date": "2014-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie it really relates to our past and it was just awsome",
            "review_date": "2014-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a difficult film to watch, especially the fact it's based off a  true story.\n\nThe casting from the extras to the main characters were picked to perfection.\n\nThis film brought light to a horrible situation that still exist in these 3rd world country.",
            "review_date": "2014-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A deeply effective and haunting film. It shows the best and worst parts of humanity.",
            "review_date": "2014-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Poorly portrayed. Not giving it's little-known subject matter and Paul's heroism honorable justice. It very much deludes the impact of the tragedy and underwhelms. There were high and low points throughout and could not keep a steady pace. It rose awareness but was a failed attempt at instilling intended feelings of guilt and shock in people and did not paint a clear-cut picture of what horrific events took place during that time. The PG-13 ruled things out and placed limitations on what it was capable of accomplishing, I think. Realism should outweigh comfort in telling stories like these. Show it like it is. Don't minimize the grief.",
            "review_date": "2014-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "7,5/10\n\n\n\n\nPart of my remaining iMDB Top 250 List that i currently want to complete. Joaquín Phoenix and Jean Reno supporting. Strong but not great",
            "review_date": "2014-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a really compelling story, and there are  some really great performances. I wish it had been given to a different director, but still very good.",
            "review_date": "2014-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my all time favourite film. Absolutely love it. Don Cheadle is phenomenal and I love the way the sorry is portrayed. A piece of movie magnificence.",
            "review_date": "2014-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A terrifying, heartbreaking tale that will leave you speechless and crying; \"Hotel Rwanda\" delivered fine performances, suspenseful moments, and a plot that will get you engaged until the very end.  It's powerful in every level.  It's filmmaking at its best.",
            "review_date": "2014-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great moving story",
            "review_date": "2014-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don Cheadle plays Oscar Schindler as a hotel manager that uses all his efforts to save the lives of 1200 refugees from the genocidal rampage of Hutu militants while most of the world was watching.",
            "review_date": "2014-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartbreaking and harrowing in equal measure, as it shows the desperate attempts of Paul Russesbegina, trying to salvage humanity in a time when everything around him seems to be dead. This Schindlers List set in Rwanda, does not really seek to explore the political background of the Rwandan Genocide, it was more a look at the people caught up in it for no fault of theirs.\n\nIt also castigates the Western attitude and the failure of the UN, as shown in the scene, where the bus takes away the Western tourists and expats, leaving behind the natives stranded helplessly.\n\nExcellent performance by Don Cheadle, as Paul Russesbegina, who throws his everything into the character, and backed up well by Joaquin Phoenix, Nick Nolte among others.",
            "review_date": "2014-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Essentially the Rwandan-genocide equivalent of Schindler's List, Hotel Rwanda is a hard-hitting, heartfelt and powerfully acted film.  The cinematography was colorful, and the subject-matter was expertly handled so that viewers could genuinely feel the onscreen characters suffering.  The only gripe I can really scrape out is Nick Nolte's seemingly dry character and occasionally incomprehensible dialogue.  Other than that, Hotel Rwanda is an important film that serves as an eye-opener towards the depressing truth of horror's that are ignored around the world.",
            "review_date": "2014-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A tragic and relentless film that depicts such a dark point in history where none of us lifted a finger in order to end it.",
            "review_date": "2014-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "True story of how one Hotel manager managed to save over 1000 lives in the Rwandan genocide in a conflict between the Hutu and the Tutsi tribes.",
            "review_date": "2014-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the greatest achievements of cinema",
            "review_date": "2014-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good, no doubt about that. But it's just not amazing or a masterpiece like some suggest. It's too safe on it's setting and not as powerful or moving as it could be.",
            "review_date": "2014-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This man is a leader. He had the courage to save over 1000 people he didn't have too he could have ratted the refugees out but no he saved a lot of people and I thank him for that.",
            "review_date": "2014-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hotel Rwanda Is a film about a business man named paul that owns a famous hotel in Rwanda but that all changes when the genocide of hutu and tutsi happeneds.This movie is heartful and intense , they really show how much paul was pushed to protect the people he loves.",
            "review_date": "2014-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "See it for the important, and sadly overlooked history of Rwandan genocide.  It will floor you, and make you angry at the government and the media for staying away.  But it will also alert you to the profound talent of Don Cheadle, who carries the movie on his back, the way his character carried 1200 people through a nightmare.  He got a nomination for his portrayal, but, sadly, lost to the showboat impersonation that the otherwise talented Jamie foxx gave in Ray.  He should have won, and the American people should have been more aware of the tragedy going on in Rwanda.  This is heavy stuff, and to think of the State of the United States in 1994 when this was happening.  Every American should have been aware.  And our government, and European governments should not have turned their backs.  This was an ugly moment in Rwandan history, and an even uglier one in American history, because we ignored it.  This should be required watching for every complacent American that thinks it is ok to sit back and watch.",
            "review_date": "2014-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don Cheadle's Oscar nominated performance drives this heartbreaking and emotional drama set during the Hutu-Tutsi civil war in Rwanda. Cheadle plays hotel manager Paul Rusesabagina, who tries to save the lives of more than a thousand Tutsi refugees by hiding them in his hotel. A few scenes that will be hard for me to (ever) forget, the \"bumps\" on the road as they drive through the fog, the little orphan girl exclaiming \"Please don't let them kill me, I promise I won't be Tutsi anymore'' Yeah, brutal. So anyways. A good movie, Cheadle's performance is amazing, I had a hard time accepting Nick Nolte as a \"Canadian\" UN Colonel, Joaquin Phoenix is essentially a cameo, not a big budget Hollywood film and all the better for it. Reminiscent of Shindler's List in the beginning as Paul tries to pay/barter for Tutsi's lives. 8/26/14",
            "review_date": "2014-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A chilling depiction of an international tragedy.",
            "review_date": "2014-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story of a civil war that massacred millions going largely unnoticed, gave this film a duty to properly convey the circumstances of this event, in which the film delivers beautifully and with enough emotion to leave one in tears.",
            "review_date": "2014-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story and great movie but just not enjoyable enough for my tastes.",
            "review_date": "2014-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An exceptional movie, but tough to watch",
            "review_date": "2014-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily Don Cheadle best performance",
            "review_date": "2014-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily Don Cheadle best performance",
            "review_date": "2014-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great thought-provoking drama to be engaged in. The movie felt so natural and raw, like downing a straight shot of whiskey. Don Cheadle gives the performance of his career in this great film about the struggles during a very tense rebellion in Rwanda between the Hutu militia and the Tutsis. This film will stock with you for the rest of your life.",
            "review_date": "2014-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well-paced and executed movie.  Incredibly moving performances.",
            "review_date": "2014-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellently made. It has amazing performances and good direction. A truly amazing true story.",
            "review_date": "2014-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A heartbreaking story about a heartbreaking time in Rwanda that wisely chooses to concentrate on a segment of the population - in fact, refugees staying at the Hotel Des Milles Collines. The focus on a smaller group of people provides a stronger, visceral experience when we see the \"bottom fall out\" in Rwanda than it would have been possible with a broader canvas involving more characters. Performances from Don Cheadle and others were excellent, and though this is a movie difficult to rewatch, I am happy that I have done so several times.",
            "review_date": "2014-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the movie is based on a true story that occurred during the Rwandan genocide in which Paul Rusesabagina saved 1,268 lives during the Rwandan genocide..a really great movie about inhumanity",
            "review_date": "2014-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good movie but it is pretty light for a movie about genocide. If they made it darker and if it was rated R, it would have been a lot better.",
            "review_date": "2014-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One man saved 1200 people live from genocide in Afrika. Hatred and insanity are the motivation of the Hutu people for Massacring tutsis people. The flaw is only on acting of supporting cast, not too natural i thought. But Don Cheadel made his name rise in this movie. Sad,tense and terrible scenes filling in this movie. One of the greatest true story movies. Because when another movies showing us the western war, this movie can put different idea through genocide between Afrika people. Sensitive idea with smooth execution.",
            "review_date": "2014-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hotel Rwanda reminds us that genocide didn't become a rare and small scale war crime after the Holocaust. An engaging drama, that also brings attention to the political headaches Sub-Saharan Africa struggles with even today.",
            "review_date": "2014-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies I've ever seen with one of my best heroes..",
            "review_date": "2014-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a relatively old movie \"10 years!!\" and I have no idea how on earth did I miss seeing it :D !!\nit's both heart chattering and warming at the same time.. the level of cruelty some ppl could reach, and the level of humanity some other could also reach at the exact same time for unknown reasons.\nThe true story of \"Paul Rusesabagin\" featured by \"Don Cheadle\" who was a \"hutu\" and helped save the lives of over a thousand and a half  \"Totsie\" who were subjected to genocide that killed over a million of them!\na movie definitely worth watching :)",
            "review_date": "2014-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a sad movie, but very well done.  Upsets me greatly to think of how many lives should of been saved during all this.",
            "review_date": "2014-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film failed to engage me, I was told that it will make you cry, but I was unconvinced with the performance nor the direction. Sure, it's a sad story about the African genocide in Rwanda, but just because it's about a sad true story, doesn't make it a good film. Like everyone else, I do not care. The only part that I enjoy about the film is that the UN was portrayed accurately as they are: Useless in every single way, they only threaten other countries, but cannot do a single thing in combat. In conclusion, if you want to watch something that will make you cry, this is not the film for you.",
            "review_date": "2013-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rip out your heart and give it a good thumping then you may be in the right mode for the following. The truthful brutality of the murder is heartrending and clearly shows that the human condition is still a challenge. Acting is simple yet fits the context well conveying the pain and suffering. The slowness of UN to do anything practical quickly comes across well. Nibbles: Ugali and Cabbage.",
            "review_date": "2013-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hotel Rwanda is an extremely intense and very well constructed drama. We follow the journey of a man who wants to get his family out of a terrible genocide while also providing a place of refuge for the targeted The acting is quite good, and the story is extremely engrossing. It effectively gets the message of the film across without being in your face or disgusting about it. The movie keeps you on the edge of your seat, and though simple, is remarkably well made. It isn't for everyone, and it certainly has little to no rewatchability, but it is an effective and powerful retelling of horrific events. Hotel Rwanda gets 4/5 stars (B+).",
            "review_date": "2013-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hotel Rwanda is a very gruesome telling of the struggles between the Tutsis and the Hutus in Rwanda. This movie was very good, and Don Cheadle did great in it. I thought the film's interpretation of what actually happened was very spot-on, and I think that, because of the disturbing content and language, this movie could possibly pass as an R rated movie. Overall, I enjoyed this movie, but it's not something I'd want to watch a lot.",
            "review_date": "2013-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is one of the best of 2004. The performances Don Cheadle and Sophie Okonedo and the rest of the cast are really breathtaking. \"When you seat down and watch this movie you will feel the emotion that they are feeling.\" The directing by Terry George is so amazing. The screenplay is perfect. Score is good. Special Effects is outstanding.",
            "review_date": "2013-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hotel Rwanda is exactly what any perfect film should contain: strong acting, natural drama, and the feeling that you left the theater changed (for the better).",
            "review_date": "2013-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cheadle's role as Paul Rusesabagina, the Oskar Schnidler of Rwanda is spot on. Rwanda remains a tragedy that the world was ultimately responsible for letting go by the wayside.",
            "review_date": "2013-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie sent a very strong message showing violence we aren't used to seeing. It was very emotional, it was a very powerful film.",
            "review_date": "2013-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film does a phenomenal job at providing a surprisingly accurate portrayal of the real life events. But far more importantly, the movie imbues itself with more than enough affectional purpose to justify it's existence and portray itself as relevant to the debate over very current and modern events.",
            "review_date": "2013-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hotel Rwanda is the one depiction of the Rwandan genocide that I've found to be the most gripping and to be the best of such films so far. The story is about the Hutu genocide of the Tutsi population seen through the eyes of Paul Rusesabagina, hotel manager of hotel Milles Collines, which for a short period of time became a refugee camp for Tutsi refugees. Paul himself is Hutu, but his wife is Tutsi and he is, therefore, forced to use all his connections and saved up favors to save his family and friends from an attempt to exterminate the entire Tutsi population.\r\n\r\nThis independent film quite vividly brings to life one of the biggest tragedies of the 90s and even educates about the origin of the hate in Rwanda that dates back to the Belgian colonisation. A very emotional film about one of the saddest chapters of history and the fact that it happened less than 20 years ago is terrifying to say the least. The film has a lot of characters to care about and very convincing performances from Don Cheadle, Sophie Okonedo, Nick Nolte, Fana Mokoena and Hakeem Kae-Kazim, especially impressive is Don Cheadle who rises to deliver his best performance so far.",
            "review_date": "2013-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must-see for everybody. \nThe cinematographic part never really gets in the way of what is the real core of this movie, which is the true story on which is based upon. The directing, the actors, the touching scenes actually contribute to make the film even more real, solid, dry. The emotions come from the story itself, not from the way it's told or the way it's acted. Maybe even for this reason the story of the hotel manager gets so important in the overall balance of the whole movie. \nOne thing is certain: some of the scenes will never fade from our memories!",
            "review_date": "2013-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Hotel Rwanda\" is a true story and, although it is difficult to watch at times, its bold statements about war and its theme of selflessness are incredibly rewarding.  This powerful portrayal of this dark chapter of world history has led to it being called the \"African Schindler's List.\"  This Rwandan Genocide occurred when my generation was very young and I am glad that this film has opened my eyes up to these events.  Don Cheadle was the perfect choice for the film's hero, Paul Rusesabagina.  His accent is incredibly convincing and his acting captures the intense emotion that this character must endure as he saves thousands.  The other big names do not really get a chance to shine but add a lot of character to the film, from Nick Nolte's frustration with the U.N. to Jean Reno's sense of duty to these helpless victims and Joaquin Phoenix's compassion as he witnesses the slaughter of countless Rwandans.  These characters do not stand out but their polarizing emotions engage the sympathy of the audience.  Regardless of the acting, cinematography, and violence, the script is what creates the potent sensation of anguish that creates a connection between the characters onscreen and the people sitting in the audience.  It develops the perfect equation of getting to know the characters, interpolating historic fact with fiction, and showing the right amount of violence that is bearable to watch but difficult to stomach.  \"Hotel Rwanda\" may not be on my list of favorites but it is simply a great film.",
            "review_date": "2013-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cheadle's performance is one to take a look, also it has a smart script that has some truly honest life questions.",
            "review_date": "2013-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A emotionally powerful depiction of the African Holocaust in the 90's.",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Certainly this is an important story, but in terms of being a good movie, it's marginal for me. I just didn't feel the stakes emotionally. And the acting felt a bit too forced at times. The cinematography was too brightly lit and that may have been part of the problem. The movie just didn't feel cinematic enough. It felt more like a soap opera or a documentary. Don Cheadle gives a decent performance, but not Oscar caliber in my opinion.",
            "review_date": "2013-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The role belongs to Cheadle and, not surprisingly, he walks away with it.",
            "review_date": "2013-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant and heart wrenching.",
            "review_date": "2013-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hotel Rwanda is a biographical historical drama about one man (Paul) who shelters over a thousand refugees in 'his' hotel at a time when genocide is taking place in his country in 1994. One of the film's remarkable feats is its ability to shock its audience and create tension by hinting at horrible acts of slaughter instead of showing them in your face. The lack of graphic reenactments of violence in Hotel Rwanda allows its stellar cast to deliver some of the most (realistic) moving performances in modern cinema. Don Cheadle in particular carries the bulk of the acting in this film, but you never doubt the guy for a second, and that's not to underplay the performances of the rest of the cast. Shifting gears a bit, the 1994 Rwandan genocide event is notable for its (almost ironic) absence of the United States and the other Western powers. \"rwanda's not worth a single vote to them,\" a statement from the film, is a blatant attack on America's (and the rest of the world's) silence on the matter. And now, 20 years later [4/28/14], there remains a lot of 'no-talk' on a number of important issues that face us--not as a country, but as living organisms on this planet that we share with non-human organisms--why? How is it possible that beings, capable of incredible feats of engineering, art, music, critical thought, etc, are blind (or simply choose to look past) to problems/dilemmas/etc that Need to addressed? It's easy to say that we will never forget about the holocaust ....but then what happened in Rwanda? Is there anything else happening at this very moment that needs to be stopped? I don't have any answers, but there's thing I know for sure--for the most part--not a single damn one of us has learned from \"acts of genocide\"....",
            "review_date": "2013-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hats off to all involved in this movie about the genocide in Rwanda during the 1990s as it really is a fine movie. Don Cheadle plays Paul, a hotel manager in the city of Kigali. He is an ordinary and seemingly insignificant man but then events in Rwanda overtake him. As the tribal differences fracture society and the country rips itself apart, Paul takes in refugees from the massacre and shelters them in the hotel while desperately trying to keep the rebel soldiers out. It is a harrowing story about the brutality of some, the attitude of the west and the bravery of one man in standing up for what is right and just. Cheadle is outstanding in the lead as is Sophie Okonedo as his wife Tatiana, both performances gaining Oscar nominations. I was also really impressed with Nick Nolte as Colonel Oliver, the UN soldier who has the task of trying to protect the hotel despite the apathy of world politicians to the situation. There are scenes that are difficult to watch but in the end, this is a tale of hope against adversity and the courage and humility of one man.",
            "review_date": "2013-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic film that I was late watching this film shows how divided we are even in Africa",
            "review_date": "2013-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really strong performances from Cheadle and Okonedo are hampered by no more than decent direction and a script lacking in subtlety. Still, Hotel Rwanda is a powerfully affecting film about how in our darkest moments, common decency is a sign of extraordinary bravery.",
            "review_date": "2013-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't get me wrong, this is a decent film, but it's way longer than it needs to be.  I found myself getting extremely bored despite the interesting story.  What I really didn't like about this movie is that it has a lot of loose ends, characters, mini stories, and plots that really don't go anywhere.  This wouldn't be a problem, except that this happens like a dozen times.  Some aspects of the story are horribly explained as well, which just makes a lot of the storyline confusing.  Still a great story of individual heroism in a time of pure insanity and evil, but I just don't really like how it's told in this film.",
            "review_date": "2013-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story here isn't the political one, that the world ignored the Rwandan genocide (which it did, and this movie depicts well) but the story of one man's decency transcending these arbitrary lines of Tutsi and Hutu which weren't even an actual ethnic difference but something started by the Belgian colonials years before. Pretty intense movie when they get to the river road, but the story gets tied up a beat neater and happier than i imagine it did for many of the famiilies, perhaps a bit more heartbreak would have been more realistic, but i can understand not wanting to alienate the audience too much by offending them doubly for their ignorance of the situation.",
            "review_date": "2013-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Emotionally drowning but ultimately uplifting with fantastic performances.",
            "review_date": "2013-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The events that had transpired were horrible. On the contrary, the film was excellent. Don Cheadle was really great in this too.",
            "review_date": "2013-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Courageous, uplifting, tragic, intense, Don Cheadle and Sophie Okenedo give the most heart wrenching performances that will make you cry. This film should have been nominated for more Academy Awards then it was",
            "review_date": "2013-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Portraits the brutality, corruption, hatred and complete lack of sensibility that a whole lot of people can have when raised surrounded by it, and being incited for it. In contrast, the movie also shows the goodness, loyalty and selflessness of a few others while facing terrible atrocities.",
            "review_date": "2013-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Africa. . Fuck this continent. 'Nuf said.",
            "review_date": "2013-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Are you feeling happy? Want to get rid of that weird happy feeling inside? Then this is the one for you- watch as the joy leaves your eyes until they are filled with nothing but pain. Humanity is cool right? WRONG, IT SUCKS, IT REALLY BLOODY SUCKS.\n\nA captivating yet horrid film based on terrible true events that, whether we like it or not, we need to be reminded of now and then. As great as this film is, I wish that there won't be future films like it but today's global political climate suggests I will not be so lucky. \n\nThis one bombards you with the threat of death throughout- there is a rarely a moment that it isn't shrouded in uncertainty and discomfort due to the seemingly impending threat of violent death. The performances are stunning- not a weak one among them all and Cheadle fully-understands his role. The script is well-written and, while its emotionally powerful, it feels fairly real and honest.\n\nIts a failry typical film considering its intense topic though- it feels true to its story but it also seems to tow the line to an extent, not an Oscar-machine by any account but still maybe a little too conventional for its own good. \n\nIts hard to criticise a film for being too much like a film though- its easy to do with something as unique as this but I'm not sure that that is fair- what we've got here is a great movie with plenty of great elements and some outstanding scenes- more than your fair share for any film and its certainly full of heart.\n\nIts too moulded though to be as great as it should be- it makes compromises for its audience with the main one being the typical hero-story mould that this film takes. There needs to be more condemnation, it needed to be unrelentless but its not quite. \n\nI can forgive these faults, while I understand that others may not. I can forgive the faults because its a powerful movie that is well put together and is something that had to me made. Its a typical Hollywood movie in structure but its so much more at heart.",
            "review_date": "2013-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a great experience I had when I watched this movie. I really hated the massacre that took place an I am glad it's gone.",
            "review_date": "2013-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shocking, Brutal and Satisfying. One of the best movies of our generation. Watch now.",
            "review_date": "2013-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fictional portion of the writing cheapened the overall impact",
            "review_date": "2013-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The near genocide of the Tutsi is one of the most horrific events in recent history and is one of the harder concepts to make into a feature film. Will it succeed in capturing the fearful events in a powerful notion or fall short of realizing the horror of that time?\n\n\nHotel Rwanda is the true story of Paul Rusesabagina a hotel manager in the Kigali during the mass genocide of the Belgian supported Tutsi by the oppressed Hutus. This terrifying story is one of powerful conception and is apparent when the violence escalades to mass proportions with executions taking out on the daily. This is where Paul Rusesabagina character is put into action as he helps shelter over a thousand Tutsi from the rebel Hutus.  \n\nDon Cheadle stars as Paul Rusesabagina and gives a performance accolade worthy; his performance truly shows the emotions embodying his character in this time of freighting circumstances. The supporting cast also gives top-notch performances all around. I enjoyed watching the movie thoroughly and felt as if the actors really gave great performances. \n\nThe direction is notable with a couple missteps in a few areas in particular the choice to make it a PG-13 rated movie. The story is impactful in nature but it could have been flushed out greatly with an R rating to not only hear about what was happening but also actually see it. That's one of the factors that made Steven Spielberg's Shindlers List's so impactful. As for the script it is very well written with many lines of clever dialogue and interesting conversations. \n\nWhile still powerful I can't help feeling it could have been something great. Nonetheless a great film witch deserves it four out of five star rating.",
            "review_date": "2013-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched this in history class and was okay with it. Kinda annoying to watch but didn't hate it. Not eye opening as much as other movies but made me a fan of don cheadle",
            "review_date": "2013-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great movie, horrific story",
            "review_date": "2013-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don Cheadle's central performance and the failure of humanity around him make it so openly presented here it make it nothing less than compelling and highly emotional. For me it dosnt quite sustain the electricty Blood Diamond has throughout, but it's very very close.",
            "review_date": "2013-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful and gripping tale of the Rwandan Genocide.",
            "review_date": "2013-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the movie that tell you, sometimes the world needs 'Merica...although Nick Nolte was horrible at playing a Canadien, definitely was playing American.",
            "review_date": "2013-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very hard to watch, but everyone should!  Such horrible things have happened, and are happening again in Darfur, Sudan.  It's good to be aware.",
            "review_date": "2013-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not expecting much, and I got a lot. The first time I saw this movie, it was during a geography lesson, and just loved it from that moment.\nThe way Terry George portrays the true massacre is impressive, while tense. Rwanda is very well created and the story too, throughout the film raises several philosophical questions that leave you thinking for a long time. The massacre of Hutus against Tutsis recreated this very well and very real.\nDon Cheadle is superb, simply embodies his character and delivers this true hero was Paul Rusesabagina; Joaquin Phoenix is fantastic, her character is the most credible and he is unrecognizable.\nThe movie made ??me hate myself, and soo many people that the film petrays, that actually exist till this days. Tensing and exciting moments, the film is very real and so inspiring, with an ending that I could not ask for better.",
            "review_date": "2013-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film, this story is a warning to us of the dangers of hatred towards those who are only different to us. Also all the acting was superb, the portrayal of the story and the characterisation of the players in Rwanda was equally superb.",
            "review_date": "2013-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The true story of a hotel manager whose hotel was refuge for the Tutsi people during the genocide committed against them by the Hutu people in Rwanda in 1994. The film has a very intense atmosphere of imminent and unpredictable danger, as well as a hard hitting realist style. Don Cheadle's performance as the lead character is nothing short of masterful.",
            "review_date": "2013-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Chilling and heartbreaking. This is a well put together film however due to the subject matter is hard to get through as you could be the most optimistic individual on the planet only to see it slowly turn to pessimism as the film progresses. Don Cheadle does a fine job as usual, but after all the devastation beheld, cannot convincingly point out the silver lining as there is none in reality nor on celluloid.",
            "review_date": "2013-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Feels much more like a made-for-TV movie than a feature film. It would have benefitted greatly from a more capable director. The DP's overlighting suggests that the scenery was created on a backlot, despite the fact it was filmed on location. The film's completely devoid of visual style or dramatic energy. I couldn't believe how visually insipid this movie was--it looked like a \"B\" movie from the 80s, absolutely uninspired. The camera shows no imagination or life, it simply sits there. Terry George challenges nothing. He uses words to paint a picture that could have been much more effective if the camera were let loose more. George puts more importance on the words of the script rather than showing them. If he were writing an op-end piece for a newspaper, that'd be dandy. But this is film and the medium has certain demands, the main one being it's visual.\n\nThe movie is polite and inoffensive to the point where it is offensive. The acting is good... the script works when it's not overtly preaching, and the story naturally unfolds. There's also a severe lack of tension and the drama doesn't feel as weighty as it should be, given the subject matter. Except for a few scenes in the beginning, the characters didn't feel like they were in much peril. For a film about this subject matter, I expected to be on the edge of my seat throughout. But it is watchable.",
            "review_date": "2013-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It took me a little into the movie to get into it. But once the climax of the movie happened I was instantly pulled in. This is a amazing movie which is based on actual events which provides a insight of what happened.",
            "review_date": "2013-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hugely powerful - glad I got to see it at last. Everyone should, really.",
            "review_date": "2013-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good Good Good I was really drawn into the story",
            "review_date": "2013-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastically enlightening but heartbreaking movie. Shows that blacks dont have it any better in the Motherland than in America. Smh...",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "brutal and hearth pumping, thats has done it all! a very good work!",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "African Schindler's List (Hotel)..... :)",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based on a something that really happened. It was powerful, interesting and most thought provoking.  Left me with a strong disdain for unnecessarily selfish humans.",
            "review_date": "2013-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At first I hated this movie.  But now that I think about it, it's a historical movie and the movie does do a good job as a represtation of history.  It's not as good as \"Lincoln\" or \"Patton\" and I really don't care to watch it but i'll give it an \"A\" for historical purposes.",
            "review_date": "2013-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie. kinda depressing and very dramatic.  not my style of movie but a good movie none the less",
            "review_date": "2013-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A moving piece of cinema that reveals the wicked sins of war.",
            "review_date": "2013-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant depiction of the horrifying atrocities in Rwanda. Don Cheadle is teriffic.",
            "review_date": "2013-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hotel Rwanda is a 2004 film directed by Terry George. The story is about the massacre occurred in 1994 in Rwanda, where Hutus massacred almost all Tutsi and of how Paul Rusesabagina found refuge and saved 1200 Hutu and Tutsi. A story that does a lot and think that speaks of the courage of Paul who saved so many lives and the world feigned ignorance. Excellent directed by George and the cast.",
            "review_date": "2013-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "too emotional for me\r\ngreat movie",
            "review_date": "2013-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A heart-wrenching film that will make you upset, angry, frustrated, happy, and wonder how something like this was able to happen without any interference for so long. The film stays true to the essence of itself and the cast does a marvelous job depicting this story. It is horrifying and in tune with reality which creates a sobering tale.",
            "review_date": "2013-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just remained me of the masterpiece The Pianist but in some different part of the world",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I look at Hotel Rwanda as a weaker version of Schindler's List, both handle a genocidal holocaust using images to draw out emotion. And this film was depressing, the scene that stands out is the bus driving away. With the pastors yelling \"We can't leave the children\". The music and scenery surrounding that moment resulted in deep sadness, the highpoint of the film. The scenery and technicality of the movie was consistent, and Don Cheadle for the most part brought an energized performance. I believe the films greatest weakness was the editing by Naomi Geraghty who also edited for the 2011 film Limitless. I feel like plenty of the scenes dragged and the timing was off. The thrills in this film were practically not there, due to the fact that it keeps repeating itself. It overkilled on the thrills, by doing the same thing over and over again. Overall though it's a fair drama, with its share of shocking scenes. I suggest this for fans of the genre.",
            "review_date": "2013-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An exceptional film that is very true to sufferings that happened in 1994 in Rwanda. Most people would not even be aware of the atrocities that were suffered at the time. An inspirational man protects over 1000 people in a hotel and goes above and beyond what any normal human would have, when it would have been so much easier to just leave when the option was given.",
            "review_date": "2013-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful, horrible story.",
            "review_date": "2013-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know how to begin to respond to a movie like this, but I will try. This is one of those movies you never forget. I owned this film on DVD for years and didn't watch it. Not because I didn't want to. Because I knew it would be a hard movie to watch. I was right. But this is a movie everyone should see. It is a historical film about the bravery of a man and those around him in the face of impossible circumstances. However, what it is also about the value of human life. Not just the mindless slaughter of war and genocide, but also the value of human life to those looking on from outside. The problems of the world seem too big sometimes and we have a way of getting desensitized and shutting down. We've come to be used to seeing horrific images in our news reports. They do inspire sympathy, but sympathy does not fix the problem. Occasionally some of us get together and try to donate money or supplies to difficult areas of the world. It can make a difference in the short term, but not the long term. Some devote their lives to the cause of trying to fix these problems. We all lionize those who put themselves into the thick of it when they don't have to and try to make a difference, but they are too few and far between. Most don't truly believe the ways we currently try to fix these problems are that effective at all. Maybe one day we as people will stop drawing lines between each other. Maybe one day we will focus more on what brings us together than what separates us. Maybe one day people like me will feel like more than just someone with no money or resources, trying to take care of their own family, who doesn't really believe he can do anything of value for those in need thousands of miles away. I am a hypocrite. I too feel detached. I focus on what is right near me because its all I feel I can really effect and I feel the strongest responsibility to my family. I wish it were different in certain ways. I wish the powers and resources of the people of our planet were used to care for those in need of help and to stop violence, rather than moving around lines on a map. I wish we were evolved enough to find a better way to solve problems than murdering each other. I, like many, wish for many things I hope to see but don't know if I ever will. That's what this film left me with, above all else. A stark reminder of the inherent problems with how we humans see each other. How we shut our eyes to atrocities and how we need to stop.",
            "review_date": "2013-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderfully made and very good at exploiting emotion. Good stuff",
            "review_date": "2013-01-25",
            "source": "rt",
            "lang": "en"
        }
    ]
}