{
    "rating": 9.2,
    "release_date": "2004-09-24",
    "num_reviews": 430,
    "genres": [
        "Biography",
        "Drama"
    ],
    "summary": "On a break before his last semester of medical school, Ernesto \"Che\" Guevara (Gael García Bernal) travels with his friend Alberto Granado (Rodrigo de la Serna) from Brazil to Peru by motorcycle. The two men soon witness the great disparities in South America, encountering poor peasants and observing the exploitation of labor by wealthy industrialists. When they reach a leper colony in Peru, Ernesto's values have changed so much that he sides with the sufferers, forgetting his own comfort.",
    "reviews": [
        {
            "content": "Definitely a great movie about Che Guevara's story before becoming a revolutionary figure. The movie doesn't touch on the most polemical subjects of his story (the revolution and guerrilla times), but more on his past and what led him to become what he became. Truly a must see if interested in Che Guevara's reasons to become what he became.",
            "review_date": "2022-10-27",
            "source": "rt"
        },
        {
            "content": "In many ways, this is a story about coming of age\n\n\"Diarios de motocicleta\" shows Ernesto (Che) Guevara's inner story, based on his diaries from his youth and those of his friend Alberto Granado.\n\nThis fictionalized reconstruction transports us into the feelings of a Latin American consciousness that has been ideologically rediscovered.",
            "review_date": "2022-09-29",
            "source": "rt"
        },
        {
            "content": "A fascinating insight into what motivated Che Guevara to become the famous revolutionary. I learnt a lot.",
            "review_date": "2022-09-27",
            "source": "rt"
        },
        {
            "content": "Walter Salles' The Motorcycle Diaries tells the story of a formative year in the life of a young Che Guevara (Gael Garcia Bernal), a period prior to his participation in the Cuban Revolution and his role in Fidel Castro's regime.  Together with close friend Alberto Granado (Rodrigo de la Serna), Guevara embarks on a year-long road trip on the back of a decrepit motorcycle across South America where, after a comfortable upbringing in Buenos Aires, he is exposed to the oppressed and the downtrodden for the first time is his life, vowing to make their living conditions more acceptable.  The touching journey of self-discovery features strong performances from all involved, stunning landscapes, effective cinematography, and an insightful script that gives great depth to one of history's most divisive characters.",
            "review_date": "2022-07-18",
            "source": "rt"
        },
        {
            "content": "Boring road-trip movie. Things happen along the way. It ends. No plot to it. Boring really.",
            "review_date": "2022-01-23",
            "source": "rt"
        },
        {
            "content": "Recientemente, he visto Diarios de Motocicleta. Este dice la historia de un hombre, estudiando para ser doctor y su mejor amigo Alberto. Ellos son Argentinos de familias que tienen mucho dinero. Ellos querrían explorar por todo el sur de América. Esta historia tiene el aparecimiento de una historia simple. Pero, el doctor no fue famoso por ser doctor. El nombre del doctor es Che Guevara, y este viaje fue el inspiro que daría forma a las políticas de Latinoamérica por la 20 centuria. Durante la película, vemos cómo Che se transforma de un hombre joven que quería ser doctor a un revolucionario que quería ayudar a los pobres de latinoamérica. No llevaba mucho para transformar las ideas de Che Guevara. Simplemente vi como los pobres, los campesinos, y los indígenas estaban viviendo en todos los lugares de Sur America. \n\nMis cosas favoritas del cine fueron la actuación. Gael García Bernal lee el papel de Che Guevara y Rodrigo de la Serna lee el papel de su amigo, Alberto. Gael García Bernal hace un trabajo excelente en mostrar la transformación de Che. En el primero de la película, lee Che como introspectiva y como alguien que está verdaderamente intentando de comprender el mundo. También ves, con su actuación, el aumento del peso de la emoción que el viaje trae. Con cada kilómetro que suben en la motocicleta, puedes ver en la cara de Che (o Gael García Bernal) el peso del mundo aumentando. La actuación de Rodrigo de la Serna es perfecto opuesto a Che. Rodrigo juega el mas despreocupado Alberto. Con la presencia y actitud de Alberto, podemos ver las actitudes de la gente privilegiada. Este es perfecto en que podemos ver como Che está atrapado entre dos mundos: el mundo de su juventud (el mundo de privilegia) o su destino de ayudar a la gente desafortunada. Si tu fueras Che, qué harías? Totalmente esta fue una película excelente e hizo un trabajo excelente en diciendo la historia de una de las figuras más importantes en la historia del mundo.",
            "review_date": "2021-12-20",
            "source": "rt"
        },
        {
            "content": "Adapted from actual events and from his book \"Notas de viaje\" by Ernesto 'Che' Guevara starring Gael García Bernal playing as the author himself.  He is called Fuser by his cousin he travels around with who still has a year to graduate- a practicing doctorate who decided to postpone it so that he can travel around South America from their home in Buenos Aires to Peru. much of it from a bike with his friend and cousin the biochemist Alberto Granado (Rodrigo De la Serna) Fuser calls him Mial for short.\n\nSpoil\n\nAs soon as it was revealed toward the end that it was about the early childhood revolutionary leader \"Che\" of Cuba, we get the sense from this road trip journey how he went from him as an inspired doctor to an idealist.",
            "review_date": "2021-11-20",
            "source": "rt"
        },
        {
            "content": "This movie is beautiful to look at, acting is impeccable and the music is a real standout.",
            "review_date": "2021-10-25",
            "source": "rt"
        },
        {
            "content": "Very Spanish. Idk what else to say. You have to really be into their sentiment of film making to enjoy it.",
            "review_date": "2021-10-15",
            "source": "rt"
        },
        {
            "content": "Even if you hate communism or Che you should still watch this movie. It's not about either of them. It's about the harsh inequality that exists in our world.",
            "review_date": "2020-09-30",
            "source": "rt"
        },
        {
            "content": "The Motorcycle diaries is a coming of age, clash of cultures, cultural imperialist, proto South American communist revolutionary, road movie, telling the tale of how a 24 year old Ernest Guevara (or ‘Che' as he become known to t-shirt sellers everywhere) and his moustachioed buddy Alberto travelled the length of South America by clapped out motor bike, clapped out trucks, clapped out shoes and almost serviceable river boats. Leaving behind a large and happy family, a promising medical career and a beautiful rich girlfriend at her beautiful sprawling ranch, it's easy to see why he swopped it all for life with his ewok chum among the rubble, dust and colourful hats of the easily conned ladies they meet along the way. Frankly you'd be mad not to. Top it off with a 3 week gig at a Leper colony and you're getting on for the perfect holiday for a young man about town. \n\nClearly, Ernest saw sense and this mad him angry. So angry in fact, he started blurting stuff at all those who would listen and ultimately become a gun toting, cigar chewing psychopath with a thing for berets. We see the former at the end of this movie but for the latter, we'd have to watch Stephen Sodeburgh's subsequent flicks to get a glimpse of him in rooting-tooting action. \n\nOn the whole, Motoryclce Diariies was fairly good value for its 126 minute running time, evoking a fine sense of time and place, that filled the viewers lungs with the smell of Diesel oil and the viewers eyes with occasionally majestic scenery if we discount the lepers. Bernal played Guevara with a fairly straight bat, whereas Rodrigo de la Serna stole the show with his sheer front, slick dance moves and bike handling skills to rival those of a tanked up Julian Baker.",
            "review_date": "2020-04-10",
            "source": "rt"
        },
        {
            "content": "This was one of many films I was forced to watch in Spanish class in high school and while it was not a film that I would ever call bad per se it also was not terribly memorable. Watching it again all these years later I felt the same way as the film has noble intentions and does a better job serving as a tribute to it's subject than Che! (1969) but it is not the thoughtful and weighty epic that it would like to be. I was shocked by the fact that it is the first half of the film when our protagonist is not driven by a desire to adjust the imbalances present in the world that I was most invested in.\n\nMedical student Ernesto Guevara, Gael Garcia Bernal, decides to travel around South America with his friend Alberto Granado, Rodrigo de la Serna, before he completes his training. They set off to enjoy the scenery and feel that they have experienced new cultures but find their viewpoint on class and wealth inequality changed by what they witness. While on the road Guevara takes on some of the revolutionary beliefs that he would incorporate into his ideology when he became the Marxist leader of Cuba.\n\nIt is during the first half that we meet Guevara as a regular young man who may be more affluent than those who surround him but who is well meaning and lacks the self importance of Guevara the political leader. His attempts to get a girl even wealthier than him to sleep with him are thwarted and she burdens him with money meant to pay for a dress that she will wear. His irritation at her resistance to his affections felt like the feelings of a young man in his early 20s who is not quite sure of his place in the world. As he walks around with few burdens on his shoulders and a boundless optimism that can only be found in a young person the teenager in me connected to him. So many of us look back on this time in our lives with such fondness but we do not take into account the fact that you feel such fear and trepidation at this time in our lives. As he heads out on a journey he is afraid to leave behind prospects available at home such as his beloved girlfriend and is unsure of what he will find when he goes to these new and exotic places. It is so much easier to care for Guevara the young man than the great and noble political figure that the film tries to sell us on in it's second and third acts.\n\nThis impenetrability made me feel that the film was similar in some ways to Gandhi (1982) as although it does not stretch out to over three hours and feels less like a history lesson than that film it is hampered by some of the same problems. We are greeted too often with scenes of Guevara witnessing inequality in action and feeling that he needs to rectify the problems he sees but realizing that he does not have the power to do so. This is communicated once or twice effectively through seeing the photographs that Guevara has taken and then having a shot of Bernal's eyes looking concerned and misty with tears. There is only so much we can take before we get sick of Guevara and all of his goodness and as he ascends to saint like status he is less and less interesting. The film could have said something about the privileged position that Guevara comes from and what this allows him to feel. Is it wrong for a man who has been given everything to take on the plight of the working man and is he wrong to go off and lecture those around him when he once enjoyed the same privileges they have? The film chooses not to go near some of the thornier questions that could be asked and picks and chooses with it's minor criticisms of Guevara. It is an incomplete portrait at best and while entertaining at most it does not give a sense of the man as he truly was.",
            "review_date": "2020-02-05",
            "source": "rt"
        },
        {
            "content": "This was a great movie about a guy that wanted to save the world. Che's story was interesting, sadly though, he became bitter and violent in his later years.",
            "review_date": "2020-01-13",
            "source": "rt"
        },
        {
            "content": "Una medicina para el alma",
            "review_date": "2019-12-31",
            "source": "rt"
        },
        {
            "content": "Another masterpiece, a must see",
            "review_date": "2019-12-15",
            "source": "rt"
        },
        {
            "content": "Wonderful and insightful",
            "review_date": "2019-04-02",
            "source": "rt"
        },
        {
            "content": "better late than never..\n\nThe Motorcycle Diaries\n\nSalles's two wheeler ride may be uncomfortable but it is a success on reaching its destination, maybe not on time, but better late than never. Ticking for two hours, the journey does get hectic. But just as such long trip consists, it is brimmed with essential stops that juices up the track if it gets dry and weary. The concept calls for the storyline to be a series of different events and stops, but the performance holds you on your seat and gives you enough reason to stay till the last station arrives. As much as adaptive and layered the narration is, it isn't sharp, it doesn't speak to you a lot.\n\nYou have to search for it, nothing is served up front in here which is often good but only if it teases you to look for it and keep things intriguing. The rich cultures, beautiful live locations, real earthiness and a grounded dusty or cold roads does travel to you and on that tour-guide note it is a triumph. Aforementioned, the performance is what the feature thrives on. The passion wearing down and rebirthing itself from the ashes like a phoenix, Bernal is the apt companion to have for this trip. He is not confident, he is reserved, simple and more importantly makes mistake; a non provocative three dimensional character.\n\nSerna as his supporting character holds onto his part convincingly. This over thought out philosophical medicine is admirable but certainly not cinematic enough to balance the husky and crispy bits alongside. The characteristics of the protagonist keeps surprising you throughout the course, his ideologies, his stubborn nature, everything opens big arms for the audience. The Motorcycle Diaries is like a ride and a diary-writing-habit, it can be sweat inducing but in the end it's worth every drop of it.",
            "review_date": "2018-11-21",
            "source": "rt"
        },
        {
            "content": "Enjoyable picaresque coming of age movies with stunning scenery and a few well constructed laughs as well as the more serious stuff. If you do not care much for the film you can turn the sound off and look at the pictures. I do that with westerns and golf sometimes.",
            "review_date": "2018-08-13",
            "source": "rt"
        },
        {
            "content": "Seen 2016ish. no r/w",
            "review_date": "2018-05-14",
            "source": "rt"
        },
        {
            "content": "Really well acted and well carried out. Motorcycle Diaries portrays Che the human, and does a god job of explaining why he developed into the communist warrior of the Cuban Revolution.",
            "review_date": "2018-04-20",
            "source": "rt"
        },
        {
            "content": "Diario de Motocicleta\nLa película se trata de dos hombres argentinos, Ernesto \"Che\" Guevara y Alberto Granado. El gran Che no parece en esta peli como un revolucionario, ni como un mito, sino un joven, como tantos otros. El viaje de estos dos hombres empieza en Argentina, y termina en Venezuela. Su deseo es recorrer a toda América Latina en una moto. Guevara es un estudiante de medicina de 23 años y Granado es bioquímico. Durante el viaje usan esto en su favor, pareciendo ser doctores los dos, aunque Ernesto todavía no ha completado su educación. \nA mí me gusta la película porque es muy divertido e interesante. Es la adaptación de un diario escrito por estos hombres, es una historia de la amistad y superación. \nLe doy cinco estrellas.",
            "review_date": "2017-12-11",
            "source": "rt"
        },
        {
            "content": "Diarios de motocicleta se trata de Che Guevara antes de convertirse en un líder marxista revolucionario y guerrillero. En el viaje él vio mucha pobreza y otras injusticias. Su idea consiste de una América del Sur Unida.\nMe gusta la película, porque fue muy educativo y bien filmado. La película mostró la reaccíon del Che a las injusticias y entendimos mejor su mente.",
            "review_date": "2017-12-11",
            "source": "rt"
        },
        {
            "content": "The brilliant biopic road movie which is a must watch for all people who are passionate about travel.",
            "review_date": "2017-11-26",
            "source": "rt"
        },
        {
            "content": "Beautiful movie.  Life is fragile, and the nothing replaces the personal touch.",
            "review_date": "2017-10-15",
            "source": "rt"
        },
        {
            "content": "Inspirational, funny, pertinent and enterteining, The Motorcycle Diares is a profound look behind cuban revolution that tell us a story that really deserves to be told not only because of its heartwarming plot but also because of the lessons that it teaches.",
            "review_date": "2017-07-13",
            "source": "rt"
        },
        {
            "content": "Che Guevara, whose image graced a million walls and t-shirts is a fascinating and charismatic political figure of the 20th century but I found biopic of his early life stultifying and dull. It's a plodding, leaden trudge around South America during the 1950s as a young Guevara and friend go on a road trip of self-discovery that reveals pitifully little. I found it not the least bit engaging nor informative about the character of a man whom I have a deal of admiration for. It's an impenetrable and tedious traipse through some spectacular scenery and comes as a huge disappointment.",
            "review_date": "2017-06-04",
            "source": "rt"
        },
        {
            "content": "I give this movie credit for its acting and cinematography.  I cannot love it.  It sheds a good light on Che, who was one of the worse people in history.  He is responsible for thousands of deaths, and ordered hundreds of executions without trial.  He was a terrible person, and, frankly, I don't give a shit if he went on a sympathetic road trip once.",
            "review_date": "2017-05-13",
            "source": "rt"
        },
        {
            "content": "The Motorcycle Diaries, or more fittingly, The Whatever Mode Of Transport Happens To Be Available At The Time Diaries, is very much a mixed bag. The direction is excellent, the performances sincere and the photography is fantastic. It truly encapsulates what it feels like to experience your homeland and close neighbours in a way you never have before, and discovering a world hidden just below the surface which you were previously ignorant of. Its chief flaws are in its characters, or more specifically, their depiction. Our hero Mr. Guevara is painted as one of the saintliest individuals ever seen on the big screen. He's the kind of person who, upon seeing a person in pain or financial destitution, will wander off to a cliff edge or riverside to stare dejectedly into the distance. There's no indication that he'll soon become the violent and radical revolutionary whose likeness adorned many-a bedroom poster. Here he couldn't be any nicer if he were to wander around picking wild flowers and offering them to the elderly. Many of the people who they run into either have little to contribute or are simply there to group together and stare awkwardly into the camera in several incongruous and downright bizarre shots. It's not paced very well and only stretches to 2+ hours became of numerous unnecessarily protracted scenes. It's not interesting enough to be a character study and not explorative enough to be a road movie. It's mediocre at best, and isn't wholly worth the effort that must've went into it.",
            "review_date": "2017-04-24",
            "source": "rt"
        },
        {
            "content": "The early 20's of a man filled with passion and hope decides to travel across Latin America taking a break from medical school to learn about the continent which he had only read through books. Che along with his 30 year old biochemist friend Alberto Granado take their 'trusty' motorcycle on a 12,000km trip through the socially and geographically complex topography of Latin America. It's here that the revolutionary 'Che' was made. A film that sucks you completely inside and make you question the fundamental truths about life and if its worth fighting for.\nBoth Gael Garcia Bernal and Rodrigo De la Serna do wonderful work with the characters to make it an enriching experience. It's been one of the best viewings I've had since 'Into the Wild' a couple of years back. As Roger Moore has put it- \"Filled with the best kind of idealism\".",
            "review_date": "2016-10-05",
            "source": "rt"
        },
        {
            "content": "Not at all the type of movie that I like - but I couldn't take my eyes off of this earnest, realistic, beautifully shot movie that has no pomp or circumstance about it.",
            "review_date": "2016-07-23",
            "source": "rt"
        },
        {
            "content": "A masterpiece.The transformation from Ernesto de la Serna to Ernesto \"Che\" Guevara is a journey worth taking.",
            "review_date": "2016-07-16",
            "source": "rt"
        },
        {
            "content": "Although the film does not do justice to its subject - and perhaps none ever will - The Motorcycle Diaries is a honest and affecting road trip/biopic that sheds some light on the youth of the revolutionary Ernesto \"Che\" Guevara.",
            "review_date": "2016-06-24",
            "source": "rt"
        },
        {
            "content": "Pola zvezdice manje zato sto je komunjara",
            "review_date": "2016-01-14",
            "source": "rt"
        },
        {
            "content": "I was anticipating a pro-communist film, but instead, I sat through a mild adventure film.",
            "review_date": "2015-11-30",
            "source": "rt"
        },
        {
            "content": "If you can get over the lionization of a Communist guerrilla killer made out to be Jesus Christ (he's a blameless honest virgin, who walks on water and heals the leptons), and rather see this as a total work of fiction, it's a great movie totally worth watching - if for nothing else than the beautiful motorcycle tour around South America.",
            "review_date": "2015-09-19",
            "source": "rt"
        },
        {
            "content": "â??Yo ya no esto yo o por lo menos no esto lo mismo yo interior.â??\nThe final line of the Spanish dialogue which translates to â??I am already not myself or for the moment I am not the same person insideâ?? perfectly encapsulates the journey you experience and feel within the psychological state of Guevara.\n \nThe Motorcycle Diaries is a biopic of the iconic guerrilla revolutionary Che Guevaraâ??s 1952 expedition through South America with his friend Alberto Granado. An iconic figure today, but at the filmâ??s inception we know simply as Ernesto. You do not know Che yet therefore this is vital because it allows you to remove the universally well-known revolutionary image we have of him and understand his real story as if he was anyone else.\n \nThroughout, Ernesto is confronted by new knowledge about society that conflicts with his existing beliefs and values. Thus, the expedition acts as the catalyst for changing his understandings of life. The change is highly recognizable because at the beginning he was an innocent person seeking fun and adventure but by the end he is battling his inner bewilderment at the poverty of his surroundings. During the visit of Machu Picchu in Peru, these feelings are congealed into the blood of Ernesto and therefore from this point on you see the identifiable Che Guevara in the making.\n \nGael GarcÃ­a Bernalâ??s portrayal of Ernesto is spot on at monitoring the characterâ??s inner transformation. He is credible in portraying his change without disillusioning you; instead he further drags you into agreement and deep understanding of his cause. Sounds like a real microscopic view of a personâ??s inner struggles, but you have not even heard about the second half of the film. Yesâ?¦ I said half! Alberto Granado is Guevaraâ??s friend and plays a big part in catalysing Ernestoâ??s beliefs as they spend 9 whole months together. Alberto is characterised by his humour (just like Chandler in Friends), which also takes a lot of the pressure off Ernestoâ??s mental revolutions. They are polar opposites in terms of personality but you are never too caught up by the mental anguish you feel in Ernesto because of Albertoâ??s banterous interchanging with his buddy. Rodrigo de la Serna is seemingly comedic in nature as his interpretation of Alberto is natural and gives him almost equal importance to Ernesto. He experiences the change with him even if they are so different in personality yet nevertheless become friends for life. At the end of the film, there is a beautiful cameo by the 82-year-old Alberto Granado watching over the final scene.\n \nThe beautiful cinematography represents the splendours of the South American scenery. Their journey lasts more than 14,000 kilometres in which they travel through Argentina, Chile, Peru, Colombia and Venezuela. They actually travelled through half of all the countries of South America in 1952; Suriname and Guyana would later become independent states. The amount of countries visited by Guevara and Granado gave an opportunity for Brazilian born director Walter Salles to display his national continentâ??s beauty for what it wasâ?¦ and he does! He definitely makes sure South Americaâ??s most famous monument (Machu Picchu) marks the change in Ernesto.\n \nThe Verdict:\n \nIt does so well in removing all that international recognition from Guevara, that from the moment you see the young â??Ernesto,â?? you would not have expected to see a revolutionary â??Cheâ?? budding inside of him by the end of his journey.\n \nâ??â??â??â??â??â??â??â??â??â??        8/10",
            "review_date": "2015-09-17",
            "source": "rt"
        },
        {
            "content": "Great narrative film about south America and Che...how he changes during the road trip they have and character progression...with a beautiful cinematography that shows the beauty of south america...",
            "review_date": "2015-07-12",
            "source": "rt"
        },
        {
            "content": "81%\nSaw this on 24/4/15\nMost of the times it's extremely slow and uninteresting (may be because I don't know half a thing about Che Guera), but still somewhere it's a subtle drama.",
            "review_date": "2015-04-24",
            "source": "rt"
        },
        {
            "content": "All subtitled.  Such a great movie, very deep.",
            "review_date": "2015-04-22",
            "source": "rt"
        },
        {
            "content": "Charming and interesting phases. It has many different tones. Good performances.",
            "review_date": "2015-03-13",
            "source": "rt"
        },
        {
            "content": "I'll start by saying I can't pretend to know very much about the life of Ernesto Guevara, and the little I do know could be written down on a post-it note. My evaluation of this film is based on its execution as a movie and not as a an accurate historical account. \n\nI first heard of this movie as a teenager and at the time, watching a movie with the word \"diaries\" in it was of no interest to me. It sounded like it would be quite bland. Eventually I decided to give it a shot, and in the first scene I was hooked. The music, the cinematography, the internal monologue all brought me into a new world. Even just watcing a character packing a bag in the way it was presented was intriguing to watch and instilled the type of excitement in me as a soldier gearing up in a war movie. \n\nAs the film went on, I found myself learning about the world in which the characters lived in a way that reflected the main characters' own experiences, culminating in a final retrospective scene that really makes you realise where you started and where you ended up - both the characters and the audience. \n\nThe subtleties in this film in exploring grand themes is something every filmmaker should aspire to accomplish. It avoids the hyperbole often demonstrated in stories of personal growth and globe trotting. This was the first non-blockbuster film to shake me from my seat and really give me an idea of the beauty that filmmaking could be. \n\nThis movie, to  me, was flawless.",
            "review_date": "2015-02-02",
            "source": "rt"
        },
        {
            "content": "A necessarily languid movie about the trip that shaped Che Guevara's political beliefs that's a bit too long and a bit too preachy.",
            "review_date": "2014-12-31",
            "source": "rt"
        },
        {
            "content": "Quite a beautiful film observing two young men grow up a bit as they travel through western South America. Gael García Bernal has a radiant energy, perfect to play a young Che Guevara.",
            "review_date": "2014-12-30",
            "source": "rt"
        },
        {
            "content": "What makes this coming of age story so interesting is that it is about one of last century's most influential figures. The scenery coupled with the music makes for a grand tour of South America.",
            "review_date": "2014-10-19",
            "source": "rt"
        },
        {
            "content": "What happens when two friends go on a gap year to travel across South America on a motorcycle? The answer lies in the story of The Motorcycle Diaries, based on real life story of  Che Guevara who was a \"theoretician and tactician of guerrilla warfare, prominent communist figure in the Cuban Revolution.\" Ernesto \"Fuser\" Guevara, a medical student, and his friend Alberto Granado, biochemist, start their journey in 1952 from Buenos Aires on an old 500 Norton Motorbike very lovingly named \"La Poderosa\" meaning the mighty one. In the movie we see the events Ernesto experiences that force his personality and attitude to change and become the rebellious \"Che\" Guevara.  \nThe journey starts off a light at Che's girlfriend Chichina's house who tells him she'll wait on him but he should not \"take forever.\" By each place they advance through, it becomes more and more serious not just in terms of what they witness but also their physical conditions. They run out of money, shelter, food, their motorcycle breaks down and Fuser has an asthma attack. There are parts of the movie that'll keep you dying of laughter and there are some thought provoking scenes that'll make you cry. Che Guevara is played by the very handsome and immensely talented Gael García Bernal. He does an extremely convincing job of portraying that young, fierce, energetic man with a genuine, thoughtful side. Rodrigo De La Serna is very funny and equally impresive as the much older, less-serious Alberto Granado. De La Serna is actually a second cousin to the real life Ernesto. The supporting cast ranging from doctors, twin sisters, professor, coal miners and many more is diverse and very well casted.\n \tDirector Walter Salles does a great job of contrasting the two main characters that provides a good balance throughout the movie. Much of the writing comes from Che Guevara's original memoir called Travel Notes, later renamed The Motorcycle Diaries - and Granado's book Travels with Che Guevara. It seems that Salles has done a great job keeping the essence of that original journey because the still- living Alberto Granado, who is shown at the end credits, is happy with the outcome. \"The film shows what we were, which was two young men - boys, really - who went looking for adventure and found the truth and tragedy of our homeland,\" he says. The music by Gustavo Santaolalla is a reflection of the diverse cities shown in the movie. \"El Chipi Chipi\" will stick in your minds for days. Being a travel movie, the real charm of the film is the breathtaking land of South America all thanks to Eric Gautier for the amazing cinematography. It highlights Latin America's in all its glory, displaying the beauty of all its seasons. In just a small time, the audience feels connected to the place and its distressed people.  \nThe true beauty of The Motorcycle Diaries lies in the fact that though it is a political story of a historical leader, it is very approachable in spirit. It is more of a coming-of-age story of two young men than anything. It is one of the most unique biopics because, unlike most other ones, it goes deep in a person's youth and reveals how that person became influential without actually showing him at his most powerful status. It really makes the audience wonder who Ernesto Fuser \"Che\" Guervara was. Was he just a simple doctor wanting to cure and help people or this relentless leader that we know him as today? Why some people think of him as a hero and some think of him as a villain?  Overall, The Motorcycle Diaries is a road movie in all its forms; a road to self discovery, a road to discovery of other humans and a road towards the determination to change the world. Though The Motorcycle Diaries may fail for some history fans in terms of accuracy, I would highly suggest seeing it for its strong acting, entertaining story and beautiful cinematography.",
            "review_date": "2014-10-07",
            "source": "rt"
        },
        {
            "content": "Watchable and likeable adventure of two young Argentinians, at least one of whom starts to feel a bigger calling.",
            "review_date": "2014-09-27",
            "source": "rt"
        },
        {
            "content": "Heart Touching Journey by Che.",
            "review_date": "2014-09-14",
            "source": "rt"
        },
        {
            "content": "Perhaps Imran Khan ought to watch this. A \"revolutionary\" he is not!",
            "review_date": "2014-08-23",
            "source": "rt"
        },
        {
            "content": "One of the most beautiful, moving and important films I've seen.",
            "review_date": "2014-08-07",
            "source": "rt"
        },
        {
            "content": "How is it possible to feel nostalgia for a world I never knew?",
            "review_date": "2014-08-05",
            "source": "rt"
        },
        {
            "content": "Interesting, significant, and exiting!",
            "review_date": "2014-05-21",
            "source": "rt"
        },
        {
            "content": "A real masterpiece!! Brings a new perspective on life..",
            "review_date": "2014-05-03",
            "source": "rt"
        },
        {
            "content": "it seemed like opening up/into life!",
            "review_date": "2014-05-01",
            "source": "rt"
        },
        {
            "content": "great period piece(1950s). Great acting by Garcia Bernal",
            "review_date": "2014-04-14",
            "source": "rt"
        },
        {
            "content": "This is a wonderful work of drama, a memoir and a perfectly created road movie, where the two of friends decides to have a road trip throughout South America that is travelling about 14,000 kms in a bike. Well, one could only literally dream about this, but the fact is that they've attempted this mission to explore the continent they live, to see and experience things that they've only read about it. The initial sequences were quite funny and the two lead characters performed exceptionally well throughout the movie and had developed and executed a wonderful chemistry between them. The most beautiful thing is the transformation of the characters from the start of the journey till the end, and a great mystery to be revealed at the climax. Its much inspiring if you see through the life of characters and how the journey really changed their lives.",
            "review_date": "2014-04-01",
            "source": "rt"
        },
        {
            "content": "A biopic of Ernesto 'Che' Guevara before his revolutionist days, based on his own memoirs.\nGael Garcia Bernal delivers a great performance as the famous figure in his younger years, his destiny becoming shaped by the political upheaval in South America as he travels around it with his friend.\nIt's a good film, but it's doubtful I'd watch it again.",
            "review_date": "2014-03-26",
            "source": "rt"
        },
        {
            "content": "An exceptional film that starts off in a lighthearted manner, has gorgeous scenes of South America, and makes one realize how his experiences on this journey of the heart helped Che Guerva become the man whose memory is now so admired. A \"must see\" production.",
            "review_date": "2014-03-12",
            "source": "rt"
        },
        {
            "content": "A soulful and subtle road picture that captures the essence of Ernesto Guevara's political fight and ideas.",
            "review_date": "2014-02-28",
            "source": "rt"
        },
        {
            "content": "A pretty decent movie that gives me trills throughout. Though was one sided to the core.",
            "review_date": "2014-02-18",
            "source": "rt"
        },
        {
            "content": "Slow paced story of pre-revolution Guevara is too slow for my taste. Only the places he visited were amusing enough.",
            "review_date": "2014-02-10",
            "source": "rt"
        },
        {
            "content": "This movie definitely romanticizes Che and leaves out his questionable behavior from the actual Motorcycle Diaries (killing a dog, befriending a murderer on the loose, etc.). Still, this movie makes me want to jump on a bike and ride through that entire continent every time.",
            "review_date": "2014-01-05",
            "source": "rt"
        },
        {
            "content": "A surprisingly genuine and interesting road trip thru South America in 1952 with a young Che Guevara as he develops the ideology that he would eventually be known for. Beautifully and intimately shot, I was blown away by this carefully crafted and endearing character study. The relationship between Che and Alberto, and the people they encounter along the way, really sticks with me. It's subtle human realism in the writing and performances that keeps the story grounded. I look forward to revisiting this film again and again over the years. It's the kind of road trip movie that will continually reveal new nuggets of interest. The final few minutes of the film provided an emotional wallop and I loved the filmmaking style used to finish the story. The technique and imagery will never leave my imagination and will be a source of inspiration forever for me.",
            "review_date": "2013-12-31",
            "source": "rt"
        },
        {
            "content": "Excellent film1 brilliantly done & acted by two marvelous young newcomers. You will definitely see El Che differently after watching this ode to freedom & travels.",
            "review_date": "2013-12-31",
            "source": "rt"
        },
        {
            "content": "A+ must see!  The one thing I love about this movie is.  It shows the transition from medical doctor to revolutionary in a profound way. Kinda reminds me Malcolm X movie Directed by Spike Lee.",
            "review_date": "2013-12-23",
            "source": "rt"
        },
        {
            "content": "A very humble and low profile biography for such a big person as Che Guevara. This movie is able to beautifully depicted the journey, without too ambitiously pushing all the ideas that Che learnt. This movie really talks.",
            "review_date": "2013-12-18",
            "source": "rt"
        },
        {
            "content": "If you have not seen this movie yet, I recommend it to everyone !!!",
            "review_date": "2013-11-26",
            "source": "rt"
        },
        {
            "content": "I was... disappointed... I don't understand what all the hype about this movie was... actually found it a little lengthy and boring at times...",
            "review_date": "2013-10-06",
            "source": "rt"
        },
        {
            "content": "A good, ol' fashioned buddy road trip movie, in Spanish.",
            "review_date": "2013-08-30",
            "source": "rt"
        },
        {
            "content": "Beautifully shot and has two amazing lead performances, The Motorcycles diaries captures youth and the colorful landscape that changed the lives of two men, who went on to change the world",
            "review_date": "2013-08-16",
            "source": "rt"
        },
        {
            "content": "the film is better watched without the knowledge and background of what or who it was based on. this is the true punch in the gut of the film. it is also what was intended by its director.",
            "review_date": "2013-07-24",
            "source": "rt"
        },
        {
            "content": "Amazing movie experience.",
            "review_date": "2013-07-12",
            "source": "rt"
        },
        {
            "content": "Esplendido relato de uma jornada pelos contrastes de uma América pouco ou nada registrada nas telas. É difícil não se emocionar na terceira parte do longa quando Fuser e Granado chegam ao trecho mais marcante de sua jornada, o Peru e a colônia de leprosos de San Pablo. Salles e Rivera conseguiram construir uma metáfora perfeita da transformação daquele ainda então jovem asmático no futuro ícone da moderna revolución, Che, numa cena emblemática em que Ernesto de um lado do rio Amazonas olha inconformado as luzes distantes do leprosário e decide ir a nado, mesmo com toda sensibilidade de sua saúde, ao encontro dos enfermos para celebrar com toda a humildade seu aniversário ao lado de um povo sofrido que marca os objetivos de Guevara.",
            "review_date": "2013-07-06",
            "source": "rt"
        },
        {
            "content": "As a road trip film, it's stellar.  As a historical insight into the events and psychological gear grinding that influenced the revolutionary leader known as Che Guevarra, it falters.",
            "review_date": "2013-05-29",
            "source": "rt"
        },
        {
            "content": "A truly beautiful film that explores the life of Ernesto 'Che' Guevera before he became the revolutionary, the film explores the trip that he took with his best friend Alberto Granado. The film is an experience within itsself and it lets you know of who Che really was. The perosn who gave the best performance in the film was Rodrigo De La Serna. Buut this film is beauty in its highest form. This film should have won Best Picture, Best Director, best Adapted Screenplay, Best Score, Best Film Editing, and Best Cinematography.",
            "review_date": "2013-05-26",
            "source": "rt"
        },
        {
            "content": "The Motorcycle Diaries  starts off with a fun adventurous feel and strong chemistry between the leads, but the longer the film runs on the more boring it gets and the less involved I am in Che's emotional transformation.",
            "review_date": "2013-05-19",
            "source": "rt"
        },
        {
            "content": "Beauty of nature reflected in the human spirit, this is the world I wanna live in!",
            "review_date": "2013-05-07",
            "source": "rt"
        },
        {
            "content": "Beautifully filmed, and wonderfully portrayed by both of the film's leads. We saw a human side to the revolutionist, and it begs the viewer to ask questions about the world we live in.",
            "review_date": "2013-04-24",
            "source": "rt"
        },
        {
            "content": "A beautifully told story of the road trip that forever changed a young Che Guevara. It has all the best elements of any road trip movie, with the added bonus of emotional power, political commentary, and excellent performances.",
            "review_date": "2013-04-23",
            "source": "rt"
        },
        {
            "content": "The journey that changed Ernesto's life and made him the 'CHE'. Nicely portrayed!",
            "review_date": "2013-04-17",
            "source": "rt"
        },
        {
            "content": "Even if you don't agree agree with Che Guevara's ideas and views on capitalism, I'd still recommend this movie highly, or even the book, because you do get to see how this journey shapes him into the Che Guevara the world knows.  And you know, I would much prefer this type of movie rather than one that focuses on his post-revolutionary work since that would certainly skirt a middle-ground between people praising what he did and people deriding what he did.  And both sides would have valid points.  This film, on the other hand, since it doesn't focus on his 'work' as a revolutionary you can view the events of the film with an open mind.  Basically the film is a road film with Ernesto and Alberto traveling from Argentina to Venezuela and what he sees during the trip, how, in his view, capitalism and colonialism have driven into poverty the people that used to own those lands, the constant struggle of the lower class to make enough money just to have a meal to eat, and the fact that there was, when he volunteered at the San Pablo leper colony, a separation between those that were sick and the doctors that he simply did not agree with.  And how he wishes to end the separation between all Latin American countries and unite us all as a people, which is certainly an admirable goal.  The way he was presented in this movie, he was a man of the people.  And you have to wonder how he goes from, after the events of this film, an aspiring doctor to a revolutionary whose influence is still felt today.  Certainly the events of this film helped shape what he would become, but that is certainly something that fascinates me.  The film is certainly heartfelt and it's clear that the crew, at least the director and the producers, had a massive respect for the man because the film is as unbiased as can be.  Just because it reflects Che's viewpoints doesn't mean it condones socialism or communism, the beauty of it is is that it lets you make up your own mind about it.  The film also acts as a coming-of-age story because when Ernesto left he, and this sounds like a cliche, was still a boy.  And throughout his trip you get a very clear change that there was something in him that changed, something that made him mature and look at the world with vastly different eyes.  Of course a lot of this is in due part to Gael Garcia Bernal's performance as he certainly has that naive, boyish look at the beginning of the film.  Again, at the end, he looks and feels like a completely different person so Gael definitely did a great job at selling the character being transformed by his experiences.  That's not to say Rodrigo de la Serna, isn't great, because he is, it's just that Gael's performance is that good, it's certainly a more understated and while they do certainly tell you who he is, they don't beat you over the head with it.  All in all, this is an absolutely incredible movie about a fascinating man and the experiences that changed him.  It is informative and entertaining at the same time, so I certainly recommend this movie HIGHLY.",
            "review_date": "2013-04-10",
            "source": "rt"
        },
        {
            "content": "The ordinary stories of extra-ordinary people has always intrigued me. As a traveller and as someone who feels strongly for the less privileged and those who are treated unjustly, this was truly a god-level film. Goes without saying the story of friendship is exceptionally precious too. This movie will go down in my life as a turning point. I will never be the same again.",
            "review_date": "2013-03-10",
            "source": "rt"
        },
        {
            "content": "Argentina, Chile & Peru's sights were stunning, the movie entertaining. \nthe movie most likely romanticized ernesto aka che guevera but who cares (i did not) ; it was a movie about these 2 guys, their tight friendship and the road trip that changed how one of them viewed the big bad world out there.",
            "review_date": "2013-03-10",
            "source": "rt"
        },
        {
            "content": "A romantic guy with a soulful dream.",
            "review_date": "2013-03-02",
            "source": "rt"
        },
        {
            "content": "Humorous, lively, and boisterous at first, transcending into a sobering coming-of-age that defines the lead character's life passion and pursuit of what is right and just.  I didn't know it was about Che Guevara until halfway through the movie.  A refreshingly un-American portrayal of one of South America's greatest heroes.",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "Well done movie! very near to the diariy. Viva la victoria sempre!!!",
            "review_date": "2013-02-07",
            "source": "rt"
        },
        {
            "content": "a fairly enjoyable movie. the big problem with this movie is there is really no antagonist or sort of force attempting to stop the protagonists, che and alberto, from accomplishing their goal. it feels as if they can't fail. i did like how this film dug slightly into che's motivations to become the che guevara that everyone knows.",
            "review_date": "2013-01-29",
            "source": "rt"
        },
        {
            "content": "\"What do we leave behind when we cross each frontier? Each moment seems split in two; melancholy for what was left behind and the excitement of entering a new land.\"",
            "review_date": "2013-01-10",
            "source": "rt"
        },
        {
            "content": "???????????????????????????????????????????",
            "review_date": "2012-12-23",
            "source": "rt"
        },
        {
            "content": "Set in the 50's. That's when travelling really was a adventure. This movie included beautiful scenery footage epecially that of the inca trail to Machu Piccu. I've seen alot of travel programmes about this, but none has quite matched dramatic beauty associated with it as this old movie. It was interesting to see Che Guevara intitial source of inspiration as well as some really terrifying asthma attacks.",
            "review_date": "2012-12-10",
            "source": "rt"
        },
        {
            "content": "Inspiring without ever being too unrealisitic: this was a truly beautiful film, both to look at and to listen to. Amazing performances and fantastic scenery meant the slow pace never lost my attention. Really soulful  without ever being saccharine or patronising.",
            "review_date": "2012-12-10",
            "source": "rt"
        },
        {
            "content": "A brilliant road movie but for a movie about Che Guevarra it jumps to easy over any significant political moments.",
            "review_date": "2012-12-09",
            "source": "rt"
        },
        {
            "content": "A very good movie, re-watch to understand it more, enjoyable.",
            "review_date": "2012-12-07",
            "source": "rt"
        },
        {
            "content": "Pretty great. I wish I didn't have ADD though and could have paid attention better. Very heart warming. That's an icky word to use and is usually associated with a Hallmark movie but, it is.",
            "review_date": "2012-12-02",
            "source": "rt"
        },
        {
            "content": "A visually beautiful story but somehow falls short as a travelogue on  one hand and biopic on the other.",
            "review_date": "2012-11-27",
            "source": "rt"
        },
        {
            "content": "An inspiring story of a spiritual and life changing journey of two friends whose lives were changed forever. Well portrayed and directed.",
            "review_date": "2012-11-23",
            "source": "rt"
        },
        {
            "content": "Based on the travelogue of the 1952 road trip undertaken by 23-year-old Ernesto \"Che\" Guevara and his friend Alberto Granado across South America, Walter Salles takes us on a picturesque expedition but less of an inspiring spiritual journey transformed by witnessing the social injustices of exploited mine workers, persecuted communists, ostracized lepers, and the tattered descendants of a once-great Inca civilization.",
            "review_date": "2012-11-13",
            "source": "rt"
        },
        {
            "content": "A great movie about Che's early days before he became an internationally known rebel.  Gael Garci",
            "review_date": "2012-11-11",
            "source": "rt"
        },
        {
            "content": "The only film that close to draw tears out of my eyes, in years. Another one being Madagascar, of coz, as it's 7 quid wasted.",
            "review_date": "2012-10-24",
            "source": "rt"
        },
        {
            "content": "Excellent movie.  Beautifully done and a great story.",
            "review_date": "2012-10-19",
            "source": "rt"
        },
        {
            "content": "A truly astonishing movie. A movie that not only exposed the mind, but what motivates the mind. The Motorcycle Diaries is about two young men who travel across South America. These two men are Ernest Guevara and Alberto Granado. On their travels, Ernesto and Alberto come across many land and many people. A typical setting, but what makes this movie inspiring is the corruption of the government that is set behind the people that they meet. The Motorcycle Diaries is the telling behind the inspiration of a revolutionary, a man who after meeting several people, came with ideas and fought for those ideas. The chemistry with the two young leads is absolutely great, but their characters are a little cliched. Ernesto is the perfect, kind, and innocent one while Alberto is the sleazy, lazy, and confident one. Cliched, but the two leads are great. The story is a little cliched as well. A small group of travelers who plan to go travel across a certain area, while on the way they meet people who change their lives. Typical, but in this movie, is told great. The Motorcycle Diaries has its heart-felled moments while being serious and realistic. It's a great memorable movie with heart, but is also dark and can be cold hearted at times. But it still sinks itself into our hearts as being a great, serious, and revolutionary movie.",
            "review_date": "2012-10-12",
            "source": "rt"
        },
        {
            "content": "I read the book years ago and it changed my life. This film did the book justice.",
            "review_date": "2012-09-29",
            "source": "rt"
        },
        {
            "content": "B+\nA moving and entertaining glimpse into a fascinating tale, bound to become a legend.  Besides painfully handsome, Gael Garcia Bernal is chillingly sincere.",
            "review_date": "2012-09-21",
            "source": "rt"
        },
        {
            "content": "He is really a great actor, this is one of those movies that makes you think.",
            "review_date": "2012-09-20",
            "source": "rt"
        },
        {
            "content": "I SEE NOW \r\n. . . (Che's misadventures are planting the seeds of his commitment to socialism; this film buries the issues of class struggle much too deeply though and the issues get lost) \r\n\r\nGood but not CLASSIC.  It doesn't grab me by the neck and pull me into the screen -- it doesn't effect me.",
            "review_date": "2012-09-17",
            "source": "rt"
        },
        {
            "content": "La mejor pelicula producida en Mexico que he visto en mucho tiempo.......La gran actuacion de Gael Garcia Bernal como Ernesto Guevara De La Serna El ''Che'' Guevara es Impecable. Una verdadera obra. (:'",
            "review_date": "2012-09-10",
            "source": "rt"
        },
        {
            "content": "Loy Machedo's Movie Review - The Motorcycle Diaries (2003)\nThe Natural Flair to the movie with all its Authenticity, its Honesty and its Emotions takes its viewers into a time period Well Crafted and Creatively put forth by Brazilain Director Walter Salles. Gael GarcÃ­a Bernal & Rodrigo De la Serna deliver a performance that would draw you into their world of Idealism and Hope. A movie that takes you into a journey of soul searching youths only to end with them finding their purpose in life. I found it worth a watch. \nOverall Rating 7 out of 10.\nLoy Machedo\nloymachedo.com",
            "review_date": "2012-09-02",
            "source": "rt"
        },
        {
            "content": "\"Skinny Che and chubby Che\"...................Funny, beautiful, harsh, amazing movie!",
            "review_date": "2012-09-01",
            "source": "rt"
        },
        {
            "content": "Stunning on every level. Beautifully filmed and an incredible journey of self-discovery.",
            "review_date": "2012-08-14",
            "source": "rt"
        },
        {
            "content": "Makes me want to visit South America. Funny and moving. An eye-opening road trip inadvertently births one of the most recognizable revolutionists in the world, Ernesto \"Che\" Guevara.",
            "review_date": "2012-08-01",
            "source": "rt"
        },
        {
            "content": "The whole movie is an endearing journey.",
            "review_date": "2012-07-16",
            "source": "rt"
        },
        {
            "content": "Im not crazy bout movies with sub titles, but this one is good, funny and well - bout 2 friends on a motorcycle trip , worth checking out",
            "review_date": "2012-07-14",
            "source": "rt"
        },
        {
            "content": "This film completely blew me away - I loved every moment of it, and it made me want to learn more about Che and Latin America in general. The soundtrack fits beautifully with the feel of the movie and the cinematography was great - no frills, not making things look better than they actually are. Outstanding movie. Oh, and Gael isn't half bad in this either!\r\n\"No es este el relato de hazañas impresionantes. Es un trozo de dos vidas tomoadas en un momento en que cursaron juntas un determinado trecho con identidad de aspiraciones y conjuncion de ensueños.\r\nFue nuestra vision demasiado estrecha, demasiado parcial, demasiado apresurada? Fueron nuestras conclusiones demasiado rigidas? Tal vex. Pero eses vagar sin rumbo por nuestra mayascula America, me ha cambiado mas de lo que crei. Yo, ya no soy yo, por lo menos no soy el mismo yo interior.\"",
            "review_date": "2012-07-11",
            "source": "rt"
        },
        {
            "content": "a very profound movie about beautiful people. a must-watch",
            "review_date": "2012-07-07",
            "source": "rt"
        },
        {
            "content": "Such a beautiful film!",
            "review_date": "2012-07-05",
            "source": "rt"
        },
        {
            "content": "Whatever the intentions of its filmmakers what ultimately succeeds here is the opening of South America as more than simply a world party/nightclub stop as two young professionals put their promising  lives on hold for a bit in order to sightsee their own unknown and surprisingly impoverished continent.",
            "review_date": "2012-07-04",
            "source": "rt"
        },
        {
            "content": "A great road movie about an interesting (if not fascinating) person.\n\nGael Garcia Bernal proves once again that he's one of the more talented actors (not only in the Spanish-speaking world) as he plays the young Che (or Fuser) with enough charm, wit and enthusiasm that made him the energetic revoluzzer and T-shirt idol in real life.\n\nIt's an journey full of deprivation, a point which is emphasized in great detail. It doesn't change the fact that they could have easily break up the whole thing in the next town and return to their privileged homes (I can't decide if I find this to be positive because they never took the easy road or negative because they had always a plan B in petto).\n\nAfterwards, you can clearly understand Guevara's development into the famous (if not fanatic) revolutionist as he was confronted with poverty and social grievances all over Latin America. He encountered countless Indios who were robbed of their own land and forced to live a miserable existence (in the remains of their once proud civilization - best displayed in the Cuzco and Macchu Picchu scenes).\n\nThe Motorcycle Diaries is an intimate look onto an epic journey. Not without pathos, and actually missing a deeper look on Guevara's personality but providing enough material to understand his revolutionist turn that followed.",
            "review_date": "2012-07-04",
            "source": "rt"
        },
        {
            "content": "Two friends go on a great adventure, and it changes their lives forever. Captivating visuals, great acting, great story.",
            "review_date": "2012-06-20",
            "source": "rt"
        },
        {
            "content": "One of my top ten. Beautiful filmmaking from top to bottom. Go on an amazing road trip, take a history lesson, and get ready to be mesmerized by Gael GarcÃ­a Bernal, again.",
            "review_date": "2012-06-16",
            "source": "rt"
        },
        {
            "content": "Excellent, bien que ce ne soit vraiment pas mon style de film. Motorcycle Diaries ne respecte en rien le schéma narratif et circonstenciel d'une histoire tandis qu'il est difficile d'identifier un évènement déclencheur, un dénouement et une situation finale. Néanmoins, le voyage avec Gael García Bernal est très plaisant puisque ce dernier interprète son rôle à merveille.\n\nSeule chose: était-ce réellement nécessaire que le personnage soit CheGuevara? Selon moi, ça n'était que pour ajouter du sensationnalisme au film, puisque c'aurait pu être tout bonnement l'histoire de deux camarades. Au contraire, le film se termine par des épitres sur la cruelle note de la condamnation à mort de Guevara... De petits épitres qui étaient là pour sensibiliser le public, de petits épitres qui étaient là pour détruire tout le film...",
            "review_date": "2012-06-06",
            "source": "rt"
        },
        {
            "content": "amazing locations..loved Gael n the other one was also not too bad..",
            "review_date": "2012-06-02",
            "source": "rt"
        },
        {
            "content": "A great movie that gives some insight to the early life of Marxist revolutionary  \nChe Guevara....",
            "review_date": "2012-05-21",
            "source": "rt"
        },
        {
            "content": "One of memorable travel films of a motorcycle road trip. Che Guevara went on in his youth that showed him his life's calling",
            "review_date": "2012-05-06",
            "source": "rt"
        },
        {
            "content": "a little slow at parts, but was a very powerful movie.",
            "review_date": "2012-04-16",
            "source": "rt"
        },
        {
            "content": "idk che guevera but i like wat ernesto and granado did.and the last shot \\m/",
            "review_date": "2012-04-16",
            "source": "rt"
        },
        {
            "content": "One of the best movie I have seen! Still enjoy it a lot when I watched it a second time :)",
            "review_date": "2012-04-11",
            "source": "rt"
        },
        {
            "content": "Good, could've been better.",
            "review_date": "2012-04-10",
            "source": "rt"
        },
        {
            "content": "This is a very well filmed movie. It covers the trip that awoke Ernesto 'Che' Guevara to the injustices of the world.  Of course, much has been said of him, both positive and negative.  But this movie humanizes the legend.  It sure helped me understand him better.  First rate!!",
            "review_date": "2012-04-10",
            "source": "rt"
        },
        {
            "content": "A great film with all the funny, emotional, tragic moments a successful coming-of-age film should have.",
            "review_date": "2012-04-09",
            "source": "rt"
        },
        {
            "content": "If you see only one foreign language film in your life, make it this one. Superbly written and well performed. A movie that covers so much of humanity in just over two hours - amazing",
            "review_date": "2012-03-31",
            "source": "rt"
        },
        {
            "content": "A story of a young Che Guevara and his friend traveling through Latin America and developing a social conscience.  One of the better \"journey\" films I've seen.",
            "review_date": "2012-03-21",
            "source": "rt"
        },
        {
            "content": "*The* only movie I ever like better than the book. Beautiful and delicate, yet so vivid!",
            "review_date": "2012-03-10",
            "source": "rt"
        },
        {
            "content": "Great movie, like the way Che Guevara was depicted in this movie, his idealism is great. Direction and acting was done properly.",
            "review_date": "2012-03-09",
            "source": "rt"
        },
        {
            "content": "amazing journey of Che",
            "review_date": "2012-03-09",
            "source": "rt"
        },
        {
            "content": "Great Spanish film with pleasant scenery, music & storyline.",
            "review_date": "2012-03-07",
            "source": "rt"
        },
        {
            "content": "This seems like a typical road trip film and the plot was not compelling enough to hold my attention.  There was some very incredible scenery (I loved the Macchu Picchu sequence).  Also, this deals with Che Guevera- the future communist revolutionary.  For one who understands who Che is, that might make this film hard to swallow which takes a very naive (in my opinion) look at the future leader who would censor free speech and expression and have a negative influence on Cuba.",
            "review_date": "2012-03-02",
            "source": "rt"
        },
        {
            "content": "With any political stance aside, which I'm sure I don't agree with the philosophy of Che Guevara, this an extremely beautiful film. It shows a picture of Che as a young man, a medical student, honest & compassionate, which he most likely was before his turn to revolution. The story is touching & unflinchingly human. Chemistry between the leads, Gael Garcia Bernal & Rodrigo de la Serna, is tremendous. Everything about it is wonderful, the acting, the scenery, the music & the heart warming adventure it takes you on.",
            "review_date": "2012-03-02",
            "source": "rt"
        },
        {
            "content": "This brilliant biopic tells the story of Ernesto Guevara before the world knew him as Che Guevara, as he travels through South America on a motorcycle and meets the people who will change his political views. Much of the first half of the Motorcycle Diaries is the somewhat frivolous adventures of Ernesto and Alberto as they move around, sleep around and have fun whilst travelling across the continent, crossing some of the most beautiful scenery in the world. The scenes at Macchu Picchu in Peru are some of the film's most breathtaking moments. But for the most part, it remains very down-to-earth, presenting Ernesto as a vulnerable human being like the rest of us, suffering from violent asthma attacks, and who is visibly pained by the scenes of injustice he encounters on his journey. It doesn't take the route which many biopics take, that is, to focus almost entirely on a person's political career after they became powerful, and instead focuses entirely on the events that led up to this; the transformation. Che Guevara was one of the most selfless figures of modern history, but the Motorcycle Diaries shows the flaws as well as the greatness; an honest and humanised look at one of the most remarkable revolutionaries of all time, and one of the best personal portraits ever depicted in film.",
            "review_date": "2012-02-23",
            "source": "rt"
        },
        {
            "content": "Has the unfortunate habit of being overbearing.",
            "review_date": "2012-02-22",
            "source": "rt"
        },
        {
            "content": "A marvelous road picture and boys-become-men adventure, full of the best kind of idealism.",
            "review_date": "2012-02-22",
            "source": "rt"
        },
        {
            "content": "it was sort of fascinating, i never was such a fan of Che guevara himself ..obviously this film gives a deeper  view inside his political view, but i still think he would have been more an admireble person by going on with his medical profession by helping poor people instead of being the right hand of a dictator",
            "review_date": "2012-02-18",
            "source": "rt"
        },
        {
            "content": "Excellent foreign film, you forget you're watching a movie even with the subtitles.  Portrays the coming of age side of Che Guevara and avoids the \"revolutionary\" firestorm normally associated with Che.",
            "review_date": "2012-02-13",
            "source": "rt"
        },
        {
            "content": "One of the finest non-English language films that I have seen. Great chemistry between Gael Garcia Bernal and Rodrigo de la Serna. Lots of symbolism of injustice throughout the film, beautifully captured by Walter Salles. A bit slow paced in the beginning but the pace quickened in the second half, which made it better. A must-see for all revolutionary historians, social historians, and future revolutionaries.",
            "review_date": "2012-02-12",
            "source": "rt"
        },
        {
            "content": "Well, it's no Easy Rider!",
            "review_date": "2012-02-10",
            "source": "rt"
        },
        {
            "content": "it's a real coming of age film.  also sad that their is still so much injustice in the world.",
            "review_date": "2012-02-02",
            "source": "rt"
        },
        {
            "content": "Che before he was CHE. I like to think that this moment in my life is the time I am John before I am JOHN. Most of these efforts don't work but I liked this film. We really get a sense of young men discovering injustices in a way that compels them to do something about it in their later days.",
            "review_date": "2012-01-27",
            "source": "rt"
        },
        {
            "content": "Surprisingly very well done. Has a strong build and feels very authentic.",
            "review_date": "2012-01-19",
            "source": "rt"
        },
        {
            "content": "Aventura apaixonante de Che Guevara e seu amigo Alberto Granado, a descoberta interior resultante do confronto com a realidade da AmÃ (C)rica do Sul dos anos 50. Maravilhosas interpretaÃ§Ãµes e realizaÃ§Ã£o :)",
            "review_date": "2012-01-17",
            "source": "rt"
        },
        {
            "content": "http://filmreviewsnsuch.blogspot.com/2012/01/motorcycle-diaries.html",
            "review_date": "2012-01-16",
            "source": "rt"
        },
        {
            "content": "You guys have to see this movie!! I know you probably never heard about it, but it's a must see.. Trust me on this one.. It's a biography on Che\nGuevara",
            "review_date": "2012-01-15",
            "source": "rt"
        },
        {
            "content": "What surprised me the most was that this film is based off of the memoir that was written and actually traveled by the revolutionist, Che Guevara. Although, this does not portray the rise of his revolution and portray any scenes that involve him leading his guerilla. Instead, this film focused on the friendship of Che and Alberto, following the young years of Che's life, and giving insights toward his reason of quitting medical school to become the revolutionist that made him famous. Che and Alberto have different characteristics behind them, making these characters likable and great for this buddy film. Che is this adventurous, young man and Alberto is a biochemist who is quite perverted and seeks sex with women. As perverted as Alberto is, the film does not show any sex scenes that did not lead to any sort of drag, which I actually liked. Also, there are some character structure behind Che, as you see him change throughout the course of the film. He starts off as a young man, just ready for an adventure; however, as he sees the world around him and realizes the flaw the his country contains, you can see that sudden change in him, making him think that the country needs to change and that someone must do it.\r\n\r\nThe film was definitely well made and well presented, as you follow the characters travel, making you feel that you are part of the crew, which I thought was a nice touch. On the other hand, I really thought that there were some slow moments that did cause the film to drag at points. Personally, there were one too many scenes that portray the characters traveling in their bike, interactions with certain townsfolk, and to present scenes of these characters doing something with the folks. The characters were losing money so they had to talk to the townsfolk or people who can help them, which definitely was needed; however, after you see the folks help out, for some reason, the folks are about to hold a party and invite them over. These were quite unnecessary as it held no actual point to the whole plot. As a biopic, this film is pretty good; however, with its long length, it would have been better to speed up the pacing of the film and to not depict some of these scenes.\r\n\r\nI really liked how the film starts off as this buddy movie and completely changes the tone as the film reveals the main motive that the film wanted to present. You see the excitement that these two were ready to go through and you'll be quite curious to see what they will encounter during their travels. During the latter half, on the other hand, things start to get serious, as they begin to lose money and they start to see the reality that lies in the continent that they live under. The environment is going through a pretty bad crisis and the film did a great job of depicting how bad the environment is. Not only does the film explain the surroundings in dialogue, but illustrates in various scenes of the environment that will allow viewers to see and understand what made Che decide to become a revolutionist. The film did a good job of providing information of what you need to know about this continent; you will see that the people are poor, the government is not even caring about the problem that South America faced at the time, and the economy is pretty bad. \r\n\r\nThe main focus is Che and Alberto and both actors portraying as these characters were a perfect match. I really liked the performances that both of these actors have done with their characters. Usually in a buddy film, or anything where two characters are the main focus of the film, you have to at least make them likable and diverse from each other in order to make the audience not be annoyed with their existence. I really liked the diversity behind these characters, as they really helped made the film interesting to watch. Both have a different perspective and have different ideas that you can actually see. \r\n\r\nAlthough not exactly showing the revolution, by watching this, you understand what made Che change and why he decided to lead the revolution. If you want to learn about Che, this is a nice film to watch to learn about him. This film was a good buddy film, good biopic, flaws with various scenes, diverse characters, and portraying the bad environment that South America was going through at the time very well.",
            "review_date": "2012-01-10",
            "source": "rt"
        },
        {
            "content": "hard to get into but worth it in the end",
            "review_date": "2011-12-21",
            "source": "rt"
        },
        {
            "content": "I forget exactly how I first heard about this foreign film, but I actually have been looking forward to seeing it for quite some time. Gael Garcia Bernal had won me over Y Tu Mama Tambien and supposedly he's a rising star in the Latin film industry, so I assumed he has an eye for good scripts. What I found in this movie was a highly intelligent and excellently acted story about a young Che Guerva, a man who eventually becomes a communist revolutionary. This tale supposedly tells us how he comes to form his beliefs after a cross-continental trip thru South America with his best friend. While I thought it definitely contained all the elements for an award winning film (such as great direction, beautiful cinematography, and a powerful script), to me it was missing that something extra that made it worthwhile. Bernal's character seemed like a very compassionate, altruistic, and outspoken person from the very beginning, so I honestly did not see the evolution of his character like I was expecting. At the very least, though, it deserves the many accolades it got and would recommend this film to other foreign film enthusiasts.",
            "review_date": "2011-11-11",
            "source": "rt"
        },
        {
            "content": "Well made film, surprising that film four did a film entirely in Spanish. I liked it",
            "review_date": "2011-11-07",
            "source": "rt"
        },
        {
            "content": "An amazing, inspiring, beautiful film. Pleased to have spent my Friday night consumed in this unforgettable story based on the young Ernesto \"Che\" Guevaraâ(TM)s adventurous, life changing journey through South America.",
            "review_date": "2011-11-05",
            "source": "rt"
        },
        {
            "content": "The Motorcycle Diaries is a wonderful, heartfelt film about two Argentinians who decide to bike across South America from Buenos Aires, to Valpariso, and on to Machu Picchu and Caracas in Venezuela.  Gael Garcia Bernal and Rodrigo de la Serna star in this beautifully photographed, profound film, but the film doesn't go into any details about Ernesto \"Che\" Guevara's life as the Cuban Revolutionary, and the story gets pretty scattered and it's sometimes hard to know where they are in the trip or how they got to where they are.",
            "review_date": "2011-10-24",
            "source": "rt"
        },
        {
            "content": "Amazing movie. A real heartwarming and yet somewhat funny story of the beginnings of Che Guevara and his mark on Latin America. Even though the film was completely in Spanish and I had to watch the subtitles the entire time, it took nothing away from the impact of the film and how great it was. Bernal is a great actor and he really made me love this movie.",
            "review_date": "2011-10-22",
            "source": "rt"
        },
        {
            "content": "\"When you cross a border each moment seems to be split in two- melancholy for what was left behind and on the other hand all the enthusiasm at entering new lands.\"",
            "review_date": "2011-10-18",
            "source": "rt"
        },
        {
            "content": "I LOVED this movie .... I wanna know more about this man, Che.  Has anyone seen \"Che\" with Benicio Del Toro?  Worth a watch?",
            "review_date": "2011-10-16",
            "source": "rt"
        },
        {
            "content": "Fantastic little film recommended to me by someone beautiful. It starts off with two mates 23 year old doctor to be Ernesto and 29 year old biochemist Alberto starting on a very crappy motorbike to navigate the length of a continent they've only read about in books, South America. They start off having a fun, mild mannered trip but something happens along the way that changes them. They are never quite the same when they finish. Ernesto would grow up to be Che Guevera, a man who I know nothing about but am intrigued to learn more now. The film has a very improvisational feel to it, some of the travelling sequences could've probably just been made up. There is some subtle humour there mostly from Alberto. The acting is top fucking notch and an understated score helps elevate the mood. Great film, recommended.",
            "review_date": "2011-10-16",
            "source": "rt"
        },
        {
            "content": "This movie broadens the view by taking you on a journey to a different, but real world...a mustard!",
            "review_date": "2011-10-02",
            "source": "rt"
        },
        {
            "content": "Not really my cup of tea, but it deserves a 4 stars. This movie touches with morality without being overwhelming, it's nice and smooth, fun sometimes... \"Effective\" I guess that's the word.",
            "review_date": "2011-09-19",
            "source": "rt"
        },
        {
            "content": "A true story about self discovery of Ernesto ChÃ Guevara.Very inspiring and touching..A must see movie...",
            "review_date": "2011-09-18",
            "source": "rt"
        },
        {
            "content": "Excelente Pelicula, me diverti mucho con esta movie y decir que fue una grata experiencia verla, desde el simbolismo del personaje del CHE, hasta lo humano de los protagonistas.",
            "review_date": "2011-09-12",
            "source": "rt"
        },
        {
            "content": "Very well done, another one I wanted to see in the theater, scored on DVD for $6. Beautifully shot, well acted, doesn't pound the politics into your head.",
            "review_date": "2011-09-11",
            "source": "rt"
        },
        {
            "content": "Beautiful scenery. Natural way of acting. Nice story. I didn't know much about Che Guevara, and still I don't know much about what he has done. But know more about his motives.",
            "review_date": "2011-09-11",
            "source": "rt"
        },
        {
            "content": "Looks beautiful and has a lot of heart but the real depth here seems to be forced.",
            "review_date": "2011-09-03",
            "source": "rt"
        },
        {
            "content": "Daaaaaaaaaaaamn, I was not ready 4 this today... =')...",
            "review_date": "2011-08-28",
            "source": "rt"
        },
        {
            "content": "Extremely interesting movie about Ernesto 'Che' Guevera's early life. Had no idea that he was in medical school, or about this epic trip he took that opened his eyes to the improvrishment of the people throughout South America. Definitely a good intro movie about the life of Che.",
            "review_date": "2011-08-19",
            "source": "rt"
        },
        {
            "content": "Let the world change you\nThen you change the world.",
            "review_date": "2011-08-11",
            "source": "rt"
        },
        {
            "content": "The Pre-revolutionary chapter from the life of Guevara & his friend Granado  based on their published diaries. Guevara the human here we meet & know. \n\nIt's a story of a man who loved South America told by another man who loves it too",
            "review_date": "2011-07-23",
            "source": "rt"
        },
        {
            "content": "Scripted with a peace loving heart and directed the same way, this movie makes the viewer familiar to part of life of Che Guevara when he was just a kid.",
            "review_date": "2011-07-20",
            "source": "rt"
        },
        {
            "content": "Director \"Walter Salles\" once again takes us on another amazing journey as we hit the road on a motorcycle with two young educated Argentinians Ernesto \"Che\" Guevara de la Serna when he was 23 years old. He and his friend, Alberto Granado are typical college students who, seeking fun and adventure before graduation, decide to travel across Argentina, Chile, Peru, Colombia, and Venezuela in order to do their medical residency at a leper colony. \"The Motorcycle Diaries\" is based on the journals of Che Guevara, leader of the Cuban Revolution. In his memoirs, Guevara recounts adventures he, and best friend Alberto Granado, had while crossing South America by motorcycle in the early 1950s.\nDuring their expedition, Guevara and Granado encounter the poverty of the indigenous peasants, and the movie assumes a greater seriousness once the men gain a better sense of the disparity between the \"haves\" (to which they belong) and the \"have-nots\" (who make up the majority of those they encounter). These encounters with social injustice transform the way Guevara sees the world, and by implication motivates his later political activities as a Marxist revolutionary.\n\n- Before he changed the world the world changed him.\n\n(C) 2011 Sahand Mohammadi",
            "review_date": "2011-07-18",
            "source": "rt"
        },
        {
            "content": "Bernal as Che performs well, along with the rest of the cast. It is fairly a simple film, with beautiful cinematography. I found it interesting to know how Che, became what he is remembered for. Fine film.",
            "review_date": "2011-07-08",
            "source": "rt"
        },
        {
            "content": "Excellent, if a bit of a slow burn.",
            "review_date": "2011-07-04",
            "source": "rt"
        },
        {
            "content": "The Machu Picchu, Peru scenes were awesome.\nGael Garcia is such a good actor!",
            "review_date": "2011-06-25",
            "source": "rt"
        },
        {
            "content": "An absolutely gorgeous film.",
            "review_date": "2011-06-22",
            "source": "rt"
        },
        {
            "content": "Such a good movie.The story about Che Guevara and his friend Alberto Granado's road trip in a motorcycle.A must watch movie.",
            "review_date": "2011-06-21",
            "source": "rt"
        },
        {
            "content": "interesting to say the least...enjoyed.",
            "review_date": "2011-06-18",
            "source": "rt"
        },
        {
            "content": "Great writing, great acting, great movie.",
            "review_date": "2011-06-17",
            "source": "rt"
        },
        {
            "content": "\"Easy Rider\" starring Che Guevera.",
            "review_date": "2011-06-14",
            "source": "rt"
        },
        {
            "content": "i wanna be lik CHE !!!!!!!",
            "review_date": "2011-06-12",
            "source": "rt"
        },
        {
            "content": "GREAT MOVIE ! I like the beautiful view and cultural of South American in this film also.",
            "review_date": "2011-06-12",
            "source": "rt"
        },
        {
            "content": "Like one of the critic said, interesting in the manner of a travelogue but simplistic as a study of Che's political conversion.",
            "review_date": "2011-06-12",
            "source": "rt"
        },
        {
            "content": "Inspirational. When you're done watching the movie, you'd want to stand up and make a difference.",
            "review_date": "2011-06-04",
            "source": "rt"
        },
        {
            "content": "Walter Salles has succeeded in producing a faithful and accessible tale that genuinely moves",
            "review_date": "2011-06-03",
            "source": "rt"
        },
        {
            "content": "A film about the modest, humble beginnings of Ernesto Guevara. Ernesto dabbles in political idealism while he embarks on an adventure on his crappy motorcycle with his friend Alberto Granado. A great adventure film, must see!",
            "review_date": "2011-05-30",
            "source": "rt"
        },
        {
            "content": "one of the best films i have ever seen\nThanks to Sohail !!!... remembering the good times :)",
            "review_date": "2011-05-26",
            "source": "rt"
        },
        {
            "content": "This film totally blew me away. I loved every moment of the movie but I particularly enjoyed the genuine on-screen chemistry between the two main characters. Their friendship was so touching without them seeming to realize it at all. This is without a doubt one of the best foreign films I have ever ever seen and I would greatly recommend watching it. I think Gael Garcia Bernal also deserves a very special mention for his outstanding lead performance in this film, but Jamie Foxx took home the award, well that's OK to me. Of course he would not have been able to portray this role as well as he did without the excellent script and a very strong supporting cast but I still believe that he was the perfect choice for this role, so well done to the people in casting who worked on this film. A genuinely touching, unique and quietly brilliant film detailing one of the most beautiful friendships I have seen on screen. And also knowing who Che Guevarra was before he became a revolutionist, was such brilliant, now we know who this guy is on some T-Shirts. \nWell, God Almighty, would I say more? Yes, like I say from those hardships and sacrifices and pains and emotions and guilts from these two characters, we truly affected by them, it's seriously one of the best foreign films I've seen. A story of life not just about that motorcycle. \nAnd again to Mr. Anthony Lawrie, try to rewatch this movie, and for sure you're gonna give this film 5 stars now instead of 4.5 stars, and do you have one of those T-Shirts with Che on it?",
            "review_date": "2011-05-25",
            "source": "rt"
        },
        {
            "content": "Bagus! Sebuah petualangan 2 orang sahabat yang berubah menjadi perjalanan yang menyentuh nilai-nilai kemanusiaan. Sebuah perjalanan yang mengubah hidup Ernesto menjadi seorang tokoh revolusioner Kuba, Che Guevara.",
            "review_date": "2011-05-20",
            "source": "rt"
        },
        {
            "content": "completely inspirational. Gael Garcia Bernal. idealistic!",
            "review_date": "2011-05-08",
            "source": "rt"
        },
        {
            "content": "Another great movie I love!!",
            "review_date": "2011-05-07",
            "source": "rt"
        },
        {
            "content": "realan, zanimljiv, odliÄ?ne atmosfere.",
            "review_date": "2011-05-03",
            "source": "rt"
        },
        {
            "content": "Really enjoyed it. An 'arty' road movie. Makes me want to travel more.",
            "review_date": "2011-05-01",
            "source": "rt"
        },
        {
            "content": "Excellent road trip movie! These are the folks in charge of the long-awaited adaptation of Kerouac's \"On the Road.\" Oh, please, I hope that turns out to be just as good!",
            "review_date": "2011-04-30",
            "source": "rt"
        },
        {
            "content": "Great story following a young Che, gripping.",
            "review_date": "2011-04-29",
            "source": "rt"
        },
        {
            "content": "Stick till the end (it might prove wearisome for some) to reap the benefits of this film",
            "review_date": "2011-04-11",
            "source": "rt"
        },
        {
            "content": "A beautifully set and shot movie that accurately depicts both the story of 1950s Latin America and the growth of Ernesto Guevaras relationship with the area.\nWith some incredibly moving scenes throughout, particularly at the clinic in San Pablo this is a great movie that's only slightly let down by a fast script that I struggled to keep up with in subtitles.",
            "review_date": "2011-04-03",
            "source": "rt"
        },
        {
            "content": "awesome movie of che!",
            "review_date": "2011-03-28",
            "source": "rt"
        },
        {
            "content": "puffchunk is a postmodernist. it doesnt praise guevara, it's about what shaped his/anyone's ideology",
            "review_date": "2011-03-13",
            "source": "rt"
        },
        {
            "content": "8 aÃ±os despuÃ (C)s reciÃ (C)n veo tremenda pelÃ­cula.\r\nSi tan sÃ³lo hiciÃ (C)ramos germinar una semilla del Che en cada uno... Demasiado romanticismo o simple nostalgia.. bah!\r\nA dormir!",
            "review_date": "2011-03-11",
            "source": "rt"
        },
        {
            "content": "Garcia Bernal is always great :)",
            "review_date": "2011-03-09",
            "source": "rt"
        },
        {
            "content": "A beautifully shot story. Loves it!",
            "review_date": "2011-03-07",
            "source": "rt"
        },
        {
            "content": "A beautiful movie that must be considered without the influence of one's political perspective.",
            "review_date": "2011-03-06",
            "source": "rt"
        },
        {
            "content": "Brilliant, or darest I say revolutionary!!!",
            "review_date": "2011-03-05",
            "source": "rt"
        },
        {
            "content": "VoilÃ  un film qui me laisse une impression rÃ (C)ellement mitigÃ (C)e. Outre le fait que tout est assez convenu dans le dÃ (C)roulement, on sait au fond ce qui va se passer, il fallait donc jouer sur d'autres cartes pour pouvoir sortir du lot. D'une part, le voyage qu'entreprennent Ernesto et Alberto est remarquable. On s'attend donc Ã  voir des paysages merveilleux et une foule de personnes. Si c'est bien le cas, il faut par moment avouer que la beautÃ (C) des paysages est gÃ¢chÃ (C)e par cette voix off contant les diffÃ (C)rentes lettres d'Ernesto Ã  sa mÃ¨re. Une voix off cruellement dÃ (C)cevante et qui n'apporte pas grand chose de plus aux diffÃ (C)rentes images puisque la transformation de Guevara se fait petit Ã  petit et se voit aussi bien Ã  l'Ã (C)cran. La seconde partie, dÃ¨s la lÃ (C)proserie se rÃ (C)vÃ¨le bien plus intÃ (C)ressante et offre certainement les plus belles sÃ (C)quences de l'oeuvre (la sÃ (C)paration de la riviÃ¨re et un Che prenant dÃ (C)jÃ  parti pour les plus dÃ (C)munis et puis la sÃ (C)quence de dÃ (C)part, chargÃ (C)e comme il faut en Ã (C)motions). Je regrette aussi cette volontÃ (C) d'idÃ (C)aliser un peu trop le personnage du Che (par exemple, il ne ment jamais...) et le communisme en gÃ (C)nÃ (C)ral.",
            "review_date": "2011-03-03",
            "source": "rt"
        },
        {
            "content": "Never think of Fernando Meirelles as our representative director. Here is again our Walter Salles. The first part of Che's life. Insightful. After, \nAugust Rush, my soundtrack!",
            "review_date": "2011-02-26",
            "source": "rt"
        },
        {
            "content": "Itâ(TM)s 1952 and Biochemist, Alberto Granado, has a dream to ride around Latin America on his old motorbike. For company he invites his friend, medical student, Ernesto Guevara de la Serna.\nThe eight month journey sees the pair have trouble after trouble with the bike but throughout the many towns they visit they experience hard ships of the people they encounter shaping them into the men of the world and laying the very foundations of the man we all know as Che Guevara.\nThis biographical film looks at the young life of Che Guevara. This story was taken from his own personal journals. If it wasnâ(TM)t for this trip 5 years previous of the Cuban Revolution Guevara would have remained in Buenos Aires and life could have been very different. Before this life enhancing trip he was a naive child with rose coloured glasses blinding his eyes. The suffering he witnessed made the man grow and want to fight for the right of the little man.\nDirector Walter Salles captured the authenticity of this story perfectly, Instead of what could be seen as some who have not seen the film as a road trip movie, he has captured one manâ(TM)s growth of empathy and spiritual awakening.\nGael Garcia Bernal as Che really brought this character to life, making the character his own bringing the story to life. He really made that connection with the character which drags you in. An outstanding performance.",
            "review_date": "2011-02-23",
            "source": "rt"
        },
        {
            "content": "Bernal and De La Serna are impeccable in a beautiful eyewitness-style drama of Che Guevara which avoids preachiness.",
            "review_date": "2011-02-20",
            "source": "rt"
        },
        {
            "content": "Writing a paper on this move about Che Guevara i reccomend it pretty good movie.",
            "review_date": "2011-02-16",
            "source": "rt"
        },
        {
            "content": "Latin American road trip taken by Che Guevara back in '52",
            "review_date": "2011-02-10",
            "source": "rt"
        },
        {
            "content": "Ã impossÃ­vel nÃ£o comeÃ§ar a ver o filme com um certo nÃ­vel de expectativa, que definitivamente nÃ£o Ã (C) correspondida.",
            "review_date": "2011-02-07",
            "source": "rt"
        },
        {
            "content": "Read the book years ago, finally got round to the movie... very good... especially the last hour",
            "review_date": "2011-02-06",
            "source": "rt"
        },
        {
            "content": "Subtitles. Che Guevara's motorcycle trip around Latin America, which determined his calling in life. Worth watching.",
            "review_date": "2011-02-04",
            "source": "rt"
        },
        {
            "content": "really interesting road movie, great cinematography, and stunning scenery. will make you want to travel again!",
            "review_date": "2011-02-03",
            "source": "rt"
        },
        {
            "content": "Should be considered one of the classic road movies. The sub-narrative of how Ernesto's ideals began to develop was handled well - if 'subtly obvious' wasn't oxymoronic, that's how I'd describe it. But this is first and foremost a road movie, and it's a great one.",
            "review_date": "2011-01-20",
            "source": "rt"
        },
        {
            "content": "Truly inspirational.  Top 10 best movies of all time.  Go Redford.",
            "review_date": "2011-01-18",
            "source": "rt"
        },
        {
            "content": "I liked this movie more for the landscapes and the final message, but i really think that could be so much better...",
            "review_date": "2011-01-18",
            "source": "rt"
        },
        {
            "content": "magnificent!  i'm going to watch this one or two more times, and then i'll pour my heart out on it.  for now, chronicles of a young ernesto 'che' guevara and his impromptu trip from hometown argentina to venezuela by motorcycle, hitch-hike and foot.",
            "review_date": "2011-01-17",
            "source": "rt"
        },
        {
            "content": "Normalmente no me gustan los \"road movies\", pero esto me ha tocado. Quería verlo desde hace mucho tiempo, y al final esta noche conseguí verlo. Es bastante fuerte, socialmente, mas que todo. No he leido los libros de donde han sacado esta pelicula, entonces no puedo saber si es fiel o no, pero solo el hecho de un adventura de seis meses por el sudamerica valdria por toda una vida.",
            "review_date": "2011-01-15",
            "source": "rt"
        },
        {
            "content": "Rodrigo De la Serna is magnificent in this and Gael García Bernal is even better as the budding revolutionary that would go on to inspire the socialist movements in South America to this day. They say Che Guevera is alive and drives a Taxi in Buenos Aires. I'd like to believe that rather than those huge whoppers in the Bible.",
            "review_date": "2011-01-11",
            "source": "rt"
        },
        {
            "content": "This is a beautiful film, and not just for the scenery (which is magnificent). It starts off funny and ends serious, as Ernesto's journey around South America gradually exposes him to poverty and injustice.",
            "review_date": "2011-01-07",
            "source": "rt"
        },
        {
            "content": "Until my recent trip to South America, I had never heard of The Motorcycle Diaries.  This movie is the Patch Adams film of the South America.  It's based on the true life adventure of Ernesto Guevara (also known as the legendary, Che) and his friend Alberto Granado.  This movie has it all:  adventure, romance, comedy, social consciousness, and a lot of heart.  Definitely worth a rental.  Yes, it's in Spanish, but it's not tough to follow with subtitles.  Do yourself a favour.  This past fall I visited many of the streets they went through while in Peru.",
            "review_date": "2011-01-05",
            "source": "rt"
        },
        {
            "content": "Overall, it was a really fascinating movie.  However during the latter half of the movie I had to keep on wondering if Alberto was really like that in reality.  In the film Alberto was a kind of sloppy guy which made Ernest stand out as a clean and brilliant young man in contrast.  Well I need to find out by reading diaries from the both sides...",
            "review_date": "2011-01-02",
            "source": "rt"
        },
        {
            "content": "If you don't know anything about this movie and did not read its plot before-like me- you'll have greater joy watching it and especially at the end when you found out who Fuser really is.\r\nIt's an amazing movie not just because it depicts the earlier life of one of the major figures of 20th century but because it illustrates the simple, difficult, easy, hard, delightful, sad sides of South American nations in 1950s with great accuracy and brilliant cinematography.\r\nIt makes you feel like repeating that long journey Che and his friend Granado took years ago. It makes you feel more human.",
            "review_date": "2011-01-01",
            "source": "rt"
        },
        {
            "content": "Its a beautiful, inspiring and surprisingly subtle movie. I wish people made less bio pics and more memoir like films like these. I think looking at small pocket of a person's life makes for more engaging and less slapshod and rushed film than most biopics.",
            "review_date": "2010-12-27",
            "source": "rt"
        },
        {
            "content": "Very well paced and brilliantly acted movie.",
            "review_date": "2010-12-26",
            "source": "rt"
        },
        {
            "content": "Not an action-packed movie, but nonetheless it kept my interest. Most of the \"actors\" in the movie are local people, which made the movie more interesting. Didn't realize until the end of the movie that it was about Che Guevara. His best friend/traveling companion, Alberto Granado, ends up working/living in Cuba.",
            "review_date": "2010-12-26",
            "source": "rt"
        },
        {
            "content": "Feel good movie for revolutionaries! It's kind of like Jack Kerouac but with class consciousness...",
            "review_date": "2010-12-15",
            "source": "rt"
        },
        {
            "content": "with gael garcia as ernesto 'che' guevara, a beautiful movie is presented. it's a good way to learn history and really touching. it's a movie about the change of character and the power of will, if you really want something you can make it!",
            "review_date": "2010-12-09",
            "source": "rt"
        },
        {
            "content": "Really good movie, but it's been a long time since I watched it, so I can't say much else. Time to do it again.",
            "review_date": "2010-12-05",
            "source": "rt"
        },
        {
            "content": "Normalmente no me gustan los \"road movies\", pero esto me ha tocado. QuerÃ­a verlo desde hace mucho tiempo, y al final esta noche conseguÃ­ verlo. Es bastante fuerte, socialmente, mas que todo. No he leido los libros de donde han sacado esta pelicula, entonces no puedo saber si es fiel o no, pero solo el hecho de un adventura de seis meses por el sudamerica valdria por toda una vida.",
            "review_date": "2010-11-25",
            "source": "rt"
        },
        {
            "content": "It's just awesome..... I love the roadtrip movie....and this is the one of the best movie....",
            "review_date": "2010-11-25",
            "source": "rt"
        },
        {
            "content": "Great movie!  The cinematography is breathtaking and really demonstrates the sheer beauty of the varying climates and landscapes of South America.  Garcia Bernal does a wonderful job as the young Che Guevara.  Most of the movie is light-hearted, though you do get a peek at what may have stoked the revolutionary flames in Guevara's heart when he meets poor, indigenous people.  Still, it's not a downer of a movie and it's great fun to watch the youthful antics of Guevara and his friend.",
            "review_date": "2010-11-23",
            "source": "rt"
        },
        {
            "content": "Beautifull crafted, intriguing look at how Che Guevara's ideals were propelled.",
            "review_date": "2010-11-22",
            "source": "rt"
        },
        {
            "content": "this movie is soo beautiful and i saw it not knowing it was about che! haha so i saw it as just a movie with an amazing plot and now that i know exactly what it's about i'm even more satisfied with this film. i like gael garcia bernal and this movie shined a very nice light on him and everyone else in the movie too!",
            "review_date": "2010-11-22",
            "source": "rt"
        },
        {
            "content": "\"Me, I'm not the same me, at least not the same spiritual me. \"",
            "review_date": "2010-11-21",
            "source": "rt"
        },
        {
            "content": "It is good movie about Che, the man, before he changed the world how world around him changed him, how he was and why he did what he did? I like the music in this movie and the beautifull views from latin contenent.",
            "review_date": "2010-11-20",
            "source": "rt"
        },
        {
            "content": "i had to watch this for a spanish homework assignment.this was an okay movie. it was about two friends that travel through latin america, on they way they meet, help alot of , and fall in love. it was also a way for the 2 friends to say goodbye to eachother because at the end of this trip they don't get to see each other for 8 years. this movie was based on a true story.",
            "review_date": "2010-11-19",
            "source": "rt"
        },
        {
            "content": "I didn't understand, must see again!",
            "review_date": "2010-11-18",
            "source": "rt"
        },
        {
            "content": "This is such an amazing movie. It tells the story of a young Che and his buddy taking a long cross country voyage. Along the way they see the craziness that it happening and the wrong doing being done to the people.\n\nGael Garcia Bernal did so great as Che. Portraying him as very young and naive in the beginning. He not only journeys across South American to help the sick, but as he takes this journey he soon discovers what he must do himself.\n\nThere is a great theme of realization and standing up for beliefs in this film. There's also a very strong theme of friendship which is seen throughout the film. Definitely, check this one out!!!",
            "review_date": "2010-11-17",
            "source": "rt"
        },
        {
            "content": "Bellissimo film su un continente purtroppo poco esplorato dal cinema...I 2 protagonisti sono davvero molto bravi e nella parte; la \"politica\" che traspare non Ã¨ mai invasiva ed Ã¨ trasversale a certi momenti del film.\nUn road movie di quelli che non si dimenticano. Adatto a tutta la famiglia.Consigliatissimo.",
            "review_date": "2010-11-10",
            "source": "rt"
        },
        {
            "content": "It is a pleasure to watch this movie. A must watch movie.",
            "review_date": "2010-10-25",
            "source": "rt"
        },
        {
            "content": "I'm not sure if the film presents Ernesto as he really was, but it does  present him a likable character.",
            "review_date": "2010-10-24",
            "source": "rt"
        },
        {
            "content": "I loved this movie. It's touching and visually beautiful.",
            "review_date": "2010-10-23",
            "source": "rt"
        },
        {
            "content": "so sloganish and pretentious in a naive way! Didnt like it that much , except for the awesome idea of traveling like that, and the beautiful south american scenes !",
            "review_date": "2010-10-18",
            "source": "rt"
        },
        {
            "content": "Curious about the ratio of those who know the story to those who wear the t-shirts ....",
            "review_date": "2010-10-17",
            "source": "rt"
        },
        {
            "content": "I just watched this movie for the second time. I really like this movie. It doesn't hurt that Gael Bernal is a very good actor, also....but that was just icing on the cake. There was alot of thought put into this movie. It was serious at times, touching at times, and also very funny at times.",
            "review_date": "2010-10-14",
            "source": "rt"
        },
        {
            "content": "a well acted movie, and does capture the struggle and relationship of friendship",
            "review_date": "2010-10-14",
            "source": "rt"
        },
        {
            "content": "The Canadian channel showed this on their \"late movie\" tonight. I thought it was a very fine film.  It documents the vivid experiences \"on the road\" in Latin America which would spark the transformation of a young Ernesto \"Che\" Guevara from an idealistic medical student to the legendary revolutionary figure he later became.",
            "review_date": "2010-10-10",
            "source": "rt"
        },
        {
            "content": "Great Story and Great acting by Garcia!! a good movie to watch!!",
            "review_date": "2010-10-06",
            "source": "rt"
        },
        {
            "content": "This is basically a road movie, It's a foreign production of mixed nationalities (spain, mexico, argentina, Usa) Produced by robert redford.\r\n\r\nIt tells the story of two young argentine friends that depart in a little motorcycle \"La Poderosa\" (The mighty one) in 1952 from argentina to Caracas Venezuela and travel 5000 miles of south american vast continent, Across Chile's Atacama Desert, and into the Peruvian Amazon to finally reach Venezuela. \r\n\r\nAs you can imagine this two young fellas go to a pretty good amount of trial and tribulations in this hard as life voyage, they also get to know a lot of interesting people and see the reality of Latin America misery with their own eyes; \r\n\r\ni've had the luck of seeing first hand the Venezuela Jungles and Sierras (toguh i still need to see the \"Gran Sabana\") and  they are nothing but amazing. So... The Landscapes are nothing but breathtaking, and the photography is outstanding, the direction is so simple it made it seem easy to shoot in all those incredibly hard outdoors.\r\n \r\nThe acting is on tune, and the Score is beautiful, was made by Gustavo Santaolalla who later won best score for \"babel\"; actually this movie features the first ever Spanish song to win an Oscar for best Song (tough They didn't let it's author Jorge Drexler sing this beautiful Uruguayan Jazzy-bossa nova song at the awards, instead they made Santana and Antonio Banderas butchered it) If you like to, look for the song is beautiful it's about will and overcoming great difficulties in life with the help of friends it's called \"Al otro lado del rio\" (Across the river).    \r\n\r\nNow, here's the deal:\r\n\r\nOne - The story is real, and is actually based on the diaries of that travel, \r\n\r\nTwo - These two young friends were medicine students, and both came from wealthy argentine families, but facing the social reality of latin america across this travel, (they find raze discrimination, indian exploitation, and a leprosy community abandoned to die in the jungle) their minds were changed and so their life, one of these young fellas, turned out to be the polemic Ernesto \"Che\" Guevara, who later become a revolutionary that fight for the independence of cuba (tough later on fidel would become a dictator) and Congo and the vindication of indigenous rights in Bolivia (where he was killed). None of this is showed in the movie, they only show the travel, but is interesting to see how an Innocent travel of two young friends can light up some things in people that later on would be a turn in their whole life.   \r\n\r\nOverall: It's a great movie, Is a history about friendship and will, and learning to see things trough the eyes of others, to put yourself in the other side. It's inspirational and visually stunning, and with and absolutely great score. It has its political declamation moments, but are more about showing realities than a desertion on revolution so it's not too segmented. I see it more like these are still present problems in latin america, and they still need to be solved. \r\n\r\nIf you please me listen to this: here's the Oscar Wining song \"al otro lado del rio\" by Uruguayan singer Jorge Drexler. with english subtitles and scenes from the movie: \r\n\r\nhttp://www.youtube.com/watch?v=QuiUkxz0dqE\r\n\r\nThanks for reading an comments, are much appreciated.",
            "review_date": "2010-09-27",
            "source": "rt"
        },
        {
            "content": "Somewhat of a Ernesto 'Che' Guevara marathon, I saw this and the CHE series (Part I & II).  Motorcycle Diaries I like the most. \n\nAn amazing depiction of how the events that unfolded before Ernesto really defined the man he would turn out to be.",
            "review_date": "2010-09-26",
            "source": "rt"
        },
        {
            "content": "A fascinating, light hearted account of Che Guevara on the road in his earlier life, learning to become the man he was.",
            "review_date": "2010-09-24",
            "source": "rt"
        },
        {
            "content": "Another one of my favorite movies.",
            "review_date": "2010-09-20",
            "source": "rt"
        },
        {
            "content": "It was a really well made movie! I really liked it :)",
            "review_date": "2010-09-15",
            "source": "rt"
        },
        {
            "content": "A wonderful musical score, beautiful scenery and cinematography, a pretty great story although I think I really need to see it again to really get a clear picture on the characters and their scenarios. Specifically regarding the conclusion. Its wonderful to see how their lives change though and how inspired they become by all thats surrounding them and the realities they are discovering in their America. I wish Ernesto could've made it work out with his girl though :( Gael Garcia Bernal is beautiful.",
            "review_date": "2010-09-15",
            "source": "rt"
        },
        {
            "content": "Just epic! that too a true one! very visually stunning!",
            "review_date": "2010-09-15",
            "source": "rt"
        },
        {
            "content": "This movie was disappointingly bland. Partly it's my fault, as I expected more from it; I thought it would show more intricate character development and how Che became a revolutionary. Instead, it's more of a buddy movie. A well-told buddy movie with great acting and dialogue, but still just that. The chemistry between Che and his friend was good and believable, and there were entertaining moments of humor and bad-boy antics. Just don't expect to learn anything about Che Gueverra that you didn't already know. And don't expect it to convert anyone to or from capitalism - it's a political Rorschach test with no more insight than the knowledge that some people are poor and some people are rich, some indigenous and some colonial.",
            "review_date": "2010-09-14",
            "source": "rt"
        },
        {
            "content": "Another great performance by Gael Bernal. A humbling and thrilling adventure that shows the trials of the human spirit. This film demands we as human beings ask ourselves are we making the right choices? How many are willing to stand up for change. History is rooted in suffering but more than focus on politics this film of a pre Che concentrates on a more central and diverse message, just helping others. A journey of self discovery(I'm a sucker for traveling movies, good ones at that) with great tone and narrative, I've waited quite some time to see Motorcycle Diaries. This moving, touching and oftentimes humorous piece is definitely worth checking out.",
            "review_date": "2010-09-11",
            "source": "rt"
        },
        {
            "content": "impressive journey, amazing story, gotta see it, wouldnt mind watching it again :D",
            "review_date": "2010-09-09",
            "source": "rt"
        },
        {
            "content": "Wonderful movie from the very beginning, a great filmmaking and superb acting, specially Rodrigo De la Serna. The feelings and sensations it transmits are impossible to describe, it's at the same time, like an \"epic\" adventure, but also it's very simple, showing two lonely characters in simple situations with fantastic supporting characters, but definitely the greatest thing in it on a technical level is the great cinematography and a really great work of direction. A truly remarkable film about Ché Guevara's long trip through South America.",
            "review_date": "2010-09-04",
            "source": "rt"
        },
        {
            "content": "Rather superficial & not that interesting after all.",
            "review_date": "2010-09-02",
            "source": "rt"
        },
        {
            "content": "A foreign film I had heard so much about and finally know I see why. Both actors are sensational but it's Gael Garcia Bernal that steals the show as Che. It's a very interesting story set against a beautiful primitive South American backdrop.\r\n\r\nThis film is so rich in character, locations, comedy, charm and heart. Walter Salles directed a real masterpiece it's simple road trip film but major transformation occurs for Che's character very little for his partner in crime.\r\n\r\nAll there adventures are honest nothing pretentious or overblown in this film, as a viewer you just watch their lives unfold very compelling viewing a must see south american modern classic...",
            "review_date": "2010-08-30",
            "source": "rt"
        },
        {
            "content": "Che Guevara's remarkable memoirs !",
            "review_date": "2010-08-30",
            "source": "rt"
        },
        {
            "content": "Until Ernesto \"opens his eyes\", this is a great budding movie with breathtaking landscapes",
            "review_date": "2010-08-29",
            "source": "rt"
        },
        {
            "content": "Beautifully shot. Wonderful performances. No doubt in my mind that this is a great film. One of the best Latino films of the past decade.",
            "review_date": "2010-08-28",
            "source": "rt"
        },
        {
            "content": "This movie makes me want to travel.  It was killing me.  Anyway, it's pretty good.  There are some holes that could have been patched up.  It is focused entirely on part of their trip (I don't know if that had anything to do with the diaries themselves) as the whole last section is missing.  One day they're in Peru the next he's leaving Caracas...anyway...I generally like it although I think it could have been more complete.  Dammit I want to so to South America.",
            "review_date": "2010-08-28",
            "source": "rt"
        },
        {
            "content": "Good movie. I do advise to see this movie as a movie and not about the life of El Che Guevara.",
            "review_date": "2010-08-25",
            "source": "rt"
        },
        {
            "content": "At times hilarious, at times sad, with two great performances. If this doesn't make you want to go to South America nothing will.",
            "review_date": "2010-08-21",
            "source": "rt"
        },
        {
            "content": "Whether you are a fan of Che Guevara's political ideas or not this is a good film giving us an insight into the Che Guevara many of us don't know. We get to see the journey that made the man, a journey across South America coming across different cultures and lands. The film is beautifully shot and well acted. My only problem is that I would have liked to have heard more about Che's political ideas at the time rather than just his medical attributes. None the less I was entertained through the most part as well as informed.",
            "review_date": "2010-08-20",
            "source": "rt"
        },
        {
            "content": "The film slows down in parts but is an enjoyable film about a fascinating persona.",
            "review_date": "2010-08-15",
            "source": "rt"
        },
        {
            "content": "This movies leaves you with a warm feeling of peace, love and understanding.",
            "review_date": "2010-08-11",
            "source": "rt"
        },
        {
            "content": "(Watched Thu 10 Aug 2006)",
            "review_date": "2010-08-11",
            "source": "rt"
        },
        {
            "content": "Nice journey through Latin America. The direction and acing is good. Though its a bit long but it holds up interest all along.",
            "review_date": "2010-08-09",
            "source": "rt"
        },
        {
            "content": "# Diários de Motocicleta",
            "review_date": "2010-08-08",
            "source": "rt"
        },
        {
            "content": "Really excellent storytelling, and of course Bernal is a pleasure to look at. Really, though, the whole movie is a pleasure to look at.  You get a hint of how Guevera's future life was formed. Also, makes you want to go to South America.",
            "review_date": "2010-08-04",
            "source": "rt"
        },
        {
            "content": "one of the finest film work Till date. Very well filmed and acted. The team of the Motor cycle definitely deserves an Applause!",
            "review_date": "2010-08-02",
            "source": "rt"
        },
        {
            "content": "Superb film, easy to watch but hard to assimilate because of all the questions it raises. The scenarios and the acting are perfect turning all the story into a fabulous journey across South America.",
            "review_date": "2010-07-24",
            "source": "rt"
        },
        {
            "content": "2 and a half stars because this is pretty much 2 movies.  First half a fun adventure across \"America\" ... the 2nd half a preachy message about segregation.  Perhaps my own selfishness in preferring to be entertained rather than educated when it comes to movie watching prevented me from enjoying this movie more, but I've seen other movies which have accomplished both in a more tolerable experience.",
            "review_date": "2010-07-17",
            "source": "rt"
        },
        {
            "content": "Che wanted to discover the real Latin America, and I think he succeeded. This movie is simple, deep and is based on a true story after all.\r\nYou may not like Che the Marxist, but you'll love Che the 23 year-old medical student",
            "review_date": "2010-07-17",
            "source": "rt"
        },
        {
            "content": "\"Wandering around our America has changed me more than I thought. I am not me any more. At least I'm not the same me I was. \"\n\nThis movie was amazing. Hands-down amazing. Gael Garcia Bernal brings such life to Ernesto \"Che\" Guevara. The journey that Che took in the 1950's across Latin America changed him, and perhaps it will change you as you watch the film.",
            "review_date": "2010-07-13",
            "source": "rt"
        },
        {
            "content": "wonderful movie..\r\nbecame a fan of che guevera after watching this.",
            "review_date": "2010-07-13",
            "source": "rt"
        },
        {
            "content": "A directorial tour-de-force.",
            "review_date": "2010-07-08",
            "source": "rt"
        },
        {
            "content": "I love this one! Sountrack is one of my favorite all time music... you cant go wrong with Gustavo Santaolalla!",
            "review_date": "2010-07-07",
            "source": "rt"
        },
        {
            "content": "The Motorcycle Diaries is an interesting film, focusing on the life of Ernesto 'Che' Guerva before he became a famous revolutionary. Gael Garcia Bernal is brilliant in the lead role, however Rodrigo De La Serna is irritating. The scenery and music are breathtaking, and Walter Salles knows how to get a point across and is a true story teller.\r\nThe only downfall in this film is that some scenes are overly long and could have used some trimming. But other than that, this film is a brilliant depiction of one of the great revolutionaries.",
            "review_date": "2010-07-06",
            "source": "rt"
        },
        {
            "content": "Excellent, kept me watching from the beggining.",
            "review_date": "2010-07-03",
            "source": "rt"
        },
        {
            "content": "Finally got around to watching it, very good film with lots of amazing scenery!",
            "review_date": "2010-06-25",
            "source": "rt"
        },
        {
            "content": "Beautifully filmed and acted. Gael Garcia Bernal's performance was so believable.",
            "review_date": "2010-06-19",
            "source": "rt"
        },
        {
            "content": "A marvelous road picture and boys-become-men adventure, full of the best kind of idealism. Well-acted, beautifully shot and broad and personal, The Motorcycle Diaries is nonetheless undermined in the end by a clunky search for meaning and depth that seems forced. Quietly exhilarating, soulful and sincerely romantic. The Motorcycle Diaries is a beautiful film shot against the stunning visual backdrop of the South American continent. It is not only a story about the young Che Guevara on a motorcycle adventure with his friend, Alberto Granado; it is also about the social awakening of the famous revolutionary as he travels from Argentina, into Chile and up into Peru and Colombia. To say that it is shot and directed beautifully is only half the deal.",
            "review_date": "2010-06-17",
            "source": "rt"
        },
        {
            "content": "An incredibly powerful and in-depth look on how a 23 year old idealist and his best friend transform into revolutionary icons. As a 23 year old, this film struck me personally on my own life's purposes, causes, and hopes-and how I can make the world a better place, a more peaceful and just place. And while Che is often overly idealized or villainized, he, played by the soulful Bernal here, shows us what he saw that led him down his life's journey. Crossing boundaries of physical (the beautiful panoramas of South America) and spiritual (caring for a leper colony), we see the passion to change social systems and our own hearts. \"So much injustice\", Ernesto proclaims at the end of the film...and something that we can proclaim in our world even today.",
            "review_date": "2010-06-16",
            "source": "rt"
        },
        {
            "content": "tres beau film et Gael GarcÃ­a Bernal comme bel acteur aussi en prime!",
            "review_date": "2010-06-09",
            "source": "rt"
        },
        {
            "content": "Yo\na\nGael\nle perdono\nTO-DO",
            "review_date": "2010-06-08",
            "source": "rt"
        },
        {
            "content": "Clear story about the shaping of Che. And a good travel guide to Latin America :)",
            "review_date": "2010-06-08",
            "source": "rt"
        },
        {
            "content": "a fantastic adventure... whether you believe Che was a murderer &dictator or someone who simply fought to give some kind of liberty to the people... no one can say because only storys remain... but as a film this is inspirational stuff",
            "review_date": "2010-05-31",
            "source": "rt"
        },
        {
            "content": "A better way of explaining how El Che came to be who he was.",
            "review_date": "2010-05-25",
            "source": "rt"
        },
        {
            "content": "wow !!....... very good movie with a very passable integration Chegevara Ernesto .....!!!! wow! ... a fresh review of his life, and with this exciting action Gael Garcia (actor leads to a good character development) .. without diverting the story ... very good movie!",
            "review_date": "2010-05-24",
            "source": "rt"
        },
        {
            "content": "reminds me of \"Easy Rider\", well, this rebel has a cause.  Hasta siempre, Comandante.",
            "review_date": "2010-05-23",
            "source": "rt"
        },
        {
            "content": "Heart warming glimpse into Che's pre-revolutionary life.",
            "review_date": "2010-05-20",
            "source": "rt"
        },
        {
            "content": "This was very beautifully filmed with excellent actors and with local people which really added to the movie.  It brings to life the Motrorcycle Diaries by Che and Alberto Granado's Travelling with Che Guevara: The Making of a Revolutionary to life.  I found it faithful to their books.  The message is very inspiring and yes Che was a pretty selfless guy.  How many politicians give up a government post to go fighting for the rights of the underprivileged in Africian and Boliivia?",
            "review_date": "2010-05-20",
            "source": "rt"
        },
        {
            "content": "The film does tend to get a little preachy and forward at times with its political ideology. That is definitely the biggest complaint, however. It's a stunning achievement. Gorgeous cinematography. Incredible casting. The two main roles are fantastic. The story is as magnanimous as the journey that it entails. Well worth a viewing.",
            "review_date": "2010-05-18",
            "source": "rt"
        },
        {
            "content": "Great photography, very beautiful takes and a nice story. It could be a 10/10, but the scenes showing how Che was a good man are ridiculous, obvious and forced. LITTLE SPOILER: in one of them Che is almost dying and the only money they have does not belong to them (Che's girlfriend gave him to buy a jeans for her), so his friend suggests using the money so they can go to the hospital and Che immediately replies: \"No, it's not fair\" - Come on!!!",
            "review_date": "2010-05-18",
            "source": "rt"
        },
        {
            "content": "**** (out of four)\r\n\r\nOne of my favorite films of 2004.  Director Walter Salles takes a moment in the life of a young man who would take part years later in a revolution movement that would help shape the future of Cuba.\r\n\r\nGael Garcia Bernal plays Che Guevara as a young man in 1952.  Along with his good friend he embarks on a cross continent journey on an old broken down motorcycle.  The trip is meant for leisure, but along the way they become caught up in events that would change them and help shape him into the man he will eventually become.\r\n\r\nI have like Bernal in movies like \"Amoros Perros\" and \"Y Tu Mama Tambien\", but here he gives a defining performance in a role that needs to be played just right.  It is moving and complex.  The scenery is also spectacular and wonderfully shot.  A real special film.",
            "review_date": "2010-05-15",
            "source": "rt"
        },
        {
            "content": "the mighty one!!\n\nThis isn't a tale of heroic feats. It's about two lives running parallel for a while, with common aspirations and similar dreams. \n\nBefore he changed the world the world changed him.\n\noh boy.. this is transforming.\nmovie has captured Sudamerica so beautifully.. and how tht trip gave birth to the gr8 revolutionist \"che Guevara\"..!",
            "review_date": "2010-05-14",
            "source": "rt"
        },
        {
            "content": "This movie is about early days great Cuban revolutionary - Che.\nHighly recommended!!!!",
            "review_date": "2010-05-12",
            "source": "rt"
        },
        {
            "content": "It's sweet and sentimental and muted, more like flicking through a set of old photographs than watching a movie. A bit underwhelming given the subject.",
            "review_date": "2010-05-11",
            "source": "rt"
        },
        {
            "content": "\" Amazing !! Went for a 1 hr purposeless stride on the streets just observing the people around me !! The best part was I did not know that it is the story of che guevara.. when it came up on the screen.. I jumped off my bed out of excitement !! \"",
            "review_date": "2010-05-11",
            "source": "rt"
        },
        {
            "content": "Gael Garcia Bernal is brilliant, and I can't stress that enough. Whatever you think about Che Guevara, this is a great movie about his early years and the motorcycle journey with his friend that changed his life (and the world) forever.",
            "review_date": "2010-05-08",
            "source": "rt"
        },
        {
            "content": "This film is outstanding on so many levels. A story about two friends Alberto Granado and Che Guevara who travel through South America on an old Motorbike they call `The Mighty One'. On their travels, they witness poverty and lack of access to medical care. Che finds extraordinary empathy with other people, primarily the poor and the suffering. This film was touching and the cinematography stunning. This film makes you want to learn more about the history and culture of South America and you soon realise why Che Guevara became a communist and went on to live the life he did.",
            "review_date": "2010-04-25",
            "source": "rt"
        },
        {
            "content": "Fairly slow story and bike breaks down quite early (it only makes an appearance just for the title). Story of Che's early life which is interesting and shows how his experiences changed his life. Not really a blockbuster, more a long documentary",
            "review_date": "2010-04-19",
            "source": "rt"
        },
        {
            "content": "two great lead performances make this a very touch and interesting look at the early travels of che.  not sure how much of this is true, but definitely motivates me to learn more about him.  great cinematography and good minimalist score.",
            "review_date": "2010-04-18",
            "source": "rt"
        },
        {
            "content": "Fantastic movie & an amazing soundtrack.",
            "review_date": "2010-04-18",
            "source": "rt"
        },
        {
            "content": "This film changed me as a person.",
            "review_date": "2010-04-17",
            "source": "rt"
        },
        {
            "content": "Beautifully told story of the young Che Guevara...",
            "review_date": "2010-04-11",
            "source": "rt"
        },
        {
            "content": "\"I am not myself anymore.At least i'm not the same inside.\"",
            "review_date": "2010-04-11",
            "source": "rt"
        },
        {
            "content": "It is always good to open up to new movie experiences, and I loved this one.  Beautifully atmospheric  and soulful, although ponderous in places.  You find out what motivated Che Guevara to become a revolutionary, seeing the grinding poverty of South America at the time.  A very affecting film.",
            "review_date": "2010-04-10",
            "source": "rt"
        },
        {
            "content": "Fabulous stuff. I didn't really know that much about Che Guevara before except that students like to wear t-shirts of him when they want to seem cool. The movie felt almost like a documentary although it was very slow in places. Still the acting was amazing and this is definitely worth a watch.",
            "review_date": "2010-04-10",
            "source": "rt"
        },
        {
            "content": "its not a biopic, just a simple story of 2 guys who decide to explore america on \"the mighty one\" - their leaky, unreliable, rust bucket of a motorbike.\r\nit just so happens that one of the travellers is a young Che Guevara.\r\n\r\nAs Che says \"wandering around our America has changed me more than I thought. I am not me any more. At least I'm not the same me I was.\"\r\n\r\nThis is the kind of movie a traveller should not miss. so beautiful!",
            "review_date": "2010-04-02",
            "source": "rt"
        },
        {
            "content": "While both well directed and acted, it glorifies Che Guevara to near heroic proportions and idolizes communism.",
            "review_date": "2010-04-02",
            "source": "rt"
        },
        {
            "content": "An amazing portrait of a younger Che Guevara. Involving, superb and fascinating. Great performances by Bernal and la Serna and great cinematography by Eric Coultier. An exceptional achievement all around.",
            "review_date": "2010-03-25",
            "source": "rt"
        },
        {
            "content": "taking you away from every day",
            "review_date": "2010-03-25",
            "source": "rt"
        },
        {
            "content": "I guess you can enjoy the movie the most if you make yourself forget about the history of Che. Take out the slighty propagandistic part of it and you have a great movie! I absolutely loved the country, the nature and simply taking a peek into lands I might never visit. Other than that I enjoyed the acting, taken apart several shots where the propagandistic character of the movie simply bursts out of the screen.",
            "review_date": "2010-03-20",
            "source": "rt"
        },
        {
            "content": "Not quite sure how anyone could not like this. Whilst the movie does not go into great depths into the intrigue behind the personality of Che Guevara, it doesn't attempt to. Instead it just captures apart of his early adventures and the cinematography is breathtaking. The movie has given me the conviction to travel throughout South America. Gael and his co-stars have a great chemistry and this is certainly highly recommended.",
            "review_date": "2010-03-18",
            "source": "rt"
        },
        {
            "content": "Great photography, very beautiful takes and a nice story. It could be a 10/10, but the scenes showing how Che was a good man are ridiculous, obvious and forced. LITTLE SPOILER: in one of them Che is almost dying and the only money they have does not belong to them (Che's girlfriend gave him to buy a jeans for her), so his friend suggests using the money so they can go to the hospital and Che immediately replies: \"No, it's not fair\" - Come on!!!",
            "review_date": "2010-03-11",
            "source": "rt"
        },
        {
            "content": "One of the first foreign films I've actually sat through to watch...subtitles and all.  Turned out to be a great film.",
            "review_date": "2010-03-08",
            "source": "rt"
        },
        {
            "content": "i love che so i expected it never let me down",
            "review_date": "2010-03-08",
            "source": "rt"
        },
        {
            "content": "......before he changed the world , the world changed him ....\n\n\"Be realistic , expect the impossible\" ChÃ© Ernesto Guevara",
            "review_date": "2010-03-06",
            "source": "rt"
        },
        {
            "content": "A truly beautiful film that explores the life of Ernesto 'Che' Guevera before he became the revolutionary, the film explores the trip that he took with his best friend Alberto Granado. The film is an experience within itsself and it lets you know of who Che really was. The perosn who gave the best performance in the film was Rodrigo De La Serna. Buut this film is beauty in its highest form. This film should have won Best Picture, Best Director, best Adapted Screenplay, Best Score, Best Film Editing, and Best Cinematography.",
            "review_date": "2010-03-05",
            "source": "rt"
        },
        {
            "content": "Wonderful movie from the very beginning, a great filmmaking and superb acting, specially Rodrigo De la Serna. The feelings and sensations it transmits are impossible to describe, it's at the same time, like an \"epic\" adventure, but also it's very simple, showing two lonely characters in simple situations with fantastic supporting characters, but definitely the greatest thing in it on a technical level is the great cinematography and a really great work of direction. A truly remarkable film about ChÃ© Guevara's long trip through South America.",
            "review_date": "2010-03-03",
            "source": "rt"
        },
        {
            "content": "with gael garcia bernal in it, this movie has already gained 3.5 stars.\n\nplus, it has a very interesting story and a beautiful cinematography. thats 1.5 stars.",
            "review_date": "2010-02-19",
            "source": "rt"
        },
        {
            "content": "This movie tells about the two students, who goes on the life changing journey across the south america.\nIt shows how a simple medical student became one of the iconic revolutionary person!\nOverall it was a good movie.",
            "review_date": "2010-02-18",
            "source": "rt"
        },
        {
            "content": "This reminds me of Entourage... Make you love the revolutionary...",
            "review_date": "2010-02-15",
            "source": "rt"
        },
        {
            "content": "I love this for some reason.",
            "review_date": "2010-02-15",
            "source": "rt"
        },
        {
            "content": "I am not me any more. At least I'm not the same me I was. \"",
            "review_date": "2010-02-14",
            "source": "rt"
        },
        {
            "content": "it showed a view of Che Guevara which most don't necessarily approve of, but is still valid. a little sex, but nothing like most Latino movies. history won out here, and showed itself through quite well. it may not show all of Che's real life-issues, but it shows him nonetheless.",
            "review_date": "2010-02-13",
            "source": "rt"
        },
        {
            "content": "I look at this movie as interesting insight on the kind of Man Guevara was and the kind of place South America was at the time, and probably still is in a lot of places.  \n\nGuevara looks like a man who's desire is to do some good in the world, to help the sick, and to free the poor from oppression.  I think that he might have been one who had good intentions for his actions and in the end he became caught up in things that were beyond he control.  \n\nIts about a beginning.  This trip opened Guevara up to the world around him and he was passionate enough about it to actually change it, though probably not for the better.\n\nI don't think that this film is about praising Guevara, but actually showing us that originally he was a man after equality and fairness, and we all know that it is a hard road to walk righteously.",
            "review_date": "2010-02-11",
            "source": "rt"
        },
        {
            "content": "Where you find Bernal, you'll find an ambitious movie. Although this is the weakest I've ever seen him, likewise weakest film I've seen him in. The whole movie is about Che changing, but he really doesn't. It's much too external, his attachment to the people isn't explored, it's just there - out of the blue.",
            "review_date": "2010-02-10",
            "source": "rt"
        },
        {
            "content": "Pure visual art. Such an awesome movie! I like the way \"Che's\" thoughts of Latin-America slowly take shape and make him realize that the injustice there is around him is bigger than we usually think. His ideas of the social indifferences between the rich and the poor are completely right. If only he had executed his revolution in a better way then maybe he would've actually made a huge difference, but because he decided to make his revolution with guns and shots, it failed. It was so obvious that governments wouldn't stand up for it and would search his death. I remember a scene in the movie where \"Che's\" friend Alberto gives his idea of how to start the revolution and \"Che\" tells him that a revolution with no shots is impossible, well, I guess Gandhi is proof enough that that isn't true. Anyway, I still agree with all of his ideas of the social differences and the injustice that's lived in Latin-America and the speech he gives just before he leaves the leper center in the Amazon is admirable. I understand why some people might have gotten bored with this film, the movie does spend a bit of time trying to give some nice \"vistas\" of South America making it a little slow (so if you are one of those people but you still think you will give this movie a go, make sure that you aren't tired when you are watching it), I however find that incredibly entertaining and one day, if I am able to, I'd like to go on a road trip like their's, whether I do it in South America or Australia (or both.)I also think that being from South America (like me) helps relate to this movie better and enjoy it more. 2 thumbs up for this movie!",
            "review_date": "2010-02-10",
            "source": "rt"
        },
        {
            "content": "one of my favorite movies",
            "review_date": "2010-02-09",
            "source": "rt"
        },
        {
            "content": "Interesting journey film but not truly engaging until the last half and then it seems overly sentimental.",
            "review_date": "2010-02-08",
            "source": "rt"
        },
        {
            "content": "a celebration of human life ...",
            "review_date": "2010-02-08",
            "source": "rt"
        },
        {
            "content": "\"Wandering around our America has changed me more than I thought. I am not me any more. At least I'm not the same me I was. \"\nTwo friends are going for a trip around South America, from Argentina, via Chile, Peru up to Venezuela.\nGreat storyline and pictures...\nAnd yes...one of the movie characters is Ernesto \"CHE\" Guevara :)\nGoood movie :)",
            "review_date": "2010-02-06",
            "source": "rt"
        },
        {
            "content": "So, I wanted to see this movie because the cinematography looked amazing and the trailer promised an exciting adventure following the real memoirs of Che Guevara. The plot follows Che Guevara (Gael Garcia Bernal) and Alberto Granado (Rodrigo de la Serna) as they travel across 1950's Central America on a motorcycle in order to see the country and interact with the people. The movie is based on the actual events that ocurred over a century ago and does a very nice job of not focusing on the politics much, beside the blatant gap between the campesinos and elite. The movie mainly focuses on how this trip changed both of their lives forever and gave a great background and insight to Guevara's later history. The cinematography was beautiful in this movie and the plot did actually flow very nicely as if it was an original screenplay. Gael does an amazing job and really give depth to his character. Even though Rodrigo was more of the comic relief and used to contrast Guevara's character, he really does an outstanding job and is so genuine and really helps the plot out greatly which makes the movie very entertaining even for those who are not Guevara fans or history buffs. I'm usually drawn to the Latin foreign films and this was probably the best Latin period movie I've seen. This movie was produced by Robert Redford and they actually had the real Alberto Granado as a technical advisor on the film. I would recommend this movie for anyone who enjoys beatiful foreign movies about humanity, a Che Guevara fan, or a Gael Garcia Bernal fan. Great quote, \"You gotta fight for every breath and tell death to go to Hell\".",
            "review_date": "2010-02-02",
            "source": "rt"
        },
        {
            "content": "A great movie expecially when you're questioning everything around you. It's good to see what path others took to make an actual change. Very inspiring.",
            "review_date": "2010-02-02",
            "source": "rt"
        },
        {
            "content": "Salles como siempre, Gael como nunca...\nCuÃ¡nta tristeza.",
            "review_date": "2010-01-28",
            "source": "rt"
        },
        {
            "content": "beautiful movie. it does drags its feet a bit but has a wonderful story.",
            "review_date": "2010-01-25",
            "source": "rt"
        },
        {
            "content": "\" you dont have to change the world, let the world changes you\" - It is tag line of the film,  To say in three words, This is Human race and uplifting one.!\r\nMarvellous piece of fiim...",
            "review_date": "2010-01-24",
            "source": "rt"
        },
        {
            "content": "The film is directed by Walter Salles who has made some very fine films. I have been trying to watch all of them. He is known for the famous film Central Station. This film is based on the journals of Che Guevara, leader of the Cuban Revolution. In his memoirs, Guevara recounts adventures he, & best friend Alberto Granado, had while crossing South America by motorcycle in the early 1950s. Prior to viewing (& during the film) I would have had no idea that such a strong young intellectual doctor would become Guevera of the Rebellions. The film wisely avoids politics but gives us a road trip movie (based on both of their journals) as they travel thru the rural areas of Argentina Chile Bolivia Peru Ecuador. Cinematically it is such a beautiful film & made me want to take an extended trip to see those areas. Salles tells the tale in a relatively straightforward, unadorned fashion giving us great vistas of the areas they travel.  Che went on to become 20th century's most romanticized revolutionary and this film covers they ground where he developed his âsocial conscienceâ . There are so many very beautiful places and interesting things that happen during their 8 month journey.  The film attempts to re-create what Guevara & Granado saw & experienced, & thereby to provide an honest account for how the journey expanded their intellect & emotions. Salles uses the beauty of the countryside as a counterpoint to the ugliness of human conditions. In making the film, Salles took his cast & crew along the exact route described by Guevara & Granado in their accounts. With its beautiful on-location filming it functions almost as effectively as a travelogue & the tale of their travel   It is not a sober tale there are many playful & joyful moments. \"Wandering around our America has changed me more than I thought. I am not me any more. At least I'm not the same me I was.\"  Guevara at film's end.  The film is closed with an appearance by Alberto Granado now 82 years old. They also show photos from the actual journey & note that Che Guevara was assassinated in 1967 with the help of the US CIA (somewhere in the jungles of Bolivia) I liked this film a lot but it does not delve enought into the true basis of the two guys relationship. Both the lead actors were great in their roles.",
            "review_date": "2010-01-23",
            "source": "rt"
        },
        {
            "content": "The film is directed by Walter Salles who has made some very fine films. I have been trying to watch all of them. He is known for the famous film Central Station. This film is based on the journals of Che Guevara, leader of the Cuban Revolution. In his memoirs, Guevara recounts adventures he, & best friend Alberto Granado, had while crossing South America by motorcycle in the early 1950s. Prior to viewing (& during the film) I would have had no idea that such a strong young intellectual doctor would become Guevera of the Rebellions. The film wisely avoids politics but gives us a road trip movie (based on both of their journals) as they travel thru the rural areas of Argentina Chile Bolivia Peru Ecuador. Cinematically it is such a beautiful film & made me want to take an extended trip to see those areas. Salles tells the tale in a relatively straightforward, unadorned fashion giving us great vistas of the areas they travel.  Che went on to become 20th century's most romanticized revolutionary and this film covers they ground where he developed his social conscience . There are so many very beautiful places and interesting things that happen during their 8 month journey.  The film attempts to re-create what Guevara & Granado saw & experienced, & thereby to provide an honest account for how the journey expanded their intellect & emotions. Salles uses the beauty of the countryside as a counterpoint to the ugliness of human conditions. In making the film, Salles took his cast & crew along the exact route described by Guevara & Granado in their accounts. With its beautiful on-location filming it functions almost as effectively as a travelogue & the tale of their travel   It is not a sober tale there are many playful & joyful moments. \"Wandering around our America has changed me more than I thought. I am not me any more. At least I'm not the same me I was.\"  Guevara at film's end.  The film is closed with an appearance by Alberto Granado now 82 years old. They also show photos from the actual journey & note that Che Guevara was assassinated in 1967 with the help of the US CIA (somewhere in the jungles of Bolivia) I liked the film a lot. However the film does not get into the 2 men's relationship and background enough. They are somewhat one dimensional. Both actors were very strong in their roles.",
            "review_date": "2010-01-23",
            "source": "rt"
        },
        {
            "content": "simply awe inspiring, however i expected to be inspired by this film but i was very pleasently surprised in the manner in which it achived it! you simply get lost in the story and forget your watching actors, not a documentury! it shows ernesto as a human being not just a martyr or a symbol! Pure brilliance!",
            "review_date": "2010-01-15",
            "source": "rt"
        },
        {
            "content": "Wow! every youngster should watch this inspiring movie - not only because its about Che Guevara but because its about 2 very young guys who want to understand their land - Latin America: How its impacted the locals, natives, culture and politics; how different each country is from another though they all come from the same land.. The movie is shot as chronological incidents and sometimes may feel it as abrupt but they hey! that's a diary they are portraying after all.. If you get through the first 20 mins, then you'll get used to it. \r\n\r\nThe movie shows Ernesto changing during the course of his travel and inspiring him to lead a movement. Though not as life changing as it was for Ernesto, I do think traveling gives people new/different perspectives ... (All inclusive vacations/trips do NOT apply)",
            "review_date": "2010-01-14",
            "source": "rt"
        },
        {
            "content": "Thumbs up to Netflix for suggesting this movie!",
            "review_date": "2010-01-13",
            "source": "rt"
        },
        {
            "content": "beautiful scenes and music. not having a plot  does creat sense of boredome but does serve to give an impression of the time passing and Che maturing and changing during this one of a kind amazing trip.",
            "review_date": "2010-01-11",
            "source": "rt"
        },
        {
            "content": "This film feels as long as the journey Ernesto and Alberto undertake in this film.  That's not necessarily a bad thing, but more of a testament to the gamut of emotions you'll feel as you travel with these guys stop-by-stop.",
            "review_date": "2010-01-07",
            "source": "rt"
        },
        {
            "content": "Had to watch it for Spanish not bad.",
            "review_date": "2010-01-06",
            "source": "rt"
        },
        {
            "content": "an inspirational and touching movie. wonderfully directed and with a very talented cast.",
            "review_date": "2010-01-06",
            "source": "rt"
        },
        {
            "content": "Often funny movie with great actors and beautiful landscapes.  Bernal, of course, is charming as hell, and so is Rodrigo De la Serna.\n\nReally corny illustration, though, of Guevara's awakening social conscience.  The movie practically shouts its own diagram at you: Rising action!  Climax!  Denouement!  At the end, Guevara turns to his friend and tells him how the trip changed him.  I slap my forehead.\n\nAnd of course there's the problem of saintly Guevara eventually becoming a murder-loving totalitarian.  It's just mythmaking. The Motorcycle Diaries reads like the sort of \"film\" a politician's own camp puts out during a campaign to draw a picture in voters' minds.  Propaganda, in other words.  But with grade-A production value.",
            "review_date": "2010-01-05",
            "source": "rt"
        },
        {
            "content": "A must watch for fans of Ernesto \"Che\" Guevara. Some may say it glorifies him, but from what I've read, the movie is a accurate representation of his journey across the continent of South America that he took with his friend in 1952, just months before completing his course in Medicine. The journey is said to be responsible for him turning from doctor to revolutionary and the movie does show the change that he undergoes over the 7 months of his journey.\n\nThe acting is great, and the story remains interesting throughout the 2 hour runtime. \n\nA definite must watch for people who wear the Che tees without knowing anything about the man on their chest!!",
            "review_date": "2010-01-04",
            "source": "rt"
        },
        {
            "content": "This movie makes me want to take my own motorcycle journey. Right now, I am serving in Americorps, and I know exactly how Ernesto feels as he travels around South America. This film is inspiring. I love it!",
            "review_date": "2010-01-03",
            "source": "rt"
        },
        {
            "content": "Dopuna pogleda na zivot Ernesta ''Chea'' Gevare nam prikazuje avanturisticki put po citavoj Latinskoj Americi, koji je preduzeo jos kao student medicine, sa svojim najboljim prijateljem. Taj put ga je  sudbonosno promenio, na njemu je upoznao sav sjaj i bedu svog kontinenta, stekao velike prijatelje i u sebi ustolicio ideale koje ce pronositi do kraja svog burnog zivota, koji je fascinacija filmskim rediteljima u poslednjih par godina. Ovo je definitivno film koji treba pogledati, a govori o putovanju koje bi svako od nas trebao da poduzme u odredjenim godinama",
            "review_date": "2010-01-03",
            "source": "rt"
        },
        {
            "content": "this is well worth viewing. It features superb acting and manages to be both informative emotionally engaging.",
            "review_date": "2010-01-02",
            "source": "rt"
        },
        {
            "content": "Awsome film, a bit slow to begin with but very moving :) recomend it to anyone... will change your opinion of today govenment and society",
            "review_date": "2010-01-01",
            "source": "rt"
        },
        {
            "content": "\"Watch this film before you buy a Che Guevara T-Shirt\"",
            "review_date": "2009-12-30",
            "source": "rt"
        },
        {
            "content": "I loved this movie from the beginning. Ernesto's words would flow like prose and really captivate you. He and Alberto are characters that you wind up rooting for. I'm no history major so I dont know what theyve left out or what theyve romanticized but as just a movie, their journey through Latin America was amazing. This is definitely worth watching.",
            "review_date": "2009-12-27",
            "source": "rt"
        },
        {
            "content": "Tres sympatique road movie argentin",
            "review_date": "2009-12-27",
            "source": "rt"
        },
        {
            "content": "Own it on blu-ray! Need to watch it!",
            "review_date": "2009-12-26",
            "source": "rt"
        },
        {
            "content": "Wonderful to see, and the most important, makes you think, totally recommended.",
            "review_date": "2009-12-23",
            "source": "rt"
        },
        {
            "content": "El director Walter salles nos entrega una fabulosa \"road movie\" protagonizada nada menos que por Ernesto Guevera antes de convertirse en el famoso \"Che\".  Gael Garcia Bernal como siempre, nos brinda una actuacion de primera clase, en una cinta con una direccion de primera clase.  Recomendacion:  Veala antes de adentrarse a las dos peliculas sobre la vida del \"Che\" dirigidas por Steven Soderbergh.  La trilogia quedara establecida.",
            "review_date": "2009-12-15",
            "source": "rt"
        },
        {
            "content": "TOP 10 FAVORITES OF 2000-2009\r\n\r\n#6 DIARIOS de MOTOCICLETA [MOTORCYCLE DIARIES] [2004]\r\nProduced by Robert Redford and directed by Walter Salles [\"Central Station\"], this film was largely ignored by American audiences, and racked up some 30+ international awards.  This is my favorite Gael GarcÃ­a Bernal [\"Y tu MamÃ¡ TambiÃ©n\", \"Babel\"] movie to date.  Set in the early 1950s, 'Diaries' is based on the journals of Che Guevara, Cuban Revolution leader, and tells the life-changing adventures he and his friend Alberto Granado had while traversing the South America continent by motorcycle.  Thoughtful.  Poignant.  With quiet moments of awe.  I loved this film.",
            "review_date": "2009-12-15",
            "source": "rt"
        },
        {
            "content": "Amazing movie, great acting!",
            "review_date": "2009-12-13",
            "source": "rt"
        },
        {
            "content": "Excellent story on the early years of Ernesto \"Che\" Guevara's life, before all that glorified revolutionary stuff made him popular. It is a coming-of-age, buddy road film that encompasses a long journey from southern Argentina all the way up South America. The film shows Ernesto and his best friend Alberto exploring their home soil of Latin America. Being that this was before his Cuban glorification, the film is a great feel-good story with excellent photography, amazing performances and a great story altogether.",
            "review_date": "2009-12-10",
            "source": "rt"
        },
        {
            "content": "now that's living!!!!!!! loved it!!!",
            "review_date": "2009-12-08",
            "source": "rt"
        },
        {
            "content": "A great tale of an amazing time... and an explanation needing to be told.",
            "review_date": "2009-12-07",
            "source": "rt"
        },
        {
            "content": "uno dei pochi casi in cui il film rappresenta degnamente con le immagini ciÃ² che le parole scritte possono far solo immaginare",
            "review_date": "2009-12-07",
            "source": "rt"
        },
        {
            "content": "Superb masterpiece...a lovely portrayal of South America during the times of early revolution. Quite amazing to see Chile, Amazon and even Macchu Picchu from the eyes of a backpacker. Its about the life of Che Guevera, South America, Incas, the underprivileged and the grit of a backpacker.A must watch!",
            "review_date": "2009-12-07",
            "source": "rt"
        },
        {
            "content": "Brilliant true life story about the boy who became an icon for many.  The story is heartwarming and gut wrenching at different times.  A must watch",
            "review_date": "2009-11-30",
            "source": "rt"
        },
        {
            "content": "It's a great movie, with a great story. At my point of view, doesn't matter if it's all true or if it's just to make a god out of Che's image, the movie is still good.",
            "review_date": "2009-11-22",
            "source": "rt"
        },
        {
            "content": "Many buddy road-trip movies are filled to the brim with gross-out humour and raunchy sexual escapades. While our two heroes seem intent on fulfilling that dream, the film turns into something far different, with Ernesto slowly morphing into the revolutionary he was born to be. Some might find the movie slow and uninteresting on the surface, but if you look beyond the simple escapades and into the characters, you can see just how both of them are growing up from childish college students into mature adults. The countryside of South America is lush and spectacular, and provides something to hold interest while the characters drive or walk on in silence. Some great lines convey a sense of wonder from the characters, such as How is it possible to feel nostalgia for a world I never knew? Through his travels, Ernesto begins to feel pity for the downtrodden natives of the country, and this is what really gives him the emotional connection that is needed to make the film come to life. Overall, it's a great look at a profound figure.\r\n\r\nOVERALL: 8.0/10",
            "review_date": "2009-11-22",
            "source": "rt"
        },
        {
            "content": "I didn't think I would like this movie, but it was really very satisfying. Very beautiful in the way it captured the people, the culture, and the landscape. I love the black and white shots throughout the movie and at the end.",
            "review_date": "2009-11-21",
            "source": "rt"
        },
        {
            "content": "para poli endiaferousa kai oraia tainia. den einai tixaio pou protagonistei o garcia bernal",
            "review_date": "2009-11-19",
            "source": "rt"
        },
        {
            "content": "From Brazilian director Walter Salles, who has made Central Station (1998) and Dark Water (2005), comes this brilliant and atmospheric travelogue, based on the diaries of a man who would become Che Guevara, but this was way before all that, back then there was no evidence he would become the legendary guerilla leader, but it was this trip that shaped him. In January 1952, it has 23-year-old medical student Ernesto \"Fuser\" Guevara (Gael GarcÃ­a Bernal) going on a road trip with his older friend and biochemist Alberto Granado (Rodrigo de la Serna), they travel from Buenos Aries on a 1939 Norton 500 motorcycle, christened as 'The Mighty One'. They travel through Argentina, over the Andes, up the coast of Chile, through the jungles of Peru, where they do volutary work at a leper colony in San Pablo, before finishing in Venezuela that July. It's a buddy road movie, but it has a dark edge, but it was this journey that shaped Ernesto Guevara to become Che, it is a coming-of-age story, and the locales which they travel are stunning. Bernal and Serna make a good pair, and they carry the film with Salles' quick, on-the-hoof style. Which suits it well.",
            "review_date": "2009-11-19",
            "source": "rt"
        },
        {
            "content": "A well put together, non-com road trip movie. Epic in character, profound, and touching. The story of best friends trudging through the worst and best times of their lives. It's times like these that more than changes a person, it recreates them from the soul outward.",
            "review_date": "2009-11-18",
            "source": "rt"
        },
        {
            "content": "An unbelievably moving film, with an ending which took my breath away. It's confusing to read some other reviews on Flixster, which claim it is too propagandist; trying to show a perfect, flawless man. There are some scenes which very clearly highlight his character flaws. The film is accurate insofar as it is based on their personal accounts. It does seem a little slow for the first half, but by the end you come to realise it was the 'getting acquainted' process - we don't have a decent word for that in English. I'd say kennismaking but no-one would understand it. It reminds you that we often forget Latin America with disquieting ease considering what we have done to it.",
            "review_date": "2009-11-17",
            "source": "rt"
        },
        {
            "content": "ANY film with Gael Garcia Bernal in it is worth seeing, but this one is wonderful.",
            "review_date": "2009-11-16",
            "source": "rt"
        },
        {
            "content": "Another great film starring Gael GarcÃ­a Bernal. Very thought provoking. Inspires further consideration of different cultures and the unique yet often difficult conditions in which others live.",
            "review_date": "2009-11-15",
            "source": "rt"
        },
        {
            "content": "This is a great movie, beautiful and funny and deeply moving.  It would probably get the extra half star if I spoke Spanish.  A wonderful film.",
            "review_date": "2009-11-15",
            "source": "rt"
        },
        {
            "content": "It is inspiring. It focused on the transformation of 2 young man in the journey which they see the world extensively. \nThe story is writen realistically. It shoot the \"real\" things happened in some corner of the world which can convulse one's heart.",
            "review_date": "2009-11-12",
            "source": "rt"
        },
        {
            "content": "'The Motorcycle Diaries' is a film I had dodged for quite some time, and I'm regretting it now that I realize the marvel it truly is. One of my favorite sub-genres of film is the 'road film' - popularized by such classics as 'Easy Rider' and 'Two-Lane Blacktop', where our primary, sometimes alienated characters find out what true 'freedom' really is by living by the rules of the road. 'The Motorcycle Diaries' is an exploration of life and compassion, as told through the young, pre-political revolutionist diaries of the late, great Che Guevara. We explore how societal and political decisions strain the lower and lower-middle class with un-faceable hardships, which is what fueled Che Guevara's socialized push on South American establishment. After a long time invested into medical school, he travels on a clunker motorcycle with one other companion. Through his journeys, he is faced with young-love and fallen society. He compassionately gives free medical help, as well as what little money he has in his pocket to a family in need. The story itself is stunningly inspiring, and in film-form it truly opens your eyes as a human being. This is as poetic as it is enjoyable.",
            "review_date": "2009-11-11",
            "source": "rt"
        },
        {
            "content": "Love love LOVE this movie! Very interesting about Che's early life. Great soundtrack, fantastic acting and beautifully shot.",
            "review_date": "2009-11-09",
            "source": "rt"
        },
        {
            "content": "I was so fucking bored.",
            "review_date": "2009-11-07",
            "source": "rt"
        },
        {
            "content": "y aun sigo creyendo que faltaron cosas  importantes del che aqui",
            "review_date": "2009-11-07",
            "source": "rt"
        },
        {
            "content": "What a telling story of communism and the strife for the working class in south america. Loved the scenery and the story",
            "review_date": "2009-11-02",
            "source": "rt"
        },
        {
            "content": "Whatever kind of person Che Guevara is, the movie was about some part of his life where he and his buddy decided to go on a life-altering road trip using an old motorbike.\n\nIt's a simple movie. It doesn't try to say a lot of things about Guevara and his buddy. Simply two young men who have decided to see the world before life caught up with them. Coming from a family who could afford education and three meals a day, both saw a lot of things. However, life caught Guevara earlier than it should have.\n\nI guess the whole context of this movie is still relevant to today's conditions. It has always been about land, livelihoods, environment and equal rights.",
            "review_date": "2009-10-31",
            "source": "rt"
        },
        {
            "content": "A brilliant film, well worth seeing. It is subtitled but I don't mind that. Very well directed, filmed, and acted. The scenery is amazing as is the people in the film.",
            "review_date": "2009-10-29",
            "source": "rt"
        },
        {
            "content": "decouverte de la realite latino americaine pour un jeune medecin... qui deviendra un revolutionnaire \"sanglant\"... apres ce film une question se pose: comment un jeune idealiste voulant aider son continent a la derive est devenu cet homme qui a marque l'histoire d'une telle maniere?!?!? le film n'y repond absolument pas, au contraire on decouvre un jeune homme qui veut aider au mieux les demunis, les exploites....",
            "review_date": "2009-10-25",
            "source": "rt"
        },
        {
            "content": "Vraiment un trÃ¨s bon film. Mise Ã part cette idÃ©e aussi folle que masculine, et pas du tout pratique de parcourir un continent Ã moto, le voyage est vraiment agrÃÂ©able Ã  suivre Ã l'ÃÂ©cran. Les moments de galere sont bien compris, les petits dÃÂ©lires et taquineries font sourire. Mais le plus important est combien il est possible d'en apprendre sur le monde et sur soi-mÃÂªme quand on quitte son petit cocon. L'asthmatique un peu timide et effacÃÂ©, risquera une traversÃ©e de l'amazone en pleine nuit...Ã la nage! Aurait-il pensÃ© Ã  Ã§a de lui mÃªme, quelque mois avant?\nCe film est de ceux qui inspirent Ã  voir plus grand.",
            "review_date": "2009-10-23",
            "source": "rt"
        },
        {
            "content": "The story is interesting, and the film tells it simply.  A bit on the romaticising side, but not overwhelmingly so.  Overall a pleasure to watch, but definitely this movie is not a revelation.",
            "review_date": "2009-10-21",
            "source": "rt"
        },
        {
            "content": "this movie gives us a very intimate look at the che that no one knows much about.  not that people know much about him besides his \"cool t-shirt pose\".  it depicts the young, adventuresome che guevara on a quest to explore himself and his country before he commits to medical school.  it's easier to watch if you think of this che as a different che than the one on the t-shirts.",
            "review_date": "2009-10-21",
            "source": "rt"
        },
        {
            "content": "Men set out on journey across South America, run out of money, motorbike breaks down, bluff their way forward, witness poverty & disease, life changing experience.\r\nA beautiful \"on-the-road\" film with breath-taking locations, funny dialogue & quite moving in parts. This, backed up with brilliant incidental music & strong performances by the two leading actors.\r\nNot sure how accurate the film is to Che Guevara's real life changing journey but it's certainly an entertaining & beautiful film.",
            "review_date": "2009-10-20",
            "source": "rt"
        },
        {
            "content": "one of the best real life story i hav ever seen......amazing",
            "review_date": "2009-10-19",
            "source": "rt"
        },
        {
            "content": "The second-best road movie I have ever seen starring Gael Garcia Bernal, but only because I haven't seen three. Lovely to watch but ham-fisted and heavy-handed. Watch Y tu mama tambien instead.",
            "review_date": "2009-10-19",
            "source": "rt"
        },
        {
            "content": "really cool movie. a little sad.",
            "review_date": "2009-10-15",
            "source": "rt"
        },
        {
            "content": "The film is slow-moving but a pleasure to watch. It is very thought-provoking and kinda sad.",
            "review_date": "2009-10-13",
            "source": "rt"
        },
        {
            "content": "The best road trip movie ever made!",
            "review_date": "2009-10-11",
            "source": "rt"
        },
        {
            "content": "Very pretty, but I felt quite lost in the plot and nothing really truly stuck with me.",
            "review_date": "2009-10-10",
            "source": "rt"
        },
        {
            "content": "fascinating look into what made Ernesto \"che\" Guevara the person we all know him as",
            "review_date": "2009-10-09",
            "source": "rt"
        },
        {
            "content": "Awesome!  Makes me want to go and be productive helping someone else",
            "review_date": "2009-10-05",
            "source": "rt"
        },
        {
            "content": "A fantastic, inspiring movie that shows the fascinating scences, cultures of the Latin America. The content of the movie was intriguing, it shows the different people that the duo met along their road trip across Latin America. The whole movie experience was further enhanced by the skilful and engaging performances by the actors. My favourite scene is the one when Ernesto wanted to swim across the sea to another island where the leprosy patients are \"dumped\" despite his asthmatic conditions to celebrate his birthday with them.He wanted to share his joy with the patients and he strongly believe that there should not be any segregations.This scene is very touching and inspiring. It shows that anything is possible, you just have to hang on to what you believe.Its definitely worth watching again and again.This movie has already won an Oscar in my heart",
            "review_date": "2009-10-03",
            "source": "rt"
        },
        {
            "content": "The evolution of the revolutionary.\n\nA journey of young Ernesto Guevara throughout Latin America and was transformed by the endemic poverty he witnessed. His experiences and observations during these trips led him to conclude that the region's ingrained economic inequalities were an intrinsic result of monopoly capitalism, neocolonialism, and imperialism, with the only remedy being world revolution.",
            "review_date": "2009-10-02",
            "source": "rt"
        },
        {
            "content": "very inspiring one. Che's presence is really missed today",
            "review_date": "2009-09-28",
            "source": "rt"
        },
        {
            "content": "estaba buena chÃ©...",
            "review_date": "2009-09-27",
            "source": "rt"
        },
        {
            "content": "Everytime I watch this movie I feel like I just wanna go traveling from tomorrow without no specific plans. Landscapes are really beautiful.... Great movie!!!!!",
            "review_date": "2009-09-27",
            "source": "rt"
        },
        {
            "content": "Impossible not to identify yourself with young Che if you live in Africa.",
            "review_date": "2009-09-25",
            "source": "rt"
        },
        {
            "content": "Raw, yet beautiful film with great performances from Gael Garcia Bernal and Rodrgio De la Serna.",
            "review_date": "2009-09-25",
            "source": "rt"
        },
        {
            "content": "The Motorcycle Diaries almost cured me of my insomnia.  My eyes threatened to close on numerous occasions, but whether it was the need to read the subtitles or the rousing asthma attack scene at the 90-minute mark, somehow I stuck in . . . but barely.  \n\nBefore you call me heartless for not loving this seemingly poignant film about a man who in discovering social injustice finds himself, bear in mind that my gripe is not with the subject of the film, but the manner in which it is told.  I actually found the last 30-minutes of the film quite moving, and I think this had much to do with the fact that the main characters finally stopped moving.  They planted themselves in one place and we finally had the opportunity to see a bit more of the human face of inequality and prejudice that rushed by us in the first three-fourths of the film. \n\nThis film actually has quite a few things weighed in its favor.  It has breathtaking cinematography and captures exquisitely almost every possible land form and climate.  The strength of the acting is also commendable especially considering how little the characters say throughout the course of the film.  This is one film where I actually longed for more dialogue and believe this would have benefited the film, especially during the long, laborious first half.     \n\nWhile I want to give the filmmakers credit if their aim was to reflect the long pauses likely to accompany a motorcycle trip across a continent, I would also like to remind them that this sort of thing generally makes for bad entertainment.  Yes, label me a classic \"American\" with a 15-minute attention span, but I've seen enough films to appreciate that even slow, plodding dramas do not have to feel that way.  Unfortunately, The Motorcycle Diaries is not one of these films.",
            "review_date": "2009-09-21",
            "source": "rt"
        },
        {
            "content": "A must watch for 'not so' movie lovers. Real admirers must have seen this movie. Based on the diaries written by Che Guevara during his journey of South America. Some parts give a documentary felling. Well picturised, brilliantly performed by the leads, music adds to the drama.",
            "review_date": "2009-09-20",
            "source": "rt"
        },
        {
            "content": "Fantastic. Sucks you in and never gets boring. Bernal and de la Serna are perfect. Flawless direction.",
            "review_date": "2009-09-16",
            "source": "rt"
        },
        {
            "content": "Un Road movie sauce latino sympathique oÃ¹ on regarde son voisin en se disant : \"Si on partait Ã  l'aventure sur une moto?\" Savoir que c'est ce voyage qui a crÃ©Ã© le \"Che\" est un plus, mais c'est avant tout le voyage de amis qui ne pensait qu'Ã  un mot : aventure. Le film montre bien la complicitÃ© entre Fuzzer et Alberto, mais a des fois quelques longueurs (en particulier la partie Ã  la lÃ©proserie). Pour ceux qui veulent un PÃ©kin Express sans StÃ©phane Rosenberg, le titre franÃ§ais est tout simplement \"Carnet de voyage\".",
            "review_date": "2009-09-13",
            "source": "rt"
        },
        {
            "content": "Good movie about the travels of two young men resulting in one of them to become a famed revolutionary named Che Guevera. this travel is made possible with a beat down old motorcycle carrying them across and around south america. good acting and solid premise.",
            "review_date": "2009-09-12",
            "source": "rt"
        },
        {
            "content": "Sorry but from a female perspective with male leads like these you can't do wrong with any movie let alone this one.  However this is a really excellent film and one worth catching for the early days of Che Guevara, before he became a militant for Castro.",
            "review_date": "2009-09-12",
            "source": "rt"
        },
        {
            "content": "Gael's acting in the asthma's attack is really good.",
            "review_date": "2009-09-12",
            "source": "rt"
        },
        {
            "content": "I love Gael Garcia Bernal, and this film is really good...",
            "review_date": "2009-09-11",
            "source": "rt"
        },
        {
            "content": "I know it is not the best movie ever done... but for me its the best movie ever",
            "review_date": "2009-09-11",
            "source": "rt"
        },
        {
            "content": "Injustice always exists! When you realize this, your life will change forever. Solitude, passion and then revolution~ Is that the destiny of being humans?",
            "review_date": "2009-09-10",
            "source": "rt"
        },
        {
            "content": "Very good film about the early travels of Che Guevara and how he came to develop the thoughts that shaped his life thereafter.",
            "review_date": "2009-09-06",
            "source": "rt"
        },
        {
            "content": "Very good movie with amazing landscapes... The actors interpretations is also excellent.",
            "review_date": "2009-09-06",
            "source": "rt"
        },
        {
            "content": "i loved the beautiful scenery and i could watch gael all day!",
            "review_date": "2009-09-04",
            "source": "rt"
        },
        {
            "content": "a must see, to understand kinda what developed and triggered che guevara's attitude towards injustice and poverty",
            "review_date": "2009-09-02",
            "source": "rt"
        },
        {
            "content": "dÃ©paysant mais... troublant: comment le ChÃ©, dÃ©peint d'une faÃ§on trÃ¨s/trop humaine et altruiste peut-il plus tard dans sa vie Ãªtre Ã  l'origine de faits inhumains?",
            "review_date": "2009-08-26",
            "source": "rt"
        },
        {
            "content": "Una pelicula interesante, que muestra un viaje del ChÃ© Guevara en el cual comenzo a desarrollar sus ideas de cambio y de latinoamericanismo. La historia es buena, pero tiene sus baches y momentos inncesarios a mi parecer. Las actuaciones principales geniales, pero algunos extras bastante mediocres. La fotografÃ­a y la escenificaciÃ³n o puesta en escena notables. Se echo de menos mÃ¡s profundidad, ya que solo se apreciaron ciertos matices. Pero en general buena pelicula.",
            "review_date": "2009-08-25",
            "source": "rt"
        },
        {
            "content": "\"wandering around americas has changed me more than i thought. I am not me anymore. Atleast Im not the same me i was \" - this tryly picturizes the entire movie. What starts as a fun adventure of traveling from end of end of SA, turns into a truly reality about real LIFE. Picturization is amazing, the cinmetagraphy is superb and of course the breath taking scenes of SA. Me being a travel freak loved the geography but what truly touched me was the humanity aspect that life is still so unfair.",
            "review_date": "2009-08-22",
            "source": "rt"
        }
    ]
}