{
    "rating": 9.1,
    "release_date": "2017-08-11",
    "num_reviews": 80,
    "genres": [
        "Korean"
    ],
    "summary": "In 1980, a foreign journalist hires a down-on-his-luck taxi driver to take him to Gwangju, South Korea. They soon arrive to find a city under siege by student protesters and the military.",
    "reviews": [
        {
            "content": "Really interesting story, delightful character development.",
            "review_date": "2023-03-13",
            "source": "rt"
        },
        {
            "content": "Good acting and striking imagery. I had been wanting to learn more about the Gwangju Uprising, and this was a great way to learn about it. It's dramatic subject matter, but the film was a little overdramatic at times. All-in-all, a good film.",
            "review_date": "2023-02-02",
            "source": "rt"
        },
        {
            "content": "dit is de beste kanker film die ik ooit heb gezien",
            "review_date": "2022-12-06",
            "source": "rt"
        },
        {
            "content": "This is a quirky drama, with some somewhat musing moments and also some very tense moments. I thought there were some interesting characters and it has quite a claustrophobic feel, primarily in the 2nd half. I like that its based on a true story, or so I believe - indeed at the end we see the real life counterpart of one of the characters on screen, with information provided by subtitles as well. This film became really quite gripping towards the end and its certainly poignant as well as thought provoking. I would certainly recommend this film to others, especially to fans of world cinema (its in Korean, with English subtitles). I like that at the films core, its about someone with a fairly basic job but who ends up doing something quite important - it helps you to feel like maybe you can play your own part in doing the right thing, so to speak. A film worth seeing, if only once.",
            "review_date": "2022-09-01",
            "source": "rt"
        },
        {
            "content": "One of the best Korean films I've ever seen. Great lead performance, strong background score and a very intense script. The movie will give you chills!",
            "review_date": "2022-06-09",
            "source": "rt"
        },
        {
            "content": "Based on a true story, the fluent movie bring us into the history of great importance.",
            "review_date": "2022-05-23",
            "source": "rt"
        },
        {
            "content": "Based on actual events, this excellent film was thankfully made by Koreans rather than by a western studio, allowing for more depth and authenticity. The film is weakest where it takes liberties in fictionalizing the actual story (as in the climatic car chase scene), but makes for a great ride and is well-deserving of acclaim, thanks especially to the fantastic Song Kang-ho.",
            "review_date": "2022-05-20",
            "source": "rt"
        },
        {
            "content": "Mostly, drama films are not an enjoyable ride for me. But this one here is an exception. Based on a true story, this film focuses on an adventurous journey endured by a Korean taxi driver and a German journalist on the midst of the Gwangju Uprising in 1980. ",
            "review_date": "2022-03-09",
            "source": "rt"
        },
        {
            "content": "Superbly acted. Very moving story about the horrors of communism and the bravery it takes to stand against it.",
            "review_date": "2022-01-12",
            "source": "rt"
        },
        {
            "content": "really great story - it did lose my attention a bit in the middle there, but i really love how it ended. they obviously really cared for each other after everything & the fact that they could never reunite was bitter-sweet but beautiful.",
            "review_date": "2021-12-15",
            "source": "rt"
        },
        {
            "content": "Last scenes was great,But begging and middle scene was boring.",
            "review_date": "2021-09-13",
            "source": "rt"
        },
        {
            "content": "Gripping, funny, good movie.",
            "review_date": "2021-08-01",
            "source": "rt"
        },
        {
            "content": "must watch, was very good",
            "review_date": "2021-07-01",
            "source": "rt"
        },
        {
            "content": "I destini di un tassista di Seoul e di un giornalista tedesco, si uniscono per raccontare magistralmente un evento storico sconosciuto ai più, e lo fanno intrecciandosi con diversi altri personaggi, tutti con abbastanza spazio da diventare importanti della sceneggiatura.\nIl film riesce ad essere potente, senza rivelarsi troppo cruento; lasciando allo spettatore un quadro preciso di quanto accadde.\nUna meraviglia nascosta.\nLa scena finale forse è un pochino troppo da film di azione.",
            "review_date": "2021-03-05",
            "source": "rt"
        },
        {
            "content": "This movie captures the worst dark era in Korean history. I hope you will pay close attention to Korea during this era. You can see how Korea became the world's current status",
            "review_date": "2021-02-06",
            "source": "rt"
        },
        {
            "content": "Dragged through the emotions of a treacherous time in South Korean history and you feel every minute of it.",
            "review_date": "2021-01-05",
            "source": "rt"
        },
        {
            "content": "Loosely based on the true friendship of Jürgen Hinzpeter, a reporter with German broadcaster ARD who covered the May 18 Democratization Movement in Gwangju in 1980, and Kim Sa-bok, his titular chaperone, this South Korea's submission for the Oscars' foreign-language film in 2017 is a tremendously stirring drama of heroism of ordinary individuals in extraordinary tribulations.",
            "review_date": "2020-11-22",
            "source": "rt"
        },
        {
            "content": "During the darker days of South Korea's past, we face flaming oppression, drowning spirits, earthly compassion and heavenly longing in one of the most immersive performances ever by Kang-Ho Song.",
            "review_date": "2020-10-18",
            "source": "rt"
        },
        {
            "content": "Excellent portrayal of protest and based on a touching true story.",
            "review_date": "2020-07-19",
            "source": "rt"
        },
        {
            "content": "TV, 2020/7/4\nWhat did you think of the movie?",
            "review_date": "2020-07-05",
            "source": "rt"
        },
        {
            "content": "Kang-Ho Song is pretty good talent and the events chain was so strong AF! the story had done creatively and the cast choices very exotic in this film.",
            "review_date": "2020-06-14",
            "source": "rt"
        },
        {
            "content": "فيلم كوري مقتبس عن قصة حقيقية تشويق/دراما تنقل فصل من تاريخ كوريا الحديث إبان صراعها مع الحكم العسكري، فما بدأ أنه رحلة عمل عادية لسائق تاكسي يصحب فيها صحفي أجنبي لتغطية أحداث \"الشغب\" في مدينة جوانجو، يتحول إلى صراع موت وحياة بانخراط سائق التاكسي وزملائه في مقاومة الحكم العسكري ومساعدة الصحفيين والثوار على إيصال صوتهم لوكالات الأنباء العالمية. يسلط الفيلم الضوء على صراع الأجيال واختلاف وجهات النظر وتناقضات النفس البشرية في مواجهة الأخطار الفردية وتغليب الصالح العام.",
            "review_date": "2020-04-16",
            "source": "rt"
        },
        {
            "content": "Well acted,well filmed,but with some script holes, \"A Taxi Driver\" is a good Korean Drama.",
            "review_date": "2020-03-22",
            "source": "rt"
        },
        {
            "content": "OMG!  I'd see movie like this before",
            "review_date": "2020-03-01",
            "source": "rt"
        },
        {
            "content": "So fresh movie. Thought it was comedy movie at first. However, it turns out to be sad",
            "review_date": "2020-02-25",
            "source": "rt"
        },
        {
            "content": "Song is by far one of my favorite people to watch on screen. His performances never cease to amaze me because they are so genuine. Cried like a baby at the beautiful message this movie relayed to us.",
            "review_date": "2020-01-21",
            "source": "rt"
        },
        {
            "content": "Amazing, I was in tears.",
            "review_date": "2020-01-18",
            "source": "rt"
        },
        {
            "content": "A really touching true story. Must seen.",
            "review_date": "2020-01-05",
            "source": "rt"
        },
        {
            "content": "An awesome movie on the dark historical side of the Not-North Korea.",
            "review_date": "2019-12-26",
            "source": "rt"
        },
        {
            "content": "A 'no name' taxi driver who drive the German journalist to Korea Gwangju for reporting the democracy movement in 1980. The setting is touching and the mind change of the taxi driver is precise. The section that while the group of journalist taking pic at a high point, while the driver eating dumpings at the corner is the greatest contrast point. ",
            "review_date": "2019-10-01",
            "source": "rt"
        },
        {
            "content": "It looks like the details of the story are completely made up. Yes, there was a cab driver who helped the journalist to go to Gwangju. But other than that, there does not seem much connection between the real and movie taxi drivers. I must admit I dislike when a false image good or bad of real characters is presented in \"historical\" movies. Nevertheless, the movie is entertaining, but it seems a little unrealistic at times. For example, the car chase scene towards the end is highly improbably to my eyes.   ",
            "review_date": "2019-08-25",
            "source": "rt"
        },
        {
            "content": "In 1980, there was a case like Tiananmen Square in Gwangju, a sourthern city in Korea. Many unsung heroes died, and the massacre was totally concealed from the public. But there was a brave German journalist that went to the city and reported the cruel atrocity committed by the army, which led to nationwide rallies for democracy 7 years later, and the dictator, who was the commander of the army in the massacre, stepped down.\n\nIt is mesmerizing to see people just like us turn into true heroes helping each other despite all brutality and sacrificing for people they even never met. Humanity combined with amazing acting. Definitely a must-see.",
            "review_date": "2019-08-02",
            "source": "rt"
        },
        {
            "content": "This is not only my favorite south! Korean movie, but my most favorite movie in general. This  is an absolute masterpiece and I  really enjoyed it a lot. I now after watching this am a huge fan of south Korean movies. Even though I had to read the subtitles and all after a few minutes  I just forgot about it because I was so immersed in the story!  All the actors were great and the characters are incredible. Overall I enjoyed this movie very much! I wish to see more movies like this.",
            "review_date": "2018-09-11",
            "source": "rt"
        },
        {
            "content": "A mesmerizing movie .",
            "review_date": "2018-08-27",
            "source": "rt"
        },
        {
            "content": "More than a documentary",
            "review_date": "2018-07-11",
            "source": "rt"
        },
        {
            "content": "A competent, although predictable film about an issue that's close to the hearts of South Koreans.\n\nThis film takes the events of the Gwangju uprising and tells us its story in a very Hollywood-y style. The story beats are very formulaic, the big tense moments feel wholly unoriginal and completely predictable. Some plot details were even so Hollywood-esque that it kind of took me out of the movie, like the main villainous plainclothes cop, the martyr singer, or the heroic fat kid. Just blatant character cliches.\nIt's like there is a basic formula for historic 'based on a true story' movies, and this Korean film followed it to a t.\n\nNow despite these things, it was still made rather well. The acting from the main character carried the film, the visuals were mostly striking and interesting. But, speaking of the acting, the German actor was really stiff and unnatural in contrast to the lively acting of the rest of the cast. I wonder if that's an issue with the director. There were good colours throughout the film. It treated the events with respect, and had a nice tribute at the end of it to the actual taxi driver the main character was based on. It was good, but still not great, and the problems I mentioned before really drag it down a bunch.\n\nOverall it's definitely one of the weaker Korean movies I've seen.",
            "review_date": "2018-04-09",
            "source": "rt"
        },
        {
            "content": "Really nice and exceed my expectations",
            "review_date": "2018-03-24",
            "source": "rt"
        },
        {
            "content": "I watched this movie with my boyfriend who doesn't understand a word of Korean nor has context to Korean modern history. So all the emotions and reactions I had with this movie, was probably not shared with him. I felt so proud of the Koreans and had an immense gratitude for the people who brute forcefully resisted against injustice and stood up together for what's right. They were the vital reason for Korea being the Korea today. My emotions ranged from pride, gratitude, fury and oddly warmth. This is a uniquely Korean emotion, Cheong. The dark force killed many but gave birth to incredible bond among those who lived. They took care of each other and this warmth shined so brightly in the midst of inhumanity. \n\nActing in the movies were phenomenal. I knew these were well-known actors but they took me right back in that very scene in that very time. They were what stirred up all the emotions I had watching this film. It was some of the best acting I've seen in recent movies, but I wondered if it'd get translated to non-Koreans who don't understand. (e.g. I just watched a Swedish film the night before and I felt the actor was a superb actor too, but not sure if I had the same level of empathy.) The main character showed a transformation of character from a fairly simple and daughter-frenzy single father who cared only for his daughter and his well-being to a patriotic warrior for justice and his country. \n\nI must actually correct myself by saying that acting by Korean actors were really great but the supposedly German reporter role could have been better. First off, he didn't have a hint of German accent, and I know this because I have a German boyfriend. And in such an intense environment, he showed no emotion. Granted he had only few lines in the movie (written by Koreans), he could have really demonstrated body language communication with the Koreans. \n\n\nThis movie was a personal one for me, just like 1987. This one wasn't as good as 1987 but movies like this are timely right now as we face so much corruption in our governments today. These are the movies who could answer the question of \"What difference does it make if you sacrifice today?\" Everyone's fight matters in this battle. History has shown us, and the decisions we make today will directly influence the world our future generations will live in. This movie is a reminder that our voice matters, and our actions matter more. And this reminds us that the more of us take actions, the better the future becomes.",
            "review_date": "2018-03-11",
            "source": "rt"
        },
        {
            "content": "The storytelling of the film is good, the emotions real, the main character honest, well written and acted. Also I did not know about the fact-based event described. That being said, I just give 3 stars because from my point of view was overlong, and the ending a bit too forced and the end too picturesque. Sorry",
            "review_date": "2018-02-19",
            "source": "rt"
        },
        {
            "content": "This movie caught me off guard. A very emotionally affecting movie.",
            "review_date": "2018-02-13",
            "source": "rt"
        },
        {
            "content": "Can't believe that the army really trying very hard to kill the people. The ending is a very good ending. The music is beautiful too. What a nice story.",
            "review_date": "2018-01-07",
            "source": "rt"
        },
        {
            "content": "A dark page, seldom known of Korean history, narrated through the real story of a witness. Dramatic real events provide the background for a tender clash of cultures, where human values emerge in spite of linguistic and cultural barriers. I loved it.",
            "review_date": "2018-01-04",
            "source": "rt"
        },
        {
            "content": "Well this is a mix of good and mediocre scenes. Didn't need to see the singing scene, didn't need the taxi chase scene near the end, that boy of the trio wasn't a good actor, and the foreign reporter did not develop much. The rest were good to excellent except for pacing, which is actually a common downfall of most Korean films. The best part is most definitely the the main character's performance. He can convey a wide range of emotion on varying intensity without any dialogue.",
            "review_date": "2017-12-25",
            "source": "rt"
        },
        {
            "content": "Unexpectedly good movie that deserved to be watched. Though the plot was predictable, the true life story and brilliant acting made the movie truly enjoyable, meaningful and touching. A simple taxi driver can also do something great.",
            "review_date": "2017-12-16",
            "source": "rt"
        },
        {
            "content": "I'm grateful it doesn't descend to cheap, unearned melodrama, because now more than ever, we need a reminder of the dangers of power left unchecked, and of how our shared humanity is our strength. This is a well-made film that's engaging and potent.",
            "review_date": "2017-12-12",
            "source": "rt"
        },
        {
            "content": "Comparable to The Killing Fields.",
            "review_date": "2017-12-09",
            "source": "rt"
        },
        {
            "content": "Performance wise Song is once again spot-on, however it doesn't exactly mesh with the rest of the film because there is definitely a drop off in performance when it comes to the other actors. A great tale of how one everyday mundane person can impact history and stand up against totalitarianism. It is unfortunate that usually the actions of these people goes unnoticed, otherwise we will be living in a much better world. Im sure similar movies could be made in other revolutions, Korea is only fortunate enough to be able to chronicle history.",
            "review_date": "2017-11-24",
            "source": "rt"
        },
        {
            "content": "A Korean film that runs the full range of emotions from low comedy to high tragedy. At times melodramatic, it nonetheless highlights that people can summon courage under the most terrible of circumstances. The Taxi Driver in question finds that Honour is more important than money.\nBased on a real incident in S Korea in 1980 it probably has a lot more resonance for those familiar with the Gwangju massacre. Yet even those who are not can appreciate the portrayal of ordinary people under the most horrific circumstances.\nSong Kang-Ho plays the part of a Buffoon awakened to the reality of 80s Korea by Tragedy. He gradually bonds with a German Journalist as they try and take in the horror of a peaceful Demo ending in multiple Killings.\nAs mentioned before there is humour to leaven the Drama but you will be moved by the tragedy of Gwangju.",
            "review_date": "2017-11-18",
            "source": "rt"
        },
        {
            "content": "A very moving story based on history. Koreans teaching American Hollywood a thing or two about making great films.",
            "review_date": "2017-10-15",
            "source": "rt"
        },
        {
            "content": "The film has been banned in China, although the film has nothing to do with China",
            "review_date": "2017-10-06",
            "source": "rt"
        },
        {
            "content": "I can't rate this film at Douban which is a Chinese version Rotten tomatoes. It's sad that this film has been blocked in China. There's no shame to hide from history. It's really great to see such film from South Korea.",
            "review_date": "2017-10-06",
            "source": "rt"
        },
        {
            "content": "An achingly beautiful and stirring film about an ordinary man, an appalling event, and humanity itself. 10/10. 100/100. Best film I've seen in 2017 so far. I will be very surprised if this film doesn't win an Academy Award for Best Foreign Film.",
            "review_date": "2017-10-04",
            "source": "rt"
        },
        {
            "content": "Face history, praise one!Face history, praise one!Face history, praise one!",
            "review_date": "2017-10-04",
            "source": "rt"
        },
        {
            "content": "????????? ???????????/(?o?)/~~",
            "review_date": "2017-10-03",
            "source": "rt"
        },
        {
            "content": "The impact of the movie does not confine to Korea, but is felt across the whole Far East Asia",
            "review_date": "2017-10-01",
            "source": "rt"
        },
        {
            "content": "TAXI DRIVER is a reboot of Seth Rogen's The Interview but subtracting North Korea and instead putting in 1980's non-liberated South Korea except the film does a lot of things better than The Interview. What makes Taxi Driver so brilliant is that it tells a powerful message of how South Korea's harsh and poor economic conditions and struggles to raise children were overlooked at the time since the world paid far more attention to Gwangju.",
            "review_date": "2017-09-30",
            "source": "rt"
        },
        {
            "content": "Great movie to tell a historic event, love the characters but the struggle of the protagonist is kinda sth happening too soon.",
            "review_date": "2017-09-21",
            "source": "rt"
        },
        {
            "content": "Touching and meaningful, a great movie and also a history should be seen.",
            "review_date": "2017-09-16",
            "source": "rt"
        },
        {
            "content": "Good movie about an event I knew nothing about. Go see it!",
            "review_date": "2017-09-15",
            "source": "rt"
        },
        {
            "content": "As a non-Korean speaking white guy, I can say it was an awesome movie.  Great acting and story. You learn something, you care and are entertained the whole time. Such a great movie!",
            "review_date": "2017-09-13",
            "source": "rt"
        },
        {
            "content": "Unreal depiction of a great story.",
            "review_date": "2017-09-13",
            "source": "rt"
        },
        {
            "content": "Brilliant film. Korean just gets better",
            "review_date": "2017-09-10",
            "source": "rt"
        },
        {
            "content": "Perfectly balanced with action, suspense, humor, and emotion. A definite must watch for the entire family.",
            "review_date": "2017-09-09",
            "source": "rt"
        },
        {
            "content": "Strong acting, and emotional A Taxi Driver is a great film that celebrates the everyday man hero. My Mother who lived in Gwangju during the time of the Gwangju Uprising felt the film was fairly historically accurate to the events in Gwangju. A Taxi Driver is emotional but doesn't suffer from the overacting found in other Korean drama films. Probably one of the best Korean films in a while.",
            "review_date": "2017-09-09",
            "source": "rt"
        },
        {
            "content": "A splendid film.  Long but never boring and told a true story that really needed telling.  The acting of the lead man Song Kan-ho is exceptional.  And the production values and directing are outstanding.  I am so glad I saw it!",
            "review_date": "2017-09-06",
            "source": "rt"
        },
        {
            "content": "Best movie of the year imo.  Strong cinematography.  Well-acted characters - the highlight being of course the taxi driver, but others were believable also.  Comes across as being a bit sappy and it seems like the movie over-dramatizes a bit, but the emotional impact of the events depicted is devastating and well-conveyed.  What I found most special is how this movie brought me back to an earlier time, whenm people were different, and it showed how fragile all our lives are.",
            "review_date": "2017-09-02",
            "source": "rt"
        },
        {
            "content": "Although I knew the background knowledge about this, I couldn't take my eyes ??? from the movie. Mr. Song's acting was so impressive!!",
            "review_date": "2017-08-31",
            "source": "rt"
        },
        {
            "content": "A spirited start then dragged towards the second half, telling this important and interesting story.",
            "review_date": "2017-08-28",
            "source": "rt"
        },
        {
            "content": "Amazing movie with Korean history lessons.",
            "review_date": "2017-08-25",
            "source": "rt"
        },
        {
            "content": "A lot of moving scenes are identical to other Keroen movies, this makes the touching feelings towards this film and Gwangju Uprising seems cheap. The taxi chasing scene is very cliche, except to add motion into the movie, it makes no sense and any meaning to the movie.",
            "review_date": "2017-08-20",
            "source": "rt"
        },
        {
            "content": "THE BEST movie I have seen in a long time. Stop what you're doing and get to a theater.",
            "review_date": "2017-08-19",
            "source": "rt"
        },
        {
            "content": "an incredible story about the courage is a common man in the not too distant Korea past.  must see",
            "review_date": "2017-08-18",
            "source": "rt"
        },
        {
            "content": "So far, the best Korean movie I have seen this year, and one of the best ever. Song Kang-Ho's powerful performance deserves all the accolades and Best Actor prizes.",
            "review_date": "2017-08-18",
            "source": "rt"
        },
        {
            "content": "AMAZING, EXTRAORDINARY, PERFECTLY THOUGHT OUT, SO TOUCHING! ABSOLUTELY LOVED THIS MOVIE!!",
            "review_date": "2017-08-15",
            "source": "rt"
        },
        {
            "content": "Absolutely extraordinary!! Perfectly thought out, touching, just wonderful!! Loved every bit of it!!!",
            "review_date": "2017-08-15",
            "source": "rt"
        },
        {
            "content": "Being a korean myself, this movie was very touching since it portrays an event that changed many things in South Korea. The Gwangju Uprising was such a movement that affected the history of Korea and this movie really made the helps those who do not know about this a wonderful visual of what it feels like to be in it.",
            "review_date": "2017-08-13",
            "source": "rt"
        },
        {
            "content": "This movie is amazing. Moving..",
            "review_date": "2017-08-12",
            "source": "rt"
        },
        {
            "content": "Do you hear the people sing? singing the song of angry men! All eyes and ears were blocked but a German reporter risked his life to record and tell the truth and here is the taxi driver who helped him!  A must see!",
            "review_date": "2017-08-10",
            "source": "rt"
        },
        {
            "content": "Good to share the truth. If you know modern  Korean history, it is a must to see. RIP for the German reporter, who passed away recently.",
            "review_date": "2017-08-02",
            "source": "rt"
        },
        {
            "content": "What a wonderful movie. I've been watching lots of Korean movies lately, and  this is one of the exceptional ones. You get a glimpse of Korean history, while still being  entertaining, stirring, and emotional without being cloying. Song Kang-ho is an excellent actor. I've seen him in several movies, and he just keeps getting better. I know some people don't like to \"read,\" but I implore you to give Korean cinema a try (This one, Silenced, Man From Nowhere, Oldboy, Okja, The Host, New Trial, Peppermint Candy, etc.). It'll be well worth your time. I was fortunate to see A Taxi Driver in a theater (NYC, baby), but be on the lookout for it when it hits Amazon Prime, Netflix, or Hulu.",
            "review_date": "2017-07-26",
            "source": "rt"
        }
    ]
}