{
    "rating": 8.6,
    "release_date": "2017-04-28",
    "num_reviews": 167,
    "genres": [
        "Telugu"
    ],
    "summary": "Shiva, the son of Bahubali, begins to search for answers after he learns about his heritage.",
    "reviews": [
        {
            "content": "meh.... so many cgi's and very unrealstic",
            "review_date": "2023-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excellent way of ending a mind blowing franchise. Not once did I move from my position when watching the movie",
            "review_date": "2022-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The scene of singing and dancing is indispensable to Indian cinema, but this film does not neglect the integrity of the overall story by dancing.",
            "review_date": "2022-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "SS Rajamouli hits the bull-eye when it comes to convincing the audiences why it happened the way it did at the end of part 1 (Bahubali: The beginning) with great screenplay, dialogues, visuals and action sequences. According to me, he is one of the best story-tellers of Indian cinema.",
            "review_date": "2022-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A stupid movie that doesn't care about physics and has bad VFX.",
            "review_date": "2022-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot is somewhat messy, as 3/4 of the movie is a prequel, and the rest of the movie is a sequel. Despite this, it is entertaining and fun to watch.",
            "review_date": "2021-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely overhyped! The climax ruined the whole thing for me. When dealing with a huge budget and anticipation from the audience, director Rajamouli should've tried to put a little bit of logic into it. Daggubati Rana makes it worth watching.",
            "review_date": "2021-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So when this movie came I had requested my parents to let me watch it. And when I say request, I mean really, a lot. I had seen the prequel in the theatre and had been waiting for this movie to come out ever since. It got delayed by a year. At first I was mad because the Baahubali: The Beginning said 2016 in the end, and the year was already going too bad. But finally it came in 2017, so I guess that makes it better.\nAnd just like Baahubali: The Beginning, this one also felt legendary. Not like a cheap sequel the way successful movies make, but an actual conclusion we had all been hoping for. The question as to why Katappa killed Baahubali was answered in the most spectacular way possible. We finally got to see how Baahubali met Devasena and why he was banished from Mahishmati. The action scenes were even better than the previous movie, and it concluded without any sequel baiting.\nI see why there are so many negative reviews over here. This movie can only be truly enjoyed in a theatre. It won't have the same impact when being watched on a TV or phone. It needs a huge audience to cheer, a perfect environment to be absorbed and the satisfaction we get after we spend a good amount of money to watch a movie.\nI am really hoping this saga has come to an end. They should not make more movies unless it is really necessary. We already have the perfect duology and having more than what we need will only ruin its image which we obviously don't wish to see. This movie deserves the same love as we give to all our ancient scriptures, because that is the vision which SS Rajamouli had while making this, and it's very much apparent when we watch this movie.",
            "review_date": "2021-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film win my heart",
            "review_date": "2021-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After the first part, I personally watched the second part only to know why kattappa killed Baahubali, but there is a lot to it. Baahubali 1 was a thrilling movie with somewhat an abrupt ending. But the second part tells us the best part of the story. The first half shows us the intense love story of Amarendra Baahubali and  Devasena while the second half is mostly on why kattappa killed Baahubali and the war. The climax war is something really amazing. All the scenes are well shot and is a visual treat. And the music makes it better.\n\nDon't judge the movie, go watch it. And if you haven't seen the first part or have forgotten, watch it and then go for the second.\n\nMany questions of yours maybe unanswered in the movie, if you're really interested, buy the RISE OF SIVAGAMI. For all huge fans, it's a must.\n\nOverall I would give it a 4/5",
            "review_date": "2020-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "didnt live up to the first part. filled with over the top and obvious situations. still thoroughly enjoyable experince.",
            "review_date": "2020-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Conclusion is mostly satisfying in terms of visual grandeur and acting. But the generic nature of the earlier portions, though entertaining, test your patience to witness why Kattappa did it. It also ends up predictable when it follows the Hamlet, The Lion King style narrative. Yet, Rajamouli's imagination pulls you in till the end!",
            "review_date": "2020-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie brought a change in the Movie Industryin India. Action Sequence could have been a little bit better from my perspective. Overall good 👌🏾",
            "review_date": "2020-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its a entertaining movie.",
            "review_date": "2019-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only one hing about SS Rajamouli's ''Baahubali: The Conclusion\" can be called bad call- it made us wait for the whole one year. The full year passed with the 'Why Katappa killed Baahubali' jokes. But when the film dazzled in the theatre, the whole theatre felt like the majestic palace of Mahishmathi and I, for myself, felt like a piece of the crown, witnessing the grandeur and the joyous spectacle on the screens. Prabhas originally lifts off the screens this time, with a more solid performance as, this time, Amarendra Baahubali in the major half of the film. The characters, already fleshed out, have become more exciting. And the story, more outstanding. This film is easily Rajamouli's victory of vision. Despite a low on logic war scene which made me sorely miss the first Baahubali movie, the film lives up to the originality of the sequel, even when it doesn't equalize. This is a surely unmissable film. Go watch. ",
            "review_date": "2019-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It could be better. The story was good but it reminds me it's a Tamil movie I meant action scene was soo poor.",
            "review_date": "2019-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although Bahubali 2: The conclusion is an engaging watch, it did lack a sense of reality in its action sequences. Some of the shots in the film was clearly miserable.. like the one in which the soldiers are catapulted into the fort.. Come on guys!\nDespite these flaws, the film had a grippy plotline and beautiful cinematography.\nRajmouile's direction was average.\nBackground music score was pretty good.",
            "review_date": "2019-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Conclusion is mostly satisfying in terms of visual grandeur and acting. But the generic nature of the earlier portions, though entertaining, test your patience to witness why Kattappa did it. It also ends up predictable when it follows the Hamlet, The Lion King style narrative. Yet, Rajamouli's imagination pulls you in till the end!",
            "review_date": "2019-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It,s a extraordinary movie, action scenes are very powerful and the storyline is good",
            "review_date": "2019-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whether an Indian or not.. It's a must watch by each and every human being!! ï¿ 1/2~ï¿ 1/2~",
            "review_date": "2019-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lovely visuals and effects. A great prequel and clears the confusing ending of the first movie.\nLoved it.",
            "review_date": "2019-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best tollywood films, screw mahesh babu or any other films",
            "review_date": "2019-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a nice movie",
            "review_date": "2019-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outstanding performance",
            "review_date": "2018-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bollywood lord of the rings",
            "review_date": "2018-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Indian film in the modern times!",
            "review_date": "2018-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was surprised to learn that a movie that has the words \"The Conclusion\" in its title spends most of its runtime continuing the flashback sequence from the ending of the first chapter. This isn't a bad thing, as learning the backstory increases the dramatic weight of the action-packed finale. I do feel this movie is slightly better overall since it has more impressive visual effects and the story was more engaging overall. I do feel the movie has a bit of a rocky start but eventually picks up and stays at a good pace from that point forward. The action scenes are definitely very over the top, but they are entertaining. It's a solid follow up to this ultimately well told two-part story. I definitely think the time invested in watching both of them was worth it.",
            "review_date": "2018-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing script and screenplay, good story and direction .",
            "review_date": "2018-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super cultural action thriller movie ever",
            "review_date": "2018-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've watched this show more than three times. I love it.",
            "review_date": "2018-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A visual treat with good performance of all actors",
            "review_date": "2018-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More of the same. With more characters and confusing plots. But you don't watch this for the story. It is the ridiculously epic Bollywood style. \n\nAnd it delivers, and then some.",
            "review_date": "2018-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just watched BAAHUBALI....\n#BEST INDIAN ACTION MOVIE.\nIt crossed hollywood style n entered Anime style in war sequences.\nGoosebumps at EVERY second.\nFor the ones who are going to watch it in Hindi.....u knw hindi dubbing industry has well known golden reputed history of being worse. lets hope since everything has to go through S. S. Rajamouli n M. M. Keeravani it would be better than usual.\nBUT.. still..Best of Luck.????\nIt has set new standard.\nfor every upcoming movies.....there is one question...\n#CAN IT REACH BAAHUBALI!!??????\n#MUSTWATCH!!!!\n#BAAP.... #BAAHUBALI!!!!!!!",
            "review_date": "2018-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Baahubali 2: The Conclusion is not quite as good as its predecessor with a somewhat weak storyline, but the film is visually dazzling to behold with great costumes, interiors and phenomenal set pieces and special effects. Colorful and exciting, it is also exhilarating, though silly in its action and it thus succeeds as a pretty good conclusion to this story. But above all else, both of these films are very enjoyable as they are incredibly epic in scope and world building and in that aspect are much better than most American blockbusters.",
            "review_date": "2018-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I feel 80% of the movie is animation but it's beautiful haha, and a good story too. Was very enjoying watching it !!",
            "review_date": "2017-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is by far the greatest movie made from India. SS Rajamouli delivered the best sequel ever. His cinematography and directorial actions along with the amazing acting from Prabhas and Daggubati are ultra-extraordinary. The Conclusion also has amazing scenery with Mashimati and the visuals from this movie are amazing. The Conclusion is by far the greatest movie from India.",
            "review_date": "2017-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "National embarrassment. The worst way to flush crores down the drain, ever, and ever includes Escobar who burnt notes and flew in hippos for his entertainment.",
            "review_date": "2017-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although the producers and directors may have over-exaggerated on the action a little bit (Ok, A LOT), it had a great overall message to offer to the audience. I really recommend watching this if you're into sci-fi movies based in ancient times.",
            "review_date": "2017-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked the second movie even better than the first. The previous film ended in a flashback and now we continue still in the past. We watch as Bahubali Senior woos his wife (apparently with the aid of Beyonce's wind machine) only to have his feet knocked out from under him by the story's villain. Back to the present, Bahubali Junior and friends have another grand cinematic battle as justice is served.",
            "review_date": "2017-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "lol brang rating down or no",
            "review_date": "2017-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good storyline and animation. The characters were portrayed really good.",
            "review_date": "2017-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "MAHENDRA BAAHUBALIIII IS BACK! More amazing than before and more amazing than ever. This movie is the next generation of bollywood movies and can be an excellent franchise if the fantastic S. S. Rajamouli allows it. Not only has he carried the great name Baahubali to greatness but has carried it to legendary new heights. 10/10! S. S. R. is not only legend but a new rising King of bollywood movies.",
            "review_date": "2017-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst movie ever\nEffects were soo poor and irritating to the eyes!",
            "review_date": "2017-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best action film in indian industry you have to see it in all languages it is worth watching in theaters",
            "review_date": "2017-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best indian movie",
            "review_date": "2017-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i could not believe the sequel will be so bad. Unlike the first part which was awesome, it seems like Rajamouli was not confident of this second part, and it shows. Dated CGI, action scenes with no sense or logic this movie is geared towards male chauvinists. I hated everytime baahubali does something there is always this \"baahubali baahubali\" soundtrack depicting how awesome he is. What happened to Rajamouli? In short, this movie is not something i would be proud to show my non-indian friends and say \"look this is our Indian cinema at its finest\"",
            "review_date": "2017-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Direction is amazing but, unrealistic movie. May be children like it because they like cartoons.",
            "review_date": "2017-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An incredibly emotional composition to the story; which actually adds more depth & weight to the first film. Music is superb but the visual effects is yet again a hit & miss. The conclusion of the film though satisfying, unfortunately left a few loose ends untied (such as the fate of a certain character and/or prominent characters from the first film just left forgotten).",
            "review_date": "2017-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't really like the revenge story and the first part was way better and had a good story but the second on is a brutally really also a copyright of a lot films which do royal and romance stuff so this wouldn't we so great. The second one also isn' to good because there is was too much drama because there is not point of having that much drama when just crossing a bridge at the very end. The characters acted very well but the movie and storyline weren't to great. Also, They were to un realistic things because on one of the acts he was punched by metal and it seemed like he did't get a scratch. He was supposed to die of the arrow because it him strait though the chest too unreal and smashing a marble stone what is that, that is like impossible.",
            "review_date": "2017-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie...everyone must watch...Proud of India.",
            "review_date": "2017-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Baahubali 2 is Indeed a Pretty Decent Movie. But is falls slightly short of My Expectations.",
            "review_date": "2017-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Baahubali : the conclusion directly moves to the story and gradually reveals the answer why kattapa killed baahubali.The answer was predictable.The reason why kattapa killed baahu was acceptable and the acceptable reason is one of the reasons of the victory.Rajamouli's formula in this movie was cool graphics and moving mahishmati story .\nBut the plot of the story was the same from Magadheera.A good hero who will be killed by a greedy villan who wants  heroine(lover of hero) .\nthe hero will take revenge in his next birth. In eega hero will be killed and \nhis soul will go to a fly and takes revenge.Here in baahubali the killed hero's son will take revenge.So the plot is same.\n                                                                                       The insertion of mahishimati kingdom and characters like sivagami,kattapa,Ballaladeva,pingaladeva and ofcourse our hero\nAmerandra baahubali and mahendra baahubali makes us not to think of the plot.Screenplay makes us not think about anything so fast. Graphics  from elephant to broken ballaladeva's statue was excellent .Flying boat and soliders flying in air with shield is just an example of rajamouli's innovations.\n                     Prabas,Rana,Ramya krishnan,nasser,sathyaraj were outstanding\nin their roles.Prabas was excellent in acting the emotions given by him when he killed was perfect.Sathyaraj and Ramya krishnan were SUPERCALIFRAGILISTICEXPIALIDOCIOUS sathya raj's acting when he asked to kill baahu and when he stab baahu with tears was mind blowing and we shed tears and ramya krishnan's expression when anushka sending reply letter gives goosbumps.Anushka shetty as devasena was brilliant in acting.\nHer dialog delivery was perfect .Her emotions were very real that gives every audience goosebumps.The songs were very good especially kanna ne thungada was awesome.Choreography was nice in all songs \nextra marks for the boat song 'nana devasena'.\n                                                                                    When kattapa stab baahubali we will feel the pain.The whole theater is in silent(first day)\nEach and every person in the theater shed tears it is the real victory of \nBAAHUBALI 2",
            "review_date": "2017-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fabulous movie in the History of Indian movie",
            "review_date": "2017-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Hype was more than the story, what a story LOL son taking revenge of father come on its not 190's the VFX and animation were poorer than 90's tv shows",
            "review_date": "2017-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie, Kudos to the team and especially to director Mr S.S. Rajamouli for making every Indian proud.",
            "review_date": "2017-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most emotionally engaging &  visual treat to watch , the story line is perfect & the role play of each actor is awesome,easily one of the best movies I've watched & Bahubali 2 has set a bar very high for others to cross, there are many practical life lessons in the movie especially in part 1 where Amarendra Baubali boosts morale of his fleeing & almost defeated army by saying & I quote \" what is death?, death is believing that the morale & confidence of enemy is more than ours, & standing down to his terror & his blow to our self esteem\", in the second part he shows how important it is to be man of words even in times of great pain, it was so excruciating to such an incredible person t die to deceit & only deceit could kill him as nobody could kill him from front.",
            "review_date": "2017-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "MIND BLOWN AWAY AND LOST IN THE LANDS OF BAAHUBALI.",
            "review_date": "2017-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an epic and huge spectacle of a movie about betrayal and revenge with an engaging and operatic story and well acted characters. At times, the action was unashamedly over the top but fun to watch.",
            "review_date": "2017-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the best movie ever I can watch it 4,000 times. If I ever get the question what is your favorite movie it would be Baahubali the beginning and baahubali 2",
            "review_date": "2017-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A larger than life movie. If you have watched the first part, you cant miss this one.",
            "review_date": "2017-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie!!!! India's Biggest Blockbuster -Ever-  AMAZING!!!! MUST WATCH!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2017-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an indiscriminate mixture of clamorousness and flamboyant visuals that severely defy logic as well as laws of physics so often making a mockery for over 3 hours ..\nThe writing is unbelievably worthless through out, especially in the beginning when the duo of Baahubali and his side kick mama start being supposedly funny.\nThen We have a never ending Saas-Bahu contention on women empowerment, traditions and much more ridiculous scenarios which I have seen growing up when my mom used to watch Daily soaps on TV. \nFinally the thing I hated the most in this movie is reason that kept the whole nation drooling for 2 years \"why kattapa killed Baahubali\".  The whole backdrop leading to the Baahubali killing is really silly as well as predictable.\nCinematography and background score is average.\nSo is there any impressive thing about this movie?? Yes, particularly two scenes ...\none is the oath taking scene which is visually delightful and surprisingly painstaking. \nSecondly the final climactic combat between the 2 bodybuilders which was pretty decent for an action cinema...\nAll the others stunts /special effects are good for only 5 minutes.\nPerformance which demand a lot of shouting is justified by Prabhas, Rana and Ramya.\nKattapa a bit overacting drama queen and his comedy is pathetic. But still He shines in some serious situations.  Anushka looks a bit old for a princess but still manages her role with a somewhat of a decent job. The directorial vision depends extremely on deficient visual effects and sturdy characters which is a big letdown.\nOverall a nice attempt by the filmmakers to explore a historic theme but they really should pay much more attention to script writing, laws of physics, logic and many more....",
            "review_date": "2017-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "awesome movie. the best indian movie",
            "review_date": "2017-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that brings to life childhood imagination of mythology and Amar Chitra Katha. This one is must watch. It transports you to a magical kingdom of Mahismati from which you dont want to come back.",
            "review_date": "2017-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the story too out of mind, but i like it,",
            "review_date": "2017-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fantastic. a must must watch.",
            "review_date": "2017-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "cannot say this one is better than its prequal...but still an epic movie...",
            "review_date": "2017-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Has the worst special effects if I saw a movie like this I would kill myself because this movie is trash and full of shit",
            "review_date": "2017-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Action, adventure, drama with a depth of integrity and raw, heart-breaking tragedy that Iv'e only felt from Shakespeare in an \"Oh Happy Dagger\" way and with characters as meaningful as Game Of Thrones.  Also the action and music and visual artistry is nothing short of a feast that you will want to be  all-you-can-eat.",
            "review_date": "2017-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's an epitome of indian cinema",
            "review_date": "2017-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the MIND BLOWING movies seen recently!",
            "review_date": "2017-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its 10 times Bette than its prequel , a must watch movie in    big screen , hats of to Rajamouli for creating this epic.",
            "review_date": "2017-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazingly crafted movie, intense story line. Great / mesmerizing fight sequences.",
            "review_date": "2017-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have no words for Parbhas and SS rajmouli i have fallen in love with Parbhas",
            "review_date": "2017-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extravagant, intensely emotional epic experience. Must watch",
            "review_date": "2017-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I created my RT account just to review this film. In my opinion E-P-I-C does not begin to cover it... An absolute must-see, along with Baahubali 1: The Beginning... See B2 now in your nearest theater and stream B1 before/after.  Superb action and battle scenes, music and choreography. Acting right up there, too... Very likeable actors. A pleasure buying a ticket for the first time in ages. Kudos to everyone involved and-thank you!",
            "review_date": "2017-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Emotional see saw and the grandeur is never before seen in Indian Cinema.",
            "review_date": "2017-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I want my fucken money back.",
            "review_date": "2017-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best action movie ever made in India",
            "review_date": "2017-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Who the heck are these critics that give these garbage films 5 stars?",
            "review_date": "2017-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visual brilliance with a crisp-thin story line",
            "review_date": "2017-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worth the wait to know why katappa killed Bahubali",
            "review_date": "2017-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good movie but i hate the dance and mens semi naked",
            "review_date": "2017-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An entertaining epic of grand scale that deserves its near universal acclaim and deserves to be watch by everyone in its original language, Because the dubs kinda suck.",
            "review_date": "2017-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly an epic in every way script, casting, technicians, production and everything is majestic. Complete success of Team Work, Hatsoff to the Director SS Rajamouli for the Vision and Producer's for their belief in vision of Director.",
            "review_date": "2017-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the prequel but still hugely entertaining",
            "review_date": "2017-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "as per the budget n ignoring 1 very upsetting moment on the basis of the movie being fantasy ill give it 5/5",
            "review_date": "2017-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was a joke, I've seen better movies with better spcial effects on Sci-fi channel! Just pathetic and over hyped trash",
            "review_date": "2017-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A notch below 'The Beginning', but a suitable conclusion to a pathbreaking cinematic experience for India.",
            "review_date": "2017-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst movie I have ever seen. This is overrated",
            "review_date": "2017-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nicely done and visually spectacular. Worth it.",
            "review_date": "2017-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3 plus hours of meaningless flick",
            "review_date": "2017-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some other American viewers have been bashing this movie and I feel personally offended by that because this movie was one of the most amazing experiences currently available to humans. I normally dislike watching movies in a foreign language because subtitles almost seem like work, but in this movie I was totally engrossed by every second of the dialogue, the action, the music, and the visuals. I weep for the many people who will never get to see this. It's over 3 hours long but I never felt like it was dragging or needed to move along and get to the good parts, because there were no good parts, everything was somewhere between great and perfect. The special effects weren't the best, but it never hurt my enjoyment of it, and it's amazing how much this movie can do with such a low budget compared to an American blockbuster. If you haven't seen this movie and just think it is just a silly weird foreign thing that's not for you, I beg you to reconsider, because Baahubali 2 changed my life.",
            "review_date": "2017-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally know why Katappa killed baahubali. Now I need the know who is bhallals wife!! ????",
            "review_date": "2017-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This 2 part movie just keeps getting better and better, heck I cried a little bit on the inside, and I don't usually do that when it comes to films. It's not Netflix now if anyone wants to check it out. the Tamil version is the original spoken language so make sure to select that version, because their are three versions in total listed.",
            "review_date": "2017-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Poor acting, poor storyline, low end CGI compared to modern movies. Would not recommend.",
            "review_date": "2017-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The effects are much better, compelling plot. Enjoyable 167 minutes...",
            "review_date": "2017-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not great story telling, nor great acting, nor great camera works. However it is good. \nIt's a typical Indian masala movie done to a grandeur scale. There is nothing more than that. The CGI and VFX are a first for this scale and will make other movies follow the path. \nWhat Avatar was for Hollywood, Bahubali is for masala entertainment movies in Indian cinema. Avatar was good when released, but today it doesn't command 10% of the initial respect. The same is for Bahubali.\nIt is a spectacle, and spectacles remain one till a new or bigger one comes along.",
            "review_date": "2017-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies I have seen.  Goes for only special effects at the expense of plot, acting, a quality screenplay, or any subtlety.  What a waste of a huge budget and three hours of the viewer's time.",
            "review_date": "2017-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Milestone in Indian film history. Hats off to Driector Raja Mouli",
            "review_date": "2017-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly, i liked the baahubali 1 more than the concluding part. It was better scripted, less drama, more content, less predictable. The righteous woman, who was a confident, fiery, composed and a far sighted commander in movie 1 seemed baffled, aggressive, stubborn, egotist and gullible in the latter one.\nThe first half was a little stretched and the second half defied physics on all grounds. Poor Tamanaah had next to no role, i wished to see her in the action sequences, the village lady who baahubali had saved in first part had more role than Tamanaah a.k.a. Avantika.\nAll the actors however did justice to their role, be it the antagonist Rana, who made presence felt with just his expressions and body language, the Tigress Ramya krishnan, the Stalwart Sathyaraj, the Majestic Prabhas and ofcourse, the Doyenne Anushka Shetty. \nThe technical team did wonders to the film, hats off to the tech team. The story bridged the two parts nicely.\nAll in all, it's a must watch family movie. :)",
            "review_date": "2017-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Grandeur in making, Interesting screenplay and a great end to the story that started in the film's prequel... Great movie.. One of a movie kind... Must watch..",
            "review_date": "2017-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must watch movie.\n#outOfBox thinking ????",
            "review_date": "2017-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie sucked, very low budget.. ??",
            "review_date": "2017-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome Graphics and animation. marvelous supporting music .",
            "review_date": "2017-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good plot and best screenplay and special affects",
            "review_date": "2017-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hands down, the best epic war fantasy India has ever produced. Fabulous acts, awesome cinematography, pleasing music and great visuals! In fact, I think this was executed better than the first part!",
            "review_date": "2017-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a 2nd final part of the sequel. It is a well written epic revenge story. The CG and Camera work are excellent. Marvelous work by the the music composer. The director did a great job. The actors and actresses simply did a superb job.",
            "review_date": "2017-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The sad part is that Bahubali could have easily been India's own masterpiece under Fantasy genre... However it ends up being an overdramatic, overhyped, mediocre film...",
            "review_date": "2017-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Words fails me (out of this world)??????????",
            "review_date": "2017-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hi everyone????\nOmg I love this movie ? it is the bomb. I am so damn happy that I watched this movie it's the best of the best.. if u haven't seen it u better watch it. At first it's a Telugu movie and second of all I thought it didn't have English subtitles when it started then I was relieved becuz it did have English subtitles and I enjoyed it so much... hats ? off to the directors who made this movie a hit..",
            "review_date": "2017-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a masterpiece from Bollywood for universal audience. if you liked Ben-Hur, Ten Commandments, you will love it.",
            "review_date": "2017-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No you dont fly like that!!",
            "review_date": "2017-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bahubali 2 is the exceptional movie from our Indian cinema.. masterpiece!! movie has shown importance of a woman in a manâ(TM)s life far better. personality of anÂ ideal Indian woman, i.e.Â the oneÂ who never gives up, gentle, yet tough and unintimidating. ð~",
            "review_date": "2017-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Satisfying conclusion to Baahubali. Baahubali 2 is grand in everyway compared to the first part. The magic is still not lost. The VFXs are great and action sequences are very well choreographed.\n\nI can't say that it is better then the first part because it is the original. It showed how a grerat story and VFX and can be blended to provide a magnificient experience. This is a must watch movie, you like it or not but it can't be denied that it is a great movie.",
            "review_date": "2017-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "India's biggest blockbuster yet...Although the first part has a big over use of CGI it is still impressive....The second part nailed it and thus has made a conclusion to the prequel...There could also be a sequel according to the director and I think it would be named Baahubali:The Conclusion Part 2 :)",
            "review_date": "2017-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome story line with unimaginable graphics and acting.. with out S.S Rajamouli's direction this was not possible",
            "review_date": "2017-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Considering the 1/10 of the budget of Hollywood movies, making such an international standard one is simply amazing...!!  and a must watch for those who loves the Hindu faith and culture which was often distorted and abused in many Indian & foreign movies by many  , A Gem and the pride of the Indian film ever made.!\nApart from the outstanding CGI, VFX and visual extravaganza, The film portrayed the \"Dharma\"  and \"values\" of the Hindu culture, be it the discrimination or bias against humans, (Notice Kattappa (war-slave) is been asked to bless the baby of the  king, the prince asking him to feed..) The punishment to the guard who abused a lady, the portrayal of the dignity of a woman in case of marriage ,the love 7 care of the King to his subjects. Every entry scenes are magically attractive and you feel the goosebumps allover.\nFor me , Kattappa is the one backbone of the movie.",
            "review_date": "2017-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "BAAHUBALI\n\n - THE MONSTER CINEMA SMASHING ALL TIME RECORDS!\n\n- RAJAMOULI THE GREATEST DIRECTOR OF OUR TIMES!\n\n- WHAT A MOVIE! WHAT AN EMOTIONAL STORY! \n\n- I AM SIMPLY SPEECHLESS \n\n- I HAVE NO WORDS TO SAY\n\n- I LOVE BAAHUBALI \n\n- I LOVE RAJAMOULI SIR \n\n- A BIG SALUTE TO RAJAMOULI SIR ??????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????",
            "review_date": "2017-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well written story with a good, interesting screenplay. If not for the unrealistic fight scenes and CGI, the movie would have been much more enjoyable.",
            "review_date": "2017-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome visual wonder and will do magic",
            "review_date": "2017-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An essential ability in understanding and appreciating works of Fantasy is the ability to say ''Why not?\" A boy with a lightning scar is suddenly a wizard. Why not? A halfling from the shire is tasked with protecting the fate of the free world. Why not? And if there ever was a work of Fantasy that taxed your ability to say \"why not?\" it was this one.\n\nBaahubali 2 is a triumph of CGI over a good story. A victory of extravagance over character development. Having said that, it's not without it's merits. If taken in the context of mythology/fantasy the movie will perhaps be one of the best movies of this year (both domestically and internationally). The acting is top notch, with Ramya, Sathyaraj and Rana leading the way.\n\nThe film contains all the opulence and exaggeration that is to be expected from a South Indian movie, unfortunately it also contains the naivety that is to be expected from a mythological story. The film in my opinion fails to take the age old concepts of power, manipulation and betrayal and give us something both new and grand (it certainly succeeded in the latter)\n\nBaahubali is the story of a man who was seen as a God, but the film certainly makes you wonder if he's even mortal. His only humane quality is perhaps his complete ignorance of the dangers that surround him. A quality of the strong? or the stupid? depends on your perspective. There is no doubt that the film is entertaining, however, my only wish was that the film should have balanced the fantastical with the natural rather than with the ludicrous.",
            "review_date": "2017-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the best movie in a long time.  go see it",
            "review_date": "2017-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely ridiculous piece of shite.",
            "review_date": "2017-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing visuals, beautiful background score combined with some fabulous performances and strong female characters. Granted there are a few forced comedy/cringeworthy scenes and some of the CGI maybe average but still the movie is brilliant.",
            "review_date": "2017-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "BAAHUBALI 2: THE CONCLUSION is very rare movie, which is Joyful, Heart-Touching, Spirit-Elevating and a Grand Visual-Spectacle.\nThis part, takes us right off the cliff from the first part's finale to the uncharted territories of movie paradise in Indian cinema history.\n\nIncredible  S.S. Rajamouli is at his very best in crafting and catapulting this movie to the top of the blockbuster mountain and he \nis India's pride and reply to the Hollywood's own heavyweight, James Cameron. \n\nRana Daggubati as Bhallala Deva succedes in portraying the most vicious villain in recent times, a role that defines his dedication and skills.\nwhile Sathyaraj as Kattappa and Ramya Krishnan as Rajmata Sivagami produces the most iconic and loved roles in their illustrious career.\nAnushka Shetty brings her ever-lasting beauty and class to the role of Devasena, the warrior princess and Nassar is marvelous \nin portraying the manipulative Bijjaladeva and Subbaraju  is loved by everyone for his role as Kumara Varma.\nTamannaah was like an angel from heaven in previous film, but this time she shows the Heart to play a small role with full support.\n\nAnd there is no words to describe \"The Man\" who plays the Legendary Baahubali.. Prabhas is splendid and glorious on the Grand Stage.\nPrabhas lives in our heart as the the man who refuses to loose while keeping the morals sky high... A role that makes him a electrifying sensation \nall over India and around the Globe...\n\nBGM of M.M. Keeravani is on an another level that makes our blood boil, makes our eyes teary and thrill our nerves again and again. \nKotagiri Venkateswara Rao edits the movie flawlessly and stunts by King Solomon, Lee Whittaker, Kecha, and Peter Hein are jaw-dropping.\nCombination of Makuta VFX, Senthil Kumar's Cinematography, Sabu Cyril designs and Rajamouli's Vision makes this an extra-ordinary silver-screen extravaganza.\nA big salute to the produces Shobu Yarlagadda and Prasad Devineni for showing a wide open mind to let loose Rajamouli and showing faith in him to makes this alluring movie on a humongous budget.\n\nBaahubali Franchise benefits from the unique gathering of talented individual who brings with them, unmatched dedication and hard work...\n\nFather-Son Team of Vijayendra Prasad and Rajamouli, masterfully weaves the story in a gripping and intense way...and when good face-off with evil in this tale, \nwhen the light tries to strike down the darkness in this saga, And when the \"Unstoppable Force\" Prabhas clash Head-On with the \"Immovable Mountain\" Rana Daggubati \nin this epic, it results in shattering of box-office records and will leave you wanting more....\n\nRajamouli shows nothing is impossible when you have the heart and his right-hand man Prabhas bring soul to the film with his charming screen presence, his signature Smile (a symbol of honesty) and truthfully living (not acting nor playing) the\nlarger-than-life Hero Baahubali... \nA heart-felt thanks for each and every person behind and on the screen for making this superior movie and i recommend everyone to watch in theaters as early as possible with family to experience this\nsmack-dab, adrenaline pumping, high-spirited once in a decade Movie...",
            "review_date": "2017-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too much violence. Children should not be taken to the movie.",
            "review_date": "2017-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must watch, Amazing movie!",
            "review_date": "2017-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The wait is finally over. Baahubali 2: The Conclusion is here to answer the question the nation has been waiting to know for two long years- Kattappa ne Bahubali ko kyu mara? \n\nRelax- No spoilers here! You have to go, and watch the movie to find out, just like the rest of us did. \n\nBut when you go to watch Baahubali 2, remind yourself of few things-\n\n1. This is a sequel to Baahubali: The Beginning, so either re-watch that movie, or read the story on Wikipedia, to remind yourself of the story and characters. (If you have not seen that movie, go watch it first. Duh!) \n2. If you have seen Baahubali, you know what exactly to expect from this sequel. It is a Telugu movie (irrespective of which dubbed version you see), so the storytelling is inherently grandiosely  in nature.  So the hero's will have heroic scenes and dialogues, and the villains will have over-the-top background music with extreme close ups to show you the villainy in them. \n3. This is a $200 million ambition movie, made with the budget of not even $50 million. So the VFX will at times be with par with international cinema, and at times be extremely patchy. Forgive it for that.\n\n?So I ask you give in, and allow director S. S. Rajamouli to take you on this EPIC journey.?\n\nYes, the story is a bit been there seen that, but the screenplay is very cleverly written to still keep you entertained and hooked for good three hours. ?And that is a big win for the director and writer V Prasad. ?\n\n?The production and set design are huge, and beautiful (yes, some of it is CGI, but still a great combination). The action sequences are very well choreographed, and have been attempted at international movie level. The art design, and cinematography are breathtaking. The costumes, and make-up are on point. The soundtrack is soulful, and takes the story forward, instead of breaking the narrative. But better than the soundtrack is the background music. What fabulous work. Especially for the scene right before the interval. Outstanding stuff. ?\n\nActing wise, everyone in the ensemble cast has done a fabulous job. ?Ramya Krishnan as the ego-stricken mother, Sathyaraj as Kattappa the loyal protector looking for redemption, Nassar as the cunning father, and Rana Daggubati as the vengeful brother, have all delivered great performances. ?\n\nBut the two people who stand out tall in this movie are ?Prabhas ?plying the original Baahubali and ?Anushka Shetty? playing his love interest. If you liked Baahubali the son, you will love Baahubali the father. The son version was just a small shadow of what the father is. He is everything you expect a \"Hero\" to be. He has the swagger, flamboyance, and charisma, a \"Hero\" should have. As for ?Anushka?, she is the strong female character I wanted ?Tamannaah Bhatia ?to be in the first movie. Anushka is strong, and does not back down from her ideals and beliefs, no matter who is on the other side. That's kickass. Bollywood is gonna go ga-ga over these two. \n\nBut yes, the movie is not perfect. It has its flaws. There are some continuity faults that I caught. The narrative sometimes becomes a bit self indulgent and looses focus. The climax is not as epic as I expected it to be. And like I said above, the VFX is not perfect. Also, some of the extras insisted on hamming their scenes. But despite these flaws, Baahubali is a huge achievement. It's not just entertaining, it's also one of the most technically sound movie to come out of India. And just for that, you should go watch, enjoy, and support this magnanimously ambitious project.",
            "review_date": "2017-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Waste of money...aweful movie...too much hyped ..just watch it on DVD or online",
            "review_date": "2017-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If Indian cinema has a Hall of Fame, Baahubali 2 will be one of the all-time-greatest movies & will occupy the throne for a very long time to come. OMG, I have never watched a movie with so much awe for almost every scene. CGI, sets and reality have blended so well to create visual splendor at never seen before levels, that you forget yourself and become part of the movie. There is no more comparison with Hollywood for standards/quality of movie making. Indian cinema has truly ARRIVED at the world level, setting new standards for movie making.\n\nThat was about the experience of watching the movie and the quality of movie making itself. Coming to the story/script:\n\nFor me, \"Why Kattappa killed Baahubali\" was not a big question at all - knowing Kattappa's love for Baahubali & the fact that he was a slave to the throne, either Bhallala deva or Sivagami should have ordered him was obvious.\n\nBaahubali stands tall(not just physically), but also by the measure of his character. He makes some good choices when faced with a dilemma of blind obedience to throne/mother or Dharma(even though it meant he picked his wife/lover and not mother). It is sad that he never could sit on the throne in spite of being people's choice. Prabhas has become synonymous with Baahubali with his utterly flawless all-around performance. He does it all - mind boggling stunts, romance, dance, comedy and sentimental scenes. Looking like a King should have been so effortless for him - he wears it so naturally.\n\nIf there is one character that can surpass/equal Baahubali, it is the warrior Princess Devasena. Be it the fight sequences, stoic endurance of 25 years of torture, romance, dialogue delivery - Anushka is an actress par excellence. She comes across as the personification of majestic beauty, strength and fierce independence. Her screen presence is a force to reckon with.\nNo other actress could have matched Prabhas - if Prabhas looks like a born King, she is a born Queen. Her characterization is by far THE BEST - the way she stands up to Sivagami - when Sivagami sends gold to get her hand in marriage for Bhallaladeva, her retort to Baahubali during her baby shower, the way she defends herself in the court for chopping off fingers of a Mahishmathi commander - simply WOW!\n\nRana has aced as Bhallala Deva. The gaunt face, void of any fat combined with a 6 pack body, gives a natural meanness to his face. He easily takes it up a notch with an ice cold look here or a devious smirk there. Be it the sly smiles that hide his hunger for the throne, the expressions of rage that make him hack the dead Baahubali's body, he knows where to hold back and where to go out and bare it all. He really manages to send a shiver down one's spine in terror and that is a huge victory.\n\nThe phrase \"one and only\" fits Ramya Krishnan perfectly. Her majestic screen presence in spite of being short, the combination of royal exuberance and dominance in her face, the eyes that can express compassion one second and fury the next - OMG, she gave me goosebumps so many times. Especially in the opening scene where she walks with a pot of fire on her head unperturbed by an approaching mad elephant. She should give classes on how to walk like THAT(hell or high water, I do what I do).\n\nSathyaraj as Kattappa and Nasser as Pingala Deva have played their roles very beautifully. There are no big surprises in their characters.\n\nTamannah is largely absent in part 2, save one or 2 scenes where she tries to show some grit and effort to fight, but goes unnoticed.\n\nW.r.t. script, I felt that a lot of time was spent on the flashback and there was a sense of hurry when it came to the present where Shivu had to avenge his father's death. Jumping into\na war with mighty Mahishmathi without any strategy did not sound wise. I expected that Kattappa will seek the help of Aslam Khan(Kicha Sudeep) or Baahubali's allies and advise Shivu about any weaknesses of Bhallaladeva or secrets of the Mahishmathi fort. The romance track in part 1 could have been replaced with some more story from part 2 & a couple of scenes that show brainstorming for the final war would have given it a sense of completeness.\n\nThe letdown for me in this movie is the character of Sivagami. The one who was the epitome of justice and fairness in part 1,falling prey to hearsay and giving/changing orders at the fall of a hat - she looks like a gullible person with a frail ego who has no regard for due diligence when it comes to matters of the state. If not for her saving the life of Mahendra Baahubali, she could very well be seen as a villain in part 2. May be \"vinaasha kaale, vipareedha buddhi\" is true in her case. When the time is bad, you make cloudy judgements and act in haste.\n\nI can nitpick on the script a little bit, but nothing, I mean nothing will take away from the magnum opus this movie truly is. I am SO, SO, SO PROUD to be hailing from the region where this movie was made and speaking the same language as them.\n\nMusic - BGM is great and the songs sound great in Telugu, not that good in Tamil. I don't know if it is because I heard them in Telugu first, but so much is lost in translation. I had the\nsame feeling about part 1 songs. Somehow, Madhan Kaarky's lyric engineering does not sit well with me.\n\nSabu Cyril(Production Designer) and Rama Rajamouli and Prashanti (costume designers) need a special mention for their fabulous work. One cannot wrap one's head around the sheer amount of work, a production of this magnitude would have warranted. Hats off to the entire team, especially Rajamouli and his vision!",
            "review_date": "2017-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb movie with lots of action, emotion and thrills. Mass movie..",
            "review_date": "2017-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Movie seen this year and counting all the Hollywood Movies. A true spectacle!",
            "review_date": "2017-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1. Does it live up to the hype? Yes.\n2. Is the story outstanding? No.\n3. Is the VFX outstanding? Yes.\n4. Acting by everyone great? Yes.\n5. What was not needed in the movie? The songs.\nConclusion: If you loved the first, you will love the second.",
            "review_date": "2017-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful movie..superb cast, imaginative and highly creative direction by Rajamouli and Stellar performances from cast..",
            "review_date": "2017-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Best Movie Ever In Indian Film Industry and it's from Telugu Film Industry(TFI) The Indian Film Can Be Divided As Two Parts Indian Film Industry Before Baahubali After Baahubali #SSR #Prabhas",
            "review_date": "2017-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Tollywood Extravaganza, It's about time everyone lives this epic. The film was so well marshalled by S. S Rajamouli and Team. The Lead were very good in their roles. The VFX has set a benchmark for Indian cinema being on par with many Hollywood flicks. But not everything in this epic is good. The end war was missing the magic unlike the war in Part 1. The BGM didn't help it either (in the war only, the remaining bgm was good). Another complaint i have is in the beginning of the movie the Elephants looked so CGI it could have done better. Apart from these two complaints the rest of films packs enough action and lots of emotion to enjoy the ride",
            "review_date": "2017-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Movie....Nice to Watch .....bond between characters.",
            "review_date": "2017-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "you need to watch this movie",
            "review_date": "2017-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All Time Indian BlockBuster. Totally Spellbound by the Sheer Scale & size . Gripping Story Excellent characters Beyond IMaginations",
            "review_date": "2017-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One Word to Describe this movie.its EPIC",
            "review_date": "2017-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spectacular. Some parts of the story, like some parts of the technology or acting or songs or editing are tacky/unimpressive but when/where the movie soars in war scenes and general visual extravaganza, they make up for all the other flaws.",
            "review_date": "2017-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is too loud and too grand. Some VFX effects you can literally feel it that it is imposed instead being gel with individual frame.",
            "review_date": "2017-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visual treat backed by a great storyline.",
            "review_date": "2017-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visual extravagance.... A fantasy folklorish movie should be taken this way....  \nIt's a classic and pioneer at the same time... have no doubt that new movies will start comparing against this one as baseline for coming years...\nCharacters have displayed amazing acting Ramya Krishnan, Sathyaraj, and Anushka dazzle the audience with skills of acting\nWar scenes and graphics are giving. Visual extravaganza... this movie should be watched in theater for the full effect",
            "review_date": "2017-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best entertainer in all aspects ,surpasses part 1 and set benchmarks for indian cinema ,S S rajamouli didnt try to make international film without songs .......as in hollywood instead bahubali is rooted in existing indian film genres may be some cliches ,but twist is in presentaion ,we can sense the grandeur in each and every frame justifying huge budget (as per existing indian standards ),a cinematic marvel indeed. take a bow team bahubali,as i read in a review it is a textbook of how  to make a solid entertainer",
            "review_date": "2017-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a shit movie. What a waste of time. The effects were terrible and so much over acting and the story was pathetic. I do not recommend at all.",
            "review_date": "2017-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seriously not worth the hype. \nStory: nothing new, totally predictable. The story is supposed to be normal humans with no super powers but the things they can do are like super hero's. Seriously need to get out of stereotypical stories\nVisuals: stunning as the first one. Best visuals in an Indian film",
            "review_date": "2017-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great visuals. Great story. Top class acting. Well done Team Baahubali!!",
            "review_date": "2017-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By the interval i felt its enough...its just perfect...i never expected anything more...the mystery of why and how Bahubali was killed is revealed and i didn't try to predict it during the waiting period for this movie..and i think no one could script any better reason for killing Bahubali that what Rajamouli has shown...whatever time they have spent, whatever money they spent, whatever they sacrificed to make this possible, whatever waiting Crores of people have done..is paid back by interval itself..i would have happily gone home and slept after interval itself even though Ballaaladeva is yet to be killed...\n\nThere is an issue with the first half though...first half is 200% perfect...and with that dose given in the first half itself, second half needs to be 400% perfect and it is quite impossible... i get a feeling Rajamouli tried doing that and he just couldn't make sunshine shine any brighter without causing skin burns...its the same as Yuvraj's 6 Sixers over and when he plays the next over, how could he ever satisfy you !!\n\ncompare this with Chandramukhi ...the movie starts slow, boring, casual...and picks up towards the end and takes you to peak towards that Vaarai song....or compare this with the fact you watch this movie with part 1 old lady Anushka in memory and when we see her in part 2, there was enough scope to make her look beautiful and Rajamouli did the best and i don't think she can look any better than this...noone misses Tamanna or even thinks of her when Anushka is on screen..\n\nso what Im trying to say is that ... the second half should have been trimmed to atleast 70% of what it is..fights felt a little extended..and the 1 on 1 fight felt inspired from terminator2...i wont use a loose comment of copied...that is never the case...but when i saw it, the Arnold mercury man fight rolled before my eyes which was another masterpiece for the world of cinema..\ni would have loved to see the part 1 highlight of Beheading Bhallala's son in the second half of this part 2...but if that is done, the part1's second half would have badly missed that scene..maybe Rajamouli felt the same and gave that severed head a little further role in part 2...i feel it cud have been better...Bhallaala didnt feel sad about son's beheading but is only angry on the missing Anushka(because she went missing) and the born from dead Mahendra Bahubali(because why is not dead)..(but no because why they killed his son !!)...and another unsatisfying thing is ..Mahendra killed Bhallala's son without knowing who he is..which is good for part1 as it simply aggravates Bhallaala...but for part2 if Bhallaala had another son and Mahendra kills him after knowing the story, it would have helped the revenge theme of second half of part2..instead of this second son, i guess Rajamouli used the head of only son to play in part2 as well..i would have kept a second son for Bhallaala to help the second half of part2 ...by the way the Beheadings(there are 2 to 3 main ones from both parts) look inspired from hollywood...but just think about it...there are few ways you can Behead...and that certainly reminds you of similar scenes from other films...neither the viewers mistake nor makers..by the way i dont understand why Bhallaala should kill the older dad of old Anuskha..\n\nsecond half should have been crispier..and with a few highlights and shorter fight sequences.. because Bhallaala and Nazar were already defeated when everyone in the movie and outside the movie love Prabhas within the first half itself...and also because they are way older than young Prabhas...the Bahubali's death involves multiple parties viz.mom,dad,bro,Kattappa,bro's soldiers, some enemy team that is not clear if sent by the bro Bhallaala or if a coincidence... maybe a spice or two should have been reduced from that Bahubali murder...maybe the movie should have shown the Bhallaala anger from rejected love of Anushka..\n\nAnd not too many songs...i liked that...1 song is beautiful of Prabhas and Anushka...to rate it 5, just edit the second half within the existing takes and make it short..it will make a better difference...\n\nby the way i think i can write many books commenting or complimenting  this movie...the Bahubali team already spent lifetimes into this remarkable masterpiece of Bahubali... look at man hours spent and convert to days, months years ..this program is worth many lifetimes...beautiful vision...the best is first half of part2 of all 4 halves of both parts..",
            "review_date": "2017-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "even 2nd half looks great",
            "review_date": "2017-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As it was in Baahubali:The Beginning, Conclusion will be a trending historical-drama.",
            "review_date": "2017-03-26",
            "source": "rt",
            "lang": "en"
        }
    ]
}