{
    "rating": 8.7,
    "release_date": "2017-05-05",
    "num_reviews": 390,
    "genres": [
        "Sci-fi",
        "Adventure",
        "Action",
        "Fantasy",
        "Comedy"
    ],
    "summary": "Peter Quill and his fellow Guardians are hired by a powerful alien race, the Sovereign, to protect their precious batteries from invaders. When it is discovered that Rocket has stolen the items they were sent to guard, the Sovereign dispatch their armada to search for vengeance. As the Guardians try to escape, the mystery of Peter's parentage is revealed.",
    "reviews": [
        {
            "content": "From good visuals to good story and character developement… In gotg2 you can find everything",
            "review_date": "2023-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it isn't as balanced as its predecessor, Volume 2 is a more unique and unpredictable movie that sells with its great characters and funny moments.",
            "review_date": "2023-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest 2.25 hours ever!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2023-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians of the Galaxy Part 2 is a\nthrilling and entertaining sequel that delivers on all fronts. The chemistry between the characters is stronger than ever, and the humor is just as hilarious as the first film. The visual effects are stunning, and the action scenes are expertly choreographed. The film also manages to explore some deeper themes without sacrificing its fun and adventurous tone. Overall, Guardians of the Galaxy Part 2 is a must-see for fans of the Marvel Cinematic Universe, and I highly recommend it.",
            "review_date": "2023-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed the movie and found the humor in it funny, usually in an MCU movie the jokes feel out of place to under cut a serious moment but in this case they are done really well.",
            "review_date": "2023-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So funny and thrilling. \nIt had me crying at the end and works so well with the characters and actors making a perfect match.",
            "review_date": "2023-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun like the first one.  Maybe a little too plotted.",
            "review_date": "2023-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was great , it was funny, and it had good characters",
            "review_date": "2023-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably my favorite Marvel movie. Yondu's death was pretty sad though.",
            "review_date": "2023-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Volume 2 of my favorite sci fi  franchise.  There is plenty of action & special effects, but mostly because of the humor.  So many great one-liners, I have to pause to laugh so as to not miss anything.",
            "review_date": "2023-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Childish and goofy. The first one was great and they tried to 3x that. Didnt work.\n\nNotice how the visuals are worse in this?\nJokes were forced and try hard. Maybe intoxicated people love this flippy version.",
            "review_date": "2023-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very fun movie with a great story, and a kick ass soundtrack. The guardians actors did a great job reprising their roles and Kurt Russell was a perfect villian.",
            "review_date": "2023-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This felt like a more dumbed down version of the first film.",
            "review_date": "2023-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An All Time Classic. This retains the colorful, imaginative cinematography from the first. the special effects are very well done though some of the final fight between Russel and Pratt can be a bit shotty. The music & acting overall are as good as the first with some really fun characters and a very good villain. The only minor problem is the humor is more prevalent here and they double down on it a lot to mostly positive results. However, sometimes it doesn't work that well and scenes can drag a bit because of it but for the most part 70% of the jokes really work and the rest aren't bad as much just fall flat except for the stupid Pac-Man joke at the end. The pacing is still very good though and the editing is very good although the story in the middle with Rocket and Yondu while important to the plot feels like they focus a bit too long on their story at times. Overall though those minor complaints don't take away from recommending everyone should see this once just like the first. It's a really fun and creative sequel.",
            "review_date": "2023-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first one, but still really enjoyable.",
            "review_date": "2023-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "they are really the guardians of the galaxy",
            "review_date": "2023-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have to say I cant believe they got the actor for mario from the mario movie here he made this AMAZING when stomped on all the goombas i went nuts",
            "review_date": "2023-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like the emotional level of this story, and absolutely nothing else. I can't even tell you why, it's just distasteful to me, the villain is a power-hungry maniac with no motivation other than that. I do not enjoy watching this movie.",
            "review_date": "2023-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent sequel but not perfect by any means. Cool adventure.",
            "review_date": "2023-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was ok. Wasn't terrible by far but it lacked something",
            "review_date": "2023-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the rare movies where the sequel is better than the first. \n\nThe music, action, comedy, and tragedy are on another level.",
            "review_date": "2023-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Equally as great as the first movie.",
            "review_date": "2023-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians of the Galaxy Vol. 2 is a great sequel to the first, we finally get the explanation to who Peter's father is and in the process we find out that even though his father is of course his father he still isn't his daddy!",
            "review_date": "2023-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know a lot of people like the first one better than the second one but I absolutely loved at this second adaptation of this movie. I feel like volume to give us so much more with the characters and gave us so much more excitement. I think that it's wonderfully done and it's absolutely a fantastic adventure in thrill ride. I highly recommend checking out this movie.",
            "review_date": "2023-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "exiting and fun, almost as good as the original, guardians 2 is still very entertaining!",
            "review_date": "2023-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yeah the FX is good, but the rest of the script feels forced, basically, follows the same path of \"we visit a place that looks like heaven initially to then realize everything is a facade\". We follow every character by turns through the plot realizing how do they start realizing about the real purpose of the host. Boring script",
            "review_date": "2023-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While mostly enjoyable, there are multiple sees that drag on way too long. These scenes only work if the jokes land, but they don't for me. These make subsequent viewings awkward. It's still pretty good though.",
            "review_date": "2023-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watchable but not even close to the first one. ",
            "review_date": "2023-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians 2 is at its best during the downtime as the group (primarily Drax and Quill) deliver genuinely funny interactions.",
            "review_date": "2023-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think the first one was much better, but it's still a good movie with a really cool comedy feel.",
            "review_date": "2023-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as much going for it compared to the first volume but definitely enough to satisfy the fans.",
            "review_date": "2023-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I actually thought that Gunn would learn on the mistakes from the first one and not turn into Taika who ruined the second one with jokes for 11-year old kids, made by 11-year old kids. I cannot believe how fake the tomato ratings are...\nBest moments in all GOTG movies seem to be the classic rock ballads, which ironically, were not even originally made for the movie.",
            "review_date": "2023-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Movie is realy bad from about the first moment on. Do we have to make fun of everything these day? The Plot was irrelevant and it seemed as if a 14 yo had written the whole thing, the silly humor just adds to the impression.",
            "review_date": "2022-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Less well than the first movie, but the characters are always incredible! I recommend it if you want have fun",
            "review_date": "2022-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It had its moments, and as always the soundtrack is great.  The Marvel CGI spectacle is wearing thin though.",
            "review_date": "2022-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fir me this is the greatest marvel movie ever made everything about it so good the jokes are so good and well delivered. The villain is so much better tha in the first one. Pacing is good in the movie there is so much great charachter development in this movie that its outstanding\n\nThere has been only two movies that ive watched in my life that have made ma cry and this is one of them. While this movie is super funny and has a lot of great jokes it is really deep and emotional and the scene where yondu dies summarises the emotion this movie really had \n\nOverall amazing movie it finds that balance with emotion and drama which is really hard to come by. I cant wait to see what marvel has planned for vol 3 ecpeially eith the villain adam ;)",
            "review_date": "2022-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first guardians of the galaxy is a great movie and then James gunn took everything that worked with the first and improved upon everything. Even better soundtrack, even better job with the characters and even better everything. Ego is one of the best MCU-villains and one of the first good MCU villains. This is both a prefect sequel and an almost perfect movie.",
            "review_date": "2022-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this franchise.",
            "review_date": "2022-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny and creative, but a little too far fetched even for marvel. Still a good movie but not one of the best. ",
            "review_date": "2022-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic, loved CGI, music and story",
            "review_date": "2022-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Cinecomic, without a doubt",
            "review_date": "2022-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was just astonishing, I wish Marvel still made movies of this quality to date, this movie was just great overall.",
            "review_date": "2022-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is probably a very unpopular opinion but I somewhat like this more then the first movie. Don't get me wrong both are good but i've always preferred this one. I would say both guardian movies and infinty war and endgame have the funniest humor out of any the mcu movies. Not gonna lie I cried at the ending.",
            "review_date": "2022-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily one of my favorite MCU films and probably one of my favorite films full stop. With its wonderful characters, emotional and dramatic story, superb soundtrack, stellar visuals and brilliant comedy, this is one of James Gunn's best projects.",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sequel was like the first one, but just not as good.",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must see. A group of formidable and crazy characters of the Galaxy.",
            "review_date": "2022-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "James Gunn delivers again! A similar, rejuvenating ride as the first film except the plot is, once again, handled poorly. The way they portrayed Ego is a bit strange, nonetheless a solid film overall.",
            "review_date": "2022-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": " There’s plenty of heart and laughs. It’s not as good as the first film but is an entertaining good time nevertheless.",
            "review_date": "2022-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brutal!\nBoth GotG movies are BAD! \nChris Pratt and Dave Bautista are not good actors.",
            "review_date": "2022-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Anyone who has seen this will have loved it… it grabs the audience from its first moments… but there's definitely something missing. Maybe it's the enthusiasm of the first film. And maybe the suspense holds out too long in some places. But a great viewing nonetheless",
            "review_date": "2022-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "James Gunn did it again definitely not as good as the first movie but still really great with really funny humor and some pretty good visuals and somehow he made me care for Yondu so you know this is good\n8/10",
            "review_date": "2022-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Welcome to the frickin Guardians of the Galaxy...Only I didn't use frickin... \n\nThe opening actually has the best effects in the entire movie, it was exciting and funny at the same time, the way Groot was dancing around yet we go to see an epic fight, I think it was the best way to open a movie for a sequel.  \n\nYondu do you have any tape?\n\nThe lighting on the planet made it looked way too fantasy yet you can see so much details especially all the small particles floating around, but one thing is good about it, is that it fully embraces the comics, it's literally like taking pages from the comics and making it into real life. I couldn't stop laughing for when Groot had to get that prototype fin, and who's toe did he cut off? Didn't that person scream? Like what?\n\nGamora do you have any tape?\n\nThe ending was really great and a really big CGI fest, there was so much happening at once in the big battle, there was a big cinematic moment when they landed on the ground giving us the same group shot like the Avengers, When Peter learned to use his powers I didn't mind the comedy in the effects and sounds but that effect of when Ego was regenerating, it looked like they rushed with that effects, or maybe they didn't want to make it too real with all its organs.The ending was extremely climactic and it eneded on such a sad note with Yondu's funeral. It's funny how this movie is extremely bright and colourful and has so much comedy ended so sadly. \n\nDrax do you have any tape?\n\nThis movie is extremely bright and colourful, it has over the top effects, and it has alot of comes. The story is very different because even though Ego is affecting other planets, the main battle happened inside an uninhibited planet, and it's ending was very big. \nThe cinematography was absolutely amazing, and the score was really engaging especially the sound effects, but was it just me or the score wasn't that amazing for the final battle at the end and mostly relies on sound effects. \n\nDid you ask Nebula?",
            "review_date": "2022-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie really knows how to make you cry",
            "review_date": "2022-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great follow up to the first. Rip Yondu",
            "review_date": "2022-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fairly enjoyable sequel despite feeling like a filler film. This entry does little to flesh out the characters any more, but thankfully most of the jokes land in a way that only James Gunn can pull-off.",
            "review_date": "2022-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guradians of the Galaxy 2 is to Guardians of the galaxy 1 what Force Awakens is to a New Hope. Same old tricks but somehow worse.",
            "review_date": "2022-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another masterpiece by James Gunn? It's between yes and no. This movie mostly focusing on digging onto the main character which is not that bad to do. But the meaning of teamwork in this sequel is preserved in a good way.",
            "review_date": "2022-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians of the Galaxy Volume 2 is a bit more uneven than its predecessor with unpolished themes and a villain whose scheme and plot is way too crazy, this movie still has the wonderful characters and performances, tongue-in-cheek humor and powerful moments",
            "review_date": "2022-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"| Ratings Categories |\n{Characters (9/10) ; Cinematography (9.5/10) ; Plot (8.5/10) ; Acting (9/10) ; Pacing (7.5/10) = 87%}\"",
            "review_date": "2022-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's up there with one of the most forgettable MCU movies.",
            "review_date": "2022-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its not as good as the first one but its still a fun superhero movie with loveable characters",
            "review_date": "2022-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best of Movies/TV Series Collection",
            "review_date": "2022-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My pleasant surprise, from the Marvel movies! I didn't know the franchise and for me it's one of the best Marvel movies. Script very well done, story well developed, characters well built, touch of humor and drama at the right time, I can't wait for the third movie to come out.",
            "review_date": "2022-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Guardians of the Galaxy Vol. 2\" is a fun and entertaining follow-up to the first film, albeit one that falls short of the high bar set by its predecessor. The film boasts a stellar cast, with each member of the Guardians delivering strong performances that capture the charm and wit of their characters. The story is engaging and enjoyable, with plenty of laughs and heartwarming moments throughout. However, the film's descent into full-on wackiness by the end can feel a bit overwhelming and detract from the overall experience. While \"Guardians of the Galaxy Vol. 2\" may not quite reach the heights of the first film, it's still a solid entry in the Marvel Cinematic Universe that's well worth a watch for fans of the franchise.",
            "review_date": "2022-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed the opening sequence with Groot dancing to ELO ('Mr Blue Sky'). It's a good bit of visual CGI laden entertainment. I like that the characters are rather self deprecating and that it doesn't take itself too seriously (to an extent). The music featured is definitely one of the main plus points for me ('My Sweet Lord' being another featured song). Their pretty random tunes but there's something jolly and fun about hearing them during scenes of fast paced action type battles.\n\nI enjoyed this film and so yes, I'd recommend it.",
            "review_date": "2022-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For comic fans there's definitely a feeling of \"oh we're just doing Ego eh?\" when the plot reveals itself, but it's still a great movie and also proves what a crazy phenomenon Mary Poppins was. I wish they didn't just let Drax go buck wild with dialogue cuz it gets old after a while.",
            "review_date": "2022-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If sequels almost always get the tone wrong, I'm not new, especially when they come from a studio that loves to repeat formulas, making this movie a comedy in every way.",
            "review_date": "2022-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5 years ago- Back with more action,a strong soundtrack, and a darker sense of humor, the movie profits by having an engaging villain. Though, it doesn't take the time to properly flesh out it's new characters.",
            "review_date": "2022-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good sequel but missed the boat on creating moments like the first one had. Writing was not as good and the soundtrack was a step down.",
            "review_date": "2022-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The script had the emotional depth of a teaspoon. Plot line: every character has daddy issues and the emotional intelligence of a prepubescent teen.",
            "review_date": "2022-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a sequel to Gunn's previously success, Guardians of the Galaxy vol 2 deserves to be appreciated for good direction, very varied locations, colorful and bright photography, GCI as usual splendid ... and even the villain played by Kurt Russel is very done well. In general all the characters are well written and characterized, Yondu (Michael Rooken) in particular.",
            "review_date": "2022-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yoo another great appearance of the guardians of the galaxy but it can't beat the first movie because the main villain Ego was so evil he's the only reason to make quill's mother die",
            "review_date": "2022-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest 2.25 hours ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians Vol.2 was a very frustrating movie for me. The first movie was a Top 10 Marvel movie for me, but the sequel just didn't sit too well with me. The more I watch it, the worse it becomes. Yes, it's comedic, but on a story level, the whole celestial thing just didn't work. The final battle also contained too much CGI for me to handle. Although the movie has some great and emotional moments, placing this higher than some, it isn't a great movie. Yondu was a great spice of emotion though, I almost cried.\n\nGuardians of the Galaxy Vol.2 Rating: B-\nJames Gunn hit the mark with the movie, but the bullet didn't go all the way through.",
            "review_date": "2022-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first movie was better than I expected but this was boring and forgettable. It's not bad, it continues with the spirit of the first film, but the element of surprise is lost and it's more of the same.",
            "review_date": "2022-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Certainly a downgrade from it's predecessor. It shows that the magic of the first one could only be accomplished once, but this film still could of done better.",
            "review_date": "2022-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians 2 may be a little less mind-blowing than the first, but it holds its own with its mesmerizing visuals, classic humor, and surprising sad moments. The beloved superhero team finds its way in a universe that is quite unforgiving. It hits closer to home for a lot of people, which makes this a worthy sequel.",
            "review_date": "2022-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My rating for the film is a 8.3/10",
            "review_date": "2022-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A slight step down from the 1st movie but still really great!",
            "review_date": "2022-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While I was not much of a fan of the first Guardians film, the sequel is a new take on the same characters with a better story and concept. It not only fits the characters better, but it allows them to evolve and grow in situations they hadn't yet faced. The writing was also on point, with top tier comedy. Very enjoyable.",
            "review_date": "2022-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just a fun movie that exists to add to the guardians stories. Yondu is a fantastic character and Ego is a fun villain. The main actors perform very well too.",
            "review_date": "2022-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it! Was excited to see Kurt Russell in it! CP did not disappoint! Gotta say everyone delivered as always! Thank you!",
            "review_date": "2022-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not sure it was better than the first one but it was still good. Fun and good family story that led to some unexpected moments.",
            "review_date": "2022-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How I evaluate a movie...\nSimple questions I ask myself:  \n1) Would I pay to see the movie again? (Answer = Yes)\n\n2) Would I watch the movie again for free and I had nothing better to do? (Answer = Yes)\n\n3) Do I regret watching it?  (Answer = Nope)\n\n4) Do I feel the directors /writers either are worthless or had to actually work hard at screwing up a movie that otherwise would be hard to screw up? (Answer = No.  nicely done) \n\n5) Would I recommend others to go see it? (Answer = Yes)",
            "review_date": "2022-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first one but also not bad.",
            "review_date": "2022-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yeah, this is better than CATS.",
            "review_date": "2022-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians vol 2 has big ambitions, and it doesn't quite meet them in some regards. The humor, while still being quite good at times, feels dry at other times, and the movie stalls out during the second act, having no clear direction until the villain reveal. Chris Pratt delivers a good performance, but nothing incredible; the same things can be said for the rest of the cast. Michael Rooker's Yondu is a notable exception, doing a great job in this movie. The villain reveal is predictable, and the final fight, while emotional, feels very bland. The soundtrack is solid, but not as good as Guardians 1 (IMO). Guardians vol 2  is plenty fun at times, and a great exploration of Peter Quill's character, but it doesn't live up to the first GotG movie.",
            "review_date": "2022-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too much comedy for me, ruined every awesome scene with their need to be funny",
            "review_date": "2022-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's pretty solid, but I feel like it tries too hard to be funny.",
            "review_date": "2022-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great comedy and action but the antagonist was bad.",
            "review_date": "2022-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "GoTG Vol 2 was a splendid watch. A movie full of emotion, fun, banter that takes unexpected turns. The film reaches a new high for the guardians in terms of cast, and pushes the story even further than before. In this film you will see some really incredible backdrops and compositing done with outstanding visual effects.",
            "review_date": "2022-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians of the Galaxy vol.2 it's worse than the first. The second movie of the franchise deconstructs Drax character giving him a humorous tonem, and Rocket too giving him a serious tone. The movie has a lot of sexual joks and it bothers me a little bit. Let´s talk about the villain,he is very generic cause they introduce us a guy and suddenly he is Peter Quill´s father and suddenly again he is the bad guy. The plot of the movie just turn around Peter´s relation with he´s father. The end of the movie message is so beautiful but it could be better if they explore a little bit more the relation between Peter and Yondu",
            "review_date": "2022-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one was even better than the first, amazing",
            "review_date": "2022-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never laughed so much at a marvel movie such a wonderful addition to the MCU",
            "review_date": "2022-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As absurd as the first one. Just a bit to much going on.",
            "review_date": "2022-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film's humor is just as fresh and delightful as the first film, but the third act seemed tacked on and was rushed. Overall, this is a feel good movie that you can have a great time with. But, it's not as stable as the first outing of the Guardians of the Galaxy films.",
            "review_date": "2022-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Arguably the best movie of all time, Guardians of Galaxy Vol. 2 is an exciting, funny, action-packed, and all in all an enjoyable experience.",
            "review_date": "2022-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A strangely good movie that should have been a reset point for the MCU",
            "review_date": "2022-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An ok follow up to the first one however even the music was a downgrade alongside the slightly tired humour.  Still a worthy MCU movie.",
            "review_date": "2022-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun. Great music. Great visuals. We need MORE!",
            "review_date": "2022-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was just weird. Baby Groot was great, but that's about it.",
            "review_date": "2022-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie. It is so fun, and visually appealing throughout the entire film, and has some really good messages in it without shoving them down your throat. Overall probably one of my favorite movies in the MCU, and way better than the garbage that they are pumping out now.",
            "review_date": "2022-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes the movie can be goofy at points, especially in the Milano scene with rocket and Yondu. But the movie offers both emotional and story value, with its underlying message about the relationship between father and son. In both Star Lord and Ego and in Star Lord and Yondu. The line 'He was your father but i was always your daddy' from Yondu sounds comical but means so much for this movie. The action scenes were great but a bit of cringey writing ruins this movie from must but i see this as a much needed upgrade from the first instalment.",
            "review_date": "2022-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To be really honest, I like this even movie more than the first one. It has got lots of more humor, and the plot is way more interesting that it has me glued to the movie. Again, amazing characters and actors, they did a really good job producing this film. The ending even almost has me moved. Definitely would recommend this almost flawless sequel of a movie.",
            "review_date": "2022-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily the most over-hated MCU movie.",
            "review_date": "2022-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's so worthy to any comic fan. It's action packed, visually beautiful and so, so funny",
            "review_date": "2022-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the only Marvel Comics film that cries every time you watch it. The last moment of Bravery is really touching. Although this film is very old, it will be very exciting every time you see that clip. My wife really likes Bravery, and I hope the sequel can revive him.😭",
            "review_date": "2022-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seen this movie like 8 times now.. Definitely one of my favorites all time",
            "review_date": "2022-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A kitschy opening song other than that mr blue sky is my spirit animal",
            "review_date": "2022-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While this movie has great emotion, I find the villain distasteful and the main plotline to be messy. Still funny and charismatic, the Guardians sequel is to be labled: mid.",
            "review_date": "2022-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a good thor movie wtf",
            "review_date": "2022-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "James Gunn made reevaluate the point of my existence",
            "review_date": "2022-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Five years ago I didn't like a Marvel universe, but after I watched the guardians of galaxy, my opinion about this universe changed. I will tell about a second part of this movie. It'my favourite movie from Marvel universe. Second movie is telling us about Peter Quill and his company's adventures after events in the first part. This time Peter has accidently meeted his real father from other planet. After Ego(Peter's father)  has told to Peter about himself and about his plans, Peter with his friends have understood, that Ego is one of the most danderous of villains in the universe and his plans  can have terrible consequences for universe. The Guardians of galaxy vol.2 is very realistic Thanks to technologies, which Marvel studios used. Other stars, planets, aliens and starships is fancy and look as if they were real. Also the movie has a very good humor which can understand Both an adult and a child. Also in the cast there is of my favourite actors. It's Chris Pratt. I'm really enjoying his character. I really reccomend this movie for all Marvel fans.",
            "review_date": "2022-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It may not be the sleekest one but Guardians of the Galaxy Vol 2 doesn't fail to amaze audience with its funny moments and performance by Chris Pratt.",
            "review_date": "2022-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A step down from its already flawed predecessor. The reason behind the entire plot being Rocket stealing batteries (NOT A SPOILER IT HAPPENS STRAIGHT AWAY) is so hilariously dumb. The new characters are mostly annoying and the plot makes no sense. But, there's no denying that the relationship between Chris Pratt's Peter Quill and his fathers is heartwarming.",
            "review_date": "2022-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Ego reveal is the only thing saving this film from getting a 2.5 or 3-star rating. The humor in this film still does not work for me and a lot of it is cringy. There are also some slow parts. Yondu's sacrifice helps this film as well, but the Guardians movies are the run-of-the-mill cookie-cutter Marvel films. Nothing special, but not Awful. Can be entertaining, but is a razor's edge away from being Fine. \n\nRating - Good",
            "review_date": "2022-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Having really enjoyed the first 'Guardians of the Galaxy', which was not quite as good as the hype but still very good, expectations were high for the sequel while being a little worried as to whether it would be as good or disgrace the first.\n\nThe good news is that 'Guardians of the Galaxy Vol 2' does not disgrace the first 'Guardians of the Galaxy' and is actually just as good. Like as was said with 'Guardians of the Galaxy', is it as amazing as the IMDb rating (which is something that really shouldn't be taken to heart and is often blown out of proportion here on IMDb) and ecstatic reviews suggest? To me, not quite. Is 'Guardians of the Galaxy Vol 2' well made and entertaining? Absolutely.\n\nA couple of the gags fall a little flat and the film does drag in the middle act. That's pretty much it for the complaints however.\n\n'Guardians of the Galaxy Vol 2', reiterating what was said in my review for the first film due to having the same strengths, boasts spectacular special effects, gorgeously psychedelic colours, slick-yet-with-enough-visual-depth cinematography (nothing cartoonish or plastic here) and very colourful and atmospheric sets that more than effectively makes one think they are immersed in this galaxy. Costumes and make-up are also of very good quality. The soundtrack and score is rousing and touchingly nostalgic, really making the toes tap. The action is beautifully edited, choreographed with lots of entertainment value and thrills and is at best exhilarating, there's plenty of it without feeling too much.\n\nJames Gunn directs with style and a sure hand, always seeming as if he knew what tone he was going for and who he was aiming at. Both 'Guardians of the Galaxy' films are far and above anything else he's done and his best overall direction are in them as well. Personally really enjoyed the way that 'Guardians of the Galaxy Vol 2' was written too, most of the jokes are enormously entertaining and the film also has heart.\n\nThe story is mostly energetic and compelling, let down only by some of the middle act. At least however it doesn't have as many random misplaced moments and over sentimentality, even if it's not exactly original (not that that is a desperately bad thing).\n\nCharacters are on the most part incredibly colourful and engaging, with a great chemistry throughout. Peter is a likable lead character, but it's adorable and hilarious Baby Groot, scene-stealing Rocket and touchingly conflicted Yondu steal the show.\n\nOnce again, like in the first film, Chris Pratt is highly charismatic, Zoe Saldana is suitably fiery, Karen Gillan is imposingly formidable, Dave Bautista induces lots of laughs and charm while showing a very intensely played vengeful side and a surprisingly well-cast Vin Diesel does a great job as Baby Groot. Bradley Cooper stands out, being a sheer delight as Rocket. Kurt Russell is an enigmatic presence and Michael Rooker is quite touching as Yondu.\n\nIn conclusion, a lot of fun and very well made, every bit as good as the first, a few flat jokes and draggy middle aside. 8/10 Bethany Cox",
            "review_date": "2022-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great sequel. Not as good as the original though.",
            "review_date": "2022-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is probably the BEST sequel to a movie I have EVER seen. It has an incredible soundtrack, great heart, great acting, great humour and boy oh boy does this movie look visually amazing. The colours and landscapes are JAW-DROPPING. The cast is loveable and charming like always. There's not a single character I don't like. I'm conclusion, if you liked the first movie, you will DEFINITELY like this one.",
            "review_date": "2022-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "B+ ~ A pretty fun movie that does a fine job of carrying-over what was so great about the first installment. The consequences of the film aren't very felt since everything that happens doesn't really impact the broader MCU compared to other movies in the franchise. Still an enjoyable ride which has a couple endearing moments.",
            "review_date": "2022-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cinematography is better than the previous one but the character of ego is nerfed down",
            "review_date": "2022-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "James Gunn brings on the laughs and the tears in one spectacular, unforgettable film about family. One of the most magical movie experiences of my life.",
            "review_date": "2022-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "kurt russel in the MCU :0 ;)",
            "review_date": "2022-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great Marvel Film with another great soundtrack.",
            "review_date": "2022-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all-time favorite films, with no shortage of humor and great music. I am groot.",
            "review_date": "2022-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing, hope to see more of Mantis though",
            "review_date": "2022-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is very good",
            "review_date": "2022-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's as good as it's first movie. All-around great. ",
            "review_date": "2022-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first Guardians of the Galaxy movie. Still thought it was decent and had some funny moments. I didn't really like Ego.",
            "review_date": "2022-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favourite instalments in the MCU, wonderful!",
            "review_date": "2022-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While is not as great as the first one this sequel still delivers in the action, awesome soundtrack and amazing humor.",
            "review_date": "2022-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The opening scene with Groot dancing is a classic scene for the movie industry. As like the first movie: the music choices and humour were on point. In this movie  the character Yondu, played by Michael Rooker, deserves a special mention; because he was great. Again, awesome movie.",
            "review_date": "2022-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although the story is not as good as the original, Vol. 2's strong points rely within the humor, and the character writing is still on point for most of the film.",
            "review_date": "2022-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians of the Galaxy Vol. 2 leans into goofiness way more than the first movie did, which is not particularly a bad thing but I personally don't enjoy that much. The plot felt rushed by introding Peter's father too early and in a kind of unrealistic way, the writing was definitively one of the weakest points of this movie. The visuals were astonishing and Yondu and Rocket arc was great. Overall it was a good movie, but taking into account that the first one was remarkable, good isn't good enough.",
            "review_date": "2022-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is funny, it's action packed, & it's sad. It's perfect though. 5/5",
            "review_date": "2022-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film did what only a few movie before it did it, it expanded the universe of the franchise. 6/10",
            "review_date": "2022-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I recently rewatched this movie, and even knowing everything that was coming, it kept me in my seat, made me laugh, and was an excellent sequel to an already excellent movie.",
            "review_date": "2022-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Marvel truly succeeds best when it doesn't try to force a story, and instead lets its audience really feel invested in its character-driven drama, with some pleasant action scenes in between. Could have done with a little more tightening on the script, but even here you forget Chris Pratt is Chris Pratt for a moment.",
            "review_date": "2022-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A little bit better than the first, a fun, brave and what not movie which includes great characters",
            "review_date": "2021-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really good sequel with some amazing character development for characters that didn’t have the screen time they needed in the first film like Drax a new version of Grute adding layers to Nebula and introducing Mantis who has very good chemistry with Dave Bautista, only grip is the villain I always find myself rolling my eyes like tony stark when it comes to Kurt Russell’s character and ending, but theirs so much to love about the movie before it hits its 3rd act, fun time for the family",
            "review_date": "2021-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like it, it's one of the best MCU movies, because it's so much fun",
            "review_date": "2021-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not my favorite movie of the MCU. The movie was all over the place.",
            "review_date": "2021-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe my favourite emotional story in the MCU. \nThe character work for Rocket ​Racoon and Yondu is the closest the MCU has brought me to tears and some of the best emotional scenes in any comic book movie. Michael Rooker is captivating in this role and the scene where he sits with the knowledge that his crew is getting murdered with nothing he can do, is a highlight of the film.\nQuill remains charming as ever and has a pretty good arc of learning to abandon his toxic traits and entitlement to be a better leader for the team.\nThe scene with Drax and Mantis is visual storytelling done right and I wish we had more of this in this franchise.\nThis is the movie that got me actually care about Gamora and Nebula, still not a fan of Zoe Saldanas performance, but Karen Gillan is brilliant in this.\nBaby Groot is pretty cool too.",
            "review_date": "2021-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Masterpiece. James Gunn is the best.",
            "review_date": "2021-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians of the Galaxy Vol 2 follows up the story from the first film exactly how it is expected. The film has a better story and a better villain than the first, but character development ends up taking a step back. With the sudden flanderization of the team, the only character to really survive this sudden change is Yondu who gets a lot of good development as a result. The sudden change in Rocket can also be excused as he gets some development to explain it, but no one else really has an explanation to his or her drastically changed personalities in this film. This does not ruin the film, but it does leave a slight scar on it when watching it again, especially nearly back to back with the original. Like the first film I suggest watching this film again, but it doesn't have any real bearing on the Marvel Cinematic Universe as a whole so for those doing a necessities only marathon, this movie can be left alone.",
            "review_date": "2021-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "GOTG Vol 2 is hilarious and Baby Groot shines throughout the whole movie. Although Ego's character can seem like a big swing, the story ultimately works and all the Guardians get proper character development, especially Rocket Raccoon.",
            "review_date": "2021-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Star-lord and his crew of be misfits find themselves in trouble again after double crossing a high priestess, they crash land on a planet run by his long lost father played by Kurt Russell.  \nThe characters in the Guardians films are always likeable and quite hilarious with their banter. \nMarvel hit a home run with these films as they are arguably the most fun action adventure films in their canon.",
            "review_date": "2021-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a lot of people this film is great entertainment. The humor is duly good. But some of the plot points like the death of star lord's siblings and the villain's agenda to conquer the world just seem unfinished and are a big distraction towards the film.",
            "review_date": "2021-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The villain felt very lacking and the story felt a big unoriginal, however, the comedy is still there and the action is still done very well. The plot feels a bit convoluted, and the actual villain himself has very confusing motivations. The film was still enough to pass the time, however, and it was something that was humorous throughout. Overall, a fine movie, just not one of the best.",
            "review_date": "2021-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the characters, the humor, and the heart from the first Guardians of the Galaxy film are all back in full force, Vol. 2 is held back when it meanders around a bit too much.  The plot doesn't really kick in until the latter half, though it ends on a high note with a thrilling climax and an important message about \"family\" meaning more than just your blood (a topic hit upon even stronger in DC's own Shazam!).",
            "review_date": "2021-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the 1st but still an absolute must see!",
            "review_date": "2021-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What can I say about this film still amazing still one of my favourites and since I've got so many DVDs or Blu-ray is should I say it's definitely in my collection 10 out of 10",
            "review_date": "2021-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Arguably a weaker installment compared to its predecessor. Nonetheless, humor and heart are still present and make it a film worth watching.",
            "review_date": "2021-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoy this movie, but I don't want to give it 3.5 stars, but I also don't like it as much as the first one. So let's settle on a 7/10",
            "review_date": "2021-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Weaker than its predecessor, but it's still a standard Marvel fun fest. You'll be laughing your butt off while the team kicks butt and has the time of their life.",
            "review_date": "2021-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite Superhero movie, tbh. Lots of action, very, VERY good music choice, jokes that cracked me up - it all adds up to me liking this movie.",
            "review_date": "2021-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "James Gunn does it again, and transports us back to a world where you're guaranteed to laugh",
            "review_date": "2021-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first one. but just a great follow on. enjoy the film as much as the first. apart from the ending was not as good.",
            "review_date": "2021-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians 2 is a strong follow up to the original film, somehow creating more depth and humour with each character.  The only weakness lies in an over-saturation of what made the first film so special, which was the subtle humour mixed with classic music. These wonderful elements now are more blatant and over the top.\n\nSaying this though, this is the Marvel sequel we were all waiting for, incorporating unknown characters without brow-beating us about upcoming films in the MCU, potential spin-offs and sequels and just creating more depth in the Guardians universe. I am looking forward to Adam Warlock being featured in the sequel.",
            "review_date": "2021-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great movie. so much fun till the end",
            "review_date": "2021-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed the movie, but the protagonist was just not convincing. 8/10",
            "review_date": "2021-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Characters feel more relatable now and the music is even better if that is possible. Making Yondu's death the most impactful in the entire MCU is saying something.",
            "review_date": "2021-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my opinion, this movie is better than the first in a lot of ways. Everything from continuing to build upon the character to exciting action, this movie is a fun time from beginning to end.",
            "review_date": "2021-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A worthy sequel to one of the best stories in the Marvel Cinematic Multiverse.",
            "review_date": "2021-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Meh, this was bad for a Sequel to Guardians of the Universe the father was really a bad guy and it did not hold water.  Sorry but the sequel was just mundane.",
            "review_date": "2021-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If there is one story that fascinates me it is that of the guardians of the galaxy. I love all the characters, they are so unique, multifaceted and interesting that you can only get attached to them.\n\nThe story is absurd, a person who is used to watching highbrow and boring movies certainly won't appreciate it.\n\nInstead, those like me who are used to accepting absurd and innovative plots will love him madly. You can't help but get attached to all the characters because none of them are special, but all together they are formidable.",
            "review_date": "2021-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is definitely a step-up from the first installment as the story is just so much better. James Gunn really poured a lot into this movie which led to such an amazing film. The overall message of the movie is so beautiful and offers so many iconic moments. The film always has something going on and a lot of the story details never get lost in other plots. Some aspects of the film are a tiny bit complicated, but it doesn't hurt the movie all that much. A large reason why this movie feels a lot more whole is that the characters are way better developed here. Peter's story excels greatly into something really beautiful. I would even say the same about Yondu as in the first film, Yondu didn't feel all that important. This film, however, made me greatly appreciate Yondu and his actions in the first film. Rocket, Gamora, and Nebula also get some more character development that I think benefited them greatly. Even new characters like Ego and Mantis were very easy to attach some type of connection to as they are both very well developed. The only character I would say is poorly written is Drax, which sucks because I really liked Drax in the first film. Drax came off as rude and annoying for a large part of the film and his jokes weren't all that funny this time around. As much as I loved the characters in this film from a story standpoint, the actors weren't all that great. Both Chris Pratt and Zoe Saldana do a poor job in their roles. Their line delivery is off some of the time and I never felt the energy their performances had in the first film. Plus, both actors never convinced me that they had a love connection forming. Another actor that struggled was Dave Bautista. He was sometimes trying too hard to sell his joke or line that it came off in a cringeworthy way. However, the rest of the cast was pretty solid. Bradley Cooper did a fantastic job just like in the first film and new additions to the franchise Kurt Rusell and Pom Klementieff do an awesome job with both really nailing down the personalities of their characters. Michael Rooker is the stand-out to me in this film. Rooker had some great line delivery and really made the message of the film feel powerful and impactful. The production design of this film was flawless. Everything looked so stunning and the design of Ego's planet was just so well done. The color choices were great and how the technology on the planet moved was just so cool to watch. However, the cinematography felt a little weaker in this film. It was still very good, but I don't think cinematographer Henry Braham really made any shots look visually breathtaking like Ben Davis did in the first film.  Something that did improve was the score. It was better than in the first one with Tyler Bates creating some memorable tracks and more of a balance between songs and the score. Overall, Guardians of the Galaxy Vol. 2 was definitely a step-up storywise, but somewhat of a step-down when looking at some of the cast. Even though I do like this film better than the first one, I do think the cast was a lot better in the first installment rather than the second. However, the strong, heartfelt story really hides all the casts' flaws and really sets this film over the top. Read more reviews like this at postcreditreviews.com",
            "review_date": "2021-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great movie, but not the best",
            "review_date": "2021-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first Guardians of the Galaxy was a lot of insanity and a fair amount of heart -- this Sequel has a fair amount of insanity and a lot of heart.  And I really mean it - much of the movie does ask that you feel \"this is funny\" or \"this is cool\", but there are numerous parts where the movie make you feel Mortified, Triumphant or even legitimately Sad.  The final few minutes of the movie before the credits roll are absolutely spellbinding, and I literally tear-up every time I watch the final act of this movie.  The final act is both Inspiring and then Heartbreaking shortly afterwards, and the fact that a Marvel movie has, upon multiple viewings, brought me to tears really shows how outstanding this film is.  Like many, I would've liked a bit more insanity, but this is EASILY the Second Most Insane movie of the MCU (part 1 being the #1 spot), and since the trade-off was genuine emotional impact, I am more than happy with the exchange we got.  If you love movies that cover a wide spectrum of emotions and does so effectively, then Guardians of the Galaxy 2 might be the best movie to do so in a very long time.  You will laugh, you will cheer, your heartrate will occasionally rise and you will end it having had your soul crushed.  In terms of pure entertainment and emotional impact and satisfaction, I'd argue this might be the best Space Opera since The Empire Strikes Back - yes, I really mean that.",
            "review_date": "2021-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as its predecessor, but it does what a sequel should do well, bigger and bolder stakes with a compelling story to push over the character ark with surprising and unique sequences. This film has enough concepts to evoke thrill in the audience along with great humour to make you laugh with a great cast and basic storyline that does well to engage and hook you into the film.",
            "review_date": "2021-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great sequel to an awesome original",
            "review_date": "2021-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "GotG Vol. 2 isn't quite as good as its predecessor, but even though it does fall into the \"sequel is worse\" category, it still remains a solid and entertaining MCU blockbuster and comes close enough to the original to be enjoyable. The script doesn't have the finesse of the first movie causing the humor to drag and be a little over the top at points, but the actors do a fine job of getting around this causing a few of these moments to be genuinely funny. It's nice that this movie takes us deeper into the character of Peter Quill by exploring his family, a route that was set up well at the end of Guardians 1. What's even better about this is watching how Peter learning about and discovering his true family impacts his relationship with his \"new\" family: his fellow Guardians. This impact adds some emotional depth to the film, and makes Peter Quill a surprisingly complex character and takes him through a really nice arc that forces him to truly consider his relationships with those he cares about the most. Pratt supplements this with another great performance as the character, and his fellow Guardians castmates hit the spot as well. The movie makes sure to make good use of Kurt Russell as Ego by giving him plenty of screen time, a backstory, and a few emotional moments of his own. It also kicked ass to see the true power and capabilities of Yondu's flying arrow, something we got a taste of in the first movie but was amplified substantially in this movie. It's also still a relief and breath of fresh air that this film has no connection to the Avengers and the rest of the cinematic universe other than us knowing that it's a part of it. As mentioned before, what really prevents this movie from reaching the heights of GotG 1 for me is the humor, since even with the acting the script hampers this movie's ability to be as funny as GotG 1. GotG 2 is nonetheless still a fun and entertaining movie and is sure to leave viewers satisfied as the credits roll.",
            "review_date": "2021-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very underrated film, one of the top Marvel movies. Great plot, great action, and very funny on top of all that.",
            "review_date": "2021-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite MCU group, but a meh film, entertaining, but likely because you could take the team and put them in any film and it would be a good film.",
            "review_date": "2021-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a big step down in quality from the first film but the characters keep it from being a total loss",
            "review_date": "2021-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Volume 2 has everything the first film had; memorable characters, funny dialogue, and exciting action. But just not as good as the first.",
            "review_date": "2021-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm your Daddy!! I cried!! Movie that gives me action, makes me laugh and cry!!! Worth the watch.",
            "review_date": "2021-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good not great. This was a funny movie but the plot lacked at times.",
            "review_date": "2021-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good, but doesn't capture the same magic the first one did.",
            "review_date": "2021-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this is better than the original but hope for the sequel to turn the humor down a bit and take drax a little more seriously.",
            "review_date": "2021-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very entertaining film...visually good and humorous too...well worth a watch",
            "review_date": "2021-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I personally like this one more than the first,which is saying a lot!It's Funny,action-packed,and enjoyable.Would definitely watch again",
            "review_date": "2021-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An incredibly funny and action packed film.",
            "review_date": "2021-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A hilarious movie that was fun all the way through and should definitely be on your bucket list. Not by any means a masterpiece, but still a pretty good film",
            "review_date": "2021-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This constitution was a very good advance for this film, a very good plot, with actors who break it, this franchise continued to steal my heart.",
            "review_date": "2021-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I may not be your father but I am your daddy, made me cry at the end.",
            "review_date": "2021-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is (to me) the absolute best of the MCU. A gorgeous movie, with a lot of heart and loveable characters served by wonderfully told story. It doesn't get much better than this.",
            "review_date": "2021-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the last movie but the villain was pretty great",
            "review_date": "2021-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is basically looney tunes at this point, very cartoony and excessive use of CgI which is common in a marvel movie but this is just crossing the line. The villain was pretty weak and very predictable in this film. Still fun to watch but not really a movie.",
            "review_date": "2021-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians of the Galaxy Vol 2 is an excellent movie. The plot is interesting. The acting is on point. The humor in this movie is perfect. This movie also delivers very beautiful scenes. All in all I give this movie 4,5/5 stars.",
            "review_date": "2021-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This really is one of my least favourite marvel movies. I think Ego is a boring antagonist and the movie really doesn't live up to the first one.",
            "review_date": "2021-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After the release of Infinity War, I had been bingewatching all the MCU movies to catch up with everyone before Endgame comes. And of course I was watching them all very hurriedly. The memorable movies were the ones that I still remember very clearly to date (it's been nearly 3 years), while the ones that were terrible and a drag to watch, I forgot them instantly. I'd say this movie comes between the two categories, and as far as I can think right now, it's the only one to be in this exceptional category.\n\nNo matter what everyone says, I absolutely hate baby Groot. Cuteness only suits on creatures we are used to perceiving as cute. And thus Groot, a tree, looks very, very awkward with those chubby cheeks. It seems as though that face wasn't meant to be on that body. Also the entire point of his innocence is very irritating, especially the part where he wanted to use Rocket's buttons in spite of him repeatedly telling him not to do it. That scene does not even make any sense, since other than that part Rocket and Groot seem to understand each other literally all the time. Groot becomes stupid or intelligent, strong or weak as the story demands it, which is why I absolutely hate him.\n\nThe visuals are absolutely gorgeous. Though it feels as though there is too much yellow in the colour palette and the overall tone is more inclined towards the warm shades, the CGI world is marvelous to look at. Ego is a great planet to look at. I have seen Ego in the comics now so I can't believe they were actually able to translate him so well on the screen. Seeing the spaceship battles always kept me on the edge of my seat. It's just like how I was expecting the movie to become better as time progresses.\n\nBut the way the conflict between Peter and Ego came was very bad. First of all, the way they bonded was wrong by their characteristics. Peter is a gullible guy who always thinks by his emotions while Gamora is the sensible one. Yet here Peter was the one suspecting Ego while Gamora wanted him to trust Ego. And then the way Ego revealed his mother's death, ugh! Why did he even need to say that! Firstly no matter how much you are in a flow, you'd never say something like that. And secondly if he knows so much about Peter, how did he not know saying that would make him angry?\n\nI really liked Mantis. I never understood why her character arc was about her being ugly. She looked way better than Nebula or Drax. She was kinda cute though. I couldn't hear any of Drax's jokes so I won't be talking about him. Yondu was also a very nice character. As much as I rolled my eyes seeing him in the movie, I really enjoyed seeing what he had become. His character development is fantastic, because of the redeemed person that he is. His whistling and shooting arrows was very much fun to watch.\n\nOverall this movie is a very mixed bag of opinions for me. I think it's really bad compared to the first movie, but at the same time really entertaining compared to most MCU movies. There is so much CGI, so much world building in GotG that I can't possibly hate it. I'm just gonna try to remember this one. I had forgotten everything about it except the good scenes, so I had to watch the Cinemasins video to remember it. I hope Volume 3 surpasses my expectations.",
            "review_date": "2021-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "awesome entertainer. watched it like gazillion times..",
            "review_date": "2021-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians Of The Galaxy Vol. 2 does what most sequels do, except opposite (in a good way). In this sequel, it focuses more about the characters we follow throughout. It goes deep inside who these characters truly are on the inside.",
            "review_date": "2021-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just couldn't get into to it. Never finished it and i tried several times",
            "review_date": "2021-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everyone Always say it's either Guardians of the Galaxy, or Guardians of the Galaxy Vol. 2. For me, I really do like both of them. They are both good in a lot of ways and they both have a lot of flaws in a lot of ways. So let's get the flaws out of the way. For me the problem with this movie is how they handle Drax. For me I feel like they could've developed Drax a tad bit better. He has some really good moments with Mantis, and he can be pretty funny through most of it, but honestly sometimes he can get kinda annoying with his laugh but sometimes the laugh works. Another problem that I have with this movie is that some of it could be cut down just a little bit, and there are a few scenes that kinda feel like they don't have to be there. But otherwise. This movie rocks. I really like the history between Quill and his father. The relationship between Gamora and Nebula was really interesting, and as I said earlier some of the scenes between Drax and Mantis were really good. But by far my favorites scenes to watch are between Rocket and Yandu. These characters were so engaging. Just their history just really interest me and somewhat moved me. They were hands down my favorite parts of watching the film. I also thought Ego was much more of an interesting villain than Ronan. All in all Guardians of the Galaxy Vol. 2 is not perfect but still a really good movie. I don't think that I'll ever have a favorite between these but for me I'm kinda leading towards Guardians of the Galaxy but at the end there are stuff that I really like in Guardians of the Galaxy Vol. 2 but I guess I'll never know which movie that I prefer. 8.5/10",
            "review_date": "2021-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They dialed up the references, and the jokes, but forgit actual humor. Every character was made infinitely more stupid, for the sake of laughs, none of which I could actually give it.",
            "review_date": "2021-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The nearly perfect sequel. ",
            "review_date": "2021-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable but not as much so as the first \nMantis and Drax had some funny scenes",
            "review_date": "2021-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians of the Galaxy Vol 2. Takes place a Few months later after the first one. Besides the movie’s release dates. The Story in this film is.. to be honest, a boring one. I did not enjoy the story of this film. The only thing I did like was the characters. That is it. Did not enjoy this film. I am going to give Guardians of the Galaxy Vol 2.: a C-",
            "review_date": "2021-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I got to say this I found this one better. I enjoyed the humor a bit more, it's not as sad like the first and this one has bigger plot twists and the characters I found a bit funnier and the action was sweet like the first one.",
            "review_date": "2021-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "genuinely so boring, i don't know how people can watch this and feel anything",
            "review_date": "2021-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent story but not as special as its predecessor. It is one of the funniest MCU films though.",
            "review_date": "2021-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was boring. First half did build up something only to destroy it in the second. I wouldn't watch it again.",
            "review_date": "2021-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think the first movie is superior in every way. The plot for this movie is ridiculous that I think it was developed by a kid. Good visuals and action scenes but, this movie could've been much shorter if some of the lame comic moments were deleted.",
            "review_date": "2021-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A disappointing MCU film. The humor is drastically worse than the first, it makes the characters dumb and this movie is nothing but a snooze fest. It has a great soundtrack but I'd rather just rewatch the first one. It's not terrible but not the best, it's still something I'd recommend.",
            "review_date": "2021-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like Guardians of The Galaxy Vol. 2, but like Age of Ultron it's a big step down from it's predecessor. Guardians 2 has some good jokes and great emotional moments, but some characters were done dirty here and not every joke landed.",
            "review_date": "2021-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as amazing as the first movie, but adorable Baby Groot carried this movie!",
            "review_date": "2021-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first one but still a great movie nonetheless",
            "review_date": "2021-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians 2 just like its original is a great movie for anyone to enjoy, full of Comedy, action, emotion, entertainment and with more development and story then any other Mcu movies even attempts!",
            "review_date": "2021-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as great as the first Guardians movie.\n\nBaby Groot and some great visuals make it worth seeing though.",
            "review_date": "2021-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A step back from the first film. The jokes don't work, the villain is horrible, and it's just another set up movie like all the rest.",
            "review_date": "2021-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "James Gunn was gone I could tel by the music and that was before I learned he was fired. Didn't  have his energy but everything was there.",
            "review_date": "2021-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Baby Groot! He's my absolute favorite! I think this movie overdid it with the comedy but I still love re-watching it!",
            "review_date": "2021-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To me this is basically the New Star Wars. Characters that are actually likeable and excellent actors. I hate to bring politics into a movie review but the cast all had James Gunns back when he was \"cancelled\" and you can tell. these people have a genuine bond when they act on screen together and it is an absolute joy to watch.",
            "review_date": "2021-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh man. This was just as good as the OG. SUPER funny and it is just a really good movie.",
            "review_date": "2021-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest PG-13 sequel ever developed!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2021-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No where near as good as the first film. I like the serious moments better in this film than I like the comedy.",
            "review_date": "2021-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although it is saved by some fantastic visuals, \"Guardians of the Galaxy, Vol. 2\" suffers from its mediocre comedy and somewhat boring story.",
            "review_date": "2021-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "although it is weaker than its predecessor, due to several factors, the photograph here is very beautiful, the script although at the beginning it seems aimless, it manages to involve you and of course, this film keeps the pattern with a track Incredible sound and exciting scenes.",
            "review_date": "2021-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a blazing film really ossum I love it it is like guardians of the galaxy 1. It is a must watch film like guardians of the galaxy 1",
            "review_date": "2021-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first GOTG movie was very, very good. GOTG 2 is a worthy sequel. It's not as good, but it's still good. And just like the first movie, GOTG 2 is light-hearted, full of jokes and quips, it has great CGI and great action scenes. It even gets emotional at times. We also get some character development for the main characters. It's a solid movie.",
            "review_date": "2021-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps not QUITE as good as the original with a weaker soundtrack, GG2 is still a non-stop CGI spectacular, leavened with comedy.  There are some flaws like any blockbuster, but a fun ride overall, and the original characters are still fun to watch develop.",
            "review_date": "2021-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another enjoyable entry, 'Guardians of the Galaxy Vol. 2' is very good fun.\n\nI actually didn't find the story in this as interesting as in the first film, but the humour - which is still up to the mark in 'Guardians of the Galaxy' - is much greater here; it got more laughs from me, that's for sure. The ending to this is also entertaining.\n\nChris Pratt and Co. are just as enjoyable as before, with Dave Bautista particularly standing out to me here; if only due to his amusing moments. I like the addition of Pom Klementieff, I can see a spot for her in the crew. Kurt Russell and Elizabeth Debicki make for contrasting newcomers, Russell is just about good but I felt Debicki and her lot were underused/unintriguing.\n\nNot the most compelling plot, which I found more predictable than what the MCU usually produces, but the strong action end and noteworthy humour elevates it to become a pleasant film to watch; if a drop from the original.",
            "review_date": "2021-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great sequel! This movie had a lot to live up to, and James Gunn and everyone at marvel done a great job. I loved this movie. It gave more characters chances to shine, especially Yondu. The soundtrack is amazing once again. They used the song \"The Chain\" by Fleetwood Mac to great use. The cast is great once again. Baby Groot is adorable and perfect. Great ending. The colours in this movie are breathtaking. It's a very pretty movie to look at. Great summer popcorn blockbuster.",
            "review_date": "2021-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "GUARDIANS OF THE GALAXY VOL. 2 is a fun installment in the MCU that helps to set up INFINITY WAR!",
            "review_date": "2021-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Chris Pratt is annoying. His face, his voice, his personality is aggravating and annoying. I hate his character and everything about him. Other than that, every OTHER character and everything about them and this story is straight up awesome. Anything to do with Chris Pratt though is ridiculous. His characters demi god storyline with Kurt Russel is cringe to watch acted out. Every supporting cast actor brought more fun to the show than the main character so its worth a watch.",
            "review_date": "2021-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A rare gem of a movie indeed, as the action was intense, the humour left me in stitches, and the character interaction and growth were done perfectly. Russell and Stallone were great as usual but it was Rooker that easily stole the thunder from the respective actors.",
            "review_date": "2021-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is just an awful movie",
            "review_date": "2020-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In an adventure that involves the public with action and comedy, Guardians of The Galaxy vol. 2 ends up becoming better than the first because of one reason: the great development of his characters. Peter Quill's achievement in getting the father he always wanted and then discovering that he killed his mother. The delving into the delicately exciting story of Gamora and Nebula. The friendship and identification between Rocky and Yondu. Drax's evolution, both in losing his loved ones and opening his heart to Mantis. And Groot's new face. James Gunn manages to particularly enjoy and develop each of his characters and bring them together as a family.",
            "review_date": "2020-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While adding more interesting characters, a lot more heart and twist help create a great story that continues what we loved about the first film. But loses it touch in some places and diverts in ways which help grow the banta from characters, but also losses sight of what make the first original.",
            "review_date": "2020-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians 2 brings a breath of fresh air from the vast MCU. It brings a new comedic and family dynamic to the franchise that hasn't been seen ever. James Gunn's new movie provides lots of fun, action, and drama as the story progresses. It also ties up a lot of loose ends from the first movie. Overall, it is a good movie to watch for hard MCU fans and an overall good movie for the casual movie watcher.",
            "review_date": "2020-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gimme a break. Is this even for adults?",
            "review_date": "2020-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the minority opinion, but Volume 2 is a better movie than the first. It's close, though and the movies are much closer to each other than they are to other four-star movies.",
            "review_date": "2020-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In contrast to the first, GUARDIANS VOL. 2 is one of the MCU's worst installments.",
            "review_date": "2020-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So I don't hate Vol. 2 of Guardians Of The Galaxy, but a while ago I began to consider this sequel  to be a bit uneven. I used to really like Vol. 2, but now i just find it just okay. Like i said, a bit uneven, but not the worst in my opinion. I would consider watching it every once in a while.",
            "review_date": "2020-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Story line was weaker than the first however this cannot be said about the comedic dialog between the cast. Drax, Dave Bautista, is my favourite throughout providing loads of dry comedy.",
            "review_date": "2020-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the funniest movie in the MCU. very entertaining, filled with action, great group dynamics and quite an upsetting death at the end. the music is also excellently well picked.",
            "review_date": "2020-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not quite as great as the first, but certainly a good sequel with many cameos. This movie does not take itself too seriously.",
            "review_date": "2020-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians Of The Galaxy Vol. 2 is bringing back our favorite misfits in a bigger, funnier and more emotional way. Marvel knows exactly the hit they had on their hands and needed to keep that momentum going without sacrificing what made the first film so unique. In the end, it isn't about whether it's a better movie than the first installment; like most of the characters within, it's more mature and substantial and doesn't rely on past accomplishments to make it great.",
            "review_date": "2020-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians of the Galaxy Vol. 2 surprised me. I already have seen it twice in 3D (I would recommend the 3D) and it got better the second time. This one is more funny and a little less child appropriate. It's not as great as the first one, but it was very good. You should definitely see it!",
            "review_date": "2020-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is good, it's main draw is the fact that the character work was really good, but aside from that, not much that stands out from the rest of the MCU",
            "review_date": "2020-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than first. Chris really caries this movies. I don't get the hype it's dumb comedy's with typical plot.",
            "review_date": "2020-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This 2nd entry was ok. The Sovereign plot was a complete waste while the plot about Peter's parentage was pretty good.",
            "review_date": "2020-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This secuel counts once again with an awesome cast and explains a little bit more backstory about each character. For me, this movie was great, also showcasing how our main character, Peter Quill, has to decide between his friends or his own family. Actually, everybody has to take decisions here. A great movie.",
            "review_date": "2020-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians vol 2 continues to prove that they are fun and exciting and are needed in the mcu",
            "review_date": "2020-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent! Love this series, the storyline is good, and the acting and CGI is great. One of the top two Marvel franchises next to the Avengers.",
            "review_date": "2020-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians of the Galaxy Vol. 2 is funny, dramatic, and very imaginative, making for a larger than life sequel to an already impressive movie. I can't think of anything in this film that I absolutely hated, which is quite an accomplishment compared to many Marvel sequels that came before (Avengers: Age of Ultron, Thor: The Dark World, etc).",
            "review_date": "2020-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wanted to like it but it was a slow moving yell fest where anyone with a life didn't care who was dead at the end. I feel the need to apologize to hallmark for calling their movies lame and predictable after watching this snooze fest.",
            "review_date": "2020-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So when I first watched this movie I loved it but pretty much from the second viewing onwards I've thought it was just fine. Music's still good if you liked that from the first movie and the villain's pretty good as well. I'm not a massive fan of the first movie and I do see this film as an improvement none the less, it's just a film I've never been excited to watch again nor have strong feelings for or against so it gets the middle rating of being \"Okay\".",
            "review_date": "2020-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually compelling movie with an interesting cast, but utterly predictable from the overall plot to the smallest line of dialogue.",
            "review_date": "2020-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An enjoyable sequel, though it doesn't reach the heights of its predecessor",
            "review_date": "2020-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Favorite MCU movie of mine.",
            "review_date": "2020-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this film much more than the first, and that rarely happens, I thought the characters were interesting and funny and had much better interactions than the first film. From comedy to heartfelt drama this film does a good job at balancing and keeping the viewer entertained and engaged. Rocket's character was expanded on in a much better way, helping you understand why he is such an asshole and what his outlook on life is, Drax has much better comedic scenes in this film compared to the first and we explore Starlord's backstory in a way that is entertaining but also informative.",
            "review_date": "2020-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite a step down from its predecessor, vol. 2 still delivers a story that is easy to have fun with.",
            "review_date": "2020-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit downfall from Part 1 but the characters were done better. The feeling and emotion that I've got from it was gorgeous. Miss Yondu.",
            "review_date": "2020-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "as a marvel fan, so underwhelming. some recurring jokes felt  extremely forced and overdone, the plot lulled, there were certain scenes that simply didn't make sense. it was charming and i loved the soundtrack but compared to the first it was a real shame.",
            "review_date": "2020-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "James Gunn follows up with this sequel and set up the future of the GOTG nicely for a part 3. Lots of laughs, action, and a lot of Baby Groot!",
            "review_date": "2020-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What did I think of Guardians of the Galaxy: Vol 2? Check out my full review below:\nhttps://open.spotify.com/episode/75XQ2HV5IQ2I2v65fH01iU?si=T_ZbXsMARoez7_rXEQySsw",
            "review_date": "2020-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as awesome as the 1st \"Guardians of the Galaxy\" film, but I still think this is a really good sequel. I felt like this film had a better soundtrack then the 1st one. I really hope they make a 3rd one in the \"Guardians of the Galaxy\" series.",
            "review_date": "2020-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gone are the charm and comedy of the first film but the ending will stick with you for a long time.",
            "review_date": "2020-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome action and very funny and very interesting",
            "review_date": "2020-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the most underrated in the MCU lineup. 9.5/10",
            "review_date": "2020-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "85% \"\"Guardians of the Galaxy Vol. 2\" is more livlier and more irreverent than its predecessor, but also improves the further CG props and a strong message of family with with rad visuals\".",
            "review_date": "2020-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first film, but an enjoyable sequel at least.",
            "review_date": "2020-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Relied too much on baby groot and forced humor. Lacked the heart of the original",
            "review_date": "2020-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked this even better than the first one.\n\nThis is a widely creative story. Like the its predecessor, this is both funny and surprisingly heartfelt, considering the chaotic world of the Guardians. There is some wonderful character work in this. (The cast is great across the board.) I appreciate how much this feels like a natural extension of the first. So rarely do films and their character arcs have such clear progression.\n\nThere are a couple issues I had. It felt like Drax (Dave Bautista) was dumbed down. Also, I like new character Mantis (Pom Klementieff), but there is the issue of the changes to her character in comparison to the original comics. Writer and director James Gunn has a fondness for making big changes to comic characters. Usually that works. Here, however, here we have a martial artist female hero transformed into a meeker, more reactive-than-proactive character; problematic.\n\nThe whole thing looks great. The first film was distinctive, but this one raises the bar. The sci-fi designs are colorful and creative. The CGI in this is amazing. Really, I think this one of the greatest visual attempts in film. James Gunn's direction and incorporation of classic songs works so well.\n\nOverall, I can't stress how good this is. I highly recommend.",
            "review_date": "2020-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie doesn't have all of the fun the first Guardians of the Galaxy movie does, but it is still worth seeing.",
            "review_date": "2020-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun. A lot of action. Funny. Especially the use of music over fight scenes. And finishes with a hell of a heart. One of the best of the MCU.",
            "review_date": "2020-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "GOTG 2 reuses many of the elements that made the first film work so well to great effect - AWESOME music, great comedic chemistry between the cast, and visually exciting action set pieces. What really caught me off guard was how emotionally involving the final 30 minutes is. For a lighthearted comedy/action/adventure, this movie actually has a lot of heart.",
            "review_date": "2020-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed the first guardians of the galaxy and the sequel is just as good. Special effects are astonishing, the movie is full of action, humor and some clever jokes. There are some jokes though that don’t really land and come off a bit awkward. But it’s a great addition to the Marvel universe. Action packed some good cameos, everything you would expect. A great film. ",
            "review_date": "2020-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Drax is one of the funniest characters I've ever witnessed",
            "review_date": "2020-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This has to be my most underrated MCU film, people rate it much low but for me it cracks top tier.\n\nYes it drags but I love those portions as it settles the characters much more, much more dialogues and character moments. It also doesn't throw the villain at your face but builds relationships.\n\nBaby Groot is cute, Rocket does everything we loved about that character from first one. Rocket-Groot bomb sequence is one of my favourite sequence this movie is filled with many other comedy gold.\n\nDrax comedy is still my favourite, Peter having sexual emotion for Gamora and Drax screaming top of his lungs cracked me the most. Drax and Mentis just starting their weird relation.\n\nGamora & Nebula's bonding thickens with fantastic toxic sister-sister relationships were explored. Peters relationship with his Father, being set up as a alien in first movie got good continuity and explains a lot more about Peter getting kidnapped by Ravengers. Peter at last playing ball with his father. Peter taking quick reaction of shooting his father just as he hear about tumor, Peter can't control his emotion.\n\nYondu is the best daddy, his arc and redemption felt so emotional with original Ravengers returning to celebrate that beautiful funeral, heads off to the CGI department. The whistle sequence was such so great.\n\nTonne of great laughs with sublet themes of family and relationships.",
            "review_date": "2020-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as awesome as the 1st one but I still think this is a great sequel. I felt like this film had a better soundtrack then the 1st one. I really hope they make a 3rd one in the \"Guardians of the Galaxy\" series.",
            "review_date": "2020-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the 1st one.  But not far off.  Visual masterpiece.",
            "review_date": "2020-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I understand the 2nd film's problems but Yondu's death and farewell was a phenomenal part in this film. I think the villains could be better but still great film. I still love how they evolved Peter's and Gamora's relationship and Baby Groot is so cute.",
            "review_date": "2020-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians of the Galaxy: Volume 2, directed, once again, by James Gunn, wasn't quite the breath of fresh air the first installment was, but it still packed a nice punch! James Gunn brings back his unorthodox style to this film, not paying off as well as the first, but still stands out as one of the better films of the MCU. I enjoyed Gunn's approach, by making this a grounded, character driven sequel, while also keeping the first addition in continuity, but by doing that, he created one too many subplots, leaving some things a little underdeveloped and choppy. Gunn utilized the same tones as the first film, while also recharging that emotional tone, but he seemed to try to throw in an extra dose of humor, and it threw the tones off in most occasions. One issue this film had that the first film didn't, was it's pace. For almost the entire first act, it was tough to see where things were going; it just felt like another Guardians film. When the second act hits, that's when it slows down, but we get great layers to all of our main characters. When the final act hits, that's where it starts to feel like a Marvel film, having big action sequences, and great chemistry between the characters.\n\nOne of the best things that James Gunn did for this film, was not only flesh out all of the characters, but give them such a grounded tone, being able to mesh with the other Avengers seamlessly. With this film being centered around Chris Pratt as Peter Quill, again, we were able to dig deeper into his back story, and discover a lot of great layers to his character. He had so much to do, carrying the load on his shoulders, leaving him with the best character arch of the film. Zoe Sladana returns as Gamora, and she absolutely kills it this time! With her character being involved with a drastic plot point, it left her character to be fleshed out more, while becoming more grounded than before. Karen Gillan as Nebula got a lot more to do this time around, really giving herself, and Gamora the extra excitement and importance they both needed. We really didn't get too much more on Drax, played by Dave Bautista, but every time that man opens his mouth, it's comedy gold! With the nice addition of Mantis, played by Pom Klementieff, it helped flesh his character out, subtly. Michael Rooker as Yondu, is the MAN! He gets so much more to do this time around, fleshing his character out nicely. His character is just so well written, allowing for great character moments. With Groot being pushed to the side, it allowed for Rocket Racoon, played by Bradley Cooper, to gain a tremendous bond with Yondu. The banter between these two characters was absolutely gut-busting! Rocket also has one of the better character archs of the film, fleshing his character out more, while keeping that charm everyone loves. I'm a fan of Kurt Russell, and I really liked him in the MCU, but the writters didn't give him enough space to breath, and be Kurt Russell. Even though he has one of the best back stories for a villain, while also posing a real threat, his character development was predictable. If James Gunn let him do his thing, I feel as if this film could've benefited from that Kurt Russell charisma. The issue this film had, it tried too incorporate too many villains, making everyone underdeveloped, and a waste of potential.\n\nGuardians 2 didn't rely on the action like the first film, but the few times it's there, it's super exciting, well shot, and backed up with immaculate effects. This is one of the MCU's best looking films.\n\nYou didn't think that they would make a sequel and not absolutely kill it on the soundtrack again, did you? James Gunn and Tyler Bates came together once more to create another amazing soundtrack, that enhanced the emotion and tention in each scene.\n\nOverall, even though James Gunn ran into a few more issues than the first, he still managed to create a real fun experience!",
            "review_date": "2020-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my opinion, this movie is better than the first one. More of a backstory for Peter and a closer bond grows between his friends.",
            "review_date": "2020-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great sequel to the first part and also with a lot of heart",
            "review_date": "2020-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this is the most overrated MCU movie. It is a lot like Age of Ultron: a major disappointment after the first movie, which was amazing. The difference is Age of Ultron is underrated with an underrated villain while this movie is overrated with a way overrated villain. One of the big problems with this movie is that the humor failed. It tried to be as funny as the first Guardians but it just wasn't as funny even though there were more jokes, because the humor just didn't work. Mantis and Nebula are bland. Mantis is just a useless character used for exposition and comic relief. Nebula feels like a cheap, knock off, less interesting version of Loki. I don't buy her turn at all. Still, if those were the only issues, I would've still liked this movie. The main issue is the villains. It had too many first of all. We had the Sovereign, Taserface, and Ego. The Sovereign is the main antagonist for the First Act. They shouldn't even be villains as they are actually victims of Rocket's personality. Then, we have Taserface, who is slightly better than the Sovereign, as he actually feels like a villain and his interactions with Rocket are hilarious. And now, the biggest and most overrated villain, Ego. Ego is right up there with Whiplash for wasted potential. He's supposed to be the main villain, but he isn't even a villain for the first one and a half hours (yes, that's actually the exact minute mark that he becomes the villain.) Ego is not built up well at all in the movie. And the twist hardly feels like a twist, as it was kinda obvious he was going to be the villain. If they wanted to do a big twist, it would have worked better if Ego had been evil the whole time, and the twist is that he's Peter's father. They could've made the Sovereign work for Ego, and he's been trying to find Star-Lord, and at the beginning, the Sovereign find Peter and unknown to the Guardians, tell Ego. The theme of family being more than blood would still work. The only reason Ego is not completely boring is that he's played by Kurt Russell. All that being said, the movie does have its redeeming factors. Yondu's arc is really well done. His relationship with Peter is easily the best part of the movie. He has an amazing Mary Poppins moment, and his interactions with Rocket are also really enjoyable. Yondu is probably the one reason that I don't dislike this movie, and think its okay.",
            "review_date": "2020-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Woo, not often does a sequel live up to the original, but I'd dare say that this surpasses the original! Not that they aren't both fabulous. The entire cast is perfect, and there's so much that people can relate to in here, as well as humor throughout. It's good to see Peter get what he needs, and to realize that what he thought he needed was definitely not what he thought, and that he had everything already, and that he was a strong man on his own. Lovely film, 1000%",
            "review_date": "2020-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As good as the original. A bit too odd. The new characters are welcome additions and steal the show!  If you enjoyed the original your like this if not stay away.",
            "review_date": "2020-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is controversially one of the worst MCU movies of all time. The movie was funny, but all the other things that were good in the first movie, were thrown away in the second. The dynamic between the characters is my favorite part about the guardians. So i was really bummed, that they split up the gang for half of the movie. The movie is still charming, watchable and enjoyable for sure. I still don't understand what they tried to do with the villain. This was supposed to be one of the most emotional fights in the MCU, but the execution leaves me wanting more. The biggest part of the movie they didn't even know, that he was a villain. In the end they save this movie with the comedy and Yondu. Yondu was my favorite character in this movie by far. What they did with him was great and i guess he was what makes the movie decent.",
            "review_date": "2020-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A decent ending can't make up for uneven tone ",
            "review_date": "2020-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lot of people's high expectations were let down because this film isn't as good as the original, but that's unfair to the movie : it has one of the MCU's highest blockbuster entertainment value, the visuals and the action are fun and the writing dives deeper into these already beloved characters.  Also, Baby Groot.",
            "review_date": "2020-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than Captain America: Winter Soldier. A+",
            "review_date": "2020-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That ending makes me cry every time",
            "review_date": "2020-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sequel that far separates itself from it's predecessor. GOTG vol 2 grows on you emotional with deeper wounds of lead and supporting characters. How they deal with pain, grief, heal old wounds, make amends with their past, And move forward. Filled with laughter and sorrow, GOTG vol 2 keeps this franchise in it's own class from the rest of Comic book adaptions. Impressive villain in Ego.",
            "review_date": "2020-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Meh. Kinda long. But Baby Groot is adorable at least",
            "review_date": "2020-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very funny yet flawed follow up to the original.",
            "review_date": "2020-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While in a lot of ways it isn't quite as solid as the first in its volume series, there are some parts that are much more interesting to me. Kurt Russelll as Eggo, the father of Starlord, their relationship dynamic was interesting. The most interesting was the sister relationship between Nebula and Gamora. Actually, The first Guardians is a better made film with a much better screen play with a less interesting story, but that originally story is more relevant to the greater MCU. The comedy was hit and miss. Very good but then very bad. Visually stunning, but an inferior sequel, which is fine.",
            "review_date": "2020-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed this Guardians follow up. It has some hilarious moments between characters, a Baby Groot that’s too adorable to ignore, and Kurt Russell as a fine addition! I think each character had some development which was needed. Plus the ending was surprisingly tender. A sequel that improves upon the first",
            "review_date": "2020-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I now think that the writing may feel a little lazy at times, but despite that, i thought this was an awesome second installment to Guardians of the Galaxy. Now if you all will excuse me, i'm going to prepare myself for Vol. 3 when it comes out in 2021.",
            "review_date": "2020-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its not as good as the first one but it is a very good sequel. Again the sound track choices are brilliant and the movie has some beautiful CGI effects. Expect to laugh, cry, and be drawn in from start to finish. The Guardians could be giving Captain America's trilogy a run for its money.",
            "review_date": "2020-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A funnier and deeper look into the franchise's endlessly entertaining superhero characters with bigger world building.",
            "review_date": "2020-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't see how people don't think this movie is just as good as the first. I've seen this movie more than any other MCU movie, and I always have a great time watching it. The acting and writing is witty as expected, the music is great as usual, and most importantly, we're given a decent villain in a Marvel movie for once. This movie has more emotional depth than most other MCU movies, and should be ranked a lot higher on many people's list of top MCU movies.",
            "review_date": "2020-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most underrated MCU movies! legitimately don't get why people dislike this. It has everything I wanted from an MCU movie. The CGI is amazing and the colorful visuals really make the movie visually pleasing. Every actor gives a great performance and the characters are handled really well here. Star Lord and Gamora's relationship is handled so well, Nebula gets a ton of character growth. Yondu gets a believable redemption arc that leaves me in tears, it was great seeing a more emotional and caring side of Drax with his relationship with Mantis and Ego is a great villain. His motivation is kind of stereotypical but he is intimidating, powerful and I love how he is connected to Star Lord, making him more hateable and Kurt Russel gives a very entertaining performance and how can you not like Baby Groot? The action is a ton of fun, the humor still lands, it's well-paced, it's amazing. I do admit the whole Sovereign plotline is useless and the freshness is not quite there but I will defend this movie forever! (A)",
            "review_date": "2020-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It doesn't have the same edge and wit as it's predecessor, but it more than compensates its flaws with many emotional moments as well as improving and increasing the chemistry of the characters, the comedic style, the amazing visuals effects and action pieces, and the scope of the action by showing the great potential of a mcu movie in outer space.",
            "review_date": "2020-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians of the Galaxy Vol. 2 may not succeed more than the first, but at least this movie did well. I love Kurt Russell's performance as Ego, the screenplay, amazing cameos from Sylvester Stallone and Michelle Yeoh, and the relationship between Peter Quill and Yondu. Overall, this movie is really an underrated gem for the Marvel Cinematic Universe.",
            "review_date": "2020-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simple but yet entriguing, entertaining from start to finish, with yet another successful dad-son paradigm.",
            "review_date": "2020-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Drax always laughing at a lot of things. Rocket made me laugh too. I kind of liked Groot as a baby. The ending was pretty sad. I didn't expect Sylvester Stallone to be in this movie. It was cool! I also didn't expect Peter's (Starlord) father to be the villain, and that he was Kurt Russell. Worth the watch!",
            "review_date": "2020-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first movie is better........ ....",
            "review_date": "2020-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Could possibly be better than Guardians first movie.",
            "review_date": "2020-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really funny and didn’t disappoint ",
            "review_date": "2020-02-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I cried. I said I wouldn't, but I did. This movie is surprisingly emotional, tackling with the history of Peter's parentage. It had such a strong message of family which was lovely to watch. I enjoyed it overall, I liked the jokes. Rocket is my favourite character. The reveals were shocking and I was engaged most of the way through  There were just a few moments when I started to drift off, but overall I liked it.",
            "review_date": "2020-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like the first, the soundtrack is better than the movie. I feel this one is worst than the first sadly. \n\nI felt shocked seeing Yondu killing 100 persons so easily and without regret. He was serial killer and I felt no regret about seeing him for. That moment really lost me. I really wanted to like this movie, but due to that the emotional core failed😭.  \n\nPart of the problem is that the Empire Strikes Back, which for all the 80's shameless references. This movie and the previous are afraid to reference Star Wars; which is weird considering the whole Darth Vader is Gamora's father and another sorta Darth Vader is Star Lord's father. I feel they should had stick to one single Darth Vader, if they wanted the movie to be about it they should had done it about Thanos and Gamora, because this feels like a side story that a sequel is damned to sorta remake. Another reason is that well Luke Skywalker love redeemed his father instead of killing him in cold blood; which is what this movie does with Star Lord killing his father in cold blood. You remember that outburst of rage in Return of the Jedi where Luke almost, almost falls to the Dark Side by almost killing his father Darth Vader? Well is exactly what Star Lord does, he literally just kills his father in a heavily emphasized rage outburst (it would had been excusable as self-defense if the characters hadn't been plotting how to kill him like a whole night before).\n\nSure they sorta try to make a point about that rage outburst in Avengers' Infinity War but the point of the matter is that even considering that, like Ironman anger rage outburst; neither of the 2 characters is shown to learn anything. Both live happily ever after without learning anything at all to solve his main internal conflict; because they are never shown solving it. That's what makes George Lucas creation of Luke Skywalker so unique as a character (and yes introducing a parent figure and killing it on the same movie is a huge mistake J.J. Abrams repeated from this movie on a Star Wars movie; even if that movie showed it in self-defense).\n\nI really wasn't fond of baby Groot either, in part due to him being a revived character, and I dunno too cartoonish designed. Sylvester Stallone cameo felt like it had nothing to do with the rest of the movie. In order to not take you out of the movie those people need to have main roles. And yes those Pacman and David Hassselhof jokes in the middle of the end where; well awful. And those godlike powers made it seem even more powerful than Thanos or the Avengers villians up to that point; I hate how Marvel doesn't care about levels of power of villians",
            "review_date": "2020-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "[⭐️74%]\n\nWhilst continuing to expand the hilarious and loveable characters in terms of the depth and backstory, for the majority of the movies runtime the group dynamic isn't as strong as the group are split up into their own little missions. However in doing so, characters like Rocket and Yondu show a more personal side to them which had been hidden away in Volume One. \n\nThis sequels comedy is as good as the first, largely thanks to Dave Bautista's role as Drax, being the main source of comic relief.\n\nWhat lets this sequel down is the story, it is important to establish the true origin of Quill and his father however it just leads to dialogue heavy scenes where not much happens. Most of the characters are at their strongest when they're together so when separated the individual characters just don't attract as much care.\n\nIf the group wasn't split up, this would be on par with its predecessor as the humour is as good as the first, some characters are better this time around, but it doesn't feel like the team up movie fans wanted.",
            "review_date": "2020-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining. A little too sappy and slow. Still cool but so far among the weaker links to the MCU. Watched 2/17/20 rewatch eh!",
            "review_date": "2020-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much like the first movie, Guardians of the Galaxy Vol. 2 is a fun, cheerful addition to the larger Marvel Cinematic Universe. It packs more humour and music than the first one and manages to still have a serious plot despite its light-hearted nature. And above all, Baby Groot is the most adorable thing ever.",
            "review_date": "2020-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If Guardians was the film that I left lacking, that was promised to be the the movie for me and then ended up being almost the movie for me; the superbly names Guardians of the Galaxy Vol. 2 IS the movie made for me. \nThe soundtrack is apt, the jokes are the right kind of nerdy and every character gets their due, they get an arc full of pathos, connection, humour and depth. Absolutely every one of the main characters had me crying out from beneath my 3D glasses throughout. The emotion is rich, relatable and raw and I appreciated it. I mean just the way the movie ends and the interconnectivity of all the plot machinations are warranted and welcome. \nThe effects, battles, and shooting never felt rushed or cheap. Everything fired on all cylinders with a care and love throughout. The plot was personal and minimal as it should be and the way it was made global was sensible and simple. The stakes couldn't have been higher because they were personal and they didn't need a sky portal to do it. \nEven the references I didn't get were welcome little injokes rather than complete set ups for other movies that played in to the tone of the movie. Mantis is excellent and Drax is almost the most hilarious which is saying something. The pacing and the structure of the battles were coherent and made creative use of everyday new skill sets. The film had me in stitches throughout and the potential of Volume 3 and the next iteration of Groot is certainly an appealing one. \nThe depth effects of the 3D, after he litany of terrible post conversions I've seen, was consistent, pleasurable throughout and extraordinary well done and for one actually enhanced the experience.\nThis film should be added to the annals of time as the exact right kind of blockbuster sequel that builds upon its predecessors shoulders to create something unique and memorable that was both economical, brisk and yet deep and seemingly never compromised.",
            "review_date": "2020-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the original but still has all the charm and humour and a baby Groot. However, it can be held back by the fact any serious moment is undercut by a joke, much like every 2017 MCU movie.",
            "review_date": "2020-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie. Nice Laughs. Baby Groot Is Awesomely cute.",
            "review_date": "2020-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not like the first GOTG, but also good",
            "review_date": "2020-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Completely skippable. The first movie, aside from atrocious third act concluded with a cringeworthy dance-off, was generally entertaining. Not perfect, not outstanding, just entertaining. The sequel runs on fumes, hoping to reach the nearest gas station, but its engine shut down almost immediately.",
            "review_date": "2020-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great film in the MCU",
            "review_date": "2020-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hillarious! Finally exploring more of the cosmos!",
            "review_date": "2020-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unfortunately, it's hard to say but it's true that the volume 2 of the most-liked Marvel adventure 'Guardians of The Galaxy' has some of the most silly on-screen optimism. Some sharp dialogue and flashes of entertainment can't take away the fact that it's aa contrived sequel to a promising first original. It's just doesn't derive the qualities or even inherit from the source mejor any other comic material. Chris Pratt is the strongest link in an insipid sequel. However I am really excited what will be a takeaway from the third film of the lot. But you can give a skip even if you are a fan.",
            "review_date": "2020-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not any where near as good as the first one but still decent.\n\nrating; 7.6/10",
            "review_date": "2020-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another filler in the franchise. A back story to the lead character (starlord) which had me reaching for the sick bucket. Thor 2 was about as dull.",
            "review_date": "2020-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good. Not as good as the first one though.",
            "review_date": "2020-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable and heartfelt! I liked the first one more but this one was amazing!",
            "review_date": "2020-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This sequel was a little better than the first one but still not amazing. There were some goofy scenes in the movie and the cast was just as stupid as before. No wonder they didn't make many issues for this comic series.",
            "review_date": "2020-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed a lot. I didn't loved the Kurt Russel plot, but it was really fun :)",
            "review_date": "2020-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just finished my second viewing. I was streaming, my connection was bad and it was skipping. Normally that means I stop and watch another day. But I just couldn't press stop. Not only did I watch it all, I cried, twice, In the same two moments I cried in my first viewing. I love the characters and FX, but the films use of music is where it excels. It's so emotional, and immensely entertaining. Superhero films don't get much better than this.",
            "review_date": "2020-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched vol 2 straight after watching the first movie as I loved it.\nThis one doesn't disappoint too.\nAction filled, great characters and a good laugh.",
            "review_date": "2020-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It takes everything great with the first movie and it proposes it in a new way emphasizing over the comedy. Absolutely awesome but it is not able to surpass the first one.",
            "review_date": "2020-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's enjoyable, but it doesn't feel like a necessary movie to have a significant impact on the characters. It's very funny, though.",
            "review_date": "2020-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While not as good as the first Guardians film it delivers in all the fronts the first movie did so well, 8/10.",
            "review_date": "2020-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a great sequel to the first one. It handles humour more brilliantly than even most of the MCU. It does a great job at explaining the concept of a celestial and really portrays them as godlike. Despite being a mediocre villain, Ego is handled very well and instills a sense of fear among the audience. Peter and Gamora's relationship is also shown to be effected when he meets his dad for the first time in basically forever. Everyone gets a descent amount of character development but the story is mainly focused on Quill and Ego. Yondu finally redeems himself in a satisfying way and keeps many scenes interesting. This movie is by no means perfect, it does have its fair share of flaws. But almost the entire film is filled with an exciting and funny storyline which does an amazing job at keeping its audience invested. 9/10, it can't compete with many other great movies but it certainly deserves recognition. Definitely something I'd be willing to rewatch.",
            "review_date": "2020-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is extremely impactful. As someone who does not have a dad the message sent by this movie is something that was very touching the Guardians are back and better than ever.",
            "review_date": "2019-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid film but won't stand out from the crowded MCU lineup. Humor was forced and unending which downplayed the great conflict between the villains and our heroes.",
            "review_date": "2019-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie takes the lovable characters from the first movie and expands on them; everyone is going through some emotional struggle which makes the heart felt moments hit harder.",
            "review_date": "2019-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can't tell if I like this one more than the first. The group still has great chemistry and the villain actually has character now",
            "review_date": "2019-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie rocked! Lots of great action and humor with a touching wrap-up at the end. Not quite as good as the first GotG movie, but that one was incredible. All in all, this is a great sequel.",
            "review_date": "2019-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't see the hate for this movie sure it wasn't better then the original but it stills holds up as one of the best MCU movies",
            "review_date": "2019-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as impactful as the original, it still delivers with the unique flavor that is the Guardians, developing the characters in a meaningful way while still not overburdening the viewers with drama or downtrodden feels.",
            "review_date": "2019-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While not as good as the first installment, Peter Quill and the gang do it again and deliver a hilariously awesome time for movie-goers.",
            "review_date": "2019-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's just as funny as the first, I'll give it that. The problem with this sequel is that it spends much of its second act pondering interesting ideas without the thrills or quirkiness that made the original so likable. (B)",
            "review_date": "2019-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another fun MCU Movie but it just fails to capture the magic of the first movie. There are some heart-touching moments and it is always fun to see this team together. However, the comedy misses the mark on several occasions. It feels like James Gunn just tried to double down on everything that made the first one good, to the detriment of the overall picture\nThe character development is solid and the relationship between Gamora and Nebula is very well handled. It is still a very fun movie and it slips nicely into the overall infinity saga.",
            "review_date": "2019-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "mister blue sky please tell us why you had to hide away for SSSOOOOO LLLOOONNGGG.",
            "review_date": "2019-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians Of The Galaxy Vol. 2 is not as good as the first one, But it still keeps all of the Humor and Heart from the 1st one. It is a great continuation to these characters and has a Really good story.",
            "review_date": "2019-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Luke, I am your Father.\" Oh wait, it's the wrong one. \"I'm your dad, Peter,\" Ego said to Quill when he finally met him, and oh boy did I assume that this movie would be an awesome reunion between father and son. I did not expect the twist this movie has to offer.",
            "review_date": "2019-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first movie, but could be passable. I think this one was a breather from all the intense movies that Marvel has been churning out through the months.",
            "review_date": "2019-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yondu seemed like a savage, but for me, he was the one who truly loved and cared for Quill even after betraying them. He was the best father Quill never had!",
            "review_date": "2019-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "James Gunn did it again! And it used music just the same as the Vol 1 predecessor of it. It felt much better than in the first movie.",
            "review_date": "2019-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious movie, bad (and awesome) dad moments, eargasmic soundtrack, and of course, the iconic humor Marvel movies had with them. A total package of a movie, I must say!",
            "review_date": "2019-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is a pretty good sequel to Volume 1. What we thought to be an epic dad-son moment was just a facade, and honestly, to Quill, who just wanted a father all this time, it was a bit sad.",
            "review_date": "2019-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What would you get when you put together a group of misfits and call it a day? Hilarious, full of classic songs and drama that you should not miss.",
            "review_date": "2019-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Baby Groot was so, so cute! Honestly, I'd pay to watch a whole movie with just Baby Groot as the focus.",
            "review_date": "2019-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as fun as the first one, but it was still jam-packed with all a Marvel movie will be: humor, action, drama, and BABY GROOT!",
            "review_date": "2019-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as fantastic as the first one but still awesome. I love all the characters in this film and their interactions with each other are what make the movie so great I especially loved the scenes between Gamora and Nebula. the film is funny most of the time but it also has a lot of genuinely emotional moments that really work the ending actually made me cry when I watched the movie for the first time. this is a movie worth your time.",
            "review_date": "2019-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Silly movie. Good fun.",
            "review_date": "2019-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overall, the second installment delivered very well. It was crazier than the first film, and it was packed with better character development and AWESOME VISUALS! Must....resist spoiling the film.",
            "review_date": "2019-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The villain, like any other Marvel villains except Loki, sucks. Unclear motivations + can be defeated by the power of love. You know, all that jazz. But aside from that, the entire movie was a very enjoyable watch.",
            "review_date": "2019-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two words: BABY GROOT! Groot was there to make the nerds' wives and girlfriends stay and watch the film. He's cute, adorable and everything that your Disney princesses would love!",
            "review_date": "2019-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid character development and motivation. Can't gush about it now to avoid spoilers. All I can say is: \"Watch it.\"",
            "review_date": "2019-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can clearly see that Marvel trusted James Gunn. Everything he did, even the slapstick-LooneyToon-ish kind of humor were perfect. He clearly had fun conceptualizing and visualizing everything.",
            "review_date": "2019-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It feels like Vin Diesel influenced the film too much. His #FAMILY theme from the Fast and Furious franchise was all over the film!",
            "review_date": "2019-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome Mix Number 2 was amazing! The songs and how they were strategically scored in every scene set up the right mood. Got their playlist on repeat!",
            "review_date": "2019-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "VISUALS VISUALS! VISUALS! If only my eyes and my head can take it, I would love to watch this on 3D. The team did a superb job on this one!",
            "review_date": "2019-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I AM MARY POPPINS Y'ALL! Glorious cameos and easter eggs. Not gonna speak much about it to avoid spoilers. Great movie.",
            "review_date": "2019-11-27",
            "source": "rt",
            "lang": "en"
        }
    ]
}