{
    "rating": 8.5,
    "release_date": "2017-06-02",
    "num_reviews": 286,
    "genres": [
        "Drama"
    ],
    "summary": "Daniel Blake (Dave Johns) is a 59-year-old widowed carpenter who must rely on welfare after a recent heart attack leaves him unable to work. Despite his doctor's diagnosis, British authorities deny Blake's benefits and tell him to return to his job. As Daniel navigates his way through an agonizing appeal process, he begins to develop a strong bond with a destitute, single mother (Hayley Squires) who's struggling to take care of her two children.",
    "reviews": [
        {
            "content": "Sobering but powerful, Ken Loach's return to filmmaking is a masterwork. Hayley Squires provides one of the best performances of the year, and Dave Johns' leading performance is stellar.",
            "review_date": "2023-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strong, shocking, overwhelming. this film makes us think about excessive bureaucracy, the state that inflated itself to the point of forgetting those it was supposed to protect. For those who are not heirs, there remains the search for a lifetime after survival, at the cost of health and well-being. I live in Brazil and here is not much different from that.",
            "review_date": "2022-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very realistic and sadly spot on",
            "review_date": "2022-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really well-done, almost documentary style highlight of challenges of the digital transformation in public service and life in general, of solidarity that people must rely on to make it through very difficult times, of how life is heartbreaking (literaly) for thousands of people in devoloping nations - and not just immigrants. However, the whole point is driven in just a bit too hard at times, there's some discontinuity and the I, Daniel Blake scene has some odd reactions by people.",
            "review_date": "2022-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "another wonderfuly humane and empathetic film from Ken Loach.  this one stands above the rest.",
            "review_date": "2022-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I, Daniel Blake is a film that reaches for very low-hanging fruit as far as dramas go, the common man vs. the system, with virtually nothing else beyond that. Sprinkle in a handful of out-of-touch anachronisms to establish the character, give him a heart of gold through his connections to his neighbors and friends, and collect your accolades for a supposedly biting criticism targeting an uncaring social safety net. The messaging is easy to agree with, the simplistic execution is not. \n\nKen Loach and Paul Laverty took the 'Rehabilitated?' scene from The Shawshank Redemption, recreated it in an English benefits office, and then decided to work the story back from there. (2/5)",
            "review_date": "2022-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Every single person needs to watch this movie. It is utterly inspiring, emotional and insightful. It's important that we're all aware of the corrupt benefits system in the UK and how it directly affects people's lives. I've got to say Ken Loach completely moved me and got me thinking about it all. It will make you cry for sure! The ending is so moving.",
            "review_date": "2021-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This drama film tells the story of Daniel Blake, who is denied employment and support allowance despite his doctor deeming him unfit for work. The British director Ken Loach manages, as few can do, to tell this story with intense realism and to denounce the paradoxes and indifference of bureaucracy. A true masterpiece.",
            "review_date": "2021-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Directed by Ken Loach, the film tells the story of a widowed cabinetmaker who suffers from social security bureaucracy while he is unable to return to work. In this scenario, he meets a single mother, Katie ,and her two children, who also depend on the British social security. This film could be a documentary showing how cruel British welfare is. Instead, Ken Loach prefers to tell the story of Daniel Blake, a sick man, who struggles to survive and still manages to help others along the way. It is a good film to understand the British social security, and why not say it, around the world. This type of production needs to be more and more common because it denounces the ills of the current world.",
            "review_date": "2021-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "reasonably acted, poorly scripted, vacuous poverty pornography for ideologues with socialist tendencies",
            "review_date": "2021-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I, Daniel Blake… a story about dehumanizing\n\nThis British film, which has been going on for more than four years since its release, is a good story about how bureaucracy is quite a drama for those people that capitalism doesn't take very much into account. Each stage and process that is seen in the film, gives truth to the burden that must live not only the old generations, but also the new ones.\nThe person who plays Blake is Dave Johns, who for his good performance helped win the Palme d'Or at Cannes for the film. A well-deserved award from my perspective, because this independent film shows a reality that a major film producer would not do, and that Sixteen Films and Why Not Productions did. Such a reality is the duality of the capitalist problem that represents on the one hand the skills or experience in young people and the knowledge of new technologies in older people.\nIn my opinion it is a good production, as it shows the reality of many people in the UK, people who don't drink tea with rolls, but yes with worries.",
            "review_date": "2021-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well-crafted, realistic and emotional commentary on technological change, economic crisis, and the struggles of working class people in England, with excellent performances from its relatively unknown cast and a poignant direction.",
            "review_date": "2020-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's really beautifully done, and I loved every second of the first three-quarters of the movie. It has a lot of heart and it all feels very real; these aren't fantastical stories about fictional people, they're things that happen to so many people every day, and the movie really brings out the drama in the normalcy of it all. Unfortunately I felt that the ending of the movie (starting around the spray-paint bit) was a little forced and cliche, although the emotional impact was still pretty effective. It was still a great movie and I'm glad I watched it.",
            "review_date": "2020-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I Daniel Blake hits you so powerfully. its so emotional and that emotional wave is so Powerful. the ending was some thing from a fairy tail. It made me cry. (great movie!)",
            "review_date": "2020-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "TV(prime), R2.5.15\nWhat did you think of the movie?",
            "review_date": "2020-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A heartwarming movie. About a real, honest, brave and frail man. It make me feel like the actors were living, not acting, and there was no cameras nor screens. I was there with them, living their lives and their pains. It calmly drags you down to their anxiety and despair hole. Without ever making the characters unfit of their human and social rights.",
            "review_date": "2020-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "BFI Southbank screened I, Daniel Blake before the release of Ken Loach's new film and I jumped at the opportunity to see it for the first time on the big screen. It's a hard watch, the consistently bleak circumstances surrounding the characters can be difficult to stomach but I've never seen a truer and more real portrayal of the gruelling, unrelenting benefits system in the UK. Ken Loach clearly massively cares about telling these people stories and the performances are astonishing from the less experienced cast. The one criticism I have with it is that Loach seems to really have to hammer home his point and it can get to the level which feels a little preachy but this is a minor concern about a brilliant, haunting and fantastically made film.",
            "review_date": "2019-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such truth in this movie.I really felt sorry for this man.....He died without taking the things he deserved.Congratulations Mr Loach and thank you for making movies that show how awful the world is for the poor...",
            "review_date": "2019-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit slow to get going, but if you persist you will say \"i'm glad I watched it\" by time you're finished. I promise you.",
            "review_date": "2019-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Infuriating and touching in equal measure, 'I, Daniel Blake' is brutal and bleak viewing that shows the absolutely ridiculous bureaucracy and indifference of the government that people on the poorer end of the scale have to deal with whilst trying to survive. It's a story that manages to shine a light on just how bloody awful the system really is and how it puts so many at a disadvantage without a care, making lives exceedingly difficult for no apparent reason, determined to strip you of any control and dignity; but it also makes sure to highlight the kindness of other citizens -- often not in dissimilar situations themselves -- that are keen to offer help where they can.\n\nIn the end, with its incredibly authentic feel that makes it all the more difficult to watch, it really does make an impact and certainly leaves you in a state of reflection.",
            "review_date": "2019-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the saddest movie I have ever watched; it certainly involved me and reflected some stark realities I expect to face myself.",
            "review_date": "2019-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ken Loach seems to turn out these sort of films with effortless ease, man this is a tough watch at times and it will make you sad, angry and frustrated in equal measure.  Anyone who can watch the Food Bank scenes in particular and now feel bereft truly needs to take a long look in the mirror.  A lot of the film is clearly populated by non-actors and a lot of the script seems improvised.  Whilst that doesn't always work, what it does do is lends the film a genuine authenticity which is vital for this story.  You never doubt that what is happening on screen is also happening right now in 21st Century Britain... and that's heartbreaking.",
            "review_date": "2019-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loach scores again by showing how insane the welfare system really is, especially for the elderly who have no computer skills. The  Secretary of State for Work and Pensions should be very embarrassed. Shame on you for an absolute lack of humanity.",
            "review_date": "2019-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "British director Ken Loach isn't known for politically subtle films; his stories are ones which grounded in one political worldview, promoting and expounding it from a variety of angels. That's not to say he's necessarily heavy-handed; but he runs that risk on occasions. Approaching this film, aware that it was his state of the (British) nation address from the point of view of people lost in a labyrinthine benefits system, I was expecting something I would be naturally sympathetic to but possibly alienated from due to what I expected to be broad-brush strokes. I was wrong; it's Loach's most nuanced and delicate film, telling a simple story with slowly simmering rage. A widowed man is signed off sick from work due to a heart condition; as he attempts to claim the benefits he needs he befriends a single mother and her children as they too seek the support the state should be giving them. Though the script is compelling, the real strength of the film is in its silences and counterpoints; the personal care of the food bank volunteers against the largely dispassionate, impersonal government employees. This results in the films most moving scene - a visit to a food bank where a combination of hunger and receiving compassion tip a desperate, nearly crushed woman in to an act of quiet desperation that's heartbreaking to watch. It's to the film's immense credit that it doesn't drift into anti-climax afterwards; yet neither is there a cheap, easy victory or moment of false hope. Hope is there, but it walks a vulnerable line of being extinguished by the system designed to serve the very people lost under the weight rules and regulations. It's a story of the people who fall through the cracks; it reminded me of Dickens' urgent, prophetic tales of urban poverty and never ending legal wranglings - and the film does not suffer from such lofty comparison. We're left asking: do we contribute to such systems' oppression and suffering, or do we seek out those who are lost, sit with them, listen to them, walk with them? It's a film of difficult questions and few answers; but that is moving, satisfying, funny and eloquent for all that.",
            "review_date": "2019-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Predictable social realism at this point.",
            "review_date": "2019-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Chances are you never saw this movie in a local theater and chances are you never heard of it, which is in itself a sad commentary. I, Daniel Blake covers the story of a man past his middle age and out of work with little hope of moving forward. He struggles to obtain government benefits and drama is created brilliantly as he goes through the bureaucracy. Though he struggles it taxes not only his life but those around him and the film leaves itself a legacy in hopes to change the lunacy of the government system. The performances are wonderful and I thought it was the top 5 films to see for 2017.",
            "review_date": "2019-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unfortunately I think the people who need to watch and learn from this type of movie are the least likely to do so.",
            "review_date": "2019-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think that I, Daniel Blake is a very personal work for Ken Loach and his whole team. The movie hide at any time his political engagement to denounce a deep injustice in the heart of our society. Reducing his history at the most basic and production scenario and is intentionally biased to reproduce reality at his most faithful representation. Loyal to the Ken Loach's documentary style, I, Daniel Blake maybe don't narrating his story by a storm of cinematographic innovations but stay a justified movie full of good intentions",
            "review_date": "2018-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This story is not just a story of poverty and unemployment, it's also a complete painting of the bad side of today's society, told in a very simple and down to earth way by Ken Loach. He manages to tell this sadly quite common story in a moving and thought provoking manner. The film takes place in a context of social misery, shown through the different situations the characters are in, like Daniel's loneliness after the death of his wife, the semi-criminality of his neighbor, the difficulties for older people to adapt to new technologies and the helplessness of a mother forced to prostitute her self in order to feed her kids. This picture is contrasted by a general solidarity that explains how they manage to live or more precisely, survive.",
            "review_date": "2018-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I, Daniel Blake is not a movie that you can watch after a hard day at work to chill at home. The message that the movie provides is so actual and true, that this movie could have a deep impact to your vision of how the world works. This is a movie that could be understand in a lot of differents ways, according to your personal history. But finally this movie could be understand as a warning cry to social issues in general.",
            "review_date": "2018-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is drama movie which deals with a man who have a heart attack and  he is not allowed to return work. So this movie spoke about the society issue like the difficulty to find a work... During the story Daniel meet Katie, a woman who have 2 children, she is in the same situation because she stop her studies for payed an apartment for her children. They became friend. \nFor the characters of the movie the lead role Daniel Blake is play by Dave Johns, he is very generous, kind but he doesn't like injustice, so he help everyone in the need. \nThe supporting actor is Katie play by Hayley Squires, she takes care of their children, she do anything for them. \nFor me my favorite scene is the ending scene, when Daniel died, because he fight for these rights, he give everything of him, and when he get his meetings for his pension he died. This scene moved me and in the moment I was very outraged. The movie had good and I love the music because they are very moved.",
            "review_date": "2018-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With his movie \" I Daniel Blake\", Ken Loach highlights a society problem rarely shown in movies. He captivates us without giving us pity but only by showing the problems of an unequal world. He mixes : love, emotions, friendship , sadness and anger to create a moving universe. \nFinally we can say that this movie gives a moral lesson in our individualistic society.",
            "review_date": "2018-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is about Daniel Blake, a man who's just had a heart attack. Well, he is looking for a job or he won't get paid anymore. This movie is realistic, it deals with real life and it represents the world as it really is. This movie is very accurate and minimalist. It's a tragedy but there are some funny scenes. My favorite scene is when Daniel Blake and Katie met at the social center. I was touched because no one helped her, and at the same time because the officers are mean with her. The ending was really unexpected, it was a good plot twist. Overall, this was a pretty good movie because it shows the problems of our society and the inequalities between rich and poor people. I like this movie because it's different from what we usually watch. Nevertheless, there are some boring scenes.",
            "review_date": "2018-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a realistic drama settled in Newcastle. The main characters are Daniel and Katie and her two children. Daniel had a heart attack so now he can't work anymore, Katie just moved from london, she is a single mother and doesn't have a lot of money either. So, the story is about this old man who can't have a job, helping Katie to overcome her money issue. My favorite scene is when they first met in the social services center when Daniel reacted to the lack of humanity of the workers about Katie's case. I was shocked and outraged by this scene but meanwhile I was moved by the sincerity of their relationship. But I've also found the scene where Katie goes to the food bank, upsetting. I was touched by the kindness of the people working there and angry about Katie's situation, being alone starving. It was a very heartfelt and sincere movie dealing with social issues and injustices. The performance of the actors were unbelievably accurate mainly because they actors were not professionals. Ken Loach offers another overwhelming film. The setting was unusual, wich mathed with the lack of glamour of the character's situation. Ordinary city for ordinary heroes. The people in the town are helpful and friendly, they never give up.  From beginning to end, this movie is a tragedy but with some heartlefting moments.",
            "review_date": "2018-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was at once amazing and heartbreaking. The realism of the scenes shows the complicated daily of some people and denounce the socials inequalities and the abandonment of social services. The long experience of Kenneth Loach allows him to pass intense emotions through his characters. \"I, Daniel Blake\" is a masterpiece.",
            "review_date": "2018-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is very interesting because it's very realist and it shows us a society problem. This movie is also stirred with the main characters who are fighting against the system. When Daniel Blake met Katie and her two children, it's the beginning of their relationship and the solidarity between those characters. The scene in the food bank is very sad and it shows us how miserable and helpful people can be.",
            "review_date": "2018-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a drama and interesting movie, it's very realist, there is a lot of stirred scenes where we can see the shocking inequalities and we discovered real situations. We can see a mother who is ready to do anything for her two children. The scene which made me sad is when Katie was at the food bank. The character of Daniel Blake is homely but true. Ken Loach made a minimalist and simple movie but with true values.",
            "review_date": "2018-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is pretty good. Indeed the style of filming is quite simple, minimalist and realistic, far away from  American blockbusters. The story is about ordinary people, situations which could happen to everyone. Even if it's a tragedy the atmosphere is warm but also kind of dark. This movie shows the sad reality of social issues but it also makes propaganda of solidarity between people, moreover when they are in need. Nevertheless several scenes can be a little bit boring. A few scenes are very stirred and they really affect me for example in the food bank which is truly a striking scene. The impression of an unfair, unequal society lasts during all the movie and we keep on feeling it even after the end of I, Daniel Blake. Even if the actors play quite well, in fact it's so realistic that we almost feel like we are among them, we put ourselves in their shoes. I think it's too bad that the film could may not be attractive enough to give to younger people the desire to watch it. To sum up the sadness of the movie helps us to realize how difficult life can be for some people, maybe our neighbors, so it's a movie I advice people to watch. Congratulations to Ken Loach, once again.",
            "review_date": "2018-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel is a widowman and we follow him after a recent heart attack. The system that makes sure he get's some welfare money is making him sign a lot of papers, applying for several systems and making him take courses. He will probably come back to his work rather soon but the system makes it hard for him as some vital calls and letters never reach him. He is in the middle, shifted everywhere as he are treated in ways that seem unnecessarily complicated. No one helps him, they just give him plenty of stress. There's a good thing he is a smart, nice fella with his priorities right. He helps out a young mother of two, Katie, in his sparetime. Trying to get her on her feet. She is in the same system and really trouble with money.\n\nFantastic pace and build up here, and super acting by the two leads, mixing the parallel stories with big success. The protagonist is a tremendous character in this film that takes a solid punch at the system. There's also a superb climax in this light but also hardhitting film when needed.\n\n8 out of 10 cans of paint.",
            "review_date": "2018-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst movie I have ever seen. The movie was horrible slow bad angles and bad ending.",
            "review_date": "2018-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unquestionably powerful film making. Painful to watch. I've never been in this system so can't vouch for the veracity but you can imagine state officiousness being just like this. Good to see a film so artfully giving a voice to those who go unheard.",
            "review_date": "2018-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is too declarative for my taste, but still a good movie.",
            "review_date": "2018-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie about how the current capitalist State humiliates and mistreats the working poor during hard times. The subtext is that the working poor are at fault for being so, implying that the poor get what they \"deserve\". Great movie for these fascist times.",
            "review_date": "2018-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most deeply moving films I have EVER seen. Anybody who's battled a bureaucracy will relate to and be moved by this. A truly GREAT film with a GREAT lead performance by Dave Johns. Set in Manchester, England. Don't miss it.",
            "review_date": "2018-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Charming, entertaining. Characters suck you in and seem so comfortable in their skin. Nice mix of comedy and drama.",
            "review_date": "2018-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A horribly depressing movie.  If you're unemployed don't watch it.  Welcome to the new world.",
            "review_date": "2018-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As anyone who has ever contended with governmental bureaucracy (which is to say everyone) can attest, it sucks.  But never more so than for the people least equipped to deal with it.  In this film, director Ken Loach shows us one man's (Kafka-esque) struggle in a straightforward realist way - the facts speak for themselves, no comedy allowed (despite the fact that star Dave Johns is a British comedian).  Loach's films have always championed the working class and the down-and-out and that hasn't changed here - but at age 79, he has found a way to reduce the polemics and just show the pain (and the human dignity it impinges upon).  Daniel Blake, a carpenter, has had a heart attack and his doctors forbid him from working - so he goes on what we would call \"disability\" payments here in Australia (the UK system seems similar).  But for some reason, his case is re-evaluated and he is found \"fit for work\" by a telephone assessor, a judgment which he tries to appeal by necessity, given his doctors' verdict.  While waiting for appeal, in order to keep any payments at all, he is encouraged to apply for the \"jobseeker's allowance\", which comes with an array of strings attached - 35 hours per week spent seeking work, a condescending CV workshop, and other indignities.  Blake dutifully complies (but not without some sarcastic retorts, not quite sotto voce) despite the fact that he can't really take any job he finds.  A subplot involves a young single mother (Hayley Squires), befriended by Blake, who is relocated to Newcastle (where the film takes place) for public housing but isn't given any welfare because she was late for an appointment (due to getting on the wrong bus).  Her experience seems even more calamitous and desperate than Blake's.  Loach does resort to some pretty dramatic examples to show us how the system fails ordinary people -- and how those who work within it can become hard-hearted in order to manage programs that are under-resourced, \"digital by default\", and ideological targets for right-wing politicians to cut.  A quick Google search for \"Centrelink problems\" here in Australia results immediately in the following quote from our national news desk: \"The Government knew Centrelink's debt recovery program would incorrectly tell clients they owed money if human oversight was reduced, but continued to do so in a bid to cut costs.\" Equally terrifying.  Films such as this can win sympathy (the film won the Palme d'Or at Cannes) but will the politicians listen?  Every vote counts.",
            "review_date": "2018-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is a very realistic film, such as I would call a documentary that talks about people films fail to talk about most of the time, it is real life, when I moved to the UK in 1990, conservatives had been in government for more than a decade and this was how the system worked, I thought there was something wrong with states employees intelligence and assume they were very stupid, in reality they were following a degrading and oppressive mandate that put little value in people's life, that changed when labour was in governmant even if they did many wrongs, people's work and struggles were valued, since 2010, that has been reversed again, we do see suicide early deaths related to the destruction of the welfare and national health system, so it is a courageous film to produce. I gave 4.5 only because it is not recognised as a documentary of what is wrong with the system and that is a very important point, otherwise the acting and the daily occurrences in intimate life and interaction with services is spot on 10/10. Highly recommended to understand the undermining effects of neoliberalism and conservative ideas on real people.",
            "review_date": "2018-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After watching this film, I think I'll check out the rest of Ken Loach's fllmography.",
            "review_date": "2018-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful tale of people trying to survive in an depersonalised society. My one criticism of this brilliant film is Ken Roach socialist agenda is too front and centre and for me it distracts from the humanity of the central story.",
            "review_date": "2018-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simple: if you like Ken Loach, you will love \"I, Daniel Blake\". If you don't, this will not be the movie that will win you over.",
            "review_date": "2018-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant, heartwarming and deeply moving motion picture about human beings. The film made me cry because its a film about tragedy that happens every day, right next to our doors...",
            "review_date": "2018-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb, gritty and hard-hitting, I Daniel Blake is another masterpiece from director Ken Loach. It's a powerful and damning indictment of the unfairness of the British social security system and how poorly it can treat people in dire need.  Dave Jones as Daniel is such a lovely and well rounded character that it is heart-breaking to see how he is treated and the lengths he goes to to try to improve his lot and that of his friends and neighbours. This is a man who rarely seems to let the crushing, oppressive injustices he faces defeat him so when he does begin to falter, the story is harder to bear. A moving film with a genuine social conscience this is an important story of an underclass that is too often overlooked in modern Britain.",
            "review_date": "2017-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie illustrates beautifully that the ultimate question is: do you or do you not have access to the resources you need?  While oversimplifications like white privilige, male privilge and even first world privalage, become so very harmful - when we use them to ignore some legitimetely shafted people, in favor of others.  This being particularly gross when it's based on racism or sexism.  If we really care about helping people - we must do better.",
            "review_date": "2017-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful, sad movie that exposes what it means in this country to fall out of the safety net.  Heartbreaking, and then (almost) triumphant... Very highly recommended.  Should be mandatory viewing for Cabinet Ministers.",
            "review_date": "2017-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw Dave Johns in stand up a few years back.  Back then I would never have thought that this guy who had me in hysterics would have had such a powerful and emotive performance in him that he turns out here.  The film is an angry assault on the bureaucracy and indifference of the society in which we live in today.  Johns plays a man who has been signed off work by his doctor but has been deemed fit to work by the government and so begins his struggle for survival as an endless barriers continue to prevent him progressing with his case for appeal.  Along the way he meets Hayley Squires' single mum who also puts in a low key yet very powerful performance as a woman willing to sacrifice everything to ensure her childrens' safety and happiness.  It's a powerful, anger inducing and ultimately heart breaking film that is a must see for a true insight into how our government has always treated and continues to treat the less fortunate.",
            "review_date": "2017-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ken Loach is a treasure of British cinema and his latest film is a great addition to his outstanding canon. Set in Newcastle this moving film deals once again with the struggles of the working class. In this case we follow Daniel Blake, recovering from a heart attack and battling the bureaucracy to get his life back in order. Beautifully written and acted this film aches with honesty and pathos. A great examination of the struggles of everyday humanity.",
            "review_date": "2017-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whilst never being the biggest fan of British director Ken Loach and his rather stoic approach to filmmaking, it's nice to see the passionate filmmaker appear from what at the time seemed as though to be a permanent retirement to come back to our screens with this human interest story and 2016 Palme d'Or winning movie I, Daniel Blake.\n\nLikely to enrage as many as it puts to sleep, Blake is a slow yet driven story of 60 odd year old hardworking British citizen Daniel Blake and his battle against the state to be financially supported after the government's frustrating assistance system continues to mess him around and with nothing much more exciting than Blake arguing about resumes or struggling to handle computers, Loach's impassioned tale won't be for everyone but you can certainly appreciate the message being told here.\n\nAlways one to make social commentary a major part of his films, Blake will be instantly recognisable to fans of the directors previous work's as scenes play out in non-cinematic fashion and Dave John's commendable central performance plays itself out in a highly workmanlike fashion as he seemingly bangs his head against walls trying to find the balance between what he needs to do after his life is turned upside down by his recent heart attack, yet finds possible new meaning when he comes across fellow struggler and single mom Katie and her two children with whom Blake strikes up a friendship with.\n\nIt's within this budding friendship that Blake finds it's real beating heart as we're thrown into the scenario that Blake's struggles to get the answers he needs aren't at all an out of the ordinary accordance and for many Australian citizens that have ever had to deal with our Centrelink regime, you will no doubt get cold shivers as Blake tries to reason with office workers or get a hold of someone via a phone and it's within these elements that Blake finds itself feeling like a true docu-drama and very far from a polished film production.\n\nFinal Say -\n\nA slow, quiet and often ponderous drama with a rather abrupt and questionable finale, I, Daniel Blake will be a new favourite for diehard Loach fans and an accessible tale for those seeking a piece of bleak and realistic slice of life struggles in the English landscape, filled with solid if unremarkable performances, a grounded script and an important tale at its core, Loach's film may not be riveting stuff but its humanly engaging and unique in its execution.\n\n3 graffiti attacks out of 5\n\nwww.jordanandeddie.wordpress.com",
            "review_date": "2017-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The politically charged exaggeration removes realism and drains any empathy you may feel. The movie was long, dull and at times just ridiculous.",
            "review_date": "2017-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliantly crafted and very moving film based on the  awful  reality of being unemployed in 21st century Tory Britain. It is an accurate portrayal of the  way unemployed people are treated by the DWP and the government, at whose hands they are dehumanised. (Iain Duncan Smith, former head of the DWP, has described unemployed people as 'stock').\n\nIt portrays the desperate and degrading measures that people on benefits are forced to resort to in order to survive  in a country where there are 6 million people unemployed (20% of the workforce) and unemployed people simply cannot get stable work which is half decently paid.\n\nIt is a timely  portrayal of the state to which Thatcherite free market capitalism has reduced the people of this country, and it comes at a time when  change for the better is in the air, with a Labour party led by Jeremy Corbyn, determined to end Thatcherism for good and improve Britain for the many,  in the wings and ready to take power from a failing, incompetent and contemptible Tory regime.",
            "review_date": "2017-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though I, and the United States, are late to the party with this movie, it is thankfully a timeless work.  I fail to see how anyone can walk away from this movie without being impacted, or at least reaffirmed.  Simple, charming, firmly grounded in reality, and speaking to all without singling out anyone, I, Daniel Blake offers its teachable moments without judgment, which will unfortunately be relevant when looking at the past, present, and future of everyday citizens.",
            "review_date": "2017-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Given the reviews I expected much more. There is hardship, suffering and injustice out there but this felt out of touch and dated. The characters didn't ring true and  moral signposting was too obvious. People were saintly or wicked. Great acting but just a bit lacking in something.",
            "review_date": "2017-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "boring, melodramatic overwrought, tries to tug heartstrings, fails.",
            "review_date": "2017-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awful movie. Don't waste your time. We didn't want to walk out midway, we were hoping it will get better but it never did. It started low and spiralled down from there. What an unnecessary experience. Wish we could have our money back!!",
            "review_date": "2017-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bad and boring movie. Give me my 2 hours back!",
            "review_date": "2017-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know it is a big social issue but the story could have been told in a more solid way. I like it , and just that",
            "review_date": "2017-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Grabbed the heart strings real hard",
            "review_date": "2017-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Impeccable acting.  Great portrayal of a system grinding humans and disposing of them and the people trying to prevent it.",
            "review_date": "2017-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a good movie that deals with how precarious people's lives can be. Daniel Blake will make you laugh and cry!",
            "review_date": "2017-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies of the year, one which overflows with empathy and compassion.\n\nAn elderly man, the title character, tries to get assistance from the government after his doctor says he should not work, but the bureaucrats say he is fit to work because he meets the physical requirements. Blake forms a friendship with another assistance-seeker, a young mother of two, and together they try to navigate the rules while struggling to put food on the table and not become homeless.\n\nLoach focuses in on the daily lives and small details of these characters, who are desperately trying to keep their dignity intact while trying to eke out a living and get the help they deserve from a government that does its best to create bureaucratic obstacles, possibly in order to discourage people from seeking help, or maybe just to retain a sense of order and maybe dole out \"tough love\" - as if the people needing help also need condescension.\n\nHighly political, yet not so partisan, it's a movie that tries to tell us about the humanity and dignity of all people, and that all deserve to live full lives. It's a must see any year, but feels extra relevant right now. A must see.",
            "review_date": "2017-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So typical of the bureaucratic indifference and letter of the law! One rages at this trial of the helpless (US Republicans rejoice at it), and eyes fill several times at this frequent crushing, despair and desperation by the innocent by unconcerned agencies. Hunger in any Western country is unacceptable and disgraceful, but Trump and Republicans gleefully propose  Scrooge's 'let them die and decrease the surplus populations'.",
            "review_date": "2017-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I, Daniel Blake is a 2016 drama film directed by Ken Loach. \nThis drama is a powerful, riveting story which focuses on the struggles of two ordinary people whose path's cross while they are trying to fit-in to the system. Some of the scenes are very moving and poignant. \nPdOW 1001",
            "review_date": "2017-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is no part of this movie that i could imagine to be better.",
            "review_date": "2017-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I, Daniel Blake could have been a better film if it was not a leftist propaganda vehicle. Social Services may not be perfect system.  there is good things and bad things about that, that can be pointed out debated about witch this film fails to do. Daniel Blake's was potrayed like Jesus like character witch  i found unconvincing i also believe this character put himself in some situations he could have simply avoided. i do believe being to right and to left can be a dangerous thing and there you should be balance and this film fails at it. i have to admit there were a few touching moments in the film but not enough to like it entirely.\ni believe this film only won the Palm D'Or at Cannes because the Jury probably decided in there minds it was a politically right thing to do and not because it was a great film",
            "review_date": "2017-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With excellent unknown (at least to me) performances, I, Daniel Blake is a remarkably unflashy and veristic portrait of those struggling just above the poverty line.",
            "review_date": "2017-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I found this movie crass and heavy-handed. I imagine is it intended to be a caricature of the UK benefits system and while its Kafka-like properties do emerge successfully, the domestic situations the two leads find themselves in are so horrid and so improbable as to appear Pythonesque. I felt bludgeoned by the director and scriptwriter into having the responses they thought I should have. This film is one of the most unsubtle I have watched, and way short of Loach's usual standard. It provides no opportunity whatsoever for audiences to react in their own way.",
            "review_date": "2017-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I, Daniel Blake features a tour-de-force performance by Dave Johns, and it's one of the most powerful, exhilarating, and riveting films I've seen this year, and it's also one of the best films I've seen this summer.",
            "review_date": "2017-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A touching yet scathing indictment of the bureaucratic social services system, one supposedly designed to aid its constituents but that's ultimately more concerned with rules, regulations and nitpicking than providing genuine care to the real people it's designed to serve. With excellent performances, a fine script and a directorial style aimed at showing more than telling, filmmaker Ken Loach's latest is well-deserving of all the accolades it has received. Despite a slight tendency to meander at times, this one is well worth your time, an inspiring tale about what we can do when our self-respect and personal dignity are on the line.",
            "review_date": "2017-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Humbling and devastating and at times uncomfortable to watch. Immense performances from the two leads.",
            "review_date": "2017-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "successful was a heartfelt dramedy but nonsense as social commentary",
            "review_date": "2017-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must-see for all the clueless lefties who think the \"state\" is the solution to anything! This is what the state always evolves into. Those who actually do help Daniel do so out of kindness and charity. To hold a gun to peoples' heads and steal a large portion of their hard-earned income by force is wrong, no matter how well intentioned. Socialism has never worked and the comeback is always, \"Well it's just never been done right before. THIS TIME we know better.\" Let people willingly donate to those who they know will efficiently help those truly in need, in stead of robbing them by force and wasting a large portion on administration. The state's best interest is to create a large dependency class to perpetuate their power, albeit temporary as it eventually will fail. Central planning is a failed notion, and billions of people each making mutually beneficial decisions in their own interest is far more efficient. Not perfect - there is no such thing - but in the long run best. Cooperation over coercion, freedom over fascism.",
            "review_date": "2017-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid film exposing the dark side of the British nanny state to those who are unaware of how much hoop-jumping goes on and just how futile one is made to feel. This film could almost be described as a documentary as it is so close to the reality of what people face. Great film but not one which you can enjoy.",
            "review_date": "2017-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "beautiful but brutally honest",
            "review_date": "2017-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most un-Hollywood film in the theatres.",
            "review_date": "2017-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only film I have ever seen in my life that actually has a purpose and drives me to actually do something instead of sitting around and ignoring others as much as I can.",
            "review_date": "2017-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never seen a film that adequately depicts the horror of phone-in abusive discourse of our society run amuck. Comcast you suck. Throttle away our voices but there will be a reckoning.",
            "review_date": "2017-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good simple movie to watch..",
            "review_date": "2017-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than I expected, though my expectations were low after seeing the trailer but this was a strong, heart warming and wrenching, realistic story about working class struggles in today's modern urban society and it's dealing with government services and life in general.",
            "review_date": "2017-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bleak and heartening portrait of modern poverty.",
            "review_date": "2017-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel who...some guy who cares?...only Rotten Tomatoes as usuall",
            "review_date": "2017-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What can you expect from bureaucracy? It only quantifies a person as a case, if not a number. Ken Loach is far too manipulative here.",
            "review_date": "2017-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first 30 minutes frustrated me by feeling the need to throw the point down our throats and instead of allowing the natural stress of life shine through it felt the need to manipulate reality into its most moronic form, a little more subtlety would of gone a long way. The rest of the film however picked up from there and flowed in a much better fashion. The acting is without doubt the stand out winner for this film giving it a very human feel. It displays how those with nothing are often the most willing to give, and how the enphasis on systems and efficiency in modern society is often at the expense of the people they are supposedly there to help. Though the plot is not always elegant it's delivery  is outstanding.",
            "review_date": "2017-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Blake is the Everyman who is beat up, put down, discarded and ignored once he's not useful.  This is worth a look.",
            "review_date": "2017-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is amazing that it has taken this long for \"I, Daniel Blake\" to even get a limited US release. As winner of last year's Palme d'Or at the Cannes Film Festival, it's safe to assume that that will not be the end of this film's accolades. Director Ken Loach has an almost unmarred history of producing quality films over the last 50 years, but this emotive and honest look at poverty in the first world rivals his 1969 masterpiece \"Kes\". The film concerns the titular Daniel Blake, a widower out of work due to health issues, as he struggles against a system that slowly kills the poor through starvation, exposure, and endless bureaucracy. He befriends a single mother of two, and they try to help each other stay afloat in a society of indifference. Along the way they have chance encounters with glimmers of human kindness that help them get by for the time being. It's not too dissimilar from last year's \"A Man Called Ove\" in terms of characters and plot, but the two films diverge in focus. \"...Ove\" is more concerned with the heart and how we can distance ourselves from others due to trauma whereas \"...Blake\" is an indictment of the state for its apathetic role in the degradation of the working class. Dave Johns does an excellent job of capturing Blake as a man who refuses to give up in spite of being trapped in an endless loop of paperwork and meetings. He embodies the frustration that the working class has simmered in for the last decade since, between the housing crisis and the banking collapse, it became abundantly clear that the haves will make no caveats for the have-nots.",
            "review_date": "2017-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched this on a plane, so not the best environment, but it's such a good film.",
            "review_date": "2017-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ken Loach's humanism has never failed to amaze me, and this film is no exception. Mr. Loach has dedicated his whole artistic life to depict various poor British faces, who have to try their best every single day just to get food on the table, but never lose their hearts, their souls, and their loves for other working-class fellows. This film began with a very simple pretext and characters, but ended up with a \"bang\" that brought out the stark difference between the endless hopelessness that the protagonists have to suffer throughout the film, and their heartbreaking tenacity in keeping every last pieces of their dignity, and humanity. Someone looking for a sophisticated cinematic work that was able to win the \"Palme d'Or\" over much more prominent films like \"The Salesman\" or \"Toni Erdmann\" would probably be disappointed with this film's simplicity and its repeated theme from other Ken Loach's works. But no matter how complex we are, human is actually simple at heart (literally and metaphorically), especially when facing hardships in life. For that reason, let us enjoy this and other \"simple\" works of Ken Loach - a \"modern Honore de Balzac\" of cinema.",
            "review_date": "2017-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nice little film about struggle, unfairness and the futility of life.",
            "review_date": "2017-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So, so sad. Just doubles down on how humiliating it is to be an American during the Republican years. Ugh. The Brits don't give me much hope neither. An inspirational story about the struggle to get nowhere. Crushing.",
            "review_date": "2017-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Loach's best.  Bleak, poignant ... the most un-Hollywood film in the theatres.",
            "review_date": "2017-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I actually cannot believe I sat through this whole movie.  It was merely okay.",
            "review_date": "2017-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once more, Ken Loach proves he is more than a social commentator. He is also a master filmmaker.",
            "review_date": "2017-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie.  Totally revealing the word Miserable.",
            "review_date": "2017-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The problem with Ken Loach's much lauded film is that it ticks all the boxes, revisits his usual territory, occupies the moral high ground - but never allows for anything quirky or contentious or genuinely challenging. This is filmmaking as virtue signalling, and that's a real shame from the man who gave us the ambiguous subtleties of Kes and Raining Stones.",
            "review_date": "2017-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although a long-time fan of Loach, I came to this convinced it would be an overlong party political broadcast. I was so wrong. This is up there with Ken's angry best.\n\nThe relationship between Daniel, Katie and her children is truly affecting. The letterbox scene had me in tears. But there is an unbelievable sequence at a food bank, which ranks as one of the greatest in British film history. I will give no spoilers, but you see human life at its hungry, desperate lowest ebb. A shattering portrayal of millennial England.",
            "review_date": "2017-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie night with Iris.\n\nAlthough a long-time fan of Loach, i came to this convinced it would be a party political broadcast and little more. I was wrong. This was up there with Loach's angry best.\n\nThe relationship between Daniel and Katie (and her offspring) is genuinely touching. The letterbox scene had me in tears. But there is an unbelievable sequence at the food bank, which ranks as one of the greatest in British film history. I will give no spoilers, but you see human life at it's hungry, desperate lowest ebb. A shattering scene.",
            "review_date": "2017-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A reminder that the society is made up of all kinds of people and some of them need gentle assistance.\n\nThere was an Oscar buzz for this. Many film experts thought it would sail through, but that did not happen. Now I saw it and I think it should have made into. If the priests' dirty secrets were recognised to condemn on such a big platform, then this film deserves as well. Because it reveals the cruelty against the economically weaker families and computer illiterate old men.\n\nIt is only this much short to be called a documentary film. I mean it was very realistic with cinematic dialogues, otherwise a documentary. This is a message film, highlights what's wrong with our system and who are all suffering from it. The actors were great and the 80 years- old director had done a magnificent job. You could watch as many films you want, but if you fail to watch a film like this often, there no meaning getting into film watching business.\n\nThe story follows a 60 year old widower whose name mentioned in the title. As he is recovering from heart attack and as advise given by his doctor, now he's out of the job and support allowance. Whenever he approaches the officials to look his issue, they always come up with different reasons to send him back disappointing. Especially not being into the computers, he struggles to fill forms on the internet platform.\n\nHe's very patience and following everything they have told him to do. One day he comes to aid to a single mother with two kids who recently moved to the city from London, when she is too struggling in the employment agency to get a job. So their relationship grows as they lend hands to one another in tough times. Following, how they recover from the issues they are facing is what the film to cover in the remaining parts.\n\n\"Listen, you know, you give me a plot of land, I can build you a house. But I've never been anywhere near a computer.\"\n\nI liked this the film, but I think it was too realistic for my kind of taste. Because I like emotional parts and in this film those parts were highly effective, but not sentimentally striking way. Maybe you can say, less music with more dramatisation changed the storytelling style. Though the focus given on economically lower class and their way of life, not intentionally, but lack of support in society, all these were well detailed. I have always supported films that point outs flaws in basic establishment in society.\n\nAlmost all the major struggling juncture one goes through in the employment agency, particularly if the person was old is uncovered. Like the telephone calls responding to the recorded message, online applications, as well as meeting them in person. What we're facing right now in the world is or to know is, not everybody is a computer literate. It'll be in the future, but not now. They are not getting proper help, particularly agency treating them like the illegal immigrants.\n\nIn addition the film gets more interesting when a single mother was introduced. On the other side, different issues faced by poverty ridden small family, particularly her desperate attempt to fulfill the basic needs of her children is heartbreaking. This is not just the English problem, but everywhere else in the world. It had won several awards, particularly one BAFTA award. A good film for everyone, only if you understand the notion of the film or else will be a boring film.\n\nWhile I was watching it, I thought it was a regular kind drama, so I kept expecting that things would turn this and that way. For almost the entire film, but it's only in the final stage something it came up with to surprise me. So my advice is keep low expectation and be patience. More importantly accept what it reveals than what you want from it. If you fail on that, then its not your film and to know that the only way is to watch it.\n\n7 1/2/10",
            "review_date": "2017-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The British social service system is given the Ken Loach treatment in this hugely affecting and powerful tale. The social realist premise of injustice amongst the less-piveledged and unfortunate is captured and delivered with stark awakening and passion. With an excellent cast and assured direction of interplay, I, Daniel Blake is not only poignant and emotional, it is necessary in its reflection of a fractured modern society.",
            "review_date": "2017-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Labour Party political broadcast.",
            "review_date": "2017-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Moving, devastating, and shines a light on an important issue that I was clueless too. I, Daniel Blake is a beautiful and eye opening film.",
            "review_date": "2017-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a drama that perfectly demonstrates the damage inflicted by a government that incentivises human misery for the sake of ideological small state government and tax cuts for the rich",
            "review_date": "2017-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Both heartwarming and heartbreaking. The movie does not overstate its message but powerfully does it with poignant acting by main and supporting actors.",
            "review_date": "2017-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Utterly heartbreaking",
            "review_date": "2017-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece about a guy that has had a heart attack and struggles to survive. He encounters Katie, a young woman, who has her own issues. Ken Loach directed this movie, his best movie to date. Recommended!",
            "review_date": "2017-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film! I thought I would find it slow and boring but ideally liked it and found it interesting",
            "review_date": "2017-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an amazing movie! I got chills because it was so good. Amazing acting, phenomenal story, great pacing. It is one of my favorite movies of 2016.",
            "review_date": "2017-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"I, Daniel Blake\" - Alert to our society in lack of humanity ... A powerful film, a film that marks the attention",
            "review_date": "2017-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a fresh movie different than many other Hollywood dramas probably because it was realistic, not exaggerated and with good acting. Made me cry at a scene too.",
            "review_date": "2017-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If there is one thing you can take away from director Ken Loach's fantastic I, Daniel Blake it is that you realise you are no longer watching a movie with actors and a script, but a documentary that hits far too close to home for its own good. \n\nI, Daniel Blake is a film that will make you angry, frustrated, and sad at a system that seems designed to keep specific people in employment by making others jump through huge amounts of unnecessary beaurocratic hoops and red tape for even the faintest chance to be considered for what amounts to a non existent job. The film also has a huge amount of heart and soul put into it by its lead actors, with brilliant camerawork that genuinely feels like you are watching people's lives unfold in front of you.\n\nIf there is one thing I have taken from I, Daniel Blake and it still sticks with me now, two days after viewing.\n\nIf the workers in the job centre actually did what they are employed by the state for and helped people, wouldn't they themselves be surplus to requirements?\n\nMakes you think doesn't it.",
            "review_date": "2017-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very powerful stuff...storytelling at its best.",
            "review_date": "2017-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I, Daniel Blake definitely has a strong plot and it deals with very important issues, but the execution is so problematic with good performances, but pretty weak direction, horrible pacing that is too slow, a meandering structure and a lack of energy. It has its quite emotional and strong moments, but most of it was way too dull and depressing leading to a very overrated film.",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's hard not to make this review political, and in fact, it might be wrong not to make it so. Loach captures the cruelty some people experience on screen and helps us translate that in to empathy, not a lot of films are quite as touching, or moving, fewer still motivate you consider and change the world around you.",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If this is truly how we treat those in need, we have sunk to the absolute bottom... The time for change is nigh...",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an absolutely god awful and dreary film.",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must-see commentary on the cruelty of the UK's current welfare regime",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not shouty, not showy, the film speaks for itself in terms of the political point it makes. Humanistic, with the despair laid bear for everyone to see.",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"I, Daniel Blake\" is a battle cry that rages against a system intended to help people, but that became a machine to crush them instead. Surprisingly apolitical, it's  a tender tribute to human resilience, blazing with anger and brimming with compassion.",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant, moving, a sad reflection of our times. The last 5 minutes broke me.",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant film, very sad that we've found ourselves in this situation as a country. \nRemember a quote something like, a society is judged on the basis of how it treats its weakest members.. This film shows how poor we are at doing just that!",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Soooooo depressing, just what the psychologist ordered. If you think you've got it hard watch this gorgeous slice of realism. The system is there to grind you down to a pulp, leaving you without a shred of pride left. Gritty and heartfelt performances by all especially Daniel the salt of the earth protagonist. Ken Loach is one of the best at this type of English tale of the downtrodden. Superb.",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most unforgettable films I've ever seen",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Paul Laverty's screenplay is laced with multiple occasions where the viewer is deeply moved and feels prompted to look up what the actual scenario with respect to poverty-stricken / homeless people is currently all about. Director Ken Loach takes the utterly distressing subject and turns it on its head by instilling virtues such as kindness to others even in extremely dire situations. Dave Johns in all respect, puts up a spectacular performance. So does Hayley Squires..and the child actors! Let me know if you did not shed a single genuine tear atleast once through those heart-rending 100 minutes.",
            "review_date": "2017-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ClichÃ (C)d and predictable, but quite powerful",
            "review_date": "2017-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Borderline perfection in film making.",
            "review_date": "2017-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another fantastically real Loach movie that exposes the harsh but oft-ignored reality of so many people's lives and the culpability of a government that has lost any semblance of compassion for its less fortunate citizens - a damning indictment of a so-call modern day democracy told from the perspective of those who find themselves forgotten by their so-called leaders. I was actually so disturbed by what was happening to Daniel & Katie that I felt both angry and uncomfortable watching the almost inevitable end unfold. Must see viewing for all of us who are safe in our comfort-bubble of not worrying about where the money for our family's next meal will come from.",
            "review_date": "2017-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely tremendous British film. Hayley Squires is fantastic.",
            "review_date": "2017-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ken Loch's I, Daniel Blake stars Dave Johns as Daniel Blake, a Newcastle joiner who has recently had a major heart attack. His doctor says that he absolutely cannot return to work as his heart's condition is far too serious. However, the British government has deemed him \"fit for work\" which means he cannot collect the British equivalent to America's Disability Insurance. Now that the government has deemed him fit for work, he must collect Job Seekers Allowance, where he must look for work at least 35 hours a week (even though he cannot work). The film gives two different points of view, one from Daniel Blake and one from Katie (Hayley Squires), a single mother of two who has recently moved out to Newcastle. Her situation is very simple, she has two kids and because she was late for her appointment due to her being lost (once again, she recently moved out to Newcastle) she has been sanctioned. This means that her Job Seekers Allowance has been frozen for 4 weeks (which she can only appeal retroactively). Daniel befriends Katie in the building where she is attempting to collect her Allowance. Daniel attempts to help the family (not financially as he has not income) but through general acts of kindness, like fixing the fuse box in their house or making things for the kids. Most people may not know what people who are forced to live on the social safety net struggle with on a daily basis and the film does an excellent job at explaining to people. As far as cinematography goes, it is spot on. There is one specific scene in a food bank that because of the great writing, acting, and camera work is one of the most stunning scenes in any film of the past decade. It is truly? heartbreaking. Acting is spot on by Dave Johns and Hayley Squires, Squires in particular truly captures the desperation on behalf of a single mother of two who must go to great lengths to put food on the table. Overall, this film is breathtaking in its telling of the stories of so many people. There are hundreds of thousands of Daniel Blake out there and hopefully, ?this exemplary film will allow them to be heard. This film should be mandatory viewing for any politician and frankly to anyone. See it!",
            "review_date": "2017-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have read all the reviews by critics in full in their various pages. Many are about Ken Loach says this and has done that. \n\nReality Check critics.... This film is made into a piece of art work from a true story. The exact same film could be made on a mobile phone every day anywhere in the UK, especially large Towns and Cities. I challenge all so called \"professional\" critics to prove that they remotely have been through what Daniel Blake went through, No you don't know, so shut up as it's real. I on the other hand went through the same assesment by ATOS for mental health PTSD. I scored no points and was told to go back to work. I had my reassessment and scored no points again. I was desperate and put a rope around my neck. I went through with it only to be cut down in time. I had my tribunal in a court with a judge who only listened to 5 mins of what my daily life is like. He stopped the hearing and awarded me benefit for life without review. I want to work. 7 years on I have developed coping mechanisms, sometimes they fall apart. Today I volunteer to work with and help the homeless and lonely. What the film actually shows it is what I found. I didn't know what to say to a homeless person I knew little of the empathy and how to show it even though through my tough times I had been homeless to. \n\nSo what is wrong with the those critics who blast the film or even give it the thumbs up as they want to be seen as the good guys as they know the system is wrong but they don't know how. \n\nWhat the film shows is in reality as I found how to empathise with people in dire straights and the homeless and the Lost...IT IS SIMPLE LISTEN...... ALOT, then and only then will you work out who's playing the system and who's not. Then you are responsible as a human being to help those people in such dire SITUATIONS. AND BEFORE you say it's there own fault. Yes it is, they made some wrong choices. One day, you might the wrong choice, your family and home in ruins. So before you make choices for others, listen to what they have to say. You might learn enough to save your home family relationship, even your own life.",
            "review_date": "2017-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I, Daniel Blake is a controversial, challenging film from Ken Loach: the master of giving unlikely characters a mighty voice.\nThis moving albeit manipulative tale is part dignified drama, part scathing attack on the bureaucracy of Britain's benefits system; both of which are bashed together by continual contrasts between small town community spirit and ice-cold civil service staff.\nLoach's small story stands for big politics, but even on the most basic levels of character, atmosphere and storytelling this is awe-inspiring, unadulterated cinema at its best. I, Daniel Blake is a film which both demands and deserves our attention.",
            "review_date": "2017-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant Film - can't fail to be moved by it. A Ken Loach classic",
            "review_date": "2017-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolutely stunning film from one of my favourite directors, Ken Loach.  This is heartbreaking, depressing and dismal.  But it also shows the spirit of kindness and how, even against all odds, that it can still shine through. It also shows a side to the UK that you don't normally see and how ordinary people, good people, have to struggle to make ends meet.",
            "review_date": "2017-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is just about a bleak and depressing of a film that one could ask for. Too much like real life...as the Canadian welfare system is exactly the same as this British system: They just wear you down.",
            "review_date": "2017-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Deep and moving look at one man's struggle against the benefits system",
            "review_date": "2017-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly incredible piece of storytelling which really hammers home how people are treated in the UK when they have nothing. The trouble is I've been in a similar situation and know people who have too and it's as frustrating and painful as it's portrayed here. The whole system for benefits in this country is corrupt and this movie is the tip of the iceberg. This is a bit of a weepy one too, so watch with a tissue.",
            "review_date": "2017-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Emotional heart-breaking aggravating and uplifting story of one widowed man (and recent heart attack victim) who battles heartless bureaucracy to gain needed benefits he doesn't even want.\n\nDaniel Blake has worked hard with his hands all of his life and just wants to be able to do so again. Kind to his neighbors both scheming and desperate but quick to rail against injustices when he sees them Daniel shows more patience and fortitude to government number-crunchers than a crowd of biblical Jobs. \n\nWill he get compensated or a continued runaround...will his health and sanity hold out long enough to? \"I, Daniel Blake\" shows a fretful and scary present: Where the technology-challenged are left behind and a resume w/ an attractive font counts more than past services rendered.\n\nYou'll want to cheer Daniel's journey on and punch the screen in frustration at the same time. Ken Loach has a decorated history of directing gritty urban dramas that are very distinctly British: \"Blake\" is a splendid and noteworthy addition to his body of work. We need more films as this.",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After Looking For Eric, The Angels' Share and Jimmy's Hall I think it's fair to say that Ken Loach, in his twilight years, wasn't quite as hard-hitting as the reputation that preceded him. In fact, two films inbetween these  - Route Irish and It's a Free World - where largely ignored all together. You'd have to go back to 2006 and his politically charged, Irish revolutionary drama The Wind that Shakes the Barley, to find quintessential Loach. Now though, he returns with another political drama in I, Daniel Blake and it's one of his most potent and important films. \n\nPlot: After a heart attack leaves him unable to work, widowed carpenter Daniel Blake (Dave Johns) is forced to apply for state welfare. However, the system is designed to make it difficult for him to receive any support at all. Throughout his ordeal, he befriends Katie (Hayley Squires), a single mother who finds herself in a similar situation, while trying to raise and feed her children. Together, they try to rise above the indignity of the governments extreme 'austerity' measures. \n\nIn 2014 (directly after Jimmy's Hall) Loach decided to announce his retirement from filmmaking. It was crushing news from one of the most passionate political voices in British cinema. Not to say that there isn't other talents who tackle similar projects and important social issues in film (Shane Meadows and Mike Leigh spring to mind) but there really isn't anyone quite like Ken Loach. In keeping with his socialist views - before he said farewell - he allowed all of his filmography to be available for free via YouTube. However, his retirement lasted just over a year before he stated his intent to come back and make a film on the British welfare system and the Tory government's barbaric treatment of the most vulnerable people in society. \n\nLoach obviously felt that this was a story that needed to be told. And it is. In fact, this film has been so effective that it was even raised and commented on in the Houses of Parliament, itself. Naturally, the Tory MP's lambasted it for being unfair (oh, the irony!) or for failing to accurately depict the \"decency\" of those that work with the Department of Work and Pensions - the very foot soldiers of the Govt who have been imposing such harsh penalties and sanctions on the average working class or disabled person. Methinks the Tories protest too much and, in actual fact, Loach has hit a very raw nerve. Those that work in the DWP may claim that they're only doing their job but really they're just whores of the state that are facilitating nothing less than a fascist regime. \n\n\"Work Will Set You Free\" a slogan that was once used by the Nazi's above the gates of Auschwitz. This is the very ideology of Tory Britain in our current times: Don't have a job? - Tough shit! Poverty on the rise? - Fuck That! Using foodbanks to eat? - Fuck You!... I think you get the gist. Put simply, the lower classes, the sick and the disabled are seen as parasites to a dulled-down, media-controlled society that perpetuates and excuses a fascist government. A government full of toffs that wouldn't know how to walk without a silver spoon up their arse and are blatantly happy giving tax breaks to corporations and their greedy wee cronies. \n\nSocial justice has always been a recurring theme throughout Loach's films and here his voice on the matter is ferociously loud and clear. I, Daniel Blake is a scathing indictment on the government and their complete lack of empathy towards its own citizens. \n\nAs is often the case, his films capture a raw authenticity. There's a stark reality to this that almost feels like a documentary. He has a real ability to focus on everyday people living in everyday situations. Even if you left aside the political commentary, you'd still find that Loach has crafted a genuinely touching human drama. Ultimately, this is a story about dignity, self-respect and injustice. \n\nThe film is anchored by two excellent central performances; normally known for stand-up comedy, Dave Johns as the titular character delivers solid work in his film debut but it's Hayley Squires as the single mother of two who finds herself in some devastating circumstances that truly captures your heart. For all it's unapologetic candidness, however, it also has a surprising amount of humour. To manage this, with such a bleak subject matter, only reaffirms Loach's ability to capture every aspect of life. Despite the hardships and the barbarism that people face on the lower echelons of society, there's is still a humanity that shines through. \n\nLoach has always championed the browbeaten, lower classes and his work in I, Daniel Blake (at the age of 80) shows that the fire in his soul hasn't wained a bit. Like Daniel Blake himself, he's a true voice for inequality and the dispossessed. For an understanding of how cruel our government and society has fast become, this is essential viewing. \n\nMark Walker",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Attention and respect, Love and caring, Protest and hope. Above all, righteousness and justice!",
            "review_date": "2017-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sensitive and touching, if one-sided, look into the life of an individual who represents the plights of several million. Daniel Blake is browbeaten and hounded by the unnecessarily complicated job-seekers allowance application process. We feel his frustrations, not just his being messed about by the Job Centre staff, but at modern technology, which is more-or-less essential for applying. The films biggest weakness is how one-dimensionally the authoritive staff are portrayed, with the exception of the one obligatory Angel figure of course. All of them are curt, borderline rude and appear to completely ignore what our protagonist, and others in a similar situation, have to say. It does ring very true at times, but much of the movie feels more like a finger poke than a commentary. But the lead characters' plea is very real, and he's very easy to sympathise with. He never overplays, facing each obstacle with resolve and a distinctly British sense of humour. The pacing is a little slack, and the climax feels like a real Hollywood product, but the film overall is heartfelt and socially relevant, and many of its scenes are just watching Blake reacting to his seemingly deepening misery, but always with a quirk and deep determination to keep soldiering on. I'd almost call it essential viewing for its topic alone, but it has so much more than that to offer.",
            "review_date": "2017-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Common people...\nGood people",
            "review_date": "2017-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it can feel rather derivative, Daniel Blake is a slice of life that holds no punches. \nGrade: B+",
            "review_date": "2017-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ken Loach's last year Palme d'Or winner, about the tragic ramifications of austerity, both personal and political. On one level, it is a polemical indictment of a faceless benefits bureaucracy that strips claimants of their humanity by reducing them to mere numbers. On another, it is a celebration of the decency and kinship of extraordinary people who look out for each other when the state abandons its duty of care. It is a masterclass in the kind of realist drama that, along with only a few others, Ken Loach has fathered, and become synonymous with.",
            "review_date": "2017-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An understated indictment of the English Welfare system.  Bureaucracy at it's worst,  not to serve the people but to wear them out and kill them.  Dave Johns as Daniel Blake comes off as your favourite uncle, warm, caring and funny.  Ken Loach the director is 80 years old.  WOW",
            "review_date": "2017-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ken Loach's powerful, heartbreaking and brutal indictment of British Conservative policies. After suffering a heart attack at work, a man is forced to jump through the absurd bureaucratic hoops of the English welfare system and finds himself in a Kafkaesque nightmare.\n\nComedy is used to provide some relief from the tragic elements. Great performances by Dave Johns and Hayley Squires.",
            "review_date": "2017-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ken Loach's populist, bitter grip finds fertile ground with the depiction of the dehumanization of bureaucracy on the state of social welfare - all in all made yet more impactful by Dave Johns' and Hayley Squires' heartbreaking lead performances.",
            "review_date": "2017-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful and touching.",
            "review_date": "2017-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly outstanding film...",
            "review_date": "2017-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Struggle between a man and the system for good",
            "review_date": "2017-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a career spanning over 5 decades, Ken Loach is widely known for his ability to tackle social issues with unapologetic candidness; his latest feature 'I, Daniel Blake', a stark and at times harrowing depiction of one man's attempt to battle through a punitive and broken welfare system is no different. \n\nFrom the outset this Palme d'Or winning film firmly establishes the helplessness of our protagonist Daniel Blake, played by stand-up comedian Dave Johns. In the wake of a near fatal heart attack Blake is ordered to indefinitely cease working to prevent further injury and advised to sign on for social welfare years of graft as a skilled carpenter there is understandably a sense of reluctance, however the necessity of money eventually makes his trip to the dole office an unavoidable one. \n\nThe script was penned by Paul Laverty, having previously worked with Loach on his first Palme d'Or winning film 'The Wind That Shakes the Barley' depicting the Irish War of Independence. Laverty possesses a remarkable ability to find humour in otherwise distressing situations. A catch-22 situation presents itself as Daniel Blake learns he is ineligible for social welfare and, against quantitative evidence from medical professionals, deemed fit to work. Appeal against the decision and receive no benefits at all, or spend his days looking for work he cannot take in order to receive Jobseeker's Allowance. After spending decades paying into a supposed safety net system it's farcical to discover that he does not qualify for benefits. The ludicrous nature of the circumstances is only exacerbated by the emotionless government officials who seem more interested in saving money than granting it to those entitled. \n\nThe issue of humanity, or lack thereof, is prominent throughout the film. This is illustrated by the distinct contrast between the almost robotic job centre employees, and Blake's fellow victims of this red tape merry-go-round. His life becomes entangled with one such victim, Katie (Hayley Squires), after she is relocated almost 300 miles to Newcastle due to an alleged lack of social housing in her previous home, London. Their encounter is an unforgettable one as Katie learns she will be denied her benefits as a result of arriving late to the appointment. She is then further punished after explaining she accidentally took the wrong bus in an alien city by being heartlessly removed by security, and Blake, pointing out the lunacy of unfolding events, meets the same fate. The silver lining to this otherwise disheartening scene is the almost father-daughter relationship that forms.\n\nAs the pair continue to jump through their respective administrative hoops they find solace in the company of one another. Blake, in using his carpentry skills to improve the condition of Katie's new home and Katie in helping Blake navigate a 'digital by default' paperless system. Additionally, her two children receive support from a long awaited father figure as their mother plunges deeper into distress over monetary troubles without the support network of her friends and family. The crescendo of emotions reaches breaking point as she is forced to turn to a food bank in order to survive. A heart wrenching scene of pure desperation follows as the starving Katie cowers in the corner of the room devouring a tin of cold baked beans. 'Look at the state of me' she says to Blake, this is what she has been driven to.\n\nI, Daniel Blake takes many dramatic twists and turns before its inevitable climax. Loach, not one for subtlety, puts the audience through an array of emotion in what could be described as an exposé into a broken system supposed to offer aid, not frustration and suffering. Driven out of assumed retirement to create perhaps his magnum opus, this insightful representation of real struggles is one not to be missed.",
            "review_date": "2017-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The latest from British director Ken Loach is another diatribe against social injustices, as well as a stirring character study. I, Daniel Blake examines social issues with the British job market, all while being led by really naturalistic acting and storytelling. While the script from Paul Laverty (Loach's frequent collaborator) doesn't offer too many surprises, it's never wincing, and feels of the moment than ever in light of the uncertain economic future the world is facing. At 80-years old, Ken Loach still feels remarkably contemporary a filmmaker, albeit one with very visible experience.",
            "review_date": "2017-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Felt sorry for him. Anyone that has had to deal with government agencies can empathize. Good movie with some light humour.",
            "review_date": "2017-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I will never look at baked beans the same way again. That scene is terrific. So is the film.",
            "review_date": "2016-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really powerful drama that shows how our capitalist society treats the most vulnerable, and leaves them to struggle to get their basic rights. Really heartbreaking",
            "review_date": "2016-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A heart wrenchingly truthful & raw film about a carpenter who had a recent heart attack & unable to work & has to go on welfare.\n\nThe film focuses on his journey & unlikely friendship with a struggling single mum & two kids.\n\nThis film juggles genuine humor & beautifully tender & sad moments with ease. It shows you the real struggle of those trying to get ahead while juggling no money.\n\nThis is not a light film but a rather important one, I was so in love with the characters & so emotionally involved with this story. This is a low key masterpiece that's very relevant & real.",
            "review_date": "2016-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I shed some tears when I watched 'I, Daniel Blake', the 2016 drama film directed by Ken Loach and written by Loach's frequent collaborator Paul Laverty. It stars Dave Johns as Daniel Blake, who is denied employment and support allowance despite his doctor finding him unfit to work. Hayley Squires co-stars as Katie, a struggling single mother whom Daniel befriends. \n\nLet's hit the negatives before I start gushing about this movie.  There is absolutely no concept of time.  It's tough to know if a week, a month or even a year goes by from start to finish and that is a wee bit problematic.  Also, the ending is utterly predictable.  I saw it from a mile away.  Sometimes a filmmaker ties up all the loose ends unnecessarily.  Somewhere i have to imagine there was an alternate ending.\n\nLoach's attentional to detail is a thing to marvel.  He meticulously carves out a touch of life that is as authentic as it is a reminder that often we aren't doing enough for those less fortunate.  Even if you caught this in the United States, it rings true.  Unless you're filthy rich and/or have the means or the time to battle a government agency, we've all been given the runaround.  You feel the frustration of our main character Daniel Blake (Johns).  All he wants to do is work.  This work is an inspiration and will provoke various emotions. Final Score: 8.1/10",
            "review_date": "2016-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The one notorious scene in the food bank is as devastating as you've been told but... its whole reputation pretty much hinges on that scene.  Otherwise it's decently performed and directed, but the writing veers between hackneyed and appalling.  This isn't a film, it's a polemic that makes no attempt at subtlety and doesn't shy away from cliché.",
            "review_date": "2016-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film.  Bring us the reality of how life is for some people",
            "review_date": "2016-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nearly 3 and a half stars.",
            "review_date": "2016-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"I, Daniel Blake\" is a great example of realistic, human movie-making. It never feels forced, instead succeeds in moving the viewer with the totally believable acting and dialogue. I even right now feel bad about calling this \"totally believable\" - because every second of this film rings absolutely TRUE. Unadorned, straight-to-the-point, heartbreaking and relatable, \"I, Daniel Blake\" never resorts to clichéd sentimentalisms but stays focused on its subject matter.",
            "review_date": "2016-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outstanding British movie",
            "review_date": "2016-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Far and away the best and most important film of recent times, this depicts life in the first world, when you are put into the welfare machine, and if it spits you out you will be on the street. It is about human dignity, and how we are degraded, both those of us who have nothing, and the ones who put them there. Nor need you worry about whether you'll be entertained. Dan and his friends are good to watch; they are interesting, funny and sympathetic, and they have the wonderful quality of self respect; their opponents are tragic and all too realistic. The film is a first class product, flawlessly put together and acted, and directed by the master Loach with flowing, consummate ease.  Calling it the greatest film means that I would confidently put it up against any other including those I haven't seen.  Forget your news feed and watch this, otherwise your FOMO will become reality, because this is about the main game.",
            "review_date": "2016-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film evoked emotions such as \"it just makes my blood boil\".  The film addresses a very real social problem which is sadly not unique to Britain.  It made me very angry, more compassionate and more grateful for what I do have.  The film shows how through no fault of their own, hard working people can fall so very low and do not get a leg up from the government but get kicked in the face instead.  An intelligent and emotive film.  Hailey Squires' on screen children needed to have the same dialect as the on screen Mum Katie.  It was a really obvious let down that they sound nothing like Katie even though we are told they lived in London together for years.",
            "review_date": "2016-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent, important film. Very realistic, well researched, honest, and relatable. Everyone should see this film, and it will certainly make some watchers feel like writing a certain graffiti phrase on certain walls...",
            "review_date": "2016-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ken Loach is well-known for his gritty portrayal of the struggles of everyday life in England. In this film he takes aim at the faceless bureaucratic machine that works to grind people into endless loops of confusion, poverty, and despair. This is modern England with its mean, technocratic, dehumanising of people in need. Australia, take note, we are most of the way there. Must see.",
            "review_date": "2016-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must see film. This is modern England. Australia take note.",
            "review_date": "2016-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A harrowing tale that is so relevant in today's world.",
            "review_date": "2016-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Centered on a proud protagonist struggling with the revolting indifference of a state that doesn't care about those in need, this bleak and depressing film is also quite touching when showing the generosity of people even under horrible circumstances of poverty and despair.",
            "review_date": "2016-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At the end of this movie, our French audience sat frozen in their seats. This was a picture of Britain in the 21st century that the UK government would like to pretend does not exist. If they want to discourage immigration, they should arrange for free showings at the Channel ports.",
            "review_date": "2016-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought I had to see this film with it being a Ken Loach film and a Palme d'or winner at the Cannes Film Festival.\nThe film focuses on the story of a Geordie joiner who has had a heart attack and is struggling to obtain Employment & Support Allowance in the UK.\nHe goes through virtual circles filling e-forms in, on hold on frustrating call centre lines and making visits to the Department of Work & Pensions Offices in Newcastle.\nThe main character, Daniel Blake is played by comedian Dave Johns but the subject matter is hardly comedic. \nBlake makes friends with a young London single mother with her own problems feeding her children and surviving with the help of a food bank.\nThe food bank provides one of the most moving scenes in the film.\nI was left frustrated by Loach's overt party politics at times. In one scene Blake protests outside the DWP offices and daubs the building in graffiti whilst shouting obscenities about a Conservative politician.\nThe ending although again moving is entirely predictable.\nLoach is 80 or so so I should cut him some slack but this film is nowhere near as good as Kes (1969) which doesn't show his political beliefs so starkly.\nThe film follows the template of many Ken Loach films being shot on location in a northern city using comedians and television actors. (Michael from I'm Alan Partridge makes a brief appearance).",
            "review_date": "2016-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strong portrait of a man, who is losing everything. Loach's criticism of the british social system moves anybody and is full of humanity and empathy. An important movie at times where the social safety net is under fire.",
            "review_date": "2016-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a bit heavy handed in places and some of the depictions feel like caricatures. Overall though, Loach does a good job of displaying the absolute misery the conservative government inflicts on honest people, as they continue to implement polices that increase the wealth gap and show contempt for citizens at the bottom end of the scale.",
            "review_date": "2016-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A harrowing (but sometimes humorous), moving story of how people are battered down by bureaucratic stupidity when dealing with people they are supposed to help. The acting is superb and natural. Dave Johns (Daniel Blake) is just right for this role and Haley Squires (Katie) gives a genuine, achingly good performance as a single mother desperate to survive and care for her daughter. Watch out for a heart-rending food bank scene. If you know anything about government services for the unemployed, you will watch this with a deep sense of recognition. It's a simple, but very powerful movie.",
            "review_date": "2016-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good subject matter, poorly executed. Some great acting, but unfortunately not from the lead. Could have benefited greatly from a structured script and less improv.",
            "review_date": "2016-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a heartbreaking film, watch out especially for the food bank scene",
            "review_date": "2016-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant\nHaven't laughed and cried real tears at the cinema for a long time",
            "review_date": "2016-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must see film of 2016. Loach perfectly demonstrates the difficulties that lots of brits are currently facing, and how it deteriorates their quality of life. A few laughs and a few colloquialisms that I understand, being a geordie myself  Amazing film but very hard to watch.",
            "review_date": "2016-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harrowing - reminds me of 12 years a slave coz everyone should see this film",
            "review_date": "2016-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Deeply moving.\nCertain kafka-esque moments are surprisingly funny, Daniel is witty and makes you laugh despite everything, which makes the overall effect even more powerful. Great film!",
            "review_date": "2016-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My first Ken Loach film? Heartbreaking story. Well-acted.",
            "review_date": "2016-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As I have come to expect from director, Ken Loach, this film is utterly wonderful. I was born before the UK had a publicly owned  NHS, or Welfare Benefits system. Those were not good times for disadvantaged people, and it has been devastating watching those bad times returning.  I Daniel Blake, is an excellent microcosm of how this country is sliding backwards. All the actors were superb. Top marks!",
            "review_date": "2016-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honest, sincere, amateurish yet powerful. This is a 'Cathy Come Home' for the cyber-generation. I would implore that those in positions of power, the well off and the middle class in general watch this film to see how the system can treat those that find themselves in need of help through no fault of their own.",
            "review_date": "2016-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you can't cry and laugh you have bits missing, the film is unmissable, leave the cinema shaking, sad, angry and determined to make a difference\nHowever small, just do it, after watching the film",
            "review_date": "2016-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was a very interning story and you feel for the people in it.  it shows how frustrating things can be.",
            "review_date": "2016-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most touching films I've seen in quite some time.  Ken Loach is truly a master of presenting the harsh realities of everyday life.",
            "review_date": "2016-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sobering and profound throughout",
            "review_date": "2016-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All the more powerful for being so low-key, it's finely played characters treat each other with the humanity and commonsense so devastatingly absent from the system that ruins their lives. One of Loach's finest achievements.",
            "review_date": "2016-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4/5. Cruel, raw, rough yet sensitive. Ken Loach comes back with a Palme d'Or winning film, ten years after 'The Wind that Shakes the Barley', pointing his finger to the infamous British providence system. Realistic almost to the extreme, it has and will cause discontent.",
            "review_date": "2016-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kind heartedness and general common sense against the social realism of the benefit system.",
            "review_date": "2016-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OMG Dave from the comedy club in Newcastle made me cry amazing film...  Go and see it...  Now",
            "review_date": "2016-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful film.  Brilliantly acted.  I wonder if Damien Green will watch it ??",
            "review_date": "2016-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I, Daniel Blake does a competent enough job of describing the cruelty and inhumanity to which benefit claimants are often subjected. Instead of trying to ask questions thorn merely wallows in its own giddying righteous anger. Loach's characters have no depth or nuance whatsoever, so the JobCentre staff are largely panto villains and the working classes all noble lions - even the pimp. The worst part came near the end when a character literally entered stage right, proceeded to say exactly what the plot had been and what we were all supposed to infer from it and then exited, stage left. It was like being asked stay back for detention to write out \"Tories Are Bad\" 100 times.",
            "review_date": "2016-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very moving and relevant story, highlighting the heartless way in which people get treated today when, through no fault of their own, they fall on hard times.",
            "review_date": "2016-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hearing this win the Palme D'Or at Cannes this year definitely peaked my interest. This was upsetting & heartbreaking. Cried of course. All the actors were great. It was just a raw & real story. Even though I have never been in the positions that are happening in this movie, I could still relate cause I'm HUMAN. Reading reviews that this stuff is going on in Britain right now breaks my heart. I'm sure stuff like this happens over here too. I will say it got a little slow at some points & their accents sometimes made it a little hard for me to know exactly what they were talking about. But still able to follow. That food bank scene absolutely broke my heart & has stayed with me. Also loved the statements at the end. Where is the humanity? If you can see this, I recommend you should",
            "review_date": "2016-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely stunning and true reflection of what is happening to our most vulnerable neighbors in our community shame on dwp",
            "review_date": "2016-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It made me angry, it made me cry, it made me laugh and then made me cry again. Everyone should see this film. Moving and provoking, it illustrates very well the horrendous cruelty of the Tory cuts and the misery they have inflicted on the most vulnerable members of our society.",
            "review_date": "2016-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent film ?? \n\nWell worth its money ?? \n\nMade me cry ?? coz that's how bad the system is, we are not dogs we are human beings\n\nStop calling it a jobcentre when you don't give people a job!!! Period.",
            "review_date": "2016-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "heart-breaking movie, about real people and real problems in a wealthy country that UK is.... fantastic.",
            "review_date": "2016-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very hard hitting and relevant, a really upsetting drama about the reality of life on benefits. Makes a change to the poverty porn Channel 4 documentaries that almost glamorise life on benefits to stir up division and hate in our former working class (now welfare/working class) communities.",
            "review_date": "2016-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The latest Ken Loach film delivers, as one would expect, no matter where one stands on the political spectrum. The typically unfussy direction is effective. The script is tight, and with no pretence of balance for this is simply an emotionally powerful argument and indictment on an imperfect and often hostile social security system that finds some people falling through the gaps. Some of the plotting might seem a bit neat but it feels no less real and never stray too close into melodramatic contrivances. And as always, his film always makes the best of new or lesser known actors. Dave Johns and Hayley Squires are naturalistic and totally believable in their respective roles, and the latter gives a particularly heart-breaking performance. Tender and lighter moments keep the audience engaged when tackling a serious subject matter, even for those who might not agree with the film's point of view and in fact, makes you re-think about the issues at hand and therein lays its ultimate power.",
            "review_date": "2016-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film with terrific acting all round.",
            "review_date": "2016-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "powerful emotional film, reminder of how poor our benefit system is and about those who are let down by it",
            "review_date": "2016-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent cast, but patronising, simplistic, and hopelessly cliched, particularly the fate of the lead character. There are real people out there, but the film abused the nuances of character to promote a one-sided political dogma. I am sure that many of those who see the film will strongly disagree with me. I do however fully endorse the final statements in the film. We are all citizens and deserve to be treated with respect, and as individuals, but those noble aims are best not delivered from a one- directional soapbox.",
            "review_date": "2016-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very fine film showing the bureaucratic operations of the British Welfare System - DWP - Dept. of Work & Pensions. Fine acting by Dave Johns as the carpenter seeking disability payments after a heart attack, and Hayley Squires as the single parent seeking affordable accommodation for herself & her 2 children. The scene in the Food Bank with a starving woman is taken from real life. Having worked in the welfare area for over 20 years, this is the most authentic portrayal of real life, that you will ever see on screen. Brilliant. Must See.",
            "review_date": "2016-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So real. So sad it's so true.",
            "review_date": "2016-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good little film. Strong story. Gets you thinking about those struggling on the DSP.",
            "review_date": "2016-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gritty, truthful and real. Not a dry eye in the house.",
            "review_date": "2016-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A modern day horror story of life in England for so many under David Cameron and now Teresa May's Tory governments. If you voted conservative, or indeed anyone other than labour,  i hope you felt ashamed of yourself watching this. Open your eyes and stop listening to our incredibly biased main stream media! Don't buy the sun, telegraph, mail - they want to keep us, the 99% , divided so the rich 1% can become richer! thank the heavens for decent caring people like Ken Loach ??",
            "review_date": "2016-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More gritty social realism from Ken Loach. Researched and scripted by long time collaborator Paul Laverty. The food bank scene is one harrowing piece of cinema and although the film is predictable it still kicks you in the balls. With Brexit and the uncertainty around it, things could get even bleaker in the U.K. Let's hope Mr. Loach doesn't retire as he still has lots to say.",
            "review_date": "2016-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "if anybody thought there was a safety net of the welfare state this film would say that this has long been abolished and that vulnerable people end up with nothing.  a brilliant film",
            "review_date": "2016-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A devastatingly accurate picture of modern Britain",
            "review_date": "2016-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptional film!  You don't even think of the characters as being played by actors.  It has such a slice of life feel to it.  The pace might not be for everyone but it eventually quickens and overall, it is just perfect.  Go see it!!",
            "review_date": "2016-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tough watch, heart warming in places and gut wrenching in others.  Excellent performance from the cast (Dan and Katie), in what is a very thought provoking film.",
            "review_date": "2016-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More of a party political broadcast than an entertainment movie. If you wear ethnic peace jumpers and like to spend your weekends at Socialist Worker rallies then you'll probably like it. If you're looking for a movie with character development, plot twists and didn't vote for Jeremy Corbyn then perhaps you should give it a miss.",
            "review_date": "2016-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "if you go to the flicks once this year go and see this, it's a harrowing journey but real and genuine and a true reflection on how this world is for some people. immensely powerful and brilliant.",
            "review_date": "2016-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic overview of a one size fits all approach to benefit claimants in 21st century UK.  Emphasis placed on the \"Robotic\" processes claimants are forced to follow.",
            "review_date": "2016-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well acted and crafted. Extremely full on and sad. But there is a message, and even though harsh, being a UK resident you actually relate and physically feel the pain,frustration and anguish!",
            "review_date": "2016-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Directed by Ken Loach, I, Daniel Blake tells the story of Daniel (Dave Johns) and his struggle with the welfare system after being denied incapacity benefit.  On his first visit to the Job Centre he encounters, Katie (Hayley Squires) a single mum who has had a sanction placed on her after missing an appointment thus leaving almost penniless. \n\nI, Daniel Blake is an emotional, thought proving commentary of the welfare system with plenty of heart and humour.  If you've ever had to deal with the benefit system you'll relate to the character's plight and how farcical the system is.\n\nAs usual, Ken Loach add his usual dose of realism to the film with the inclusion of the general public as roles in the film which adds a togetherness aspect to the film.",
            "review_date": "2016-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most important films in decades. It's so important that people watch this and understand just how realistically it depicts the desperate lives of the poor in our \"forward-thinking\" country. This film ought to be a call to action for the poor and the disillusioned to stand up to the disgraceful governments who are grinding us into the dust, while simultaneously blaming us for this dire situation.",
            "review_date": "2016-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another exercise in tendentious, sentimental socialism from Loach. Press reviews had lead me to believe that this was not the kind of disingenuous agitprop that we have come to expect from this director  - so I was doubly disappointed. The plot is predictable, but the cast are good.",
            "review_date": "2016-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loach's tribute to the unsung hero is deeply saddening, and carries its powerful message of socialism home with the audience.",
            "review_date": "2016-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a film I don't see how 'I, Daniel Black' could be bettered. But then, it's much more than just another film. It's intended to, and should, be part of a debate about what is happening in this country, about how institutions that were set up to help people have been turned against them and how citizens are being turned into serfs. It made me feel very angry. If my blood didn't boil, it was at least simmering throughout. But the inhumanity of the system was balanced by the the affectionate portrayal of the human relationships between the central characters. It's important for everyone to watch this, and talk about it, and understand the reality it relates to and do something, whether small or large, to change that reality.",
            "review_date": "2016-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Liked it a lot. Reminded me of Land and Freedom. Same silence in the cinema at the end. Interesting looking at the critics reviews. Mostly four or five starts except from the Spanish papers who do rather seem to have a bee in their sombrero.",
            "review_date": "2016-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A hard watch, but a must-see",
            "review_date": "2016-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The WORST film I've ever seen in cinema, it was so very boring - felt very one dimensional and although I could relate to the characters, it wasn't enough to draw me in. \nIf I wanted to see people struggling, all I have to do is go in to my local town centre and sit in the high street and I wouldn't have to pay £10 for the privilege. This is not a revolutionary piece as it is being pedalled as in the media. It is a mediocre, at best, piece of film that will not have the impact it was intended or is expected to have.",
            "review_date": "2016-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "British director Ken Loach offers up his new film I, Daniel Blake which is a masterclass of storytelling on life in poverty in a grim Newcastle setting. But don't let that put you off. The film does not feel sorry for itself nor pretentiously tries to tug at your heartstrings. It serves up a realistic endearing story of the platonic friendship of Daniel Blake and Katie, a single Londoner mother of two children from two different fathers. The chance meeting of the two in an unemployment centre focuses on how difficult and flawed the social security benefits system is along with the callous patronising  jobsworths that work in them. People do laugh even when times are hard and from the very start of this film you'll be in stitches. The story of the human condition resonates clearly and it's hard not to love alongside strong performances from the entire cast. The film won the Palme D'or award at this years Cannes and rightly so. Not sure about the Oscars but this most certainly has thrown down the gauntlet as a strong contender for Best British film at the BAFTA's. My rating: 5 out of 5. Solid.",
            "review_date": "2016-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ken Loach is a name I always recognise but then struggle to remember any of his work. I think, \"ah good, it's by Ken Loach\" and then \"what's he done again? Oh Kes!\" But Kes was 47 years ago and shamefully, I'm not familiar with any of his films since then. One conclusion from this realisation is that Loach has a strong reputation as a filmmaker and this was my long awaited reunion. \n\nWe follow Daniel Blake, a middle-aged carpenter who's taken a few recent knocks, one of which is suffering a heart-attack and deemed not able to return to work. It's a position no one would want to be in, forced to sacrifice your own health or lose everything you have worked so hard for. \n\nWe witness the hurdles that seem purposely put there to hinder payments, speaking from personal experience I can relate to this situation to a degree. How are people such as Daniel Blake suppose to survive, or better still, have a good life they are suppose to be able to live. \n\nIt's a harsh reality on how parts of the British system fails it's people and proof that there's no real incentive to do things by the book. Having been in a similar situation myself, skirting the unemployment line getting advise from people who have no ambitious or understanding of what I wanted to do. \n\nTaking this on a more personal level, I quit a stressful position last year in the hopes of pursuing my own dream of being an artist and writer. Having to sign agreement that I would spend a number of hours trying to find work and having to provide evidence of doing so each fortnight would grant me the universal credit that I never actually received. I actually had a good case worker, as everyplace of work has good people, but equally there are those that can't see beyond, much like what is portrayed in this story. Though, instead of supporting me in trying to be something I both enjoy and apparently good at, they attempted to find me similar stressful jobs that I left for my own sanity, wanting to place me back amongst the wolves. \n\nDave Johns is exceptional as Daniel Blake, emitting the boiling frustrations of the soul-destroying turn of events, right to the very end. Hayley Squires' Katie is short of brilliant too, displaying the tremendous pressure when faced with these kind of tribulations. Though, the acting from the rest of the supporting cast is less desirable, it's forgivable. \n\nIt's a raw, honest and emotional look at the suffering and poor way of life some unfortunate people have to contend with in Great Britain. It's compelling, invoking and upsetting, showing the great lengths and risks people go through in order to maintain their self dignity. It's certainly a film that boasts Loach's credibility. \n\nRunning Time: 8\nThe Cast: 7\nPerformance: 7\nDirection: 7\nStory: 8\nScript: 8\nCreativity: 8\nSoundtrack: 6\nJob Description: 10\nThe Extra Bonus Points: 10 for the difficult subject matter and perfect portrayal. \nWould I buy the Bluray?: yes \n\n79% 8/10\n\nwww.spoileralertreviews.co.uk",
            "review_date": "2016-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this film. Powerful performances by Hayley Squires and Dave Johns. Where have these two been ? Take some tissues",
            "review_date": "2016-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most powerful film I've ever seen. It clearly points out what is wrong with this country (UK). It's a must see.",
            "review_date": "2016-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Moving, gripping, emotional and engaging - it has a detachment that makes it feel like a documentary and therefore very real.",
            "review_date": "2016-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a film that everyone should see. It is not easy viewing but the 2 central performances are so naturalistic that you sometimes think you are watching a documentary. But in some ways this film is stronger than any documentary as it shows with brutal honesty the almost Kafkaesque nature of the modern benefits system designed to dehumanise claimants.",
            "review_date": "2016-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Have you ever been tangled up in bureaucracy?  Yeah.  This was inspired by austerity in the U.K.",
            "review_date": "2016-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heart throbbing film and close to home worth the watch",
            "review_date": "2016-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite confronting and depressing to see how the UK job centre system treat the unemployed needing help. Shame on the British bureaucrats! This is more of a documentary and definitely not an entertaining night out.",
            "review_date": "2016-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fantastic film which sums up the state of this country today. Sadly familiar for those who have to sign on.",
            "review_date": "2016-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I gave this 45 minutes before I walked out of the cinema.",
            "review_date": "2016-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has a lot of plot holes (couldnt he just ask for help with all the online things? - when he did ask, he was helped etc) and that makes it seem illogical at times. Oh, and this is not a depiction of a hard life. This is a depiction of a guy that handles his not-easy but not bad life in a very bad way.",
            "review_date": "2016-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A little tamer than usual from Ken Loach, but still packs a punch in its scarily accurate portrayal of the benefits system in David Cameron's Britain. Some great performances by its 2 unknown stars, but the story is sometimes predictable/worst case scenario in order to deliver the blows that a Ken Loach film requires. Still well worth a watch though.",
            "review_date": "2016-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brutal betrayal by the state.",
            "review_date": "2016-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An emotionally tense, funny, yet sorrowful film. It has specific messages as well as more abstract ones while making this an all around great story. The problems the characters are experiencing are so frustrating and unbelievable making it more realistic with its human connection.",
            "review_date": "2016-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A potent and moving drama about a quietly remarkable man. Another gem from Ken Loach.",
            "review_date": "2016-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fully deserving of the Palm D'Or.  I laughed, I cried. Truly a special film that shows the humanity of this struggling by.",
            "review_date": "2016-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully portrayed life of two very different groups of people united once when rejected by those meant to help,  and then a second time in tragedy. Every minute of the film is captivating, with simply amazing performances by the 2 adult and a child protagonists! Guaranteed to be an eye opener.",
            "review_date": "2016-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a sad , true  reflection and heartbreaking tale of life in not so Great Britain",
            "review_date": "2016-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty bleak at times but with some great humour thrown in. I agree that everyone should watch this in the current climate. The scene at the food bank was particularly disturbing.",
            "review_date": "2016-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everyone involved in Ken Loach's @idanielblake should be proud of a superb & important film, especially Dave John & Hayley Squires",
            "review_date": "2016-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everybody should see this film, including our politicians.  We should remove the \"Great\" from GB.",
            "review_date": "2016-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's been a lot of tv shows recently about benefits and the way that the system is cheated by the not-so-needy. This film however shows the flip-side of the coin. How hard it can be for good honest people to get the help they need and the hoops they have to jump through just to put food on the table. Quite emotional and heart wrenching at times. 8/10",
            "review_date": "2016-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This better get a Best Picture nomination at the Oscars. One of the best of the year, sad but still with classic British humour.",
            "review_date": "2016-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worthy of its Palme D'or victory, Ken Loach's latest social commentary drama raises some important issues with the aid of its realistic characters.",
            "review_date": "2016-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ken Loach at his best. Take tissues.",
            "review_date": "2016-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful stuff from Loach....",
            "review_date": "2016-05-13",
            "source": "rt",
            "lang": "en"
        }
    ]
}