{
    "rating": 8.6,
    "release_date": "2017-09-22",
    "num_reviews": 371,
    "genres": [
        "History",
        "Drama",
        "Biography",
        "Animation"
    ],
    "summary": "Mystery surrounds the death of famed painter Vincent van Gogh in 1890 France.",
    "reviews": [
        {
            "content": "It leaves to us the audience, who always knew Vincent van Gogh was a brilliant Artist, all the reasons why his art and his life can effortlessly pierce through our souls. The film really did stick to that and I personally appreciated it so much! Also, I felt the dedication of many oil painters, actors and personnel on this film. Just imagining it makes me speechless. Five (5) starry, starry night stars!!!",
            "review_date": "2023-03-29",
            "source": "rt"
        },
        {
            "content": "a unique and wonderful moment of evation",
            "review_date": "2023-02-20",
            "source": "rt"
        },
        {
            "content": "The story here is placed in the backseat while the delicate, reverent and technical hand-drawn wizardry is at the wheel. One of the finest tributes ever made for Van Gogh's life and possibly the most beautifully animated feature film that isn't an anime.",
            "review_date": "2022-12-28",
            "source": "rt"
        },
        {
            "content": "A charming experimental film but the plot was a little overblown.",
            "review_date": "2022-12-21",
            "source": "rt"
        },
        {
            "content": "The story shifts and turns with too much confusion for a proper biopic but that hardly matters when paired with such an achievement in animation.",
            "review_date": "2022-11-06",
            "source": "rt"
        },
        {
            "content": "A languid plot taking its time examining and thus creating small stylized portraits of the characters along the way, in a masterful and beautiful love letter to (one of, if not) the greatest painter who ever lived.\n\nEvery frame, a masterpiece. Literally.",
            "review_date": "2022-10-21",
            "source": "rt"
        },
        {
            "content": "This is an extraordinary film - the painting style animation looks visually amazing and the story is compelling, although, inevitably, sad. I found the various characters intriguing and I found it a very watchable film. I believe it took many years to make, due to the traditional paint based animation and it shows. I felt like I could see the emotion in the various characters eyes, with hints of teardrops appearing in the corners of their eyes and the like.\n\nI am quite a big fan of animation, have always been since a child, so this film had appealed to me for a long time and I honestly can't say it disappointed. I was both interested to see it in terms of the painting work used to create it but also in terms of being interested in the story of the troubled person who was Vincent Van Gogh and this film certainly taught me more about him. I was aware of his time spent in Arles, in France, having visited the area a few summers ago and this place features in the film, so I found it very interesting, with good voice work from the cast, including Josh Burdett, Holly Earl, John Sessions, Helen McCrory and Chris O'Dowd.\n\nEven if your not especially keen on Van Gogh, I would still recommend it as a different type of film from 'regular' CGI based animation or the like. However, I should probably point out that this is rated 12 in the UK due to the theme of mental illness being inevitably present but also there was a scene depicting a prostitute with a customer and the infamous gifting of Vincents cut ear is also depicted, so I wouldn't recommend it be shown to pre-teens certainly.",
            "review_date": "2022-09-01",
            "source": "rt"
        },
        {
            "content": "Sonic is a movie movie star film movie",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "lindo do começo ao fim e feito com amor.",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "Creativity at it's finest! Never before have I seen such a bold and brilliant concept brought to life on the screen like this. Loving Vincent is truly a unique and special movie that should serve as an example of innovation and creativity to all aspiring animators. On surface level, the movie explores the life and mysterious death of Vincent Van Gogh, but on a deeper level the movie entails themes of the artist's struggle, legacy, death, human connection, and perhaps more importantly what it means to live. These themes and messages are all the more well impacted by the oil painted world we see. The level of hardworking and passion put into this film is truly inspiring and obvious. Loving Vincent is an achievement and celebrated not only one of history's greatest and most complex painters but also a celebration of all forms of art itself whether that be actual art, music, film, acting, etc. it has it all.  A truly beautiful and unique film.",
            "review_date": "2022-03-05",
            "source": "rt"
        },
        {
            "content": "\"Loving Vincent\" is properly named for it is a work of utter love, even if, in my humble opinion, it falls short of being a masterpiece of cinematography.",
            "review_date": "2022-01-17",
            "source": "rt"
        },
        {
            "content": "The Story of Vincent Van Gogh always needs to be told! a mystified Character whose  story was told so incredibly in this movie. Especially in this Tantalizing way of storytelling- it's Gorgeous and Visually Captivating. The writing in this movie was great and overall the acting and delivery of this movie is to be noted! A must See!",
            "review_date": "2021-12-14",
            "source": "rt"
        },
        {
            "content": "From my Point of View:\n\nPlus \nOriginal \nIntriguing story\nGives you insights on Vincent Van Gogh's life\nCelebrates the work of this artist\n\nMinus\nCan't think of one \n\n\nInteresting \nI wonder how this film will inspire other filmmakers to celebrate the work of other artists?\nI wonder if Vincent Van Gogh would approve of this film?\nI wonder if this film made his paintings more expensive?\n \nChris",
            "review_date": "2021-10-31",
            "source": "rt"
        },
        {
            "content": "A Master Art in a Masterpiece, Loving Vincent is really something different, something that me or the world never seen before, a movie and a painting that have a heart, have a soul, and have a power, Loving Vincent is flawlessly well done, i highly recommended.",
            "review_date": "2021-06-11",
            "source": "rt"
        },
        {
            "content": "Such effort put into a movie inevitably reflect the true amount of devotion and care for Vincent, and not only are the frames beautifully illustrated, the story is interesting and fits the theme of the painter.",
            "review_date": "2021-04-05",
            "source": "rt"
        },
        {
            "content": "No movie honors Vincent like this one, capturing the true beauty and emotional depth of him and his world. Stunning and moving.",
            "review_date": "2021-03-01",
            "source": "rt"
        },
        {
            "content": "A super movie. A beautiful movie with tremendous animation. Great dialogue and story. Top quality movie.  A super Van Gogh movie.",
            "review_date": "2021-02-15",
            "source": "rt"
        },
        {
            "content": "Wonderful new concept to see a legend brought to life through his life works of paintings along with the suspicious circumstances surrounding his death",
            "review_date": "2021-02-01",
            "source": "rt"
        },
        {
            "content": "It will feel like a novelty to start and then once the movie gets going you are drawn in and enthralled; remarkable performances",
            "review_date": "2020-12-30",
            "source": "rt"
        },
        {
            "content": "The whole experience is so magnificent, to imagine such detail in each frames that is drawn by an artist is mindblowing. But don't wait for the plot.",
            "review_date": "2020-12-29",
            "source": "rt"
        },
        {
            "content": "Real Cinematic Art\nCinema has always been a gloried artwork and we have much more authentic proof in astounding Loving Vincent.\n\nAn animated construction entirely brought to life by oil paintings, is quintessential proof that cinema has still barely scratched the surface of its reaches. Loving Vincent is landmark event for animation and even biographical storytelling through its majestic vision at the last days of Vincent Van Gogh.\n\nSet a after the death of fabled painter, Armand Roulin (Douglas Booth) is possessed with a letter from Van Gogh to his brother Theo before his death, and begins the journey to deliver it. While on call, Roulin encounters all the people close to Vincent before is death gradually trying to put the pieces of what cause his sudden suicide. From this we are taken back to key moments of Van Gogh's life mesmerizingly displayed through the living oil paintings.\n\nGenerated by 65,000 paintings by over a 100 artist, Loving Vincent is living work of art. First shot as a live action depiction then adapted into paintings, the immersive gallery of scenes is a first in new format of animation. Directors: Dorota Kobiela, and Hugh Welchman take Van Gogh's own artistry into his own biography (almost), from Citizen Kane style narrative, assessing and celebrating the life of one of the worlds if not the most famous painter. From this production becomes transporting cinema experience into the world of Van Gogh and an enchanting watch of magnificent painting and animation.\n\nOf course what is the fundamental strength of Loving Vincent is its captivating artwork which for every moment is spectacular, and then you have the real narrative of Van Gogh's last days which on its own is an affectionate journey. Even if you don't not much about the life of Van Gogh this is an enthralling experience.\n\nThe monumental presence of the paintings is consistently exceptional with wonderful detail and creation put into it. One of the sensational efforts for the film is its sketch of the real actors, making them instantly recognisable on screen, bringing their performance into the art. Although our eyes are set on visual presence, Clint Mansell's score is also a tear-jerking atmosphere throughout the film, capturing the melancholy as well as joy of Van Gogh.\n\nLoving Vincent is a visual sensation, proving the amazing talent that animation brings to the screen. This is by far one of the most significant films of the year and is must see experience, especially for art students.",
            "review_date": "2020-12-16",
            "source": "rt"
        },
        {
            "content": "One of the most beautiful animated films I've seen. The artistic side of it is amazing\nBeautiful, sad and unforgettable.",
            "review_date": "2020-11-15",
            "source": "rt"
        },
        {
            "content": "One of the most beautiful animated films I've seen in my life. Gorgeous and meaningful. The artistic side of it blowned my mind. ",
            "review_date": "2020-11-13",
            "source": "rt"
        },
        {
            "content": "Sad, beautiful, unforgettable.",
            "review_date": "2020-11-10",
            "source": "rt"
        },
        {
            "content": "A lot of liberties taken with the plot (bits from here and there), but they do hold together since they are based on recorded fact. For viewers already familiar with the life and work of Vincent van Gogh, the movie and portrayals don't force them to stretch their imaginations—only their love van Gogh and his work; and to yield themselves to the mysteries of human passion, suffering, and exaltation. The same happens, surely, for those for whom this movie is an introduction to an iconic life and body of work. The actors—and the film's director—don't overwhelm; they harmonize to build a life and to lay bare one man's genius. A credible and engrossing film.",
            "review_date": "2020-08-30",
            "source": "rt"
        },
        {
            "content": "The film has a good development and brings several works by the artist in an indirect way, also\nshowing the different views of how people saw and treated him, making the viewer question\nwhether the versions told are really true. Armand ends up developing interest in Van Gogh in the\nstory, which ends up arresting and causing those who watch it to also get caught up in the feature\nfilm in order to discover the truth and the whole unfolding of the plot.\nWe can emphasize that all scenes were hand painted by several artists, which gives a completely\ndifferent aspect to the other films, because it is a work in stop motion, the animation is not so fluid,\nbut this is not necessarily a bad aspect On the contrary, it ends up giving a striking and unique\nvisual aspect due to the brushstrokes of each frame.",
            "review_date": "2020-08-25",
            "source": "rt"
        },
        {
            "content": "This movie was a really enjoyable experience. If you really like Vincent Van Gogh, you must see it. The production of this is amazing.",
            "review_date": "2020-07-31",
            "source": "rt"
        },
        {
            "content": "Incredible production, beautiful story.",
            "review_date": "2020-07-18",
            "source": "rt"
        },
        {
            "content": "A movie like this will never be made again. A must-see for the visual spectacle of it all",
            "review_date": "2020-07-13",
            "source": "rt"
        },
        {
            "content": "Amazing movie!, with just the music score this movie is a masterpiece for me, a masterpiece that with every frame is a breathtaker.",
            "review_date": "2020-06-24",
            "source": "rt"
        },
        {
            "content": "Okay, I have a soft spot for Loving Vincent.\nWhatever your opinions towards this film may be, one cannot deny that the work of 125 artists over 6 years has made this movie a landmark in the history of cinema. Every scene of the movie is beautiful and it delivers everything that the people expected it to in the artistic aspect. There is so much going on in each frame that you might often ignore the plot and appreciate the beauty of this one. The story is still very strong for me, it's not one detective story where we find the cause of death of Van Gogh. I believe we all play Armand, the lead character, trying to find the cause of his death. We're told the story of Vincent through people, through their memories, we see the different perception of people towards Vincent. While of course each one of us wants to find the cause of death, we soon realize the futility of doing so. Numerous people might not like the story but the film represents the legacy of Van Gogh left behind in his paintings and in people, in their time with Vincent. It's about how legacies survive long, long after the person dies and how even a self-hating painter believed that his legacy would also survive.",
            "review_date": "2020-06-01",
            "source": "rt"
        },
        {
            "content": "Beautiful magnificent piece of art is this movie!!! ",
            "review_date": "2020-04-30",
            "source": "rt"
        },
        {
            "content": "Loving Vincent is one of the best animated movies of all time, I don't have to much to say about this movie, is just beautifull; the animation is great, I love the writing and after all, it is a pretty good movie in every aspect posible, this is the type of movie why the oscars best animated feature category exist, it exists to this Beautifull animatoi and to this original storys, if you disagre with me it is fine, I give Loving Vincent a 10 out of 10",
            "review_date": "2020-04-28",
            "source": "rt"
        },
        {
            "content": "An impressive achievement in animation, that makes this film worth watching, although the narrative isn't that much attractive.",
            "review_date": "2020-04-22",
            "source": "rt"
        },
        {
            "content": "Amazingly done!!! The storytelling could be better, clearly the  budget went into the visual part of this unique movie.",
            "review_date": "2020-04-12",
            "source": "rt"
        },
        {
            "content": "If you’re watching this then you probably know what you’re getting into - a first of its kind film where every frame was made into an oil painting. The artwork astounds and fully meets expectations, more than making up for the slow pace and less than impactful story. A beautiful work that is a must-see for any fan of film, art, or film/art history.",
            "review_date": "2020-04-08",
            "source": "rt"
        },
        {
            "content": "Staggeringly beautiful, and an important piece of history re-examined.",
            "review_date": "2020-04-06",
            "source": "rt"
        },
        {
            "content": "The compositional style of the film is something totally innovative, it made me immerse myself in the impressionistic lines of vincent's paintings",
            "review_date": "2020-03-30",
            "source": "rt"
        },
        {
            "content": "Beautifully done! Absolutely unique, not what I expected, it was a lot better! A must see for the incredible artistry.",
            "review_date": "2020-03-18",
            "source": "rt"
        },
        {
            "content": "Animation has always been an incredibly peculiar way of telling stories, and this is shown in a real way in the film. The dedicated work of production, direction and artists results in a unique experience, where history (however plastered it may be) moves us when talking about legacy and personality, while showing us a curious and very well elaborated cinematography.",
            "review_date": "2020-01-25",
            "source": "rt"
        },
        {
            "content": "An amazing film, with beautiful animation. I didn't exactly love the story, but it's still a good one.",
            "review_date": "2020-01-15",
            "source": "rt"
        },
        {
            "content": "While this movie's plot and dialogue are a bit too basic and sentimental for my taste, the visuals make this something that everyone should check out, even if only for a few minutes just to say that you watched it.",
            "review_date": "2020-01-03",
            "source": "rt"
        },
        {
            "content": "At the begining I was very interested of such way of showing some movies, but than I saw what kind of theme is taking on and I was a little afraid. Very first time I was in such mistake if it comes to my opinion about movies first impression.\nLoving Vincent is a film, wchih will give you will think about your neighbour, some random person you will meet on your way, every sould that might ever look at you or even not! \nIf you are sensitive enought you can see something very intense about Vincecnt who was trying to express himself not only while his life but also when he was gone, that's why we, as the watchers are trying to understand him not only by his paintings but also his letters and way of thinking.",
            "review_date": "2019-12-23",
            "source": "rt"
        },
        {
            "content": "A groundbreaking movie that puts the story of Vincent Van Gogh to life. The entire plot comes together well, focuses on the story of Van Gogh in a correct manner. Inspiring to anyone who sees them self as an artist.",
            "review_date": "2019-12-09",
            "source": "rt"
        },
        {
            "content": "Beautiful to look at, and a nice story, but a little bit lacking in emotion",
            "review_date": "2019-10-29",
            "source": "rt"
        },
        {
            "content": "Loving Vincent is more than a beautifully shot film; it is a film which tackles grief and sorrow and the search for answers where there are none. Wonderfully written and beautifully shot, Loving Vincent will almost certainly be considered one of the best films of the decade.",
            "review_date": "2019-10-07",
            "source": "rt"
        },
        {
            "content": "One of the most beautiful films I've ever seen. I cannot, for a second, think of one bad thing to say about this amazing cinematic achievement.  A must watch",
            "review_date": "2019-09-07",
            "source": "rt"
        },
        {
            "content": "Most Beautiful movie I've ever seen! ",
            "review_date": "2019-08-08",
            "source": "rt"
        },
        {
            "content": "Why did I finished Loving Vincent with a feeling that my ticket was overpaid? Guess that is what this kind of projects do to a animated-film junkie such as myself, you just present yourself as this revolutionary technical accomplishment passionate enough to deliver the life of this poor unfortunate soul of an artist, and I'm done: you got my rear sat to eagerly watch every bit of it. And you get that, along with straight-forward narration and some flashbacks here and there in a story that falls kinda short to the way the visuals try to appeal within you. I mean, I'm glad that I could get deeply into the life of this man from something so intimate as his technique, but... is that really it? Is the way the animation portrays documentary-esque facts really enough to feel Loving Vincent as a Van Gogh film?",
            "review_date": "2019-08-05",
            "source": "rt"
        },
        {
            "content": "The art is amazing, it was just completely made from oil paintings and its so beautiful. This is good for art lovers and artists. It brings inspiration and wisdom(?), there's only one thing that's lacking, it doesn't seem to be like a full movie? There are information that wasn't brought to light? Not entirely sure but it just felt like I had dinner and I didn't get full. It was lacking but overall it's definitely a good move.",
            "review_date": "2019-07-24",
            "source": "rt"
        },
        {
            "content": "Great movie that honors Vincent. ",
            "review_date": "2019-07-24",
            "source": "rt"
        },
        {
            "content": "Loving Vincent (2017): 7 out of 10: An art film in more ways than one, Loving Vincent is the tale of a postmaster's son asked by his father to deliver a letter from Vincent Van Gogh to his brother Theo. \n\nSoon this simple task becomes a journey into finding out why Vincent van Gogh committed suicide or even if he did. What we end up with is a Rashomon style story where everyone in the small provincial village where Vincent died has a different and often conflicting story. \n\nThe Good: Let's start with the six hundred pound oil painting in the room. Loving Vincent has a gimmick, and it is a doozy. Each frame (all 65,000 of them) are handpainted by a group of 120 painters. The actors are then animated and rotoscoped onto the oil paintings. \n\nNow I know rotoscoped is a scary word. We all remember Ralph Bakshi use of rotoscoping for his animated features Wizards (1977) and The Lord of the Rings (1978). Scary times indeed. Loving Vincent's technique, guided by a bigger budget and forty years of technology improvements, is spot on. \n\nThe settings and many of the characters are right out of Vincent Van Gogh's paintings, and scenes often start with a classic Van Gogh painting and then has the action seamlessly move on from there. Whether in movies or even video games such gimmicks often lose their effect after viewing for a while. While I certainly got used to the technique in Loving Vincent, it never became unnoticeable. \n\nThe Bad: Loving Vincent is a quiet tale that fails a task one can give biography. Would this story be interesting if it happened to someone not famous? The answer here is a solid no. The movie's story reminds one of a walking simulator video game rather than a film with our protagonist walking around chatting people up and then going into flashback cutscenes (Done in a different black and white sketch style like that Take on Me a-ha video). We get a decent picture of Vincent in his last days and the people around him, but the central mystery of whether he killed himself or whether someone else shot him doesn't seem pressing to the characters on the screen let alone the audience watching the film.\n\nAs good as the painting technique is I think it is a smidge of a shame that the film is shot in 4:3 full screen. I understand this is an artistic decision that matches the paintings, but I do wish there wasn't so much empty real estate on my television for such a beautiful film. \n\nThe Ugly: Look if you don't want to spend the coin getting the Don McLean rendition of Starry Starry Night, you should be able to find a better cover than the one that Lianne La Havas warbles at the end of this film. It isn't quite the Bahama Men ï¿ 1/2~s version of Crocodile Rock from Crocodile Hunter Collision Course but still. \n\nIn Conclusion: The fascinating part of Loving Vincent for me were the photos at the end of the real people in the movie. Not the actors mind you but the actual subjects.  Marguerite Gachet, the young nineteen-year-old girl at the center of the mystery, didn't die till 1949. We think of Vincent Van Gogh as being so long ago, but in reality, it wasn't. Like the old west in America, it is a time that is in the distant past but still within reach. Or to use the standard measurement. Vincent Van Gogh is to Back to the Future's Enchantment Under the Sea dance as the Enchantment Under the Sea dance is to us today.",
            "review_date": "2019-04-28",
            "source": "rt"
        },
        {
            "content": "It's amazing how they were able to create Loving Vincent using a series of oil paintings in the style of van Gogh. It's a shame that the movie doesn't quite live up to the medium it uses. Watching this film is like sitting in an art gallery: yes you're seeing beautiful things, but it also gets a little boring at times. I also recommend NOT watching this movie during a starry night, as the soothing music and quiet conversations may lull you to sleep.",
            "review_date": "2019-04-12",
            "source": "rt"
        },
        {
            "content": "Loving Vincent is very creative. Watching it is like walking into a Van Gogh painting, and seeing the world through his eyes. Watching this film is a worthwhile way to enjoy your popcorn.",
            "review_date": "2019-03-31",
            "source": "rt"
        },
        {
            "content": "A strange hybrid of impressive rotoscoped animation and deeply tedious narrative. At its best animation can be transcendent, but the makers of this boring investigation into Van Gogh's death seem content simply to film actors talking in wan voices and then pastiche the images in Van Gogh's swirling style. A real waste, compounded by the terrible decision to plonk Don Maclean's risible Starry Starry Night over the end credits.",
            "review_date": "2019-03-21",
            "source": "rt"
        },
        {
            "content": "Couldn't find anything to dislike about this movie, and I don't really care for the majority of animated films. Went back for a second viewing when this one was showing. VERY well done.",
            "review_date": "2019-02-26",
            "source": "rt"
        },
        {
            "content": "This movie is truly inspiring and mind-blowing. The details that went into every frame was just truly to perfect to put into words. The landscapes and scenery were beautiful and I learned a lot about Van Gogh's life.",
            "review_date": "2019-01-31",
            "source": "rt"
        },
        {
            "content": "Here stands a film perhaps as oddly remarkable as the great artist whose demise it documents; Loving Vincent is a Polish-UK co-production charting the final days (and the shady aftermath of which) of Vincent Van Gogh. But what is truly extraordinary about this film is that it is the first animated film created entirely with oil paints, in the notable style of its eponymous painter. Loving Vincent is an ambitious visual experiment, every frame avowedly hand-painted in a pastiche of Van Gogh's work. It's an experiment that certainly works; landscapes swirl dreamily across the screens and oozing strokes of paint litter the faces of the film's players. There is something strangely ethereal about the animation; it's utterly immersive and beautiful and surely can be appreciated simply for its flair and the pain-staking commitment required to create it. The film was also shot in live-action beforehand; we see Chris O'Dowd, Saoirse Ronan and the rest of the cast embodied within the brushstrokes, in a strangely satisfying and delightfully expressive way. There's an effortlessness and innovation to the film's design; the same cannot be said, however, of its plot.\nThough not unenjoyable, Loving Vincent's plot is rather thin, comprised of exposition-packed flashbacks and uninspired dialogue. Over-narrated and over-simplified, it never really takes flight or makes much of an impact, despite numerous attempts. We watch as young Armand Roulin (Douglas Booth) seeks to deliver a letter, at the request of his father, from a deceased Vincent to his brother, only to become hooked in finding out the truth behind the artist's death among the witnesses of his final days. The cast, led by Booth, are lively enough, but are not enough to distract one from a flimsy narrative that begins to feel like a tame episode of Poirot. Despite this, the film is entertaining enough and it's clear that the true intentions of directors Dorota Kobiela and Hugh Welchman is to impress via the film's visuals rather than its story.\nLoving Vincent is a definite mixed bag of a film; visually, it's exquisite and never excessively dull, but its formulaic and uninspired plot cannot be ignored. For a movie that claims to be a biopic of Vincent Van Gogh, it tells us very little about the man itself, functioning far more as a standard who-dunnit that is gorgeous to watch but, on occasion, feels self-admiring. An interesting film that is worth watching just for its pure style.",
            "review_date": "2019-01-03",
            "source": "rt"
        },
        {
            "content": "Loving Vincent is a wonderfully film from the story and demise of Vincent Van Gogh.",
            "review_date": "2019-01-02",
            "source": "rt"
        },
        {
            "content": "Stunningly animated, though the whole script it's a little bit underwhelming.",
            "review_date": "2018-12-24",
            "source": "rt"
        },
        {
            "content": "This movie is beautiful.",
            "review_date": "2018-12-20",
            "source": "rt"
        },
        {
            "content": "There are only a handful of words that can describe this motion picture, pure art, masterful, impressive, fun and absolutely gorgeous. This is one hell of a movie, very impressive. Each of the film's 65,000 frames is an oil painting on canvas, created by a team of over 100 painters, which is staggering. The voice acting is spot on I can say, perfect. The direction was fantastic, really impressive and different than anything I've seen prior to Loving Vincent. The paintings and visuals were absolutely wonderful, at segments I actually thought I was watching an actual movie. Overall, this movie was fantastic, the only problem I had was the running time, Loving Vincent was a tiny bit too long, for me at least. I give this movie 4,5/5 stars.",
            "review_date": "2018-12-12",
            "source": "rt"
        },
        {
            "content": "Filmone, di quelli potenti! Primo film interamente dipinto e quindi animato, a cui hanno lavorato oltre 100 artisti per realizzare i vari dipinti delle scene. Ovviante i dipinti sono ripresi dalle opere di Van Gogh e grazie a questo film ho conosciuto meglio la vita del pittore e ho imparato ad amarlo. Commovente dall'inizio alla fine, con una trama che ha dei risvolti anche un po' gialli considerando il mistero che avvolge la morte dell'artista. Ho pianto nel finale per la lettera che Vincent dedica al fratello Theo. Tutte le scene sono realizzate benissimo, anche grazie alla tecnica del rotoscopio; la fotografia, che ovviamente è presente anche in una pellicola così, è bellissima e la colonna sonora mi è piaciuta, soprattutto il brano finale. Non pensavo avrei mai amato così tanto un film del genere, riguardante tra l'altro un pittore. Nei miei preferiti, senza ombra di dubbio.",
            "review_date": "2018-12-05",
            "source": "rt"
        },
        {
            "content": "Loving Vincent es una de las obras maestras de la animación actual mas grande de los últimos tiempos y es que mas alla de su contenido su estetica y genialidad con la que se trabajo es de valorar ,su propuesta visual es un gran homenaje a uno de los pintores empíricos mas grande de todos los tiempos.",
            "review_date": "2018-11-12",
            "source": "rt"
        },
        {
            "content": "Let me start by saying that since I know how long it takes me to make one oil painting that if you made 65,000 of them and turned them into a feature length movie about waiting in line at the DMV I am in, but this is definitely not that. Whether some of the elements in the story are historically accurate or not to me is irrelevant, like Hitler being assassinated at the end of Inglourious Basterds, as an appreciation of an artistic undertaking of this scale alone merits watching for anyone who is a fan of Vincent van Gogh.",
            "review_date": "2018-10-22",
            "source": "rt"
        },
        {
            "content": "Let me start by saying that since I know how long it takes me to make one oil painting that if you made 65,000 of them and turned them into a feature length movie about waiting in line at the DMV I am in, but this is definitely not that. Whether some of the elements in the story are historically accurate or not to me is irrelevant, like Hitler being assassinated at the end of Inglourious Basterds, as an appreciation of an artistic undertaking of this scale alone merits watching for anyone who is a fan of Vincent van Gogh.",
            "review_date": "2018-10-21",
            "source": "rt"
        },
        {
            "content": "Vincent end of life is told as a murder mystery inadvertantly put together by the maincharacterof the film. Well put and nice paintings. A great tribute.",
            "review_date": "2018-10-16",
            "source": "rt"
        },
        {
            "content": "Beautifully animated by 100 artists creating more than 800 original oil paintings, often involving rotoscoping of actors playing the parts of Vincent Van Gogh and his associates.  Notably, all of the paintings are in the unmistakable style of Van Gogh - and some of his works are reproduced (of course).  So, the film is amazing to look at and takes me back fondly to my memories of the Van Gogh exhibit here in Melbourne last year (the wheatfields and the crows).  The plot follows the son (Armand) of Van Gogh's friend and subject Postman Joseph Roulin who travels to Paris after the painter's death to deliver a letter from Vincent to his brother Theo.  When Theo turns out to be dead, Armand travels to Arles to interview the people who knew Vincent at the end, including Doctor Gachet and Marguerite Gachet (voiced by Saoirse Ronan).  He comes up with a theory that Van Gogh might have been murdered rather than a suicide; however, I'm not sure this really adds enough tension to the plot to sustain interest.  Having recently watched Kirk Douglas as Vincent in Lust for Life (1956), I knew many of the details of the painter's life and perhaps the plot could be less clear without this background knowledge.  The remake of Don McLean's \"Starry, starry night\" playing over the end credits is a nice touch.",
            "review_date": "2018-10-12",
            "source": "rt"
        },
        {
            "content": "Astonishing, vivid, enchanting, sensitive, sensuous, devotedly ambitious, loving. This beautiful film nourished my soul. Thank you.",
            "review_date": "2018-10-11",
            "source": "rt"
        },
        {
            "content": "Beautifully made movie!",
            "review_date": "2018-10-04",
            "source": "rt"
        },
        {
            "content": "What a gorgeous film, especially the black and white segments. I had the good fortune to watch this movie with an artist who was pulling up all the paintings the film was paying homage to, which did wonders to increase my appreciation for how well the animators were able to replicate Van Gogh's work. The script has some problems, it's mostly just a series of people telling stories about Vincent as the protagonist goes around figuring out why he died. It's a really interesting approach, but it does cause the movie to have a plot that doesn't feel very active or urgent. As a result it does drag a bit at points. But Loving Vincent delivers where it counts: with unique and magnificent animation.",
            "review_date": "2018-09-07",
            "source": "rt"
        },
        {
            "content": "Just stunning. I kept staring at the screen in awe with every detail and stroke transforming from me scene to the next. A real visual treat.",
            "review_date": "2018-08-25",
            "source": "rt"
        },
        {
            "content": "I think this is one of those movies that will gain traction over time.  I was wary of it at first.  Bored at first but quickly mesmerized by the animation.  I think the style draws away (at first) from the content, story and acting. At the end of the day, in three days I watched it three times, loving it more and more.  This is a gem.  The story draws you in to the events of Vincent's life and death.  At the end, I got an understanding of Vincent from an animated movie that I never got from piles of books.",
            "review_date": "2018-08-19",
            "source": "rt"
        },
        {
            "content": "Loving Vincent is the world's first oil painted feature film. It fascinated me from the moment I watched the trailer months ago.\n\nArmand, the postman's son, a man with little to no aspirations, arrives at the last hometown of the painter to deliver his last letter. The audience dives into the story through his eyes, the eyes of a stranger, providing a fresh perspective as the character's curiosity, and our own, unravels an unexpected mystery.\n\nVisually stunning, the creators of this piece of art in animated form set out to achieve the impossible, to tell the story of the last days of Vincent Van Gogh's life through sixty-five thousand paintings.Loving Vincent\n\nThe art form of film is different from painting. Painting is one particular moment in time, frozen. Film is fluid, seeming to move through space and time. So, prior to and during the live action shoot the painting design team spent a year re-imagining Vincent's painting into the medium of film.\n\nLoving Vincent was first shot as a live action film with actors then hand-painted over frame-by-frame in oils. The final effect is an interaction of the performance of the actors playing Vincent's famous portraits, as well as the painting animators, bringing these characters into the medium of paint.\n\nIn an experience like no other, Loving Vincent takes the audience on a journey through his life and death, allowing us to step right into his artwork where we wonder about the meaning behind the scenes unveiling before our eyes.Loving Vincent\n\nArmand sets off in search of the truth and finds that sometimes, a man's fame is not made of what he set out to achieve during his lifetime but of the legacy that he leaves behind.\n\nDorota Kobiela had planned to combine her passion for painting and film, for her sixth animated short, and to paint the entire film herself. However, once she expanded Loving Vincent into a feature film the task of writing and directing was such that she had to content herself with directing the [124] painters. Although, Dorota managed to set some time aside to paint a few shots herself.\n\nAfter falling in love with Polish painter and director, Dorota Kobiela, Hugh Welchman also fell in love with her film project, Loving Vincent.  He has been working with her ever since.",
            "review_date": "2018-08-17",
            "source": "rt"
        },
        {
            "content": "Overall, this film is incredible to see and I am rather thankful for the work, time and passion that has gone in for this to become a full length feature film. While elements of the film can feel repeated, many viewers won't mind as film's stand out is more about the art work and getting to know the painter \"Vincent van Gogh\".\n-  Finesse Movie Reviews",
            "review_date": "2018-08-16",
            "source": "rt"
        },
        {
            "content": "The film was painted and Im sure they used some technology(?), but the effect was absolutely amazing. The story got a little bogged down. Certainly learned a lot about Van Gogh that I didnt know, sounded very lonely.",
            "review_date": "2018-07-28",
            "source": "rt"
        },
        {
            "content": "- Art buff or not, you won't be able to help Loving Vincent -\n\nAlthough my first love was the performing arts, a few painters have always captured my imagination. Of those, the red-headed, Dutch, post-impressionist Vincent van Gogh was probably my favorite. I love his bright colors, his quirky portraits, his fields, flowers, and furniture. But above all, to nobody's surprise, I love his wild, dreamlike, and most famous \"Starry Night.\"\n\nThe Polish animated feature Loving Vincent is a bit like \"Starry Night.\" It's a simple premise: a young man is charged with delivering a letter from the recently dead Vincent to his brother Theo. It's quiet and soothing: the movie keeps at a pretty low pitch mostly, with lots of landscapes and scenes of people holding conversations. And yet, somehow, it's unlike anything you've ever seen: after the scenes were filmed and edited, a team of 100 artists oil-painted over every single frame.\n\nThe final product of such an endeavor? An epic exploration of the life, love, and death of Vincent Van Gogh through his own eyes, the way he looked at the world.\n\nLoving Vincent is not flashy, and wouldn't endear too much re-watching if it had merely been filmed and produced in the traditional way. But in its particular style of animation, the movie is not only able to give us a fresh way of humanizing this bizarre, legendary painter, but the filmmakers are able to bring dozens of his most beloved paintings to life.\n\nOur protagonist (Douglas Booth, Pride and Prejudice and Zombies; Noah) is Armand Roulin, of van Gogh's \"Yellow Jacket\" portrait. We also meet \"Marguerite Gachet at the Piano\" (Saoirse Ronan, Ladybird; Brooklyn)  the Postman Roulin (Chris O'Dowd, Molly's Game; The Incredible Jessica James, and the \"Old Man in Sorrow\" (Bill Thomas, Alice Through the Looking Glass). We glimpse the sunflowers, the irises, and the majestic stars shining over the Rhone.\n\nVincent van Gogh was, perhaps, a man born out of time. Depressed and poetic, quiet yet dramatic, living in poverty, and suffering from something like bipolar disorder or epilepsy, he remains a bittersweet hero for the modern artist. He is a reminder of the importance of human empathy and friendship. His story makes me humbly grateful for modern medicine and spurs me on to make the art that brings me joy, even if I never grow rich from my labors.\n\n\"What would life be if we had no courage to attempt anything?\"\n\nVincent wrote that phrase in a letter to his brother Theo. I like to think that sentiment inspired the directors (Dorota Kobiela, The Flying Machine; & Hugh Welchman, La Vie en Rose), oil painters, and crew of Loving Vincent. It certainly inspires me to take the leap to repaint my days with fresh new life of wonder and imagination.\n\n----------\n\nThis review was first published on Narrative Muse, http://www.narrativemuse.co/movies/loving-vincent, and was written by Debbie Holloway. Narrative Muse curates the best books and movies by and about women and non-binary folk on our website http://narrativemuse.co and our social media channels.",
            "review_date": "2018-07-22",
            "source": "rt"
        },
        {
            "content": "Loving Vincent is a 2017 experimental animated biographical drama film. It is the first fully painted animated feature film, and is written and directed by Dorota Kobiela and Hugh Welchman. \nThis film cleverly incorporates the artist's paintings into the settings. It was interesting to learn about his character and life, and also intriguing to re-live the uncertainty surrounding his death. I was fascinated and, in the final scene, moved. \nAANA GGNA",
            "review_date": "2018-07-17",
            "source": "rt"
        },
        {
            "content": "Visually breathtaking. Interesting and provocative story. Wonderful way to spend an evening.",
            "review_date": "2018-06-06",
            "source": "rt"
        },
        {
            "content": "Understanding Vicent's harsh life and having interests in hi works. Starry Starry Night.",
            "review_date": "2018-05-20",
            "source": "rt"
        },
        {
            "content": "un CLÁSICO INSTANTÁNEO",
            "review_date": "2018-05-18",
            "source": "rt"
        },
        {
            "content": "It's easy when creating a film with features that are special to that movie to gloss over other elements of the movie and have them like any other and only decent, but Loving Vincent is a film made with a lot of love, passion and precision. Presenting Vincent van Gogh's life though a slow-paced murder mystery is an affective and brilliant way to present the story. The movie has a lot of dialogue and monologs in it, and the writing is absolutely fantastic, each character feels alive. Rotoscoping was used, all the scenes were acted out on a green screen, placed in a painting and over 100 painters painted the entire picture again, and as the first oil painted film, its quite simply genius. The soundtrack is also way more enjoyable then expected, I will have a listen to it later. Loving Vincent could so easily just have been a love letter to Vincent van Gogh, but it's so much more, it shows that great minds with a lot of passion can do anything, even if it takes 6-7 years to make.",
            "review_date": "2018-05-01",
            "source": "rt"
        },
        {
            "content": "I loved this movie! Honestly, loved it. I'm not sure why the general sentiment toward this movie seems to be that it's a hollow plot on top of gorgeous visual - I did not find that to be the case at all, and frankly I was shocked by how engaged I was following what is essentially a classic gumshoe murder mystery plot about a man who committed suicide. You add on top of that, aside from the fantastic sense of provincial life it imparts throughout the run time, some truly gorgeous and unique visuals and you have what I consider a small masterpiece.",
            "review_date": "2018-04-26",
            "source": "rt"
        },
        {
            "content": "Quite possibly the greatest visual achievement in all of modern film.",
            "review_date": "2018-04-21",
            "source": "rt"
        },
        {
            "content": "The narrative is a bit of a problem in this film, but I recommend seeing this. Loving Vincent breaks the mold big time with its dazzling visuals and innovative way of creating the animation it would be hard not to recommend giving this a view..",
            "review_date": "2018-04-20",
            "source": "rt"
        },
        {
            "content": "Loved it, being the first of its kind makes me like it even more",
            "review_date": "2018-04-19",
            "source": "rt"
        },
        {
            "content": "great movie, in my opinion deserved the Oscar of better animation",
            "review_date": "2018-04-14",
            "source": "rt"
        },
        {
            "content": "The feels,i recommend this for everyone and generations to come",
            "review_date": "2018-04-13",
            "source": "rt"
        },
        {
            "content": "Truly beautiful in every way.",
            "review_date": "2018-04-11",
            "source": "rt"
        },
        {
            "content": "While cautious to watch this film, it was beautifully done with a surprisingly interesting plot.",
            "review_date": "2018-04-10",
            "source": "rt"
        },
        {
            "content": "A MASTERPIECE OF THE ARTIST'S TORTURED LIFE, DONE IN THE LONG-FORGOTTEN ART OF ROTOSCOPE ANIMATION.",
            "review_date": "2018-04-08",
            "source": "rt"
        },
        {
            "content": "LOVING VINCENT\n\nThe film is a gimmick of Linklater proportions, it's a feat as the first oil frame-by-frame painted movie. It's also a visually stunning film, expressive in its use of color and even \"lighting\", maintaining a tight relationship to the artist's technique and mood. Just like a Van Gogh, its details are less important than the overall expression, the latter relying almost uniquely on the former. Yet, a movie's greatness can't rest solely upon novelty, because if that was the case, The Jazz Singer and Avatar would be great films. In fact, seldom does first get to be best when you look back to the cinematic history. So, although Loving Vincent is certainly a courageous endeavour, we mustn't forget that it is highly flawed, as most experiments are when you test them for the first time. It's a highly frustrating movie, both for its script consisting of 100% of exposition and for its structure. For example, something bugged me in the first part of the film in which a flashback does not appear in black and white for no apparent  reason. I was fortunate enough to get the directors in the room to get my question asked but their answer did not justify its purpose at all. It is well regarded that there's strength in repetition so in order to make a cohesive point sometimes, when the execution wasn't perfect at first try, you have to hit the nail once again. The contrary is also true, as the movie utilizes the flashback mechanism so many times to point of it becomes wearisome, when a flashback seems almost gratuitous. When you are constantly alternating between present and past, it gives both insufficient importance, in a cycle of neglect. That was the main force of my frustration, as the movie kept repeating a part of film grammar that is strongest when used scarcely (or executed to perfection like in Citizen Kane). Ultimately, the movie's greatest flaw consists on avoiding what Van Gogh was filled to the brim with: the will to dare and to cut off a ear.",
            "review_date": "2018-04-04",
            "source": "rt"
        },
        {
            "content": "This a majestic artwork",
            "review_date": "2018-03-25",
            "source": "rt"
        },
        {
            "content": "I was awestruck by the beauty of this movie and it's lovely score.  Absolutely loved it!",
            "review_date": "2018-03-24",
            "source": "rt"
        },
        {
            "content": "So beautifully drawn, you ignore the flaws in the narrative. A must watch.",
            "review_date": "2018-03-24",
            "source": "rt"
        },
        {
            "content": "So beautifully done. Magically fluid and the subject matter offered insight into new theories. Appreciated it so much that I purchased my own copy.",
            "review_date": "2018-03-23",
            "source": "rt"
        },
        {
            "content": "a revolutionary take on animation, almost like the subject itself. The movie really brings out the beauty and melancholy of the interesting artist and his legacy.",
            "review_date": "2018-03-21",
            "source": "rt"
        },
        {
            "content": "so beautiful, so brilliant, absolutely loved it",
            "review_date": "2018-03-20",
            "source": "rt"
        },
        {
            "content": "An achievement in filmmaking, Hugh Welchman and Dorota Kobiela have done the impossible. One of the best biopics depicting an true artist, with staggering emotion, solid acting, a beautiful story, and one of the most stunningly animated films I've ever seen.",
            "review_date": "2018-03-19",
            "source": "rt"
        },
        {
            "content": "Reminds me of The Polar Express. The groundbreaking animation detracts from the story.",
            "review_date": "2018-03-18",
            "source": "rt"
        },
        {
            "content": "masterpiece !should won oscar",
            "review_date": "2018-03-18",
            "source": "rt"
        },
        {
            "content": "This film caught my interest the minute i heard of it. I'm not a big art head, but I do dig some of the big European, influential artists and van Gogh is one of my favorites.\n\nA known story is presented nicely with words and people, everything takes place some time after his death as Armand Roulin, the son of a friend of Vincent, is trying to find out what happend in Vincents last days. For me, everything here is about the presentation. The work, the art and the quality of the images. 65,000 frames, all done as oil paintings on canvas by over 100 artists. Every single one in the style and technique used by the man himself. Boy, can you top that?\n850 of them is very different, later on copyed and edited to make movements and such. Well, at least that's the way I figure it.\n\nStriking visuals, impressive voiceovers by the actors and with Clint Mansell on the music buttons it's hard to be left unpleased. I must say I was hoping for more, but I was fearing it would be way worse. It's a beautiful piece, with a sad story that should be well known to all art students around the world. Watch van Gogh come alive in this spellbinding, cinematic trip. This is art in it's clearest form, and also a really good film.\n\n8.5 out of 10 brush strokes.",
            "review_date": "2018-03-15",
            "source": "rt"
        },
        {
            "content": "This Oscar-nominated fully oil painted feature film ingeniously pieces together Vincent Van Gogh's artworks as a canvas of a touching portraiture of the painter's sorrowful life via a fictional plot of a postman investigating the true nature of his death.",
            "review_date": "2018-03-13",
            "source": "rt"
        },
        {
            "content": "https://medium.com/@Penseur/loving-vincent-how-the-ignorami-killed-a-masterpiece-in-oil-c533c80262d3",
            "review_date": "2018-03-09",
            "source": "rt"
        },
        {
            "content": "Loved the film, a very nice artistic approach with the picture and how it Portrays Van gogh's  painting style, it give some great insight towards Vincent's life and the mystery behind his death. I would RECOMMEND watching the film.",
            "review_date": "2018-03-09",
            "source": "rt"
        },
        {
            "content": "ITS NARRATIVE MAY NOT BE AS GRANDIOSE AS ITS VISUALS, LOVING VINCENT PERFECTLY FRAMES ITS SUBJECT IN THIS STUNNING BIOGRAPHICAL FLICK.",
            "review_date": "2018-03-09",
            "source": "rt"
        },
        {
            "content": "Originally shot live-action, then painted over by hand, \"Loving Vincent\" ponders over Van Gogh's death, while also celebrating his legacy.",
            "review_date": "2018-03-09",
            "source": "rt"
        },
        {
            "content": "good movie with a great story and great performaqnces but this movie his really boring and his stop the movie after 20 minutes because this movie was really boring",
            "review_date": "2018-03-07",
            "source": "rt"
        },
        {
            "content": "as A movie i'd have to admit i didn't enjoy it much  but you got to respect the effort and the art behind it. the end credits were the highlight of the movie. amazing adaptations.",
            "review_date": "2018-03-06",
            "source": "rt"
        },
        {
            "content": "A film with a incredible original idea and a high quality of sensibility. It's about an story that everybody knows, but in a way that no one has ever seen.",
            "review_date": "2018-03-04",
            "source": "rt"
        },
        {
            "content": "Increible, extraordinariamente bien hecha. Única en su estilo.",
            "review_date": "2018-03-04",
            "source": "rt"
        },
        {
            "content": "It is a beautiful independent film. Created over a period of seven years by 125 oil painters. The touching story brings to life the characters and paintings of Van Gogh.",
            "review_date": "2018-03-03",
            "source": "rt"
        },
        {
            "content": "a masterpiece of masterpieces!",
            "review_date": "2018-02-26",
            "source": "rt"
        },
        {
            "content": "encantador reconhecer a obra do artista ao longo do filme, apreciar os movimentos das cenas nas marcas de pincel. Maravilhoso",
            "review_date": "2018-02-25",
            "source": "rt"
        },
        {
            "content": "A labour of love in the best possible sense, Loving Vincent is a visual wonder, with a huge team of dedicated artists beautifully recreating Vincent Van Gogh's unique aesthetic in order to tell the story of his tragic and still enigmatic demise. The way that scenes blend into each other and how the dissolves into flashback drain the screen of almost all colour is just fantastic to behold. The story is engaging, if unremarkable, and the actors provide not only their voices but also their likeness, making it seem like their adventure is taking place on a living canvas. It might not receive the praise it so deserves, since CGI is king of the hill when it comes to animated pictures, but for those who like their movies modern but with a splash of classic, Loving Vincent is a show you won't soon forget.",
            "review_date": "2018-02-25",
            "source": "rt"
        },
        {
            "content": "All about the artistry.  A mystery of sorts, this is about a young man (Douglas Booth) who travels to the late Vincent van Gogh's hometown to deliver a letter.  While he is there, he tries to put together the puzzle pieces to determine what events led up to the artist's alleged suicide.  Now you may already be aware of the most noteworthy thing about this: every single frame of this film is fully painted from start to finish.  You just don't ever get to see that much effort put into animated films nowadays with the sole exception of stop-motion, and even then, those films are getting rarer and rarer.  It seems like a ton of extra work, but it is obviously appropriate given the subject matter at hand.  It is a pretty trippy effect when you first see it in motion, and it takes you a few minutes to adjust.  This movie is a work of art to be sure, but I really didn't dig the story at all.  I do feel like this is more of an experiment than anything else, and to pay this movie a compliment, the artwork is undeniably stunning.  There are different styles featured throughout, and they vary from scene to scene.  You can pause any single frame to this and people will likely think that it is a screensaver for your television, it is seriously that level of high detail.  If you can't afford the local art exhibition at the museum because it is too expensive, you might want to try putting this on as a cheaper alternative.  I love the look of this, but as previously stated, I never got into the story.  It builds van Gogh up to be this myth, but while it is about him, it is not really his story.  It's this other random guy's narrative, and it became very clear early on that they are just pulling a Rashomon here.  Everybody has their own version of the truth of events, and you never are 100% certain on what actually happened.  The story devolves into a lot of \"he said she said\", which I didn't care for.  The unreliable narrator is a storytelling device that I have seen before, and unfortunately, I've seen it done better and more interestingly.  I can't take anything away from the look of this film, and Loving Vincent will at least be remembered as being the first to attempt something of this nature.  Given that it is a Rashomon style story, there are a ton of flashbacks, and I felt that it got in the way of the forward movement of the plot, but that might just be me.  As it stands, this is a beautiful movie that I never connected with, which is a shame, because I was really excited for it, given everything I heard about the production.",
            "review_date": "2018-02-23",
            "source": "rt"
        },
        {
            "content": "Beautiful. The movie itself was nice work, and I actually enjoyed the story. Well done.",
            "review_date": "2018-02-23",
            "source": "rt"
        },
        {
            "content": "The most beautiful looking movie I have ever seen, but not the story-based best.",
            "review_date": "2018-02-18",
            "source": "rt"
        },
        {
            "content": "Excellent movie. Will see it again!",
            "review_date": "2018-02-17",
            "source": "rt"
        },
        {
            "content": "A stunning animation achievement compliments a thoughtful story set within Van Gogh's paintings. Characters demystify and explore the validity of theories about his life, as the lovingly painted spectacle washes over you.",
            "review_date": "2018-02-17",
            "source": "rt"
        },
        {
            "content": "one of the best movies from 2017. I wish this movie had a global release ",
            "review_date": "2018-02-15",
            "source": "rt"
        },
        {
            "content": "Stunning film. Loved it and will buy a copy so I can watch again.",
            "review_date": "2018-02-15",
            "source": "rt"
        },
        {
            "content": "Interesting Experiment",
            "review_date": "2018-02-13",
            "source": "rt"
        },
        {
            "content": "Visually interesting style of animation but the story is dreadfully dull and uninteresting... this one almost put me to sleep.",
            "review_date": "2018-02-12",
            "source": "rt"
        },
        {
            "content": "I wish they'd put half as much effort into the screenplay as they did the admittedly stunning animation. Hell, even jettisoning the plot might have been the better bet that way we could simply enjoy the imagery.",
            "review_date": "2018-02-10",
            "source": "rt"
        },
        {
            "content": "The animation style is gorgeous, to be sure, but also makes it almost impossible to regard any of the characters as human, because all the visual cues and nuances of expression are wiped away. At the end of the day, the gimmick isn't enough to paper over a dull screenplay that's basically a TV movie.",
            "review_date": "2018-02-10",
            "source": "rt"
        },
        {
            "content": "The paintings within the Loving Vincent film were beautiful, and the various slides that were compiled and then painted by over one-hundred artists showed excellence, expertise, and incredible efforts to see the project through. Thank you Loving Vincent directors Dorota Kobiela and Hugh Welchman. This movie was a true masterpiece for an master. I hope that this raises the bar for future cinema.",
            "review_date": "2018-02-09",
            "source": "rt"
        },
        {
            "content": "Nothing too special but impressive artistry and art style.",
            "review_date": "2018-02-09",
            "source": "rt"
        },
        {
            "content": "This is a film that will be shown in schools and taught in art classes. Absolutely stunning visually, so wonderful to finally see! This film is the first fully painted animated feature film, and unfortunately, that is the one thing going for this film. Every scene is so beautiful, every brush stroke. There are black and white flashback scenes that are so realistically painted, for a brief moment I actually forgot I was watching a painted film. The way the backgrounds are emphasized in any given scene, second by second, how the clouds moved across the sky. How a river would flow, the wind blowing leaves down the road, or even the change of sunlight shown on a character's clothing. Subtle moments such as these really make this film stand out. Each of the film's 65,000 frames is an oil painting on canvas, using the same technique as van Gogh, created by a team of 125 amazing painters.\n\nIt would be unfair for me to only praise this very unique animation style-despite that it deserves every bit of praise-and touch on nothing else. The story is a murder mystery, taking place one year after Vincent van Gogh's death, diving deep into whether the death was the result of a suicide or a possible murder. You may be mesmerized by the amazing visuals, but once you begin paying attention to the story, it may immediately take you out. The script isn't great, which draws away from what you are seeing on the screen. The story touches very briefly on van Gogh's life, relationship with his brother, and the mutilation of his ear. It leaves much desired when those aspects are so much more interesting within this story, than the issue at hand.\nAbsolutely amazing cast, but even here lies a problem. Taking place in France, the entire cast consists of English and Irish actors; their accents are so noticeable, their voices alone are enough to pull you out of a scene. Saoirse Ronan and Chris O'Dowd, two Irish actors I adore, and I had the hardest time feeling any legitimacy in their French characters with such hard Irish accents. The same goes for Jerome Flynn and Helen McCrory, two stellar English actors, but portraying French characters their accents took me right out of their scenes. Now this may not affect other people seeing this film, but it was extremely noticeable for me and quite jarring. I can't help but wonder if the film would have been done better justice by keeping it a short film.",
            "review_date": "2018-02-08",
            "source": "rt"
        },
        {
            "content": "Must see, even if you are not an art buff or know nothing about Van Gogh. Wonderful film, uniquely presented.",
            "review_date": "2018-02-08",
            "source": "rt"
        },
        {
            "content": "One of the best looking animated films of all time, Loving Vincent captures the magic that Vincent Van Gogh brought into this world. From the opening shot this film captures the essence of Vincent. With a compelling story that leaves many questions unanswered, it still captures the audiences imagination and brings Vincent's paintings to life",
            "review_date": "2018-02-08",
            "source": "rt"
        },
        {
            "content": "Exquisite presentation of the artist's last days.",
            "review_date": "2018-02-07",
            "source": "rt"
        },
        {
            "content": "Loving Vincent é poético e magistral em toda a sua essência, uma das melhores animações da década e um dos melhores filmes de 2017.",
            "review_date": "2018-02-06",
            "source": "rt"
        },
        {
            "content": "Puntaje Original: 7.5\n\nUn hito en la historia del cine. Loving Vincent es una obra maestra digna de admiración y respeto universal.",
            "review_date": "2018-02-06",
            "source": "rt"
        },
        {
            "content": "Hace tpo quería ver esta película. Su premisa es que cuenta eventos ocurridos 1 año después de la muerte de Vincent Van Gogh. No sé cuánto de ficcionalización tendrá la verdad. ¿Su mayor gracia? Cada cuadro de animación de la película es una pintura hecha con el estilo de Van Gogh. La peli dura 90 minutos y tiene la brutalidad de 65000 cuadros. Eso da una razón de unos 12 cuadros/seg. (Lo normal en cine es 30 o 60). Demoraron 4 años en hacerla (¡!).\n\nBueno... es probablemente la película con animación más hermosa que he visto ever. Piensen en el estilo de Van Gogh en movimiento. Piensen que esto nunca se había hecho a esta escala. Me pareció de una belleza inconmensurable. Como película en sí (guión, diálogos) está re bien, es una película de investigación correcta.\n\n\"Loving Vincent\" me hace cuestionarme si además del Oscar \"Mejor película animada\" debería existir la categoría \"Mejor animación\". Quizá \"Coco\" sea mejor película (no lo sé, no la he visto. Sé de su abrumadora buena crítica), pero en animación creo que \"Loving Vincent\" es la ganadora total de este año.\n\nPreciosa. En el ámbito \"animación\", 5 de 5. Como película, como un todo, 4 de 5.",
            "review_date": "2018-02-05",
            "source": "rt"
        },
        {
            "content": "It's been a very long time since a movie has affected me as much as this one. Though everyone is rightly praising the never-seen-before (or probably again) animation style, what really shines is the story, which I knew nothing about.",
            "review_date": "2018-02-04",
            "source": "rt"
        },
        {
            "content": "As a person who hadn't known much about Van Gogh before the movie, the score came almost purely from the beauty captured by the \"new\" way of movie making. Color, texture, motion. The storyline, however, isn't that capturing and felt forced.",
            "review_date": "2018-02-04",
            "source": "rt"
        },
        {
            "content": "This is an amazing film and the ending is so beautiful that it made me rethink the entire movie. A must see and a must see again!",
            "review_date": "2018-02-03",
            "source": "rt"
        },
        {
            "content": "Its an espectacular visual experience and an incredible artwork.",
            "review_date": "2018-02-03",
            "source": "rt"
        },
        {
            "content": "Muy buena, la historia es lo que más me gusto, la originalidad para agarrar sus 800 pinturas, armar un guión con ellas, y utilizarlas como storyboarding. Aprende uno varias cosas del artista. Obvio Goh era un loco, si era un genio del arte.",
            "review_date": "2018-02-03",
            "source": "rt"
        },
        {
            "content": "A very interesting concept to explore in film, aesthetically and narratively, but that being said, the film doesn't do a whole lot of interesting exploring within it. The script feels like a rehash of so many bland TV shows and films of dead famous people mystery stories or just cliche noir-dramas.",
            "review_date": "2018-02-02",
            "source": "rt"
        },
        {
            "content": "It will be definitely remembered for how it looks: absolutely gorgeous and unique like a Van Gogh painting in motion, that is for sure; yet the film's unimpressive Citizen-Kane-esque plot doesn't offer as much to match its incredible technical achievement, which is a pity.",
            "review_date": "2018-02-02",
            "source": "rt"
        },
        {
            "content": "*** \"BEAUTY IS IN THE EYE...,\" BUT BRITISH VOICEOVERS ARE OUT OF LE FRANCE FIELD***",
            "review_date": "2018-02-01",
            "source": "rt"
        },
        {
            "content": "I'm loving loving Vincent. I had been waiting for some time for this movie to come out. I saw the dubbed Spanidh version in Alicante, Spain. I would have preferred seeing the English version for better comprehension, but the Spanish version was the only one available I would say that even if I were to not understand anything, it would be worthwhile seeing the movie for the art. The movie presents the various possble theories as to the demise of Vincent as well as details of his life through the perspective of various people that knew him. In some cases the perspective is influenced by the beliefs of the person commenting. The letter carrier provides a means of touching bases and introducing possible theories on how he died. But the real star here is the art and animation of Vicent's umique style of painting. Waited a long time to see it, but it was worth it.",
            "review_date": "2018-02-01",
            "source": "rt"
        },
        {
            "content": "Existem filmes ruins, bons, ótimos e também obras-primas inesquecíveis. \n\nContudo, tal como Van Gogh, o filme \"Com amor, Van Gogh\" (Loving Vincent) não se enquadra em nenhuma das classificações possíveis: É uma obra de arte e assim será por mim lembrado.",
            "review_date": "2018-02-01",
            "source": "rt"
        },
        {
            "content": "The whole movie has been hand painted using 100 artists to deliver this piece of art. \n\nAllegedly, the plot is about the true events of the death of Van Gogh and the consequences that followed.\n\n Despite anything, Loving Vincent is a great experience, specially if you want to watch a Gogh painting magically coming to live in front of your eyes. it was a very trippy experience.",
            "review_date": "2018-01-31",
            "source": "rt"
        },
        {
            "content": "It takes a while to get used to the painted scenes (which are all of them), but at some point you are happily submerged in a moderately well narrated dream-like thriller.",
            "review_date": "2018-01-29",
            "source": "rt"
        },
        {
            "content": "Could not have possibly been made better. One of the best movies i have seen in a long time.",
            "review_date": "2018-01-28",
            "source": "rt"
        },
        {
            "content": "Cool concept, which alone makes this worth the watch, even if other aspects are less desirable",
            "review_date": "2018-01-28",
            "source": "rt"
        },
        {
            "content": "Fascinating animation techniques are tied to a conventional screenplay.",
            "review_date": "2018-01-28",
            "source": "rt"
        },
        {
            "content": "A lovely score and amazing artwork that uniquely paint the story of Vincent Van Gogh.  A definite passion project worked on by many artists.",
            "review_date": "2018-01-28",
            "source": "rt"
        },
        {
            "content": "https://letterboxd.com/edmundpoliks/film/loving-vincent/",
            "review_date": "2018-01-26",
            "source": "rt"
        },
        {
            "content": "I expected the visuals to be amazing. They were! The textures were almost touchable. Add the mystery, looked at from many viewpoints, was a bonus I had not expected. Definitely a film I want to watch again.",
            "review_date": "2018-01-25",
            "source": "rt"
        },
        {
            "content": "Groundbreaking and pioneer in its visuals, Loving Vincent unfortunately can't sustain an engaging narrative worth of its subject matter.",
            "review_date": "2018-01-24",
            "source": "rt"
        },
        {
            "content": "Very sad, well told summary of Van Gogh’s death and impact on those around him during life. ",
            "review_date": "2018-01-21",
            "source": "rt"
        },
        {
            "content": "Fascinating technique. Swept me away. The script was an interesting lecture on Vincent's life and last days, too. I was thrown by the acting done in working class British, though.",
            "review_date": "2018-01-21",
            "source": "rt"
        },
        {
            "content": "The death of Van Gogh. A bit dizzy watching it though.",
            "review_date": "2018-01-21",
            "source": "rt"
        },
        {
            "content": "Beautifully conducted, a stunning masterpiece in its form and content. Throws some light at Van Gogh's supposed difficult and troubled personality. The truth is he was a misunderstood genius.\nThe ending credits are simply perfect with Sarry Starry Night. Lianne La Havas's version is so touching and powerful that brought me to tears.",
            "review_date": "2018-01-19",
            "source": "rt"
        },
        {
            "content": "For, it insists too much in the part about the suicide and Auvers, and little about Arles, Saint-Remy, his ilness or the development of his art... Movie is developed on a real-actors base, and then painted, and that gets amazing visual effects and a great photography close to the post-impresionism from Van Gogh... Definitively, although it could have been done in very different ways, wonderful work.",
            "review_date": "2018-01-19",
            "source": "rt"
        },
        {
            "content": "I learned a ton and liked the unusual animation. I hadnt seen it before anywhere. I even got a little sad toward the end, not that Im giving anyway anything.",
            "review_date": "2018-01-19",
            "source": "rt"
        },
        {
            "content": "Film critics tend to talk down on a film when it seems like the core idea of the film is a gimmick. Three-dimensional movies were the talk of the town about 10-15 years ago and have now become an annoyance to many. Loving Vincent is the newest film to try something new in terms of how it tells its story. Being completely painted by hand, this movie moves along as if it had been animated about 60 years ago. A more recent comparison would be to say it looks like A Scanner Darkly, but I truly feel this film's much more unique than even that. This is a wonderfully engaging premise and even without that aspect, here's why I believe everyone needs to see this film, even just based on the portraits alone.\n\nLoving Vincent tells the story of Armand, a young man who has been tasked with the devastating venture of delivering Vincent Van Gogh's final letter. Upon arrival of the town that Van Gogh ultimately met his untimely end, Armand finds himself incredibly interested in the mystery surrounding this death. Becoming more of an investigation film than a simple journey, Loving Vincent takes you on a ride that's full of insight and powerful moments between characters. I didn't think I would've been so moved by this movie, but the performances/voiceover work was truly astounding, sucking me right into this beautiful portrait of a film.\n\nIt's one thing to commend this film for having truly breathtaking visuals, but that's also the understatement of the year. This movie blows away any animated film from last year in terms of being uniquely made. From the nods to Van Gogh's classic works, to the motion and dissolves between scenes, everything about this film felt seamless. That being said, there's a large obstacle that many viewers will have to get over as soon as the film begins as well, being the fact that it's entirely painted by hand. This wonderful aspect of the movie will definitely be off-putting to some, due to the fact that it's the first film of its kind and may be bizarre to look at. For myself, I found it absolutely fascinating, plain and simple.\n\nAs someone who prefers other forms of art than paintings, I do admire a great piece of art, regardless of the medium. This movie explores a life that pretty much everyone has heard of at some point in time, and I must admit, I didn't know this story was as complex of a mystery as this movie suggests it is. From motivational speeches about life and the universe to questions brought up in a philosophical way, I was incredibly immersed in each and every one of the scenes throughout this film. There's hardly any downtime because every line of dialogue progresses this story forward at a rapid rate.\n\nIn the end, Loving Vincent may not be for everyone, especially due to its unique look, but the story itself is something I believe everyone needs to see. There is a scene that closes out the movie that I still have playing over and over in my head. As I mentioned many times, this movie is filled with memorable lines of dialogue that truly makes you think about life itself and the universe surrounding us. This may seem biased and this particular reaction will surely not hit everyone the way it hit me, but I found this to be a remarkable picture. I fear this movie will go fairly unnoticed, which is a shame because literally, every aspect of this film is wondrous to behold. This is one of my favorite films of 2017.",
            "review_date": "2018-01-17",
            "source": "rt"
        },
        {
            "content": "Visualmente hermosa pero lenta en su narrativa. ",
            "review_date": "2018-01-17",
            "source": "rt"
        },
        {
            "content": "Exquisite, beautiful and deeply moving. This movie is a creative masterpiece. I believe Vincent would have been honored.",
            "review_date": "2018-01-16",
            "source": "rt"
        },
        {
            "content": "Has it's flaws but if you like animated films you still have to see this.",
            "review_date": "2018-01-15",
            "source": "rt"
        },
        {
            "content": "This is one of the best movies I’ve ever seen. Very impressive! ",
            "review_date": "2018-01-15",
            "source": "rt"
        },
        {
            "content": "I think many reviewers have missed something essential in this film. Yes it is gorgeous and a total tour-de-force of stylized animation - a must-see for anyone who has appreciated the energy and acuity of Van Gogh. But... the simplicity with which the narrative is carried out by means of \"moving through\" Van Gogh's works is done with a humanistic and psychologically structured approach that mirrors his works.  These are relationships and haunts drawn from his final days, and they are woven into the visual fabric of the film/canvases in front of you. All in all, it yields tremendous balance to the whole effort, and is an accomplishment as sensitive as these visual treasures he left us. I'm not sure what additional narrative these critics are looking for?",
            "review_date": "2018-01-14",
            "source": "rt"
        },
        {
            "content": "Since I was a kid I loved Vincent, indeed. His art spoke to me. And so did this animated feature! Not only a unique and mesmerizing visual experience, also a well constructed drama/thriller, exploring last days of a tormented soul and a great artist. My favorite one..",
            "review_date": "2018-01-14",
            "source": "rt"
        },
        {
            "content": "A visual treat with a straight forward narrative.",
            "review_date": "2018-01-14",
            "source": "rt"
        },
        {
            "content": "I've always enjoyed Van Gogh's paintings! These movie made me love him more and and in another level! Highly recommended!",
            "review_date": "2018-01-13",
            "source": "rt"
        },
        {
            "content": "An amazing work of art!! The best movie in years to come!",
            "review_date": "2018-01-13",
            "source": "rt"
        },
        {
            "content": "Loving Vincent features stunning, artistic and groundbreaking fully painted animation that should be appreciated how difficult it was to put on film. Watching the film is like witnessing the paintings move which truly makes it a unique experience plus those black and white scenes were even more interesting to me both plotwise and visually. But the storyline, although serviceable, is very typical and not particularly engaging, the voice acting is far from great and the film is too narrow in its scope and too slow paced to be enjoyed more.",
            "review_date": "2018-01-11",
            "source": "rt"
        },
        {
            "content": "I can't even say why this movie held me spellbound from beginning to end -- which made the experience of it all the more awesome -- but I wouldn't undersell the narrative. it is a mature coming to terms with the circumstances of his death weighed against the profound influence of his art. It is a \"dazzling visual achievement,\" as the consensus says, and a totally engaging experience to see those characters come to life.",
            "review_date": "2018-01-11",
            "source": "rt"
        },
        {
            "content": "Beautiful and sad...",
            "review_date": "2018-01-07",
            "source": "rt"
        },
        {
            "content": "moving hand painted pictures really interesting, the starry starry night in the end of the movie really made the tears out",
            "review_date": "2018-01-06",
            "source": "rt"
        },
        {
            "content": "Three stars but extra half for the paintings and creative idea. Story is thin and too many roles make it harder to follow what information everyone offers. ",
            "review_date": "2018-01-06",
            "source": "rt"
        },
        {
            "content": "Gorgeous scenery one after another. I think I can appreciate Van Gogh more now.",
            "review_date": "2018-01-06",
            "source": "rt"
        },
        {
            "content": "Thoroughly and consistently beautiful. Didn't expect the whodunnit structure,either, but this worked well at telling Van Gogh's story.",
            "review_date": "2018-01-05",
            "source": "rt"
        },
        {
            "content": "That this film will live in obscurity is shameful, as its concept and execution as the first animated film to be produced entirely with oil canvas paintings is breathtaking. As I sat in a theater of about 100 people, no one moved, spoke, or breathed when the credits began because everyone wanted to take in every second of the visuals. Narratively there are no faults, but rather oddities, and maybe the film tries to do too many things. But Van Gogh lives on in this work of art.",
            "review_date": "2018-01-03",
            "source": "rt"
        },
        {
            "content": "Beautiful and creative movie that is a feast for your eyes. Memorizing to watch and an interesting story too.  This movie deserves a wider audience and more marketing here in the states espcieally considering the undertaking to make this movie.  Movie consist of over 65,000 hand done oil paintings that is laid end to end would cover the island of Manhattan. It also must be seen on a BIG screen to fully appreciate the work.. BTW Starry Night is not displayed at the Van Gogh Museum in Amsterdam but it is displayed unceremoniously at MOMA in NYC without much of a crowd surprisingly - unlike the Mona Lisa with people in front of it 10 people deep.",
            "review_date": "2018-01-02",
            "source": "rt"
        },
        {
            "content": "Ah - perhaps someone else killed Van Gogh. Very different presentation with illustrations in the style of Van Gogh alternating with some near black and white. Took time to get used to but always fascinating.",
            "review_date": "2018-01-02",
            "source": "rt"
        },
        {
            "content": "Loved the movie and would watch it again",
            "review_date": "2018-01-01",
            "source": "rt"
        },
        {
            "content": "Hermosa, bien hecha, llena de sentimiento, tocada con la genialidad de Van Gogh, aquel que comenzó a dedicarse al arte después de los los 28 años para dedicar sus pocos años restantes solo a expresarse mediante el dibujo. Preciosa!",
            "review_date": "2017-12-31",
            "source": "rt"
        },
        {
            "content": "This movie is a masterpiece. The whole movie is drawn using Vincent van Gogh drawing style but yet it feels so real. ",
            "review_date": "2017-12-31",
            "source": "rt"
        },
        {
            "content": "Absolutely spectacular and original",
            "review_date": "2017-12-30",
            "source": "rt"
        },
        {
            "content": "Beautiful movie! The story proceeds as a mystery around van Gogh's death. All scenes hand painted. A really great way to tell this story.",
            "review_date": "2017-12-30",
            "source": "rt"
        },
        {
            "content": "This movie over all felt like a very bad RPG.",
            "review_date": "2017-12-29",
            "source": "rt"
        },
        {
            "content": "The movie made me more interested in the Van Gogh’s life story. Many movies about him were made, but this entire painting film is epic. ",
            "review_date": "2017-12-29",
            "source": "rt"
        },
        {
            "content": "The most beautiful film ever made.",
            "review_date": "2017-12-27",
            "source": "rt"
        },
        {
            "content": "\"Narrative far less effectively composed\"?  You're kidding.  It was a highly creative approach, weaving together the facts and thoughts regarding Van Gogh and his final days.",
            "review_date": "2017-12-27",
            "source": "rt"
        },
        {
            "content": "The story was interesting but the 'artistic' choices made it so hard to love. It feels too much like a bad cover album by an amateur music school band. We've grown up with Van Gogh's depictions of these people and to change them to recognizable actors was a poor choice in my opinion. They could have easily used the live action reference footage and painted the people as Van Gogh did. Also take the beginning scene. Van Gogh painted in a broken/warped perspective style for a reason, the film nails it at first but then relies on reference footage and goes back to realistic correct perspective. If this had been a James Cameron production, like Titanic, he would have made sure every single detail was just as Van Gogh had intended. This isn't the Van Gogh I've grown up loving my whole life. And then their is the black and white footage... It feels like they were running out of time and used it as a cut corner filler. \n\nOverall this is a fair and noble attempt and was a good idea. The execution just falls too flat for me to love.",
            "review_date": "2017-12-27",
            "source": "rt"
        },
        {
            "content": "Has to be a top 10 of 2017. Overwhelmingly beautiful. You can't deny its masterful technique, nor the power and poignancy of the artist's story. Radiates with humanism, with some very memorable performances.",
            "review_date": "2017-12-27",
            "source": "rt"
        },
        {
            "content": "The first fully painted animated film in history, this seven-years-in-the-making effort is often an incredibly beautiful and affecting film of the type that leaves cinema audiences sitting silent at its ends, apart from a few sobs, in contemplation of its simple message. The biography of Vincent Van Gough's last days is enthralling and revealing, leaving you much to think and talk about as you plan when you might see it again.",
            "review_date": "2017-12-27",
            "source": "rt"
        },
        {
            "content": "Love to see it again. Visually magical and unique.",
            "review_date": "2017-12-24",
            "source": "rt"
        },
        {
            "content": "A unique way to tell us a story about a unique person.  Loving Vincent is a visual masterpiece that narrates a satisfying story about Van Gogh.",
            "review_date": "2017-12-23",
            "source": "rt"
        },
        {
            "content": "Vividly depiction of Van Gogh's last days before he kills himself. Well crafted story with interesting details and robust characters accentuated with impressive visual artworks.",
            "review_date": "2017-12-23",
            "source": "rt"
        },
        {
            "content": "Visually amazing and great story.",
            "review_date": "2017-12-22",
            "source": "rt"
        },
        {
            "content": "This was a good idea that deserved better.  The sequences work best that are not hamstrung by creepy [whatever the modern equivalent is of rotoscoping].  The painting-over-live-action thing needs to die, unless the swimmy unsettlingness of it particularly suits the story.  It doesn't here.  It would have been a lot better if normal live-action had been sandwiched between free-form animation, or if only free-form animation had been used and the filmmakers had been willing to forego speculative first-person impressions.\n\nI think \"biopic\" is a generous term to apply to the storyline.  It's more like a slavish fanfic, and an amateurish one.  It's not clear to what extent it's based on fact so the audience can't trust it as a biography, and the writing and dialogue are embarrassingly stilted.",
            "review_date": "2017-12-22",
            "source": "rt"
        },
        {
            "content": "Fascinating and beautifully done.",
            "review_date": "2017-12-21",
            "source": "rt"
        },
        {
            "content": "Well deserved 4.5 stars for the sheer task of hiring a hundred artists or more to paint every single scene. The story line is good, but could have been better for a 5 star rating.",
            "review_date": "2017-12-21",
            "source": "rt"
        },
        {
            "content": "An authentic piece of art, very well told story it catches the audience from beginning to end.",
            "review_date": "2017-12-21",
            "source": "rt"
        },
        {
            "content": "After hearing about the details of what it took to make this film from one of the animators, I was even more blown away with the loving tribute to Vincent Van Gogh. All the performers and animators did a tremendous job with illustrating the life of the man while also paying homage to what he brought to the art world.",
            "review_date": "2017-12-20",
            "source": "rt"
        },
        {
            "content": "Such an extraordinary presentation of Vincent’s story. The animation was incredible. I went with 4 other rtists and we all just sat in the theatre after it ended and talked about how amazing it was!",
            "review_date": "2017-12-19",
            "source": "rt"
        },
        {
            "content": "Did Vincent kill himself or did somebody else kill him?\n\nWhat the 65000 oil painted frames told us is that depression can kill poor souls who see pureness in death-a cathartic release from the melancholia of living.\n\nAnimation-wise, it isn't new. Although a different medium was used, I find it similar to the animated adaptation of Kafka's 'A Country Doctor' but less eccentric.",
            "review_date": "2017-12-19",
            "source": "rt"
        },
        {
            "content": "Phenomenal. A true work of art and emotionally entertaining.",
            "review_date": "2017-12-18",
            "source": "rt"
        },
        {
            "content": "Such a wonderfull movie.\nlove the style, the artwork is stunning.\nalso, it's truly wonderful to see actual classic european style tragedy in cinema these days.\nThis one is truly a work of art and passion, Highly recommend it :)",
            "review_date": "2017-12-17",
            "source": "rt"
        },
        {
            "content": "This film is literally a work of art, and a once in a lifetime experience for any film fan. The movie is gorgeous to look at, and I was simply left in awe by how much work must have went into making it. Go see it if you can.",
            "review_date": "2017-12-17",
            "source": "rt"
        },
        {
            "content": "Absolutely amazing animation inspired by Vincent's painting.",
            "review_date": "2017-12-16",
            "source": "rt"
        },
        {
            "content": "Beautiful and creative. The artistry and plot concept are very imaginative. It's beautiful to watch. An obvious labor of love. ",
            "review_date": "2017-12-16",
            "source": "rt"
        },
        {
            "content": "3.9/5\n\nReviewing Loving Vincent is asking the question of wether the film wouldve still been as fascinating as it is without the marvelous visuals, and the answer for me is no, as what the visuals truly do beyond creating visual appeal is telling an investigation drama that revolves around the death of an artist, serving as a homage both as a film, and as a story that IS Vincent.",
            "review_date": "2017-12-14",
            "source": "rt"
        },
        {
            "content": "An unique animated film with gorgeous visuals and love to its subject.",
            "review_date": "2017-12-14",
            "source": "rt"
        },
        {
            "content": "I was expecting a more touching story...",
            "review_date": "2017-12-10",
            "source": "rt"
        },
        {
            "content": "Just cause a movie has a clever gimmick doesn't make it a good movie. Plus, you could have done this whole thing digitally and no one would have ever known the difference. What a waste of time ",
            "review_date": "2017-12-09",
            "source": "rt"
        },
        {
            "content": "amazing visual experience\nbringing paintings to life what else a artist can wish for",
            "review_date": "2017-12-09",
            "source": "rt"
        },
        {
            "content": "Entertaining and artistic. Subject matter is dark and depressing however.",
            "review_date": "2017-12-09",
            "source": "rt"
        },
        {
            "content": "Disappointment. Content was mediocre and they took too many animation technique short cuts in terms of form.. If every frame was a painting this would have been much better.",
            "review_date": "2017-12-08",
            "source": "rt"
        },
        {
            "content": "A really beautiful film visually.  CDW",
            "review_date": "2017-12-08",
            "source": "rt"
        },
        {
            "content": "It's just bad. I'm worried abou who wasted money and time into making this happen.",
            "review_date": "2017-12-07",
            "source": "rt"
        },
        {
            "content": "This is a great film because of how it was made. It was animated by hand, with artists painting in the style of van Gogh. It is fantastic! If you know anything about van Gogh's works, you will recognize the paintings made the basis for many of the scenes in bars or in the fields near Arles or Paris. It is a wonderful tribute to the inventor of Modern Art (the good kind!) \n\nThe actors also take great pains to pronounce \"van Gogh\" in proper Dutch fashion. I think you have to be Dutch to do it exactly right, but they get closer than I would.",
            "review_date": "2017-12-07",
            "source": "rt"
        },
        {
            "content": "O visual é lindo, apesar de a narrativa ser superficial e ficar muito longe de construir um Vincent mais complexo. Mas acho que o objetivo nem era esse, como ficou claro quando eles fecharam a sessão com \"Vincent\", do Don Mclean. Além das pinturas ganhando vida, o melhor do filme foi me dar o empurrãozinho que faltava para terminar a biografia.  :)",
            "review_date": "2017-12-05",
            "source": "rt"
        },
        {
            "content": "Such a wonderful film! It is beautiful on the large screen! I could watch this one hundred times and still find beauty over again. This may be timeless. Many thanks to the actors and especially the artists that painted this!",
            "review_date": "2017-12-05",
            "source": "rt"
        },
        {
            "content": "\"Loving Vincent\" is one of the most beautiful and powerful things you'll see this year. Surprisely, Saoirse Ronan   happen to have a wonderful part on this movie (Lady Bird, Brooklyn, Hanna).",
            "review_date": "2017-12-04",
            "source": "rt"
        },
        {
            "content": "A visual tour de force, this is a projection of Van Gogh's art by the 100 or more artists who painted every scene. It is rich with animations of the real-life actors, who are painted convincingly in the Van Gogh style, using scenes based on his actual and famous paintings, which spring astonishingly to life as the action arises.  Alternating with the Van Gogh pictures are biographical flashbacks, which are painted or drawn in black and white photo-realism, again of a very high artistic quality.  The story involves an inquiry into the circumstances of Van Gogh's death. In this, it is less satisfying dramatically, with loose ends, not grasping the nettle, and stopping short of an accusation of mortal envy.  The Gachet interview scene seems too easy and forgiving. The alternative explanation of the fatal gunshot, a mischief by an errant youth, also lacks reality because the inquisitor never questions the (then) boy. The film apologises for the failure of those around Van Gogh to save him.  This show is in no way humorous, yet it is recalls The Life of Brian, where Brian's followers parade by, complimenting him for sacrificing himself, instead of rescuing him. Here, the film dwells on Van Gogh's forgiveness of the unforgivable - \"don't blame anyone\" he is reported to have said, as he lay dying needlessly of an untreated gunshot wound, while several characters come by to see him.  The film produces evidence that he was not suicidal, and that suicide was unlikely in the circumstances, and then it goes soft. The critical point about Van Gogh's art is his reach into the condition of the poor, farm workers, women and the hard struggle of life, and into nature.  He related most easily with and lived among working people and peasants: in that sense he was a traitor to his class. To combine these sentiments with his artistic power must have driven his well to do friends to distraction, particularly those who wished they could paint. If as it seems Van Gogh also won the heart of a bourgeois woman, half his age, the resentment he inspired must have run deep. The film dips its toes into this unpalatable water, and then weakens, in favour of vague philosophising - was it just Vincent just being Vincent, and did it really matter whether he committed suicide or was killed.  Really? Van Gogh's paintings were both sophisticated and fearless; he had enormous generosity of spirit. This film is loving compliance more than it is loving Vincent, and in the end it leaves him to the wolves.",
            "review_date": "2017-12-04",
            "source": "rt"
        },
        {
            "content": "The film preserves itself in a constant and moderated pacing, since is purely a recreation of events, flowed in between present and flashbacks, but the esthetics, techniques, and the art itself (a movie purely made in hand draw) works perfectly in order to deliver the ideal representation and incarnation of Vincent Van Gough's true persona, offering at the same time a romanticized and touchingly dramatic approach into the artist's tragic fate.",
            "review_date": "2017-12-03",
            "source": "rt"
        },
        {
            "content": "Beautiful and educational",
            "review_date": "2017-12-02",
            "source": "rt"
        },
        {
            "content": "A boring story that is chalk full of cliches basically drown this wonderfully animated flick. Grade: C+",
            "review_date": "2017-12-02",
            "source": "rt"
        },
        {
            "content": "Amazing film. A true tribute to van goh by these artists who work tirelessly to give life to this movie. I am guessing this would be the one and only film ever made purlely with oil painting. You need to watch it with your heart to truly appreciate this.",
            "review_date": "2017-12-02",
            "source": "rt"
        },
        {
            "content": "Would be a great biopic on its own without being stylized the way it is but I personally really enjoyed the look of the movie.",
            "review_date": "2017-11-30",
            "source": "rt"
        },
        {
            "content": "Everyone should see this film - its like no other!",
            "review_date": "2017-11-30",
            "source": "rt"
        },
        {
            "content": "A beautiful exploration of the life of Vincent Van Gogh. Wonderfully painted and carefully made!",
            "review_date": "2017-11-29",
            "source": "rt"
        },
        {
            "content": "Cuando la originalidad se reinventa. Cuando la pintura se junta con el cine. Unica en su estilo. La historia puede resultar aburrida pero cada plano es digno de admirar",
            "review_date": "2017-11-29",
            "source": "rt"
        },
        {
            "content": "So beautiful. Being in love with Vincent already helped the minor fact that the plot was thin. However the main thrust, that we must appreciate what he gave to the world is true, and the movie helps us to do just that.",
            "review_date": "2017-11-27",
            "source": "rt"
        },
        {
            "content": "Visually this film is amazing. Especially if you are a Van Gogh fan already. I loved this film and will watch it again and again when it comes out on DVD.",
            "review_date": "2017-11-27",
            "source": "rt"
        },
        {
            "content": "This is one of the films that I liked the most in the year, each painting is fascinating. The story, despite being simple, catches you and moves you. Do not stop seeing it. A work of art made of works of art.",
            "review_date": "2017-11-26",
            "source": "rt"
        },
        {
            "content": "Loving Vincent [Dorota Kobiela, Hugh Welchman, 2017, Poland-UK] Focused too much on visual mastery, wasn't impactful, narrative-wise. 7/10",
            "review_date": "2017-11-26",
            "source": "rt"
        },
        {
            "content": "Beautiful film to watch, as every shot is hand-painted in Van Gogh style. Slower pace but still an interesting film that gives a glimpse into the mysterious artist's final weeks.",
            "review_date": "2017-11-25",
            "source": "rt"
        },
        {
            "content": "I didn't know what to expect, but I had a vague idea.  100s of artists took Van Gogh' s paintings and made it into a cartoon with some live-action that had a cartoon-like look to it.  Very different, interesting and good.  Van Gogh painted 800 paintings in eight years.  Pretty amazing.",
            "review_date": "2017-11-24",
            "source": "rt"
        },
        {
            "content": "I loved this movie; one of the best I've seen in the last few years. Honestly I expected to be enlightened not entertained so the fact that I was riveted throughout the entire movie was a lovely surprise. The story is laid out like a murder mystery and the characters are fascinating. The animation is nothing short of breathtaking  and well worth the price of admission in and of itself.",
            "review_date": "2017-11-24",
            "source": "rt"
        },
        {
            "content": "Amazing, one of a kind movie. Not what I expected at all. The animation is based on Van Gogh style and incorporates some of his most famous works, usually as a background, but the movie tells its own story as a murder mystery of Van Gogh's death.",
            "review_date": "2017-11-23",
            "source": "rt"
        },
        {
            "content": "Using hundreds of visual artists painting in the vivid, impressionistic style of Van Gogh, Loving Vincent is a visually stunning work of animation. It fails unfortunately in its less memorable, cloak and dagger plot but the approach is visually groundbreaking nonetheless.",
            "review_date": "2017-11-22",
            "source": "rt"
        },
        {
            "content": "Loving Vincent is a wonderful movie. It captures the true achievements of Van Gogh. I would recommend this movie to anyone who wants to see visual effects of Van Gogh. It was one entertaining movie that i think people must go see",
            "review_date": "2017-11-22",
            "source": "rt"
        },
        {
            "content": "Amazing visuals. Such a beautiful tribute to Vincent. Might cause seizures though for people with photosensitive epilepsy.",
            "review_date": "2017-11-20",
            "source": "rt"
        },
        {
            "content": "Going into the movie I had low expectations. Walked out blown away by the cohesiveness of the whole thing, the stunning and fluid painting sequences, the narration and the plot, even though the last two were critically judged. In a film environment that is entirely too formulaic, this was a treat.",
            "review_date": "2017-11-19",
            "source": "rt"
        },
        {
            "content": "A true marvel of cinematography and painting combined into a masterful blend with wonderful voice acting and music. A message of love and hope and pain. Engaging from opening titles to final credits. A must see.",
            "review_date": "2017-11-18",
            "source": "rt"
        },
        {
            "content": "a good cinematic painting to tell us about vincent van gough",
            "review_date": "2017-11-18",
            "source": "rt"
        },
        {
            "content": "great concept...unbelievable artistry.  Entertaining, informative , educational, enjoyable.  And boundary breaking new use of old technology and traditional skills",
            "review_date": "2017-11-18",
            "source": "rt"
        },
        {
            "content": "A simple detective story that motivates you on the biography of this great artist gets put on a notorious display by an animation technique that surprises, but tends to became somehow irrelevant by the end. The permanent references to Van Gogh masterpieces causes a permanent attention for any Van Gogh lover.",
            "review_date": "2017-11-16",
            "source": "rt"
        },
        {
            "content": "Loving Vincent is a wonderful movie that captivates at its complex simplicity.  Knowing the history of how it was made, ( every frame handpainted) makes it that much more captivating and wondrous.",
            "review_date": "2017-11-15",
            "source": "rt"
        },
        {
            "content": "A lovely film with a well earned look at the most recent theory of Van Gogh's death.  The artistry exhibited here begs for more in this mode.  Can't figure out how that can be done...but I'd go see it!",
            "review_date": "2017-11-14",
            "source": "rt"
        },
        {
            "content": "remarkably done but the story is sorely lacking",
            "review_date": "2017-11-13",
            "source": "rt"
        },
        {
            "content": "Absolutely fantastic animated film about the unappreciated during his lifetime genius Vincent van Gogh! \nBeautiful and moving to tears.",
            "review_date": "2017-11-12",
            "source": "rt"
        },
        {
            "content": "Loving Vincent, was absolutely incredible!  A superb job of narration without becoming too overly complex and thus competing with the visual mastery playing out on screen. Loving Vincent, was a fresh and unique perspective on VanGogh in the year following his death. A true work of art and a cultural treasure in and of itself! Bravo!",
            "review_date": "2017-11-12",
            "source": "rt"
        },
        {
            "content": "Visually stunning and emotionally abundant.",
            "review_date": "2017-11-12",
            "source": "rt"
        },
        {
            "content": "I can't even begin to imagine the effort needed to hand paint this beautifully created movie with painstaking impressionist detail. The story was an interesting rendition of a biography based on a unlikely subject researching into the death of the artist. It was a simple story told in a colourful manner, yet without embellishment. It was almost too matter of fact with the main points mentioned only. Almost like his painting to me which bring out the subject and the main point, but the details of the scenery/image is only an impression, an idea.",
            "review_date": "2017-11-12",
            "source": "rt"
        },
        {
            "content": "Today I was so very fortunate to see the amazing film 'Loving Vincent', a unique film in that each scene is hand painted in the breathtaking Van Gogh style. I really don't have words to adequately describe just how visually gorgeous the images are. Likewise the content is especially captivating and thought provoking as it explores the life and death of the master artist. This film is an emotionally powerful and rare experience for any lover of art and life.",
            "review_date": "2017-11-11",
            "source": "rt"
        },
        {
            "content": "A beautiful, artistic and even fascinating take on the renowned artist that deserves all the attention it gets.",
            "review_date": "2017-11-11",
            "source": "rt"
        },
        {
            "content": "Love the end credi sequence, and yes Vincent never killed himself, he was shot by someone else.",
            "review_date": "2017-11-11",
            "source": "rt"
        },
        {
            "content": "This is one of the most beautiful, creative and imaginative films I have ever seen. As someone who loves the work of Van Gogh, it was an amazing experience to watch and feel his work come to life.",
            "review_date": "2017-11-10",
            "source": "rt"
        },
        {
            "content": "An amazing experience and absorbing storey line",
            "review_date": "2017-11-10",
            "source": "rt"
        },
        {
            "content": "Loving Vincent is a dialogue short of brilliant but a visual spectacle that's the reason for many people going to the movies. It's creative rotoscoping is not only beautiful, but also it's an amazing and awesome amount of work. I really liked the movie a lot. The scene in France, in Starry Night by Van Gogh, took me away into a dream world. Watching the movie brings a lot of laughs. I think the barkeep/slick Frenchman is funny. It is a fine work of art, in moving pictures, creating a deeper connection with paintings of Van Gogh's, transmogrifying viewers into early 20th Century Bohemian Europeans. I recommend seeing it. It's a good experience.",
            "review_date": "2017-11-09",
            "source": "rt"
        },
        {
            "content": "Impressive and very creative movie. ",
            "review_date": "2017-11-09",
            "source": "rt"
        },
        {
            "content": "Well, I'm a little torn. On one hand, this is a story we've all heard ad nauseam on how Van Gogh died. There's zero new information here and no new perspective or insight either. That said, it's a visually beautiful and engaging film and really that's kind of what matters more here.\n\nIt's a rotoscope oil paint movie! That's badass as hell. And considering everybody probably shot this on green screens I was also pretty impressed with the acting - it absolutely manages to come across despite being a like third degree delivery (from green screen to projected on canvases to painted to projected on screen as animation). And the art itself is stunning and clever, with almost every introduction of each characters represented visually as they were originally painted by Van Gogh.\n\nSo yeah, the concept overshadows the story but at the end of the day what did you really expect? Drink some caffeine and enjoy it for its beauty.",
            "review_date": "2017-11-09",
            "source": "rt"
        },
        {
            "content": "Breathtaking in all the colors and textures of a Vincent Van Gogh masterpiece and you are inserted into that masterpiece. Visually mind blowing!",
            "review_date": "2017-11-08",
            "source": "rt"
        },
        {
            "content": "A really interesting animated film made by paints",
            "review_date": "2017-11-08",
            "source": "rt"
        },
        {
            "content": "Beautiful,  inventive,  and emotional!",
            "review_date": "2017-11-07",
            "source": "rt"
        },
        {
            "content": "Dorota Kobiela was the co-writer and co-director alongside with her husband Hugh Welchman who also worked as co-producer for \"Breakthru Films\". I will leave a link to the official site of the movie so you can see the rest of the wonderful creators who helped made this motion picture, because I could write for years trying to thank them for the mind blowing movie experience they gave me.\nTo see \"Loving Vincent\" is to be a part of film history, every frame of the movie is an oil painting, you have never seen a movie like this, to see how every stroke of the brush move on the face of the protagonist is amazing, the detail that all of the artist have put to every character and also to maintain Van Gogh style has been achieved to perfection.",
            "review_date": "2017-11-07",
            "source": "rt"
        },
        {
            "content": "Reminiscent in visual style of Waking Life or A Scanner Darkly, Loving Vincent is a stunning labor of love, exploring the final chapter of Van Goghs enigmatic life and death. \nOver 100 artists painstakingly hand painted each frame in Vincents unique impressionist fashion, bringing his paintings to life in continual movement of brush strokes and palette.\nDirectors Dorota Kobiela and \nHugh Welchman masterfully blend Van Goghs paintings with a voice over mystery that entices while challenging the presumed notions surrounding the troubled and misunderstood genius. \nAn incredible innovation in filmmaking, Loving Vincent is not to be missed. \nWithout a doubt, Oscar contender.",
            "review_date": "2017-11-06",
            "source": "rt"
        },
        {
            "content": "UNIQUE! CREATIVE! Fascinatingly animated, this is lovely!",
            "review_date": "2017-11-05",
            "source": "rt"
        },
        {
            "content": "Beautiful. Visually and otherwise.",
            "review_date": "2017-11-05",
            "source": "rt"
        },
        {
            "content": "AN AMAZING, UNIQUELY ARTISTIC, EXTREMELY MEMORABLE AND EMOTIONALLY PROVOCATIVE  MOVIE!  GOING TO SEE IT AGAIN! THIS MOVIE NEEDS TO BE SEEN ON CINEMA SCREEN AND NOT AT HOME.   SHOULD GET AN AWARD !",
            "review_date": "2017-11-04",
            "source": "rt"
        },
        {
            "content": "I’ve never seen anything like it before. A true artistic masterpiece and a tribute to Vincent.",
            "review_date": "2017-11-04",
            "source": "rt"
        },
        {
            "content": "Very well done with off the chart creativity!",
            "review_date": "2017-11-04",
            "source": "rt"
        },
        {
            "content": "Visually stunning, profoundly moving. A must see",
            "review_date": "2017-11-04",
            "source": "rt"
        },
        {
            "content": "Creativity at its peak: one can only love it or hate it #LovingVincent. Bravo! Encore! #DorotaKobiela and #HughWelchman",
            "review_date": "2017-11-04",
            "source": "rt"
        },
        {
            "content": "Deserves 10 stars!  Beautiful film with extraordinary creativity!  Loved it from beginning to credits rolling with a poignant rendition (by Lianne La Havas) of Starry Starry Night!  I left the theatre in a trance. Just beautiful! I want to see it again!",
            "review_date": "2017-11-04",
            "source": "rt"
        },
        {
            "content": "Ive been anticipating its arrival for several years now and for me, there really are no words for its breathtaking beauty.",
            "review_date": "2017-11-03",
            "source": "rt"
        },
        {
            "content": "Indeed it helps to be an obsessed Van Gogh fanatic like myself to enjoy this movie, but wow!! how amazingly original this production is, bravo to everyone!",
            "review_date": "2017-11-02",
            "source": "rt"
        },
        {
            "content": "A visual and emotional wonder.  Overwhelming in it's beauty.",
            "review_date": "2017-11-02",
            "source": "rt"
        },
        {
            "content": "I have been longing to see this film, as to me it is the most ambitious film I have heard of.  Each frame of this movie is a painting.  A PAINTING.  In visuals, it surpasses all previous films that have ever used or relied on old-fashioned rotoscoping and can easily contend with traditionally animated films.  A concept unheard of, and a story that makes for a fascinating and beautifully artistic biopic worthy of Vincent Van Gogh, with many images and scenes calling back to his most famous works.  The visuals are so seamless it is easy to forget that everything you're seeing has been painted.  For any fan of animation, for any film buff, for anyone who loves the work of Vincent Van Gogh and great painting, see this film.",
            "review_date": "2017-11-01",
            "source": "rt"
        },
        {
            "content": "This is a passion project that works on so many levels. The story, while not as organized as I had hoped, does depict the workings and behaviors of a man so illusive to the modern day masses. Loving Vincent is a film that needs to be commended, not only on a stunningly beautiful recreation of Van Gogh's vision, but by portraying the impact this one man had in the lives of a community. It seems easy to label someone as something and to move on in life, to cast judgement on those we see as different, yet this film reminds me that there is more to a person than just what I see with my own two eyes. Sometimes, the best way to truly learn of someone is to see what kind of 'impression' he left on others.",
            "review_date": "2017-11-01",
            "source": "rt"
        },
        {
            "content": "LOVING VINCENT-2017(PG-13)-Oct. 27.\nBy:Clem The Movie Guy.\n\nWhat was originally intended to be a seven-minute short film evolved into a full-length feature uniquely exploring the tragic story of Vincent Van Goghs death through the use of hand-painted frames. The film took over two years to make utilizing the skills of 125 professional artists who painted nearly a thousand canvases to create the 6,500 frames that comprise Loving Vincent, the first fully hand painted animated feature film. Loving Vincent takes place a year after the death of Vincent Van Gogh (Robert Gulaczyk.) Vincents good friend Postmaster Roulin (Chris ODowd) asks his son Armand (Douglas Booth) to hand deliver Van Goghs last letter to his brother Theo. Armand reluctantly accepts the task & begins a complicated & mysterious journey. After visiting Pere Tanguy (John Sessions) who tells Armand that Theo died shortly after hearing of his brothers death, Armand heads to Auvers-sur-Olse to the home of Dr. Gachet (Jerome Flynn) who took care Vincent after his release from the asylum. While waiting to see Dr. Gachet, Armand begins conversations with a variety of people who had some interaction with Van Gogh prior to his death ; Adeline Ravoux (Eleanor Tomlinson), the temporary proprietress of the local inn where Vincent was staying, Dr. Gachet s housekeeper, Louise Chevalier (Helen McCrory), Dr. Gachets sheltered daughter Marguerite (Saoirse Ronan), & local boatman (Adan Turner). As each person reveals their version of the events leading up to Vincents leading death, Armand begins to question whether Vincent really committed suicide or was murdered. Loving Vincent is directed by the husband & wife team of Dorota Kobiela & Hugh Welchman who co-wrote the screenplay with Jacek Dehnel. They have created a uniquely beautiful tribute to the heartbreaking & compelling story of a true geniuss brief but prolific life. The oil painted animation was stunning with each scene painted in Van Goghs signature style. The performances from cast, who performed in front of a green screen, were captivating. Loving Vincent is a film for those who are fans of amazing art & powerful film. MUST-SEE FILM.",
            "review_date": "2017-10-31",
            "source": "rt"
        },
        {
            "content": "Visually stunning, that is if you appreciate Vincent's work, which I do.  The story line kind of dragged on but I'm so glad they addressed the theory of homicide as opposed to the suicide angle.  Disappointed in the ear story as this too may not be the truth.  I adore Van Gogh's work.  Thank you for such a beautifully made movie.",
            "review_date": "2017-10-30",
            "source": "rt"
        },
        {
            "content": "Just wonderful. Most imaginative & heartfelt movie Ive seen in a long time.",
            "review_date": "2017-10-30",
            "source": "rt"
        },
        {
            "content": "Artistic and a an interesting (but slow developing) story, with interesting characters and good acting.",
            "review_date": "2017-10-30",
            "source": "rt"
        },
        {
            "content": "My favorite movie so far this year. \nBeyond being so visually fascinating, the story holds up well enough to offer insights into this incredible man",
            "review_date": "2017-10-30",
            "source": "rt"
        },
        {
            "content": "Visually stunning film and an interesting look at van Gogh's last 2 weeks of life",
            "review_date": "2017-10-30",
            "source": "rt"
        },
        {
            "content": "I was blown away by the quality and craftsmanship of this film, the story itself is very engaging and the characters are cinematic homages to Van Goghs impressions of the people around him. I sincerely loved and connected to this movie, I highly recommend it.",
            "review_date": "2017-10-29",
            "source": "rt"
        },
        {
            "content": "A big leap ahead in the art of animation. Beautiful! Not to be missed.",
            "review_date": "2017-10-29",
            "source": "rt"
        },
        {
            "content": "Such a unique and beautiful film. Can't imagine the amount of work that went into this. Not only visually beautiful, but also includes an intriguing story - looking into Van Gogh's life and death.",
            "review_date": "2017-10-29",
            "source": "rt"
        },
        {
            "content": "Must see one of a kind. I loved the arts which is pretty much every single scene in this movie. Each can be printed into an amazing poster. Great story and amazingly well done.",
            "review_date": "2017-10-28",
            "source": "rt"
        },
        {
            "content": "Amazing! The style of most the frames was beautiful. I did feel the black & white scenes were sort of a cop out not in full painting style, but story line in combination of the aesthetic was remarkable. Very captivating and moving! A MUST WATCH FILM!!!",
            "review_date": "2017-10-28",
            "source": "rt"
        },
        {
            "content": "A true joy to watch...",
            "review_date": "2017-10-28",
            "source": "rt"
        },
        {
            "content": "Beautiful, gorgeous to watch. The story line is just adequate to keep you watching the rich, vibrant visuals. I truly felt as if in a Vincent Van Gogh painting. Must see on the big screen.",
            "review_date": "2017-10-28",
            "source": "rt"
        },
        {
            "content": "I read the synopsis of this movie before I went and I knew that Van Gogh's work would be animated and featured.  What I didn't realized is that like Turner's colorized movie characters, this movie had hundreds of artists Van-Goghized all the people in this movie -- stage but very interesting.  Occasionally, a realistic form of the person appears.  Given the horrible state of movies this year, this movie actually is very good.",
            "review_date": "2017-10-27",
            "source": "rt"
        },
        {
            "content": "If you love art, go see this amazing artistic achievement!",
            "review_date": "2017-10-27",
            "source": "rt"
        },
        {
            "content": "5 stars for the look and the effort that went into it. 1 Star for the story, therefore a 2.5 Star review. Why take this narrative approach with such a difficult and time-consuming filmmaking process when there are so many great things to explore in Vincent's life to make the story equally as good as the visuals.",
            "review_date": "2017-10-27",
            "source": "rt"
        },
        {
            "content": "A brilliant celebration of the artist's love, life and passion for creating .",
            "review_date": "2017-10-27",
            "source": "rt"
        },
        {
            "content": "Wonderful film, masterpiece! very touching story as well. highly recommend!",
            "review_date": "2017-10-26",
            "source": "rt"
        },
        {
            "content": "Beautiful, but, the story itself wasn't interesting enough to make it watchable.  Walked out.",
            "review_date": "2017-10-26",
            "source": "rt"
        },
        {
            "content": "This movie is an amazing work of art! Don't miss it.",
            "review_date": "2017-10-26",
            "source": "rt"
        },
        {
            "content": "Excellent masterpiece, honoring its name.",
            "review_date": "2017-10-26",
            "source": "rt"
        },
        {
            "content": "Its a new experience in the Theater and I love it",
            "review_date": "2017-10-25",
            "source": "rt"
        },
        {
            "content": "The notion that the art/paintings that tell the story is gimmicky is utter nonsense. This film is full of love and visually stunning. What a gift of the imagination.",
            "review_date": "2017-10-25",
            "source": "rt"
        },
        {
            "content": "While the meticulous production of this completely oil painted film is visually apparent and stunning, I found the story a little dry and rambling. As an artist, I appreciated how they managed to incorporate most of Van Gogh's paintings into the film, however as a moviegoer the story dragged and dialogue was repetitive.",
            "review_date": "2017-10-24",
            "source": "rt"
        },
        {
            "content": "A beautifully painted film. Exquisite animation to honor an artistic genius. A unique and mystery-driven take on a biopic. It doesnt delve quite as deep into the mind of Van Gogh as I wouldve liked, but Loving Vincent is still entertaining and beautifully made.",
            "review_date": "2017-10-24",
            "source": "rt"
        },
        {
            "content": "When a film as unique as this comes around it is almost expected the story will take a backseat to the outstanding production, yet Loving Vincent manages to enchant with its stunning hand painted visuals whilst keeping you engaged in its genuinely interesting story. Each of the artists who contributed to this project should be immensely proud I am sure this film will be shown for many years to come. It is a rare feeling to leave a cinema knowing you really have never seen anything like that before. This film I believe has broader appeal than its marketing suggest and I'd recommend it to those beyond the categories of art lovers or the 50+s.",
            "review_date": "2017-10-24",
            "source": "rt"
        },
        {
            "content": "Beautiful paintings and a lot of work but the plot isn't that great",
            "review_date": "2017-10-23",
            "source": "rt"
        },
        {
            "content": "Even if it's not the most complete narrative, it still boasts an amazing, inventive method of story-telling that'll certainly leave you stunned. \n\nThis feature-length painted animation -- the first film of its kind -- explores the life and unusual death of Vincent Van Gogh via depictions of his artworks. \n\nThis is the second film I've gotten to use my MoviePass on and let me just say that it's totally worth it. I was able to view this film at a small theater in Chicago called the Music Box Theater. It was like an old classic film theater with projectors that projected film. It was a really cool experience and honestly, it made watching this film even more fun.\n\n\"Loving Vincent\" is certainly an inventive film, and definitely one of its own kind. It takes advantage of multiple aspects used in film. It's like a combination between animation and stop-motion story-telling, however, it's told entirely through oil drawing paintings. I mean, how fucking cool is that? If that doesn't interest you as a filmmaker or as a fan, then I don't know what will. Every scene in this movie was painted over hand by hand, and it looked absolutely beautiful. Over 100 painters were used during the production, and it certainly came out beautifully. \n\nThe way the paintings were captured looked really good. It really did look like everything was in constant motion. What I think they did was they painted layers over and over the base painting, which gave they illusion of the painting moving as the filmmakers snapshotted each frame. It can be a little weird to look at at first, as your eyes have to adjust to unique movement that the frames display, but you quickly adjust and it becomes so worth it.\n\nThe sound design was also something that was very crucial and beneficial to this sound. I wouldn't say that the score or the sound effects were completely out of this world, but they added so much to something that is 2D. They brought life and realism to these gorgeous paintings and it made it feel so real. At times, it looked like these scenes were real, as it looked that spectacular. The sound design and editing team really put a lot into this film, making the experience even more memorable. \n\nWhat I didn't like about this film, which was actually a big negative, was the story itself. No, I'm not saying Van Gogh's story is uninteresting, because it certainly isn't. But the story is just the main character walking around for an hour and a half, having conversations about what really happened with Van Gogh. The movie really was all narrative, and they missed a huge opportunity by not telling the movie with the imagery. The imagery was such a huge part, but I couldn't find myself attached to the story because it was told in a very mundane way. \n\nIn the end, \"Loving Vincent\" was a very solid film and one that had a really unique take on it. I would certainly watch this film just to experience the innovative story-telling, even if it's not the strongest film as a whole.",
            "review_date": "2017-10-23",
            "source": "rt"
        },
        {
            "content": "Loving Vincent was beautiful, for sure, but it left me wondering why it was made. No effort was made to tie the narrative to the film's unique medium, creating a dissonant feel. Any attempt to discuss Van Gogh as an artist or a thinker was destroyed to make way for a contrived who-done-it story that brazenly ignored the truth of severe depression and attempted to validate the late artist by denying the truth of his experience. What could have been a beautiful way to explore this man and the way he saw the world ended up being a meandering journey which just so happened to be oil painted, and which left me feeling somewhat insulted by the end.",
            "review_date": "2017-10-23",
            "source": "rt"
        },
        {
            "content": "Imagine a moving portrait questioning all the major figures from the end of Van Gogh's life about a year after his death, a la Citizen Kane. Add to that a (small) dash of mystery that emerges from these interviews, which begin to sound like scenes from an Agatha Christie novel.\nThat's the whole narrative of this film, but it's less than half the experience. Every shot shimmers as the scenes transform from a static view of one of Van Gogh's paintings to a more conventional \"camera\" image, albeit painted in V.G. style. It reminded me a little of the Monty Python animated shorts with famous paintings. It's a real treat, but many may have to sit far back because every part of the screen is quivering with small motions of bright colors.",
            "review_date": "2017-10-21",
            "source": "rt"
        },
        {
            "content": "An amazing artistic achievement!!",
            "review_date": "2017-10-21",
            "source": "rt"
        },
        {
            "content": "Beautifully done. I wish the story was of Van Gogh rather than after he died.",
            "review_date": "2017-10-21",
            "source": "rt"
        },
        {
            "content": "Loving Vincent was put together keeping in mind which of Van Gogh's paintings were to be animated.. I think they did a great job with this limiting standard. Yes the story has to be followed to let it develop, but lots of movies, especially European ones seem to do this. Loving Vincent is well worth the time especially if you are tired of the immediate sensationalism most American movies offer.",
            "review_date": "2017-10-21",
            "source": "rt"
        },
        {
            "content": "Terrible movie, dull and boring.",
            "review_date": "2017-10-21",
            "source": "rt"
        },
        {
            "content": "A fascinating story and iIncredibly beautiful to watch.",
            "review_date": "2017-10-20",
            "source": "rt"
        },
        {
            "content": "Like nothing my eyes have ever seen. Absolutely wonderful in every way. A masterpiece!",
            "review_date": "2017-10-20",
            "source": "rt"
        },
        {
            "content": "Definitively not what I expected but good story telling goes a long way.",
            "review_date": "2017-10-19",
            "source": "rt"
        },
        {
            "content": "The narrative gets a little drab. But the visuals are to die for",
            "review_date": "2017-10-19",
            "source": "rt"
        },
        {
            "content": "Animation is amazing! The story is well told. Can't imagine a better way to tell Van Gogh's story. I learned a lot. MUST SEE!",
            "review_date": "2017-10-19",
            "source": "rt"
        },
        {
            "content": "Might be a good one to enjoy with your favorite mind altering substance as you'll be even more amazed by the artistic beauty and less annoyed with the rather dully told story.",
            "review_date": "2017-10-18",
            "source": "rt"
        },
        {
            "content": "Visually captivating but the unengaging narrative was a bit of a letdown.",
            "review_date": "2017-10-17",
            "source": "rt"
        },
        {
            "content": "Brilliant movie about the painter's death through paintings.",
            "review_date": "2017-10-17",
            "source": "rt"
        },
        {
            "content": "Beautiful movie. Stunning.",
            "review_date": "2017-10-16",
            "source": "rt"
        },
        {
            "content": "I loved this film and so cleverly done. The way the paintings were referenced (eg Dr Gachet) was a joy.",
            "review_date": "2017-10-16",
            "source": "rt"
        },
        {
            "content": "I wasnt that bothered about this film as I sat down, but with each passing minute became more in awe of the story, the animation and the style. I didnt, but if you know VVGs work, this film will enrapture even further as I learned during the end credits.",
            "review_date": "2017-10-16",
            "source": "rt"
        },
        {
            "content": "You never saw a movie quite like Loving Vincent.  This animated story what happened to Vincent VanGogh the year after his suicide is something to view.  The story stands on its own for its poignancy but the movie is done in the style of his paintings.  There never has been any movie quite like it.",
            "review_date": "2017-10-14",
            "source": "rt"
        },
        {
            "content": "Kind of like an oil painting \"A Scanner Darkly\" mixed in  with a CSI episode, Loving Vincent is visually a stunner that explores the death of the great Van Gogh.  Sure it could've been constructed on a computer but it took 150 artist to paint 65 thousand frames to realize this one of a kind gem.(10-14-17)",
            "review_date": "2017-10-14",
            "source": "rt"
        },
        {
            "content": "I believe this movie succeeds at its mission, to publicize both theories of his death and pay homage to the work of Vincent van Gogh.",
            "review_date": "2017-10-14",
            "source": "rt"
        },
        {
            "content": "It's so beautiful it hurts!",
            "review_date": "2017-10-14",
            "source": "rt"
        },
        {
            "content": "Brilliant and original. I shed a tear more than once. A must see for any fan of art.",
            "review_date": "2017-10-14",
            "source": "rt"
        },
        {
            "content": "The story is a mess, the writing is alright, and more than once were there issues with sound deign. Even so, \"Loving Vincent\" is one of the most visually stunning movies ever made accompanied by a beautiful soundtrack.",
            "review_date": "2017-10-13",
            "source": "rt"
        },
        {
            "content": "65,000 incredibly beautiful paintings make this excellent film",
            "review_date": "2017-10-12",
            "source": "rt"
        },
        {
            "content": "Beautiful and emotional, definitely an experience worth watching",
            "review_date": "2017-10-12",
            "source": "rt"
        },
        {
            "content": "The critics got it right.  This called an \"animation\" but really its something different visually.  Its almost psychedelic with the way the images move and blend the colors.  Sometimes the characters seem real at times.   All of the visuals mimic Van Gough's impressionistic style and the characters are taken from his paintings using actors with some sort of animation filter.  I have never seen anything like this and enjoyed it.  The point of the movies is to tell the story primarily about Van Gough's latter years and suggests an interesting alternative to the circumstances of his death and sheds light on and questions the extent of his mental illness.   The whole story and how and who tells it is very clever and captivating.  I highly recommend this movie.",
            "review_date": "2017-10-12",
            "source": "rt"
        },
        {
            "content": "Absolutely stunning. Van Gogh's art has come to life to tell this story. The acting, directing and editing are very well done.  Lianne La Havas rendition of Starry Starry Night at the end is worth sitting through all the credits.  This is so magical.  We will see it again and buy the DVD.",
            "review_date": "2017-10-11",
            "source": "rt"
        },
        {
            "content": "A Scanner Darkly - My Cousin Rachel - Hollywoodland",
            "review_date": "2017-10-11",
            "source": "rt"
        },
        {
            "content": "There's two immediate challenges I see when thinking about a film like this, and it has to mentioned, this is the first film of it kind. The first handed animated picture that actually captures the actors performances and not just their voice talents. Firstly is how on Earth do you make a film that's not only painted, but is done entirely in the style of their chosen artist which leads me to their second challenge; how does one (or two) tell a story about Vincent Van Gogh? \n\nI was fortunate enough to catch a Q&A screening for it's UK/ROI premiere which was hosted by London's own National Gallery; and I am so glad I did with answers being provided by Hugh Welchman, one half of the husband and wife team who directed the picture, one of the producers, Ivan Mactaggart, actors, Douglas Booth and Helen McCory; and one of the many artists that worked on the film, Sarah Wimperis. All of which gave a deeper understanding and a growing appreciation of this astounding film. \n\nWhat do we know about Van Gogh? Or what do we think we know about the troubled artist? He's considered the father of modern and western art, he cut his own ear off after what some suspect to be during a binge on absinthe. We all know many of his famous paintings of landscapes, portraits and self portraits, whether we recognise them to by him or not. \n\nSo how do they successful tell an interesting story of the artist that would appeal to the masses without becoming a documentary? Well, there's a brilliant narrative choosing to tell part of his story from after his supposed suicide turning this into an intriguing murder mystery that isn't a far-fetched story. It's been in constant debate among biographers, art historians and even the Van Gogh Museum regarding his supposed suicide, which leads this story down an open mystery.  \n\nMuch of the story is based on an immense amount of research as see through the story of Armand Roulin, one of Van Gogh subjects who reluctantly goes to Paris to deliver a letter to Van Gogh's brother, Theo; but he inadvertently unearths suspicion when he hears opposing stories from the people who knew Van Gogh. These parts being taken directly from the conflicting statements written after his death. \n\nDouglas Booth leads an incredible cast, playing Armand Roulin, who is amazing and is fast becoming one of my favourite actors, having seen him in The Limehouse Golem earlier this summer. I don't know what it is about him, but I honestly believe he would make an incredible Freddie Mercury. There's a strong supporting cast, all of whom had to model their respective character's pose from their portraits, and all give great performances that really adds another dimension to the animation. \n\nThe animation itself is a totally separate feat all together, never having seen anything like it. Some might suspect the technique of rotoscoping being used but the film is entirely hand painted and uses stop-motion animation. This was achieved with the incredible collaboration of some 120 different artists and painters who worked endlessly for over 2 years. Now these artists are not animators, so not only did they have to learn to understand animation they had to unlearn their own style and adopt Van Gogh's in so to bring his paintings to life. \n\nSo many of his works are used with his landscape pieces setting the scenes such as his 'Yellow House', 'The Night Café' and 'The Church at Auvers' whereas his portraits are used to introduce each character of the story, each being real life people he had met and painted. Sarah Wimperis, one the artists who worked on the film spent 5 months painting the wheat fields, around 300 frames worth that equated to about 30 seconds of screen time. The total project resulting in some 65,000 paintings ending up with around 900 canvases which some had been sold to help finance the film, some gifted to cast and crew and the rest currently being auctioned off. \n\nIt's spectacularly unique and stunningly vivid using Van Gogh colour palette throughout apart from the gorgeous black and white sequences which depicted times before his death with the vibrant colourful scenes representing the present narrative. The film's ratio is also respectful of Van Gogh, using the academy ratio which is the closest format to the canvases he would have painted on. \n\nAll of this accompanied by an impressive and alluring score from Clint Mansell, a composer the makers originally wanted and who at first refused. The studio had used a playlist of Mansell's previous pieces to help inspire the film creation. Glady Mansell changed his mind last minute and agreed to work on the project composing thrilling and enchanting tracks that are titled and inspired by Van Gogh famous pieces. Lianne La Havas does an amazing rendition of Don McLean's 'Vincent' to boot. \n\nOverall, this is the most ambitious film I have seen this year, and one of the ambitious films of all time that has created a masterpiece, a perfect amalgamation of stunning artistry and enthralling storytelling that's both educational and inspirational. I would be very excited to see other artists life's work portrayed in such a creative and visually brilliant way. Did I hear right that Gogos would be an idea? \n\nRunning Time: 9\nThe Cast: 8\nPerformance: 8\nDirection: 10\nStory: 10\nScript: 10\nCreativity: 10\nSoundtrack: 10\nJob Description: 10\nThe Extra Bonus Points: 10 for being an unique, visual masterpiece that melds perfectly with great storytelling. \n\n95% 10/10\n\nwww.spoileralertreviews.co.uk",
            "review_date": "2017-10-10",
            "source": "rt"
        },
        {
            "content": "A must see if you a lover of van gogh. This film was painstakingly made with a real focus on the magic of  van gogh.",
            "review_date": "2017-10-09",
            "source": "rt"
        },
        {
            "content": "Fantastic film, with a great story and gripping content. Loved this film and so glad I went to see it! \nWould recommend any film lovers to see this and appreciate the time and effort gone into it's creation.",
            "review_date": "2017-10-09",
            "source": "rt"
        },
        {
            "content": "Just saw the movie Loving Vincent. Each frame is painted. 65000 painted frames in the style of Vincent Van Gogh! An irridescent and beautifully textured masterpiece. The story is equally emotive and multi layered. Excellent casting choices. Reminds me a little of a film called \"Waking Life\" but this is far more watchable and the painting technique far more luminous and vibrant. One is pulled into a swirling beautiful painting about Van Goghs life. The soundtrack is epic too. PERFECT. MIND BLOWN!",
            "review_date": "2017-10-09",
            "source": "rt"
        },
        {
            "content": "A truly visionary film using hand-painted recreations of Van Gogh's style to tell the investigation into the death of Vincent Van Gogh as a man delivers a letter to his brother Theo.",
            "review_date": "2017-10-08",
            "source": "rt"
        },
        {
            "content": "Stunning! Like living in a painting. Like an open door into the mind of this prodigy. Like James Bond but better! Like having a really engaging dream but in the middle you wake up and it hits you in the head and you forget what you were dreaming of...and you get really mad... still great",
            "review_date": "2017-10-08",
            "source": "rt"
        },
        {
            "content": "If you appreciate the work of Van Gogh, get yourself to a theater and see this movie. It is visually stunning. A beautiful tribute to the tortured artist. It is a must-see on the big screen if not for seeing the texture of the brush strokes alone. As to the story, I couldn't help but wonder why, after the directors saw their first tests come to life, that they didn't take a different approach to the story. Sadly, far too absent from the narrative is the artist himself. Since his paintings are the way that Vincent saw the world around himself, tackling that approach would have seemed a better story than what the director's chose. The most touching part of the film was the closing credits. So much love and care went into this film however, that its story line is easily forgiven.  I would recommend seeing this film, but only to the kind of people who I thought would really appreciate it.",
            "review_date": "2017-10-08",
            "source": "rt"
        },
        {
            "content": "A visually stunning film that is clearly a labor of love. Should be appreciated by anyone with even a passing knowledge of Van Gogh's art and life. \n\nSPOILER ALERT: I was thrilled at the rendition of Don McLean's Vincent during the end credits as it had been playing in my head throughout the film.",
            "review_date": "2017-10-08",
            "source": "rt"
        },
        {
            "content": "Indubitably the best movie I've ever seen. Truly a piece of art, something that seems slow at first, but quickly captures you in the majesty that is the film. It ends on a bittersweet and heartbreaking ending, leaving you sad but somehow hopeful. I would definitely recommend it.",
            "review_date": "2017-10-08",
            "source": "rt"
        },
        {
            "content": "Maybe the most visually beautiful film I've ever seen, and emotionally resonant as well. Worthy of Vincent, which is about as high praise as I can give.",
            "review_date": "2017-10-07",
            "source": "rt"
        },
        {
            "content": "Amazing visual experience. Very well done. A must see for art lovers.",
            "review_date": "2017-10-06",
            "source": "rt"
        },
        {
            "content": "I really wanted to love this film but why such a drag of a storyline taking place after Van Gogh death? Why are the French speaking in Downton Abbey English? Why make an investigative film without any poetry about an artist whose paintings are all poetry? Why paint the photograms of a dramatization instead of painting the animation from scratch?",
            "review_date": "2017-10-06",
            "source": "rt"
        },
        {
            "content": "Brilliant, like nothing you have ever seen, plus an amazing story of one of greatest artist that ever lived.",
            "review_date": "2017-10-04",
            "source": "rt"
        },
        {
            "content": "Amazing movie with incredible music. It's much more than just a film it's like a visual journey into Vincent's paintings. SPOILER ALERT: final song gives you goose bumps!",
            "review_date": "2017-10-04",
            "source": "rt"
        },
        {
            "content": "Visually stunning impressionistic film noir",
            "review_date": "2017-10-03",
            "source": "rt"
        },
        {
            "content": "A must...    the audience stood up and clapped...",
            "review_date": "2017-09-30",
            "source": "rt"
        },
        {
            "content": "Billed as \"the world's first fully painted feature film\", the dreamy 'Loving Vincent' is a visually arresting tribute to the works of Vincent van Gogh. Crafted as a 19th century whodunit, the story focuses on the mysterious circumstances behind the artist's untimely death in 1890 at the age of 39. Inevitably, the revolutionary process by which the movie was assembled (involving 65,000 individual oil paintings on canvas acting as the film's frames!) is the real story here, and the end result is nothing short of astonishing. Watching some of the artist's most beloved paintings literally come to life is a wonder to behold, even if its impact begins to wane after a while. A one-of-a-kind experience for fans of van Gogh and animation alike.",
            "review_date": "2017-09-24",
            "source": "rt"
        },
        {
            "content": "The paintings are what makes this movie amazing, fantastic and full of art.",
            "review_date": "2017-09-24",
            "source": "rt"
        },
        {
            "content": "Amazing art!  A must see.",
            "review_date": "2017-09-23",
            "source": "rt"
        },
        {
            "content": "Van gogh's life story is as fascinating as his paintings are mesmerizing. An incredible experience to enter the world of Van Gogh and his artwork's iconic swirls, brush strokes and colors. I hope this is a start of an new and exciting way to delve into thge world of fine art masters. Loving Vincent pioneers an exquisit oway to further appreciate the timeless genius a Vincent Van Gogh.",
            "review_date": "2017-09-23",
            "source": "rt"
        },
        {
            "content": "Beautiful imagery partnered with an eye opening tale of Van Gogh's life and death- unlike anything I have ever seen before!",
            "review_date": "2017-09-22",
            "source": "rt"
        },
        {
            "content": "The story of one of Europe's famously talented, yet troubled artist being presented in the form of the world's first oil-painted film was enough to make me want to see \"Loving Vincent\". Although the retelling of events in the film gets tiring and repetitive (which drags the film a bit), the film's acting, direction, and amazing paintings - done in the style of Van Gogh - that served as the animation was enjoyable. One of the best animated films of the year!",
            "review_date": "2017-09-21",
            "source": "rt"
        },
        {
            "content": "If you consider yourself a lover of art or paintings then you MUST see this film. This is a MASTERPIECE. A true labor of love, beautiful. Get down to the ArcLight and see it today. There probably won't be another film like this. And also, sit in the front row.",
            "review_date": "2017-09-18",
            "source": "rt"
        },
        {
            "content": "This film was phenomenal. An amazing, visual masterpiece that keeps your attention till he very end. Even after the credits.",
            "review_date": "2017-09-16",
            "source": "rt"
        },
        {
            "content": "truly an amazing film. wonderfully created and put together. the story was so moving, if you didn't know much about Vincent Van Gogh this would have you on the edge of you seat. Just a beautiful tribute to an amazing artist.",
            "review_date": "2017-09-07",
            "source": "rt"
        },
        {
            "content": "A noble artistic effort. B",
            "review_date": "2017-09-06",
            "source": "rt"
        },
        {
            "content": "Visually mesmerizing in every sense of the words, what started out as a simple true murder mystery has become an enchanting exploration of the further possibilities of cinema as an art.",
            "review_date": "2017-08-29",
            "source": "rt"
        },
        {
            "content": "I felt this was amazing and beautiful beyond words. Saw it multiple times and still cried.",
            "review_date": "2017-08-29",
            "source": "rt"
        },
        {
            "content": "The best animation I've seen in years. This movie is like a moving art piece. Wait, it is. May not be a upper storywise, but the animation is just gorgeous. Deserves the oscar for best animated feature. But it won't win because Disney or Pixar always wins. With all the terribly amimated movies, storywise and animation wise, Loving Vincent steals 2017's animation race. Hopefully, it is all true, though. It may not be. But, it is still the best animated movie of the year. A",
            "review_date": "2017-08-28",
            "source": "rt"
        },
        {
            "content": "The ambition and effort that went into creating Loving Vincent is an astonishing achievement in filmmaking. This biopic about Van Gogh honors the timeless artist with its breathtaking visuals as every frame was hand painted to resemble the style of the master himself. Seven years of arduous labor definitely paid off for this stunning film accomplished what no other has ever dared  to create.",
            "review_date": "2017-08-28",
            "source": "rt"
        },
        {
            "content": "Beautifully adapted story line, ... stunning artistry, a heart warmer & heart breaker, ...this drama draws you in, ... Loving Vincent will leave  you breathlessly wanting more, and not without a tear.",
            "review_date": "2017-08-24",
            "source": "rt"
        },
        {
            "content": "For anyone who is an artist or an inspiring artist this is a must see film. Put together by 100 individual artists who hand painted (In Van Gogh Fashion) every sequence in the film.\n\nThe story of a young journalist obsessed with finding what really happened to Van Gogh...Murder or Suicide?\n\nThe film doesn't move a mile a minute but boasts some of the most awe inspiring animation I have ever seen. Van Gogh was a troubled genius but this film focuses on those around him & his influence & legacy.",
            "review_date": "2017-08-22",
            "source": "rt"
        },
        {
            "content": "A major effort in the making it must surely be an event to screen, 'Loving Vincent' is a fascinating and truly beautiful animated feature most stunningly of all is that the entire film, frame-by-frame is rotoscoped in the unique and stunning oil paint style of the late painter to tell a compelling, fascinating and heartwarming story about an investigation into the life of the posthumous master painter. Even with authentic settings and a cast of colourful character both figuratively and literally, the film is a hugely investing and outstandingly beautiful film to see, almost verging from the very dramatic plotting to the eye catching surrealist aspect of the art-house sphere this film is fixed within. While it's hard to determine whether or not the mystery of the late painter's death can be explained, especially alongside the historical accuracy aspect of this film, everything else about it from the initial premise alone is enough to recommend to all audiences young and old to experience even well before you could say 'Oscar for Best Animated Film' since the oil work paintings are it's signature look while the feel comes from the technical and written aspects alone. I wish I could give this my perfect grade though something inside me is doubting it figuratively especially along the lines of historical accuracy and overall sustenance.",
            "review_date": "2017-08-20",
            "source": "rt"
        },
        {
            "content": "Watch this if you want to see Vincent Van Gogh's paintings come alive. But if you're after a compelling story, you won't get it here.",
            "review_date": "2017-08-12",
            "source": "rt"
        },
        {
            "content": "If you have any interest and appreciation for the work and story of Vincent Van Gogh you need to see this movie.  Completely unique method of making this film 100% from oil paintings that took years to complete.  Amazing with an interesting mystery on how he died.",
            "review_date": "2017-08-03",
            "source": "rt"
        },
        {
            "content": "a MUST see The film is alive",
            "review_date": "2017-07-25",
            "source": "rt"
        }
    ]
}