{
    "rating": 2.3,
    "release_date": "2017-02-03",
    "num_reviews": 562,
    "genres": [
        "Horror",
        "Mystery&thriller"
    ],
    "summary": "A young woman (Matilda Lutz) becomes worried about her boyfriend (Alex Roe) when he explores a dark subculture surrounding a mysterious videotape said to kill the watcher seven days after he has viewed it. She sacrifices herself to save her boyfriend and in doing so makes a horrifying discovery: there is a movie within the movie that no one has ever seen before.",
    "reviews": [
        {
            "content": "Just plain rubbish. Stay away from this franchise misfire",
            "review_date": "2023-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed the first two even though they weren't scary but this one is a mess.",
            "review_date": "2022-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'll be honest I haven't seen all the ring movies. But I didn't think this movie was bad. The acting was pretty good, the atsomphere was pretty creepy and the ending twist was great. Probably one of the most overhated movies i've ever seen. It really wasn't that bad.",
            "review_date": "2022-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "almost cried for the 2 Rings before that did great",
            "review_date": "2022-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Starts off in the typical horror vein, and I wish it had stayed there. Then it follows one person like the previous films. This is where it becomes less interesting. This one person becomes responsible for ending it, but that is not enough to keep the story exciting. The story becomes stagnant when they do this.",
            "review_date": "2022-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not worth watching. Stick to the original. Exactly what you'd expect from a \"modern\" remake.",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rings had a mysterious, ominous aura to it that made for such a creepy, atmospheric horror film! So underrated, definitely worth checking out!",
            "review_date": "2021-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "She went deep into a church celar on her own without any fear, yet arriving back in the church became hysterical?Crap story and acting apart from the 2 male leads.",
            "review_date": "2020-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was okay. Not as good as the first two. Had some stupid moments here and there and the ending was a big cop out. But it did manage to have some creepy moments and the acting was solid to where this film was decent at best.",
            "review_date": "2020-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rings is not as bad as people are saying. The concept is little bit different but that doesn't effect the movie.\n\nI liked the film and would see it again no problems. It links to the first film, has a start, has a development and has an proper ending.\n\nThis film has structure, meaning and is consistent. Yes, it was less scary than first one but that isn't a problem. Most of horror movies nowadays are terrible, and this is not one of those at all, I'm sorry, it isn't\n\nDon't get influenced by negative reviews. I don't know what negative reviewers wanted from it, I enjoyed it and would recommend it.",
            "review_date": "2020-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that didn't need a sequel. rings 3 it is a\n trash",
            "review_date": "2020-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even working off material already steeped in potential, this disastrously acted and scripted story leaves you hoping Samara would do you a favour and climb out of your own TV and end it all.",
            "review_date": "2020-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow just bad, very bad. Everything from the acting to the \"scares\" to the dialogue is just awful!",
            "review_date": "2020-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To the filmmakers: Why, why, why would you create this abomination and attach it to a wonderful franchise?  Did you hate the original movies and want to show your disdain?  Was it meant to be a parody?  Do you hate truly imaginative and quality horror movies, or simply lack these abilities in your own movie making process?  If it was meant as an homage, you failed miserably.  A hollow and pathetic adaptation of a classic. Numerous plot holes, poorly developed script, and stilted acting performances make this a need NOT watch.",
            "review_date": "2020-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ugh. Yet another case of a good movie from the past getting the 'next generation' treatment. This series lost any appeal as soon as they took Samara digital and gave it to dumb college students. Stupidity trumps all in this movie, and negates any of the characters' redeeming qualities or good intentions. Too bad... because things get a bit better in the film's final act!",
            "review_date": "2020-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's an awesome movie for me, cos I think not everyone likes this",
            "review_date": "2020-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was amazing! Was thrilling with an extra plot twist at the end. Hopefully they will make another!",
            "review_date": "2020-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A remake in the same mode a the remake of Miracle on 34th street.  Remakes like these suck.",
            "review_date": "2020-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now I can perfectly see why people hate this movie, But for me, While Rings is not the worst film in the Ring franchise, I do think it is pretty enjoyable and in my option, I really liked how they made samara in the movie. In the end, do I think it's enjoyable yes, do I see why people hate it yes absolutely, But overall I give Rings 4 and a half stars.",
            "review_date": "2019-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Soulless reboot bereft of scares.",
            "review_date": "2019-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a sequel that was never needed nor wanted and it felt like everyone in the film thought the same. ",
            "review_date": "2019-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well the guy looks like a old co worker so noooooooo. Hated the movie from the start",
            "review_date": "2019-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie simply does not know what it is",
            "review_date": "2019-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worthless piece of crap. Don't waste your time. A farce compared to the original, which was a masterpiece. It took me about 5 hours to get through it. I just...kept stopping it to do something else or watch Youtube because it wasn't interesting. Boring. Nothing new or exciting. Truly a disappointment, especially compared to the original.",
            "review_date": "2019-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst movie I have ever seen! Usually I can finish most movies, but I just couldn't finish this one. The acting was horrible and the story just didn't add up. I can't fathom why I thought this could be a good movie. Whoever enjoys watching this waste of time, you have some serious patience and the world owes you. It's incredibly long for such a horrible movie. If you can't create an outstanding remake, don't make a remake at all. In fact, if you make a movie this bad, don't make any type of film. I would rather watch an hour of 'The Ring' pranks on Facebook than to ever waste one second on this movie.",
            "review_date": "2019-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, this is so bad, no wonder Galecki  wanted to quit this science-nerd-professor gig",
            "review_date": "2019-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was fun!  I liked the mystery, the pace, and the twist at the end.  I hope they make another one.",
            "review_date": "2019-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good shots, acting, story line of the franchise continues! ",
            "review_date": "2019-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm afraid that the acting will crawl out of the screen then Samara herself, but good crawls.",
            "review_date": "2019-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why oh why do these pointless sequels get made? Not only is this so long after the fact that the original movies are from another era, but as with other disappointing sequels it is bogged down with continuity. Stylishly executed but with no emotional engagement whatsoever.",
            "review_date": "2019-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring and all over the place with a dumb ending.",
            "review_date": "2019-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie isn't sure if it wants to be a mystery or horror or what it even wants the plot to be mainly about. First half is at university . A Professor Galecki experiment of \"pass the curse on\" horror . 2nd half is in a small country community based on solving a mystery .\n\n1st hour is SO boring and bland. Its tempting to turn it off.  But it then turns into a decent eye opener climax for the mystery , but is later soiled with fecal matter  by a random useless ending.  \n\nDo not waste your time. Wasn't sure what i was thinking at the moment i watched this.",
            "review_date": "2019-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rings, ruins the franchise of the Ring and makes it incredibly boring.",
            "review_date": "2018-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely lacking in scares and entertainment. This movie will bore to death.",
            "review_date": "2018-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely better than the joke that was The Ring’s sequel but also manages to spit on the brilliance of the original.",
            "review_date": "2018-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the movie had some creepy and interesting scenes and some of the performances and set-pieces are clear and nice, this third installment to the Ring franchise suffers from boundless unorginality, terrible pacing and zero emotions to drive the plot forward.",
            "review_date": "2018-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original film is and will always be one of the scariest movies ever made. The sequel was not very well put together and aside from the amazing performance by the contortionist in the well chase sequence, is not fondly remembered for anything. This movie looked to put a new spin on the Ring mythos with its own story. It attempted to take modern technology, the infamous videotape and a bevy of new abilities for Samara to explain their new storyline. However, what we got was something akin to 2 hours of jump scares mixed with bad acting and CGI Samara. This movie needed to keep Samara away from the spotlight, take some notes from the original Jaws movie. She was on screen more in this film then she ever had been in the previous 2 films. Going forward with this character and this franchise, we need Samara to be a malicious murderer who only kills based on the viewing of her video and there is no real way to stop her once you watch the tape. My disappointment in this film is solely based on me wanting to see Samara become more of a slasher killer like Freddie Krueger and not constantly be told to sympathize with her.",
            "review_date": "2018-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I dont know why this film is so underrated but I was scared to shit.",
            "review_date": "2018-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie did not stay true to it's roots. I thought it would remind me of the first one however it felt like a bad fan-fiction about the first one. They tried to add some \"lore\" that wasn't discussed at all. There was bits and pieces everywhere showing things about what gabriel was doing with the soul?!?!?!?! it felt like it was trying to go on a deeper level than the first one which overall ruined the movie.",
            "review_date": "2018-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing to say just super good",
            "review_date": "2018-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It adds to the mythos of the Ring series and I do like the direction it went it. Plays out like a murder mystery, but more accurately an episode of Cold Case. Surprisingly very little gore and you have characters watching the tape over and over. Not really that scary once you figure out what’s going on. They went for a PG13 rating this time and the movie suffers for it. But overall I enjoyed myself, but it could have been more. ",
            "review_date": "2018-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Distanced, incomparable quality due to the gap but it refreshes the relevant plot points joined by an interesting analyzing approach to the mythology, alongside with few built-up thrills, including a summed-up twist to make this decently enjoyable. (B)\n\n (Full review TBD)",
            "review_date": "2018-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Man, a friend of mine recommended that I watch Bad Match (sort of a Tinder date from hell type of movie) and I had to be a stubborn asshole and watch this instead.  I mean, really, I've been without Prime for nine months and, honestly, a lot of the movies that I wanna see were not gonna go away immediately.  So why, exactly, did I have to watch this tonight?  Honestly, I have no fucking clue.  I wanted to watch a horror movie and, somehow, this was the one I settled on.  Honestly, I was a fan of the original Ring.  It was actually one of the very few J-horror remakes that actually, in my opinion, to capture the spirit of the original movie it was based on (and book) while adding its own touches.  The surrealistic visuals of the contents of the tape were a strong suit as was the way the atmosphere was built throughout.  I remember watching the original Ring remake in theaters and I remember the reaction of everyone when the girl came out of the TV.  It was, honestly, quite something to see.  It's obvious that the original remake was wildly successful so, obviously, it was followed up by a terrible sequel that all but killed the franchise.  A sequel made by the man responsible for the Japanese movies.  The sequel for the remake and the sequel for the Japanese original (Ringu) were released the same year, something that I did not know until now actually.  Interesting little factoid right there.  The Ring 2 was released 13 years ago, so, of course, at some point, this franchise was going to be revived.  Because everything old is new again and, honestly, with the proliferation of smartphones, sites like YouTube, DailyMotion, among others, updating this story for a more modern world, honestly, seemed like a good idea.  What has changed from 2002 (the release of the original remake) and 2017 (the year of this film's release) should have been the film's focal point and how easier it is for people to share things with each other nowadays.  Of course, though, because apparently this movie was made with sequels in mind (because of course it was, given that Paramount ran Paranormal Activity into the ground with its, almost, yearly sequels), we didn't get to see a, potentially, really cool movie.  If you're not gonna use a cool idea to build your story around, at least give us an enjoyable horror movie with good atmosphere, tension and solid scares.  Nope.  Apparently that's too much to ask for as well.  I honestly don't know what this movie was meant to be.  A remake, a soft reboot, a homage.  Because, quite frankly, it repeats most of what you already saw with nowhere near the same level of skill.  To say that this is a horror movie would be an insult to horror movies everywhere (even the bad ones).  I mean, there's horror movies that aren't scary that still fit into the genre.  Hell, almost every horror movie I see isn't scary and they still fit into the description.  I guess someone could make the argument that, as bad as this is, this also still belongs to the genre.  I guess there's also some validity to that, but when you look at the content within the film and just the sheer lack of scares, or even attempts at one, there are in this movie, it's just sort of difficult to justify it as a horror movie.  This is, at best, a suspense/mystery/thriller.  The movie sees Julia investigating the disappearance of this young pregnant teen as a result of the visions she's been seeing.  Basically, her boyfriend watched the video while he was at college and he has seven days to find a tail (someone else to watch the video to pass the curse to) before he dies.  Julia sacrifices herself to save her boyfriend from the curse.  But, of course, since Julia is our lead character, there's a video within the original video from the Ring (which is still surrealistic and creepy).  This new video, of course, doesn't have nearly the same effect the original had and it supremely lacks in the creepiness department.  Anyway, this new video leads her to investigate, again, the disappearance of this pregnant teen 30 or so years ago which will, hopefully, lead her to where Samara's remains are so she can be given a proper burial to put a stop to the events.  First things first, and this has nothing to do with the the film itself (except that it does) and that is how strict Samara is about rules.  She'll kill you, but you have to watch her video first, ok, guys?  Even if there's someone else in the room, who didn't watch the video (like Julia was during Skye's death), she WANTS to kill you, but she WON'T.  You have to watch the video, Silly McSillypants.  I mean, this is something you don't think about in the original Ring because of how good the movie actually is.  But, in a terrible movie, you start to think about this type of shit.  It's a little ridiculous, but it is what it is.  Julia finds out that her boyfriend is part of this secret college group, all of whom have watched the video and all of whom have found tails, and she meets this college professor who's trying to study how this video proves that there's an afterlife after all.  Why is this professor trying to study this, I don't even know, and, honestly, after the shit starts and Julia and Holt (her boyfriend) start investigating the disappearance, this is dropped entirely.  So, honestly, why even bother???  I think it's enough for them to tell us that there's a lot of people who are involved in this who have found a tail, you can even include Holt's professor in this (who was the one who started the chain).  But what's the point of the secret study group if it's literally gonna go nowhere.  I know you kept things open-ended enough to, maybe, justify sequels.  But you can't just assume that your shitty movie is going to be successful enough.  There's other ways to justify sequels if you really need to, just tell a complete story in this movie, then worry about sequels afterwards, if this proves successful enough.  Regardless, that's neither here nor there I suppose.  The movie is more about Julia and Holt's investigation into this missing teen and, I'll be honest, it's really fucking boring.  It's bad, but it's more boring than bad.  The reason, however, that this movie gets the rating it does is because of how fucking terrible Matilda Anna Ingrid Lutz is in the lead role.  This young woman has gone on to star in a critically-acclaimed movie called Revenge that, unsurprisingly, I want to see.  So I'll have to hold off judgment for how good she is (or not) until I see that flick.  All I can give an opinion on is her performance here and, I'll be honest, I don't think I've seen a performance THIS bad in a really long fucking time.  I'm really struggling to think of the last time I saw someone this bad in a lead role.  There's obvious comparisons to be made between Ingrid in this movie and Hayden Christensen in the Star Wars prequels.  But, to be fair, Hayden proved to be a legacy terrible actor, it wasn't just that the Star Wars prequels were poorly written and not even Daniel Day-Lewis could make that script look good.  In Ingrid's case, it might just be a problem of choosing the worst possible cuts of her performance.  Then again, if what we got to see on screen were the best cuts that were filmed, can you even imagine how bad the worst must have been???  Look, this movie wouldn't have been good with or without a good lead performance.  The fact of the matter is that Vincent Donofrio is good in the limited role he's given and, still, the movie sucked.  The problem just comes in recycling old elements from the original movie instead of using the NEW concept that's so obviously staring you in the face.  And if you even recycled old concepts and ideas from the original remake and, at the very least, executed them WELL.  But no, you can't even do that.  No real effort was put into understanding why the remake worked so well.  They just looked at everything at face value and tried to repeat that without, again, any of the skill involved.  It just doesn't work that way.  You have to understand why things worked and how to properly adapt that to a new audience in the digital age, where everything is online instantly.  This movie was destined to be a failure from the start, because they didn't learn why the original movie worked.  So, basically, the concept I'm talking about, that this movie should have used from the start, is what if the video itself went viral on YouTube...or the equivalent thereof, since sometimes these films don't use real sites.  What if millions, maybe even billions, of people watched the video and all started dropping dead in seven days.  That concept doesn't mean that the movie would be good, of course, since you still need someone skillful enough to handle this.  But, at the very least, conceptually speaking, you have a more interesting movie than what we did end up getting.  And the thing is, unfortunately, that the video going viral online (or forcefully shared to Holt and Julia's friends at least) was actually used as the ENDING.  Literally the only cool thing about the movie is left for the end.  Samara has manipulated and used Julia to cross over into our world, or something, and the video ended up being shared with everyone on Julia's friend's list.  Cue Sir Patrick Stewart's facepalm.  They're like 'oh, you wanna see this as a full-fledged movie, well FUCK YOU, because we're saving this for a sequel that will never be made'.  It's really such a big fuck you to hardcore horror fans.  I sat through 95+ minutes of bullshit to get a cool ending that's hinting at bigger things for a sequel that will never be made because of how shitty this movie was.  It's really like a slap to the face, honestly.  Perhaps that's an overreaction on my part.  But, seriously, holy fucking shit.  Who thought that reintroducing the franchise with THIS movie would be a great idea?  You have to change with the times and it's been 20 years since the Japanese original came out.  It's been 16 years since the remake.  That's a lot of time to, essentially, make the same fucking movie again with all the changes in technology that we've seen since then.  Infuriating.  If the sequel to the remake (The Ring 2) all but killed the franchise, this movie has sex with its corpse and sets it on fire after the act.  Just an absolute terrible and poor excuse for a movie.  Downgraded from the one star I was gonna give it.  There's just nothing redeemable about this, it's just awful.",
            "review_date": "2018-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Rings' is one of the worst movies I've ever seen, it's laughable, and that's why I love it. This film tries to pull a 'Jurassic World' and 'Force Awakens' by being exactly like the original film, the plot is beat by beat the same as the original, except instead of Samara being on a VHS, she's digital. There's literally a scene where Samara appears on a phone and she comes out of it, except there are like these birds that surround her so you never see her coming out of the phone, because a little Samara coming out of the phone would've been too funny. This movie is hysterical, the acting is awful especially from the lead actress, who doesn't have a character to work with, she's so bland. Also the kills come across as comedic since they're edited horribly. The opening of this movie has nothing to do with the overall plot, but takes place in a plane and I burst out laughing by the end of it it's so horribly done, and comes across like a spoof from 'Scary Movie'. The plot twists in this film are some of the most predictable ever. This movie isn't scary, there's no tension, the plot doesn't make sense. It's literally the first movie except it has different characters, and it's modern day. On the positive sides of this movie, the visuals are nice, it's nicely shot, it's the best looking Ring movie, everything else is awful. If you want a good laugh from this movie go ahead and watch it, otherwise I don't recommend.",
            "review_date": "2018-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's an amazing movie and i don't get why people are reating it so badly!!!!!!!",
            "review_date": "2018-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Made 12 years after its predecessor, Rings is not the worst horror film ever made, but it has so little to offer to justify its own existence",
            "review_date": "2018-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is this a comedy? Pretty sure it's a comedy.\n\nThe acting was horrid, the plot was horrid. I couldn't even finish the movie.",
            "review_date": "2018-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Let's face it like all of the films this one gets boring, but it does bring it's even new scares to the table. The Ring 2 seemed like it was just being a movie without being scary and The Ring 1 is somewhat a classic.",
            "review_date": "2018-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very well made movie. Looks like they really tried. A pleasant surprise if your not expecting much.",
            "review_date": "2018-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like a crappier-written, less-polished facsimile of the original.",
            "review_date": "2018-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Rings\" is already pushing itself to the limits with the fact it still uses an obsolete piece of media as its catalyst but it is not doing itself any favors with its boring story.  The concept offers up a single cool idea that definitely should have been its focus but, instead, the film feels like it is just redoing the first film all over again by having the main character investigate the tragic past of the ghost that refuses to get with the times and continues to cling to VHS tapes as a legitimate medium.  The problems are only amplified when you add in flat and bland characters with an atmosphere that has no sense of horror or dread and it made for a movie that dragged and never really picks up ever.  The cast is doing their best with what limited canvases they were given to work with but it's not enough to help this snoozer.  Overall, \"Rings\" comes off like a phoned in stand-alone sequel that feels more at home with the Direct-to-Video market than anything else.\n\nHello!  My name is Rev. Ron and if you feel like checking out more of my reviews (including a more in-depth look at \"Rings\") you can visit my blog at RevRonMovies.BlogSpot.com.  Also, if the mood strikes, you can follow me on Twitter (@RevRonster).  Thanks!",
            "review_date": "2018-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although its obvious flaws, Rings Movie has all the makings of a great horror film, the story itself comes off as unoriginal but it is very effective especially at the end, the lead actress Ingrid leads the film wonderfully, at the end of the day these kind of movies are just a guilty pleasure and it's extremely entraining, labeling it good is a whole other story.",
            "review_date": "2018-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More idiotic millennials who feel the rules don't apply to them forgoing anything resembling common sense.",
            "review_date": "2018-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not bad but not the best of 2017",
            "review_date": "2018-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why the hate? I defend this film since I walk out of the theaters and I still do. 8/10 better than The Bye Bye Man and The Ring twO",
            "review_date": "2018-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gutiérrez manages to deliver a film with such little scares, it essentially becomes one you shouldn’t even associate with the Ring franchise.",
            "review_date": "2017-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It appears to be an inevitable progression from any degree of success quickly spawns a sequel, and if it sustains even a modicum of momentum, it will progress onto a franchise. Evidence of this is phenomina manifest in a wide varriety of genres but is most pronounced in horror movies. That category of entertainment seems to possess a significant degree of protection from the unavoidable phenomenon known as diminishing returns. Widely accepted criteria can quantify each continuous film in the ever expanding series of movies steadily ddclining spiral as box office returns and rankings in aggregate review sites. The original film of the series, referring to the 2002 American not Japanese variation, was a respectable 71% on Rotten Tomatoes. In 2005 its first sequel, Ring Two go to a Run Tomato ranking of 20%. Finally, 12 years later, the consideration, Rings has plummeted to an abysmal 9%. The priming prospect for those who enjoy quality all movies is that with a budget of $25 million to fill rate in a domestic box office of almost $28 million. Then he seemed like a very slim margin, not really of consideration by the studio, but that does not include global markets and the exceptionally lucrative DVD/Blu-ray sales and licensing arrangements with premium cable networks and streaming video services. Over the past few years, there has been a radical decline in the stigma against movies released directly to video. This method of distribution once stigmatized a film as largely because of that format, once the pariah of cinema, has become a respected venue for independent films. For those who are interested in watching how the premise of the series can reach its fullest potential check out the Japanese versions of the movies. That premise has a certain purity and simplicity within the context of horror. Anyone watching a particular videotape that consists of a string of bizarre images receives a phone call or macabre voice telling them that they will die within seven days. The only way to save your life is to make a copy of the videotape and get someone else to watch it. The back and be done within the allotted period the curse is lifted from you and reset to the new victim.\n\nThis installment takes place in the present opening in an airplane on its way to Seattle. A pair of the passengers, Carter (Zach Roerig) and Kelly (Lizzie Brocheré), realizes that they have seen the Samara Morgan's cursed videotape. They're coming up upon that crucial seven-day mark of their predicted demise. The hope to out run the curse but the vengeance is Samara was not to be denied. She reaches out from beyond the grave causing the plane to malfunction and crash. A couple of years later college professor Gabriel (Johnny Galecki) purchases are used VCR previously owned by a passenger of that ill-fated flight. On examining his purchase, he noticed that there's a videotape already in the old machine. The scene shifts to Julia (Matilda Lutz)) were addressing her boyfriend, Holt (Alex Roe), off to college. After a brief time, she becomes a concern when Holt seems to disappear, no longer communicating with her in any fashion. Julie has just come to the decision to investigate his whereabouts. She encounters a young woman in a complete state of panic, Skye (Aimee Teegarden) was gravely worried about Holt. Julie winds up speaking to Gabriel who takes into a rather reclusive area on campus. Then he took her into a room and introduced to a group called the 'Sevens.' They are attempting a scientific study of the cursed videotape. Part of the protocol of the project is for them to watch the video while filming themselves and then passing it on to the secondary group of people known as the 'Tail.'\n\nAlthough the harsh reality of the precipitous plunge in quality is one aspect of the general plot points that have been in desperate need of addressing. It appears that demons have not kept up with modern technology. VCR tapes have been all but extinct for over a decade. Hell is in dire need of a technological upgrade. If you want to see hell as I picture it within the context of the series check out the series on Adult Swim, 'Your Pretty Face Is Going to Hell.' It depicts the place of eternal torment as run by a bureaucracy consisting of inept; bungling demons who are still using IBM ATs with large VGA monitors. The people setting up the parameters of the investigation have decided to transfer the tape to digital video file format. After all, the point is to get people to watch the film and me for Samara to have her revenge spamming an email or attaching it to various 'clip-bait online videos' that can quickly reach a far wider audience. This also comes in handy with a level plot contrivance of additional material added to the video. A quick glance at the file size would inform anyone that the original movie ws altered. It now contains a scene of what happens is Samara after her death. When Skye takes Julia to her apartment to view the video, she is contacted by Holt wanting her against watching the deadly video. She refrains from watching the video, but in the next room, Skye is murdered.\n\nIt appears that the format used to produce the script was to write some horror movie tropes and oxides on slips of paper, place them in a hat and pullout plot contrivances until the script size is sufficient for a feature-length movie. The hotel is Samara's body has been very strange marks on his hands. They turn out written in braille which once deciphered these into a sufficiently spooky location that could very well have been a set left over from the film. It was an introduction to a blind man who knows why the gravesite is missing a body that a flood necessitated moving it. When they get around to electrocuting a person using a falling utility pole any cannot help but recall a substantial number of movies utilizing the same 'shocking moment.' The time came quickly when a chours of chriping cicaders ae heared in the background. Accompaning this expected contrivances leading to the telegraphed hidden room and sudden pregnacy. Any desparate hope of originality is receeding in your rearview mirror at light speed. What is truly disappointing about this movie is that it contains some notable names containing not only Johnny Galecki coming on for 'The Big Bang Theory' and Aimee Teegarden known for among many other things from her starring roles in 'Friday Night Lights' and the sci-fi variation of Romeo and Juliet, 'Star-Crossed.' Lizzie Brocheré is a very talented French actress was in some television series including 'American Horror Story,'' The Strain' and more recently 'Falling Water.' These are talented artists were repeatedly proven that they are capable of far better performances than given here. It is usually best not to blame the material since many actors have done remarkable things with the flimsiest of scripts. Unfortunately, the disconnected narrative exhibited here ensures that an assembly of the greatest Shakespearean actors ever known to not have saved the production. On one of the most disappointing casting choices was to include Vincent D'Onofrio into this disaster. He has had many decades of being a deservedly well sought after character actor who has proven himself quite capable of handling the spectrum of leading roles. I'm confident that many people would rather watch Samara's cursed video and have to endure the hundred and two minutes of this flick.",
            "review_date": "2017-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wasn't expecting Oscar Worthy for this but I expected at least a bit more of an actual story.  The plot was just way too convenient and seemed like the ending was made first and then worked backwards to add things to make the ending make sense.  it didn't work, obviously.\n\nI also couldn't stand listening to the main actress constsntly gasping for air.  it was over the top and excessive.  She would definitely do well in porn then",
            "review_date": "2017-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "undistinguished,  unmemorable.",
            "review_date": "2017-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought it was a pretty good movie !!!",
            "review_date": "2017-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was some total bs. I'm not sure why I wasted my time watching it. The plot was pretty uneventful and boring. The acting was very sad. Everything was just dissapointing. If you want to waste your time watching a cliche movie by all means go ahead. But I don't think it was worth the hour and fourty minutes",
            "review_date": "2017-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pointless, pathetic, perfunctory and other pejoratives that begin with a P, Rings is yet another entry in a franchise which is, for unfathomable reasons, still going. Now an utter diversion from the Japanese original, which was creepy, suspenseful and rooted largely in a scary realism while still having a supernatural element, we now get endless, eyerolling jump scares, a lead character whose vision essentially tell them exactly what to do, and an ending that sets up the only genuine horror this movie produces: The potential for a sequel. There's so much supernatural nonsense in this film, creating no tension or drama, and just being an excuse to use CGI to lazily circumvent practical effects. I found myself sighing in frustration most of the time, since banging doors, flashing lights and people popping up behind the characters are what passes for scares in this and countless other modern horror films. It's a dreary plot with substandard acting and a series of uninteresting developments, culminating with a ridiculous twist that dangles the carrot of potential continuation in front of the audience. The fact that uncertainty surrounds the next instalment gives me a little hope that they'll realise that the Americanisation of a classic Japanese property has been milked completely dry, but I wouldn't count on it.",
            "review_date": "2017-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "slow and rather boring with its links to it's prequels the only saving grace.",
            "review_date": "2017-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some movies you can at least hate, this one can only make you feel indifferent, bored, feel like you are really wasting life.",
            "review_date": "2017-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "didn't they already do this? just another remake of the ring yet slightly different.  nothing new here just an update of the video on computer screens rather than a video tape.",
            "review_date": "2017-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Basically the same movie as the original American version.  There are a couple of decent actors, but definitely no surprises.",
            "review_date": "2017-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some scary scenes.  I think they are stretching the story of \"The Ring\" too far.",
            "review_date": "2017-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brings nothing new to the franchise, all scares are recycled. Question who wanted a Ring Sequel?",
            "review_date": "2017-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie and the end was awsome",
            "review_date": "2017-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rings attempts to reboot the franchise for the digital age and fails horribly.  The story follows a teenage girl who attempts to save her boyfriend by coping and watching an infamous video that supposedly kills you seven days after watching it, however her digital copy turns out to contain additional footage that she comes to believe was meant for her; leading her to go in search of its meaning.  Once again the series tries to make Samara a sympathetic victim, but it doesn't work.  Making the villain good and the good guy bad is a tried trope that's been played out for a while now.  And, the new powers given to Samara are extremely contrived.  Also, the performances are incredibly poor, particularly the lead (who has no charisma).  A second rate B-horror film, Rings is incredibly dull and nonsensical.",
            "review_date": "2017-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not sure why a sequel(or prequel??) was needed for the original Ring movies as there was nothing really important to be added. Just more of the whole 7 days you'll die after watching the video crap, some more backstory that I'm not sure retconned the original or was left out. All it does is raise a bunch of questions like what happened to Naomi Watts part of the story from the first two? If this is a prequel, why the hell are there cell phones that in no way could exist before 2002 when the first one came out? What happens if you don't watch the whole video? What if you watch it backwards? What if you don't answer the phone after watching it? What if Trump watches the video? Stuff like this annoy the crap out of me along with the stupid non-closure ending, ugh.",
            "review_date": "2017-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent enough. D'onoffrio is the highlight because he can't help it but nothing ever truly happens.",
            "review_date": "2017-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very forgettable movie with a cheesy build up and poor CGI.",
            "review_date": "2017-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "same old same old. :/ nothing special and it is even worth than the original",
            "review_date": "2017-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good:) Bonnie morgan did a fantastic job as samara. This movie kept you in suspense the whole time you're watching it.",
            "review_date": "2017-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The beginning on the plane was a terrible scene.  It was littered with bad acting.  It had a few interesting ideas, but it wasn't scary at all. I'm going to bed now.",
            "review_date": "2017-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was amazing. I got every message of it. Low budget movie but Well played. I loved it.",
            "review_date": "2017-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This. Ok. Believe me. Worst trade deal for movie in history. Ok? I've had bowl movements that were more interesting. I would to get a prostate exam than have to watch this movie again.",
            "review_date": "2017-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A ghost makes an short art film and gets everybody who watches it to promote it for her (by killing everybody who doesn't).",
            "review_date": "2017-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well the reviews say it's bad, but I didn't think it was that bad. But not necessarily scary either.",
            "review_date": "2017-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't see how there's this much hate. I loved it. She figured it out and won.\n\nI just don't see why this one doesn't explain how she got out of the well again (in rings 2 she was shoved down the well by the main character) or how the intro wasn't brought up again (did all the passengers watch the video or did she kill innocent people). Also, I don't get the ending. If she can send all those emails, why's she need a rebirth?\n\nOverall I liked it, though it could have been better.",
            "review_date": "2017-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A reboot (I think) of the popular cursed videotape film, but whatever it is, it's awful and unnecessary.",
            "review_date": "2017-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It Was Pretty Good, But Not As Good As Expected... Most Of The Characters Are Dumb, For Example One Stoped And Got Out A Car To Say \"Look There Is A Bird\" And Almost Got Hit By A Truck... Also There's A lot Of Stuff That Looked Amazing In The Tralier That NEVER Happend In The Movie",
            "review_date": "2017-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film wasn't too bad for a third sequel.",
            "review_date": "2017-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was  watchable but full of plot holes and pointless plots.",
            "review_date": "2017-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I dont know what you guys are talking about. I personally think this one was WAY better than the original. The storyline is better and i was actually rivited to my couch. The other ones are just so boring and plain stupid. In my opinion this one is not.",
            "review_date": "2017-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't like it. I liked the previous movies,  but this one just didn't have the it factor.",
            "review_date": "2017-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i give it a c out of 3 stars",
            "review_date": "2017-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was horrible",
            "review_date": "2017-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Samara is one of my favorite new horror characters, but this movie was a let down for the series. It lacked the gothic creepiness, but the new ideas to the mythos of Samara were ok.",
            "review_date": "2017-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's so boring but hey at least it has lenorad from the big bang theory",
            "review_date": "2017-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A young woman (Matilda Lutz) becomes worried about her boyfriend (Alex Roe) when he explores a dark subculture surrounding a mysterious videotape said to kill the watcher seven days after he has viewed it. She sacrifices herself to save her boyfriend and in doing so makes a horrifying discovery: there is a movie within the movie that no one has ever seen before.",
            "review_date": "2017-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film is a great fresh different take of the first two films. Cast is is great, their performance is good. Beautifully shot. It is a thriller more than a horror . I don't understand why all the bad reviews. The movie is great for what it is. What are people expecting is beyond me!?\nThe movie had great twists. I was very impressed",
            "review_date": "2017-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's on going story is still fresh and it was honestly better on scares then the original",
            "review_date": "2017-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wasn't impressed at all",
            "review_date": "2017-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The basic idea was a good start but as the 2 and 3 were going on,it was lacking creativity,suspense and had major plot holes that dont explain the minimum to the audience. a big no no",
            "review_date": "2017-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first one was much better.",
            "review_date": "2017-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RINGS gives answers to a lot of fan questions (That are really, really overdue, about 15 years overdue) such as: \n* What if Samara can only pop out of a real small screen such as an iPad or iPhone to come and get me if I don't lift the curse in 7 days? \n* No one uses VHS tapes anymore, what will Samara do next? \n* Why doesn't Samara make MP4 / .MOV files of her video? \n* Will Samara make her video longer? Just for the fun of it? \n* What if I just unplug the TV / computer that she's coming out of? \n* Can't I just beat the shit out of Samara? How strong can she be?  \n* What if I just cover / disable my eyes so that she doesn't kill me just by showing me her face? \n\nAlthough updating on Samara's technological grasp doesn't make Rings very entertaining as a horror movie.",
            "review_date": "2017-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It had a cool story, but very predictable deaths. If ya like a horror flick for the sake of horror movie, it's a good one. If your not a fan of horror save the random horror watch for another movie.",
            "review_date": "2017-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The definition of Movies is that they are entertaining us by showing us multi-faced aspects. This one just disappointed me.",
            "review_date": "2017-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "for a scary movie it was good.  ready for \"rebirth\" spoiler alert.",
            "review_date": "2017-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rings is a perfectly disposable, functionable horror movie that will be scary enough I'm sure to people who've never heard of The Ring Series or gotten any of the references. The acting was hit or miss - the main actor (Matilda Lutz) was not great, all of her dialogue felt very wooden. Her boyfriend played by Alex Roe was okay, although that has to be one of the dumbest characters in recent horror cinema given that it's his actions (or lack thereof) that allow certain things to happen plot-wise. I thought Johnny Galecki (Big Bang Theory) did well enough, although his character wasn't stunningly written, but for me it was Vicent D'Onofrio (Law and Order: Criminal Intent, Men in Black) who came in and rescued this movie from being a total wash. He is suitable for this kind of film and adds a much-needed layer to the middle and final portions. Even so, the lack of scares and chills, a mixed bag of performances with more misses than bulls-eyes and a frustrating plot make Rings a Dieharders Only experience. This is for diehard horror movie/Ring series fans and also for fans of Vincent D'Onofrio...so I'd probably watch this again? Maybe? Please don't believe me?",
            "review_date": "2017-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked it, I had wank over it, so it must be good. PS Samara is a stunner ????",
            "review_date": "2017-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "another worst reboot of a great horror movie worst acting and underdevelopement characters",
            "review_date": "2017-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sadako Yamamura in the well he is falling down",
            "review_date": "2017-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A compilation of some of the laziest jump scares in horror movie history? Like loud noises that come out of nowhere for no reason? You're in luck!",
            "review_date": "2017-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "better then the second one but nothing special",
            "review_date": "2017-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Believe the hype... Rings is an absolute disaster of a film that manages to be uninteresting, not scary, poorly acted, and just plain dull. It is the movie too beat this year for being the worst of 2017.",
            "review_date": "2017-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Completely lost the plot lost the brand disgusting",
            "review_date": "2017-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would go lower than half a star but it wouldn't allow me to do so.",
            "review_date": "2017-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like the direction this movie took.",
            "review_date": "2017-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know that this movie has a lot of people hating on it, but I really enjoyed the updated sequel It really brings the story into a modern digital setting and honestly, the first movie was always a little behind the times with the VHS tape.",
            "review_date": "2017-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the epitome of bad filmmaking. I can remember watching the first Ring as a teen and being spooked by the first phone ring I heard after the film ended. This literally wiped out my whole childhood memories of this film.",
            "review_date": "2017-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only gave it 3 stars because the acting was so bad that we laughed out loud",
            "review_date": "2017-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was really good i was the only one out of my group jumping out of my seat of how good it was my friends that went with me didnt really like it but i really did.when i got home with my sisters they went to i had a shower and when i was dressed i fliped my wet hair over my face and i spooked my sister and now til this day every time i flip my hair over my face she gets freeked out",
            "review_date": "2017-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't think I've ever scored a film so low, but I don't think I could have been more disappointed with a Ring sequel than I was with this one.  The story was neither suspenseful nor scary; in fact, there are parts of this film that attempted to tell some of Samara's backstory, and it only served to make her feel LESS mysterious and intimidating.  Even when the same types of visual effects were used in this film as in the first, they were used less effectively, and I was left feeling bored.  Even the \"twist\" ending felt forced and uninteresting.",
            "review_date": "2017-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is, unsurprisingly, terrible.  If you stumble across a film and go 'Oh a 'Ring' sequel I've never heard of' THERE'S A REASON YOU'VE NEVER HEARD OF IT.",
            "review_date": "2017-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Same old thing different DVD. The only thing that would've made this more new and exciting is if they had released it in a 3-D version. Since it's not on 3-D DVD I would not waste my time",
            "review_date": "2017-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie was just no good.. was not scary at all!!! I was so excited to watch this movie and at the end all bad",
            "review_date": "2017-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a waste of time. This holds the distinction of the most boring modern horror film I have seen. Also, the most pointless chapter in a franchise ... total money grab. \nBooooo! \n[meant to show disapproval, not in like, the Halloweeny kind of way]",
            "review_date": "2017-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I started Rings ''3'' with the best of intentions, thinking ''its quite ok actually'' for a good 25 minutes, but when it started going down...  Stylish direction and atmosphere are ok but  pointless, working to carry a story written by incompetents.   Stop messing with us, we SAW the 1rst 2 movies, remember? The premise of the 1rst tier is a good direction, the logical next step, but its unfulfilled and pierced by baffling plot holes to the point where it forgets itself, veering into a bad rehash that doesnt bring the mythos forward and messes with the timeline. On one hand this movie accknowledges the Ring two was ''thirteen years ago'' but now Evelyn dissapeared 30 years ago? Samara was born around 45 years ago.  Also Evelyn's ''dissapeareance'', considering we watchers know where she went, is a rather big detail to not mention. \n Here are a some more inconsistencies and blatant mistakes: \n- Why spend minutes 45 to 75 having the lead girl sleuthing for a mystery us watchers already know? Evelyn is Samara's mother, ok. Lets find the body thrice moved....In supernatural drama's those are terrible moves. \n- The priest is also played like a reveal although its more than obvious. And the lead girl, who smashed a church stain glass with no hesitation, once in a life threatening situation tries to OPEN a window?\n- Now the  teacher, who leaves a message about braille in Julia's hand but not the translation?! Prefering to drive for 4 hours instead of saying ONE word on an answering machine?  And with all his research, he never found out  who is Samara's mother, even knowing about the village where samaras body was transfered? This tape went around for 15 years and he never met Naomi Watts who was impossible to miss for anyone diggin into Samaras story, having smashed a goddam cabin AND found the body?? If Julia is the 12th person to come looking for Samara, And Evelyn was continually seeked out by people in her (unmentioned) asylum... Add it up; this is just beyond. \n- Also, a girl died and everyone dropped out of the ''science'' project; wouldnt it be the absolute contrary, given the very project they are working on!? And now its about proving life after death? That was the point of the quantum theory blah-ing?\n- Samara could burn to tape by heat impression, not digitalise, it makes the whole contemporary connection ludicrous! \n-  I really liked the plot of the ring two, it could have been a rich story to explore, with this dark water element, and they seemed headed there but  totally missed their mark with this pointless  search, ending  with... reincarnation? The snake eating the last ''tail''?  In the universe of The Ring, This is the opposite of otherworldly, making the mythos and the current story totally unrelated, with no justification for this pointless Julia girl to get this kind of connection with Samara. Also; i wish they had bothered looking for actors. Being pretty does not automatically come with acting skills. She is bad (but it doesnt help that the character is dull, one-dimensional and dumb).  \n\nSo its a bad movie because of horrible writing, like they never even re-read themselve before getting good means to shoot a badly mapped story.  How coked-up were those writers? Still i give it 2.5 instead of 1.5 because the apt directing manages to somehow make it a bit scary often enough, which is a good thing.",
            "review_date": "2017-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Those who loved first two stories, would definitely like this one, which is totally rewritten and not left you any chance to think WTF....",
            "review_date": "2017-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "bad arguments. bad actions. not interesting at all",
            "review_date": "2017-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't believe all the people saying \"Worst Horror Ever\" lol come on there's certainly worse horror movies than this. This movie was far from perfect but what Ring movie was...or any horror movie for that matter? The acting was pretty decent for such a thin plot and Vincent D'Onofrio was a nice add. I'm giving it 3 out of 5.",
            "review_date": "2017-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Halfway thru it. Slow, stupid,and utterly predictable. I'd have been disappointed if I expected more.  I had hope tho.",
            "review_date": "2017-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "sick of reboots or wtv you call this unoriginal waste of time.",
            "review_date": "2017-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wonder. In the modern age does Samara use Final Cut Pro or is she in the Adobe Premier came for editing her killer videos?\n\nI'm not sure where one would find it, but there was an original short film called Rings back in 2005 which focused on the events between the first and second American remakes. Anyway the biggest problem with Rings is that it teases us with an actually very interesting premise and then abandons it.\n\nIt starts off like any horror film and then shows us some real promise for about ten minutes and then goes back to being overly generic. There is some really lazy writing here where a few twist events are only twists because instead of just telling our main character something in a second, they drag it out. \n\nFeaturing Johnny Galecki  playing a more age appropriate role than he plays on the positively irritating \"Big Bang Theory\" we even get Vincent D'Onofrio.\n\nIt is hard to say if we'll get another or if they'll just wait to reboot it again. Much of the life of horror is rentals anyway, not box office.",
            "review_date": "2017-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good but not to scary",
            "review_date": "2017-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The storytelling is pitch perfect almost. Matilda Lutz's performance is quite lovely. The scares aren't really there.",
            "review_date": "2017-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty lousy. Revisionist crap that doesn't do anything new or even remotely scary or interesting with this once great franchise. Filled largely with an uninteresting cast who you don't care about, doing a bunch of illogical nonsense. And that opening..?  Ugh! Why does current studio horror try to squeeze in these over-the-top action sequences?!  THIS crap is what we were basing the viability of old horror coming back?!  For shame.",
            "review_date": "2017-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was stupid. what a crappy professor.",
            "review_date": "2017-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it didn´t need to have other rings movie",
            "review_date": "2017-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is boring. Feels like it takes for ever to end. The storyline in bland. There are a few jump scares but thats about it. The movie is just boring after 30 min i was over it after 1 hour I wanted to run out of the theatre.",
            "review_date": "2017-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OMG this film is the one of the worsest wath I ever watch.",
            "review_date": "2017-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, they tried. They tried hard. They failed. They failed hard. \"Rings\" was just a crappy try to cash in and revive a franchise. Maybe they had good intentions, but somewhere on the way the makers got it all wrong...",
            "review_date": "2017-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "terrible save yourself time do NOT watch",
            "review_date": "2017-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This third installment is an obvious attempt to start a new wave of sequels. The problem is that the thrills are by the numbers and the characters aren't that interesting. The first Ring movie was a great, dark, mystery. Even the second had its moments. This one feels like a direct-to-video sequel. It's not horrible, but compared to the two that came before it, it is one to avoid watching. \n\nGrade: C",
            "review_date": "2017-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Samara is always awesome. It may not be the best horror flick there is, but is a well executed fantasy movie. And it may not be awesome horror movie, but is still better than most.",
            "review_date": "2017-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "6% is a lot...it should be 0%",
            "review_date": "2017-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "far away from the 1st Ring movie kind of scary and intrigating...Rings is boring and so predictable.",
            "review_date": "2017-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1 star is the least I can give, so no choice. Why make a sequel when you don't have anything more to show? The \"new twist\" is so contrived and unconvincing!",
            "review_date": "2017-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have to admit, this was the best one in the series.  I was pleasantly surprised!",
            "review_date": "2017-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "eh, another movie that was a basic coverage from the first one. I swear the first half is just catching younger viewers up on what people who've followed the series should already know.  It wasn't very scary and they character building wasn't done well.  It felt rushed despite it being slower and unscary.",
            "review_date": "2017-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Always good to see Vincent D'Onofrio, but other than that pretty unnecessary sequel/reboot. Fans of the series might like it but other than that I would say not worth the hour and a half.",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THIS IS NOT A HORROR MOVIE IT IS TO FUNNY.",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolute load of rubbish. Just stop trying to rehash a good mythological thriller. It is watered down so much it felt like fan fiction gone bad...in fact I've seen fan made movies that are so much better",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although it isn't terrible, \"Rings\" is a completely unnecessary sequel that does not offer anything new to this franchise, but instead muddles the mythology and previous plot points up.",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly terrible with no redeeming features. Some interesting ideas are introduced (Leonard's monitoring of the video curse victims, for example) but not explored and the ending, while completely predictable, at least leaves things as they should be.",
            "review_date": "2017-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Way better than critics give it credit. Continues the story in a scary and new way. Some obvious plot twist but a great performance from Vincent D'Onofrio will give audience chills!",
            "review_date": "2017-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't really know how can you butcher the sequel even more. Pathetic movie to say the least",
            "review_date": "2017-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's almost embarrassing how uninspired this horror movie is. Rings follows the exact same plot of the original with the same protagonist trope and the same goddamn video. The Ring was never meant to be a franchise and every installment has proved that statement.",
            "review_date": "2017-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't put 0 stars. Worse than original. A craptastic time!",
            "review_date": "2017-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rings is a sequel to the American remake of Ringu, The Ring, from 2002 and it's, surprisingly, not awful. Rings follows Julia and her boyfriend Holt as they try to discover the secret behind the tape. It's a pretty hard plot to explain as it doesn't make a whole lot of sense, but I'll do my best. So, Holt goes off to college. There he is introduced to the tape by his friend, Skye. Skye got introduced to the tape by her biology teacher, Gabriel. Gabriel is very obsessed with the tape and what it means. He's so obsessed he starts an underground club. He thinks the tape is an answer to one of the biggest questions; does a soul exist and where does it go after death? He conducts some experiments and finds out a very interesting thing. You can avoid dying in 7 days. When you're done watching the video, you make a copy of it and show it to somebody else. Then the person you showed it to is haunted by Samara instead of you. So, Julia sacrifices herself and watches the copy Holt made so he doesn't die. But, now Julia is in danger and in order to save her, the gang must find out the mystery behind Samara. That's, more or less, it. I really do appreciate the fact that they tried to expand on the mythology of the tape and do something different for this movie, even though it can get really silly. What I love the most about this movie is the direction. It's fairly well directed. I was surprised by how good the movie looked. The colours were very grim and creepy, and the overall creepy atmosphere was well achieved through those colours. The CGI wasn't the best, though. Samara looks alright, but the way she climbs out of the television looks incredibly cheap and took me out of the mood a little. Also, the \"Ring faces\" are quite ridiculous. \"Ring faces\" are the faces that people make when Samara gets to them. I didn't find the movie to be scary, but I did find it creepy due to the atmosphere and good direction. The acting was okay. My favourite performance is by Vincent D'Onofrio who plays a blind priest that shows up in the last 30 or so minutes of the movie. He's actually scarier than Samara, at least in this movie. The characters are nothing special. There's nothing memmorable about them. The ending I still don't know how to feel about. It leaves room for more sequels and is an intriguing end, but it just doesn't make any sense. All in all, Rings is an okay horror movie that is well directed and has interesting expansions on the Samara mythology, but is hard to make sense of. I would recommend this movie to the fans of the franchise.",
            "review_date": "2017-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally guys, a miracle has happened, we now have a 'The Ring' trilogy (American), i never thought the time would come, but now that it has we can celebrate. Samara Morgan is back after 12 years being forgotten and after seeing this film i can definitively say that.......... she should have stayed dead. It began with the Japanese film 'Ringu' in 1998 and this once interesting and terrifying plot has been driven into the ground. A girl climbing out of a TV screen can only be scary so many times people. This film follows a very familiar plot, Julia (Matilda Anna Ingrid Lutz) watches the video and after finding out she will die in 7 days uncovers secrets about the tape that no-one else has ever seen and so she goes on a hunt to discover what really happened to Samara. The movie isn't 'the worst thing ever' and unbearable to watch as it does have a few moments that are quite scary and some other little story elements that are kinda ok. But despite its many efforts to change up the game you can't look at this and not recognise that at its core it is just a very tired premise. \n\nOne of the selling points of the film was that finally Samara was trading in that old VCR and maybe picking up a nice Blu-Ray Player instead, essentially moving over to more modern forms of media. This did leave some room for innovation but other than the opening scene from the trailer that takes place in the plane the new technological advancements don't really do anything strikingly new. Whether the video is being passed around as a tape or a digital file it doesn't really make a difference. There is a cool thing in the film that was actually pretty interesting and would have been a new way to approach a Ring film but the movie introduces and forgets about it all within a matter of about 3 minutes. So there is one part of the film where it looks like there is a secret organisation or more like a cult of people who know about the tape and try to work together to spread the video around to avoid people actually dying. This was a very cool premise that i reckon would have been a great way to change things up from the very simple formula being rehashed over and over again. So it's a shame this movie didn't take advantage of that and instead just played it way too safe. \n\nThe performances in the film don't help you get through it easily. The leads of the film Matilda Anna Ingrid Lutz and Alex Roe were not good, like at all. A lot of their dialogue was very wooden, dry, and emotionless or they had lines that were just ridiculously overacted. There were a small handful of times where they sell the scares well but that's about it. I know Lutz comes from working on smaller foreign films and this is her first major American film from what i know so i guess i could give her a pass there. Johnny Galecki is fine in the film, probably one of the more engaging personalities in here, and they managed to drag Vincent D'Onofrio into this film, and he actually wasn't bad, there wasn't much to his character but he played it well.\n\nIn terms of the story there was always something i found fascinating about the mystery behind Samara and how and why she found herself killing people from within a VCR. That backstory has been covered pretty extensively in the previous films and as well as revisiting some of those plot points, this film does give a little more (newer) insight into her history which i thought was pretty engaging. Overall though the plot is a little all over the place focusing on a few different side-plots that throughout the 2nd and 3rd acts it tries to tie together and i guess does so but very thinly. So other than that and a handful of some pretty tense moments that get you throughout the film what else is there to this film? Not a whole lot really, but there is one Spoiler thing i will go into after my score.\n\nSo in the end, Rings tried to bring some life back into a forgotten franchise and other than a few brief moments of intrigue it very much failed to do so. Overall the story was scattered and reeked of missed opportunities, and the performances from the leads weren't doing anything to help the film. There are many better horror movies out there in 2017 so just go see anything else, but if you are still a die-hard fan of this franchise or B-grade (at best) horror films then you will get a kick out of this.\n\n4/10\n\nSo now there are SPOILERS TO FOLLOW, so DON'T read on if you have NOT seen the film as i will be spoiling the ending.\n.\n.\n.\n.\n.\nSo in the end of the film you find something out that was already pretty much revealed in the trailer and that is that Samara ends up being reborn and taking over the body of Julia. She already took over a body in 'The Ring Two' but that was a very brief stint. What this does is surprisingly leave this franchise that should be long dead by now once again open for something new in a possible sequel. You could actually do an entire film where you have Samara terrorising people in a physical (living) form. This isn't anything worth getting excited over at all as the chance of this getting a sequel i don't believe would be very high but part of me wants to see what they could do with something like that.",
            "review_date": "2017-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "bo-ring . . . I didn't expect much from this, so there was no disappointment. \nRings is terrible, drawn out, boring, badly acted, it doesn't feel like a 'Ring' movie at all . . . avoid.",
            "review_date": "2017-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst horror movie I've ever watched....",
            "review_date": "2017-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I give Rings two stars because it kept my attention the entire time. Rings made me jump and Samara, is creepy as heck. It was good to see David from Roseanne too.",
            "review_date": "2017-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am going to make this review short and sweet. This movie shouldn't been made.",
            "review_date": "2017-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "horrendous. awful acting and dialogue. it lost me like 40 minutes in. i started watching if fast for the most part. it became laughable. it turned into final destination, completely abandoning it's premise. (1 viewing)\n\n\nSPOILERS\n\n\nthe ending was so funny, she's the new samara and the video got mass emailed to ppl. smh",
            "review_date": "2017-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing new. Same old same old.",
            "review_date": "2017-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Same story line same plot same ending... just stop making this movie",
            "review_date": "2017-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A faint beginning, for a trilogy that was successful in the beginning of the year 2000, not for its quality, but for using the casual as cassette tapes to create terror, inspired by a Japanese work, the \"Called\" nor impressed more like It was ten years ago. The script is interesting, it tries to create a study on the phenomenon of the tape, I liked it a lot, and even works at a certain point in the movie, but then it becomes a complete joke, and the script loses its structure, although it has some Cool but really, unconvincing, falls into the sameness and cliché. Lousy performances and nothing to comment and technically he sucks, even has a very well made sound mix, but it is practically what we can highlight, without any care in photography or track to create the tension of the film. Lastly, the so-called 3 is another common horror film that has nothing to offer but it is cool to watch a family Sunday afternoon and even creates a nostalgia for the ancients, although little is invested in it taking into account Even the tape images change.",
            "review_date": "2017-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So used the same storyline but set in 2017! Not scary and exciting at all.  Acting was shocking",
            "review_date": "2017-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst movie I've ever seen. Zero plot. B-rated acting. Not even the slightest bit scary.",
            "review_date": "2017-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the worst movies ever.",
            "review_date": "2017-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was very excited to see this movie and I feel that within 20 minutes into the movie I knew I was in for a crapfest. There were a few neat moments in the film but it didn't redeem for the rest of the film. Go watch the original Ring movie.",
            "review_date": "2017-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Should of never made this film, not one suspenseful moment in the whole film.",
            "review_date": "2017-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies of the year, it's a horror movie that isn't scary or fun to watch, truly awful!",
            "review_date": "2017-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its sad that this movie sucks so bad according to many reviews. previous chapters were so good. haven't seen it yet but i'm about to watch it anyway.",
            "review_date": "2017-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as bad as everyone was making it out to be. I've seen worse horror movies than this. Mediocre plot but the ending left the door wide open for endless possibilities.",
            "review_date": "2017-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film was ok I was a bigger fan of The Ring. The main girl was a good actress but she felt no emotion to this film. And so many reasons after that. That the reason I gave Rings 2 stars.",
            "review_date": "2017-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved the first ring movie, the second was generic & stupid. This one was about the same. It's so dull, non-tention filled, & the actings not really good here. But I did like a few sequences visually, & I like Johnny Galecki, that's all the praise I can muster up for this film.  (4/10, D)",
            "review_date": "2017-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst films of 2017! Rings is one of the most idiotic and extremely predictable horror films I've ever seen in my life!!! 0/5 stars!!!",
            "review_date": "2017-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is just as interesting as watching paint dry. First shiite of 2017 so far.",
            "review_date": "2017-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "worst movie I ever watched in my life",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed this movie and I am disappointed in the majority of the movies I see. I noticed people calling this \"incoherent\" and \"hard to follow\". Gabriel is simply following who saw the Ring in a scientific manner. The movie keeps with the story but updates it. I thought they did a great job.",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The least watchable of the current trilogy.",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was horrible the trailer showed a big difference the trailer made it seem like a big horror movie, but the movie itself was more so a strait up story that was dull",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well Well's was the end of the trilogy! The film is good enough despite the opinion of critics! Excellent played Johnny Galecki! However, there is a disappointment! It was not quite a horror movie moments, and looked more like a thriller! So I put calls 8/10. (PS Judging by the end I think that to be continued ...)",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Uninspiring and boring. Annoying characters with too much bravado that get what they deserve in the end.",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the trainwreck I was expecting but still poorly executed.",
            "review_date": "2017-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rings is a decent teen horror/thriller FLIM that lots of young adults/teens will love. It's Not to scary and has a really good storyline, it's a great reboot of the ring franchise",
            "review_date": "2017-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you are a fan of the original or like ghost stories than this is a good flick to catch. Otherwise...",
            "review_date": "2017-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was good... i dont get what was wrong with it... i thought it was v v clever!!",
            "review_date": "2017-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was OK for a threequal lol",
            "review_date": "2017-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A total shocker loved it",
            "review_date": "2017-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fill in the well it's over for this crud",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only a wee bit entertaining and not scary at all. My husband and I both were very disappointed.",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film was not good it had everything to be good but it was a fail, you only understand the movie in the end jumpscares not there the only thing that scared me eas the dog",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "0/10 do not recommend. Thought it was a parody of The Ring. Made me want to kill myself within 7 mins.",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was SOOOOOOOOOOOO boring I brought my slime bc I knew I might of got bored. But this actually deserves no stars. It's not as good as the one a while ago so don't watch it unless you want to waste your $????????!!!!",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the first 2 were better, and tbh at one point i got a little bit bored of the movie. wish it had the same actors as the first 2 but set like 10 years later or something. At one point it seemed more like the movie don't breath, and not a supernatural horror movie.. I thought Samaras dad being in the movie was stupid, he already was killed in the first movie in the bathtub.... so how could he of been alive again?",
            "review_date": "2017-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I guess the franchise needed an update for the digital age, but I was overall underwhelmed.",
            "review_date": "2017-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a laughably bad film with horrible writing and cliche characters that anger you with there stupidity. I do have to say that there are a few creepy scenes with good atmosphere, but that's it.",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've only seen parts of the older ones and seeing how this was a modern remake, I figured it would b a lot scarier. Well I'm a horror movie lover. The scarier the better! This movie was a waste of my money. I wasn't scared once. Just annoyed.",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not sure why this got such low ratings. Was it Oscar worthy? No, of course not. But it was a good addition to the Ring franchise!",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "don't put yourself through this. it's just woeful",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Meh. Squandered potential on an intellectual property that has never excited me in the first place.",
            "review_date": "2017-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The shittiest \"scary\" movie I've seen. My brother dragged me to this and I left in a horrible mood. Almost fell asleep halfway through. Dragged on way too long.",
            "review_date": "2017-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing \"so bad it's good\" movie, nothing works, every single frame of this movie is broken, but it made me laugh so hard i almost died in cinema",
            "review_date": "2017-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really? 7%?!\n\nWtf...",
            "review_date": "2017-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've seen more suspenseful, scary movies on lifetime. Honestly it was a total bore.",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was the worst movie ever seen. Not recommended at all!",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not very good it's so boring and don't suggest wasting your money",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "holy shite was told it was bad didnt expect how utter shite it was. nothing new that basnt been seen before. its as frightening as a fly on shite.",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's been way worse horror movies last year.  The lead actress was very bland and boring.  It presented some interesting ideas to the ring mythology but it didn't really do anything with it.  Vince D'onofrio had an interesting role but at times I felt like I was watching a Scary Movie parody.  His character was kind of goofy and not scary.  I liked Johnny Galecki's character more than I thought I would, but he doesn't get much to do in the movie.  I would've liked to have seen a movie starring him honestly rather than this girl.  Also, some of the \"deaths\" in this movie play out like a Final Destination movie more than rings...so that was weird.  \nMuch like the Blair Witch movie, it presents a new angle to the mythology that we know from previous films but ends up ultimately making no sense in the end.  It was interesting while it lasted though.  I was entertained at least.  CGI samara is pretty terrible though.",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well what can I say this is one of the most boring films I will ever watch.  Weak plot, wooden acting and  the visual effects where something you would have seen 10 years ago. \n\nRings try's to jump scares where possible and it's so easy to spot them that you can count down from 1-5 and there it is.",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible Movie. Not scary, just boring.",
            "review_date": "2017-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was an okay movie, not as good as the originals. Not as scary as you would expect.",
            "review_date": "2017-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While an interesting premise, with some good lore building somehow the film comes across as quite dull. A shame the trailers I saw ruined the end twists of the movie",
            "review_date": "2017-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I LOVE the first movie, and I was both super excited & nervous about this one. I got everything from this movie that I needed - really thought it was great. Doesn't touch the first one, but it holds its own. Definitely check this out!!",
            "review_date": "2017-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1 liter of blah\n2 teaspoons of gibberish\n1/2 kg of crappy non-sense\nplus a wide selection of poorly selected amateur cast\nput'em all in a blender for 117 minutes, you got yourself 'Rings'",
            "review_date": "2017-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie deserves all the bad reviews",
            "review_date": "2017-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved the first 2 movies.  \nThis is absolute garbage.  Not a scary moment in the entire movie. Cinema trash in its purest form.",
            "review_date": "2017-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably one of the worst horror movies I have seen in a long time. The storyline and character development were weak and I was checking my watch every 5 minutes waiting for it to be over. if you want to see something that is actually horror do not see this.",
            "review_date": "2017-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rings is terrible!  The characters arent interesting, the plot is boring and there is  nothing  that you haven't seen before.",
            "review_date": "2017-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was a good scare film with some jumpy parts with an interesting story",
            "review_date": "2017-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not complete shit 1.5 ¯\\_(?)_/¯",
            "review_date": "2017-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wait for it to come out on dvd. save your money.",
            "review_date": "2017-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If the 2nd one went in a bad way this one is considered An insult and an offensive to the sequel \nAn story and plot twist are way way less than what we saw in the past films, julia's character is ofcourse full of good things and lots of feautures but Functionalization is shitty unfortunetly made her loss every good thing she had they had to rely on her, samara isn't the main villian and i wont say who is it cause i dont want to get into spoilers and the events are not related at all i felt that who wrote the screenplay is lost he was spining and confused and  it didn't have any jumpscares its just creepy, maybe  its suspensful in the end but it had some mystery scenes and gaps in the end its shitty movie and I will never see it again my score for this is 2/10",
            "review_date": "2017-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A waste of time is what this film ultimately becomes, it's not as bad as the critics are panning it but it sure as hell isn't much better. If it wasn't for D'Onofrio, there would be no reason to watch this vanilla movie, in an attempt to jumpstart a past horror franchise, Rings only makes us hope even more that this is the end we ever have to see of this stupid tape.",
            "review_date": "2017-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No where near as good as the first one. Felt as though this film has opened up the possibilty of a long line of mediocre \"Ring\" films to come.",
            "review_date": "2017-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wanted to leave the theatre and contemplated asking for my money back.",
            "review_date": "2017-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not sure why the ratings are so bad, thought it was pretty good with a good ending.",
            "review_date": "2017-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was neat getting more of the story, although it was predictable. The acting is exactly what you would expect from a movie like this, kind of B status. The directing was awful. Who thought it was a good idea to make the audience listen to the cast hyperventilating for the duration of the film?",
            "review_date": "2017-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rings is a little better than you'd expect from a movie that's the fifth entry in a tired franchise and has been pushed back almost half a year. That isn't saying much though. I will say, the lead actress and her boyfriend to a lesser extent, give decent enough peformances. The script they're working with doesn't compliment them at all though. Of course all of the \"scares\" are cheap and lazy. The plot is very predictable. To top it all off, the ending is just stupid. This is just a bland movie you'll forget as soon as the credits roll. Save yourself the time",
            "review_date": "2017-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An uninspiring horror that has little thrills in this obviously weak sequel to the franchise.",
            "review_date": "2017-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most movies are only meant to be made once. Sadly this is case for Rings.\n\nLeonard from Big Bang Theory is a professor who believes in some afterlife thing for people's souls. He recruits his students in his experiments that somehow tests his vague theory by watching that freaky video clip. They are supposed to die in seven days from when they watched the video, unless they got a tail (someone who watched a copy of their movie clip and passes on the curse).\n\nBiggest plot hole for me is that it's really not that hard to get someone to watch a video. Some joker would have sent it to a thousand people after he watched it. If that happens, and it probably would have in the real world, would the ghost girl even have the attention span to haunt EVERYBODY? Not very realistic.\n\nThe story begins with the protagonist's boyfriend when he suddenly went into incommunicado, and she accidentally discovered the whole thing. When his time almost ran out, she watched the video to save him. For some reason, because she's the chosen one, her video contained extra footage. She used the clues from the video clip to find out what happened to the ghost girl.\n\nThe ending should have been at the bonfire. It would have gotten more stars. The bit at the very end that hints another sequel made a few members of the audience groan.",
            "review_date": "2017-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Original was way better; not even good as a sequel or prequel.",
            "review_date": "2017-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'd like to think that I pay close enough attention to pop culture, specifically film, to know what is trendy and popular. I don't remember reading or hearing about a move to keep making additional entries in The Ring franchise. The first film was released in 2002 and was a remake of a Japanese film. It spawned a sequel in 2005, and somehow now we have a follow-up sequel. It isn't necessarily a reboot as it acknowledges there is a past to this story. If you remember, the premise involved a supernatural VHS tape that was cursed for whomever viewed it. After you watched the short video featuring a creepy girl named Samara who pops out of a well, you would get a phone call from an eerie voice stating you would die in seven days. Now that it's 2017, everything's gone digital. Johnny Galecki, best known for The Big Bang Theory, plays college professor Gabriel who buys a used VCR at some sort of rummage sale. It's not all that clear, but the sole reason why it's included is to give Gabriel a reason to come in contact with the tape. He attempts to get the VCR working and the video starts to play on all of his screens and devices. Try not to be too bored yet with this premise as it only gets worse.\n\nThe film cuts to Julia (Lutz) and Holt (Roe), a young couple passionately fooling around together on the last night before Holt has to head back to his college campus. Two horny teens are always featured in bad horror films. As the days pass on, Julia can't seem to get a hold of Holt. She gets bizarre messages from his frat mates and another female friend of his. A frustrated Julia heads to campus attempting to track Holt down. Her not-so-slick ways of getting to the bottom of it leads her to one of his classes where Gabriel just happens to be his instructor. What she comes to find out is that he is also the leader of this experimental secret society type group who is investigating the origin and aftermath effects of people who watch the tape. Julia finds Holt among the members of this group. After some painfully non-scary moments and stupid choices on her end, Julia winds up being another victim of Samara's video. The catch is that her video is longer and contains previously unseen footage. Again, try not to roll your eyes too hard yet at this premise. It's a race against the clock for Julia, Holt, and Gabriel try to track down Samara's origins in order to what? Save themselves? Save humanity? Lay Samara to rest?\n\nSo many questions rolled around in my head throughout Rings as a way to understand what was even happening before my eyes. Why are we getting a follow up to The Ring in 2017? Was there something new to be had with this franchise? The answer is no. Moving on. In order to set it in the current day they had to ditch the whole VHS concept and make it digital yet somehow the three person writing team felt the need to make Johnny Galecki's character, Gabriel, get into physical contact with the tape and a VCR. I'm assuming most of the teens seeing Rings will have no idea what a VCR is. Couldn't they simply have cut that and instead have him come in contact with a bootleg viral video that was popping up on the internet? My other question is why is Johnny Galecki in this movie to begin with? This is the kind of movie you make to get a paycheck. Galecki is one of the highest paid actors on TV thanks to his tenure on The Big Bang Theory. I can't imagine that he's that hard up for cash that he needs to star in Rings.\n\nThe whole plot device of having Gabriel working on some sort of experimental process involving Samara and the video isn't fully utilized. At one point, he mentions that each person has a tail that's following them. The idea of tails is not fully explained unless that's some description from the first film that I'm forgetting. Is the audience supposed to be kept in the dark about this? Apparently the writers don't care enough, because once Julia and Holt search out for Samara's origins the concept of the experiments and tails is completely forgotten about. It's as if Rings completely changes course for the second half of the movie. This leads to the other random casting in the film with Vincent D'Onofrio as Galen Burke. We're introduced to him as the crazy blind man in town who has a history with the village. Rings thinks it's being clever by involving a twist with his character, but it's completely unoriginal and uninspired.\n\nRings is a tragically unnecessary film that attempts to reboot a horror franchise when it wasn't needed. It is further proof that the horror genre is actually really hard to do well. We see feeble attempts like Rings all the time. F. Javier Gutiérrez fails at bringing any true scares to keep this film going. He goes so far as to try to make the opening of an umbrella scary, and it's laughable at best. Yes, you read that correctly. Umbrellas are made to be scary in Rings. That's the kind of movie this is.\n\nIs It Worth Your Trip to the Movies? It's safe to assume this will be on my worst of the year list.\n\nRATING: 1/2 out of 5 TICKET STUBS",
            "review_date": "2017-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why.. this movie was terrible absolutely not worth watching. The beginning 5 mins wasn't bad I liked the plane scene but after that the movie becomes a cliched boring mess. Having 2 big name actors in this movie didn't help much it just feels wasted for them to be there. This doesn't even feel like a \"sequel\" it just feels like a reimagining of the first film. don't bother watching this even if you liked the original it's just not worth seeing. This movie suffers the same problem Blair witch did. It tried hard to bring back a franchise that made loads of money but nowadays people don't give a damn about them anymore and maybe that's for the best.",
            "review_date": "2017-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Imagine my shock. Another horror remake that falls flat on its face,with boring visuals,storytelling and performances so weak,with the main actress being especially terrible, that Gigli looks a like an award-winning masterpiece.",
            "review_date": "2017-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't even get me started with this crap! The only thing that made this film look good were the teasing trailers that may or may not have motivated you to go see it! Bad acting, Bad plot, and horrible character personalities. This film is an insult to the genre of horror and would make Alfred Hitchcock vomit. However, it does give you a nice sense of horror movies the way that they used to be. I am still not that impressed.",
            "review_date": "2017-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Rings' is an unnecessary sequel that fails to do anything new with the franchise's premise and barely delivers the expected scares.",
            "review_date": "2017-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enough to keep you interested but follows suit with sequels very bland and not scary.",
            "review_date": "2017-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty much everything you'd want out of a Rings sequel. Brings the series into the digital age without straying too far from the rules of the franchise. Solid performances from Johnny Galecki and Vincent D'Onofrio. Had enough jump scares to startle the theater audience I was with. The only truly weak spot of the film is the wooden performance of the lead actress who plays Julia (Matilda Lutz). Her delivery is monotone and lacking of inflection at times in which she should be far more startled, scared or even emotionally drawn into a scene. Part of that is covered by the ending plot point but it felt like a cheap way to cover for a character whose delivery makes it hard to empathize with. Ultimately though, taken as a whole, this is not a bad entry to the franchise.",
            "review_date": "2017-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The scariest thing about Rings is the realization that you've wasted 100 good minutes of your life watching it. Inert scares, rubbish performances and a script which flat-lines at every turn - this one is complete stinker.",
            "review_date": "2017-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The tag line is \"First you watch it. Then you die\"....That's not too far off. The movie stumbles right out of the gate with a wholly unnecessary scene, which is immediately followed by a flash-forward of 2 years. We're then introduced to the main characters, but soon thereafter we flash-forward once more, but this time for 6 weeks. Why the movie couldn't have just opened at this point is beyond me, as the preceeding scenes aren't referenced, save it be for literally one line of dialogue. The director showed zero confidence in either the audience or his own skill for being able to portray subtle plot points. Key scenes aren't just shown, they are explained by the characters while they happen.The exposition was off the charts. Trapped inside this mess was Johnny Galecki who plays a young college professor. He actually brought weight and substance to his character. I found myself far more engaged during his scenes, but he's really just a side character. They dragged my man Vincent D'Onofrio into it as well. He did fine with his role, but the character felt like a last minute addition to the script to try to duct tape this plot together. The movie had an original release date of this past October, so I knew if the studio pushed a horror movie away from Halloween and stuffed it in early February it would be a rough ride. What it ended up being was a great idea for The Ring 4; rather than have the characters watch a creepy death movie, have them watch Rings.",
            "review_date": "2017-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay movie. All the scary parts are in the trailer already",
            "review_date": "2017-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From the \"why now?\" file, we have the third installment in a horror franchise that has been dormant since 2005. I haven't seen the first two movies since they first came out, but I remember thinking that The Ring is quite good. The Ring 2 is awful but is totally worth it for the deer attack scene, which is still one of the most unintentionally hilarious things ever put on film. Such vague memories are far more than what will stay with me about Rings, though. I was watching this movie 24 hours ago and I am already struggling to remember it. To summarize briefly: Rings is boring. It is painfully, mind-numbingly boring.\n \nIn a way, it makes a lot of sense to bring this series back now. With modern social media and the virality of media spreading online like wildfire, it would probably only take one jackass posting the Ring video online to wipe out half the world's population. Samara, our killer ghost, would have to hire assistants to help manage the sheer volume of murder appointments she would have on any given day. None of that matters, though, because this movie takes advantage of none of it. Johnny Galecki plays a college professor that is studying the ring video and using students as test subjects for documenting what happens after you watch the tape. Before a student's seven-day deadline arrives, another student will watch it to save the previous one, and so forth. This could actually be an interesting set-up, but the movie explains practically nothing about what he is doing. I spent as much time writing these sentences as the film does explaining what this dude is trying to do. As a quick aside, this guy's laboratory (I think) looks more like a freaking nightclub than a college facility, which loud music and multiple TVs and students seemingly just hanging out and partying. Speaking as a college administrator, somebody seriously needs to have a talk with this dude about proper usage of his funding.\n \nInstead of following that story, we get to follow some girl as our main character as she goes looking for her missing boyfriend, who is one of Galecki's students. I don't remember either of these character's names and the roles are performed with the enthusiasm of an insurance expo, so I'll just call them Girl and Guy. So, Girl sees a version of the video that is slightly different from the version everyone else sees, so they think she is special or something. Then Girl and Guy decide to go investigate the video's origins for some reason. After what feels like about 8 hours of them walking around and periodically finding a jump scare (including a quick shot to an umbrella opening, truly nightmarish stuff), Girl and Guy oddly stumble upon the plot of Don't Breathe in progress. Turns out that Samara's origin involves a blind, psychotic priest that impregnated a woman and then kept her chained up in the basement. And Samara is trying to be reincarnated in Girl's body.... I think. After a while, you forget that you're even watching a Ring movie because Samara shows up so rarely.\n \nI spent most of this film trying to make sense of the timeline. Assuming it is a sequel to the previous films, even though the events of those films aren't mentioned, much has happened since the CGI deer tried to inherit the earth in part 2. Samara's body was taken out of the well for some reason by somebody and then put into this town's cemetery. That caused a flood to destroy the town because....reasons. Then Don't Breathe priest guy took her body and stuck it in the wall of his house, again presumably for reasons. This all must have taken quite a long time and Samara has still clearly been active while all this happened, so she doesn't seem to care about any of it. By the end, I still hadn't made sense of it, but I think I devoted more time and thought to the subject than the writers did.\n\nI can't even muster the enthusiasm to be angry at this thing. It is inept in every way, from catatonic performances to cinematography that makes even daytime scenes look like they were shot underwater in the dark, but it isn't even a fun kind of bad. It's just a thing that played on a screen for what seemed like 12 hours while my mind darted from topic to topic, occasionally remembering that I was supposed to be watching a movie. Don't watch this movie unless you are having trouble sleeping, and even then I would recommend hitting yourself in the head with a hammer instead. At least then you would feel something.",
            "review_date": "2017-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Poor follow up to original movie. Weak performances and an awful ending. Don't waste your money.",
            "review_date": "2017-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as bad as the reviews. Was it great? No but I'm not sure what people expected. I was entertained the end was decent.",
            "review_date": "2017-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rings was great movie.  I loved the first 2 movies and this movie had amazing twist at the end.  I can tell by all the negative reviews that they didn't really understand it",
            "review_date": "2017-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "way better then expected,  poor acting, and of course a cliche horror ending...but not bad",
            "review_date": "2017-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I actually quite enjoyed this thrilling movie.  The plot was great however very predictable.",
            "review_date": "2017-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "15 years ago, there's a night scratched into my memory, that a few friends and myself just cannot ever forget. The night we went to the cinema to watch Rings. Not Hideo Nakata's original, Ringu, which I'm told is more horrifying than Gore Verbinski's US remake, thus putting me off watching the Japanese version all together. Admittedly too scared to on my own. \n\nThat screening had us knee-biting, face-hiding and under-the-breath swearing; walking back to my friend's flat to find the TV facing the wall with everyone else huddled on the sofas. To say we were all scared shitless was an understatement and it didn't help having a loner man come up behind us and whisper \"seven days\" as the end credits rolled. \n\nThe Ring legacy had already started out as a trilogy in Japan with a prequel, before Verbinski got his first Ring film complete. Nakata actually directing the US sequel Ring 2 that really wasn't a good follow up. I just remember it being a watered down version of it's previous film. \n\nThis instalment picks up 15 years later, where VHS is now an archaic relic. The legend of Samara continues, watching the surreal and disturbing short will bring about your death in seven days. (Who decides these rules? Does Samara keep a schedule?) But all of the original cast have been unexplainably replaced with new protagonists. \n\nLooks like Penny, Raj and Sheldon have finally dumped Leonard (Johnny Galecki) and moved on, leaving him to rot as an university professor who inadvertently comes across the film by purchasing VHS player with the video cassette still inside. Who would do that? Not Galecki because he wasn't to know, but who would leave the video cassette in there, letting it go to a vintage shop to be put back into circulation? Maybe Samara got to them, which leads me to a flaw in her quest to be heard. If she kills the one person who failed to pass on the viewing, it's game over for Samara. It's not like the video comes with any instructions to make copies and make it go viral. \n\nFairly inexperienced director F. Javier Gutiérrez takes the helm, with little to go on, it was possibly a gamble with the studios to have him direct. This being his first Hollywood feature after his Spanish film, Before The Fall. \n\nMatilda Anna Ingrid Lutz that's the lead as the key victim but comes across as quite the clingy psycho girlfriend who pretty much stalks her boyfriend, Holt (Alex Roe) when he goes A.W.O.L. from their nightly Skype and pretty much ignores her in a noble bid to spare her from what he's seen. \n\nNow I thought we already knew the back story, but no, they've added a twist to the tale, and Samara goes deeper than just being stuck in a well. And there's a terrible spoiler in the trailer, so don't watch it if you intend on watching soon. There's a moment it rips off a recent horror from last year, not a good move; and there's absolutely no lasting effect and maybe only a couple of jumps that fill the void of a mediocre, predictable plot. \n\nThe film is a prime example of what not to do, or of what people wouldn't, shouldn't do if ever in those eerie situations. No one in their sane mind would venture to a derelict church, in the dark, to search for something evil... Alone! However, it isn't scary enough. \n\nRunning Time: 2\nThe Cast: 2\nPerformance: 4\nDirection: 4\nStory: 3\nScript: 2\nCreativity: 6\nSoundtrack: 0\nJob Description: 1\nThe Extra Bonus Points: 0\n\n24% 2/10\n\nwww.spoileralertreviews.co.uk",
            "review_date": "2017-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "However, I like the genre of horror movies, not like this!\nHonestly,I didn't watch it completely,in fact I couldn't !",
            "review_date": "2017-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rings definitely couldn't hold a candle to the original. Where the original was deliberate, concise and thoroughly entertaining, Rings is a mess of scenes that often don't flow or even make sense. The movie was a non-stop train of palm to face moments with every turn of the story exhaust more of my suspension of disbelief. That said, there were bright moments. Vincent D'Onofrio's performance was stellar as always. The character may not have had much depth, but D'Onofrio has a way of making even the most mundane characters seem almost otherworldly. The cinematography was mostly impressive. There were a few shots that felt clumsy and forced, but for the most part it was shot with skill. Overall, I can't recommend wasting money on this. Ultimately, the movie had no point and it's clear that this was just a cash grab to capitalize on the nostalgia craze that sweeping our generation. Wait until this comes on TV and this will make a nice distraction.",
            "review_date": "2017-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Went into this movie after seeing all the bad reviews so the bar was set pretty low.  I think this movie is an adequate sequel, I was hoping they wouldn't do a social media version of The Ring and they didn't so I was glad there.  The fact that there was a university study covertly trying to figure out the phenomenon and setting the movie up with the double split experiment premise is a really good idea.  The main actors in it are relative unknowns, pretty common for horror movies, but they did lack a chemistry.  There was a few jump/noise scares that did get me, but the film was lacking an overall tension even with a ticking bomb plot device built in.  Still glad I saw it, deserves better than 5% .",
            "review_date": "2017-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched the ring and nearly died of boredom.",
            "review_date": "2017-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As one might expect from a PG-13 certificate, the scares are watered down, along with pretty much everything else. Dreary, rehashed story, cardboard characters and the acting is incredibly sub-par. Naomi Watts was excellent in the two prior installments and her presence is badly missing here. Dreadful 'crash-grab' sequel.",
            "review_date": "2017-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a piece of crap. Save you're time and money it is all hype and no content. Complete and utter shit...",
            "review_date": "2017-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The good? There isn't much. I do still think Samara is a cool bitch. The bad? The story, the editing and every single decision any character makes. SPOILER: If you've seen Don't Breath, try to tell me the 3rd act isn't eerily familiar.",
            "review_date": "2017-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I appreciated the first one more. it had some decent background, but it wasn't 'terrifying'.",
            "review_date": "2017-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was boring, slow and lacking in jumps and gore.  I actually  thought the plot was ok but this is supposed to be a horror movie, not at drama.  As such, it is a total fail and a waste of time and money.",
            "review_date": "2017-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "boring, trashy and completely disappointing",
            "review_date": "2017-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Arguably the worst movie I've ever seen!",
            "review_date": "2017-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brings new ideas to the table, not scary this time but it follows perfectly the line of the first and second movie. It connects well with the original story and goes further",
            "review_date": "2017-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thought this movie had a great story line. It was really suspenseful and not really scary but I definitely enjoyed it!",
            "review_date": "2017-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible is an understatement. What a piece of trash. Why bother making this absurd remake? I bet it made no money, scared no one and it was just a disservice to the original two that were pretty good. There's not even any gratuitous nudity. Pure garbage.",
            "review_date": "2017-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I may have brain cancer after watching this. Fucking awful.",
            "review_date": "2017-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than the first English remake. \nBe a good SAMARAtin :D",
            "review_date": "2017-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie was OK, but the timeline didn't really make sense with the previous movies",
            "review_date": "2017-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "DONT WASTE YOUR TIME OR MONEY!",
            "review_date": "2017-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is no where near as bad as some of the reviews. compared to most sequels it add more to the story. And still had a few scenes that were scary it did not have any note worthy acting performances still  better than most of what is been produced in Hollywood for sequels and horror movies. Worth the watch if your into horror flicks, just enjoy the movie for what it is.",
            "review_date": "2017-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good soft reboot & way better than current rotten score. It has all the horror cliche but more sci-fi angle with new twist to original Ring 2002 movie",
            "review_date": "2017-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was expecting something different, but same old story. Don't make a copy!",
            "review_date": "2017-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "2 stars. This could be seen as a okay movie however the beginning was rubbish and so was many other aspects of this movie. Didn't scare me and isn't that the whole point of horror movies?",
            "review_date": "2017-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I find the extremely negative (0/5) reviews are being entirely unfair, and seem to mostly be posted by pompous \"critics\" who think they're the end all be all of opinion. Critics love to hate horror movies, so it's no surprise this is reviewed badly, but as badly as it's been reviewed, is not reasonable.\n\nI have seen much worse acting in much better-reviewed movies. The story is pretty good. The atmosphere is a huge step up from The Ring 2, but still had a ways to go to reach The Ring. The biggest downfall is most likely the director. The directing job was not AWFUL, but it had more than plenty of room for improvement.",
            "review_date": "2017-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am so deeply disappointed. I love the Ring franchise and even enjoyed The Ring Two, so my bar is really not that high. This movie doesn't even feel like it's the same franchise. The scares lack creativity, the storyline is a half-assed rehash from The Ring Two and all the characters are highly unlikable and dull at best. Never watching this again.",
            "review_date": "2017-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Proper Perspective: Oh boy... Where to begin and where to end with this colossal pile of horse sh...\n\nOfficial Synopsis: A young woman finds herself on the receiving end of a terrifying curse that threatens to take her life in seven days.\n\n(Go see Sadako v Kayako instead)\n\nPlot: Boyfriend (Alex Roe) goes to college leaving girlfriend (Matilda Anna Ingrid Lutz) home to care for her mom. Boyfriend does not answer a lot of texts, so girlfriend travels to his school and meets spooky teacher (Johnny Galecki) and mysterious blonde (Aimee Teegarden), neither of which just give her a direct answer leading her to find this odd cult world where college kids watch the \"death tape\" and then pass it along to a \"tail\" before their seven days are up creating a glitch in the Samora Kills You In Seven Days Matrix.\n\n(Go see Sadako v Kayako instead)\n\nGirlfriend finds boyfriend after mysterious blonde is killed by Samora, then she watches the tape to save him because his \"tail\" never shows up.\n\n(Go see Sadako v Kayako instead) \n\nGirlfriend is special, Samora remixes the tape giving her extra images to solve the mystery of Samora and give us all the backstory we have all been craving and begging for since The Ring debuted in America in 2002. \n\n(Go see Sadako v Kayako instead)\n\nEff this movie, here is what happens.\n\n(Go see Sadako v Kayako instead) \n\nGirlfriend finds a blind former preacher who gives her cryptic messages about Samora, then she finds a basement in the church that turns out to be exactly how it was decades ago when Samora's mom was kidnapped, held against her will, and gave birth to Samora. Get this, the mom was a young child when she was kidnapped and the police held an investigation for SIX EFFING MONTHS and could not find the basement filled with evidence that girlfriend found in a few hours. What the actual eff movie?!!?\n\n(Go see Sadako v Kayako instead)\n\nDo not see this movie, ever. Save your money. It is a steaming pile of horse shat.\n\n(Go see Sadako v Kayako instead)\n\nTake: You know how when you meet your heroes they never live up to the hype you built up in your head? Or, when someone explains something mysterious about what you love the explanation is never as satisfying as what you envisioned in your head? Insert Rings.\n\n(Go see Sadako v Kayako instead)\n\nOh, Rings is not funny.\n\nOh, and Rings disregards its own lore.\n\nOh, and and Rings is a lesser version at times of Final Destination, Don't Breathe, and other better movies. \n\n(Go see Sadako v Kayako instead)\n\nOkay, so we start on a plane all Final Destination style where a good looking young male actor Zach Roerig turns to a good looking young female actor Laura Wiggins and asks her, \"Do you know about the video tape that kills you after you watch it?\" Yeah, then all the Final Destination/Ring stuff happens and we go into the credits and then into the movie. \n\n(Go see Sadako v Kayako instead)\n\nYikes. If you have seen the movie \"Wild Tales\" you know that movie has one of the better openings of a movie in recent memory, it also so happens to be on a plane, and Rings went so far in the other direction with their cold open it knocked the damn ball off the pendulum. \n\n(Go see Sadako v Kayako instead)\n\nPositives. I like Amiee Teegarden from Friday Night Lights? That doesn't count. Um, it was only 107 minutes. That isn't a positive, horror movies should stay in the wheel house of 90 minutes or so. How about the acting made Twilight look Oscar worthy? Still not a positive. That is because this movie is the worst. No positives. Save your money. \n\nGo see Sadako vs. Kayako numerous times on Amazon or buy it to support quality movies worth your time and money.\n\n(Go see Sadako v Kayako instead)\n\nRecommendation: Well, I mean for the first 665 words I was so glowing and positive, right? I wasted 665 words of my life. Let's see. In theaters right now I would recommend La La Land, Arrival, Hidden Figures, Rogue One: A Star Wars Story, Split, Patriots Day, Lion Fences, 20th Century Women, The Comedian, xXx: The Return of Xander Cage, and why not the 25th Anniversary screenings of Wayne's Word while we are at it. I'd recommend all of those over Rings...\n\nSeriously eff this movie, I am generally a positive guy.",
            "review_date": "2017-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Predictable. In no way worth movie theater prices, your small screen at home will do. No real emotional attachment to the characters to care if they live or die. Young middle schoolers will enjoy the PG love scenes and the horror fans will be intrigued in end outcome of Samara's story but disgusted at the cheap scares that are as annoying as the dull lead actors. Gale and D'Onfrio are always worth watching but, save your money and rent the original.",
            "review_date": "2017-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wasn't expecting an great ending like that.",
            "review_date": "2017-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the movie is eh... it's like they didn't even try just went over what we already knew added a love scene that no one wanted and then it ended. :( I was so looking forward to this.. more imagination next time people, if it ain't broke don't fix it.",
            "review_date": "2017-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "sadly nothing you haven't seen done before and probably better",
            "review_date": "2017-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think they didn't respect the viewers with a consistence history, the writers made a really greedy movie script with the only purpose to create more sequels.",
            "review_date": "2017-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty shocked to see this get another go and although the story was better, it's still very boring.",
            "review_date": "2017-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie couldn't be worse than Moonlight. I seriously doubt the entire ratings system based on how Moonlight was scored. See this movie before Moonlight",
            "review_date": "2017-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I actually enjoyed this, although I spent most of my\nTime hiding behind my fingers had some good scares and a good twist.",
            "review_date": "2017-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rings isn't awful, but it's not decent, either.",
            "review_date": "2017-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its not the worst thing ever, and I'd say its better than Ring Two. There are some interesting things going on in this movie, but unfortunately its just too boring for its own good.",
            "review_date": "2017-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First off I'd like to say the first \"Ring\" movie is one of my favorite horror movies off all time. This sequel follows in the same tradition but doesn't have the same effect as the first. It is still a good creepy time but doesn't have the same shock and fright factor of a truly great horror movie. Overall the story isn't bad but not strong enough to make it a movie you'll watch more then once. Johnny Galecki from Bing Bang Theory is an interesting risky choice but could have been casted better. As a horror fan it's always nice to see a kick back to a horror movie that changed our lives but 99% off the time it's going to fall short. If your looking for a truly sick  horror flick move on if your looking for an average horror movie with a few frights it's worth checking out. 2.5 fingers in the air!",
            "review_date": "2017-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay, Rings is their one mulligan, let's just hope that the horror genre starts following the the path of great flicks that 2016 brought us. To be honest, I never expected much going into this reboot/sequel, and I felt even less attachment to it after I left the theatre. This is yet another horror franchise that is far too afraid to stray from what made it good in the first place, that almost everything seems like a rehash. Sure, it's updated for today and when a VHS player is used, it's justified. I admire that this film tries to take the story in a different direction, but all of the big moments are really just recreations of the original films. Having said that, the portions of the film that are original, I found myself uninterested in. Here is why Rings was completely unnecessary and why I hope the franchise stops here. \n\nThere is only so much you can pull off with a premise like this, especially in today's day and age, due to the fact that everything is now digital. Opening with the most ridiculous sequence, taking away the thrill of only having one or two people viewing the tape, it felt like a roller coaster ride that shouldn't have been included in the film. Aside from that, there is an opening sequence just before the title card that had be intrigued. The tape is found after someone purchases an old VHS player at a flea market, which leads to a very eerie scene with some interesting visual effects. After that, the film very quickly dives into cliched characters and a plot that feels very heavy-handed. \n\nBuilding on the mythology as much as it possible can and having too many people exposed to this video all at once, Rings becomes confused with itself. A professor at a University holds a bunch of students in a room, searching for random people to put the curse on in order to continue the chain so nobody dies. Selling itself as a soft reboot for the franchise, this film also relies on you knowing certain elements from the previous films. The fact that you can copy the tape or in this case, the file, and hand it to someone else, creating an endless chain, is done throughout this film, but never explained. Only if you have seen the other films will you be able to fully comprehend the occurrences of this picture. \n\nThere hasn't been a film in this franchise since the release of The Ring Two back in 2005, and playing out as more of a sequel, the timeline needs to continue, incorporating today's technology. This is precisely where the film fails. Social media is at an all-time high right now, so anyone that sees this video would share it to their friends and it would become a global topic. Everyone on the planet would eventually die from this video. This premise doesn't work at all nowadays. If the studio was truly desperate to bring back The Ring, I would have suggested a remake that takes place about 20 years ago. \n\nIn the end, if you have seen any of the early entries in this franchise, nothing about this film should surprise you. Sure, it adds in a few new elements to keep things interesting, but Rings is poorly constructed and takes far too many turns with its plot to keep viewers fully engaged. Die hard horror fans may get a kick out of a few sequences, but Rings is all been-there-done-that in my opinion. I'm not a huge horror fan. I've said that many times and I will continue to say it, but Ringu and The Ring were great horror flicks that should have just stuck to those two films. For their time, they had an original premise that terrified audiences. Eventually, every single horror film will be reinvented and made into franchises if possible, and you know what? I'll never be against that, as long as a fresh premise is conjured up. Rings fails on everything it wants to be. There are some decent performances and some solid imagery, but this has been done much, much better in the past. I can't get myself to recommend it in any way.",
            "review_date": "2017-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cool movie !!! Samara is back...",
            "review_date": "2017-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A waste of my money. I watched bae sleep cause it was way more interesting.",
            "review_date": "2017-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wedding ring is scarier than this movie.",
            "review_date": "2017-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just horrible. No atmosphere, no scary bits, a pure snore-fest. Don't bother. I'd rather watch the infamous VHS than watch this again.",
            "review_date": "2017-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was decent because of the jumpscares",
            "review_date": "2017-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have not seen it but damn that poster is scary",
            "review_date": "2017-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The main characters were not engaging, had no charisma and honestly,  couldn't act. Because of that I didn't care weather or not they died. As for the movie, it didn't develop it's ideas at all to the point that the movie became a full blown mess of nonsense. I hope this movie takes it's own advice and dies in 7 days. This may very well  be 2017's first Razzie nomination.",
            "review_date": "2017-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good sequel to the original. But the original is a little better. This is still pretty good, but not quite as good as the original",
            "review_date": "2017-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whoever thought of this is really stupid.",
            "review_date": "2017-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loads of jumpscares and really amazing storyline",
            "review_date": "2017-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bad remake! Not that much horror not scary at all????",
            "review_date": "2017-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From someone coming from having seen the original Ringu series and books, to a fan of the original remake, this movie is not that bad. It actually has a good script and characters that have a little more depth then the usual horror fare that gets released, especially at this time of year. It further expands the mythos of Samara and the cursed tape and brings it to current time past the wretched vhs tape. It doesn't rely on cheap Jump scares and does offer some good creep value and legit eerie moments. \nIt does lack in the style that Gore Verbinski brought to the first one and the constant feeling of dread. There is a point where this does turn into final destination and the concept of seeing things happening before they do. While the original did have this, they used it more in a visual meaning rather than a cheap plot device.  Many things done in this one do work and are used creatively that merit this a good start point to bring a franchise. Hopefully we shall see.",
            "review_date": "2017-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is basically how not to restart a horror franchise.",
            "review_date": "2017-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First you watch it. Then you die... from boredom.",
            "review_date": "2017-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film really scary and a good  storyline",
            "review_date": "2017-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Woefully bad watch the Japanese original and forget this ever existed!",
            "review_date": "2017-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Doesn't make any sense and the history is all messed up. Not a good movie unfortunately. The previous two films with Naomi Watts were much better.",
            "review_date": "2017-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I needed to do something that wasn't a complete waste of my time, so I went to see this beauty",
            "review_date": "2017-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"'Rings' sucks\" http://horrorriley.blogspot.com/2017/02/review-rings.html?m=1",
            "review_date": "2017-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "SORRY, WRONG NUMBER - My Review of RINGS (0 Stars)\n\nFiling this squarely under \"Early In The Year Dumping Ground Movies Nobody Asked For\", RINGS plays out like the cynical cash grab as intended.  #Goals!!  \"FIRST YOU WATCH IT.  THEN YOU DIE\" reads the poster, but it should more accurately state, \"YOU WILL DIE WHILE WATCHING IT\".  \n\nFifteen years ago, Naomi Watts starred in the remake of the Japanese original, both considered classics of the horror genre.  I enjoyed them, along with RING TWO from 2005, but more for the visceral gooeyness on display rather than any great scares.  Featuring a cool concept of watching a creepy video and immediately receiving a phone call warning you that you'll die in seven days unless you can make a copy and get someone else to watch, the RING was the pyramid scheme of scare flicks.  IT FOLLOWS felt like their STD-riddled cousin.  RINGS, on the other hand, feels like their dead-on-arrival niece, thrice-removed.  \n\nMore of a reboot than a sequel, with perhaps a little more lore added to that mangy little Samara's storyline, RINGS features the same concept but pasted onto a bunch of horny college students.  Progress!!  Before the opening credits, we're treated to not one, but two ridiculous sequences.  One involves a scared man on a jet whose time to die fast approaches.  After a lot of shaky cam and sweating, we're cheated out of the money shot and abruptly cut to Johnny Galecki, who found time off from his BIG BANG THEORY schedule to slum it as a college professor who makes the mistake of watching that stupid Film School 101 tape.  Like all spineless teachers with tenure, he chooses to pass the curse along and endanger as many unsuspecting co-eds as possible.  \n\nOne of his victims happens to be Holt (Alex Roe), who just arrived at college, leaving his girlfriend Julia (Matilda Anna Ingrid Lutz) behind to worry herself sick when he goes missing.  Lutz, who looks and acts like Phoebe Cates had she swallowed two fistfuls of Valium, tracks Holt down and, in an effort to save him, watches that damn video.  Millennials!  When will they learn that it's better to thin the herd by letting every one else die.  The ship has sailed long ago for taking one for the team!  \n\nFrom there, things play out fairly predictably, although in much more boring fashion than you would suspect. Director F. Javier Gutiérrez does the best he can in aping the original, and it's stylishly made.  Still, I'd call this a flaming turd, except flaming turds are fun to watch as they arc their way through the night sky, am I right?  RINGS is more like that hardened, dried-out piece of doggy do you find on your lawn seven days after it was laid to rest.  It's lost that steaming stench, no longer vital, and incapable of even sticking to your shoe.  I suppose if you've never seen the original films, you may have a creepy good time, but you will still wonder who that girl is crawling out of your television and why she doesn't have anything better to do!  You, of course, do.",
            "review_date": "2017-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As about scary than Sing! So not scary obviously plot flimsy! Not too many scary killed people. Still watchable but expected more! at very least some scary moment how about NO!",
            "review_date": "2017-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rings let me watch a cast member of The Big Bang Theory die horribly.\n\n11/10 film of the year.",
            "review_date": "2017-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst horror reboot ever, right from the first scene you fear the worst over how the film will turn out but not even that could prepare you for what soon followed. Nothing but dull, pointless, meaningless, boring load of rubbish. Don't bother",
            "review_date": "2017-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A horrible movie that never creates any sense of suspense and doesn't ever really do anything to be scary either. It lacks any personality, its premise is questionable and it provides no characters worth caring about. The performances are bad, but the dialogue isn't much better and its tie to the other films is so loose that it ultimately doesn't make any sense and seems pretty illogical. Just an awful movie.",
            "review_date": "2017-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst fucking acting I've ever seen. Incoherent plot, even IF it's a spinoff of a Koji Suzuki book. I don't even know whether to call this a sequel or a prequel or whatever because it's completely inconsistent with the other movies. Worst waste of time and money ever, IMO.\n\nHollywood, please, make something original for once!!! Or maybe don't shit on a good franchise!?",
            "review_date": "2017-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lawful film. So boring nothing happens. Not scary at all I was just bored shitless",
            "review_date": "2017-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Biggest piece of shit movie ever best part is the first five minutes in the last five minutes!",
            "review_date": "2017-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible movie , always the same story",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The images looks scary,  but the story is confusing.",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RINGS IS THE WORSE MOVIE EVER MADE",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first one is the best.  This one didn't seem to be have anything new.",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Plagiarism from at least 3 different films. There is no willing suspension of disbelief. And the end of the movie destroys the premise. On a side note one jump scare was so pathetic I actually burst out laughing so hard that the rest of the theatre followed my lead. It's bad.",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They aren't haters they are people that know what a good and bad movie is. Oooo spooky a jumpscare got me! Oh no its scary! You need good actors, good plot, good script, good scares.",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Confused history, very bad performances, bad editing and boring. This movie have more laughs than scares.",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why do people hate this movie so much? I saw the first and second ring movies and there was only one thing that didn't quite match up about Evelyn but I thought this movie was really good. I think it deserves a lot more credit than it's getting.",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not even so bad it's good, it's just bad.",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wasnt horrible, however wasn't that good.",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie plot was pretty good, the ending sucked though",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "weak as hell. cool back story surfaces but not scary at all. in all fairness, it's just to hard to top the first movie especially when you know what to expect.",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ive seen shit movies before, but this....this takes it to a whole new level of lazy casting, directing, writing, and editing.",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't say it was scary. I kept wondering if that professor really knows all there is to know them he should know that it doesn't matter what you do the little girl will continue to kill people no matter what you do. Track her down free her spirit she doesn't care. Why add a new back story by the way?  And if everyone sees the movie then everyone will either be immune or everyone will die. This is an unwanted sequel",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "about what you'd expect. Vince D'Onofrio is pretty spooky.",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was AWFUL. Boring is an understatement. So disappointing as the original was quite good. This film had a lot of potential but lacked even a half decent story line. It does not even deserve the half star I gave it!! Do not waste your time watching this",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original Ring is one of the scariest movies I have seen, Rings is one of the worst!!! Waste of time!!!",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was TERRIBLE! Don't even waste your time. I didn't even pay to see it because I had free movie tickets but I want my tickets back. -_-",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That was extremely boring. The most exciting thing was the person next to us snoring.",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good grief, \"Rings\" was Abysmal.\n\nWhat a lazy, sloppy, simple minded, predictable, boring, poorly acted, unscary, Cliche, unnecessary, excuse for a Scooby Doo Mystery!\n\nIf you haven't solved this piece of shit movie by the 45 to an hour mark, you're either slow or asleep (which is totally understandable) \n\nI struggled to stay awake, and even more so to not just leave, because it was so obvious where it was heading, I didn't need to further punish myself. (But I stayed and did) \n\nIf you must see this, please steal it online, so they don't make another one. I should've known after Ring 2 that I should've avoided this, but curiosity killed the cat and my wallet...\n\nAbsolutely AWFUL! \n\nThe critics nailed it, and my friends warned me.. I have nobody to blame myself. So I'm warning you. Lol",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was definitely scary, but it wasn't as good as the first two. It ended in a way that made it seem like there needed to be another movie in the Ring series, which I wouldn't mind.",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I could've made a better movie with two puppets slapping each other until one of them dies.",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie was pretty good , but the ending sucked making it look bad.",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching this was like eating instant noodles without adding the flavouring",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A long time ago, I watched the Japanese-turned-American films 'The Ring' & 'The Ring 2', I thought they were ok; now, years later, we return to the franchise with 'Rings'. Is it a worthy sequel, or just a shallow cash grab? You decide!\n\nRather than pick up where the last film left off, this one only starts out as a typical Ring film, then adds elements of science vs the supernatural, evolves the videos' delivery method, & gives us a new mystery surrounding Samara's family. The film felt longer than the 1hr, 42min run time, but the end was interesting enough to sort of make it worth the slow pace.\n\nThe cast was ok, our leads were passable, & the other characters were interesting to watch.\n\nThe effects were pretty good, the classic Ring imagery holding up pretty well & believably adapting to the change in technology. The sound was what did it for me, keeping me in a slightly high tension state.\n\n2 3/4 stars out of 5, if you liked the first two Ring films, this one is about as good. But as a stand alone, it was just...meh.",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was really great!! I love horror movies and I love The Ring. This movie might have been a little different, but it still was an awesome movie. The only thing bad I have to say about this movie is the use of new technology in the movie instead of the VHS machine and tape. That is what The Ring is all about, the tape. It was stupid seeing Samara on a flat screen tv and iPhone. The acting was good, quite a bit of jump scares, I ain't got nothing to complain about!! 4/5",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have always loved The Ring movies. This was a new spin on the story. The first one is still the best. Good movie.",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a reference, I loved the first Ring movie, I thought the second was ok. But this one was just boring, I go to the movies at least once a week and I love horror movies. I literally started dosing off during this movie and didn't really feel scared at all. I think she actually kills 2 people the whole movie and is on screen for about 5 minutes all movie. Not worth the money at all.",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Looks great but it adds nothing to the story and the PG rating limits the thrill.",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't care what the ratings are, this is a really good movie. The ending leaves the door open (no pun intended) for a sequel. The jumpscares are effective and the franchise has proven that Samara cannot rest. I'd recommend it for those who saw the first and second movie. You'll know what's going on.",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a waste of time. Don't bother renting either. Nothing redeeming about this reboot.",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wish I could give this crap a score less than half a star. I want my money back and I feel I am entitled to some sort of compensation for my wasted time. I loved the original Ring movies but this was a lazy rehash and it should have never been made. Just know this and you'll have enjoyed the movie. Samara needs help going digital. That's all. You need to kill people within seven days. YouTube exists.",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Average... The first 2 were good. This one was unnecessary and meds little sense...",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overall it's not that bad of a movie but the acting is a little rough , the plot itself is the biggest issue its all over the place and the ending tries to make the movie scary but all it does is makes the whole movie come across as funny. Overall if you just want a casual movie night I would suggest maybe going to other movies or waiting until other movies come out cause I don't think this is worth ur money at all in the theatre.",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you go to someone's home and they bolt the door from the inside, do you ask for tea and not mention it? Do you not say anything when you notice red swirls that oddly resemble blood on said home's ceiling? If you see someone get their face melted because they watched a movie, do you think \"yay, my turn to see that awesome movie?\" \n\nWell those are just two of the dumb things the annoying main character does.  Rings was so nonsensical that I was hoping the main character met \"the Girl\" so the movie could be over already.  The best thing about this movie was the Eclipse theatre where it was showing.",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another non scary movie.  I was really looking forward to watching as I loved the first one.",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best scary movies I've seen in a long time!",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the first 30 seconds of the movie was a huge indication at how bad this movie was going to be. actually envisioned myself banging my head on a wall and thinking that that would be more entertaining and sitting through this awful horrendous movie that should have gone straight to DVD",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is not going to be a long review. It's shit, avoid. 1/2 star out of 5",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "30 minutes in all I could think of \"You dumb bitch, Julia\". Good for her stupid ass.\n\nSo, is there gonna be a follow up called \"Rings: Rebirth\"?",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film barely deserves even half a star :( Terribly edited, and just completely unnecessary and full of the same tired cliches!",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Who asked for this movie? Is there a horror quota studio need to meet, nearly 98% of horror movies are trash now. No innovation just remake after remake, maybe the horror genre needs a hiatus to regroup. Or fire the people in charge who kept green lighting these films.",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "we work hard for every dollar we made , seeing this movie is wasting your money guaranteed.\nIts not even scary but boring all the way to the end.",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was bad. I want to kill myself.",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eh. Didn't get to me. Gets points for telling a different story than I expected.",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good sequel with a slower than expected plot, but with a good story twist. It would have been better shorter, cut a couple of unnecessary scenes and fixed. The performances were plain and nothing to brag about. Of course we will see plenty of sequels to come, but it all depends on the box office performance to determine if it will be straight to video or theatrical release. B-",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I Honestly Loved The Whole Movie. It Does Have Some Flaws But This Would Be A Great Movie If You're Looking For Something Small.",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "literally the dumbest movie ever. this was worst than the dumb third remake of the grudge. the concept was lost in the sell out of a \"horror\" movie. i wouldn't even give it one star if i had the chance to. honestly, wait for it to be on the $5 section at walmart. not even worth it.",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie was better than it had any right to be, but it didn't try to do anything new. I actually enjoyed the mystery aspect of the film, but it kind of failed as a scary movie, as it wasn't scary at all and was filled with cheap fake jump scares. The acting from the two main people isn't bad, but you can tell they got the parts just because they were pretty. This movie seems much more of a sequel to the original movie The Ring, forgetting most of the nonsense from The Ring 2. Rings also seems to take more inspiration from the original Japanese films, where a lot more is learned about Samara's birth parents.\n\nFrom the trailers, I thought that this movie might have a lot more stuff with social media, but other than a few things, this movie could have taken place a decade ago. The only thing to show that the film's in the present is that they copy & paste video files, and they use smart phones as flashlights. Overall, the film isn't horrible, but it also isn't very good, I definitely wouldn't recommend it.\n\nIf you want to see my full review in video form you can check it out here: https://www.youtube.com/watch?v=JstAEbfzXwI",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly awful. Had a bland ending. Story leading up to the ending was okay, but even then it didn't have much to it.",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "goodbye brain cells, you've served me well.",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So good I saw it twice. Don't know what you haters are talking about.",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Complete waste of money!! Honestly if I could have my money back I would love 16 dollars cash! This \"remake\"-if you'd call it- is a cringe and a disgrace to the original The Ring. Poor acting and do I really have to mention the script. You all wasted 33 million dollars, advertised for nothing, and over hyped a movie that was made with low budget actors. Sorry to say it but, it sucked",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a way to ruin a movie. Watch out final destination rings is gunning for your genre",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a dumb movie, wish I hadn't paid and seen it and just gone home.",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't care what the ratings say, this movie was awesome in my opinion. No one would ever guess the ending and it was just an overall great movie. I would watch it again.",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I walked into the theater expecting a horrible movie. What I got was a not so good movie. But that's still better than what I expected. The acting was subpar and the movie was filmed somewhat decently. If you're a fan of the Ring franchise or are craving to see a horror film this early in the year, this movie should do the trick. 5.3/10",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "worst then 2nd movie",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bad acting mixed with a horrible story and a horror movie that doesn't scare or entertain you = This movie",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bad. No wonder they hid it from critics.",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You may be aware that the release of 2017's \"Rings\" (PG-13, 1:57) came a dozen years after the previous American sequel in the \"Ring\" franchise, or even that the very first \"Ring\" film was Japanese, but most people aren't aware of how the story began and how far-reaching it has become. The story of people dying seven days after watching the strange images on a mysterious videotape was first told in a trilogy of books by Japanese author Koji Suzuki in the 1990s. The first novel in \"The Ring Trilogy\" was simply titled \"Rings\" and was published in 1991. In Japan, it inspired two manga adaptations, a 1995 film (\"Ring: Kanzenban\"), a TV series (\"Ring: The Final Chapter\"), another movie version (1998's \"Ring\", also known as \"Ringu\") and a sequel (1999's \"Ringu 2\"), followed by two remakes of the 1998 film, one from South Korea (\"The Ring Virus\" in 1999) and the other from the U.S. (\"The Ring\" in 2002). The American version made over five times what it cost so, naturally, there was a sequel. The profits for \"The Ring Two\" (released in 2005) \"only\" tripled its budget and was also rated much lower than the previous film by both critics and audiences. The success of \"The Ring\" led to the American remakes of other Japanese horror films such as \"The Grudge\" (and its sequel), \"Dark Water\" and \"Pulse\", but the diminishing \"Ring\" returns and reviews probably contributed to the 12 year gap between \"The Ring Two\" and \"Rings\".  \n\nUpdating the story for a new decade means that, rather on VHS tape, the deadly video at the center of the story is now being stored as a digital file and is viewable on a variety of devices, making the clip all the more ubiquitous - and dangerous. Remaining the same, however, is the origin of the video (a murdered girl named Samara reaching out for vengeance from beyond the grave) plus the way in which the video's curse is carried forward (the viewer receiving a phone call with a creepy female voice on the other end seeing strange things that are not there and then dying exactly seven days after watching the video, unless he or she copies the video and dupes some other poor schmuck into watching it before the week is out). We see the culmination of this pattern play out in the first scene on an airplane flight during which a handsome young man explains his nervousness to an incredulous female passenger by explaining, just as the plane is about to land, that he only has to \"make it\" through a few more minutes.\n\nJulia and Holt (Matilda Lutz and Alex Roe) are just two teenagers in love... who are about to find themselves deep in a well of malevolence. Holt is heading off to college, while Julia stays back in their hometown to take care of her ailing mother. Texts, phone calls and Skype sessions keep the relationship going... until Holt suddenly and inexplicably stops answering Julia's calls. Desperate, Julia jumps in her car and drives to Holt's college where he is nowhere to be found and where those who know him either don't know where he is or won't say. Julia knows that Holt has been getting extra credit by working on a project for Gabriel, his biology professor (Johnny Galecki), but the prof denies knowing who Holt is, so Julia follows him to another floor of the classroom building to see what's up. She finds herself in a room full of students, video screens and digital clocks which are labeled with various students' names and which are counting down from various points in time. Julia follows a panicked student named Skye (Aimee Teegarden). Skye admits that she knows where Holt is but, before explaining further says, \"I have to show you something first\". Skye takes Julia home and Julia sees texts from Holt on Skye's phone. \nJulia learns about the cursed video and that Holt watched it - almost exactly seven full days earlier - so she watches it in order to save Holt, which starts her own proverbial clock ticking. But the video Julia sees is a little different from the previous versions. There are even more disturbing, surreal and seemingly random images in Julia's video - and her experience is different from everyone else's. With Holt's help, Julia follows the clues in her video and the visions that she starts seeing so she can unravel the mystery, save her own life and maybe finally give Samara's spirit some peace. This quest ends up in a small town, where they meet a secretive B&B owner (Jill Jane Clements) and the caretaker (Vincent D'Onofrio) of the grounds of a former church, as they learn of the disappearance of another young girl 30 years earlier, all of which adds background to the version of this saga that began in \"The Ring\". \n\n\"Rings\" is both enjoyable and frustrating. Updating the technology involved with watching, copying and sharing the infamous Samara video opens up more possibilities for story-telling, while delving deeper into Samara's sad history adds interesting background - and also takes the tale of the tape in some cool new directions. On the other hand, the script's lack of exposition makes the movie hard to follow... and the acting is somewhat lacking. The ending brings most of it together well, but getting there will put you through the... wringer. \"B\"",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You see that tagline \"First You Watch It, Then You Die\", let that set the mood for how atrocious Rings is, an unimaginative rehash of the earlier films with cardboard cutout characters, a horror cliché filled script, and a serious lack of scares!",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Feels like I'm watching the Scooby Doo movie; no horror and backwater plot.",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "some jumps and scary images but the last one was so long ago this did not bring this back to life",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It opens with potential but then goes down similar route previous films in series have...a new/fresher/modern take on the myth was needed this felt old, tired, dull and serverly lacking in scares or tension, my advice avoid",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I refuse to give Dinero another shot at my pocketbook after that HORID movie \"Bad Grandpa\". I still want my money back after sitting through the most nauseating movie I've ever seen.  PLEASE STOP!",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am skeptical of the 3rd film. The first was good while the second was terrible so that is why I am skeptical",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you liked the previous Ring movies, you will understand and enjoy this one.  Not quite as scary as it could be, but still interesting.",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "slow and boring, wasn't scared at all",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a scary/horror film but it was very suspenseful and unpredictable but great plot",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a huge fan of this series, I have to say that this movie successfully ups the ante of the last two movies.  Samara is typically terrifying and the climactic scene at the end gave me chills of simultaneous fright and excitement.  I expect movie snobs to treat this movie like they do all horror films however I would rather watch this than some high minded drama or the umpteenth holocaust movie.",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh, cranky critics. They're knee-deep in Oscar season and can't be bothered to lower themselves for a horror sequel that is about 10 years too late. Samara gets an upgrade--forget about VHS tapes, because now that creepy video can go viral. This movie is closer in tone (and look) to the first film, but it doesn't offer many new scares. It does have a creepy atmosphere and interesting enough backstory for Samara and her father, even if the movie is about 30 minutes too long, making it feel like \"seven days.\" File this under \"sort of creepy but too familiar.\"",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "took my little brother to this movie with low expectations, but it actually came out pretty good. I'm planning on seeing it a few more times.",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie sucks so bad!",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terribly boring! The first movie in the series scared the hell out of me, and this one had me falling asleep. The acting was barely average and the scares were minimal. Very disappointed with the ending. Save your money, and don't bother seeing this is theaters.",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the most boring and nonsense movies I've ever seen. Avoid it like leprosy.",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Doh ..it got zero stars...from rotten tomatoes...",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw the advanced screening yesterday. I can safely say it was horrible. Not scary at all. Acting by the lead female was the worst. As for the story it predictable around every corner and rather boring. This is a sad entry into a franchise that should have stopped at the first movie. Stop trying to make PG-13 horror flicks. 3/10",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THIS MOVIE COULD HAVE BEEN GOOD.\nBut no. They decided to shit on top of the cake with this shitastic attempt to make a sequel loaded with every cliched horror masterpiece you could imagine. Let alone, just the CGI itself for this movie..",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "dis is the bes movie ive seen al year and it is better than goodbye man \ndef recommende",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well I liked the first two movies much better. This movie was a little slow and I don't understand the main storyline with the biological mother. Just seemed like they needed a storyline and just threw one in there. It also talked about the main story/video tape but was just a different twist to the story. The ending was good but predictable. Like I said, I liked the first two better. If you liked the first two you'll like the third one. It's a decent horror movie.",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A smart horror film so scary",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story was spot on and rather unpredictable! Just what the doctor ordered, acting was somewhat dodgy but only in very few spots, but a great reboot, Samara says, Cash me outside, how bout dat...",
            "review_date": "2017-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, really Ignites the flames and makes you want to watch more of this great story unfold.",
            "review_date": "2017-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie really did suck. I remember the first one scared the hell out of me as a child , but I will not have any problem sleeping after this crap. The acting was probably the biggest thing wrong with this , but overall it's a stereotypical dumb white girl that wants to go investigating type of movie. So much potential waged.",
            "review_date": "2017-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible acting and terrible plot. What I expected.",
            "review_date": "2017-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the dullest, aimless, try hard, PG-13 horror movies in a while. \nGrade: D-",
            "review_date": "2017-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first one made me afraid to sleep alone. The second one made me feel like I wasted my money. This one tries to revive the franchise by deepening the back story, but it doesn't make sense, and it's not compelling. It's not scary and has the depth of a made for tv movie.",
            "review_date": "2017-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It seemed like they were trying to copy Don't Breathe at one point... only thing missing was the turkey baster. Not worth it to see in theaters.",
            "review_date": "2017-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed the movie. Few things I have questions about. But overall good flick. The twist is too easy to figure out.",
            "review_date": "2017-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing film to top the other Rings films",
            "review_date": "2017-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not scary at all!! Should not be listed as horror. Very disappointed",
            "review_date": "2017-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Basically took the same formula from The Ring, but unlike that movie, this one is terrible. Any surprise they tried to throw at you was predictable. Some bad acting, not scary and it was just plain boring. We're in February and I'm sure this will be on my worst of 2017 list in December.",
            "review_date": "2017-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "should a let me make this movie!   how can you revamp a movie where the craziest best part of the franchise was a girl whose twisted movements freaked the audience out and not even show it in the new one... for shame!!!!!!!!!",
            "review_date": "2017-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "haven't even seen it, just know it will be atrocious... acting looks terrible and the films meant to be about a VHS not a clip you see on the internet",
            "review_date": "2017-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lot of people are gonna hate it...I don't care. For me its perfect. Happy for this new prequel to the Samara Universe!! Samara strikes back. This time viral.",
            "review_date": "2017-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really boring and mediocre movie, especially for a \"Ring\" movie.",
            "review_date": "2017-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Please don't waste your money,this movie was absolutely horrible.I really liked the first two movies but this one was so slow and unoriginal that I didnt care if any of the main characters lived or died and when the blind guy was  introduced I just started laughing at the silliness of the whole plot.I wish i could get my $14 back it was that bad.",
            "review_date": "2017-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This felt like the sequel to the viral marketing of the The Ring 2. There were moments that I liked but those were far and few between. This movie was supposed to come out in October and it was going to go up against Don't Breathe. Rings last 20 minutes and Don't Breathe have so much in common, that it had to be factor in why they pushed it to January.  I think teenagers will like this. Fans of the Ring movies... not so much.",
            "review_date": "2017-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rings is the 3rd one of the series and it is an unnecessary sequel even if it is a bit better than 2nd. Some tentatives to scare you but they are obvious a mile away. The story is the same and basically predictable till the end. Good for a few laughs but i won't come back for the 4th if there is one.",
            "review_date": "2017-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was looking forward to this movie and had high hopes, but it was disappointing. There was barely any of Samara or the tape in this and the storyline was nothing like the first two movies.",
            "review_date": "2017-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best horror movie I have seen in a while. probably one of the greatest cinematic twists I have ever witnessed. Definitely recommend seeing and I cannot wait to purchase on Blu Ray!!!",
            "review_date": "2017-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was not a horror movie. It was more of a predictable mystery movie. It seems like they made the movie with the plot figured out, wanted to add the scary parts after the initial filming, and then gave up before adding the scary parts.",
            "review_date": "2017-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Did I watch the same movie as everyone else? Because that wasn't very bad at all! Just give it a chance. While it may be ClichÃ¨d and whatever, but the story doesn't fail to keep you interested.",
            "review_date": "2017-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite possibly the worst movie I've ever seen in theatre. Terrible acting. Poor script. Not one single scary moment. Such a waste of time. Why Leonard from BBT would associate himself with this crap is beyond me.",
            "review_date": "2017-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Iam a huge fan of the ring one and two and i didnt expect at all to be a third one after all this time but now that i know iam so excited to watch it people who say its bad can suck my ass",
            "review_date": "2017-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rings may delve deeper into the mythology, however it ruins that mythology by horrible acting, a familiar story, and no scares what so ever.",
            "review_date": "2017-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If I could give this no stars I would, this movie was shit, it wasn't scary, it's not worth your money, it didn't deserve to be made, I hope this director never touches a film again. It was utter shit.",
            "review_date": "2017-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watchable \nWe all knew she was evil like d'oh lol guess they didn't watch the ring or ring 2 \nNeed to watch ringu again ??\nGlad I watched it. \nOnce ??",
            "review_date": "2017-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eat the tip of my penis.",
            "review_date": "2017-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was all over the place and had no idea what it was trying to achieve. No where in the movie was there even a scare to redeem the film. A disappointing and laughable reboot or sequel or whatever you want to call it. What a waste of talents like Galecki and D'Onofrio. Disposable horror d\nfodder at best.",
            "review_date": "2017-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed this movie. even though it was the least scary movie I've seen, the story definitely made up for it.",
            "review_date": "2017-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great until a \"video in a video\" groan-worthy scene comes along, then the whole movie landslides into Hollywood genre-ruining garbage with unnecessary subplots and back stories that are wholly unnecessary",
            "review_date": "2017-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rings has some good ideas, but doesn't succeed in its execution of these ideas. The acting is pretty inconsistent. Some of it is fine, and some of it is terrible. The film isn't really a horror film. It's more of a mystery. I liked that it wasn't just another generic horror film. But it doesn't know how to develop a good mystery. The film is mostly exposition. Everything we need to know is just given to us. I really didn't like that. The film has some interesting moments, but doesn't have anything amazing. The script also has some terrible dialogue. It is pretty funny some of the lines that are said. Overall, as much as the film tries not to be a generic horror film, it still falls into that category. Poor acting, a terrible script, and bad plot development makes this film one to miss. Unless you're obsessed with the Ring franchise, there is no reason to see this.",
            "review_date": "2017-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was okay...it had a few jump scares.",
            "review_date": "2017-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Let me start off by saying I have always hailed The Ring as one of my favorite horror films of all time. I haven't made a single Best Horror Films list in which The Ring hasn't been in my top 5. I adore it. I even enjoyed its ridiculously outlandish sequel, because come on, Naomi Watts SOLD THOSE FILMS. That being said, RINGS is a massive slap in the face to the franchise. What a complete and utter joke. From its god-awful opening segment to its cringe-worthy final shot, RINGS is a mess from beginning to end. It plays out like b-horror, and a low-budget less-than-mediocre one at that. I honestly cannot fathom how the special effects/CGI and make-up in this film are incredibly worse than the original film from 14 years ago (in which they were truly terrifying). I'm struggling finding a single thing I enjoyed about this film. The leads were atrociously bland, the plot points were borrowed entirely from the original and executed in an awful manner, and it completely butchered the mythology of The Ring without explanation. I suppose it was mildly pleasant hearing the same score from the original, along with the same iconic videotape and clips of Samara Morgan as a child. Still, RINGS brought nothing worthwhile to the table. Filled with continuously unnecessary jump-scares while building no suspense or atmosphere, RINGS is a disgrace of a film and without a doubt one of the worst excuses for horror I have ever seen.",
            "review_date": "2017-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed this movie not so scary but kept my interest!!",
            "review_date": "2017-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rings may offer passionate fans of the original a few flashes of pretty scenery and some wrinkles to the familiar narrative, but neither are enough to make up for the lack of scares or chemistry between its attractive leads, adding up to a muddled sequel that subverts the previous films' mythos without adding anything compelling in its place.",
            "review_date": "2017-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie was boring. It wasnt scary like the others Rings movies. The only part that was good was the end right before it went off. And the girl was annoying with her breathing so hard. Wasnt what I expected it to be.",
            "review_date": "2017-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Made me nostalgic for the first two. The writing/acting was just so bad.",
            "review_date": "2017-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good remake but more of a mystery movie then scary movie. Still all good.",
            "review_date": "2017-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's could have been better with the back story",
            "review_date": "2017-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Describing Rings in a couple of words without having the entire whole review to be overflowed by words of wisdom would be hell for me. Not only it tries too hard at baiting people, but it just hits the \"Make Stereotypical Sequel\" button and lands on the \"Release Movie Early\" mark. Seriously, movies like these are so terrible that it makes me want to go do a speedrun of the original Sonic the Hedgehog games where I manage to collect every ring without getting hit. In fact, since I said that, it makes me wonder why he isn't in these movies. We could easily forget about these dumb horror movies if that ever happened which is completely doubtful.",
            "review_date": "2017-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "might be good. But looks like it might be at risk of trying to hard to double down the original cinematic elements and completely over shooting it's mark. \n\nlike the ring girl is now launching some kind of mass assault on an airplane and that's suppose to be scary?",
            "review_date": "2017-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am in utter shock at how horrible this movie turned out to be. Where in the hell do I begin with this one? The acting was terrible pretty much all around, the plot went all over the place, and the movie was a mess of a travesty. Don't even bother with this one.",
            "review_date": "2017-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't watch this or I die",
            "review_date": "2017-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very weak ending, slow and long winded. The ghost is not even scary anymore. characters were dumb and unrealistic. not scary. hope they don't make any more.",
            "review_date": "2017-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Favorite scary movie of all time!! Can not wait to see this!!!!",
            "review_date": "2017-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "first one ok ,second one WTF ,third one kill yourself",
            "review_date": "2017-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The ending was the only good part of the film. It was boring and held zero original elements",
            "review_date": "2017-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first one but much better than The Ring 2. Enjoyable and watchable film. Easily a 7/10.",
            "review_date": "2017-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't go by my rating, I looked away during most of the movie.  I enjoyed learning more about storyline.",
            "review_date": "2017-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Went to an early showing. The story was decent, had enough to keep you interested but not enough to keep you on the edge of your seat, I know that this series isn't technically a horror series, more suspense and mystery with a creepy feel to it. I didn't find this creepy at all. It was more just of a mystery to me, which wasn't bad a thing. I just wish they would have executed the plot a little more. I feel that for a 2 hour movie, nothing substantial really happened. I will say the one thing that kept me intrigued was the acting, the main leads were good and the support cast in my opinion was great. Vincent nailed his roll and Johnny Gallecki played his role great and was my favorite character due to this.",
            "review_date": "2016-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Some old videotapes should've been better off left on the shelf\"\nMovie Review: Rings\nDate Viewed: February 9 2017\nDirected By F. Javier Gutierrez\nScreenplay By David Loucka, Jacob Aaron Estes and Akiva Goldsman, Story By David Loucka and Jacob Aaron Estes, Based on the 1998 horror film \"Ring\" from Hideo Nakata\nStarring: Matilda Lutz, Alex Roe, Johnny Galecki, Vincent D'Onofrio, Bonnie Morgan, Aimee Teegarden, Chuck David Willis, Patrick R. Walker, Zachary Roerig, Laura Wiggins, Lizzie Brochere, Karen Cessay, Dave Blamy, Michael E. Sanders, Randall Taylor, Drew Grey, Kayli Carter, Jill Jane Clements, Ricky Muse and Jeremy Harrison.\n\nThis movie never crosses the fiery circus ring at all. \"Rings\" is a wholly unnecessary follow-up to the 2002 hit horror film \"The Ring\". The first movie and the original 1998 Japanese film both centered around a cursed videotape that kills people in seven days after they've watched the tape. Director Gore Verbinski and Naomi Watts are nowhere to be found in this new movie but hey! we got Vincent D'Onofrio and Dr. Leonard Hofstadter from \"The Big Bang Theory\"! May I demand a refund?\n\n\"Rings\" is not only a half-assed sequel with slick production values and without any members from the original cast or crew, it also has one major problem. How can the cursed videotape kill people when nobody is using VHS anymore? Wait a minute? Now the cursed tape kills people by simply transferring into the digital age? \"Rings\" doesn't explore that aspect at all and it simply makes no sense whatsoever. The tagline for the poster says, \"First You Watch It, Then You Die\". How about if you don't watch this movie because it feels like the son of an old tape to the son of an old tape to another son of an old tape and.... you get the idea.\n\nThis sequel or reboot or whatever you call it follows a bad dude named Holt (Alex Roe) who's about to head off for college leaving his beautiful girlfriend, Julia (Matilda Lutz) behind. She starts to grow concerned for Holt after she loses contact with him. Suddenly in her computer blog, she sees a panicked girl who asks about Holt's whereabouts and then the screen turns blank.\n\nGetting increasingly worried, Julia travels to Holt's college campus where she encounters a professor named Gabriel Brown (Johnny Galecki). She follows him to a private area of the college where a cult group known as \"The Sevens\" are involved in an experiment that involves the same cursed videotape from the first two American \"Ring\" movies.\n\nThen Julia sees the same woman she saw on her computer and she takes her into her room to watch the video. Julia locks herself in the bathroom and the woman who is named Skye (Aimee Teegarden) gets murdered by the lanky-haired young girl known as Samara Morgan (Bonnie Morgan). Eventually Julia does find Holt and she's not willing to let him go out of her sights again. When Julia moronically does watch the video, she gets a burnt mark on her hand and that means more bad news for her and Holt. Vincent D'Onofrio co-stars as a blind cemetery caretaker who may or may not have a connection to Samara and his talents are completely wasted here.\n\nSpanish director F. Javier Gutierrez has vacuum cleaned all the good scares from \"The Ring\" and he sucks out cheap jump-scares and horror movie cliches. The performances are awful, the plot is pure nonsense and the screenplay by David Loucka (Dream House and House at the End of the Street), Jacob Aaron Estes (Mean Creek and The Details) and Akiva Goldsman (A Beautiful Mind, A Time to Kill, The Da Vinci Code, Batman & Robin, Lost in Space, Winter's Tale) is more unstructured and convoluted than scary.\n\nThe 2002 original \"Ring\" may have been a huge hit but it led to more silly J-horror remakes like \"The Grudge\", \"Shutter\", \"One Missed Call\" and \"Mirrors\". Thankfully they all stopped and horror movies have gotten a lot better over the past few years thanks to \"The Conjuring\" movies, \"Don't Breathe\", \"The Babadook\", \"The Cabin in the Woods\" and so forth. Some old videotapes should've been better off left on the shelf and \"Rings\" is no exception.",
            "review_date": "2016-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it has its moment but overall dull and unnecessary",
            "review_date": "2016-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If I could give this 0 stars I would",
            "review_date": "2016-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worth a watch, however the flaws will make you not want to watch it again.  It was fun to watch in that they tried something new and somewhat creepier, however the story lacks, even while the investigation of Samara is intriguing at some points, it altogether fails as a film that had potential to be a little but better.",
            "review_date": "2016-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was a terrible movie, thats all I got to say about it",
            "review_date": "2016-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay the film wasn't that bad guys! idk why the critcis and other people are hating! The graphics look killer! The acting isn't too bad!",
            "review_date": "2016-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RINGS is a nice attempt to add more texture and background to the familiar franchise, but the story is too awkwardly constructed, the scares (while jump-inducing) aren't really that scary, and worst of all, the two leads simply lack any charisma--or real talent.",
            "review_date": "2016-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was really worth seeing",
            "review_date": "2016-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay,not as good as the first two.",
            "review_date": "2016-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why did they think this would be a good idea?!",
            "review_date": "2016-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Starts slowly and I was wondering if I was wasting my time.  The last twenty minutes are the best part of the movie.  Don't give up on this one.",
            "review_date": "2016-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Where the first Ring film is one of the best horror films ever made, Rings is one of the most boring and generic. It definitely isn't the worst horror film I've seen recently, that's still The Bye Bye Man, but it it's still upsetting that it felt like no one cared about making a genuine horror film.",
            "review_date": "2016-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "had a good premise but failed miserably.",
            "review_date": "2016-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rings is that unnecessary sequel that fails on capturing an engaging plot, scares, and barely delivers some decent performances. I have never found (2002) The Ring or The Ring Two scary or could not have figure out what was so shocking about a supernatural girl known as Samara coming out of the tv screen to kill her victims. I was hoping Rings would be able to improve on delivering some thrills and scares. Sadly, Rings is the worst out of the three. If your looking for something new than its clearly not this film which follows the redundant plot like the previous two films. \n\nThe film follows Julia (Matilda Lutz) after not hearing from her boyfriend Holt (Alex Roe) for a long period of time when he is away at college. She tries to find him and only discover that his biology professor Gabriel (Johnny Galecki) has found a VHS tape that after viewing. You have seven days before you die. Only Gabriel has several followers of a group that has discovered and viewed the video. They were able to figure out a solution on surviving this week of terror. Julia and Holt are trying to discover the origins of Samara and trying to set her free from this curse. \n\nSome new concepts like one of the professors Gabriel has an experiment study group that are focused on the video and figuring out solutions on how to survive the week. Especially, how technology has changed over the years. When the original movie focused on that VHS tape that kills. Now, it's a video that is streaming online or by a link sent to your email. Which can cause mayhem when many people receive a link from someone they know.  \n\nRings is a terrible supernatural horror film that is not any better than its predecessors. The plot is redundant in a formulaic concept. Julia learns about the deadly video, wants to learn and discover about Samara. And figure out a way to stop her from harming others. Its something we seen in the previous films. Except this time around, we see that disturbing video over and over again which becomes annoying. Rings was not as scary or thrilling. It was really boring, even though we learn a little bit more about Samara's disturbing past. It did not help make the movie any better. \n\nEveryone of the casts performance was dull and forgettable. Even Vincent D'Onofrio acting was cheesy. Director F. Javier Gutierrez tried to create that eerie atmosphere using flashing camera shots. But the previous films worked a lot better in that creepy tone. The plot twist was not as surprising; it was hard to be engaged to its tedious story. \"I want to see it through,\" as Julia tells Holt about trying to learn about Samara. This is definitely one of those horror films that it is not worth sitting to see it through. It was dull, lacked in scares and thrills, and a tired plot that does not work the third time around.",
            "review_date": "2016-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was good, I like how her father is brought into the mix but we could've done without.",
            "review_date": "2016-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"as my boy owen would say, trash.\"",
            "review_date": "2016-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a follower of the original Ring franchise it was nice to see new concepts brought into the universe, that built upon the original ring movie and brought in today's technology that \"The Ring Too\" failed to do.",
            "review_date": "2016-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The concept/ plot of the Ring movies never moved me.",
            "review_date": "2016-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you've seen the first movie, the original Ring, this entire thing is going to seem VERY familiar to you, in that it's almost exactly identical with very minor differences. It even ends in the exact same way.\n\nI also can't remark on this movie without talking about the acting. Every single person seems like they didn't want to be a part of this project, but were threatened to at gunpoint. The protagonist's performance is the most phoned-in by far, whose delivery lacked emotion in every line.\n\nA garbage reboot, not a sequel.",
            "review_date": "2016-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable reimagining of the series. Perhaps a little late in the making, but worth a watch.",
            "review_date": "2016-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible movie. Despite a few interesting concepts and some occasionally stylish visuals, this film is muddled down by convoluted plotting, bland exploration of mythology, reliance on formula from previous films, dumb decisions by its characters and no scares whatsoever, this is a disappointing return from a franchise whose previous installments were actually strong, especially the first.",
            "review_date": "2016-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very slow in the middle",
            "review_date": "2016-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5.5/10 \nThe movie for the most part wasn't scary, and although the nostalgia factor played a big part in my liking of the film. The movie had many problems from introducing a new mythology that didn't work completely, and Samara was absent for most of the film. \n~February 4, 2017~",
            "review_date": "2016-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Adds more to the story but very similar to the first two.",
            "review_date": "2016-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Being a huge fan of the first film, this brings just a few new things to the series but not good enough to keep it going...so sad!",
            "review_date": "2016-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't trust the ratings. It is exciting, action packed, and a horror movie for the ages.",
            "review_date": "2016-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I Want To See This Movie",
            "review_date": "2016-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I relatively liked The Ring and The Ring 2 so I was excited for Rings\nFrom the start of the film they forget what Samara can do and changes the original lore.\nThe story starts promising but Is held back by poor cgi and some pretty bad acting.\nBut the filmography is sometimes creative but didn't always keep my attention. \nI wouldn't recommend this film. It's a boring and convoluted movie with questionable choices",
            "review_date": "2016-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i really a, looking forward to this dying to see it tho",
            "review_date": "2016-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It wasn't as scary as the Original",
            "review_date": "2016-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is trash! Don't bother! A paper thin plot filled with holes and unexplained events! How does the main character explain the background without ever hearing of the video tape and history before?! Spoiler alert: you will be left confused and annoyed!",
            "review_date": "2016-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Neither improving nor ruining the franchise, got interesting ideas which would be nice to be improved on in possible future films but the story line was overly predicable. But yet still watching able. \n\nTo put into prospective - The Ring Two = Rings",
            "review_date": "2016-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't remember much from the ring 2 but I do remember it being a franchise killer, that was until watching this film last night. I'm a fan of the original and enjoyed the mythology and twists but this is an uninspired mess. The film just doesn't make one little bit of sense and the ending is horrendous, this is the franchise killer and one of the worst studio horror films to come out for sometime. The mythology has become an utter mess, that first scene involving the plane betrays the series in a giant way, how is she broadcasting to everyone? The original mythology involved people coping the video to avoid the curse, this attempts to steer the series a new direction but fails miserably. I want a sequel to the first two films and to avoid this film, the ending is paving the way for the next film but it won't come and rightfully so. A mess from start to finish and what could've been a redirection with the material becomes a franchise killer. 01-07-2017.",
            "review_date": "2016-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not bad, but more of the same... and it should be the start of a new line of Ring movies.",
            "review_date": "2016-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I actually thought this movie was pretty good. I have seen all the Rings and I thought it was in the same category as all the rest. You would think it would be super cheesy but it really wasn't all that bad... it could have been worst. I was honestly scared thought the movie. This is coming from someone that loves horror movies! If you liked the other Ring movies, then you should definitely watch this one! I would recommend it.",
            "review_date": "2016-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Started out with some promise, scary, lots of questions and connections to the original but taking it to a new level. However after about 25mins the film lost its way, became out of control and narrative messy and also didn't make sense. Studio bosses should preview films and order reshoots if s film doesn't make sense or doesn't do what it promises on the box",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Total waste of time.",
            "review_date": "2016-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not bad. Not scary, either.",
            "review_date": "2016-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was ok! I liked the fact that they went and showed samaras past like her mother Evelyn. Not as good as the originals but a good ad on.",
            "review_date": "2015-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Runny bab! Don't even bother.",
            "review_date": "2015-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After The Ring I had the heebie jeebies in my own house. This film ain't doig it.",
            "review_date": "2015-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a real shame that this wasn't up there with the horror movies released over recent years. Sure, it's not terrible. That said, it has no depth, the characters aren't really likeable except Johnny Galeki (and that might just be because I love Leonard).  The ending has no real surprise either and you can see it coming. It's saving grace for me is the updated video tape, pretty cool to see new scenes being added.",
            "review_date": "2015-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why this movie exists ?",
            "review_date": "2015-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic and yet well it's finally over and well hate to say it but ok I won't spoil it!! Must see!!!!",
            "review_date": "2015-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eh, wasn't terrible. If you're a fan of the Ring franchise or a horror film buff, check it out but don't set your hopes too high.",
            "review_date": "2015-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better Than The 2nd One Imo But Still Not As Good As First One!",
            "review_date": "2015-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent acting, some good scares, strong story, just not scary or terrifying like the original.",
            "review_date": "2015-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched a screener of this movie. It's a lot better than what the critics are saying",
            "review_date": "2015-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rings (2017) Review\n\nThe Good \nThe actors aren't terrible Surprise lol\n\nYou are kinda interested in the Story.....\n\nThe Bad\n...... Kinda bored by the story\n\nThe Opening plane scene is terrible and makes no damn sense like OK Samara is trying to kill 2 people in a plane then kill them WHY?????? KILL THE REST OF THE PEOPLE IN THE PLANE \n1. They didn't watch the Tape\n2. If they did watch the tape why wouldn't they get 7 Days ???? Just little thing like that make no damn sense\n\nThe Visuals of Samara  look terrible while the 2002 American original looks 100x better than 2017\n\nThe first on screen kill Girl was pretty bad \n\nThey gave Samara a new Origin.......... Ugh\n\nThe Ending is so Retarded\n\nOverall: Even with it being boring I was still OK with this movie then the ending killed it\n\nOverall Grade: D-",
            "review_date": "2015-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Almost unwatchable. How can they ruin a potentially good franchise like this. Buried forever now",
            "review_date": "2014-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alright. Can't compare to the japan films that started the ring.it was... Okay",
            "review_date": "2014-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seeing Samara come out of the tv again was a fun throwback but everything besides that was terrible.",
            "review_date": "2012-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slightly better than the last sequel but overall a disappointing film ",
            "review_date": "2012-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I donno whats wrong with reviewers... No, Rings3 isint the movie of the year. But damn the story worth to watch",
            "review_date": "2012-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this film can't fucking wait for the third one to come, I want to know when it will be released !!!",
            "review_date": "2010-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They never really did it for me x",
            "review_date": "2010-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "never been a fan of the ring to begin with. A stupid sequel with extremley laughable effects. Leave the original asian masterpieces alone, Hollywood.",
            "review_date": "2009-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i can't wait to be done with this movie, then months later find out there is gonna be yet another sequal to \"the ring\" series; \"the ring 4\" sponsored by Audi. :-|",
            "review_date": "2009-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This sounds so cool!! I am going to see it",
            "review_date": "2009-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "samara is coming back!!!!!!!!!!!!!!!!!!!!!!!dont watch that tape",
            "review_date": "2009-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Did we really need another Rings movie?  Probably not.  The opening scene in this one got my attention but after that it just seemed like I was watching the same Ring movie over again.  Does live up better then all the horrible reviews it got.",
            "review_date": "2009-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What the hell?! How did I not know about this?! Loved the first (original & remake), hated the second (American), pretty curious to see the third.",
            "review_date": "2009-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "be ready to get thrilled.:))",
            "review_date": "2009-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "im excited ive watch all its series...",
            "review_date": "2009-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the best horror movie to go see theres always a scene that makes u freak out.",
            "review_date": "2009-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow this movie was absolutely terrible. There's gonna be very little to say in the positive realm here, but here we go. A somewhat sequel to The Ring (2002) & The Ring Two (2005) this film follows a young lady named Julia (Matilda Lutz) who is concerned after her boyfriend Holt (Alex Roe) doesn't respond to her after going away to college. End of the movie....I wish. Anyways Julia goes after Holt who mysteriously has joined up in a research group ran by his professor Gabriel (Johnny Galecki). The group watched The Ring video which in their case forces them to share the video to someone else who hasn't seen it, or they die in 7 days. Julia watched the video of course, but a different version plays for her leading to Holt and her researching more about the girl in the video Samara (Bonnie Morgan) it eventually leads them to a town called Sacrament Valley (yup swear to God) where they uncover more secrets of Samara's past. The film comes to us 12 years after the last movie and man it just should not have come out. It isn't scary at all and the whole concept is extremely dated regardless of changing the video type to a \"viral video\" now. Samara just doesn't compete with the real scares of the world I guess. Also none of the characters are likeable. The only person I even remotely enjoyed was an old crazy dude named Burke played by Vincent D'Onofrio. The film has some cringe worthy dialogue as well and even with 20 minutes left of the film I felt like there was absolutely no plot that moved any kind of action. The film has a slight \"twist\" at the end, but it doesn't matter because the movies terrible. Avoid this one and just rewatch the original remake from 2005 again if you want a good horror film.",
            "review_date": "2009-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WTF a third one coo.",
            "review_date": "2009-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "r u serious I thought the girl died and was gone forever the ring 2 sucked even more I can't even imagine what's it's gonna be like that's like making the Grudge 4",
            "review_date": "2009-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "is it straight to DVD?",
            "review_date": "2009-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "your kidding me... i want to ridicule this so bad... but i got hope. it better be good like it started out in the first place.",
            "review_date": "2009-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "omG!!!!!!! I've gotta see this!!!! I mean I'm already scared by the poster!!!!!!",
            "review_date": "2009-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": ":D heck yes,I need to see this.",
            "review_date": "2009-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the same actors so I think it's gonna have something off! But we'll see what happens! Kinda wanna see it!",
            "review_date": "2009-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love these movies!!!",
            "review_date": "2009-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "why other ring it's just a tap",
            "review_date": "2009-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "yes, the final conclusion!!!!",
            "review_date": "2009-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As is the trend of late, a sequel that completely diminishes the quality of it's predecessors.  Rings is not all bad, but you absolutely have to look at it apart from the Ring franchise and think of it as its own, non-Rings entity.  As part of the (American) trilogy, it's terrible; it takes away all that the incredible first installment set in motion, and is lesser than even the just decent second installment; it completely changes the story (to something too technologically updated [spoiler-ish], The Samara Project?  Really?  That's where you take it?).  Now, besides this update, you actually do get a good enough story.  Similar in following the clues to decipher Samara's code as in the first Ring films, you get some additional tidbits into the story (Samara's family and townfolk).  These were actually good scenes that THANKFULLY stray from the [spoiler again] Samara Project hogwash.  Oh, and no more than three minutes into the movie, you (or at least I did) see editing discrepancies.  The man did not tell the girl that his phone call simply uttered \"7 Days.\"  He said something to the effect that his phone call said he will die in 7 days.  And when she tells her friend about the strange man, she says that he said his phone caller said, in Ring-fashion and Samara voice, \"7 Days.\"  Sorry, nitpicking, but it was already off to a bad start.  Kudos, though, to Vincent D' Onofrio, who turns in a terrific performance.",
            "review_date": "2009-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i dont see the point of having another movie for the ring.. it ended with the second one.. and didnt have any sign of a 3rd to come..the japanese 'the ring' was so much better.. so i wonder if they just gunna keep making them like the japanese one did..  but ill see it anyways..",
            "review_date": "2009-01-10",
            "source": "rt",
            "lang": "en"
        }
    ]
}