{
    "rating": 2.2,
    "release_date": "2017-01-13",
    "num_reviews": 407,
    "genres": [
        "Horror",
        "Mystery&thriller"
    ],
    "summary": "People commit unthinkable acts every day. Time and again, we grapple to understand what drives a person to do such terrible things. But what if all of the questions we're asking are wrong? What if the cause of all evil is not a matter of what, but who? When three college friends stumble upon the horrific origins of the Bye Bye Man, they discover that there is only one way to avoid his curse: don't think it, don't say it. But once the Bye Bye Man gets inside your head, he takes control.",
    "reviews": [
        {
            "content": "You can get my thoughts on this flick on my podcast! The episode we did for this movie is located at https://open.spotify.com/episode/4P4t0izBW14yxGKkOu58nn?si=8e9a6b83aa3c4d05",
            "review_date": "2023-04-12",
            "source": "rt"
        },
        {
            "content": "Predictable, illogical, and inaccurate. It can't get much more corny without becoming a parody.",
            "review_date": "2023-03-20",
            "source": "rt"
        },
        {
            "content": "Stupid but great, bad cgi but actually scary",
            "review_date": "2023-03-05",
            "source": "rt"
        },
        {
            "content": "It's very much a format movie - guy accidently summons a homocidal demon, demon tries to kill everyone who says his name, people act stupidly, etc. It has many hater reviews but it's really just a typical movie of this sort. Like most of them, the expected tropes appear, the typical plot unfolds, and the ending...(no spoilers, but it wouldn't make any difference). In short, it's a good old horror movie, not nearly as bad as a lot of people seem to think.",
            "review_date": "2023-01-31",
            "source": "rt"
        },
        {
            "content": "the bye bye man is a cinematic classic above the likes of shrek 2",
            "review_date": "2023-01-02",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man ist ein Horrorfilm von Stacy Title inszeniert und von Jonathan Penner geschrieben. „The Bye Bye Man\" mischt unbeholfen Grundelemente aus verschiedenen Horrorfilmen zusammen. Der Film ist in Grunde, in Ordnung. Nicht außerordentlich, aber nicht grauenvoll. Er ist Durchschnitt, er Unterhält, aber weiter nichts.",
            "review_date": "2022-10-31",
            "source": "rt"
        },
        {
            "content": "It's a middling supernatural horror in the spirit of tame teen-targeted fare like Final Destination or Jeepers Creepers.  It's certainly not great but also not as bad as the brutal critical reviews suggest.  It's probably gotten more scorn than it deserves because of the unbelievably silly name of the titular antagonist: The Bye Bye Man. Would it be scarier if he was called The Adios Amigo or The Later Alligator?  Probably.",
            "review_date": "2022-05-27",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man has an amazing concept it is a malevolent spirit that can be summoned simply by speaking his name only once, when that happens, it gets into your mind and causes its victims to see things that aren't really there as a way of driving them to madness and murder. The Bye Bye Man clumsily mashes together elements from better horror films, adding up to a derivative effort as short on originality as it is on narrative coherency or satisfying scares.",
            "review_date": "2022-05-13",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man isn’t as awful as it’s reputation says. It is however lacking in a few areas. Unfortunately there are a few sequences that trigger a chuckle when it should have been tense. And I wish we knew more about this mysterious figure. But he’s often left unexplored. Not the worst watch out there, but you can definitely do better",
            "review_date": "2022-05-07",
            "source": "rt"
        },
        {
            "content": "Come on people it wasn't THAT bad. I've definitely seen worse horror movies. My biggest issue was that Bye Bye Man literally looks EXACTLY like Emperor Palpatine from Star Wars. I'm surprised they didn't get sued for this (well maybe they did, I haven't researched that). Other than that, it's pretty standard supernatural horror, but has decent moments and is watchable.",
            "review_date": "2022-04-08",
            "source": "rt"
        },
        {
            "content": "I honestly really enjoyed it. I think we were spoiled with so many movies back then, years later, it actually holds up to the current terrible ones 2018-2022 timeframe as average. I rated a star above just to compensate for the bad reviews haha ",
            "review_date": "2022-03-11",
            "source": "rt"
        },
        {
            "content": "Sometimes the pace is a little slow, but on the whole this movie is not bad at all. I do not really understand all the bad reviews...",
            "review_date": "2022-01-05",
            "source": "rt"
        },
        {
            "content": "Se si ripensa all'incredibile quantità di clichè del genere, fa strano pensare come nel complesso, questo horror non sia nemmeno così malvagio.\nNonostante la classica casa infestata con un passato di orrore, la seduta spiritica, le visioni che portano alla follia ed una strana somiglianza con Candyman; la quasi totale assenza di jumpscare, mette in risalto un discreto stato di ansia che viene percepito.\nPurtroppo viene spiegato davvero troppo poco delle radici del male e di conseguenza tutto lo svolgimento ne risente; lasciando adito ad un finale parecchio scontato vista l'assenza di idee per sconfiggere il villain.",
            "review_date": "2021-11-27",
            "source": "rt"
        },
        {
            "content": "I saw this movie. I was told that it was scary... Then I had watched it and I completely hated it. It was so terrible, I'd rather stick pins in my eyes than watch it ever.",
            "review_date": "2021-11-12",
            "source": "rt"
        },
        {
            "content": "If it was tryin to be a mockery of the stalker type horror it didn't work at all.",
            "review_date": "2021-09-29",
            "source": "rt"
        },
        {
            "content": "You'd have more fun looking at the \"Pee Pee Poo Poo Man\" parody posters than watching this movie.",
            "review_date": "2021-09-28",
            "source": "rt"
        },
        {
            "content": "This was a waste of time, I do not even have positive points to talk about it, the acting is not engaging, the screenplay does not achieve any good plot twists and relying in jump scares only is not a great strategy for a horror movie...",
            "review_date": "2021-09-23",
            "source": "rt"
        },
        {
            "content": "Love these types of movies. Great horror. I'm confused on why the reviews are rated so low. This is definitely not rotton.",
            "review_date": "2021-05-25",
            "source": "rt"
        },
        {
            "content": "The only reason I'm giving it a full 1 star is because how much it made me laugh.",
            "review_date": "2021-02-21",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man comes off as a poor-man's antithesis to The Ring. Stop me if this sounds familiar, but a supernatural murderer with extraordinary powers and a sneaky subtle way of getting to you places the \"trigger\" for its curse in a very convenient location that then spreads like the flu and claims lives slowly after a few days of psychological torture, ending with people turning on each other and one person finding out The Truth On How To Win thanks to the previous victim knowing part of The Truth On How To Win, only for it to not matter and for them to lose anyways. No? That's totally unique? If you say so. The actors look uncomfortable throughout the film, and not just as their characters. This film also carries that whole psychological trick where after you're done watching it you think, \"Oh man.. what if this happens to me?,\" and it succeeded in that department, which is the only reason it gets 1/5 instead of 0.5/5. The Bye Bye Man features a scathingly childish name which it could have turned into some creepy child-spread curse, but didn't because then it'd be too close to The Ring (as if it wasn't already). The development for the supernatural killer is nonexistent, we learn nothing about him, he's just The Guy That's There. The cliches are all here, too. Protagonist finds a creepy piece of paper that says spastically \"Don't think it don't say it\", then reads the name, and what does he do? Well of course, he runs off and tells as many people as he possibly can, even after his damn ghost-parents tell him not to. Ultimately the movie ends with stupidity. A librarian found run over, holding a bloody knife, and her kids have stab wounds? Clearly it was the guy that HIT her, not her, and is the girlfriend holding a pair of bloody scissors tightly in her hand? Well, woah, that's gotta be the main protagonist's fault that his best friend has scissor wounds, too. This movie follows no logical progression, and will leave you frustrated.",
            "review_date": "2021-02-21",
            "source": "rt"
        },
        {
            "content": "This movie is very underappreciated and underrated. Far from a perfect movie but it's entertaining throughout. Would like to see a sequel.",
            "review_date": "2021-01-12",
            "source": "rt"
        },
        {
            "content": "I wouldn't watch it again, but when I watched it, I remember it being a bit boring but besides that fact, it was somewhat interesting.",
            "review_date": "2020-12-14",
            "source": "rt"
        },
        {
            "content": "This was actually the worst film I've ever seen. The only redeeming qualities were pausing it on the death scenes, because they were comical. Peepee poopoo as a film shouldn't have been made - 1412\n\n / *Sharp Exhale* - MO",
            "review_date": "2020-12-05",
            "source": "rt"
        },
        {
            "content": "It was okay not that bad. At least better than the  slender man movie.",
            "review_date": "2020-11-22",
            "source": "rt"
        },
        {
            "content": "This film is trash but at least there is some laughs when it tries to be scary.",
            "review_date": "2020-10-16",
            "source": "rt"
        },
        {
            "content": "It may be that I'm assessing on a curve because it's January. But if you miss the slasher icons of old and have little patience for the reboot attempts they get periodically, it's nice to see at least a worthy attempt to add to that pantheon.",
            "review_date": "2020-09-11",
            "source": "rt"
        },
        {
            "content": "Quite frankly, The Bye Bye Man was a disgrace to the horror genre that simply offended the very core values of horror fans by even existing. The acting was horrendous, the premise was unexplained, and it teemed with the worst cliches of the old horror slashers that modern watchers would laugh at today. I would almost call this movie a comedy if the very production of the movie was not so terrible that I laughed at the existence of this low-budget, low-quality, pathetic excuse for a horror film. I cannot find the words to truly express why you should not waste your time watching this movie. With as many times as the movie said, \"Don't think it. Don't say it.\" I would recommend you follow their advice. Don't think about this movie, and don't speak about this movie. It's simply better that way.",
            "review_date": "2020-08-16",
            "source": "rt"
        },
        {
            "content": "It was boring & predictable... I'm annoyed that I watched the whole thing.",
            "review_date": "2020-07-20",
            "source": "rt"
        },
        {
            "content": "Slow plot, but somewhat interesting take on an average-type legend. A lot of the supernatural part went fairly unexplained and random. The ending was confusing and disappointing.",
            "review_date": "2020-07-02",
            "source": "rt"
        },
        {
            "content": "Something makes me think it could have gotten decent at one point. The house the main couple lived in looked good; that's the one point it gets, if anything.",
            "review_date": "2020-06-15",
            "source": "rt"
        },
        {
            "content": "Some nice ideas undermined by a lack of any real \"mythos\" to the main bad guy and his bad cgi dog....and one of the dumber names in horror history",
            "review_date": "2020-06-15",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man is a scary film. The concept of finding curse and it latches to you until you come up with a solution was definitely an interesting horror story. And the jump scares caught me off-guard while watching the whole film. However, it seems that its story is a combination one or two other horror Hollywood films that we have watched already. The story makes me think that it is possibly be inspired to other horror movies like Candyman (1992) and Nightmare on Elm Street (1984) because of its similarity or likelihood to those films. I wished the film elaborated more background about The Bye Bye Man and not just about a link to its past as show in the movie. The film mainly focuses on the jump scare tropes and horror tension of the film while it suffered a no solution ending which was hard for some viewers to swallow.    \n\nBut on a good note, some other parts of its story still has originality like the concept of The Bye Bye Man itself. And its story is kinda haunting like it lingers to you even after watching it. Another was the compelling performances of Douglas Smith as the lead character Elliot. The supporting characters also gave some stellar performances like Carrie-Ann Moss and Faye Dunaway.",
            "review_date": "2020-05-02",
            "source": "rt"
        },
        {
            "content": "If you are thinking about watching this movie, watch It Follows instead. If you already saw It Follows, then go ahead.",
            "review_date": "2020-04-29",
            "source": "rt"
        },
        {
            "content": "It is creepy but okay a little corny side. Lots of twist and turns. Lots of violence!",
            "review_date": "2020-04-12",
            "source": "rt"
        },
        {
            "content": "If I said/thought ‘the bye bye man,' and a hooded Doug Jones (not Dougie Jones) appeared to kill me, I'd laugh myself to death long before he got the chance.",
            "review_date": "2020-04-01",
            "source": "rt"
        },
        {
            "content": "It just was not good, seemed to be low effort and therefore reaped low reward.",
            "review_date": "2020-03-31",
            "source": "rt"
        },
        {
            "content": "Just a really bad movie... Horror movies are supposed to be scary, right?",
            "review_date": "2020-03-24",
            "source": "rt"
        },
        {
            "content": "Oof, indeed. For me there are *generally* 3 types of horror movie experiences: the first being \"LOL that was horrible but I kinda loved it\", the second being \"That was pretty well done but not really mindblowing\", the third being \"this is amazing and exactly what horror should be about\". This movie is none of those. It's not even funny bad. It's just boring bad. I've watched it twice now. Both times I could barely stay focused on what I was watching. I think the cheesy writing and dull plot would have gotten away with their shenanigans had the cinematography and atmosphere at least looked like they were trying to pull you in... but they don't.",
            "review_date": "2020-03-05",
            "source": "rt"
        },
        {
            "content": "This was just so dumb, I can't believe I wasted my time on this film.",
            "review_date": "2020-02-17",
            "source": "rt"
        },
        {
            "content": "Bye-bye to a cinematic masterpiece. Hello to a clumsy film.",
            "review_date": "2020-02-05",
            "source": "rt"
        },
        {
            "content": "Awful. Poorly done in every aspect. ",
            "review_date": "2020-01-21",
            "source": "rt"
        },
        {
            "content": "Don't say it. Don't think it. Don't watch it. This film is the result of throwing every cliche into a script and hoping something sticks.\nIt's one of the most generic horror films of the last decade. The performances are poor, the creepy villain missed the mark and everything else around it just feels cheap.\nIt's so bad it's almost funny... almost",
            "review_date": "2019-12-19",
            "source": "rt"
        },
        {
            "content": "It's a good horror movie.",
            "review_date": "2019-11-08",
            "source": "rt"
        },
        {
            "content": "A truly god awful flick",
            "review_date": "2019-11-07",
            "source": "rt"
        },
        {
            "content": "THIS GOD FORSAKEN MOVIE CAN PLEASE DELETE ITSELF FROM MY MEMORY. THERE ARE VERY FEW MOVIES I FEEL HAVE ACTUALLY SHORTENED MY LIFESPAN AND I TRULY BELIEVE THAT IF MAYBE I THINK IT AND SAY IT THE BYE BYE MAN CAN FINALLY KILL ME AND I CAN LIVE A PEACEFUL LIFE WITHOUT THIS ROTTING GARBAGE FIRE SOMEWHERE IN THE BACK OF MY MIND.\n\nEdit: ThAnKs for TwO LiKeS",
            "review_date": "2019-10-30",
            "source": "rt"
        },
        {
            "content": "Actually not bad. A couple of hokey scenes & wonky CGI but mostly a solid horror thriller with a Candyman premise.",
            "review_date": "2019-10-20",
            "source": "rt"
        },
        {
            "content": "Worst movie I ever seen I wish I could get the time back in my life, one of the biggest disappointments ever! The bye bye man is in it like once!",
            "review_date": "2019-10-12",
            "source": "rt"
        },
        {
            "content": "Direction: Stacy Title\nCast: Douglas Smith, Lucien Laviscount, Cressida Bonas, Doug Jones, Carrie-Anne Moss, Faye Dunaway, Jenna Knell\n\nThe Bye Bye Man is an interesting film. The film begins in 1969 as a man with a shotgun walks around his neighborhood and murders anyone who said 'the name' that should not be said. Fast forward to the present, college students Elliot (Douglas Smith), Sasha (Cressida Bonas) who is very tasty , and John (Lucien Laviscount) move into an off-campus house. After they discover the name The Bye Bye Man, things start to go bump in the night and they feel a presence around them. The more they think about the name, the stronger the presence grows. So, they start hallucinating. Those hallucinations lead to distrust, misunderstandings, and irrational fear. \nFirst and foremost, I really liked the concept. The hallucinations aren't particularly frightening, but I thought they played out well. They help create a sense of doubt in every scene. The film was also paced well, never dragging its feet. And fairly well acted.There is some suspense here. It's not a nail-biter, but it shows some effort. 7/10\n\n",
            "review_date": "2019-10-11",
            "source": "rt"
        },
        {
            "content": "A rotten piece of garbage. It made no sense, everything was stupid, and all the acting was awful. The only thing keeping me from giving this the lowest score possible is the fact that this is the only horror movie I saw with my mom that legitimately made her laugh uncontrollably in the theater.",
            "review_date": "2019-10-09",
            "source": "rt"
        },
        {
            "content": "An interesting idea, but this particular movie wasn't executed well enough to actually make it worth watching.",
            "review_date": "2019-10-05",
            "source": "rt"
        },
        {
            "content": "The first 3 minutes are fantastic. They hint at a terrifying story, they're masterfully shot and constructed. The next 5 minutes you want the unlikable, boring characters to die. The 10 minutes after that, YOU want to die, just to be done with it. ",
            "review_date": "2019-10-02",
            "source": "rt"
        },
        {
            "content": "This movie is clearly a suggested metaphor for anxiety and OCD. If you have it, you will understand. Can't get something out of your head and it consumes you.",
            "review_date": "2019-09-03",
            "source": "rt"
        },
        {
            "content": "This movie is a sin to humanity.",
            "review_date": "2019-08-15",
            "source": "rt"
        },
        {
            "content": "Good movie and it was confusing too",
            "review_date": "2019-07-19",
            "source": "rt"
        },
        {
            "content": "Ouch! This movie is painful to watch. Only reason I was at all interested to see this was for how awful folk said it was. If you like a horror film which doesn't rely on cheap scares; while sporting a competent script with unique story and concept then I'd suggest you keep far away from this movie. Just comes to show any hack can churn out a movie to rake in millions of dollars.\n \nOne of the worst horror films of all time... too bad to even watch ironically! Avoid at all costs!  ",
            "review_date": "2019-06-19",
            "source": "rt"
        },
        {
            "content": "This film is very very good! This film deals with a psychic theme, I consider it a psychological rather than a horror film, because it is not easy not to think of something that can hurt you and that you can find anywhere and anytime. And this film tackles this theme perfectly.",
            "review_date": "2019-05-25",
            "source": "rt"
        },
        {
            "content": "This dumpster fire of a movie is a great, unintentionally hilarious addition to your local Shitty Movie Matinee. It would make a fantastic double feature with \"Wish Upon\" or \"Slender Man.\" \"The Bye Bye Man\" isn't scary in any moments, doesn't seem to have any cohesive mythology or plot, doesn't contain a single decent or passable acting performance and is directed and edited with the finesse and intelligence of a four year-old sociopath version of Uwe Boll. It really is quite amazing how completely and thoroughly this movie fails. It does accomplish one thing, however. It makes it so Faye Dunaway will now have to specify that interviewers cannot bring up \"Mommie Dearest\" or this flaming sack of dog shit disguised as a movie.",
            "review_date": "2019-05-16",
            "source": "rt"
        },
        {
            "content": "Thankfully I watched this on Netflix. I've honestly never want to stop watching a horror movie.",
            "review_date": "2019-05-05",
            "source": "rt"
        },
        {
            "content": "Way too hated. A nice gateway horror with some creepy imagery. Nothing more. Nothing less. ",
            "review_date": "2019-04-22",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man is as bad and laughable as its title. Yes, it's a terrible movie, but I enjoyed it because of how bad it was. I laughed every time the character's died. I don't know why Carrie-Anne Moss was in this film. She's better than this. But there was one scene I genuinely liked because she was in it. The Bye Bye Man would've been the perfect bad movie if it was at least a little bit scary, with maybe one or two nail-bitingly scary scenes. Nope! The Bye Bye Man is just some dude with a hoodie and scars on his face. The CGI dog looks even worse. The scariest thing the Bye Bye Man did in the film was point. The jump scares were so cheap. The worst one was when he appeared in a window reflection. The first act was a bit slow, but I highly recommend The Bye Bye Man if you enjoy bad movies.",
            "review_date": "2019-04-18",
            "source": "rt"
        },
        {
            "content": "Decent movie if you're in the mood to watch something light and creepy. ",
            "review_date": "2019-04-14",
            "source": "rt"
        },
        {
            "content": "If you thought the movie would be pathetic with a title and name for the antagonist like \"The Bye Bye Man\", you were right.",
            "review_date": "2019-04-10",
            "source": "rt"
        },
        {
            "content": "If you worked on this movie, fuck you. With this \"movie\", you bent over and spit in the ass of anyone who ever worked in the horror genre. This fuck fest is a cumstain on the entirety of horror. A gorilla in china beating his dick while Halloween played on a box tv in Kansas could have come up with a better script than this alphabet soup vomit into a potrapotty at a metal concert. Piece of shit. 20% is too god damn high for you Hollywood scrotum sniffers.",
            "review_date": "2019-04-08",
            "source": "rt"
        },
        {
            "content": "A little bit of good acting and a mountain of missed opportunities.",
            "review_date": "2019-04-05",
            "source": "rt"
        },
        {
            "content": "Bye-bye man is yet another predictable by the book horror movie. Except there’s no scarces except for your predictable jump scares. Bad editing and acting can also be found. How they managed to get Faye Dunaway in this movie for about five minutes is a mystery to me. It’s just like every other horror film you’ve seen predictable jump scares, predictable kills, predictable ending. Let’s hope there’s not a sequel.",
            "review_date": "2019-03-03",
            "source": "rt"
        },
        {
            "content": "Bye-bye man is yet another predictable by the book horror movie. Except there’s no scarces except for your predictable jump scares. Bad editing and acting can also be found. How they managed to get Faye Dunaway in this movie for about five minutes is a mystery to me. It’s just like every other horror film you’ve seen predictable jump scares, predictable kills, predictable ending. Let’s hope there’s not a sequel.",
            "review_date": "2019-03-03",
            "source": "rt"
        },
        {
            "content": "Not as bad as you would think from all the hate its recieved in ratings. Psychologically the bye bye man plants illusions in the characters heads to make them go bat shit crazy and wreak havoc. And tragedy follows all who know his name. Its an interesting concept. Not terribly revealing or overly memorable but most horror fans would say its average and watchable. A couple jump scares got me and theres some cool creepy scenes . Not sure the purpose of the recurring train or gold coins as the villain had no backstory or development of his history.  The dog should have been left out of the movie. God awful digital animation of it.\n\nIf you like horrors just watch it. It kept me interested",
            "review_date": "2019-02-16",
            "source": "rt"
        },
        {
            "content": "The way the script is written is like 3 year olds typed it out. The female is the worst actor I have ever watched in my love.",
            "review_date": "2019-02-13",
            "source": "rt"
        },
        {
            "content": "The \"horror\" origin story of Darth Sidious and his pet dog named CGI",
            "review_date": "2019-01-18",
            "source": "rt"
        },
        {
            "content": "Awful writing, terrible plot hook! The bye bye man?! As if noone has said bye bye man and just before said the whilst in mid sentence. Its just a bad film don't watch it",
            "review_date": "2019-01-16",
            "source": "rt"
        },
        {
            "content": "This movie sucks so much donâ(TM)t watch it",
            "review_date": "2018-12-16",
            "source": "rt"
        },
        {
            "content": "It suuuuuuuuuuuuuucked",
            "review_date": "2018-11-11",
            "source": "rt"
        },
        {
            "content": "Movie is a waste of time, the jump scares were lame and \"The bye bye man\" was not a scary person to be feared at all, most of the movie was boring and unoriginal. My advice is don't watch this movie.",
            "review_date": "2018-11-11",
            "source": "rt"
        },
        {
            "content": "Enjoyed it in my own opinion. Surprised audiences didn't give it a high rating",
            "review_date": "2018-11-05",
            "source": "rt"
        },
        {
            "content": "This shit fest can go straight to HELL.",
            "review_date": "2018-10-21",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man is a clever movie, though the motto is cheesy it has good scares that left me a little bit scared.",
            "review_date": "2018-09-26",
            "source": "rt"
        },
        {
            "content": "Once upon a time movie directors had to at least try to put out a title that would drawl your attention hopeing when you walked down the horror aisel you might pick up that one instead of the next one. now these assholes dont even respect us enough to come up with a good title let alone enough to take the time to try and make a decent movie. This is seriously a big middle finger to horror fans. The bye bye man sounds like something a 5 yr old came up with and unfortunately thats about how the movie plays as well. This is pure american horror garbage at its best",
            "review_date": "2018-09-03",
            "source": "rt"
        },
        {
            "content": "A bland horror movie full of cliches",
            "review_date": "2018-08-10",
            "source": "rt"
        },
        {
            "content": "Old school, to a fault. The Bye Bye man wants to shock through old, pshycological means but doesn't have the brains or guts, literally, to follow through on it. Surprisingly bloodless, underwritten and overall just a bit limp. This is baby's first horror film at best.",
            "review_date": "2018-08-10",
            "source": "rt"
        },
        {
            "content": "a new contender for one of the worst movies of all time, just hilariously awful",
            "review_date": "2018-07-31",
            "source": "rt"
        },
        {
            "content": "The Awful acting, bad plot, god awful characters, crappy editing and directing, and dozens of more problems will leave a disgusting taste in your mouth by the 40 minute mark",
            "review_date": "2018-07-26",
            "source": "rt"
        },
        {
            "content": "it's a sad day when a spongebob episode is scarier than a horror movie",
            "review_date": "2018-07-25",
            "source": "rt"
        },
        {
            "content": "Not very scary, and has a bundle of random plot-lines added in just to make it look more interesting.",
            "review_date": "2018-07-05",
            "source": "rt"
        },
        {
            "content": "Look, not every movie can be a winner.  I get that and I understand it.  Unlike the philosophy some Americans would have you believe, there's nothing wrong with coming in second or third place.  There really isn't.  There isn't anything wrong with placing fourth either.  There is a problem, however, if you're 150 out of 200 competitors.  I mean, really, there's nothing wrong with that either, but there's nothing to be proud about either.  Having said that, in most cases, if you're a professional athlete, then that lack of success might motivate you to work harder so that, next time out, you place higher and higher and higher.  But, unfortunately, when applying this to horror movies, it just doesn't work.  Once a movie has been released for an audience's consumption, there is nothing that you can do.  I mean, technically speaking you can, with director's cut if, by any chance, the director wasn't satisfied with the cut that was released in theaters.  But, really, you only really get director's cuts with major movies.  I doubt The Bye Bye Man is gonna get a director's cut ever.  Nothing is impossible in this world, but I'd be willing to put money on that.  I don't know what, if anything, Stacy Title would have done with this movie.  For all we know, she's satisfied with the end result, thought I find that highly unlikely.  Also, she directed this movie based on a script written by her husband, so there's that.  That's really irrelevant.  But, let us move on, shall we?  As if it wasn't obvious to you by now, I did not think that this was a very good movie, like at all.  In fact, I'd have to say that this was very bad.  If I'm being honest, and I always am, I only really ended up watching this on a whim.  I was actually gonna watch Don't Knock Twice and when I searched for that movie on Amazon Prime, this one also came up.  Both were available to me as a result of my Showtime week-long free trial.  I saw this and I was like 'fuck it, I'll watch this'.  Simple as a that.  I really had no intentions of watching this (since the Edge of Seventeen is still on my watchlist and Cronenberg's Rabid, which I may watch tonight).  It was just something I decided to do on an impulse.  That impulse turned out to be dead wrong.  DEAD WRONG I SAY!  I will say that the movie starts out promisingly enough.  Larry, played by Leigh Whannell, in 1969, shoots and kills eight of his friends, all of whom knew about the existence of the Bye Bye Man, before killing himself.  He does this to contain the knowledge of the Bye Bye Man, who makes you see things that aren't there and, generally, drives you nuts, so no one else has to suffer through this.  If everyone who knows about the Bye Bye Man is dead, he can't continue to haunt them.  Anyway, this is information we get later on.  The point I'm trying to make is that I felt that the movie starting with Larry murdering all these people was the right way to start this off.  Of course, however, the PG-13 limitations put a bit of a damper on that since you can't really get a sense of how horrible these murders were.  These people were shot with this shotgun at, relatively, close range.  So the lack of blood was very inconsistent with wounds associated with shotguns.  That lack of authenticity really hurt the movie.  And it was laughable because, later on, you see more of Larry's murderous rampage and he shoots this teenage girl.  She's slammed into the wall and she falls to the floor.  Larry moves into the kitchen and you can see the wall the girl slammed into and there's, literally, the smallest blood splatter you will have ever seen.  It's absurd.  For fuck's sake, just take the R-rating and be more gruesome.  At least it'd give us SOMETHING.  Regardless, that's neither here nor there.  Moving on almost 40 years later, these three teens (Elliot, his girlfriend Sasha and his best friend John) move into this house.  I don't know if it's Larry's former house and, honestly, I don't really care.  Anyway, they use Larry's nightstand.  Elliot finds these coins in the nightstand and this writing.  The writing says: don't think it, don't say it and a name.  That name is, of course, Bye Bye Man.  Because, really, if you're not trying to say a name, the next logical step is to write it down so, even if you're not saying it, you're thinking about it since you're seeing it.  Great fucking logic there, my dude.  Whatever.  So this happens and then strange shit starts to happen to them and this psychic lady who was there when Elliot uttered its name.  Yawn, am I right?  First things first, this is a very derivative horror movie.  It's like Freddy Krueger and Candyman wrapped into one, except not nearly as good or clever as those films.  Secondly, the Bye Bye Man itself is, literally, one of the least scariest horror villains that I've ever seen.  I had to be redundant there with the 'least scariest', because that's how ineffective he actually is.  Like what is he even supposed to be, honestly?  He wears this pajama robe with the hoodie on.  And, underneath that, he's wearing clothes you would wear to sleep.  Like sweats and a regular shirt.  His face is disfigured.  There is that, but the fact that his face is covered up for most of the movie means that he's the least threatening horror villain I've seen in ages.   I mean the guy does have what seems to be a hellhound and that might be the only 'scary' thing about him.  The first scene the hound appears in is actually decent.  But once you get a more detailed look at him, the CG on the hound is laughably bad.  Speaking of that, there's this transition from one scene to another where they show the wallpaper from the hallway, I'm assuming.  The design of this wallpaper is of this deer and a doe.  So the head of the doe slowly transitions to that of the hound who turns to look at the camera.  Like, honestly, I don't know if this was intended to be this way, but this effect was so terrible.  It was honestly just dreadful.  If this was done in earnest, like who did the wife/husband duo think they were fooling.  This can't have been planned as a legitimate scare because it's so openly awful.  I mean, I'll be frank, it made me laugh.  But it made me laugh because of how someone though that this might be a good idea.  Oh no, the killer wallpaper.  I should be SO afraid.  Give me a fucking break.  There's also this scene later in the movie, where the hound walks toward the camera and this hound is massive, but the steps he takes are so small that it's a bit of a dissonance, seeing something so menacing take such dainty steps.  I suppose now we have to move on to Elliot, Sasha and John.  I mean, do we really have to?  I guess no review about this is complete without talking about these insufferable assholes.  With the villain making you see things that aren't there or not letting you see things that ARE there, this leads to the inevitable love triangle.  Or at least the villain manipulating Elliot's mind to see things that aren't there.  And, honestly, I couldn't have cared less about these people to invest in this bullshit story.  There's an incredibly awkwardly shot sex scene where John is giving it to Sasha doggy-style but the way the camera shoots them makes it look like they're not even in the same planet.  This movie is so fucking bad, honestly.  All of these are incredibly poorly-written characters.  There's nothing to any of them.  And Sasha, oh boy, it's time we talk about Sasha.  She sets feminism back about 1000 years.  She's completely fucking useless.  She's either looking concerned, sick, coughing, crying or sleeping.  Jesus, what a fucking weakling.  Not to mention that she contributes nothing of value to the narrative.  I mean, yea, she's the one that brings Kim (the psychic) to do a seance.  But, other than that, the only thing she does is just take up valuable time and space.  Well, really, maybe not valuable.  She might be the most useless female character I've seen since Bella Swan.  But, at the very least, as awful as those movies still are, Bella finally started fighting for herself and her weird, CG daughter.  Sasha is even more useless than a damsel in distress, if such a thing is possible.  Elliot and John are just unlikable assholes.  Carrie Anne Moss, inexplicably, is in this movie.  I imagine they cast her because they were probably planning for this to be so successful that they would get a sequel, so they needed to plant the seeds in this movie with her character to, possibly, continue on.  The very notion that this movie would get a sequel is laughable to me.  Also, Faye Dunaway is here.  She needs that machine from Eternal Sunshine so she can erase the memories of ever appearing in a movie so terrible.  The reality is that this, if handled correctly, could have been an exploration of mental health issues told through a horror lens.  Of course, the idea that this movie could tackle such heavy objects adeptly is, also, highly laughable.  The climax is...ok, but obviously not nearly enough to save this.  There's a, almost, a clever twist in that you think it's finally over, but Elliot's niece (who's name I can't remember and I don't care) was outside their house during the climax (with her father, Elliot's brother).  She was roaming around to pee or something.  After Elliot kills himself and they're riding home, the girl tells her dad about the writing in the nightstand.  He asks her what the writing said.  And she replied that she can't see in the dark.  Actually, we'll get to what she actually says in a bit.  So I was like, ok, that was pretty decent.  And this is where we'll end the movie, you think it's over, but it's not, but it is because the girl couldn't see in the dark.  Nope, they fucked themselves out of a conclusive ending, but it is what it is.  Time to get into what Elliot's niece actually said.  She said, and I quote, \"You know I can't read in the dark.  What do you think I am?  A flashlight?\" and she said this with a smirk on her face like she was so proud of herself for having coming up with such a zinger.  And never have I ever wanted to kick a child in the face as much as I did at that moment.  Other than that, it was such a CRINGE-WORTHY line.  I cringed so hard that I thought my face was permanently gonna be that way.  No woman would ever love me, for having such a hideous face.  It's not the only cringe-worthy moment in the film.  Everything with this little annoying asshole of a niece is terrible.  Just like everything about this movie, outside of the beginning, is terrible.  Having seen this movie and experienced its awfulness, it's no surprise to me that Stacy Title and Jonathan Penner have not gone on to become a successful filmmaking duo.  With movies this bad, you just wanna put them on a rocket ship and send them to the moon where they can keep making their shitty movies for themselves.  I hated, almost, every single second of this.  I'd rather have pink-eye than suffer through this again.  Umm, yea, don't watch this.  A few laughable moments don't make up for the overall hideousness this movie gladly provides to you on a silver platter.",
            "review_date": "2018-06-22",
            "source": "rt"
        },
        {
            "content": "It's ok.  Not great, but not awful.  It has a few good scares and is working from a good idea.  It just doesn't quite deliver.  The Bye Bye Man looks like a bad Halloween costume and that really detracts from the scares.  But I don't regret watching it, so that's something.",
            "review_date": "2018-05-22",
            "source": "rt"
        },
        {
            "content": "Bye Bye Man looks kinda cool.Also dont play the drinking game with this (everytime they say dont say it,dont think it you drink) you will probably die from alchohol poisoning.",
            "review_date": "2018-05-16",
            "source": "rt"
        },
        {
            "content": "So, bad. So so bad. Just awful.",
            "review_date": "2018-05-12",
            "source": "rt"
        },
        {
            "content": "Had high hopes but found myself bored and no real wow factor",
            "review_date": "2018-04-30",
            "source": "rt"
        },
        {
            "content": "Some parts of the movie are not  nessecary and very boring.",
            "review_date": "2018-04-08",
            "source": "rt"
        },
        {
            "content": "Terrible acting and nonsensical horror movie rules made this a tough watch.",
            "review_date": "2018-03-25",
            "source": "rt"
        },
        {
            "content": "I liked it, I thought it had some scary parts in it",
            "review_date": "2018-03-24",
            "source": "rt"
        },
        {
            "content": "pure genius god made a movie to scare the demons out of us and it worked a pure art piece",
            "review_date": "2018-03-20",
            "source": "rt"
        },
        {
            "content": "This is one of the most boring horror films ever just filled with cliches and bad teen characters that are just there and don't add anything and it doesn't make much sense in most places especially with the BBM like the dog and the coins and it just gets confusing but i like the concept of the BBM and its very creative but just so poorly executed.",
            "review_date": "2018-03-17",
            "source": "rt"
        },
        {
            "content": "just terrible, I've seen better movies with half of the budget this film had.",
            "review_date": "2018-03-16",
            "source": "rt"
        },
        {
            "content": "This holds the record for the single dumbest movie I have ever seen. This movie is so bad that you wonder if it was a money laundering scheme. Every single aspect of this movie down to nit-picky technical qualities is horribly flawed. Not a single second of this film is without some glaring flaw, an achievement in of its own if you ask me.",
            "review_date": "2018-03-04",
            "source": "rt"
        },
        {
            "content": "This \"movie\" has to be one of the worst films I have ever seen... and I've seen Battlefield Earth, Freddy Got Fingered, Showgirls, The Hottie and the Nottie, and so on and so on.\nBut! I have to say that this film is so bad it is hilarious. I have no idea how such a big budgeted movie and commercially successful at that could be a so bad it's funny movie. And I don't use the term \"So bad it's good\" because it is not at all good. Not one bit!",
            "review_date": "2018-02-02",
            "source": "rt"
        },
        {
            "content": "TERRIBLE!! This film deserve a 1% or 0%",
            "review_date": "2018-01-12",
            "source": "rt"
        },
        {
            "content": "Absolute disaster of a film. The characters were bland and uninteresting, the film itself was a mashup of scenes from better movies, and the main female obviously was British and played an American character awfully.",
            "review_date": "2018-01-08",
            "source": "rt"
        },
        {
            "content": "Forgettable movie with a demonic character you get only to see in the last 5 min. The story and every happening is maximal predictable. No fear factor, no thrill or even action.",
            "review_date": "2018-01-06",
            "source": "rt"
        },
        {
            "content": "Csak az nézze meg, aki minden horrorfilmet megnéz. Nem magyaráznak el semmit a filmben, csak történnek az események. 10/4",
            "review_date": "2018-01-04",
            "source": "rt"
        },
        {
            "content": "Boring and cliche doesn't even begin to scratch the surface of how utterly miserable this movie was.\n\nA friend and I watched this movie together over skype, and didn't realize we were a full 45 seconds apart.  That's how uninteresting and un-cohesive this movie is.",
            "review_date": "2018-01-02",
            "source": "rt"
        },
        {
            "content": "Okay so, imagine, it's A Nightmare on Elm Street, but it's also Donnie Darko, but it also sucks, but it's also awesome, but it also has naked people getting hit by a train.",
            "review_date": "2017-12-27",
            "source": "rt"
        },
        {
            "content": "I think La La Land has a shadowy culprit to blame for the big slip-up at the 2017 Academy Awards where it mistakenly was declared Best Picture before the rightful winner, Moonlight, was crowned. Actress Faye Dunaway was the one who spoke aloud the infamous slip-up, but I think she had something else on her mind. She was so preoccupied with trying NOT to think about the Bye Bye Man that she wasn't fully paying attention to the moment. Fortunately, Moonlight got its rightful due. Unfortunately, The Bye Bye Man exists as a horror film and Dunaway within it. This is a movie whose mantra is \"Don't say it, don't think it,\" all but begging to be forgotten.\n\nIf The Bye Bye Man had been the film it appears to be in its opening scene, we might have had an effectively unnerving horror thriller. We watch in a single long take as a distressed man drives home, mutters to himself, and takes out a rifle and systematically kills every person who admits they said \"it\" or told someone. He goes from person to person, pleading whether they told anyone, and it's always yes. Then he moves on to kill that person, asking them the same question. It's an effectively chilling scene and a fantastic way to open a horror movie. And it's all sadly downhill from there, folks. The rest of the movie is a stupid thriller with stupid teenagers doing stupid things.\n\nAny power the Bye Bye Man has as a concept, a mimetic virus, is wasted as a goofy Boogeyman knockoff with vague powers and intentions. Apparently, one of the insidious side effects of the Bye Bye Man is his ability to cause erectile dysfunction. After the first night he-who-shall-not-be-named is named, two of our college students talk about trying again and how \"that\" never happens to them, all but implying the Bye Bye Man was a sexual detriment. Another weirdly defined power is that the Bye Bye Man causes his victims to see hallucinations, though sometimes they're nightmares like maggots crawling out of eyeballs, and other times they're fantasy, like a naked friend beckoning for a lustful tryst. One character hears disturbing scratching noises and then visions of people standing buck naked on train tracks (the amount of brief nudity made me recheck that this received a PG-13 rating). \"We're all losing our minds at the same time,\" a character bemoans at the 41-minute mark. At one point, the Bye Bye Man sends himself as a GIF, knowing how to reach millennials. I don't understand why these kids don't accept that if they see something horrific it's probably false. They know the Bye Bye Man is terrorizing them with their fears and yet they fall for it every time. When you're talking with someone and all of a sudden they start seeping blood from every orifice, maybe that should be a clue. If Elliot (Douglas Smith) knows he's afraid of his girlfriend sleeping with his best friend, then shouldn't he doubt the voracity of seeing them together after the malevolent force with evil visions has entered his life? What's the point of scratching \"don't say it, don't think it\" as a preventative measure? That calls more attention to the forbidden item. It's like in Inception, when they say, \"don't think about elephants,\" and invariably that's what you're going to think about.\n\nIf the Bye Bye Man can make people say its name, then why isn't it doing this all the time? Why all the hallucinations to drive teens to kill themselves? That seems ultimately counter productive to Bye Bye Man business. Any businessperson will tell you the key to expanding your outreach is through happy customers. Fulfill these people's wishes and then come to collect later. I can write an entire proposal for the Bye Bye Man to shore up his business. He seems to be doing everything wrong. If the goal of the Bye Bye Man is to spread its name/message, along the same lines of self-preservation through proliferation like the haunted Ring VHS tape, then it needs a more straightforward approach. Let these doomed teenagers know their nightmares will end if they bring in an additional however many new victims. Alas, the Bye Bye Man is painfully unclear (it even has zero references on the Google imitator search) and just another boo spook.\n\nEven for horror movies, the characters can be powerfully boring and meaningless. The entire premise is a group of college kids moving into a house that used to be owned by the crazy guy in the opening flashback. They each take turns seeing things, hearing things, and doing things, some as mundane as scribbling without their direct knowledge. The plot is in a holding pattern that requires characters to repeat the threat over and over. The only setup we have with these characters is one house party so we don't exactly know what they're like before they start going crazy. Much of their hallucinatory confusion could be mitigated if they just communicated with one another. \"Help, Friend A, I am seeing [this]. Is that what you are seeing as well, Friend A?\" It leads to a lot of rash actions for supposed friends. Elliot even refers to his friend as a \"jock,\" which is a term I don't think anyone out of high school says. When the police suspect Elliot of foul play once his friends start dying, he is acting completely guilty. He begs Carrie Anne Moss (The Matrix) not to force him to say a certain name or else her kids might be in danger. That sounded like a thinly veiled threat. And then the police let him go!\n\nThe mystery of the Bye Bye Man's history is the only point of interest in this story, and even that has its limits. The librarian (Cleo King) is hilariously hyper focused on delivering exposition. She even knows the protagonist on a first name basis. I think she lives to tell people about this one weird event in the school's history. She even calls Elliot on the phone! The librarian reaches out to him, saying, \"I've had some strange dreams ever since we talked.\" She then asks if she can come over to his house later. What kind of relationship does this person forge with students? Dunaway is featured as the wife of the opening killer, and I just felt so sorry for her during every second on screen. She deserves better than this. Somebody go check on Faye Dunaway and make sure she's okay.\n\nThe Bye Bye Man is a horror movie that's so bad it can be outlandishly funny. It starts off well and deteriorates rapidly, abandoning sense and atmosphere for jumbled scares. There's an extended bit during a climactic dramatic moment where a father has to convince his daughter to pee out in public. I felt so bad for every actor involved. I'll even spoil the ending, which made me howl with laughter. A little girl talks about how she saw a table with some writing. \"What did the writing say?' her father asks, and oh no, here we go again you think to yourself. Then a second later the little girl says, \"Daddy, you know I can't read in the dark! What do you think I am, a flashlight?\" My God, that moment should have been followed by a rimshot. This half-baked movie opens up a lot more questions than it has the ability to answer. What is the mythology of this character? What's with the constant train imagery? Why does the Bye Bye Man have a pet dog? Why are the coins a significant part of its Bye Bye motif? And always, if it can simply make people talk, why isn't it doing this all the time to spread its name? The Bye Bye Man is fun bad but oh is it still bad.\n\nNate's Grade: D",
            "review_date": "2017-12-27",
            "source": "rt"
        },
        {
            "content": "A new low for horror movies",
            "review_date": "2017-12-05",
            "source": "rt"
        },
        {
            "content": "If you want a genuinely scary horror movie, this movie will disappoint every time. It actually got me with a jump scare once because I legitimately forgot I was in a horror movie. I was laughing throughout the entire movie. Now if you want a movie that is so bad that is is laughable, this is your movie. It works as a comedy because it tries to be/claims to be a horror movie. Seriously if you want to laugh at a movie, this is your movie.",
            "review_date": "2017-11-02",
            "source": "rt"
        },
        {
            "content": "This is a film that had so much potential in its concept and even had some relatively acceptable scenes. It wasted all of that on this stupidly named villain with a stupid look and a stupid pet dog. Throw a lackluster script on top, add a dash of poor editing choices for good measure and you get The Bye Bye Man, a film that I doubt I will be saying or thinking about ever again.",
            "review_date": "2017-10-28",
            "source": "rt"
        },
        {
            "content": "Quite creepy no matter what the reviews say.",
            "review_date": "2017-10-27",
            "source": "rt"
        },
        {
            "content": "As the title would suggest, The Bye Bye Man is about a group of teenagers who are terrorised by the aforementioned creature whose name seems to bring disaster to anyone who knows it. This film starts with a bit of a bang and an interesting premise but quickly deteriorates into a boring B movie style horror with a predictable plot and poor acting. The Bye Bye Man isn't the least bit scary and feels somewhat like a pale imitation of Final Destination as the characters are doomed to be killed off and the only question is how and when. Unfortunately the performances are pretty poor throughout, with Cressida Bonas giving a particularly poor performance as Sasha. The CGI and special effects are also quite poor with a weird dog like creature that looks unbelievably fake and a Bye Bye Man that looks like he's trick or treating. Overall, a disappointment and one of the least enjoyable horror films to come out this year.",
            "review_date": "2017-10-18",
            "source": "rt"
        },
        {
            "content": "This is boring, unintresting characters and over the top acting. Don't say this movie, Don't think this movie. 2/10 Worst of 2017",
            "review_date": "2017-10-16",
            "source": "rt"
        },
        {
            "content": "How the hell did this get made? Why did it get made?",
            "review_date": "2017-10-15",
            "source": "rt"
        },
        {
            "content": "I may be alone in this, but I really enjoyed this.  Some of the effects are not great, but it was good enough for me.",
            "review_date": "2017-10-08",
            "source": "rt"
        },
        {
            "content": "Please don't waste your time with this poor excuse for a film. It's just a ploy to get money. The only good thing about this film is the credits.",
            "review_date": "2017-10-01",
            "source": "rt"
        },
        {
            "content": "Not great but certainly not bad.",
            "review_date": "2017-10-01",
            "source": "rt"
        },
        {
            "content": "Decent movie ruined by a comedicly unscary monster. He looks silly. The lead actor is quite good.",
            "review_date": "2017-09-29",
            "source": "rt"
        },
        {
            "content": "Don't think it! Don't say it! Just watch it!\n\nThere's nothing major difference with this and the regular horror flicks, except the internal structure of the tale. For that alone, it is worth a watch. Because they have used it the better way, yet the familiarity gives out everything to its viewers. So sad that you could predict the entire film, despite their best effort to turn it around. The good news is, if you are not a horror film fan, you possibly would enjoy it. But those who love and watch horror films regularly would find it somewhat a waste of time. I was the first one, and I thought it was better than some of the recent big names from the same genre.\n\nYeah, looks a mix of plenty of films. It was somewhat like 'It Follows', but less complicated. Easy to follow the characters and the story. Though from the beginning itself, it was very intentional. A decent cast and the filmmaking. It could be scary for some viewers, but I found a little edgy and well paced narration. But sadly it did not miss any of the usual horror flick formula. One of the most overused, not just in this film, but any horror films is that those film character interviewing the one of the survivours from the past. So if you don't mind such common usage, it is an acceptable film.\n\n6/10",
            "review_date": "2017-09-26",
            "source": "rt"
        },
        {
            "content": "Some of the writing and acting get shaky toward the end but this was a hoot.",
            "review_date": "2017-09-18",
            "source": "rt"
        },
        {
            "content": "Esta película tiene sus cosas buenas, el problema es que duran dos segundos antes de que lo revienten. Al final es una película normal y corriente del género en la que han desperdiciado mucho potencial. Viendo cómo actúa el Ente podían haber hecho mucho más y mejor al estilo de Oculus. Mi nota es un 4.\n\nVersión completa en: Vaderexpress.blogspot.com",
            "review_date": "2017-09-18",
            "source": "rt"
        },
        {
            "content": "Not much new, but also not bad.  Good horror fun.",
            "review_date": "2017-09-14",
            "source": "rt"
        },
        {
            "content": "how were doug jones and trinity coerced into appearing in this monstrosity?",
            "review_date": "2017-09-13",
            "source": "rt"
        },
        {
            "content": "The premise had promise but they failed to excute. From bad lines, bad acting and bad pacing I would say most would agree that it's just not that good.",
            "review_date": "2017-09-07",
            "source": "rt"
        },
        {
            "content": "Don't think it, don't say it! If you do, it's bye bye or adieu.",
            "review_date": "2017-09-04",
            "source": "rt"
        },
        {
            "content": "What does a teen horror movie look like in 2017? Pretty much what it's looked like for the last few years, or the last entire decade even. The Bye Bye Man, while having moments of promise and even the odd genuine scare, is yet another by-the-numbers fear flick. Séance scene that ends badly, check. Randomly slamming doors, check. Flickering lights, check. Characters searching alone in the dark for the source of a mysterious noise while repeatedly calling out 'Hello, is anyone there?', check. Bad guys walking past the camera while the protagonists have their backs turned, check. Threatening writing plastered all over a wall/ceiling/object, check. It's such a shame that films like this are still being made with no innovation or originality. Building suspense is evidently too hard for the filmmakers and beyond the attention span of modern audiences, so in its place we get jump scares galore. The acting isn't good, the script is poor, the story progression is frustrating and non-sensical and the ending leaves us with the terrifying prospect of a sequel. A sequel to The Bye Bye Man? You can make your own jokes about that one. The film utterly fails to distinguish itself from the myriad of young adult horror movies where the main character act like idiots, evil, supernatural killers have no sense of urgency and everyone of importance lives in what looks like a haunted house. A wasted of time, money and what little talent it has.",
            "review_date": "2017-09-01",
            "source": "rt"
        },
        {
            "content": "\"The Bye Bye Man\" was a pretty weak attempt at a psychological thriller/horror, that had a lot of pretty disappointing suspense scenes, and a few too many cliches. The overall premise for the movie was pretty interesting, basically a boogey-man that terrorizes anyone that thinks about, or says its name. However, everything this movie does takes that premise and brings it down. I legitimately found this more of a parody movie than a serious horror film, as a lot of the acting, and the incredibly terrible CGI in some scenes were just comically bad. With almost every horror scene in this movie, I felt like I had already seen it before, and with the exception of some of the scenes where The Bye Bye Man uses his deception to trick people, it seemed as though it was a carbon copy of other horror movies. All in all, there was nothing that stood out about \"The Bye Bye Man\", except for debatable acting, and a hilariously bad CGI and animation. \"The Bye Bye Man\" is terrible.",
            "review_date": "2017-08-27",
            "source": "rt"
        },
        {
            "content": "Dull...dull...dull, and not very well acted. I should've paid attention to the other reviews. I think I only watched it because I  met Douglas and his brother Gregory Smith when they were little boys. I knew their dad Maurice Smith, who was a producer I worked for many years ago.",
            "review_date": "2017-08-25",
            "source": "rt"
        },
        {
            "content": "`Don`t think it, don`t say it` is the key phrase in the bye bye man but how you feel about it is more `Don`t see it, don`t watch it`. The movie is boring and predictable.",
            "review_date": "2017-08-22",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man is disposable PG-13 January horror at its worst, with atrocious acting and repetitive jumpscares. M. Night Shyamalan would laugh at this.",
            "review_date": "2017-08-19",
            "source": "rt"
        },
        {
            "content": "It's like a film student made this.\n\nAnd not a good one.",
            "review_date": "2017-08-18",
            "source": "rt"
        },
        {
            "content": "With a script that could have been a lot more of what it was and without exploting enough the psychological side of the movie (which, by other way, it was the best of it), the Bye Bye Man only gets out well the fact of having the audience interested in it.",
            "review_date": "2017-08-14",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man: This low budget horror film, written by three-time Survivor contestant Jonathan Penner (who also has a cameo role) and directed by his wife, is about a group of Wisconsin college students who uncover a demon who stalks his victims when they utter or even hear his name. Uh, yeah.  Don't let the brief appearances by Carrie Anne Moss and Faye Dunaway fool you -  everything about this boring dumpster fire of a film is awful - the disjointed, senseless storyline, the weak acting and the not so special effects. Don't watch it, don't see it. F\n\nFor more reviews go to: \nhttps://m.facebook.com/theREALreelness/",
            "review_date": "2017-08-09",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man takes an interesting plot and then destroys it with horror cliches and awful acting.",
            "review_date": "2017-08-09",
            "source": "rt"
        },
        {
            "content": "??????????????????????????????????????????????????????????????????????????????????????????????",
            "review_date": "2017-08-06",
            "source": "rt"
        },
        {
            "content": "Don't watch it, don't see it",
            "review_date": "2017-08-03",
            "source": "rt"
        },
        {
            "content": "I thought this movie was great, a tad cheesy at times, but it kept me in suspense and the ending, omg the ending, i kept thinking \"DONT SAY IT\". \nA lot of unfavorable reviews for this movie, but keep in mind, ITS NOT A REBOOT, its something different and not some god aweful reboot of a great movie from 30 years ago.\n Anyways its worth a watch, ya may like it.",
            "review_date": "2017-08-03",
            "source": "rt"
        },
        {
            "content": "It was great, and very confusing, but overall it was a great movie and story",
            "review_date": "2017-08-03",
            "source": "rt"
        },
        {
            "content": "A movie that doesn't even try to scare you with a very forgettable plot",
            "review_date": "2017-07-30",
            "source": "rt"
        },
        {
            "content": "Loads of mythologic symbology...basically an exploration of how people deal with the hell within us differently.",
            "review_date": "2017-07-29",
            "source": "rt"
        },
        {
            "content": "Mejor que el promedio de films de terror.",
            "review_date": "2017-07-25",
            "source": "rt"
        },
        {
            "content": "Seriously I expected more",
            "review_date": "2017-07-10",
            "source": "rt"
        },
        {
            "content": "With a laughable script, annoying scares, tacky effects, and some of the worst acting I've ever seen, The Bye Bye Man is an absolute mess that's about as boring and unscary as horror movies get.  This is an early contender for worst movie of 2017.",
            "review_date": "2017-07-07",
            "source": "rt"
        },
        {
            "content": "Shades of creepy pasta, but I thoroughly enjoyed it",
            "review_date": "2017-07-05",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man is probably the worst film I have seen this year so far. I mean really I think this movie came out just to make money out of teenagers. It is dull, full of cliches, has bad acting, terrible cgi, and no one knows what The Bye Bye Man is. Don't Say It, Don't Think It? More like Don't See It at all.",
            "review_date": "2017-07-03",
            "source": "rt"
        },
        {
            "content": "Considering the \"horror\" movies these days are boring and very predictable with cringe worthy acting to say the least, I was quite surprised that I somewhat enjoyed this flick. The story line is unique which keeps the movie exciting & the acting is actually pretty good compared to the standards I'm so used to seeing nowadays. Could they have delved deeper into where the Bye Bye Man originated from? Yes. Could the ending have had more of a twist? Yeah, sure. But keeping in mind all the crappy horror movies I'm seeing these days I'm going to store this one in the \"good\" category. Definitely worth a watch.",
            "review_date": "2017-07-03",
            "source": "rt"
        },
        {
            "content": "These critics are way to harsh. This movie has great twists and great moments. First good scary and thrilling movie I have seen in awhile. What do these people want in a horror/thriller movie? They executed the movie terrifically and if you are a fan of the Sinister movies than this one is similar in parts. Overall great movie in my opinion don't be so harsh on movies for no reason",
            "review_date": "2017-06-28",
            "source": "rt"
        },
        {
            "content": "A truly awful movie. It's unoriginal, poorly made, and so contrived that it's actually frustrating. The only enjoyment I got out of the whole thing was the hilariously terrible acting and some unintentionally funny moments. Other than those two things, I don't recommend this movie at all. It's one of the worst movies of 2017. Let it fester and die.",
            "review_date": "2017-06-27",
            "source": "rt"
        },
        {
            "content": "Bye bye to any plot or action or explanation fo the villain that works.",
            "review_date": "2017-06-25",
            "source": "rt"
        },
        {
            "content": "Reminded me of Occulus but not as good.",
            "review_date": "2017-06-25",
            "source": "rt"
        },
        {
            "content": "At least it was interesting",
            "review_date": "2017-06-25",
            "source": "rt"
        },
        {
            "content": "A lot of people do not like this movie, however I thought it was a fresh idea to the failing genre that is modern horror.",
            "review_date": "2017-06-24",
            "source": "rt"
        },
        {
            "content": "Movie didn't show specific parts of the trailers, CGI was poor, some things in the movie didn't line up with previous scenes. But overall, it scared me so it was a good movie in my book.",
            "review_date": "2017-06-22",
            "source": "rt"
        },
        {
            "content": "I hate it when someone always has to get run over by a car. Sick",
            "review_date": "2017-06-19",
            "source": "rt"
        },
        {
            "content": "I didn't think it was a bad movie. It wasn't real scary but the concept was interesting.",
            "review_date": "2017-06-19",
            "source": "rt"
        },
        {
            "content": "The first thing that should be criticized thoroughly before anything else in this movie is the acting. I've seen bad acting before. This takes it to a whole new level. I actually yelled out at a few points \"THIS ACTING! MY GOD!\"\n\nSecondly, the writing. This is one of those \"tell, don't show\" movies. The characters sit around explaining things about the antagonist, rather than have the movie show us. For example, someone goes at great length to mention that saying \"The Bye-Bye Man\" to anyone \"spreads\" the evil like a virus. It would have been a lot better if we actually got to see that, rather than listen to someone explaining it. There was way too much talking in general in this movie. It really needed to be cut out.\n\nThird... I have to give this more than one star because of how hilarious this movie was. It was no masterpiece of comedy, because it also bored and frustrated me at various parts. But good lord, when this movie was at the height of badness, it was better than most comedies. In fact, this film would have worked great as a satire if it was billed as one, due to how utterly ridiculous it was.\n\nAnd what was with the girlfriend getting sick? That went completely nowhere. I thought by the end, she'd be violently ill, vomiting blood, something. None of that happened. It played no part in the plot or in character. What was the point of that?\n\nOverall, it was funny, but not worth another viewing.",
            "review_date": "2017-06-19",
            "source": "rt"
        },
        {
            "content": "Despite the puerile name given to the titular antagonist, this film does rather well with its venture of horror. Indeed there were moments which lacked in the realm of originality( the convient information found through an internet search, or the character archtype of the wise old individual who survived the antagonist in the past). The film relied upon lesser used means to build tensions. Sure, they used jump scares, but The Bye Bye Man did not rely upon them the way other pieces from this genre so often use. Furthermore, I found the Greek symbolism (relative to death) throughout the film to be refreshing. Given the quality of current horror films coming out of Hollywood, I'd have to say this film is above average.",
            "review_date": "2017-06-18",
            "source": "rt"
        },
        {
            "content": "Huge plot holes... Horribly written story.. cheaply made film.. maybe with a better director and I little more budget it could have been better.... It had potential",
            "review_date": "2017-06-17",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man is really, really bad but it's a LULZ kind of bad. Definitely horrific acting in several places and definitely the worst CGI I've seen since The Langoliers. There was PG-13 type blood level in a movie with R-rated type themes of violence, and this movie traverses an entire galaxy of tones. I have a feeling though that this is gonna become a cult classic in a so-bad-it's-good way. This is to me a 2/10 type movie because of some of the nonsensical elements in this film, but it's certainly entertaining. Just be ready to laugh in places you're not supposed to laugh. \nLadies and gentlemen, The Bye Bye Man is One-Watch Worthy. This movie is a total trainwreck that you can have a ball with. I'd say wait to rent it, then watch it with some friends and just roast the heck out of it.",
            "review_date": "2017-06-15",
            "source": "rt"
        },
        {
            "content": "I went into this with high hopes. Huge disappointment",
            "review_date": "2017-06-15",
            "source": "rt"
        },
        {
            "content": "The idea for the movie is pretty intriguing. You think of someones name, the come from nowhere and reek havoc on your lives. But the question is, where did he come from? Who was The Bye Bye Man before he became a murder with some weird pets. \n\nThe writing could use some work and the acting was pretty much trash but the story was a decent idea and the film was quite original. \n\nThe Bye Bye Man: 18% F",
            "review_date": "2017-06-13",
            "source": "rt"
        },
        {
            "content": "Do we not know how to make movies anymore or are we just doing movies to do movies !!! Terrible movie 1:30 hours of my life wasted",
            "review_date": "2017-06-10",
            "source": "rt"
        },
        {
            "content": "No, it's not all that original, but it's not a bad film for its type.",
            "review_date": "2017-06-10",
            "source": "rt"
        },
        {
            "content": "WAT A WASTE OF TIME! The movie looks like it was made on a 40$ budget. Its crap.",
            "review_date": "2017-06-10",
            "source": "rt"
        },
        {
            "content": "the combination of a terrible writing and awful acting downgrade this mediocre horror film.  bad, but I've seen worse",
            "review_date": "2017-06-08",
            "source": "rt"
        },
        {
            "content": "everything I heard bad about it is true. What a stupid movie",
            "review_date": "2017-06-07",
            "source": "rt"
        },
        {
            "content": "terrible.  bad writing. bad acting.",
            "review_date": "2017-06-06",
            "source": "rt"
        },
        {
            "content": "This is the kind of movie requiring an advent into being sufficiently cultured in things such as mystery and literature. No, it's not your typical, nonsensical, thriller-alike horror fest, even though the cover might suggest such, hence the stereotypically literary acting. A horror movie might differ on the thematic approach behind it, and is not necessarily something meant to be simply \"scary\" for the so obviously fanatic masses, it might also be the object of curiosity for people interested in the occult, complexion of plots, or stigmas regarding the context in question. With all that said... This is obviously a great movie compared to the average horror movie! From the makers of the instant classic Oculus: Devil's Mirror movie, this masterpiece seems to enact once again plot twists worth the wondering. One of the funniest things in this movie is how, the character of another race looks extremely similar to Timbo, from the Oculus movie, adding this movie some extra ironic element and approach into it... However, it's important to beware of the nudity present within the movie and use some discretion regarding it, if necessary...",
            "review_date": "2017-06-06",
            "source": "rt"
        },
        {
            "content": "This film has some good horror moments with a semi-intresting semi-over-the-top plot that becomes way too over-the-top by the end until it loses all the suspense the film created from the first couple of acts by the finale. The characters in the film are also very generic and not very interesting at all in the film. The sloppy writing doesn't help either never getting the emotional punch needed at the end.",
            "review_date": "2017-06-03",
            "source": "rt"
        },
        {
            "content": "Worthwhile movie, twisted themes.",
            "review_date": "2017-06-02",
            "source": "rt"
        },
        {
            "content": "I get that there are a few inconsistencies (''dont say it dont think it''? They think and say it all the time, it doesnt work as a trigger) bits of clumsy dialogues, bad lead actress, some pacing mistakes and missed opportunities (underdevelopped mythology coyly begging for a sequel)  but all in all it does the job of a standard creeper. Maybe its not memorable but it in no way deserves the level of harshness it received.",
            "review_date": "2017-05-31",
            "source": "rt"
        },
        {
            "content": "The only way this movie could have redeemed itself from its terrible plot crappy acting and all around abomonatiin of an existance is if at the end *spoiler alert* when our protagonist is getting poked in the forehead by what i can only assume was not the bye bye man but an omish man with dry skin in need of a tan, instead of just sitting there and taking it him and his freind got up bent the bye bye man over and ran a train on him while his dog freind watched and humped his girlfreinds dead body. Utter garbage",
            "review_date": "2017-05-28",
            "source": "rt"
        },
        {
            "content": "Proper Perspective: A movie that sat on the shelf for almost two years, was re-edited from Rated R to PG-13, with a villain that is in the movie for a few minutes, a horrible title, and some of the worst \"teen\" actors I have seen in quite some time. Let's talk about The Bye-Bye Man...\n\nOfficial Synopsis: Three friends stumble upon the horrific origins of a mysterious figure they discover is the root cause of the evil behind unspeakable acts.\n\nPlot: Three college students move into a house and then find a dresser and then bad things happen and then the movie ends.\n\nTake: I was warned to not watch this movie by a few critic friends of mine. I was warned not to see this movie by the bad trailers. I was warned not to see this movie the reviews. Yet, I gave Redbox a $1.50 to see for myself. There was only one question that I wanted answered going into seeing The Bye-Bye Man: Which is worse, Rings or The Bye-Bye Man?\nThe answer is they are both awful movies.\n\nHaving said that both movies had similar production issues. They were both sitting on a shelf for a few years, had release dates change a few times, and wholly unnecessary stories.\n\nI'm going to use as much effort and creativity in this review as the writers, director, actors, and producers put into the making of this \"film.\" The acting was about as close to the worst I have seen in any movie, ever. I do not want to be disrespectful, maybe the actors are sweet talented kids. Maybe the direction or edits took away from their performances, maybe, but Douglas Smith (Elliot), Cressida Bonas (Sasha), and especially Lucien Laviscount (John) were really bad in the cut we all get to see.\n\nScreenwriter Jonathan Penner (nothing of note) and director Stacy Title (same nothings of note) have collaborated before on previous projects, and again might be sweet heart human beings, but the movie they crafted was atrocious. \n\nRecommendation: I don't think this qualifies as one of those bad movies you watch with your friends with a few drinks to see how bad it is. Stay away. I am sure it will be in a bargain bin by Christmas and packaged with a better movie to force you to buy it soon enough. \n\nTIER ONE!!! Handshake, chest bump, smile... What the fuck was that? Do real people talk like that now?",
            "review_date": "2017-05-28",
            "source": "rt"
        },
        {
            "content": "\"The Bye Bye Man\" could have easily tread into the \"so bad, it's good\" category, with its half-cooked lead performances and ridiculously cheap special effects, but - much to the film's detriment - it wallows in the self-serious mediocrity of exposition dumps and cooky paranoia. Truly just a mindlessly boring exercise in what a lot of modern horror directors have already grown out of - pathetic jump scares, dumb characters, and a total neglect of the established rules of its own world. Yeesh.",
            "review_date": "2017-05-28",
            "source": "rt"
        },
        {
            "content": "I didn't think it was that bad.  It had me tense several times, and I thought it was pretty decent all around.",
            "review_date": "2017-05-27",
            "source": "rt"
        },
        {
            "content": "Why??? Just.....why???? The bye bye man??? Is this some N'sync stuff or.....???????",
            "review_date": "2017-05-25",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man is something, alright. In other words, it might be one of the worst horror films I've seen in recent memory. It's not scary, it's sloppily made, poorly acted and most scenes do not make sense at all. But hey, at least you can watch it for a few laughs.",
            "review_date": "2017-05-23",
            "source": "rt"
        },
        {
            "content": "A silly premise.  So this is about three twenty-something year olds that move into a house in Wisconsin.  One of them finds a nightstand that has cryptic writing scribbled on the inside drawer, but underneath that is four words carved into the wood: \"The Bye Bye Man\".  Turns out that everybody who has ever read or heard this combination of words is condemned to a horrific death filled with hallucinations.  Will our trio of heroes be able to survive this?  Now I had already heard stories of how bad this is, and horror releases dumped out in January do have the tendency to be on the lacking side of quality.  The Bye Bye Man is no different, so horror fans: don't get your hopes up.  Now I could have forgiven a lot of this movie if there was anything about it that was legitimately scary or creepy.  If I had gotten just maybe ten minutes of chills, I would at least be writing here that genre fans should maybe rent this if they've ran out of other options.  When you break it down, the Bye Bye Man as a character is pretty lame.  He doesn't really do anything, and his one power that he has is that he makes people see things that aren't real.  He is never intimidating whenever he pops up, and all he does is sulk around in the background like an antisocial goth kid, hanging out with his CGI hell dog.  He might point at you a little bit, sure, but he never does anything that couldn't be solved by you closing your eyes.  I don't blame Doug Jones who plays the titular role, as he is a respectable working actor, he just wasn't given anything to do.  In addition to that, these are actors that don't really need to be working anymore.  Carrie-Anne Moss is the only one that gets a semi-pass for signing a bad contract, and she at least shows up.  Faye Dunaway should know better, and she is awful in a cameo role, never showing her abilities of being the capable actress that we all know that she is.  The leads are highly likely never to be seen again in future films, as they all are bad actors, even by horror movie standards.  I will say that I have seen worse, but this is a production that should have never seen the light of day, and it is the one thing that you don't want your horror movie to be: boring.",
            "review_date": "2017-05-23",
            "source": "rt"
        },
        {
            "content": "It's only okay. The 'scares', if you can call them that, are easy to predict, only managed to get me once and that was because I grew distracted.",
            "review_date": "2017-05-22",
            "source": "rt"
        },
        {
            "content": "This is a great movie!!!",
            "review_date": "2017-05-21",
            "source": "rt"
        },
        {
            "content": "Not interesting from the beginning and actually gets worse as it gets going.",
            "review_date": "2017-05-20",
            "source": "rt"
        },
        {
            "content": "In 2016, Private First Class Joseph Allen participates in a military operation alongside United States Army Rangers stationed in Afghanistan, by assisting them in taking back a city from insurgents. Impressed by Allen's capabilities, General Shepherd recruits him into Task Force 141. While Allen prepares for an upcoming assignment, Captain John \"Soap\" MacTavish and Sergeant Gary \"Roach\" Sanderson infiltrate a Russian airbase in the Tian Shan mountains to retrieve an Attack Characterization System (ACS) module from a downed American satellite.\n\nAllen is soon sent on an undercover mission in Russia for the CIA, joining Vladimir Makarov in a mass shooting at an airport in Moscow. After leaving the airport, Makarov, who has been aware of Allen's true identity, kills him and leaves his body behind to spark a war between Russia and the United States. Outraged by what is believed to be an American-sponsored terrorist attack, Russia retaliates by launching a surprise invasion on the East Coast of the United States.[a][32] With no evidence of Makarov's involvement in the airport massacre, Task Force 141 is sent to Rio de Janeiro to capture Makarov's arms dealer. They capture the dealer, and learn that Makarov's nemesis is being held in a Russian gulag. Task Force 141 assaults the gulag and rescues the prisoner, who is revealed to be Captain Price, a member of the British Special Air Service.[b]\n\nPrice agrees to help Task Force 141, but insists that his priority is to end the war in the United States. After raiding a Russian port, Price launches a ballistic missile towards Washington, D.C. and sets it to detonate in the upper atmosphere. The resulting EMP blast disables all electronic devices across the eastern seaboard, causing both factions to suffer but giving the Americans a much-needed advantage.[33] Soldiers fighting in Washington, D.C. narrowly avoid a bombing run of Russian-occupied strategic structures by the United States Air Force, when they light green flares atop the White House, showing that the city remains in American hands.\n\nMeanwhile, Task Force 141 narrows Makarov's hiding place to two locations; Price and Soap travel to an aircraft boneyard in Afghanistan to intercept an arms deal, while Roach and Lieutenant Simon \"Ghost\" Riley raid Makarov's safehouse on the Georgian-Russian border. Although Makarov himself is absent, Roach and his team obtain vital information on the antagonist; however, when they reach the extraction point, Shepherd betrays them, retrieving the intelligence and taking it with him, murdering Roach and Ghost and burning their bodies in the process. It soon becomes evident that Shepherd is the catalyst of the war between Russia and the U.S. with the intent of generating a massive wave of American enlistment, along with defense spending and production in a time of emergency. Shepherd sent Allen to participate in the massacre, fully aware that Makarov would set America up; he also allegedly provided the ACS to the Russian forces to be compromised, informed Makarov of Allen's identity, and eventually managed to secure a blank check from the government to fund his war effort, his endgame being to kill Makarov himself and usurp the glory, thus cementing his status as a national hero. Price and Soap learn of Shepherd's betrayal, and escape a battle between Shepherd's and Makarov's forces.\n\nPrice contacts Makarov on an open radio channel, where Makarov reluctantly reveals Shepherd's mountain base in Afghanistan. Price and Soap raid the base to take revenge on Shepherd in a suicide mission; during the infiltration, Shepherd attempts to escape on a boat, with Price and Soap in hot pursuit. At the climax of the pursuit, Shepherd sails into a helicopter, but Price shoots it down as he and Soap tumble over a waterfall.[32] A dazed Soap stumbles towards the crash of the helicopter, and attempts to kill Shepherd, but is stabbed in the chest. When Price arrives and engages Shepherd in a fist fight, Soap pulls the knife out of his chest and throws it at Shepherd, killing him. Nikolai, who arrives to recover the duo, and Price evacuate Soap for medical attention.",
            "review_date": "2017-05-20",
            "source": "rt"
        },
        {
            "content": "not bad bad but lame",
            "review_date": "2017-05-20",
            "source": "rt"
        },
        {
            "content": "It had a fun story, but not as much horror or scares as I would have liked.",
            "review_date": "2017-05-18",
            "source": "rt"
        },
        {
            "content": "Loved how this character looked, shame the ending just went nowhere.",
            "review_date": "2017-05-15",
            "source": "rt"
        },
        {
            "content": "If there's anything worse than Bye Bye Man coming out in 2017, it will be a truly awful year for movies.",
            "review_date": "2017-05-15",
            "source": "rt"
        },
        {
            "content": "It doesn't have any impact.",
            "review_date": "2017-05-13",
            "source": "rt"
        },
        {
            "content": "It wasn't that bad..",
            "review_date": "2017-05-13",
            "source": "rt"
        },
        {
            "content": "womp womp! can't think of anything positive to say about the bye bye man. Everything about this movie was pretty lame. I'm sure u could find any number of better ways to spend 90 mins of your life.",
            "review_date": "2017-05-12",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man is as bad and laughable as its title. Yes, it's a terrible movie, but I enjoyed it because of how bad it was. I laughed every time the character's died. I don't know why Carrie-Anne Moss was in this film. She's better than this. But there was one scene I genuinely liked because she was in it. The Bye Bye Man would've been the perfect bad movie if it was at least a little bit scary, with maybe one or two nail-bitingly scary scenes. Nope! The Bye Bye Man is just some dude with a hoodie and scars on his face. The CGI dog looks even worse. The scariest thing the Bye Bye Man did in the film was point. The jump scares were so cheap. The worst one was when he appeared in a window reflection. The first act was a bit slow, but I highly recommend The Bye Bye Man if you enjoy bad movies.",
            "review_date": "2017-05-12",
            "source": "rt"
        },
        {
            "content": "Ugh! Terrible in all aspects.",
            "review_date": "2017-05-12",
            "source": "rt"
        },
        {
            "content": "Regardless of that content you have within your movie, a silly title will almost always doom you. This is unfortunate as \"The Bye Bye Man\" starts off with a bang (several of them) and grabs you right away. It has an interesting, if not clever premise but very quickly loses steam after introducing it. Clearly those involved had the clever idea but were not really sure of what to do with it. It's not scary, rarely bloody and has forgettable characters.",
            "review_date": "2017-05-11",
            "source": "rt"
        },
        {
            "content": "The more you can not let it get out of your head, the closer it comes to get you",
            "review_date": "2017-05-11",
            "source": "rt"
        },
        {
            "content": "Sorta lame, run of the mill supernatural thriller featuring one of the worst performances I've seen from an actress coming from Prince Harry's ex-girlfriend Cressida Bonas (who ironically ended the relationship so that she could concentrate on acting). The redeeming feature of the film is a steady hand at the direction and a stable performance from leading man Douglas Smith. The film seems tries so hard to scare its audience, hurling jump scares from each corner of the ring at break-neck speed and when I actually stopped jumping, I realised that what was actually happening on screen wasn't that scary at all... The villain is quite unique, but unfortunately because of a drab performance he is quite easily forgettable, especially when they insist on him looking like a goth junkie, complete with dark eye shadow and a hoodie. Veteran actors Carrie Ann-Moss and Faye Dunaway can be forgiven for starring in this.",
            "review_date": "2017-05-11",
            "source": "rt"
        },
        {
            "content": "I thought it was pretty scary. The beginning was really good. The end got a little slower but still was pretty good!",
            "review_date": "2017-05-08",
            "source": "rt"
        },
        {
            "content": "This movie was surprisingly pretty good. Nice build, wrap back and tie ups. Nice suspense builds and surprises. If you like scary movies, worth your time to check this out.",
            "review_date": "2017-05-07",
            "source": "rt"
        },
        {
            "content": "Another in a long line of genre failures!",
            "review_date": "2017-05-06",
            "source": "rt"
        },
        {
            "content": "so much potential but the movie was garbage",
            "review_date": "2017-05-06",
            "source": "rt"
        },
        {
            "content": "what a masterpiece. Cried 6 times. Laughed 3 times. not really scared\n\n11/10, skulle knulla",
            "review_date": "2017-05-06",
            "source": "rt"
        },
        {
            "content": "Nothing special, nothing too misplaced either. Just a mess of a plot that really had nothing going for it, but the writers knew that. Clever bastards.",
            "review_date": "2017-05-05",
            "source": "rt"
        },
        {
            "content": "this movie was so sad it deserves 5 stars..",
            "review_date": "2017-05-04",
            "source": "rt"
        },
        {
            "content": "Terrible horror movie.",
            "review_date": "2017-04-30",
            "source": "rt"
        },
        {
            "content": "Boring, unscary, and stupid. The worst kind of horror movie for me. The premise is basically the same as A Nightmare on Elm Street and Candyman, and instead of watching this dumpster fire of a movie, watch the other 2 I just named. Much better in every way.",
            "review_date": "2017-04-30",
            "source": "rt"
        },
        {
            "content": "Not bad.  Not very scary or original (seriously, it just reuses mythologies like Bloody Mary or Candyman. On top of a whole host of horror movie cliches) but it's still rather effectively done. It's a decent chiller, with a gimmick that has potential, that can be developed into something cool, one that can sit alongside the boogeymen and slashers of old if done right...",
            "review_date": "2017-04-27",
            "source": "rt"
        },
        {
            "content": "One of the pluses of this haunted house outing is the realization that you would like to see a decent haunted house film made. On the minus side is when you admit to yourself that this isn't it. Nice to see Faye Dunaway and Carrie Anne Moss though.",
            "review_date": "2017-04-26",
            "source": "rt"
        },
        {
            "content": "It was bad, but so bad it's good bad, acting was humorous. Had a few decent jumps, worth the watch if you want a horror movie that's also unintentionally funny",
            "review_date": "2017-04-25",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man uses plot pieces from other horror movies to deliver a disposable horror story told though the same horror movie stereotypical characters that you've seen a million times. Some characters literally does nothing to forward the plot, that it actually left me wondering why they were in the movie at all. While there are one or two good scares, the rest remains in the form of ineffective sequences and visual imagery that goes unexplained. However, I did like how the Bye Bye Man looked and Doug Jones's portrayal of him, and I was impressed by the four minute opening one shot sequence. But everything goes downhill after that so don't  bother watching this movie.",
            "review_date": "2017-04-23",
            "source": "rt"
        },
        {
            "content": "The idea for the movie is pretty intriguing. You think of someones name, the come from nowhere and reek havoc on your lives. But the question is, where did he come from? Who was The Bye Bye Man before he became a murder with some weird pets. \n\nThe writing could use some work and the acting was pretty much trash but the story was a decent idea and the film was quite original. \n\n1.5/5",
            "review_date": "2017-04-21",
            "source": "rt"
        },
        {
            "content": "a decent concept for a horror movie even though it has elements from a lot of prior and one I thought was It Follows, not how but the way they would say, I'm not giving it to you.  it was just a movie that could of been good but it was hindered by all the horrible acting. When I saw Whanel I knew it was going to be under done.  he is a decent writer but his acting is terrible and everyone that followed in this movie was just as bad.  Disappointing.",
            "review_date": "2017-04-21",
            "source": "rt"
        },
        {
            "content": "This movie was so very slow. Nothing original about this one folks. Nothing made sense at beginning and played out. Nothing but a few slamming doors and a few mind tricks. I've seen so much better for instance the film Mama. I don't recommend this film to any horror film fans out there. You'll be very bored and practically fall asleep with this one.",
            "review_date": "2017-04-21",
            "source": "rt"
        },
        {
            "content": "I think all horrors have been done to death now...",
            "review_date": "2017-04-19",
            "source": "rt"
        },
        {
            "content": "A boring and idiotic horror film. Worst movie I've seen since Norm of the North!",
            "review_date": "2017-04-18",
            "source": "rt"
        },
        {
            "content": "One of the worst movies I've seen since I'm Not Ashamed, I'm serious!",
            "review_date": "2017-04-18",
            "source": "rt"
        },
        {
            "content": "Do not waste your time. No story. No shocks. No scares. Just literally nothing. No story. No acting. Waste of time.",
            "review_date": "2017-04-17",
            "source": "rt"
        },
        {
            "content": "My opinion-.\n\nThis movie begins rather well with a pre-generic sequence that instills enough desire to see more ... but after that becomes a story of three friends who fall by chance on the horrible origins of a mysterious character and that \" They eventually discover that it is the root cause of an evil that will affect them. This movie is still allowed to watch and I have not found it so bad, no need to see a nightmare movie to please, here there are nevertheless suggestive scenes sufficient for me. Good as in all these horror movies, it is not all Evil Dead nor exorcists, but what is some, to have the scare of their life, then go see a real psychopath for that is cinema, Not the best, but not the worst either, if not do not watch this movie.",
            "review_date": "2017-04-14",
            "source": "rt"
        },
        {
            "content": "Worst horror movie of 2017",
            "review_date": "2017-04-11",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man Review (2017) Short and Simple\n\nDon't Think Ir , Don't Watch it, Just Fucking Burn it with Fire\n\nTerrible Acting\n\nShitty Jump Scares\n\nA Stupid Plot \n\nOnly good thing is Doug Jones\n\nOverall: Horror Movies like this one makes me happy we had Get Out and Split come out this year. \n\nOverall Grade: F",
            "review_date": "2017-04-08",
            "source": "rt"
        },
        {
            "content": "How cliché. - How boring.\nDidn't expect much from this, the title seemed stupid already.\n\nBad acting, weird editing, scribbled text & drawings, the bitchy librarian that wants you to leave, predictable story - this movie has it all.",
            "review_date": "2017-04-07",
            "source": "rt"
        },
        {
            "content": "The lack of originality in this atrocious horror is driving me insane. Who thought that combining a few elements from other more popular flicks in the genre was a good idea? Casting aside the incoherence, terrible acting, and predictable outcome, the Bye Bye Man looked like Azog from The Hobbit and that CGI hound would've looked scarier if it had been traditionally animated by Disney. It's hard to watch something stupid like this especially when great Horror movies like The Conjuring exist.",
            "review_date": "2017-04-06",
            "source": "rt"
        },
        {
            "content": "Not scary, and a terrible story. I barely made it through this one.",
            "review_date": "2017-04-04",
            "source": "rt"
        },
        {
            "content": "Everything Wrong with Horror: The Movie",
            "review_date": "2017-04-04",
            "source": "rt"
        },
        {
            "content": "I enjoyed this horror film even if it had a lot of bad reviews .  It had good shock factor for a few scenes.  If you like a typical horror movie with a boogie man this one works on that level.  Not much more.",
            "review_date": "2017-04-04",
            "source": "rt"
        },
        {
            "content": "\"The Bye Bye Man\" (in spite of the laughable name), had loads of potential on premise alone. And though it trends towards giving us a surprisingly decent horror film à la \"It Follows\". It winds up disappointing approximately 15 minutes into the film, and it goes straight downhill from there. Cressida Bonas is just awful at times in terms of her line delivery and screen presence in general, the writing feels like it was done by a middle aged guy trying (and failing) to relate to a younger crowd, and the story as a whole leaves more questions than answers. \"Don't Think It, Don't Say It\"  went from a suspenseful tagline, to an ironic description of the legacy this very poor film will have.",
            "review_date": "2017-04-04",
            "source": "rt"
        },
        {
            "content": "Starts off quite promising but quickly turns into a slow paced pale imitation of far better films. The idea behind the Bye Bye Man was quite interesting but never really expanded upon with a decent backstory.",
            "review_date": "2017-04-02",
            "source": "rt"
        },
        {
            "content": "Interesting concept that just fell flat.",
            "review_date": "2017-04-01",
            "source": "rt"
        },
        {
            "content": "Had potential but failed nonetheless. A one time watch for sure.",
            "review_date": "2017-04-01",
            "source": "rt"
        },
        {
            "content": "This movie is the freakin bomb ð???ð???â?£ï¸?",
            "review_date": "2017-03-31",
            "source": "rt"
        },
        {
            "content": "it was fine; not very good though",
            "review_date": "2017-03-31",
            "source": "rt"
        },
        {
            "content": "Complete and utter pig spunk. From the outset the characters are a bunch of unlikeable cunts. It also resorts to the modern day horrors obsession with loud  music accompanying any attempt at a jump. Which all are predictable and not particularly scary. The Bye Bye Man himself looks like a homeless dude. To top it all off the main storyline has a bit of a feel of Candyman about it. Avoid.",
            "review_date": "2017-03-30",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man is a 2017 horror film from directed by Stacy Title based off of the book of the same name. The Bye Bye Man is an incredibly disappointing movie due to the admittedly interesting concept. The Bye Bye Man is one of the worst horror movies I have seen in a long time, this film isn't scary, it isn't tense and had some of the absolute worst screenwriting I've seen in ages. The film makes absolutely no sense as the script is so contradictory, for example you aren't supposed to think of the Bye Bye Man; so why on earth in one scene is the main character shouting in his car 'Bye Bye'? The acting is absolutely horrendous, to be fair the lead guy is trying and isn't that awful. The best friend however is so wooden and the girlfriend is absolutely dreadful. The directing is terrible as the film looks like it was made for about $2. The from isn't scary it's just very boring and is full of cheap jump scares and dreadful 'suspense'. This film also has some of the worst cgi I've seen in quite a while, especially the Bye Bye Man's weird dog. The only real positives are that the opening scene is semi decent and the film is destined to become a so bad it's good film in years to come. However the Bye Bye Man is a dreadful film and one of the worst horror movies I've seen in a while. D",
            "review_date": "2017-03-29",
            "source": "rt"
        },
        {
            "content": "Worst horror movie since 2012!!!!!",
            "review_date": "2017-03-28",
            "source": "rt"
        },
        {
            "content": "Awful movie. Combining a few strong aspects from better movies and combining them with every cliche imaginable for the genre, this is a dull, bizarrely paced, unscary, bland, poorly directed and supported by uninteresting performances.",
            "review_date": "2017-03-26",
            "source": "rt"
        },
        {
            "content": "The perfect example of a good idea badly executed.",
            "review_date": "2017-03-03",
            "source": "rt"
        },
        {
            "content": "I can honestly say that this film had so much potential, however the writers and producers didn't take the story into enough consideration. I loved this movie about 80 to 90% of the time, but the fact that it didn't have a backstory behind it (other than explaining it's past with Redmon's experience) caused me to lose interest. Overall, The Bye Bye Man was done well in the aspect of horror, but lacked immense story.",
            "review_date": "2017-02-28",
            "source": "rt"
        },
        {
            "content": "Another movie, i'll never see, because after seeing some scenes from the trailer, just no. You already know what's going to happen. The trailer already shows you the full movie. A slender man, bloodymary, candyman rip off. Not taking my money.",
            "review_date": "2017-02-24",
            "source": "rt"
        },
        {
            "content": "Original story line, but not really scary.",
            "review_date": "2017-02-19",
            "source": "rt"
        },
        {
            "content": "Same old, same old, except that the \"hero\" is a dood. It's been a while.",
            "review_date": "2017-02-18",
            "source": "rt"
        },
        {
            "content": "jump scares. not horrible.",
            "review_date": "2017-02-17",
            "source": "rt"
        },
        {
            "content": "Not a bad movie, a little off at times but not too bad of a movie.",
            "review_date": "2017-02-16",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man starts out with a darn good kick to the face (and door). The lightening choices and camera angles make it immediately obvious you're looking at a flashback to a time gone by when neighborhoods bore a strong resemblance to Stepford-land - manicured lawns, bright boxy houses, pretty furniture and perfectly coiffed ladies. Into the happy silence enter mayhem. I won't give it away but I will say it was so very messed up that I was immediately excited for the remainder of the ride (yes, I know what that says about me and I'm fine with it). I literally \"cakes and pies\" clapped my hands.\n\nIt was a bit of the expected when the movie then transitioned to modern day and we meet our three main characters on a college campus but hey, it's a horror movie. What's this kind of thriller without a mix of college students? Three friends (a girl, her boyfriend and his best friend) decided to move into a house office campus because... it's off campus. Naturally the house they settle on is large, with a sprawling basement full of furniture and is creepy as all get out... so of course the first thing they do is throw a party.\n\nFrom this point the movie starts to slowly fall apart which is really unfortunate because the directing is really good and there was sooooo much potential for the scary. The story gets rushed forward and moments that could've heighten the suspense and tension to ultimately scare the bejezzus out of everyone (seriously there's this scene with two little doors and a kid that had me yelling \"oh HEEEELLLL NO\" at the screen) didn't hold the thread. There were several ironic song references and moments of macabre comedy that carried the movie and looked like it would get it back on track few times but ultimately the story was just rushed. This house even has a hallway just begging someone to say \"come play with us\" standing at one end.\n\nThe Bye Bye Man is a pretty unique origin story-once you get past the name-for its boogie man. It's actually a pretty freaky and believable concept-in the I believe in scare folktales as fact kind of way-but it settled for standard (poorly plotted) genre tricks to play out its story on screen and that choice seriously short changes the audience.\n\nSo instead of an increasingly spine-chilling movie you get one with fits and starts of good suspenseful moments to rushed dialogue to really well executed turmoil and confusion, to over emoting that fails to build tension to typical horror gimmicks (there's a séance and everything) and poorly timed music shifts right to the obvious open-ended conclusion leaving the door open for the boogie man's possible return.\n\nFor the most part, the cast wasn't too bad except for the lead actress, Cressida Bonas, who played Sasha. That bit of casting was an all-around bad call. She doesn't sell her role in this flick at all. From beginning to end it felt like she was still giving a table read (and a first week of read at that) and her affect when things were supposed to be dramatic or scary was seriously off; as in dead.\n\nThere were highlight performances, one in particular is Cleo King as Mrs. Watkins the librarian. She played her role with wit, flair and subtly. She lost her shit with a peppy note in her voice and bounce in her step. Not to mention, her death was all kinds of jacked up - as it should be, she's the LIBRARIAN. Another honorable mention, the Widow Redmon, played by Faye Dunaway was rather well done. I was whole-heartedly behind her solution to these kids' problem and her introduction returned the movie to the past- and more excellently performed murderous shenanigans. Although, I'd like to point out here, there wasn't nearly enough blood given the number of bodies on the ground.\n\nThe director, Stacy Title, did her thing as well as could be done I suppose, but she really didn't have a good enough script to work with.\n\nI love horror movies; good ones, bad ones; big budget, low budget, studio or indie. I'm always down to give a flick the chance to scare the ever-loving crap out of me or just leave me with paranoid dreams and conspiracy theories (it's happened, let's not discuss it). I'm particularly fond of the boogie man troupe (I don't know why... blame Clive Barker) and the many ways writers and directors find to bring new interpretations of these folktales to life. I'm also very forgiving of movie titles. Because at the end of the day, it's all about the scare factor. I'm sad to say it but The Bye Bye Man is just ok; as in the shoulder shrug \"eh\" kind of ok.\n\nIt's a shame because any movie that includes its characters having wicked detailed and realistic hallucinations and someone taking a vigorously swung bat to the head, could've been something great.",
            "review_date": "2017-02-14",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man starts out with a darn good kick to the face (and door). The lightening choices and camera angles make it immediately obvious you're looking at a flashback to a time gone by when neighborhoods bore a strong resemblance to Stepford-land - manicured lawns, bright boxy houses, pretty furniture and perfectly coiffed ladies. Into the happy silence enter mayhem. I won't give it away but I will say it was so very messed up that I was immediately excited for the remainder of the ride (yes, I know what that says about me and I'm fine with it). I literally \"cakes and pies\" clapped my hands.\n\nIt was a bit of the expected when the movie then transitioned to modern day and we meet our three main characters on a college campus but hey, it's a horror movie. What's this kind of thriller without a mix of college students? Three friends (a girl, her boyfriend and his best friend) decided to move into a house office campus because... it's off campus. Naturally the house they settle on is large, with a sprawling basement full of furniture and is creepy as all get out... so of course the first thing they do is throw a party.\n\nFrom this point the movie starts to slowly fall apart which is really unfortunate because the directing is really good and there was sooooo much potential for the scary. The story gets rushed forward and moments that could've heighten the suspense and tension to ultimately scare the bejezzus out of everyone (seriously there's this scene with two little doors and a kid that had me yelling \"oh HEEEELLLL NO\" at the screen) didn't hold the thread. There were several ironic song references and moments of macabre comedy that carried the movie and looked like it would get it back on track few times but ultimately the story was just rushed. This house even has a hallway just begging someone to say \"come play with us\" standing at one end.\n\nThe Bye Bye Man is a pretty unique origin story-once you get past the name-for its boogie man. It's actually a pretty freaky and believable concept-in the I believe in scare folktales as fact kind of way-but it settled for standard (poorly plotted) genre tricks to play out its story on screen and that choice seriously short changes the audience.\n\nSo instead of an increasingly spine-chilling movie you get one with fits and starts of good suspenseful moments to rushed dialogue to really well executed turmoil and confusion, to over emoting that fails to build tension to typical horror gimmicks (there's a séance and everything) and poorly timed music shifts right to the obvious open-ended conclusion leaving the door open for the boogie man's possible return.\n\nFor the most part, the cast wasn't too bad except for the lead actress, Cressida Bonas, who played Sasha. That bit of casting was an all-around bad call. She doesn't sell her role in this flick at all. From beginning to end it felt like she was still giving a table read (and a first week of read at that) and her affect when things were supposed to be dramatic or scary was seriously off; as in dead.\n\nThere were highlight performances, one in particular is Cleo King as Mrs. Watkins the librarian. She played her role with wit, flair and subtly. She lost her shit with a peppy note in her voice and bounce in her step. Not to mention, her death was all kinds of jacked up - as it should be, she's the LIBRARIAN. Another honorable mention, the Widow Redmon, played by Faye Dunaway was rather well done. I was whole-heartedly behind her solution to these kids' problem and her introduction returned the movie to the past- and more excellently performed murderous shenanigans. Although, I'd like to point out here, there wasn't nearly enough blood given the number of bodies on the ground.\n\nThe director, Stacy Title, did her thing as well as could be done I suppose, but she really didn't have a good enough script to work with.\n\nI love horror movies; good ones, bad ones; big budget, low budget, studio or indie. I'm always down to give a flick the chance to scare the ever-loving crap out of me or just leave me with paranoid dreams and conspiracy theories (it's happened, let's not discuss it). I'm particularly fond of the boogie man troupe (I don't know why... blame Clive Barker) and the many ways writers and directors find to bring new interpretations of these folktales to life. I'm also very forgiving of movie titles. Because at the end of the day, it's all about the scare factor. I'm sad to say it but The Bye Bye Man is just ok; as in the shoulder shrug \"eh\" kind of ok.\n\nIt's a shame because any movie that includes its characters having wicked detailed and realistic hallucinations and someone taking a vigorously swung bat to the head, could've been something great.",
            "review_date": "2017-02-14",
            "source": "rt"
        },
        {
            "content": "One of the worst movies of 2017! The Bye Bye Man is one of the most atrocious and idiotic horror films I've seen in my life, and the only thing going \"Bye Bye!!\" are everybody involved in this movie!!! 0/5 stars!",
            "review_date": "2017-02-10",
            "source": "rt"
        },
        {
            "content": "This was the worst movie ever",
            "review_date": "2017-02-09",
            "source": "rt"
        },
        {
            "content": "I didn't want to see this until my friend suggested some of us all go on opening night. I wasn't expecting a phenomenal 10/10 movie and that's definitely not what I saw. But i wasn't disappointed, the movie had a pretty steady plot that was easy to follow and a few jumpscares that make you laugh afterwards. I left the theater satisfied but not scared which is fine that wasn't my goal. Like all horror movies, it was cliche and cheesy but some parts did leave me on the edge of my seat.",
            "review_date": "2017-02-09",
            "source": "rt"
        },
        {
            "content": "The jump scares were solid",
            "review_date": "2017-02-05",
            "source": "rt"
        },
        {
            "content": "The bye-bye man wasn't an outstanding film but it sure did have a number of jumpscares and a nice cliffhanger",
            "review_date": "2017-02-05",
            "source": "rt"
        },
        {
            "content": "If you're looking for some fresh horror with hair-raising chills and an engaging mystery at it's core, look elsewhere.  Those seeking an insipid story with more baffling moments than scares and acting both shockingly dull and hilariously over the top, this may be for you.",
            "review_date": "2017-02-04",
            "source": "rt"
        },
        {
            "content": "love the movie ending could have been a little better",
            "review_date": "2017-02-03",
            "source": "rt"
        },
        {
            "content": "First scene was cool! The rest of the movie...",
            "review_date": "2017-02-02",
            "source": "rt"
        },
        {
            "content": "Wow!\nDidn't think ppl could Act  so bad especially that Cressida Bonas....\nShe should stick to socializing lol\nLame story line too lol",
            "review_date": "2017-01-31",
            "source": "rt"
        },
        {
            "content": "I think it was kind of decent in some parts. The Bye Bye Man had a cool concept but i feel that they went about it wrong. One of the major turn-offs for this movie was the name for me and my friends; we actually went to see this movie because of the sheer ridiculousness of the name alone. I find that most of the acting was decent but the characters were badly written. The girlfriend of Elliot seemed distant in the entire film but i think the actor that played Elliot was phenomenal. I could really get that \"I'm slowly going insane\" vibe from his performance. The ending was unexpected but the reactions towards the end of this movie were very dull. I find that my two favorite characters in the movie were the female police officer and Elliot. The movie wasn't as bad as i thought it would be, but it wasn't exactly good either. all in all i would probably re-watch this movie sometime in the future but it hasn't become a favorite for me.",
            "review_date": "2017-01-31",
            "source": "rt"
        },
        {
            "content": "Stacy Title's 'The Bye Bye Man' (2017) is the funniest comedy I've watched in a long time. I know this film is supposed to be a horror film, but throughout, I was in hysterics watching this poorly acted monstrosity. Honestly though, I'd recommend 'The Bye Bye Man' if you want to laugh at an awful film that fails on most levels. The only slightly redeeming feature is Doug Jones' performance, he does his job effectively, though the film surrounding his performance is pathetic.",
            "review_date": "2017-01-31",
            "source": "rt"
        },
        {
            "content": "anyway to put negative stars?",
            "review_date": "2017-01-29",
            "source": "rt"
        },
        {
            "content": "Well ok but doesn't make any sense",
            "review_date": "2017-01-29",
            "source": "rt"
        },
        {
            "content": "wish there was a negative star rating. Bye bye the money wasted on this movie. The only good thing about this movie was the popcorn.",
            "review_date": "2017-01-29",
            "source": "rt"
        },
        {
            "content": "Movie was good. Some parts were cliche... Decent actors. I would reccomend seeing it.",
            "review_date": "2017-01-29",
            "source": "rt"
        },
        {
            "content": "Don't say it. Don't think it. Don't say it. DON'T WATCH IT!  The Bye Bye Man tries to smash every little trope from better horror film and gives us an unoriginal and poorly acted film that really lacked real satisfying scares. When I saw The Bye Bye Man I felt as if I was watching a Babadook ripoff that was made by a middle school student trying to pass his theatre class. Don't waist your money with this film and go see Split instead of this shit.",
            "review_date": "2017-01-28",
            "source": "rt"
        },
        {
            "content": "Very slow. Very dumb theme. Waste of money.",
            "review_date": "2017-01-28",
            "source": "rt"
        },
        {
            "content": "The only possible defence for this movie is at least it wasn't found footage...",
            "review_date": "2017-01-28",
            "source": "rt"
        },
        {
            "content": "Complete Dumpster Fire",
            "review_date": "2017-01-27",
            "source": "rt"
        },
        {
            "content": "this was actually enjoyable to me",
            "review_date": "2017-01-27",
            "source": "rt"
        },
        {
            "content": "That was just pitiful",
            "review_date": "2017-01-26",
            "source": "rt"
        },
        {
            "content": "that was a really dumb movie not really worth it !",
            "review_date": "2017-01-25",
            "source": "rt"
        },
        {
            "content": "Considering the bad reviews, a friend and I went seeing this for fun and some laughs. Somehow, we both ended up being genuinely invested, scared, and excited by this movie.\nDon't get me wrong, this movie was not perfect and had a few seriously cheesy moments (and the CGI on the dog monster was distractingly poor). Some of the actors were rather stale as well. However, with an excellent and involving performance from Douglas Smith, great suspense, fun mind-screwiness, some quite scary moments, and a truly freaky myth at its core, The Bye Bye Man really surprised me.",
            "review_date": "2017-01-25",
            "source": "rt"
        },
        {
            "content": "It wasn't till the first 10 to 15 minutes of the film that I start to feel kind of stupid watching this movie....I mean the general idea of this film is kind of stupid and forced... in hindsight the \"Ring\" is more of a believable story then this film. At least it's based on a vengeful spirit....this movie feels like it was created by a bunch of six-year-old's having a sleepover....sigh",
            "review_date": "2017-01-25",
            "source": "rt"
        },
        {
            "content": "It's really cliché, teens go into house things start to happened.\neither I missed it but they don't explain how the Bye Bye Man was created or why he kils, the trailer was the best thing about this don't see it don't watch it",
            "review_date": "2017-01-25",
            "source": "rt"
        },
        {
            "content": "Terrible premise to the movie, with weak a climax, and very poor acting... special effects have there moments but for the most part are very cheesy and unbelievable 1/10",
            "review_date": "2017-01-25",
            "source": "rt"
        },
        {
            "content": "this was a good horror film with a good way of how it messes with the people",
            "review_date": "2017-01-25",
            "source": "rt"
        },
        {
            "content": "It wasn't even that scary. The trailers made it seem scary but it wasn't at all.",
            "review_date": "2017-01-24",
            "source": "rt"
        },
        {
            "content": "I liked this movie for what it is; a suspenseful horror movie without all the gore.  If you are hung up on character development then you will not like this movie.  This is a story driven movie with an interesting plot.",
            "review_date": "2017-01-24",
            "source": "rt"
        },
        {
            "content": "Got through 2/3 of the film and walked out. I reemmbered I had a library book over due, and returning the book seemed like a more interesting thing to do than watch the rest of this horrible third rate slipshod piece of junk. If Niel Breen had directed this, I would have understood, but no - this atrocity against culture was devised by some other dull gang of incompetents.",
            "review_date": "2017-01-24",
            "source": "rt"
        },
        {
            "content": "I really enjoyed this movie.  It seemed to have a deeper meaning about spoken and written words and never be undone. my issue with it is that it seemed like it was set in the early 2000s.  Needing to do research on the library computer, 19 year olds with a land line, and college students taking notes with a pen and paper...but all in all this was one of the better horror movies that have come out in a while.",
            "review_date": "2017-01-23",
            "source": "rt"
        },
        {
            "content": "for me this was a solid three stars.  it reminded me a lot of an older  4 star movie - but saying more would spoil the fun",
            "review_date": "2017-01-23",
            "source": "rt"
        },
        {
            "content": "I bought the setup and appreciated its gradual character development, but it falters from having an overall tone of creepiness and never creating a truly scary villain or a sequence or set of set pieces that are intense enough to give you goosebumps. It's easy to tell the script was written with no ending in mind and while the acting isn't bad, the dialogue and logic they display is. Not bad, but nothing memorable either.",
            "review_date": "2017-01-23",
            "source": "rt"
        },
        {
            "content": "made no sense, just dumb.",
            "review_date": "2017-01-22",
            "source": "rt"
        },
        {
            "content": "The movie was not very scary at all. Don't waste your money.",
            "review_date": "2017-01-22",
            "source": "rt"
        },
        {
            "content": "If I could rate with no stars it would of been easier. Don't waste your money",
            "review_date": "2017-01-22",
            "source": "rt"
        },
        {
            "content": "I considered this film more like a comedy. I just laughed out loud for how stupid it was. It uses elements from totally better horror films and doesn't even use it right. Don't say it, don't think it and don't even watch it.",
            "review_date": "2017-01-22",
            "source": "rt"
        },
        {
            "content": "The acting was terrible. So we're the lines half the time. There were so many plot holes it bothered me. The name of the guys is ridiculous, I didn't even want to see it but my sister did. Why are people afraid of him, he just freaks you out? What's worse, everything about the ending screamed sequel",
            "review_date": "2017-01-22",
            "source": "rt"
        },
        {
            "content": "I gave it half a star because I paid to watch a movie, and that was delivered. That's the only thing it had going for it. The poster is scarier than the film.",
            "review_date": "2017-01-21",
            "source": "rt"
        },
        {
            "content": "Imagine a toothless German Shepherd.  That is this film.",
            "review_date": "2017-01-21",
            "source": "rt"
        },
        {
            "content": "I thought it was actually funny how not scary this was. I laughed the entire time.",
            "review_date": "2017-01-21",
            "source": "rt"
        },
        {
            "content": "What a disaster. This film is awful. The acting is a joke it's not scary and it's boring. Some bits made me laugh just because of how stupid they were",
            "review_date": "2017-01-21",
            "source": "rt"
        },
        {
            "content": "Eh... I wish they would have explained more.  It was creepy, though.  They are clearly setting it up to have sequels.",
            "review_date": "2017-01-21",
            "source": "rt"
        },
        {
            "content": "utter shit. worst movie of 2017 and its only January. we have a winner",
            "review_date": "2017-01-21",
            "source": "rt"
        },
        {
            "content": "I'm glad I don't pick my movies based on reviews :)  I went in thinking this was going to be really dumb but it was actually a good old fashioned horror movie.  The acting quality was lacking but the movie was pretty good.",
            "review_date": "2017-01-21",
            "source": "rt"
        },
        {
            "content": "This movie was horrendous. I had free tickets and I still think I deserve a refund. Everything from the dull, lifeless, talentless actors, to the lack of story line . I could go on and on about and how bad it was . I wish I could give zero stars.",
            "review_date": "2017-01-20",
            "source": "rt"
        },
        {
            "content": "I had a free ticket so I used it on bye bye man. Glad I didn't pay for this but it was good for a few good scares. Story never developed and we learn nothing about bye bye man so that kind of sucked. Just me and one other nerd in the theater. The hot dog from the concession stand was the best part.",
            "review_date": "2017-01-20",
            "source": "rt"
        },
        {
            "content": "It was not even that \"scary\"",
            "review_date": "2017-01-20",
            "source": "rt"
        },
        {
            "content": "I liked the idea of the film but I only went to see it because I wanted to watch a scary film, but everything was predictable",
            "review_date": "2017-01-20",
            "source": "rt"
        },
        {
            "content": "the story is pretty good I was never bored and I was interested.\n\ncharacters are alright I didn't care much about the supporting characters I cared most for the main character since he got the only development you learn a decent amount about the bye bye man. \n\nThe movie has a couple jump scares and it's a little creepy isn't scary unfortunately but I enjoyed it.",
            "review_date": "2017-01-20",
            "source": "rt"
        },
        {
            "content": "it will keep you up at night",
            "review_date": "2017-01-19",
            "source": "rt"
        },
        {
            "content": "Bad acting, horrible script, and stupid jump scares,  This movie is a classic case of a January film.",
            "review_date": "2017-01-19",
            "source": "rt"
        },
        {
            "content": "Copy of Nightmare on Elm Street, antagonist is bland, stupid protagonists",
            "review_date": "2017-01-19",
            "source": "rt"
        },
        {
            "content": "'The Bye Bye Man' is a lazy, boring and predictable film that seems like a collection of random, badly acted and completely scare less scenes.",
            "review_date": "2017-01-18",
            "source": "rt"
        },
        {
            "content": "A film with some good horror moments but poor pacing and just gets ridiculous by the end",
            "review_date": "2017-01-18",
            "source": "rt"
        },
        {
            "content": "Stupid horror film does not even keep my brother(who loves dumb horror films) awake.",
            "review_date": "2017-01-18",
            "source": "rt"
        },
        {
            "content": "Not only did this movie add absolutely nothing to the horror/possession genre, it completely lacked any originality. It took (stole, really)  ideas from better horror movies, added them to a very weak script that added up to nothing more than an incoherent and badly acted movie that was totally predictable and VERY short on scares. Cressida Bonas  should be VERY happy that the Razzie's have already made their nominations, because her weak and underwhelming performance in this movie would TOTALLY deserve one.",
            "review_date": "2017-01-18",
            "source": "rt"
        },
        {
            "content": "Not a bad film to catch on a Tuesday night, pretty interesting",
            "review_date": "2017-01-18",
            "source": "rt"
        },
        {
            "content": "Horrible! Absolutely a waste of time. I was ready to walk out half way through this awful movie. My wife however tortured me into watching all of it. It's 2 hours of my life I will never get back. Who ever made this movie, PLEASE stop making horror movies.",
            "review_date": "2017-01-18",
            "source": "rt"
        },
        {
            "content": "I am pleased with how different it was to other scary stories, I just wish it didn't leave us hanging. Such as how did he become the Bye Bye Man, what was up with the train, and what the heck was up with the people on the train tracks. If it explained more, I would have given a higher rating.",
            "review_date": "2017-01-18",
            "source": "rt"
        },
        {
            "content": "The Pee Pee Poo Poo man is the best film I've ever watched. And I'm not saying that just because I'm dating The Pee Pee Poo Poo man. Great documentary. Love you babe.",
            "review_date": "2017-01-18",
            "source": "rt"
        },
        {
            "content": "1/5.  I wanted The Bye Bye Man to be good, but it isn't.  Don't think it, don't say it, don't see it.",
            "review_date": "2017-01-17",
            "source": "rt"
        },
        {
            "content": "I don't understand the terrible reviews.  Better than average horror flick.  Don't say it!  Don't think it!",
            "review_date": "2017-01-17",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man is a decent excursion that is senseless and unscary.",
            "review_date": "2017-01-17",
            "source": "rt"
        },
        {
            "content": "This was terrrible! It should have been longer! It didn't really have any scary events. I'm just upset that I spent my money on this bullish & I should have waited until it hit redbox or Netflix. Disappointed",
            "review_date": "2017-01-17",
            "source": "rt"
        },
        {
            "content": "\"The Bye Bye Man, like the unprepared student is good for the occasional laugh, but sometimes you have to wonder if it causes more harm than good.\" \nRead more at: http://horrorriley.blogspot.com/2017/01/review-bye-bye-man_76.html?m=1",
            "review_date": "2017-01-17",
            "source": "rt"
        },
        {
            "content": "For all the criticism this film has received, it had incredible turnout it's opening weekend for a picture not backed by a major studio. Even oscar-caliber films are criticized for every inconceivable flaw, and what is silly is how much criticism this  film is receiving when it is the combined efforts of two underground artists, a director and a writer, who happen to be married, and who also happened to get their picture not just produced, but edited, budgeted, and displayed to sold-out showings across the country, which is remarkable, considering it is a thriller/slasher/horror genre film being released in an off season for that genre.\n\nThe builds are dynamic, not just in plot, but in each character. Though the supporting characters do not have detailed back stories like that of the protagonist's, they are just as relatable, which makes for a symphony of interacting stories and perceptions between all four of the main characters as they begin to lose their ability to distinguish between reality and insanity. \nThe detailed shots took nothing for granted; the smallest of intricacies were honored, and pacing was playfully anticipatory and individual. Every once in a while you would get a very \"Lynchian\" or \"Kubrick\" style-shot, with enlongated sequences that had everyone in the theater holding their breath, waiting for something to pop out, as you follow this little girl, or follow this person into the dark. The pacing was such that you could never predict when things were going to happen, which to me, is a benchmark of a good horror film.\nThe jumps were not relied upon, but rather planned so carefully, that for rows in front of me, I could see the entire theater jump, and sometimes people even let out shocked bloodcurdling screams. The ending left people gasping, and what was remarkable to me was that even after the major plot twist (which is brilliantly crafted, in writing, and in the shot itself), the ending is still done in a way that leaves the viewer biting their nails, begging the protagonist to be strong, as if they were in his shoes themselves. \nThese \"plot holes\" people are describing are actually brilliantly placed. Whether it is the legend of the slender man, or the boogyman, or whatever it be; the mystery of the title character is what makes him the epitome of human terror: he is only personified through the perspective of the person witnessing his presence, and since fear is a product of only our mind's worst imagination of unknowns, I think this film in fact does exemplary justice to the fear category of film making. What cannot be denied is that in the smallest details of this film there is unparalleled symbolism, even the professor's small speech in the background of one character's building nightmare has dialogue that contains key and often overlooked plot points and brilliant writing that only adds to the detailed symbolism of this film that speaks so much to the nature of the concept of fear. I won't spoil any surprises, but I will say that this story displays how effectively fear works on the strength of a human mind. It is compelling storytelling that has you hoping as if you were in the main character's shoes, trying with all your might to be as mentally strong as to overcome your own sanity. Despite the fact that this was the lovechild of two artists who actually made a film happen, it's a film that stands, for every detail from it's writing to it's character builds to it's cinematic excellence. Highly underrated effort, and a beautiful homage to classic horror/slasher genre. I highly recommend giving The Bye Bye Man a chance, don't believe everything you read online, everyone loves to criticize, but so few people consider all factors of what makes a film worth watching.",
            "review_date": "2017-01-17",
            "source": "rt"
        },
        {
            "content": "Enjoyable. Would watch again!",
            "review_date": "2017-01-17",
            "source": "rt"
        },
        {
            "content": "decent horror film, but nothing to original done here. poor cgi.",
            "review_date": "2017-01-17",
            "source": "rt"
        },
        {
            "content": "I knew it was going to be bad from the title alone, but I could not have expected it to be so offensive to the intelligence of its audience. There was absolutely no innovation in terms of monster design or special effects (unless you count a hellhound that greatly resembles a particularly watery hunk of meat loaf among creative creature designs), absolutely no scares, and nothing even approaching a coherent plot; the entire flick reeks of Hollywood horror cash-in a la The Forest. An absolutely abysmal excuse for a film, let alone something that was supposed to inspire fear in its viewers. The most terrifying thing about it was a combination of the incomprehensible stupidity of the dialogue and the lackluster performances by... well, everyone involved in production. If there were any attempts made at creating tension within the story, they were obliterated by hackneyed execution and dialogue so inscrutable and cringe-worthy, I'm half convinced that it was written entirely by AI. And if the dialogue and writing weren't bad enough, the cinematography may very well give you an aneurysm. There exist found footage films that have a steadier handle on their camera's movements. Just wait for The Bye Bye Man to come out on DVD and give it a rent if you want to have a good laugh. Otherwise, I can't recommend spending your money on this wretched thing in good conscience.",
            "review_date": "2017-01-16",
            "source": "rt"
        },
        {
            "content": "Not scary. Dumb from beginning to end. Horrible script with dialogue that really never seems to be anything but exposition and when it's not exposition it's just nonsense. Weak start 2017.",
            "review_date": "2017-01-16",
            "source": "rt"
        },
        {
            "content": "As a horror film fanatic I went to see this movie. Also as a horror fanatic I am giving it a low rating as it is a horror film with a lack of story line and substance. The Bye Bye man has quite literally no horror in it whatsoever and has a total of around two attempted jump scares. Overall this film was badly written, characters had zero development and zero acting skills.Generally in horror films there is some development or knowledge to the antagonistic character of the film to give reason to who or what they are and why they do whatever it is they do. WHO IS THE BYE BYE MAN? Nobody knows as it isn't explained in a film which has his name for the title. This film is a prime example of how modern 'horror' directors believe they can call it a horror film just because they add jump scares. Poor effort.",
            "review_date": "2017-01-16",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man is a horror/thriller film that asks the question, \"Why do good people do bad things?\". \n\nWhat The Bye Bye man does interestingly is give us a horror story, where the monster itself is not actually killing or slaying anybody, but rather, is pushing us humans into atrocities. This could easily be seen as a metaphor for 'the evil inside us all', and at its surface sounds quite interesting, the only problem is, this film does not do it particularly well.\n \nThe acting is OK I guess, but oftentimes comes across like the film didn't have enough money to reshoot some scenes that were not up to par. One scene in particular is when Elliot and Sasha are on campus and have the lamest 'goodbye I love you' moment I have ever seen on screen. The other big issue with the film is that it is just sort of boring. The movie tries to create a creepy and compelling vibe, but oftentimes I just felt bored and uninterested in the characters. Worst of all, I walked out of the film, feeling as if it was longer than the time it actually ran, never a good sign.\n \nI will say however, that this movie didn't rely on jump scares nearly as much as I am used to with these horror movies, and at least put forth an effort into creating a good tone.\n \nAll in all, The Bye Bye Man is a standard January horror flick, cheesy, uninteresting, and poorly acted, but unlike most other January horror films, seems like it was at least putting forth an effort, even if the result wasn't always there. With all of that being said, I rate the film a 49/100, or 4.9/10 because I just can't force myself to say this film was good.",
            "review_date": "2017-01-16",
            "source": "rt"
        },
        {
            "content": "PG-13 scary movies usually fall short from being scary but this one takes the title. Scary to know why was this even made?",
            "review_date": "2017-01-16",
            "source": "rt"
        },
        {
            "content": "The Bye-Bye Man... That is the DUMBEST name I have ever heard. I don't care how scary looking he is, I can not get past that name. I know what they were trying to do, use childhood innocence in a creepy setting and sometimes that works like with a killer doll or a lullaby being sung in a dark hallway but their is a certain place were you need to stop and baby words like bye-bye is that place that crosses the line. It's not scary, it's silly.",
            "review_date": "2017-01-16",
            "source": "rt"
        },
        {
            "content": "This is the worst horror film I've seen in 3 years, worse than movies like Incarnate, Ouija, and Devil's Due. Doug Jones' talent was put to waste here and the other actors are so terrible, even Carrie-Anne Moss phones it in. The ending doesn't have one last jump-scare, but it does have something even worse...it hints at potential sequels.",
            "review_date": "2017-01-16",
            "source": "rt"
        },
        {
            "content": "Negative impulses can be a real challenge to control, while controlling negative thoughts can seem impossible - a very unnerving prospect. The simple act of trying not to think about something probably means that you are still thinking about it - or that the undesirable thought is lurking just beneath the surface of your conscious focus. That's what makes the premise of the supernatural horror thriller \"The Bye Bye Man\" (PG-13, 1:36) interesting. If an evil entity will appear or gain control of your perceptions of the real world, and your will, if you merely think his name, then you're probably fighting a losing battle. And you can't even warn others about the danger because saying his name is just as bad as thinking it. \n\nIn an otherwise quiet suburban neighborhood on a sunny day in 1969, a man continuously repeats the words \"Don't think it. Don't say it,\" as he retrieves a shotgun from the trunk of his car. He proceeds to shoot several family members and neighbors in order to \"save\" them from an unseen entity known as \"The Bye Bye Man\". The ordinary-looking gunman feels that he has to eliminate those who have learned the name or spoken it to anyone else. After his bloody rampage, he then puts himself out of his misery.\n\nJump to the present day in that same neighborhood. Three college students, boyfriend-girlfriend Elliot (Douglas Smith) and Sasha (Cressida Bonas), and their mutual friend, John (Lucien Laviscount), move into an old, rundown house that they have rented off campus. As they move the furniture which comes with the house up from the basement, they fail to notice that inside the drawer of a small end table, someone has written \"Don't think it. Don't say it,\" in concentric circles. The students do notice that a coin keeps falling to the floor and spinning and that the house is always cold. This leads Elliot to go do some research at the library where a helpful librarian (Cleo King) helps unravel the house's forgotten past. The students also ask a \"spiritual sensitive\" friend named Kim (Jenna Kanell) to conduct a séance. \n\nThe process of learning about this mysterious \"Bye Bye Man\" results in his name being thought about and spoken out loud, which makes him appear - and allows him access to the minds of those who know his name. The Bye Bye Man is a gaunt and ghostly man dressed like the grim reaper (and played by Doug Jones) and is accompanied by a ghastly hellhound. When inside the heads of his victims, he makes them see things that aren't there, prompting them to do things they weren't normally do... with horrifying results. A police detective (Carrie-Anne Moss) becomes involved when things get out of hand, but it's nearly impossible for her to be of any help when those who know what is going on can't tell her about it.\n\nUnfortunately, \"The Bye Bye Man\" fails to live up to the potential of its original and frightening premise, the whole thing seeming random and inconsequential. This movie is based on one chapter of Robert Damon Schneck's non-fiction book \"The President's Vampire\" and is supposedly a true story. With that kind of background, screenwriter Jonathan Penner should've been able to set up the plot more effectively - and written action and dialog that makes sense. And director Stacy Title should've been able to make the movie scarier. And the acting could've been a lot better. And if someone suggests that you come along to see this film, just repeat the main character's name back to them and walk away. \"D\"",
            "review_date": "2017-01-16",
            "source": "rt"
        },
        {
            "content": "Very typical of the genre.  Less gore than normal.  May be a good option for tweens looking to cut their teeth on a horror movie, but can't get in to see an R rated one.  Freaky more than scary... but only a 5/10 on the scare-meter.",
            "review_date": "2017-01-16",
            "source": "rt"
        },
        {
            "content": "Terribly boring and not even funny bad, I felt cheated. I admired the premise, but not the name. Its also sad that Doug Jones is the demon. Smh.",
            "review_date": "2017-01-16",
            "source": "rt"
        },
        {
            "content": "Not bad at all. People complain way too much.",
            "review_date": "2017-01-15",
            "source": "rt"
        },
        {
            "content": "4.5/10\n~January 15, 2017~",
            "review_date": "2017-01-15",
            "source": "rt"
        },
        {
            "content": "It's just OK. Not terrible.",
            "review_date": "2017-01-15",
            "source": "rt"
        },
        {
            "content": "8/10 one of the best comedies I've seen this year. The funniest part was thinking that anyone could ever think that a horror movie called \"The Bye Bye Man\" could ever be viewed as a good movie. The only horror in the movie were sudden jumpscares with loud music. The movie was a bigger trainwreck than when Kim died.",
            "review_date": "2017-01-15",
            "source": "rt"
        },
        {
            "content": "Movie was very poorly written . I cannot believe this movie made it to theaters. I don't know how the bye bye man had anything to do with the movie . I was not able to become emotionally attached to any of the characters in the movie because they were not shown on screen that much . All I am left with is what the fuck happened. Terrible .",
            "review_date": "2017-01-15",
            "source": "rt"
        },
        {
            "content": "I think most of us horror fans judge newer scare-flicks the same way.. with lines like \"well, it's not the worst horror movie I've seen recently.\" That about sums up The Bye Bye Man... I've seen worse, I've seen better. It's moderately entertaining, but ultimately forgettable and the fabricated visuals fluctuate from \"fine\" to \"that was clearly fake\" throughout. Oh... and definitely don't go in looking for a story, because there's only a thread of one here.",
            "review_date": "2017-01-15",
            "source": "rt"
        },
        {
            "content": "Awful. Just awful. I'd give it negative stars if I could.",
            "review_date": "2017-01-15",
            "source": "rt"
        },
        {
            "content": "Its has about 3 good scenes and that's it. Its a long, boring, and wholly unsatisfying film. \nGrade: F",
            "review_date": "2017-01-15",
            "source": "rt"
        },
        {
            "content": "So many unanswered questions about this movie. Basically it didn't make sense...",
            "review_date": "2017-01-15",
            "source": "rt"
        },
        {
            "content": "movie was amazing. great story and cinematography. going to definitely see it again and buy it on blu ray. fantastic flick. it shows that you can have an original idea and still be good.",
            "review_date": "2017-01-15",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man wants to pinpoint its eponymous character to the genre's upper echelon of terror titans, but he's let down by amateurish writing, predictable jump scares, gore-free violence and an intriguing backstory stretched too thin.",
            "review_date": "2017-01-15",
            "source": "rt"
        },
        {
            "content": "Was ok, few jumpy bits but not that scary",
            "review_date": "2017-01-15",
            "source": "rt"
        },
        {
            "content": "Such a bad quality film I don't know how it got to box office",
            "review_date": "2017-01-15",
            "source": "rt"
        },
        {
            "content": "Not worth your money or time....",
            "review_date": "2017-01-14",
            "source": "rt"
        },
        {
            "content": "Cheesy Dialogue and A lack of scares, The Bye Bye Man settles in as another cheap horror movie.",
            "review_date": "2017-01-14",
            "source": "rt"
        },
        {
            "content": "What it lacks in plot, it makes up for in atmosphere. This Craven-esque boogeyman, has a way of getting under your skin. Not perfect, but it manages to pull off a few creepy sequences.",
            "review_date": "2017-01-14",
            "source": "rt"
        },
        {
            "content": "3.5 out of 5! The Bye Bye Man was far superior than any of James Wan's creatures from the Conjuring films or the insidious films.  Some of the mixing of the film was a bit off in some places but the overall psychological terror left me on the edge of my seat.  The younger generation doesn't seem to grasp that style of scariness anymore which is a shame.  But if your an avid horror fan who likes classic psychological horror, then this one is for you.  The hound, I'll admit was a laughable CGI effect that served no scariness to the film but I'm sure they'll improve some things in the sequel it sets itself up for.  It's a shame that horror films like this get such low ratings, when it's usually just a kind of scariness which is getting lost in the new generation.",
            "review_date": "2017-01-14",
            "source": "rt"
        },
        {
            "content": "I definitely had a couple late night visions of that guy, whose name we shouldn't say. Don't watch this and then think you're going to come home a sleep like a baby!",
            "review_date": "2017-01-14",
            "source": "rt"
        },
        {
            "content": "Well...the premise was used poorly. Straight to DVD",
            "review_date": "2017-01-14",
            "source": "rt"
        },
        {
            "content": "This movie was terrifying! Perfect for Friday the 13th. Interesting complete story and was impressed with the main character, Elliot, played by Douglas Smith and the way he portrayed a deranged young man trying to save humanity from further ruin. Go see it if you want to be scared!",
            "review_date": "2017-01-14",
            "source": "rt"
        },
        {
            "content": "Ain't gonna say it, not gonna think about it. \n\nRunning Time: 5\nThe Cast: 4\nPerformance: 5\nDirection: 5\nStory: 4\nScript: 4\nCreativity: 3\nSoundtrack: 3\nJob Description: 1\nThe Extra Bonus Points: 0\nBlu-ray: No. \n\n34% 3/10\n\nwww.spoileralertreviews.co.uk",
            "review_date": "2017-01-14",
            "source": "rt"
        },
        {
            "content": "Horrible movie. Hated it.",
            "review_date": "2017-01-14",
            "source": "rt"
        },
        {
            "content": "worst movie I've seen in a long time. bad acting and story. really bad nightmare on elm St rip off. it's January!!!!",
            "review_date": "2017-01-14",
            "source": "rt"
        },
        {
            "content": "wasn't as good as the previews",
            "review_date": "2017-01-14",
            "source": "rt"
        },
        {
            "content": "The worst movie I've ever seen. The ONLY redeeming value is the hilarious margin by which this horror movie missed the mark. As an incompetently self serious, poorly-acted, abysmally directed slog with amateur level production values and an infantile script \"The Bye Bye Man\"  is \"The Room\" of horror movies.",
            "review_date": "2017-01-14",
            "source": "rt"
        },
        {
            "content": "The only reason people are giving this bad ratings is because it wasnt insanely scary, so if thats all you want then I dont advise seeing it. However it had a very intriguing plot and a few really mind blowing moments. The whole movie keeps up a good pace as well. I do have some complaints though, first off a few of the really big parts towards the end didnt totally making sense, second of all the movie left me wanting more(not because the \"meh\" cliff hanger), it kind of seemed like we didnt get enough of the bye bye mans powers. As a side note at first I thought the actors and actresses were really bad at acting but as the movie progressed I realized they were really realistic instead of the usual acting tone (if that makes sense) and it made the movie seem a bit more realistic and less like a movie. ?ø?? §åÝ ??",
            "review_date": "2017-01-14",
            "source": "rt"
        },
        {
            "content": "What it lacks in originality it makes up for in a few good jumps. But the lack of story and scares leaves you not thinking and not saying anything good about this horror!",
            "review_date": "2017-01-14",
            "source": "rt"
        },
        {
            "content": "Worst movie I've ever seen",
            "review_date": "2017-01-14",
            "source": "rt"
        },
        {
            "content": "It had my friends and I on the edge of our seat. The strongest slasher film I have ever seen premiering in a theater in my generation. If you love horror films, this is a MUST see. If you hate horror films i would still recommend it cause it is so strong it might change your mind, even if it doesn't I am confident you will appreciate this effort for its run time. Loved it!",
            "review_date": "2017-01-14",
            "source": "rt"
        },
        {
            "content": "it was a pretty decent  horror movie more of a psychological  horror not the usually cheesy shock and gore horror u see for most American  films",
            "review_date": "2017-01-13",
            "source": "rt"
        },
        {
            "content": "The movie doesn't have any originality. Duh. 50% of the time, it's everything wrong with January horror movies. The dialogue is really bad, characters are randomly cryptic & stupid because \"it's creepy,\" and the cast is pretty shaky. The other 50% of the time, it's like what would happen if A Nightmare on Elm Street, Donnie Darko and The Shining all had a baby. During that 50%, the story is unraveled well, it pulls no punches, Douglas Smith turns in a super intense performance, and an appropriately cryptic mystery is barely hinted at. Probably the movie's biggest problem - or asset, depending on your mood - is that it never warns you when it'll switch between the awesome and the horrible. If you removed the studio BS, this'd probably be a really solid horror movie. I still say it's totally worth a watch, and if you like horror movies especially, try going to see it in the theater.",
            "review_date": "2017-01-13",
            "source": "rt"
        },
        {
            "content": "\"Don't think, don't watch it\" more like don't watch it. This movie's plot is everywhere. The acting was atrocious. Not worth the money or effort to try and sit through this movie.",
            "review_date": "2017-01-13",
            "source": "rt"
        },
        {
            "content": "Piece of shit movie.",
            "review_date": "2017-01-13",
            "source": "rt"
        },
        {
            "content": "It was decent, nothing spectacular. Only a couple of pretty cool scenes. The title itself is kind of silly. Meh, anyway... if you've seen one \"scary\" movie you've seen 'em all I guess",
            "review_date": "2017-01-13",
            "source": "rt"
        },
        {
            "content": "It is really difficult to find anything positive to say about this film. It is not the worst movie I have ever seen but it's not good either. It felt really flat, most of the acting was bad and the 'villain', whilst an interesting concept, failed to deliver any real dread. Oh, and it's not scary!",
            "review_date": "2017-01-13",
            "source": "rt"
        },
        {
            "content": "The characters are bad. The writing is bad. The movie is bad.",
            "review_date": "2017-01-13",
            "source": "rt"
        },
        {
            "content": "It's January and that means it's time for an awful horror movie. This year's incarnation of that oddly persistent tradition comes in the form of The Bye Bye Man, a film so nonsensical that even its own writers don't seem to understand how its villain works.\n        The Bye Bye man is basically a cross between The Ring and A Nightmare on Elm Street. Kind of. The titular character operates as a curse of sorts; once you read or see his name, he gets into your head and.... stuff happens. I'm not sure why a lot of the stuff happens, but it does. He can make you see things that aren't really there. He can also make you not see things that are there. I think. I'm largely assuming that ability, as I have no other explanation for a character standing on railroad trucks and being dumbfounded by the arrival of a train that has been loudly heading toward her. He can also make you kill your friends and family. Sort of. This point is also a bit unclear, as characters explicitly state that he is forcing them to commit acts of violence. But at other times, they are consciously killing people in an effort to prevent the further spread of the curse before offing themselves to seal the deal. So the Bye Bye Man can make you kill people to prevent his own continued existence....I guess. I don't freaking know. This villain's sense of self-preservation is lacking. \n        But the B-B Man isn't the only one seriously lacking in the survival skills department. His victims are driven mad in stunningly quick fashion and seemingly resort to murder-suicide as their first option in the face of adversity. Their problem largely amounts to hallucinations. That is problematic, sure, but one might try to learn to live and function with them before just saying \"screw it!\" and going on a killing spree. If you found out, in the course of your day, that a demon was making you hallucinate to get you to hurt your loved ones and then you stumbled upon your best friend having sex with your girlfriend, would you A. Consider that the hallucinations may be causing this and you might want to take a minute to assess the situation or B. Immediately grab a baseball bat and swing at your friend's head? If you went with the latter option, then you would fit in very well in this movie. The main character even has an epiphany, lifted directly from A Nightmare on Elm Street, in which he realizes that the B-B Man derives his power from belief and fear, and that one must only not believe in him. There is no basis for this realization and perhaps the character simply wrote it off between scenes because he promptly forgets this in the next scene and goes on not knowing that hallucinations are a thing. \n        I haven't gone into much detail about the Bye Bye Man himself, largely because the movie didn't either. He is a generic looking villain in a black cloak, a bit sith-like, and he makes the aforementioned stuff happen. I'm hard-pressed to remember another horror villain that neither speaks nor actually does anything, instead relying on his victims to take themselves out through their own incompetence. The only thing that he actually does is point at people in an ominous fashion, so there is that. What is somewhat fascinating is the number of elements that are introduced and then never explained. There are a pair of coins that are shown repeatedly and seem to be of some relevance and importance to the Bye Bye Man. I'm not sure why, as this element is never explained. Neither is the association of trains with our villain. Several times we hear train noises that seem to signal his arrival (assumedly for more ominous pointing) and we even see footage of a train spliced into the film without elaboration. Why? I don't know. Maybe he prefers to commute to his victims via train? Oh, and he has a dog. More of a hell-hound, really. Imagine the dog-monsters protecting Gozer at the end of Ghosbusters, except in god-awful CGI. This thing is never named and its purpose is never explained, he just shows up periodically and seems to hang out in the closet in his down time. \n        I also haven't into too much detail about the characters and this is because I don't remember them.  I don't want to be too critical of the young actors, all of whom were unfamiliar to me, because the script gave them nothing to work with. They could be perfectly fine actors or they could be terrible, but this film gave me no basis for that determination with characters and dialogue so forgettable that I am now struggling (less than 24 hours later) to name a single character in the damn thing. The only actors that I recognized are Faye Dunaway (!) as an exposition dump and Carrie-Ann Moss, who provides the film's single somewhat effective scene in the form of a police interrogation. Even Doug Jones is wasted as the title character, as the villain's complete inactivity fails to justify the need for Jones in the role. \n        I must also comment on the film's rating, as the initial R-rated cut was trimmed to a PG-13. I generally dislike PG-13 horror, but this was a particularly blatant case of absurd editing. People are shot point-blank with a shotgun without a drop of blood to be seen. A sex scene is edited so awkwardly that my friend turned to me and inquired \"how are they both on top?\" I don't know, man. As with everything else in this movie, I just don't know.\n        Please don't go see this. I have seen worse horror movies lately (Shut In, The Darkness, The Other Side of the Door), but this is clearly designed as a franchise-starter and I don't want to be stuck with sequels every year. I can go without knowing what was up with the damn train.",
            "review_date": "2017-01-13",
            "source": "rt"
        },
        {
            "content": "I can't believe I spent my Friday night watching this absolute shite.",
            "review_date": "2017-01-13",
            "source": "rt"
        },
        {
            "content": "This is a movie that had alot of potential because it was original we haven't had a originl horror film in a long time. They spend mostly the whole movie explaining who these characters that you don't care about are and less time explaining who or what is the Bye Bye man, but the screen time that the bye bye man had was good not scary but good. Overall Rating 4.7/10",
            "review_date": "2017-01-13",
            "source": "rt"
        },
        {
            "content": "Good, but it didn't show the Bye Bye Man's origin. I mean, was he a human? Where did he get the hound? How did he died and became a monster? And how did he get the name \"The Bye Bye Man?\"",
            "review_date": "2017-01-13",
            "source": "rt"
        },
        {
            "content": "wait for Netflix, some bad acting, a few cheesy moments. but overall it was a fun watch",
            "review_date": "2017-01-13",
            "source": "rt"
        },
        {
            "content": "best horror movie for teens",
            "review_date": "2017-01-13",
            "source": "rt"
        },
        {
            "content": "Don't watch it, don't see it.",
            "review_date": "2017-01-13",
            "source": "rt"
        },
        {
            "content": "I thought the dog ( Bye Bye mans sidekick)\nlooked amazing, completely my favorite part of the movie!",
            "review_date": "2017-01-13",
            "source": "rt"
        },
        {
            "content": "Great start for a year of stellar horror.  Great cinematography.",
            "review_date": "2017-01-13",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man marks its spot to let everyone know that even 'bye bye' should be the accurate phrase to say when leaving this movie nearby the first couple of minutes of movie time.",
            "review_date": "2017-01-12",
            "source": "rt"
        },
        {
            "content": "As I was leaving the theater walking to my vehicle after seeing \"The Bye Bye Man\", I was thinking to myself, \"Did I really just drive 45 minutes by myself to the nearest theater showing this movie on a Thursday night to see this typical, boring January horror film? \" And of course the answer was, \"Yes. Yes I did.\" Not that the quality of this piece of cinema comes to my surprise giving that we are in the middle of January, also known as the month that you should not be going to the theater to see new releases, but instead going to the theater to see all of the entertainment you missed in December. But, not only am I trying to see more movies of the current year, I was also hoping for a miracle. Could \"The Bye Bye Man\" be the saving grace to January for horror films, and wipe away the bad tastes of recent efforts like 2016's \"The Forest\", 2015's \"The Woman in Black 2\", or even 2013's dreadful \"Texas Chainsaw 3D.\" In short, the answer is \"Of course not.\" This movie, like relatively all January horror releases, insists on making the audience jump out of their seat rather than making their skin crawl and build tension. Speaking of tension, there is no tension in this movie. None. Not even a little bit. Everything about \"The Bye Bye Man\" relies on, wait for it, jump scares. And don't get me wrong, I honestly am not the kind of person that wants jump scares completely scrapped from every future horror film. What  I want is for horror movies to not completely rely on them, especially if it's just slamming doors and people running into each other while a brutally loud noise erupts through the auditorium to startle the crowd. That is lazy and uncalled for and completely ruins anything that the movie is trying to accomplish. And of course, that is all \"The Bye Bye Man\" is. Because of this, I am not going to be thinking or talking about this movie after I am done posting this, which ironically is what the characters are attempting to do the entirety of the movie's 96 minute running time. So, should you see \"The Bye Bye Man?\" No you shouldn't. While there possible was a total of 5 minutes during the movie where I was getting into the story, the constant attempts to startle me rather than scare me left me, like most January horror films do, with a bad taste in my mouth. 3.3/10",
            "review_date": "2017-01-12",
            "source": "rt"
        },
        {
            "content": "Don't see it. Please. Don't. It's really bad. \n\nI love horror movies with all my heart, except for the part devoted to my fiancé. This movie killed the other part of my heart. It's dead. \n\nThe acting was bad. The cgi sucked. The script made me giggle when it shouldn't have. \n\nThe premise was great, but the movie, it ain't. \n\nDon't watch it, don't see it. Don't see it. Don't watch it.",
            "review_date": "2017-01-12",
            "source": "rt"
        },
        {
            "content": "THIS IS A TOTAL PIECE OF SHIT",
            "review_date": "2017-01-12",
            "source": "rt"
        },
        {
            "content": "Once again a horror release in January that's absolute drivel. \nThe Bye Bye Man is nothing but a formulaic teen horror that is as about as scary as day out in Disneyland. Essentially when someone does something wrong, blame the Bye Bye Man. Well I blame him for this piece of junk. \nIn the poster it says 'Don't Think it, Don't Say it. They forgot to add 'Don't fucking watch it'\n1/10 and that's because the film eventually finished. Avoid.",
            "review_date": "2017-01-12",
            "source": "rt"
        },
        {
            "content": "wish I could give it negative stars",
            "review_date": "2017-01-12",
            "source": "rt"
        },
        {
            "content": "So bad!! Not worth the go to the theatre...",
            "review_date": "2017-01-11",
            "source": "rt"
        },
        {
            "content": "Wasnt what I expected it to be but it could have been better. wasnt that scary at all. it was ok.",
            "review_date": "2017-01-10",
            "source": "rt"
        },
        {
            "content": "Fundamentally flawed & disjointed, jumbled story",
            "review_date": "2017-01-10",
            "source": "rt"
        },
        {
            "content": "The first 20(ish) minutes show potential. A gripping opening and some good camerawork. But then the director and screenwriter husband and wife pair say good bye to it all. The acting ranges from mediocre to laughably terrible, the scares are at best mediocre, and the bulk of Bye Bye Man's best (least shit) ideas come from better horror films. There's a place for urban legend style scare-taculars, but not this one.",
            "review_date": "2017-01-10",
            "source": "rt"
        },
        {
            "content": "I shit my pants, and not because this movie is scary.",
            "review_date": "2017-01-10",
            "source": "rt"
        },
        {
            "content": "Saw an advance screening of this and there is nothing new. This is actually HORRORible movie.",
            "review_date": "2017-01-10",
            "source": "rt"
        },
        {
            "content": "jccv  kzzz jkxhnzN????anznZoZb ACROSS from vvvgflgcck@???",
            "review_date": "2017-01-09",
            "source": "rt"
        },
        {
            "content": "i want to see this movie",
            "review_date": "2017-01-09",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man is an atrocity of a film. Everything about this film is just terrible. The acting is horrible. The teenagers were really bad. When the bad stuff starts happening, the acting is pretty funny. The characters aren't likable, and you just want them to die. Carrie-Anne Moss and Faye Dunaway are in this. Don't know why. The plot is especially bad and predictable. The story doesn't make sense. The mythology of \"the bye bye man\" isn't explained. Numerous things happen and are shown that isn't explained. A lot of things just happen that unintentionally bring out laughter. The writing is terrible, the directing is bad, and the editing is choppy. Overall, this is one of the worst film experiences in a while. It is incredibly dumb. I can't believe it got released in theaters. The concept isn't bad, but the execution is one of the worst things I've ever seen. This is a sorry excuse of a film.",
            "review_date": "2017-01-09",
            "source": "rt"
        },
        {
            "content": "very slow paced , acting was okay . story was dumb . bye bye man was really scary looking . he was the best part of the movie even though , he did not do much.  3rd act got outta control . should've been a netflix movie .",
            "review_date": "2017-01-08",
            "source": "rt"
        },
        {
            "content": "The acting was horrible. The plot was horrible....",
            "review_date": "2017-01-08",
            "source": "rt"
        },
        {
            "content": "it was creepy but no background on this monster",
            "review_date": "2017-01-08",
            "source": "rt"
        },
        {
            "content": "looks very good can't wait too see it",
            "review_date": "2017-01-08",
            "source": "rt"
        },
        {
            "content": "Nothing happens for an hour and then some people die. Doug Jones did the best he could as the monster but they never seemed to get round to explaining his lore...or doing anything really...",
            "review_date": "2017-01-07",
            "source": "rt"
        },
        {
            "content": "not horror, more of a thriller",
            "review_date": "2017-01-05",
            "source": "rt"
        },
        {
            "content": "Say bye bye ratings.another horror flick destined for straight to dvd.",
            "review_date": "2017-01-04",
            "source": "rt"
        },
        {
            "content": "Great movie, seemed like it was more original and less generic of a horror movie! Loved it and recommend it for any horror movie lover! Some good jump seens",
            "review_date": "2017-01-04",
            "source": "rt"
        },
        {
            "content": "it was ok thought it would be better!!",
            "review_date": "2017-01-03",
            "source": "rt"
        },
        {
            "content": "sad no matter what u do this man will always come back for some one",
            "review_date": "2017-01-02",
            "source": "rt"
        },
        {
            "content": "I bet nobody could say out loud in public \"watch out for the bye bye man\" without keeping a straight face or thinking that it sounds dumb. This movie is so awful. I got scarier jumpscares in the FNAF series than the jumpscares in this movie. Basically the plot is that 3 college students move into an old off-Campus house which apparently is haunted by the bye bye man, because if it wasn't, this movie wouldn't exist. So the bye bye man supposedly possessed the 3 college students which made them go on a killing spree because it isn't a supernatural horror movie without getting someone possessed. They get some information about the bye bye man and that the only way to escape his curse is to not say or think about him because he gets in your head and takes control. Overall, this movie is just abysmal to watch and is an eyesore. However, people who love getting scared by awful movies may like it. I hope IHE reacts to this garbage.",
            "review_date": "2017-01-02",
            "source": "rt"
        },
        {
            "content": "Not bad movie keeps u on ur toes.",
            "review_date": "2016-12-31",
            "source": "rt"
        },
        {
            "content": "It wasn't that bad... It wasn't that good either, but it wasn't that bad.",
            "review_date": "2016-12-30",
            "source": "rt"
        },
        {
            "content": "Very predictable not to scary best to rent.",
            "review_date": "2016-12-29",
            "source": "rt"
        },
        {
            "content": "OMG!!! I want to watch that movie!!",
            "review_date": "2016-12-27",
            "source": "rt"
        },
        {
            "content": "Don't waste your money.",
            "review_date": "2016-12-27",
            "source": "rt"
        },
        {
            "content": "The Bye Bye Man can not be any more exciting than making you wanting to say bye bye as you walk away from this movie. The Bye Bye Man is a horrible supernatural horror film that has a direction that's not sure if its trying to make the audience laugh or scared. It has some dull acting, boring direction, and the scares are nonetheless not there. Bye Bye Man has that folk title of a fiction character that once the name is said, he will come with his demonic hound and the people involved would be delusional, see things, makes them want to hurt each other as their weakness is revealed and even kill each other. \n\nThe plot follows Elliot (Douglas Smith) and his girlfriend Sasha (Cressida Bonas) and friend John (Lucien Laviscount) moving into a house together. They find some old furniture in a basement. And a night stand that constantly drops coins. Once they find a carving of a title The Bye Bye Man inside the drawer and accidentally saying it. Elliot, Sasha, and John will have to do whatever it takes to beat this supernatural force. They have to follow the one rule, of don't think it, don't say it. \n\nThis film feels like a shadowed version with horror ionic characters like Candyman, Boogeyman, etc. I am sure there are better horror movies that will provide scares than this. This film does lack scares, thrills, and its not even exciting. From the opening moments, of 1960's seeing a man yelling out loud \"don't think it, don't say it.\" And killing people. I love how characters are written to be as dumb as they just stand right in front of the threat as it happens. It gets worse, and more annoying especially when the tagline of don't say it is mentioned quite a lot. Not sure, if its either terrible acting or just cheesy to see on screen. \n\nLets talk about the acting. The acting was horrible and every character is written as one- dimensional. The actors definitely looked like they are reading straight from the script without even building their characters. Elliot may seem like the reasonable caring character, which loves his girlfriend and friend and his brother and niece. Especially, when his brother and niece come by their house a lot. Even at midnight, when Elliot is trying to keep his family away from the bye bye man being noticed by them. One main issue I had was who takes a little girl out to visit their uncle after midnight. Seems kind of late for visiting. Also, I feel like Carrie-Anne Moss talent is wasted here, as she plays a detective trying to figure out these strange webs of murders. She comes and goes on screen. \n\nThe Bye Bye Man may seem like a creepy character that stands in the shadows in a dark room. But its nothing scary about the guy besides making everyone around him go mad. Besides the movie having a boring direction that does not provide scares and just a bunch young adults trying to survive against this evil figure. \n\nOverall, The Bye Bye Man is horrible. Terrible acting, no scares or thrills, and a boring direction. I do not recommend unless you're really bored.",
            "review_date": "2016-12-26",
            "source": "rt"
        },
        {
            "content": "fake ass Freddy Kruger",
            "review_date": "2016-12-26",
            "source": "rt"
        },
        {
            "content": "\"It is one of the most lazily constructed horror movies I've seen in many a moon\"\nDVD Movie Review: The Bye Bye Man\nDate Viewed: April 20 2017\nDirected By Stacy Title (The Last Supper)\nWritten By Jonathan Penner, Based on the chapter \"The Bridge to Body Island\" from the novel \"The President's Vampire\" by Robert Damon Schneck\nStarring: Douglas Smith, Lucien Laviscount, Cressida Bonas, Doug Jones, Carrie-Anne Moss, Faye Dunaway, Michael Trucco, Cleo King, Jenna Kanell, Erica Tremblay and Leigh Whannell.\n\nI will definitely say bye bye to \"The Bye Bye Man\" when goes into my list of the worst movies of 2016. It is one of the most lazily constructed horror movies I've seen in many a moon. This \"Bye Bye Man\" is just a cheap imitation of other horror movie villains from the past. \"The Bye Bye Man\" looks exactly like Freddy Krueger but without his disfigured face, his razor claws or his snarly, dark humor. The victims who are presented in this movie keep saying \"Don't Think It! Don't Say It!\", \"Don't Think It!, Don't Say It!\", \"Don't Think It!, Don't Say It!\" but how about \"Don't See It!\", choosing this option will make you, me and the rest of the audience very happy.\n\nThe movie's epilogue takes place in 1969 where a man commits mass murder throughout his neighborhood all because if they spoke or mentioned about \"The Bye Bye Man\". Listen guy, you're willing to kill people you either like or love all for the purpose of speaking about a killer who's just a Freddy Krueger wannabe? You're just a sick asshole and have you ever heard of saintly crosses or the Bible?\n\n\"The Bye Bye Man\" then shifts to present day where we encounter three college students, Elliot (Douglas Smith), his girlfriend, Sasha (Cressida Bonas) and his best bud, John (Lucien Laviscount) who move into an off-campus house. As the three students throw a party, Elliot discovers a shelf with writing consisting of just \"don't think it, don't say it\" and the title name \"The Bye Bye Man\". Oh Geez, he's in for it now. As you may have guessed, weird things start happening such as Sasha developing a strange cough and Elliot finding coins over and over again.\n\nWho is this \"Bye Bye Man\" anyway? We don't know where he's from, we never get an insight into his origins, we don't know much about him? He just kills people who speak his name and that's about it. What's the trouble for speaking that name? You're probably going to be puzzled and outraged about my two theories about the Bye Bye Man. Is he the Hillary Clinton assassin who murdered Vince Foster or is he connected to the Pizzagate stories? Hey, I'm just saying! Oh yeah, the Bye Bye Man's only companion is a skinless demon dog and he's played Doug Jones who is known to comic book fanboys as Abe Sapien, from the two \"Hellboy\" films.\n\nContinuing on with the premise, as Sasha continues to be sick, Elliot starts to have hallucinations and he begins to suspect that his sick girlfriend is cheating on him with John. After a female friend of the three college mates gets killed after being struck by a train, Detective Shaw (Carrie-Anne Moss) takes Elliot in for questioning but is let go due to lack of evidence. \"The Bye Bye Man\" continues to torment poor Elliot as he tries to figure out a way to stop him and save his friends. Elliot goes to the library in order to find old news stories about the Bye Bye Man but he finds no such stories anywhere on their computer archives. No wonder Elliot can't find anything about the Bye Bye Man, this whole community seems to think that he is fake news. Eventually Elliot does find a story about the Bye Bye Man after just googling don't think it, don't say it, he discovers a story dating back to 1969 where a reporter committed mass murder in his neighborhood. Elliot also visits the reporter's widow (Faye Dunaway) about how to stop the Bye Bye Man without thinking or saying his name. The widow gives Elliot very little advice about stopping him and she warns that the Bye Bye Man curse will cause him to endure insanity, hallucinations and of course death.\n\n\"The Bye Bye Man\" is believe it or not based on a chapter from Robert Damon Schneck's book \"The President's Vampire\" and I highly doubt that he's an original horror movie killer. The acting is terrible, the screenplay by Jonathan Penner is completely inane and Stacy Title's direction is crammed with all too familiar horror movie cliches. The year maybe early but it is already looking to be another bad year for Faye Dunaway, first you took part in that Best Picture blunder with Warren Beatty and then you do this movie? She really needs to find roles that suit her well, otherwise it's game over for her career. As for the three young leads, there's no film career in your future but hey! You can always star in cruddy, direct-to-DVD turdpiles with Nicolas Cage and Bruce Willis!\n\nThere's nothing more to say about \"The Bye Bye Man\" because it's really bad. By the way, I've written the name 17 times in this review and nothing bad has happened to me. I guess it shows how scare-free it is.",
            "review_date": "2016-12-25",
            "source": "rt"
        },
        {
            "content": "Plot holes everywhere.",
            "review_date": "2016-12-24",
            "source": "rt"
        },
        {
            "content": "Thoroughly enjoyable for horror fans",
            "review_date": "2016-12-23",
            "source": "rt"
        },
        {
            "content": "Freddy minus having to be asleep.",
            "review_date": "2016-12-21",
            "source": "rt"
        },
        {
            "content": "Fun to watch.  I didn't expect much from this so I actually think they did a good job here.  No A+'s for acting but it all flowed.  About what I expected it to be and looks like this will be a series.  If they do it, don't wait too long to do it.",
            "review_date": "2016-12-20",
            "source": "rt"
        },
        {
            "content": "It's isn't that often that I go to see a movie knowing that it'll be terrible, but my MoviePass subscription makes walking into shitshows a lot more bearable. The Bye Bye Man is one of those movies that seems to fall out of the cursed orifice of January movies, one that's pretty much offensively lazy. Even at 96 minutes including credits, this movie manages to pack in more horrible acting, flat cinematography, nonexistent characterization, and lame dialogue than you'd expect from this type of movie. All the while, it's boring as hell with only a few moments of unintentional humor. It's the type of movie that has you think, \"Wow, these filmmakers were some lazy bastards,\" and then does nothing but reinforce that fact for the rest of its runtime. It's something so one-dimensional that it's just a point in the middle of space with no purpose, so frail that it might as well not exist. I don't know why I'm going to even try giving a plot synopsis, but whatever. Basically, there's this entity called the Bye Bye Man that makes people hallucinate freaky stuff, which leads to their demise. After the movie opens back in 1969 and shows just how bad acting can be, it cuts ahead to present day where Discount Dane DeHaan (Douglas Smith), his Boring-Ass Girlfriend (Cressida Bonas), and Token Black Guy (Lucien Laviscount) rent out some old McMansion that's way out of the price range of a few college kids, and then they start getting terrorized by a vague antagonist that rips off everything from Freddy Kruger to Candyman as well as pretty much anything else you can imagine. That's pretty much it. For all intents and purposes, nothing could have happened at all, because the movie is utterly pointless, as are the cardboard caricatures that populate the movie. It's directed by Stacy Title and based off of a script by her husband, Jonathan Penner, and if I were to describe The Bye Bye Man in one word, it would be \"flat\": flat acting from people with zero charisma; flat cinematography that looks like it was shot on an iPhone and then desaturated; flat writing that's so clichéd and predictable that it borders on dramatic irony throughout; flat \"horror\" scenes, a few of which feature people getting shot or beaten with there's no blood in order to secure a PG-13 rating; flat CG that looks like it's from a '90s TV show. All of the actors' behavior makes it impossible to believe what's supposed to be happening, and it's an extra punch to the groin that this dialogue is so bad that not even great actors could make it work. Everyone speaks in one language, and that language is exposition. The kicker is that it's just so boring, so much so that I don't know why I'm even bothering to write more of this review. It doesn't deserve any more of my time; I've granted it far too much. Some of the worst movies that I've ever seen bring me to a point of insatiable rage, meaning that they are, in a weird way, effective. The Bye Bye Man isn't that. There are no highs and no lows. It's just... there. Barely. 1.8/10, disastrous, D-, leagues below average, etc.",
            "review_date": "2016-12-19",
            "source": "rt"
        },
        {
            "content": "This should've aired on The SyFy channel instead of going to the big screen. 1990s SFX, terrible acting, and an awful script. Don't say it, don't think it.....just don't bother watching it.",
            "review_date": "2016-12-19",
            "source": "rt"
        },
        {
            "content": "unoriginal & unimaginative. ",
            "review_date": "2016-11-14",
            "source": "rt"
        },
        {
            "content": "Nothing to see here (or write about) move it along.",
            "review_date": "2016-10-29",
            "source": "rt"
        },
        {
            "content": "tiene unas partes de miedo, pero de ahí la historia es pésima.",
            "review_date": "2016-10-26",
            "source": "rt"
        },
        {
            "content": "errrr. --, Candyman, which was pretty good, at least a trailer for this kind of movie should be scary! , but nil points on that, still as us horror fans are we will give the BOTD to this ð??±ð???ð???",
            "review_date": "2016-10-13",
            "source": "rt"
        },
        {
            "content": "Ehh it was ok it could have been more scary",
            "review_date": "2016-04-22",
            "source": "rt"
        },
        {
            "content": "Your bottom of the barrel mainstream horror film, \"The Bye Bye Man\" is perfect for superficial people who watch movies not to see something new, but something that's been done plenty of times before.",
            "review_date": "2016-04-13",
            "source": "rt"
        }
    ]
}