{
    "rating": 8.8,
    "release_date": "2017-11-17",
    "num_reviews": 141,
    "genres": [
        "Drama",
        "Animation"
    ],
    "summary": "Parvana is an 11-year-old girl who lives under Taliban rule in Afghanistan in 2001. After the wrongful arrest of her father, Parvana cuts off her hair and dresses like a boy to support her family. Working alongside a friend, she soon discovers a new world of freedom and danger. Drawing strength from the fantastical stories she invents, Parvana embarks on an epic quest to find her father and reunite her family.",
    "reviews": [
        {
            "content": "Most boring movie ever and i got cancer",
            "review_date": "2023-04-17",
            "source": "rt"
        },
        {
            "content": "This is a sad story - a sobering one about life in Taliban controlled Afghanistan. It makes clear the harsh living realities for women in the time its set (2001). The animation is certainly beautiful - I love the old fashion 2d feel of it as well as the great range of colours. Its really quite an engrossing watch. I would highly recommend this film.",
            "review_date": "2022-09-01",
            "source": "rt"
        },
        {
            "content": "Pretty ignorant, but what can be expected from Jolie. And hypocritical considering her skeletons. If anyone wants to know about her time in Chiang Mai, I am happy to tell them. Suffice to say that people of a certain sex were bought to her room and left quite terrified.",
            "review_date": "2022-04-16",
            "source": "rt"
        },
        {
            "content": "Very provocative and profound.  Good family watching that allows your own imagination to teach lessons in fact, history, life and compassion.",
            "review_date": "2022-04-12",
            "source": "rt"
        },
        {
            "content": "Another super flick from Cartoon Saloon!\n\nAfter watching and enjoying the Irish Folklore Trilogy from the studio, I simply had to check out their one other film to date: 'The Breadwinner'. I actually think that's kind of a boring title to be honest, but thankfully the film is anything but.\n\nIt follows the lines that you'd, or at least I'd, expect given the subject matter, but it still adds extra weight to the story alongside plenty of heart. Saara Chaudry leads the voice cast excellently, with those behind the young Canadian putting in solid performances too. The animation, as usual for this Irish animation company, is exquisite.\n\nI'm eager to check out Cartoon Saloon's next film, with 'My Father's Dragon' due out at some point this year. Four films in, they haven't put a foot wrong with their releases yet. This 2017 production is very good - 8/10 from me, but it's a borderline 9/10 tbh.",
            "review_date": "2022-04-11",
            "source": "rt"
        },
        {
            "content": "Possibly the Best Book-to-Film Adaptations that I have ever seen.",
            "review_date": "2021-11-18",
            "source": "rt"
        },
        {
            "content": "This movie creates an amazing contrast between two parallels of the world. On one side, there is chaos and the war but on the other, there is harmony of dreams . The characters have great depth and bring their own charm to the whole plot. It exhibits complex layers of a war-torn country especially for the underprivileged and for the people who are discriminated. The movie is a must watch for everyone who wish to know what it takes to keep your aspirations alive, to be hopeful about a better future and to rise from the shackles of prejudice. Beautiful!",
            "review_date": "2021-11-14",
            "source": "rt"
        },
        {
            "content": "Beautiful and deeply moving tribute the people of war torn Afghanistan",
            "review_date": "2021-09-23",
            "source": "rt"
        },
        {
            "content": "Summary: Under the Taliban rule, Parvana could only leave the home when accompanied by a man. When her father is forcibly taken away, Parvana's household of women has no escort to safely earn money or purchase goods. She is left with one choice: disguise herself as a boy. \n\nTakeaways: Don't let the beautiful animation fool you: this movie is for people of all ages. The esthetic, based on the book by Deborah Ellis, is simply a mechanism to illustrate the poverty, fear, and gender inequality that came with the Taliban.",
            "review_date": "2021-09-06",
            "source": "rt"
        },
        {
            "content": "a pretty good story should watch it",
            "review_date": "2021-06-15",
            "source": "rt"
        },
        {
            "content": "If you wanna cry, go on watch it.",
            "review_date": "2021-06-04",
            "source": "rt"
        },
        {
            "content": "this movie was a bit distressing, but at times it had me on the edge of my seat. 5/5 stars.",
            "review_date": "2021-06-01",
            "source": "rt"
        },
        {
            "content": "It's a pretty story but it's a lie. Girls are regularly made to be boys in Afghan culture when there are no boys in the family. Also, boys are made to be girls for sexual purposes before puberty in this culture and it is considered normal. So, read this knowing that this is how this messed up culture operates and don't buy in to this \"feel good\" story.",
            "review_date": "2021-05-14",
            "source": "rt"
        },
        {
            "content": "Cartoon Saloon nos muestra una conmovedora historia en Afganistán; la trama es buena, los personajes son carismáticos, la animación es excelente y la banda sonora es muy buena; la recomiendo mucho.",
            "review_date": "2021-04-20",
            "source": "rt"
        },
        {
            "content": "Very deep an interesting. The way both stories are told and how they intertwine will make you feel deeply by the end. I loved the rain/thunder analogy as well.",
            "review_date": "2021-04-20",
            "source": "rt"
        },
        {
            "content": "It is sad for many reasons, but also a beautiful reminder of how strong love for one another can be.",
            "review_date": "2021-02-24",
            "source": "rt"
        },
        {
            "content": "Exceptional story for all ages. One of the best movies of the decade.",
            "review_date": "2021-02-13",
            "source": "rt"
        },
        {
            "content": "stunning animation and even better plot",
            "review_date": "2021-02-01",
            "source": "rt"
        },
        {
            "content": "Awesome！I love it！very touching",
            "review_date": "2020-12-24",
            "source": "rt"
        },
        {
            "content": "A beautiful film that I feel it doesn't have the recognition it deserves.",
            "review_date": "2020-11-27",
            "source": "rt"
        },
        {
            "content": "very well made movie about a terribly sad reality that only reaches more and more people in today's world. A must-watch, an eye-opener, and should be shown to everyone who sees Muslims as terrorists and victims only as numbers. I wish this movie would not have had to be made but it could not have been done any better",
            "review_date": "2020-10-31",
            "source": "rt"
        },
        {
            "content": "Wow, nice it has a 95% score here. Totally deserves it.",
            "review_date": "2020-10-27",
            "source": "rt"
        },
        {
            "content": "An absolute joy of a film, this is my 2nd favorite movie of all time and my most re-watched film as well.",
            "review_date": "2020-09-20",
            "source": "rt"
        },
        {
            "content": "A Ganha-Pão (2017)\n#IMDb #MovieReview 4,0 ⭐️ No Afeganistão sob domínio do Talibã, garota se veste de menino em busca do pai na prisão. Real e triste. Ótimo filme!!",
            "review_date": "2020-08-20",
            "source": "rt"
        },
        {
            "content": "Intense and heart wrenching.",
            "review_date": "2020-08-20",
            "source": "rt"
        },
        {
            "content": "Powerful, visually stunning, well written, cute, sad, and beautiful",
            "review_date": "2020-08-12",
            "source": "rt"
        },
        {
            "content": "The excellent animation work in this film still fails to harmonize the complexity of women's lives in Afghanistan. Parvana is the living image of each of these fighters who seek a light beyond the dust, from anywhere in the world, we are with you.",
            "review_date": "2020-08-11",
            "source": "rt"
        },
        {
            "content": "Very deep and moving movie that will surprise you and bring you to tears. The ending was terribly sad and made me contemplate quite a bit.",
            "review_date": "2020-08-09",
            "source": "rt"
        },
        {
            "content": "A fairly correct depiction of the struggles of women and children in afghanistan",
            "review_date": "2020-08-07",
            "source": "rt"
        },
        {
            "content": "This was one of the best animated pictures I have seen, it was a very touching story. I was very impressed by the visual style of the film, you almost feel impressed by it. This movie tells a very import story that should not be missed.",
            "review_date": "2020-07-26",
            "source": "rt"
        },
        {
            "content": "Its stunning animation is complimented by a story that mixes real-life issues with a disturbing and haunting setting, an unexpectedly rich honestly, and an emotionally satisfying narrative.",
            "review_date": "2020-07-17",
            "source": "rt"
        },
        {
            "content": "set in a horrible backdrop, this is a beautiful movie.",
            "review_date": "2020-07-06",
            "source": "rt"
        },
        {
            "content": "Surprisingly accessible for young ones and with a tremendous well adapted screenplay, this movie proves that animation is the best form to tell some stories (kudos for the use of tradional animation), even a urgent, gut-wrenching and sad one like that.",
            "review_date": "2020-03-28",
            "source": "rt"
        },
        {
            "content": "It is great that animation can cover so many stories but this story could have more impact in a non animation form. There is a lot of poetry to cover decision making choices that don't make much sense.",
            "review_date": "2020-03-15",
            "source": "rt"
        },
        {
            "content": "Only animation can possibly tell this brutal story with rich visual and a sense of hope. ",
            "review_date": "2020-01-25",
            "source": "rt"
        },
        {
            "content": "Delightfully heartbreaking and demonstrates a bravery not seen from mainstream animation",
            "review_date": "2019-12-27",
            "source": "rt"
        },
        {
            "content": "It's so realistic but in a fairy tale way so mature and packed with emotions i love the characters animation story it's such a strong story but a stronger message it was the best movie experience for me this year",
            "review_date": "2019-12-20",
            "source": "rt"
        },
        {
            "content": "My kids and I watched it. As sweet as it was, it was also sour and powerful. Great story!",
            "review_date": "2019-12-01",
            "source": "rt"
        },
        {
            "content": "One of my absolute favorite animated movies. ",
            "review_date": "2019-09-22",
            "source": "rt"
        },
        {
            "content": "Incredible story telling that will shake you to your roots, in the midst of fantasy and reality, a real cultural insight which will have you on a emotional rollercoaster.",
            "review_date": "2019-08-10",
            "source": "rt"
        },
        {
            "content": "At first, I thought this movie would be a cheap overdubbed movie. I was hugely surprised by the result. Firstly, the unorthodox, yet highly creative animation style made this movie even more memorable than the astoundingly vivid storyline. This film managed to tackle some of the most heartwrenching and real storylines I have ever encountered. This was a rare gem and I'm so glad I found it. Stunning!",
            "review_date": "2019-07-24",
            "source": "rt"
        },
        {
            "content": "An animated feature with a far more serious tone as it takes place in Afghanistan. Life is extremely tough for the women in this one(as in real life unfortunately), and the story told here is done well. Good animation too. Definitely Academy Award winning material with this one.",
            "review_date": "2019-07-08",
            "source": "rt"
        },
        {
            "content": "The Breadwinner's animation is good, but not stunning like Pixar and not unique like Laika, and its story is ultimately forgettable despite some touching moments of realism in its characters' painful society.",
            "review_date": "2019-06-06",
            "source": "rt"
        },
        {
            "content": "Surprisingly slight for a film with so much potential ",
            "review_date": "2019-05-19",
            "source": "rt"
        },
        {
            "content": "detailed and great story telling of a girl's experience in a land under Sharia.",
            "review_date": "2019-02-22",
            "source": "rt"
        },
        {
            "content": "i can see why this got so mush praise\nmusic was great\nanimation was good\nplot was nice, a bit predictable\na nice change from the other movies",
            "review_date": "2019-02-07",
            "source": "rt"
        },
        {
            "content": "Another movie worth seeing! The girls and I watched it last night, and they were just as enthralled as I was.",
            "review_date": "2019-01-19",
            "source": "rt"
        },
        {
            "content": "Absolutely amazing film. Spellbinding, sad, extraordinary.",
            "review_date": "2018-12-23",
            "source": "rt"
        },
        {
            "content": "This was an interesting perspective",
            "review_date": "2018-12-18",
            "source": "rt"
        },
        {
            "content": "With beautiful visuals and a similar premise to the devastating Osama, this is a poignant animated film that doesn't shy away from its harrowing subject and yet is able to come up with a surprising amount of lightness in the fantasy stories that its protagonist always returns to.",
            "review_date": "2018-12-15",
            "source": "rt"
        },
        {
            "content": "I don't think I'm going out on a limb here when I say that the Taliban are a pack of shits. Slavishly devoted to a crooked reading of a religion they have no reason to believe is true, the more I hear about them the less I like them. And so when you set a story in a world that is controlled by these medieval-but-somehow-modern-day barbarians, and I get a sense that the story is a realistic one and it's unlikely that someone in tights and a cape isn't going to sweep down and punch them in their stupid faces, I get sad. It's not that a tough story set in a tough world can't make a good film, but for me it puts a ceiling on the enjoyment I can get from it, because any ray of hope is dashed by the knowledge that the characters, after whatever small victories they can find, will still be trapped under this cruel regime. And this film does a great job of finding those moments of happiness, and those people who will show true kindness, and the bleak backdrop serves to make these moments all the more precious and meaningful. But there was a part of me that always knew that this was the kind of film that wouldn't allow truly happy endings, for any of its characters. Having said that, the film is animated beautifully, the bonds it creates between its characters are genuine and warm, and the hardships are felt very keenly. It's a powerful film that serves as a powerful reminder that people are, at this very moment, living in terrible conditions dictated by terrible people. But I think it is possible to create that feeling and tell a more cohesive, less depressing story at the same time. As the film itself seems to tell us, stories can be a great way to escape from the horrors of the world. I'd have preferred it if this film had practiced what it preached a little more.",
            "review_date": "2018-12-09",
            "source": "rt"
        },
        {
            "content": "A culturally representational narrative simply demonstrates the strength of family love through rebellious survival in an irrational harsh society with unbelievable desperation of strict cruelty. While it is subtlety dark as a norm for the medium, it mostly satisfies with a strong yet fragile heart from the rich animation to graceful performances. (A-)\n\n(Full review TBD)",
            "review_date": "2018-11-24",
            "source": "rt"
        },
        {
            "content": "Such a sweet drama. I cried a couple of times.",
            "review_date": "2018-11-11",
            "source": "rt"
        },
        {
            "content": "Emotional and painfully realistic, The Breadwinner dares to take animated features to the next level by telling a story not just to entertain children. This movie delves deep into the plight of good people struggling to live in harsh conditions without traumatizing its younger audience. Instead, the story is told through beautiful animation and a fairytale hero overcoming all adversity.",
            "review_date": "2018-10-28",
            "source": "rt"
        },
        {
            "content": "My favorite movie EVER. Breathtakingly beautiful..I adored it.",
            "review_date": "2018-10-23",
            "source": "rt"
        },
        {
            "content": "This beautifully made fìlm is a tearjerker.",
            "review_date": "2018-10-18",
            "source": "rt"
        },
        {
            "content": "A beautiful story of bravery, courage, and familial love. The animation is captivating (unsurprisingly -- I was originally interested in seeing this because it was done by the same animators who did The Secret of Kells) -- definitely worth watching!",
            "review_date": "2018-10-14",
            "source": "rt"
        },
        {
            "content": "Really bad movie so boring £13 1 hour 30 minutes wasted of my life when I don’t get much free time not sure why this movie got rated so well do not watch at any cost ",
            "review_date": "2018-10-12",
            "source": "rt"
        },
        {
            "content": "Magnificently somber and hopeful.  Worthy 700th RT review.",
            "review_date": "2018-10-12",
            "source": "rt"
        },
        {
            "content": "A very good movie honestly, but pretty sad and heavy. Most the time I'm looking for something less sad haha, but I really enjoyed it anyways.",
            "review_date": "2018-09-22",
            "source": "rt"
        },
        {
            "content": "An eye-opening story from another perspective. Emotional but stunning. Beautiful characters and well written.",
            "review_date": "2018-09-22",
            "source": "rt"
        },
        {
            "content": "This is the best movie I've seen all year. A work of art in art in more ways than one.",
            "review_date": "2018-08-30",
            "source": "rt"
        },
        {
            "content": "Visually stunning, 'The Breadwinner' is a beautifully animated film (the backgrounds and surroundings are really nice and transport you to another part of the world) that tells the story of a young girl who shows incredible courage in a world full of violence, hate and oppression. The atmosphere is very well captured and it does a good job of conveying the suffering and fear of the people under the rule of the Taliban. It's clear that the film has a certain message that it's trying to get across - humanising the people who are so often thought of as little more than \"those guys in the Middle East who are killing each other\" and showing the terrible effects of tyrannical rulers -- and it isn't interested in distracting from or complicating it. Regardless of whether or not you agree entirely with its portrayal of the circumstances, the story is undoubtedly inspiring, captivating and touching, and achieves exactly what it set out to do.",
            "review_date": "2018-08-12",
            "source": "rt"
        },
        {
            "content": "It captures the setting really well in animated form, but that was about the only thing I liked about it. Very dark and the storytelling misses the mark. (First and only viewing - 8/4/2018)",
            "review_date": "2018-08-11",
            "source": "rt"
        },
        {
            "content": "This movie helped me open up a dialogue with my young sons about the terrible things going on in the world.  It took themes that are typically shielded from children and made it beautiful and moving.  Terrible, heartbreaking things happen in this movie, but kids can still watch because the story is delivered with magic and told by characters that show us why humanity is worth saving despite the ways we hurt each other.  This movie shines, ensnares, and soothes.  It's marvelous.",
            "review_date": "2018-08-09",
            "source": "rt"
        },
        {
            "content": "Couldn't be further from feel good Disney films, but definitely worth a watch. Teaches valuable lessons to all.",
            "review_date": "2018-08-02",
            "source": "rt"
        },
        {
            "content": "A tasteful, and grace-filled look at life in the middle east and the plight of good people that dare to love stories, and each other in the face of immense hate and ignorance.",
            "review_date": "2018-07-05",
            "source": "rt"
        },
        {
            "content": "Heartbreaking film, but very good.",
            "review_date": "2018-07-05",
            "source": "rt"
        },
        {
            "content": "Yes stated that this is Kids & Family cartoon. But will the children actually look at the family drama claiming to be social about the girl who became a boy in order to feed her family. Modern children do not understand this! Best cartoon and famiy movie u can find using boxxy software",
            "review_date": "2018-07-05",
            "source": "rt"
        },
        {
            "content": "Such a warm, heartfelt movie. I was a little distracted with the sub story, but overall all the plot elements were very enjoyable. Definitely recommend. ",
            "review_date": "2018-06-26",
            "source": "rt"
        },
        {
            "content": "An animation so realistic that it's painful to watch.",
            "review_date": "2018-06-20",
            "source": "rt"
        },
        {
            "content": "Beautifully produced film, highly relevant social message.  The animation is gob-smackingly excellent!!  See this great film.",
            "review_date": "2018-06-17",
            "source": "rt"
        },
        {
            "content": "A beautiful and powerful movie, didn't want it to end, everyone should watch, about the power of kindess, love and also cruelty and fear in not only in Islamic  societies that oppress women but for everyone who dares to stand up to oppression anywhere, think for \nthemselves.",
            "review_date": "2018-06-17",
            "source": "rt"
        },
        {
            "content": "Sua história se sustenta pelas tantas urgências cotidianas vividas pela protagonista.\nCom um lindo traçado, que por vezes pode tentar esconder tudo de avassalador que o filme carrega e indigna até os últimos minutos.",
            "review_date": "2018-06-15",
            "source": "rt"
        },
        {
            "content": "Set against the ominous background of Western air-strikes looming above their heads, a young girl named Parvana has to dress as a boy in order to take care of her family under the repressive Taliban regime in Afghanistan after her father, the only adult male member of her family, is unjustly taken to prison. Deservedly Oscar nominated for Best Animated Feature, this Irish-Canadian production is unique and very affecting, as you will have to go back to 2007's Persepolis to find a film that tackles similar subject matter in such a mature, poetic and poignant manner. Even the story within the story that Parvana tells her baby brother has a revealing ending that packs an unexpected emotional punch. This film is about the beautiful art of storytelling as much as it is about the telling of these beautiful stories and director Nora Twomey and writer Anita Doron (adapting Deborah Ellis' book) deliver, with stylish flair and great aplomb, something emotionally rich and evocative, and moreover, an uncompromising ending that speaks volume about the horrendous and cruel situation they have to endure and close the film on a heartbreaking yet truthful note that is rare in live action films, and even more so for animation.",
            "review_date": "2018-06-12",
            "source": "rt"
        },
        {
            "content": "The Breadwinner is a beautifully animated narrative that consistently puts women at the center while depicting a harsh environment of violence controlled by men.",
            "review_date": "2018-06-11",
            "source": "rt"
        },
        {
            "content": "In regards of its visuals, the movie is beautiful and atunning, mixing storytelling with style and actual respect of its artistic roots, and even when Nora Twomey's direction focus on strong-mature subjects and themes, they manages to demonstrate a solid-yet-raw perspective on repression, submission and the hard situation towards the Islamic opressiom in the middle east, told in a unique-heartbreaking fashion.",
            "review_date": "2018-06-10",
            "source": "rt"
        },
        {
            "content": "I loved the story which was very thought provoking. However I thought that at times it was not sufficiently engaging with the pace being too slow.",
            "review_date": "2018-06-10",
            "source": "rt"
        },
        {
            "content": "i think this lacked a focussed story spine",
            "review_date": "2018-06-09",
            "source": "rt"
        },
        {
            "content": "A beautiful animation depicting the hardships of life under the taliban, particularly the hardships of being a girl. My 9 year old daughter was transfixed by the story. Very enriching...",
            "review_date": "2018-06-07",
            "source": "rt"
        },
        {
            "content": "This is not the first time a girl passes as a boy, even in this story in fact! The animation is beautiful, well done and colorful. It is depicting sexism at the governing level and obviously not supported by all. A bit anti-taliban but not too antiwar, it would be interesting to see a similar story happening during the english occupation.",
            "review_date": "2018-05-28",
            "source": "rt"
        },
        {
            "content": "Despite an inventive, informative concept, the animated feature doesn't have much sense of adventure and instead drags.",
            "review_date": "2018-05-28",
            "source": "rt"
        },
        {
            "content": "Definitely a riveting movie. I really want to read the book now. Definitely quite a sad movie. I think its worth the watch. However, I did end up forwarding a lot of the story telling.",
            "review_date": "2018-05-17",
            "source": "rt"
        },
        {
            "content": "Well voiced and expertly paced, The Breadwinner finds a difficult yet delicate balance between eye-popping color and visuals with the harsh reality of life under Taliban rule in Afghanistan",
            "review_date": "2018-05-09",
            "source": "rt"
        },
        {
            "content": "Incredible film...I would be interested to know some Afghans views on it, but from a fairly limited U.S. perspective, I very much appreciated the honesty, depth, and love throughout it. And the artistic device of telling a 2nd story that is pulled like a thread through the primary story works beautifully, bringing art in new ways to the animation at the same time. ",
            "review_date": "2018-04-30",
            "source": "rt"
        },
        {
            "content": "it hurt to watch the way women were treated (btw, still are treated in some parts of the world), worse than animals - with so much hatred, cruelty, and disrespect. However, story of this brave girl is so inspiring with a strong empowering message. I enjoyed it so much!",
            "review_date": "2018-04-28",
            "source": "rt"
        },
        {
            "content": "A winning animated film that is serious enough to have been done live action.",
            "review_date": "2018-04-28",
            "source": "rt"
        },
        {
            "content": "Really puts stuff in to perspective. Also great animation.",
            "review_date": "2018-04-20",
            "source": "rt"
        },
        {
            "content": "Another perfect film from Cartoon Saloon.",
            "review_date": "2018-04-12",
            "source": "rt"
        },
        {
            "content": "Oscar-nominated film The Breadwinner tells the story of a young girl named Parvana (Saara Chaudry) who becomes the breadwinner of her family under terrible circumstances in which her father gets arrested, leaving no male relative in her family. Females aren't allowed to go out without males, so in order to help her family survive, she disguises herself as a boy. She reunites with her friend Shauzia (Soma Bhatia) who is also disguised as a boy to make money to get away from her abusive father. The movie is also set in a time when war has just started. What makes this film so beautiful is that it's so brutally honest. For example, we see women getting beaten up by men for going out in public without a man, and in Parvana's mother's case, her bruises are not hidden for the duration of the film. This is the most realistic animation I've ever watched. It doesn't hesitate to show elements that are normally hidden from children. Make note that this story is actually based on a children's novel. Throughout the movie, Parvana tells the story of a young boy who journeys to retrieve seeds from the evil Elephant King. This story encourages and inspires Parvana to keep going and also entertains her little brother Zaki. As young girls who have to take on hard labor, you don't hear them complain, but instead, you hear them dream. This is what makes the movie less heartbreaking and more hopeful. You can say this is a story very similar to Mulan minus the explicit message of \"girls can do anything that boys can\". I don't think the movie is necessarily meant to teach us something about gender discrimination, but rather to make us aware of some harsh realities. It's a risky move to produce this story in an animated format and not make it seem like everything is perfect in this world the way a Disney princess movie usually does.\n\n---\nFOLLOW https://www.instagram.com/movietvstance/",
            "review_date": "2018-04-10",
            "source": "rt"
        },
        {
            "content": "\"The Breadwinner\" is a reminder that 2D animation can still be stunning as an art form. This movie is emotionally heavy all the way through and at times it even becomes pretty difficult to watch. It is ultimately a hopeful story but it certainly isn't always a pleasant one. The movie becomes aggressively sad at one point but it is set in a horrific society so it isn't surprising. It is a powerful and inspirational movie about going against the odds. The film is an overlooked gem from 2017 that is worth checking out, especially for fans of old-school animation.",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "As you may expect from the people behind Secret of Kells and Song of the Sea, this is an undeniably gorgeous animated film that stands out in the CGI-soaked modern landscape. It's also a quite important story worth telling...unfortunately, it's just never that fully engaging. While the emotions and drama are strong, the beats are fairly basic. Breadwinner is a passable character study that just never comes close to the heights of its other fantasy-realism brethren.",
            "review_date": "2018-03-29",
            "source": "rt"
        },
        {
            "content": "There is in this simple tale more honesty, beauty and understanding about what is really important in life, than in a 100 movies.",
            "review_date": "2018-03-27",
            "source": "rt"
        },
        {
            "content": "My kids are 4, 4, 8.  This movie sparked conversation between us about society.  Very stimulating visually as well as intellectually.",
            "review_date": "2018-03-17",
            "source": "rt"
        },
        {
            "content": "Engrossing story to go along with wonderful animation. ",
            "review_date": "2018-03-13",
            "source": "rt"
        },
        {
            "content": "Stuff like this is why I want to do what I want to do with my life",
            "review_date": "2018-03-12",
            "source": "rt"
        },
        {
            "content": "The Breadwinner is a Poignant and beautiful film. I really enjoyed learning about the DIFFICULTIES of living in an traditionalist, islamic country. Recommended.",
            "review_date": "2018-03-12",
            "source": "rt"
        },
        {
            "content": "proposant une animation efficace en plus d'une histoire réelle et dramatique (le film n'est pas pour les jeunes enfants), The breawinner est probablement l'un des films du genre les plus émouvants et honnête de ces dernières années.",
            "review_date": "2018-03-09",
            "source": "rt"
        },
        {
            "content": "sad and heartwarming. visually stunning.",
            "review_date": "2018-03-07",
            "source": "rt"
        },
        {
            "content": "The Breadwinner insightful film into goings on in the middle east, portrayed in animation and done superbly. ",
            "review_date": "2018-03-05",
            "source": "rt"
        },
        {
            "content": "Beautiful. I watched it 3 times and still love this amazing movie. A must see!!",
            "review_date": "2018-03-04",
            "source": "rt"
        },
        {
            "content": "Muy bonita animacion pero muy triste y deprimente historia. Estoy acostumbrado a que las peliculas de animacion tengan un mensaje mas esperanzador. Pero valio la pena verla",
            "review_date": "2018-03-04",
            "source": "rt"
        },
        {
            "content": "A different way of life.  So this is about a young girl in Afghanistan who goes by the name Parvana (Saara Chaudry).  When her father is suddenly removed from the picture, her family is in a bit of a tough spot because of how radically different the culture treats women over there.  In order to simply walk the street, she disguises herself as a boy so she can provide for her family.  Now this was one that I was excited for, but I had no real means of watching this until after the fact.  It never even got a wide release, so I don't feel like this was really my fault.  At its peak, it was only at 38 theaters nationwide.  So, naturally, when I just happened to see it pop up on the Netflix streaming carousel, I jumped at the opportunity to watch it.  This is a stressful animated film that they have made here.  Now this is from the same studio that made The Secret of Kells, a beautiful little film that featured a tale that I never really got into.  This is not the case with The Breadwinner, and while it does feature the same gorgeous artwork, you are put on pins and needles for what is about to happen next.  It may be a cartoon, but it is a story where I never at any point felt safe for these characters.  You can't get higher stakes than survival, and over in Afghanistan, that is just the norm, and you learn to live with the constant danger of the Taliban.  It shouldn't come as much surprise to say that the way of life is different for women stateside when compared to Afghanistan, but Afghanistan is unique because they are viewed as different classes of people entirely.  These are men who hate women and are constantly ordering them around to the point of violence, and I felt like I easily grasped the message that this movie had to say: that is the status quo over there.  The whole time I watched this, my heart was in my throat, and I could see this ending poorly at any given moment.  It is just the type of movie it is, and I wouldn't have been surprised either way.  Because you are constantly on guard, you are on the edge of your seat throughout, and you are always engaged with the story at every single turn.  There is a great message of equality that is easy to get behind, and it gives you a good understanding of what exactly life is like in the Middle East.  This is a terrific little film that is well worth your time.",
            "review_date": "2018-03-04",
            "source": "rt"
        },
        {
            "content": "A moving, relevant film.  I joined Canadian Women for Afghan Women organization after seeing it.",
            "review_date": "2018-03-04",
            "source": "rt"
        },
        {
            "content": "An animated movie taking a much more adult approach than most, both in content and delivery, The Breadwinner will not be appreciated by general audiences for this very reason. It tackles its issues sensitively but without lamp shading, bravely but not gratuitously. The brutality is not graphic, but all the implications and consequences of it are very much present, making it impactful but not exploitative. The family dynamic is beautifully explored, as is the sexism and discrimination endemic to an entire culture. The animation occasionally looks clunky and awkward, especially when vehicles are involved, but mostly it's a startling departure from the norm, and the fantasy sequences, frequently cut to when the protagonists need a way to briefly digress from their difficult, mundane lives, are beautifully coloured and drawn, blending reality with childish fiction. The Breadwinner likely won't be remembered as it should be, and the mainstream will pass right over it to praise the likes of Coco, but it's a rare treat and isn't afraid to take risks where other animations wouldn't. Watch it as soon as you can.",
            "review_date": "2018-03-02",
            "source": "rt"
        },
        {
            "content": "The Breadwinner features gorgeous hand-drawn animation with some wonderful backgrounds and landscapes. The characterization is quite good and the overall story is moving, urgent in tone and quite powerful. The direction from Nora Twomey and the score are great as well. However, it did not reach greatness as it was seriously offset by its somewhat disappointing third act and annoyingly amateurish, mediocre voice acting.",
            "review_date": "2018-03-02",
            "source": "rt"
        },
        {
            "content": "I think the movie is good, but I think not all of this are correct.",
            "review_date": "2018-03-02",
            "source": "rt"
        },
        {
            "content": "A story of a girl in radical Afghanista that resembles Disney's Mulan in themes.",
            "review_date": "2018-03-02",
            "source": "rt"
        },
        {
            "content": "This movie was fantastic! The animations of it and the story was on point and it look like it was really real all the people who created and helped out with the movie is amazing keep it up lets see if you make The Breadwinner 2!!!",
            "review_date": "2018-03-01",
            "source": "rt"
        },
        {
            "content": "All I can say is that it is amazing, not predictable and enthralling..",
            "review_date": "2018-03-01",
            "source": "rt"
        },
        {
            "content": "This movie is an incredibly moving and disturbing look into what life was like living under the Taliban.  It is very well acted and animated with subtle moments where volumes of emotion are communicated in moments of silence countered with extreme moments of equal weight and power. \n\nHowever the one criticism I have is that this movie is NOT for children.  This is a very adult animated film and should not be marketed with what looks to be another \"Disney Princess\" in the movie poster.   I was about to watch this with my daughter before I read the description of it and then decided I would watch it by myself first to see if it was age appropriate. \n\nI am certainly glad I did because this film would potentially scar a young child as the film is filled with moments of violence and very adult subject matters that a child simply wouldn't understand. \n\nThe PG-13 rating is very much deserved.  That being said for older audiences this is a very eye opening and impactful look into the lives of a culture that most of us barely understand.",
            "review_date": "2018-02-27",
            "source": "rt"
        },
        {
            "content": "Beautiful story with equally beautiful animation. This film moves the heart while opening the mind. The Breadwinner is a must see.",
            "review_date": "2018-02-27",
            "source": "rt"
        },
        {
            "content": "Puntaje Original: 6.5\n\nCon una historia profunda y reflexiva, pero que concluye insatifactoriamente.",
            "review_date": "2018-02-26",
            "source": "rt"
        },
        {
            "content": "A beautiful film, with such depth and emotion I cannot recommend it more.",
            "review_date": "2018-02-25",
            "source": "rt"
        },
        {
            "content": "Beautifully animated and a wonderfully told story that addresses heavy topics ina gentle way for kids- without sugar coating it.",
            "review_date": "2018-02-23",
            "source": "rt"
        },
        {
            "content": "Not as sweet and charming as song of the sea but you wouldnt expect it to be with the subject matter,its a powerful movie and totally deserves its Oscar nomination \nRecommended",
            "review_date": "2018-02-22",
            "source": "rt"
        },
        {
            "content": "Interesting feature from Cartoon Saloon that has a good story to tell.",
            "review_date": "2018-02-22",
            "source": "rt"
        },
        {
            "content": "Woah,that was amazing for such a simply animated film. The hardships of being  a woman in some parts of the world are appalling and have no place in our modern world. \nAnd that Rumi quote at the end really ties it all together.",
            "review_date": "2018-02-21",
            "source": "rt"
        },
        {
            "content": "while different from the book, the film has great characters, stellar animation and the voice cast is very talented",
            "review_date": "2018-02-20",
            "source": "rt"
        },
        {
            "content": "Beautiful, haunting movie...",
            "review_date": "2018-02-20",
            "source": "rt"
        },
        {
            "content": "Beautifully animated film also delivers a powerful story.",
            "review_date": "2018-02-17",
            "source": "rt"
        },
        {
            "content": "This movie should be seen by every American. Every single one. It is so beautiful and an important to our times. ",
            "review_date": "2018-02-13",
            "source": "rt"
        },
        {
            "content": "Impressive animation and a touching story about a young girl who is forced to pretend to be a boy to provide for her family after her father is arrested in 2001 era Afghanistan.  The characters and story grab you and the animation is good.. ending is a bit too abrupt for my tastes but its a good movie.",
            "review_date": "2018-02-10",
            "source": "rt"
        },
        {
            "content": "When we read (or watch) \"The handmaid's tale\" we call it dystopic, forgetting that in some part of our little planet the life's conditions are similar if not worse. Movies like these are part of the reminder, and they are always welcome. That being said: visually is very good, but the story miss some structure.",
            "review_date": "2018-01-03",
            "source": "rt"
        },
        {
            "content": "An important story beautifully told!",
            "review_date": "2018-01-01",
            "source": "rt"
        },
        {
            "content": "Proving that 2d animation still has a place in entertainment, Cartoon Saloon continues to impress with The Breadwinner, proving also that animation can be directed at a more mature audience.",
            "review_date": "2017-12-28",
            "source": "rt"
        },
        {
            "content": "a total delight, great great touching story",
            "review_date": "2017-12-20",
            "source": "rt"
        },
        {
            "content": "Subtle, yet to the point, 'The Breadwinner' puts itself out there and the reward is a movie that in engaging, honest and thought provoking.  It doesn't have the flair of some other animated films of the era, but the story caries the day.  It's also beautiful to look at, proving once again that beauty is in the eye of the beholder.  Final Score: 8.7/10",
            "review_date": "2017-12-14",
            "source": "rt"
        },
        {
            "content": "A marvel and one of the great highlights at the 2017 Ottawa Animation Festival. Just the visual styles alone make for an extraordinary film. Then there is the story: told with such wit, insight and intelligence that you afterwards you can hardly believe you enjoyed a tale of such harrowing injustice (that so many women face whereever ugly mysogony reigns – from Afghanistan to Alabama).",
            "review_date": "2017-12-12",
            "source": "rt"
        },
        {
            "content": "3/14/2018\nSuch a lovely piece of animation set against the backdrop of the chaos that is/was Afghanistan. Amidst the hate and intolerance thrown by society, kindness and charity resonated more as it gives people hope. I was literally choking back tears of introspection when the overall message of the story was said loud and clear at the end. \"It is the rain that grows flowers, not thunder.\"",
            "review_date": "2017-12-11",
            "source": "rt"
        },
        {
            "content": "excellent, engaging, and heartbreaking",
            "review_date": "2017-12-11",
            "source": "rt"
        },
        {
            "content": "This is a movie that adults will enjoy as well as children. I took my 11-year-old daughter to see it, and we both enjoyed the story and animation. It's a tough film, in my ways, but I think it's important to expose kids to what's going on in the world. After the wall, I was careful to explain to her that while the Taliban were extremist Muslims, they do not represent all Muslims. An animated film shouldn't be too pedagogical, but I do think that any responsible adult taking a kid to this film should encourage intelligent conversation with your children about the topics the film engages. Films like this are so much better than the usual Disney dreck!",
            "review_date": "2017-12-02",
            "source": "rt"
        },
        {
            "content": "typical western stereo typical racist depiction of other people's cultures. the film seems so interested in women's rights but less interested in western Imperial wars that do the most to take them away. watch it for liberal outrage value. nothing more",
            "review_date": "2017-11-24",
            "source": "rt"
        },
        {
            "content": "Beautiful. Unique. Heart-wrenching. Inspiring. Don't miss this.11 year old growing up under the thumb of the Taliban in Afghanistan and the horrors her family encounters.",
            "review_date": "2017-11-22",
            "source": "rt"
        },
        {
            "content": "The Breadwinner is a universal tale of self-empowerment, hope and creativity!  It has empathy, love and survival as its core themes, wrapped in the most artistically brilliant animation.  It speaks to my heart and reminds me that the best of animation can make me believe in the power and strength of the human spirit.  Thank you to all the creative individual artists that were involved in the making of this film.  Thank you for sharing this beautiful and timeless story with the world!",
            "review_date": "2017-11-17",
            "source": "rt"
        },
        {
            "content": "its bit of amazing story wont save it from the bad animation.",
            "review_date": "2017-11-17",
            "source": "rt"
        },
        {
            "content": "Some characters' stories end happily, many sadly, some we don't know yet. All of them are beautifully told.",
            "review_date": "2017-11-17",
            "source": "rt"
        },
        {
            "content": "Harrowing and eye-opening, the striking hand-drawn animation and true-to-life plot elevate the script which doesn't always stay consistent.",
            "review_date": "2017-11-12",
            "source": "rt"
        },
        {
            "content": "A powerful story with spectacular animation. The best animated movie of the year, so far. Good timing for it to come out this year. The Breadwinner is very adult but kids need to see this. Everyone needs too see his. The animation is beautiful and fits with the storytelling. The Breadwinner is an amazingly animated tearjerker with a very moving story. A",
            "review_date": "2017-09-26",
            "source": "rt"
        },
        {
            "content": "Superb story beautifully animated made even more special when watched as a preview at the Ottawa International Animation Festival 2017.",
            "review_date": "2017-09-23",
            "source": "rt"
        },
        {
            "content": "Very Moving and beautiful animated story",
            "review_date": "2017-09-11",
            "source": "rt"
        }
    ]
}