{
    "rating": 9.3,
    "release_date": "1995-01-27",
    "num_reviews": 50,
    "genres": [
        "Romance"
    ],
    "summary": "On his way to Vienna, American Jesse (Ethan Hawke) meets Celine (Julie Delpy), a student returning to Paris. After long conversations forge a surprising connection between them, Jesse convinces Celine to get off the train with him in Vienna. Since his flight to the U.S. departs the next morning and he has no money for lodging, they wander the city together, taking in the experiences of Vienna and each other. As the night progresses, their bond makes separating in the morning a difficult choice.",
    "reviews": [
        {
            "content": "This movie does not get old for me. Every 5 years or so, I watch it. It's better every time.",
            "review_date": "2023-04-14",
            "source": "rt"
        },
        {
            "content": "A god awful movie. No chemistry. Thoughtless banter from toxic morons. Truly the worst movie I have ever seen. \n\nHere is my theory, most people hated this movie and turned it off within minutes, and in even less time completely forgot the movie existed. So the movie was so forgettable it never occurred to them to review the movie. That represents the highest insult, for most this movie was completely forgettable.",
            "review_date": "2023-04-11",
            "source": "rt"
        },
        {
            "content": "Young American man meets  French girl on a train during his trip from Budapest to Vienne. the story takes place in Vienna, Austria, in 1990s. While they  are having a talk on a train restaurant, they understand that they are having a good connection.  So that Jesse  offers Celine to get off the train in Vienna and spend amazing night  together. they share their thoughts about love, purpose of life, death and so the on. The main characters, played by Ethan Hawke and Julie Delpy, evoke passion to live in the audience. The film is only focused on main characters and some other tertiary characters, which makes it so good. I really love the scenes they have deep talks about their beliefs. The only bad thing about this film is it ends.",
            "review_date": "2023-04-04",
            "source": "rt"
        },
        {
            "content": "what a wonderful and touching film!  I felt inside the movie dating and walking through the streets of Vienna! 😍",
            "review_date": "2023-03-15",
            "source": "rt"
        },
        {
            "content": "Lovely film, well shot, well written and gave another outlook at romance in films. Some perfect scenes that I especially loved. Some areas I didn't like as much but overall a well made film with a brilliant tempo.",
            "review_date": "2023-03-06",
            "source": "rt"
        },
        {
            "content": "there is no storyline acting was ok boring not worth wasting time i want my money back",
            "review_date": "2023-03-06",
            "source": "rt"
        },
        {
            "content": "Enjoyed it very much. Especially seeing some sights around Vienna.",
            "review_date": "2023-02-24",
            "source": "rt"
        },
        {
            "content": "Beautiful, natural, gritty, real film. Romantic and real. A slow paced dialogue movie with so many golden moments and perfectly written lines. 10/10.",
            "review_date": "2023-02-22",
            "source": "rt"
        },
        {
            "content": "Really nice story. Perfect example of two people with nothing in common but being young getting excited about the spontaneity of 1 possible night together. Not a rom-com b/c it's not even trying to be funny, but it's very romantic and there's some great thought-provoking dialogue",
            "review_date": "2023-02-15",
            "source": "rt"
        },
        {
            "content": "Before Sunrise feels about as real as a romance movie can get, and yet, is sad to assume that so few people have actually experienced these sweet moments. Jesse (Ethan Hawk) and Céline (Julie Delpy) meet on a train in Central Europe. He's flying out of Vienna to return to the States and she's resuming her studies in Paris (the Sorbonne, nbd) after a trip to Budapest. Jesse asks Céline to get off with him, to keep him company for the approximate one day before his flight, and she goes with him. I've been to Vienna and while it's a grand, imperial-feeling city, \"romantic\" is not one of the words I'd use to describe it. And yet, there's something about a budding Love Story that can turn any city into 1920s Montmartre. The fact that Linklater puts this couple here instead of Paris, Positano, Bruges, or Barcelona is a testament to the realness of this attraction and not something buttressed by beautiful environs. Jesse and Céline, for the most part, talk like many people talk; he's deep, but unrefined, and she's smart, but not pretentious. The pair hit the city and do all of the inexpensive things you do in a European city and talk about all the things you talk about when you're in a Linklater movie: Love, Reincarnation, First sexual encounters, breakups, childhood, etc. (On the train, Jesse also presciently basically describes 24/7 streaming). I did find it amusing that Céline says that \"feminism was started by men for sex\" (para), referring to 3rd Wave Feminism, a Gen X-led movement that is now being criticized on the same grounds. There's no melodrama here. Even when you think a pair of men may say something crude as their gaze follows Céline as she passes, they don't. There's no big reveal, no blow-up fight. The conflict is solely the conflict every single one of us undertakes in some way or another: the pulverizing plodding of time. I adored the final montage of shots showing, what seemed like, each and every shot of the city where our protags had only been hours before, but now, empty. I plan to complete the trilogy much sooner than expected.",
            "review_date": "2023-01-18",
            "source": "rt"
        },
        {
            "content": "Before Sunrise (1995) is mainly just talking, but luckily because of its great writing and performance, it still manages to be very interesting.",
            "review_date": "2023-01-13",
            "source": "rt"
        },
        {
            "content": "A lucid portrayal of a charming love story mixed with life philosophy. It's aged like a fine wine, mid nineties Vienna delivers a perfect rose tinted nostalgia for viewers today. An absolute favourite.",
            "review_date": "2023-01-08",
            "source": "rt"
        },
        {
            "content": "Probably one of the best romance movies I've ever seen in my life and I love all of the sequals.",
            "review_date": "2023-01-04",
            "source": "rt"
        },
        {
            "content": "I have never wanted to watch the next movie in a trilogy more then in this one, what a movie. Ethan Hawke and Julie Dehpy have maybe the best chemistry in a movie I have ever seen, it all feels so natural. The direction is incredible, the script is one of the best I have ever seen, the city feels like a person and the locations are beautiful, but still grounded. I can't wait to watch before sunset today and probaly before midnight right after it, WOW",
            "review_date": "2023-01-03",
            "source": "rt"
        },
        {
            "content": "An intelligent, natural, sensitive and beautiful romance.",
            "review_date": "2022-12-14",
            "source": "rt"
        },
        {
            "content": "Easily one of the best trilogies ever made and an incredible romance film in its own right, the two leads have dazzling chemistry and carry the whole film with ease.",
            "review_date": "2022-11-21",
            "source": "rt"
        },
        {
            "content": "This is one of my favorite movies of all time thanks to effortlessly and naturally delivered story of an encounter that took place still in an age of BEFORE. Before Internet, before the world shrunk, before humankind got silly and impatient, before the chaos, before the disinformation, before mistrust, before we lost hope for global collective happiness",
            "review_date": "2022-10-23",
            "source": "rt"
        },
        {
            "content": "You'll experience a certain kind of magic and a sense of relatability in each scene of the film.",
            "review_date": "2022-10-15",
            "source": "rt"
        },
        {
            "content": "I absolutely love this masterpiece.",
            "review_date": "2022-09-28",
            "source": "rt"
        },
        {
            "content": "I liked this film primarily for the thoughtful dialogue and the fact the plot line is mostly quite subtle - it doesn't feature anything ludicrous happening and the two main characters seem pretty laidback and so it just seems to flow quite well, as an interesting romantic drama type film. Given the American character is in Europe, I suppose I could compare aspects of the plot (thematically) to Lost in Translation, which is another great film about feeling somewhat lost and lonely. I wouldn't say the two main characters in this film are expressly lonely per se but there did feel (to me) to be that element of isolation and companionship of course. It is somewhat philosophical in tone - a somewhat deep film, moreso than a lot of the not so memorable romantic comedies. There are discussions about death, dreams and religion and the characters share some of their secrets.\n\nWould I recommend it? yes, definitely. It gets two thumbs up from me, although if your not at all keen on gentle, slow films (plot pace wise) or romance type watches then this may not appeal to you.",
            "review_date": "2022-09-01",
            "source": "rt"
        },
        {
            "content": "Saw it for free as part of a studio sneak preview that was opened up to college students and others on campus; This was so unique and good, I felt like I'd STOLEN my way into the film. HIGHLY RECOMMEND.",
            "review_date": "2022-08-31",
            "source": "rt"
        },
        {
            "content": "In 2022, this boring 90s plot just doesn't tick any boxes. The romance was dry. Ethan Hawkes character was a boring mysoginist who managed to somehow charm a woman so deeply despite her obvious morals and attractions. I only watched because I heard \"Before Sunset\" had a well written ending. After suffering through this hour and a half POV of a mid-tier first date I'm having doubts about its sequel.",
            "review_date": "2022-08-22",
            "source": "rt"
        },
        {
            "content": "The trilogy is great. It captures very well the pleasure and excitement of meeting someone you know you will fall love for; more, the joy of meeting  that person in a serendipitous manner - all profound aspirations of any romantic person. \n\nThese two young people meet on a train. He is traveling to Vienna to catch a flight, she is traveling back to Paris. There is an instant mutual interest. They get to know one another in a single night, and the audience follows them in that journey. It is not always very exciting and at times it is a bit boring, but the movie never falls short of a love piece. In addition, it captures well the stereotypical differences between American and European people, although I would say that he is a very European man in his way of approaching love. All these are stereotypes and possibly very off, what I mean is that he does not seem to be operating on \"dating\" mode (traditionally American).  Overall, beautiful in the way that brings us back to finding love.",
            "review_date": "2022-07-30",
            "source": "rt"
        },
        {
            "content": "Beautifuly filmed, captures a feeling a moment. The characters feel very real and relatable, and it really transmits the feeling of meeting a complete stranger and having a better time than you would with someone you know.",
            "review_date": "2022-07-15",
            "source": "rt"
        },
        {
            "content": "Really gorgeously shot and scripted, wonderfully acted, with natural and thought provoking discussions.",
            "review_date": "2022-07-07",
            "source": "rt"
        },
        {
            "content": "It's incredible how 95 minutos of two people just talking to each other can be as lovely, deep and entreteined as this is.",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "A realistic, intelligent, thought-provoking, soothing, contemplative, absorbing, insightful and heartfelt exploration of romance and modern love, anchored by beautiful cinematography, deft filmmaking, and naturalistic and charismatic lead performances by Ethan Hawke and Julie Delpy.",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "This film is almost a complete bore, unless you are a guy who adores women with French accents. As a cynic who's a romantic at heart, Ethan Hawke is simply over his head in this one. The plot is two people who meet on a train, can't resist one another, and so they talk all night, boring me to death. I found neither of them intriguing, although Julie Delpy was at least not awful. Ethan Hawke was awful. Richard Linklater's script was a talky, pretentious mess, an attempt to put together a classic romantic film like days of yore, except these two actors have not the glamor, charisma, or lines to say. All of this is my opinion, of course, and if you simply LOVE, LOVE, LOVE Ethan Hawke and want to hear him talking all the time to a French woman who talks a lot too, that is, until they have first-go sex, well, this is your film. Otherwise, I think it's yet another sign that Hollywood no longer knows how to make great romantic films, or else the problem is, I really don't want to hear Richard Linklater's romantic views because they are so typically male. This film is the first in a trilogy, but I did not care to see the others. Sorry about that. And I do not know why in the world this film is rated 100% fresh.",
            "review_date": "2022-04-11",
            "source": "rt"
        },
        {
            "content": "There is no romance movies that so realistic and emotional than this movie in the entire world. It's a masterpiece and forever stay deeply in mine mind and heart.",
            "review_date": "2022-04-05",
            "source": "rt"
        },
        {
            "content": "We'll just make tonight great.\nBye\nGoodbye\nAu revoir \nLater.\n\nConversational cinema holds a special part for me. If done right, I could go through more emotions just by listening to people talking than watching any other movie genres.\n\nThis philosophical yet beautifully romantic movie left me with feelings and yearning. Ethan Hawks and Julie Delpy were a match in heaven. It's weird how drawn in I was, watching a couple walking about Vienna and talking about life, death, reincarnation, morality, feminism, and more. I could listen for twice the movie runtime, and maybe I wouldn't even be bored.\n\nThat fake telephone scene. Oh my, it's one of those few times that I catch so much feelings. The more they talked, the more I wanted the soon-to-be sunrise to never come. \n\nOn one hand, I think that it didn't really matter whether I understood what they were discussing about or not, because the chemistry and seemingly genuine interest between the two characters are the real point. \n\nHowever, on the other hand, I think it's important that I comprehend the idea from each conversation. I had this thought that the movie isn't really realistic, because who would ever talked that much philosophy on a honeymoon? But then maybe it's not meant to be realistic. By discussing so many aspects of life yet included them inside one small but significant night, the director wanted me to be able to appreciate the wholeness of life while not forgetting the little moment that also makes life special. And that's exactly what I felt. \n\nAlso to the point that the movie felt unrealistic and absurdly peaceful. What if, these two characters just recently died. Now they are in some kind of purgatory before going to heaven. That's why they talked about life and death, reflecting on their lives. And also why they can only meet each other for one night before going to heaven. It may not make sense. \n\nOverall, it's one of the most beautiful piece of cinema that immersed me from the moment the conversation started. 10/10",
            "review_date": "2022-03-29",
            "source": "rt"
        },
        {
            "content": "I'm not a fan of a dialogue-only film, but I never knew that I would be so invested in watching two people talk. There's so much depth and connection that most romantic films have failed to capture, but this film perfectly encapsulates the magic of falling in love.",
            "review_date": "2022-03-17",
            "source": "rt"
        },
        {
            "content": "Great film and not what I expected. Easy to watch and enjoyable too.",
            "review_date": "2022-03-10",
            "source": "rt"
        },
        {
            "content": "เกินบรรยาย ไร้ที่ติ ขึ้นหิ้ง",
            "review_date": "2022-03-08",
            "source": "rt"
        },
        {
            "content": "Richard Linklaters Before Sunrise has taken me completely by surprise. There's not much I can say about it right now because my mind is still stuck in Vienna, but I'll do my best.\n\nFilms have a crazy way of showing us emotion and making us feel it alongside the characters, and there's no doubt that Before Sunrise will make you feel love. From the moment Celine and Jesse meet on the train till the very end, love is radiated, even in small moments like walking through a graveyard or running after a train. I really enjoy how Linklater chose to shoot this film, with long shots and shaky camera effects, it all feels so real. It does a great job of transporting you into the world they're in by seemingly getting rid of the screen before you and putting you in the room with them, which is definitely due to the film style, and I love it. The score! Or should I say, the absence of one? I love the stillness that comes with no music and it adds onto why this feels so real. When a movie loses its music part, the actors have to try a little harder to act out an emotion since there's no music assisting them, and Ethan Hawke + Julie Delpy do a great job of this. Their acting and chemistry is so amazing that you hardly even realize you're missing such an important aspect. Such great writing and directing!\n\nThere's something else that is almost indescribable about it… I can't really piece together what it is but it's a feeling that is constant. A sort of ambience of happiness, maybe. Happiness seen by Jesse and Celine as they walk around Vienna in the middle of the night, but happiness of these side characters too. It's as if the relationship between our two main characters is radiant to those around them. Small details that I could totally be blowing out of proportion, but just a thought I had while watching.\n\nThis whole film brought me joy. I really enjoyed watching it and could hardly take my eyes off of it. I've always loved Linklater (School of Rock being one of my all time favorites) and this was a long overdue watch. I see now why people love it so much, it's a genuine love story and it's extremely entertaining. A must see film!",
            "review_date": "2022-02-23",
            "source": "rt"
        },
        {
            "content": "There's not much to this in the way of an interesting plot or anything like that, yet this works wonderfully. Hawke and Delpy have outstanding chemistry to the point where their conversations are incredibly engaging. I was hooked from start to finish and fell for these characters.",
            "review_date": "2021-12-05",
            "source": "rt"
        },
        {
            "content": "Before Sunrise - 10/10. I wanted to focus on the incredible love story that is Before Sunrise. Richard Linklater found a special energy and aura when creating this masterpiece. There is something so beautiful and honest with this film. I can't explain it, and neither can anyone whose ever watched this film. Its something that can only be felt by people that have ever felt some sort of love in their life. Taking place in the beautiful city of Vienna, the story revolves around a chance meeting between two people on a train. As they get off and decide to spend a day together, they embark on a life changing meeting, falling in love so deeply that it affects their souls with purity. Romance is so hard to capture, and this film really found an element of love that many of the best romance films aren't able to achieve. It really lies upon the performances of Ethan Hawke and Julie Delpy. Their energetic and poetic portrayals of love is what makes this film so special. You can feel the love of the characters. The subtle acting cues they give, the way they translate the incredible dialogue written onto the screen, the way they seem to float in the airy magic of the love in the film is what makes this film top tier romance film. I also loved how this film literally has no background score. Sometimes you don't need music to make you feel what you see on screen. Its just something intuitive when watching this film. You have no reason to check your time, and thats the brilliance of Linklater and how he directed the film. Its like hanging with two people, and seeing where they go and say. Its literally a movie you need to see before you die, and its a film that definitely makes you feel love wholeheartedly.",
            "review_date": "2021-09-20",
            "source": "rt"
        },
        {
            "content": "The entire trilogy is an exceptional work, but this chapter is still the best.  A brilliantly written intelligent film capable of stirring minds and feelings.",
            "review_date": "2021-09-13",
            "source": "rt"
        },
        {
            "content": "A different and fantastic story leaded by beautiful and natural performances, so enjoyable.",
            "review_date": "2021-09-02",
            "source": "rt"
        },
        {
            "content": "These are the reasons I love Richard Linklater. It's a thought provoking and gorgeously shot humanistic look at romance. All in the course of one night, we observe this couple meet and greet to know each other, through various adventures and realistic, organic conversation. It's electric.",
            "review_date": "2021-08-07",
            "source": "rt"
        },
        {
            "content": "It's like following someone else in real life on a date. So too boring for me. The only thing interesting about it for me was to see how Vienna looked like in 1994 and compare every location to today.",
            "review_date": "2021-07-10",
            "source": "rt"
        },
        {
            "content": "PERFECTION!\n\nHow I wish I could meet and fall in love with someone like that.\n\nAnyway, Before Sunrise is, in my opinion, one of the best films about young love that is realistically beautiful.",
            "review_date": "2021-05-31",
            "source": "rt"
        },
        {
            "content": "It is that good. 8.75/10",
            "review_date": "2021-05-30",
            "source": "rt"
        },
        {
            "content": "Perfect Gen X movie .   It really captures the time and being that age.",
            "review_date": "2021-05-18",
            "source": "rt"
        },
        {
            "content": "\"Before Sunrise\" achieves what so many romance films only wish they could; it exhibits how two people can fall in love, deeply and honestly. Some might argue it's just all talk but that's exactly how people fall for each other. I have called this the most romantic film I have ever seen.",
            "review_date": "2021-05-02",
            "source": "rt"
        },
        {
            "content": "Truthfully, much of the conversation in Before Sunrise is a bit unrealistic.  Richard Linklater's film centers around the brief relationship between Jesse (Ethan Hawke) and Celine (Julie Delpy), two travelers who meet on a train and spend an evening together walking the streets of Vienna.  They discuss life, love, sex and wax philosophically on a wide range of other subjects, all of which seems a bit intense for a first meeting.  However, the chemistry between the two characters is palpable and Linklater manages to make the audience invest in the relationship without question.  Where the film truly soars is the little moments that are captured, like their first kiss while on the top of the ferris wheel or the furtive glances that are exchanged in the music booth.  It's a joy to watch and will undoubtedly stir up memories from our own past.  The film is nothing if not relatable.",
            "review_date": "2021-05-02",
            "source": "rt"
        },
        {
            "content": "Best romantic movie ever.",
            "review_date": "2021-02-24",
            "source": "rt"
        },
        {
            "content": "I actually really enjoyed this movie when I didn't think I was. It was pretty cute and relatable.",
            "review_date": "2021-02-24",
            "source": "rt"
        },
        {
            "content": "Es la película más hermosa que he visto en mis jóvenes 19 años de vida, es una obra de arte en toda la extensión de la palabra, me tocó el corazón de una forma que nunca antes una película lo había hecho, seas soltero, con pareja o casado, es una película que vale la pena ver si quieres por un rato vivir un cuento de hadas, porque si bien es algo que a cualquier le podría pasar, la experiencia de verlo es inexplicable, la mejor película de amor que he visto.\nEso sí, si la vas a ver que sea con tiempo porque meto las manos al fuego porque vas a querer ver ya mismo la siguiente.",
            "review_date": "2021-02-15",
            "source": "rt"
        },
        {
            "content": "So I was at my friends house and we were watch Wonder Woman 1984 and after we finished that disaster of a film he asked me which film I wanted to chose next. I had never used HBO MAX but after scrolling I recommended Citizen Kane and said no, Then I come across one of my most anticipated film of all time Before Sunrise. So we watched it, and let me tell you I think this might be the best written film I have ever seen, an I think one of the best films ever. The film is about a French student Celine (Julie Delpy) and a young American man Jesse (Ethan Hawk) as they stubble on each other on a train Jesse is on his way to the airport in Vienna and Celine is on her way to France. After talking to each other on the train Jesse asks Celine if she wants to get off with him in Vienna and she does. I don't want to spoil the rest of the film because this is something you need to experience for yourself. This is a film that feels very human and personal the actors feel like real people like their not on camera, they have the best film chemistry I have ever seen. The film is only dialogue almost nothing happens but it is so entertaining, I never thought people talking to each other in single shots can be so entertaining but it is. I not going to say much more this is a must see film for movie lovers. I am giving this a 10/10 .",
            "review_date": "2021-02-12",
            "source": "rt"
        },
        {
            "content": "One of the classic 'conversational' romances, a chronicle of a relationship built on small moments, lighthearted conversation, and furtive glances. There is such an imposing mountain of garbage love story films out there that is essentially the motion picture equivalent of potboiler novels that you find scattered in gutters and garbage cans, that seeing something sincere but largely original is a rather strange experience; the conversations feel organic and improvisational, the small encounters carry a spontaneity but also have weight. Simple in structure but timeless as a result, Before Sunrise is such a good start to the trilogy that it made people ignore how applying the same multi-year filming format to Linklater's own Boyhood didn't work without the same quality to the dialogue, screenplay, and performances. (4.5/5)",
            "review_date": "2021-01-10",
            "source": "rt"
        }
    ]
}