{
    "rating": 8.3,
    "release_date": "1995-05-19",
    "num_reviews": 510,
    "genres": [
        "Action",
        "Adventure",
        "Mystery&thriller"
    ],
    "summary": "Detective John McClane (Bruce Willis) is now divorced, alcoholic and jobless after getting fired for his reckless behavior and bad attitude. He is called back into action, however, when a cryptic terrorist (Jeremy Irons) takes New York City hostage in a lethal game of \"Simon Says\" and refuses to speak with anyone but McClane. Teaming up with a street-savvy electrician named Zeus Carver (Samuel L. Jackson), McClane dashes through the city, trying to stay one step ahead of a murderous plot.",
    "reviews": [
        {
            "content": "The greatest 02 hours: and 08 minutes ever!!!!!!!!!!! Rated R for Language and Graphic Images of Violence and Gore Throughout!!!!!!!!!!",
            "review_date": "2023-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Die Hard movie with an interesting plot and a duo that I did not know that I want but I needed it 😀",
            "review_date": "2023-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Classic Action Film. It's a combination of Lethal Weapon & Dirty Harry done very well. The acting overall is excellent. The chemistry between Willis & Jackson is phenomenal. The jokes, clever situations they get in, and the bond they form is the best thing to watch. The villain is very good also being very menacing and memorable. Everyone else does a very good job also and never feels generic or forgettable. The cinematography is very well done. The special effects are incredible, the camerawork is excellent and the action scenes are very memorable. The only problem is the ending is a bit anticlimactic and there are several plot holes and convivences. (Why doesn't Simon just kill John when he captures them given how badly he wanted them dead before, the aspirin bottle, how did Simon's Goon not know about the switch) The music is very good also giving enough of a remix of the original with some new stuff as well though I wouldn't call it as memorable as the first. The editing is very well done also. It does jump around a bit with the School Bomb and them on the ship in the second half for a significant period of time but its still very well done. The only real problem is the pacing which is still solid. The first half of this is incredibly action packed and never feels bloated or over the top. However, things slow down and it becomes more of a thriller and does not keep the frantic pacing of the first half. The ending also which is ok is kind of a letdown. If the ending had been better or the several plot holes fixed or both than this would've been an all timer. But regardless anyone who is a fan of the actors in this, the director, or Action/90's films will love this. This is really good and holds up well. It's great to see a witty clever sequel like this so well done.",
            "review_date": "2023-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great acting by Bruce Willis and Samuel L. Jackson created the best duo imaginable. \n\nHelicopter go boom-boom",
            "review_date": "2023-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's awesome but i think it had too much ooohhhh that's raasssissttt but anyway its good",
            "review_date": "2023-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best Die Hard movie! Much better then part 1",
            "review_date": "2023-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whether it was for my own enjoyment or torture (delete as applicable), over the Christmas/New Year period I decided to (re)watch all of the Die Hard movies.\n\nDie Hard (1988)\n\nThe original, and probably the best film in the series, is the film which really put Bruce Willis on the map as an action hero.\n\nIt's a brilliant film from start to finish and has Alan Rickman stealing the movie as the psychotic villain of the piece.\n\nIt's a guilty pleasure of mine, oh and it is definitely a Christmas movie!\n\n8/10\n\nDie Hard 2: Die Harder (1990)\n\nI'm not sure I'd ever really watched this all the way through. It's a preposterous film of jaw dropping action and early 90s special effects. \n\nDirector Harlin weaves an over complicated story into something which is stupidly entertaining and highlights all of Willis' skills as an anti-hero.\n\nAnd another Christmas movie!\n\n7/10\n\nDie Hard With A Vengeance (1995)\n\nThe third film in the series is probably my favourite of all of the films, and a lot of that is down to Samuel L Jackson's appearance as Willis' companion. It's a triumphant performance. \n\nThe first 60 minutes of the movie are absolute perfection, almost intoxicating action sequencesl, with the lead characters at the peak of their skills. Unfortunately, the film falls away badly in the second half with the ending being a load of rubbish. \n\nA notable mention to Jeremy Irons for his performance as the movies main villain Simon. \n\n7/10\n\nLive Free or Die Hard (also known as Die Hard 4.0) (2007)\n\nTwelves years after the third film the quality of movie itself has dropped considerably, though the movie looks a lot better due to the advances in technology. \n\nThe story isn't remotely plausible, in fact it's rediculous, but with Willis wanting to revive his former character (for financial gain I'm sure) he goes all out, balls to the wall, pushing his character well beyond his limits. \n\nAs action films go there's enough stuff blowing up here to satisfy action fans all over the world. It just needed more substance for me. \n\n6/10\n\nA Good Day to Die Hard (2013)\n\nOh dear! For anyone who loved the original films, especially the original, this is an absolute \nabomination.\n\nWillis is older now and just can't deliver the character we've loved for  over 25 years. \n\nIt's a Die Hard film in name only. Sub-par and terrible. \n\n4/10",
            "review_date": "2023-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Would have been the best in the series, if it wasnt for that theatrical 3rd act, much prefer the deleted one. The production design is insane, super underrated in my opinion, everything holds up really well, except for some editing choices. The performances of everyone are great, the plot is good until the 3rd act and maybe the ending was a bit weak, but who cares, Bruce Willis and Samuel L. Jackson were playing kids games for the whole movie.",
            "review_date": "2023-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was the last great installment in the Die Hard franchise. Although I still think Marv from Die Hard 2 is the best companion of John Mcclane, Zeus almost levels him up with his own comedic effect that only Samuel. L Jackson can pull off.\nOf course the original Die Hard is the best of the bunch, but this one seals the package that should've been kept shut forever.",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A tacked on ending doesn't stop this movie's freshness that is defined by its relentless pace, amazing action and fantastic interplay between Willis and Jackson.",
            "review_date": "2022-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good action. Fun watch ",
            "review_date": "2022-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An underrated sequel. 2nd best die hard movie. Very rewatchable. Jeremy Irons and Samuel L. help make it a blockbuster",
            "review_date": "2022-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jackson Carried this movie",
            "review_date": "2022-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely amazing always action sometimes can get a bit boring maybe because I've seen it more times than I can count but definitely a must. See movie.",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first half of the film is a real treat thanks to some thrilling moments and great chemistry between it's lead stars but then later falls into a disappointing Hollywood trap",
            "review_date": "2022-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lacking any creative story work. Die Hard with a Vengeance tries its best to hide the chemistry between Bruce and Samuel but it cannot hide its poorly written story.",
            "review_date": "2022-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like that this movie came up with something new and it doesnt have to always happen on christmas like the Home Alone .",
            "review_date": "2022-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good great acting and as far as I can tell no CGI",
            "review_date": "2022-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie series of all time!",
            "review_date": "2022-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought die hard with a vengeance was a very good film and a better sequel than die hard 2 and the cast was also really good especially Jeremy Irons who plays hans gruber's brother Simon",
            "review_date": "2022-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "John McTiernan (thankfully) returns to the franchise in this third entry that serves as the most intense iteration of the Die Hard concept/plot. Samuel L. Jackson and Willis make a good begrudging pair of substitute cops in this fast-paced action vehicle greatly bolstered by the calculating villainous presence of Jeremy Irons.",
            "review_date": "2022-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is jam-packed full of raw thrills and unmissable action. Samuel Jackson and Bruce Willis were a strange, yet entertaining duo in this sequel. It was fantastic to see Hans's manipulative brother Simon take part in this movie with all of his genius, sneaky, and mastermind tactics against Zeus and John, playing games with the two throughout the duration of the story. I am fully satisfied with this film's capacity of action and adventure, you won't be tempted to fall asleep during this thriller. I loved the scene in which Zeus is in the subway station ready to answer a phone call from Gruber while an officer threatens to arrest him. It is identical to the robbery scene in The Incredibles in which has almost the exact same setup! It's hilarious to watch. This is a worthy follow-up to the first two movies in the franchise and contains all the thrills everyone wants to see in any Die Hard movie. Love it!",
            "review_date": "2022-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as Die Hard, but a worthy addition to the franchise.",
            "review_date": "2022-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny and original, ages 17+ only!!!!!!!!!!!!!! LOL.",
            "review_date": "2022-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie A lot of language though. ",
            "review_date": "2022-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die Hard with a Vengeance is a thrill ride from almost beginning to end. This movie does get pretty ridiculous at parts, however that kind of adds to the fun. It's more profane & violent than the other installments in this franchise, but this film is strangely more light-hearted, as well. Perhaps that's just because of the chemistry between Bruce Willis and Samuel L. Jackson. No, it's not as good as the original movie, but there are very few sequels that are.",
            "review_date": "2022-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Bruce Willis's Best movies he's ever done! My favorite out the Die Hard Franchise! Definitely 5 Stars!",
            "review_date": "2022-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining and action packed with fun dialogue, it can often be confusing and it just seems to keep adding more and more random things.",
            "review_date": "2022-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely the best die hard sequel and a fun action roller-coaster of a film that anyone can enjoy watching. I don't get how die hard 2 or 4 is rated higher then this.",
            "review_date": "2022-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is better than the second one, but it still gets far of being as good as the first one.",
            "review_date": "2021-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you liked the first die hard and the second one was too much of the same but not as good, you will definitely enjoy this. John McClain get mixed up inevitably with a madman's bomb threat scheme that specifically requires him (John) to solve riddles to stop detonation, but there is more going on and the revelation is quite chilling and Samuel L. Jackson as Zeus is equally as good and makes you wish he was in further movies. Like lethal weapon these guys are natural and early on racial tensions get intense but they end up putting their differences aside and form a connection that truly is inspirational!",
            "review_date": "2021-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bruce Willis gets help from Samuel L Jackson in this third installment of the DH Franchise. They are just hilarious together. This is up there with DH1 as one of my favorites.",
            "review_date": "2021-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original Die Hard is a masterpiece that sets the gold standard for action films. Thankfully, Die Hard 2 avoided the typical sequel trap of dishing out \"more of the same\" by expanding the Die Hard stage from the confines of a single building to the expanse of a major airport and its surrounds. That created lots of opportunities to implement fresh ideas in the pivotal action sequences. Die Hard with a Vengeance attempts to raise the stakes once more by expanding into an entire city, but unfortunately it ends up delivering the dreaded \"more of the same\". The storyline has a few good plot points and twists, but overall the film still feels too familiar. Samuel L Jackson plays the role of an unlikely side-kick to Willis' character. Jackson seems typecast as the angry black man, jelling most of his dialogue in a typical angry tone. The banter between Willis and Jackson is fun, even if many of their scenes are at ridiculously unrealistic. The final battle between the head bad guy and Willis' character is a bit anti-climatic. Die Hard 3 will pass the time, but is a bit of a disappointment after 1 and 2.",
            "review_date": "2021-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Takes the Die Hard formula, gives it a bit of a shake, and adds a dollop of Samuel L. Jackson.  This improves any film, for what it's worth.",
            "review_date": "2021-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best sequel of the series ",
            "review_date": "2021-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While a good movie in its own right, Die Hard with a Vengeance is definitely the lowest point in the franchise, with the possible exception of the ridiculous one in Russia.  The chemistry is all here from the first two films... evil baddies killing indiscriminately, Mclane is caught in the middle, all by himself (with help from Sam Jackson only), and has to out think both the baddies and the bureaucracy.  But it is a pale imitation of the first movie, having all been done before.  So they drag out the baddie plot, to the point of ridiculousness until it resembles a James Bond flick.  Any half way intelligent baddie could have achieved his goals in about a quarter the number of steps.  Dumb.  Of course, the running time is longer, but now I just felt exhausted at the end.   This isn't helped by the Jackson sub plot, whose nephews get trapped by the baddies' bomb, etc etc ... cheesy and unnecessary.  Jackson himself is likeable and an energetic foil for Willis, but the racism thing was either unnecessary or needed more backstory to explain.  Instead we get 'Jackson is black, and therefore MUST have a chip on his shoulder towards white people', which is of course, racist in and of itself.",
            "review_date": "2021-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one is good as the 1st Die Hard!\nProb bc of Jeremy Irons and Sam. Jack",
            "review_date": "2021-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's loud and silly but as far as 90's actioners go it still holds up and doesn't disgrace the original.",
            "review_date": "2021-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The real second part of the saga, Die Hard 3 is more of the same dish, but the the dish still is good. 8/10",
            "review_date": "2021-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bruce Willis and Sam Jackson are great together. Jeremy Irons is a good villain. Great film!",
            "review_date": "2021-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much better then the 2nd, and almost as enjoyable as the first. Samuel L. Jackson and Bruce Willis work really as co actors.",
            "review_date": "2021-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like this movie, but it's a mix of ex-machinas, clichè and explosions. The idea of a couple of charismatic guys solving riddles is exiting and fun, plus Jeremy Irons as the villain is perfect. At the end you have a dumb thrilling action movie that you can enjoy and love. Could be better.",
            "review_date": "2021-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I see the critics always score great films low because they think they are better than the audience my opinion go see this film been a fan of it for years always worth a watch every few years great fun. Hi action and very funny,",
            "review_date": "2021-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably just as good, if not slightly better than the first one! Unforgettable and genius chemistry with the legend Samuel L. Jackson, a perfect villainous vibe from Jeremy Irons, and action/humor that never falls flat!",
            "review_date": "2021-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still my fav of the franchise",
            "review_date": "2021-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie! Bruce Willis and Samuel Jackson A+ must watch great add to movie collection 10/10",
            "review_date": "2021-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's no denying the pure entertainment for more than half the film thanks to it's lead stars but then you'll also receive that Hollywood formula which action junkies wouldn't care too much about",
            "review_date": "2021-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It may not be original, but Die Hard with a Vengeance is still a very faithful, action packed addition in the franchise, benefiting from its two main leads.",
            "review_date": "2021-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Willis and Jackson are hilarious together though the story itself is rather idiotic.",
            "review_date": "2020-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best one of the five. The movie keeps you watching.",
            "review_date": "2020-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cannot believe all the bad reviews. This movie is very well paced, chemistry between Willis and Jackson is great and most of the storyline is well thought through. In my opinion, this is the series' best outing.",
            "review_date": "2020-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If in the original Christmas classic McLane must maneuver through a physical maze of wire and wood, while in the first sequel (also a Christmas movie) he must navigate a maze of jurisdictional bureaucracy, here—in a script so full of references to Santa it can't be anything other than a Christmas-after-global-warming flick—the labyrinth is New York City itself.",
            "review_date": "2020-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Die Hard with a Vengeance\" is the best Die Hard sequel, and doesn't get the praise by critics as it deserves. This movie is great. Bruce Willis is great as John McClane, and alongside him, Samuel L. Jackson has an incredible performance as Zeus. I really like how they treat Zeus as a person and not a sidekick, and his overall story arc, as well as McClane's, is truly fantastic. Simon Gruber (Jeremy Irons) is an incredible villain, who is both brilliant and intimidating. The plot in this movie has always been a favorite of mine and is extremely suspenseful. Not only, the riddles and puzzles that Gruber plays with McClane and Zeus is a great idea. The only trouble I have with the movie is the ending. The one released seems last minute and tacked on. I don't think it really worked. However, if you have the chance, check out the alternative ending, which fans, myself included, think is a much better ending. For that, I give \"Die Hard with a Vengeance\".... 5 stars.",
            "review_date": "2020-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excellent sequel with Bruce Willis and Samuel L. Jackson forming great chemistry together, having a unique story, and containing great sequences of action.",
            "review_date": "2020-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than the first one, which is rare in a series of movies.",
            "review_date": "2020-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this sequel was the best one of the Die Hard franchise! It didn't do everything perfectly but for a Die Hard movie I think it did everything as perfect as they possibly could! And Samuel L. Jackson was an amazing addition to the protagonists! And this had absolutely amazing suspense!!! I was on the edge of my seat when I was watching this! I thought this was very underrated!",
            "review_date": "2020-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Critics really missed with this one.Fantastic action flick! Duo Willis and S.L.Jackson are great.A must see!",
            "review_date": "2020-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it benefits from Bruce Willis and Samuel L. Jackson's barbed interplay, \"Die Hard with a Vengeance\" delivers neither the taut thrills of the original or its over-the-top action. Then again, it's still gettin' The Bronze Medallion Of Goodness. Characters: 3/5 Story: 3/5 Acting: 3/5 Special Effects: 3/5 Direction: 3/5 Cinematography: 3/5 Soundtrack: 3/5 Overall: 3/5",
            "review_date": "2020-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think the third \"Die Hard\" movie is easily the most underrated. I respect this movie because it completely changes the formula of the first two movies. The setting has been expanded to an entire city and the movie has more of a buddy cop feel, thanks to the wonderful inclusion of Samuel L. Jackson. I like the dynamic between Bruce Willis and Jackson and it adds a layer of fun and humor to this fast-paced movie. This movie is a bit silly but it also is consistently moving quickly and is pretty exciting all the way through. Overall, the low critical acclaim for this movie seems a bit misguided because it is a rock-solid action movie.",
            "review_date": "2020-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite Action movie of the 90’s",
            "review_date": "2020-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favourite Action movies from the 90's. Bruce Willis and Samuel l. Jackson are a fantastic combination in this movie, Simon Gruber is a great villain and the action scenes are really fun.",
            "review_date": "2020-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Having Willis and Jackson co-star in an action film does provide well-developed character development and interplay that deviates from the unique plot formulas of its predecessor",
            "review_date": "2020-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The second most intense depiction of the high-stakes world of professional hide-and-seek ever put to film. Unflinching and awe-inspiring. Near masterful documentary filmmaking. ",
            "review_date": "2020-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die hard with a vengeance is a hell of a lot more better then die hard 2! It more cleverly thought through with a worth while antagonist, protagonist, characters and a pretty awesome plot.",
            "review_date": "2020-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would say this is my favorite of the Die Hard sequels. I really liked this sequel a lot. Bruce Willis and Samuel L. Jackson did a great job in this film. The action sequences were really good in this film.",
            "review_date": "2020-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overstuffed yet again but definitely an improvement over Die Hard 2 thanks to Willis-Jackson chemistry and Jeremy Irons.",
            "review_date": "2020-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic 90s action film and a very worthy sequel to the original film.",
            "review_date": "2020-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No explanation needed, fantastic entry into the die hard franchise. Story progressed into a  more of a buddy cop genre, which with sammy J, i loved.",
            "review_date": "2020-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a return to form, almost as enjoyable as the first one for the same reasons, without feeling trite and formulaic. The villain is back to being an criminal mastermind and the hero is relegated back to underdog status, the dynamic that sets the franchise apart in the action genre. The side characters are back to being likable and interesting,  making for a fun action romp with just enough mystery to keep it interesting. It redeems the franchise from its predecessor and ends the original trilogy in high form.\n\nClosest comparison: It's like a cross between The Last Boyscout and Inside Man.\n\nSetting: Buddy Cop\nPlot: Thriller\nTone: Action",
            "review_date": "2020-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die Hard with a Vengeance is a fun summer action movie.",
            "review_date": "2020-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The weakest of the original 3 but still a blast and it doesn't try to redo what came before.",
            "review_date": "2020-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die Hard 3 isn't as good as the original but is better than Die Hard 2 in terms of the plot and characters. The motivation is money again but this time bombs are a distraction. For some reason Samuel L. Jackson was racist in this film, and I didn't find his jokes particularly funny so that's disappointing. The whole white man joke got old real quickly and was repeated way too many times. However, Bruce continues to play John well, and the villain was better than the guy in Die Hard 2. The police characters were good and not idiots this time which was also an improvement. The plot was fine, but it's a bit silly having the bad guy as the brother to the villain in the original. The dialogue could have been better in places, the visual effects were acceptable for the time, and the cinematography and soundtrack were ok. Worth a watch if you're a fan of the Die Hard franchise.",
            "review_date": "2020-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would say this one is my favorite of the Die Hard sequels. I really liked this sequel a lot. Bruce Willis and Samuel L. Jackson did a great job in this film. Jeremy Irons did a great job as the villian in this film.",
            "review_date": "2020-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die Hard 3: holy s-, they tore up New York! is an explosive and chaotic rabbit race through NYC starring our favorite grumpy New York (Yawk?) cop. His chemistry with Zeus is the strong point of the movie and really makes it work well as a buddy flick twist to the DH formula. Bruce Willis is someone who I've always seen as a diamond in the rough type of actor, and this is proven further by his chemistry with scene stealer Samuel L. Jackson. Sure, the writing isn't great and there are a few potholes, but this is a well shot and just fun action flick. Things blow up, other things don't, and sometimes there's just a gag. Jeremy Irons's baddy is probably the best in the series and his performance is fantastic. So, Die Hard found a way to make itself even bigger-er than the previous two by making it more street level, and make it still be a fun, high octane action movie in the process. It's not the best Die Hard movie, but there's no doubting the fun-factor, nor the talent behind the camera.",
            "review_date": "2020-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one resides in my VHS Hall of Fame and was one of the action movies I saw most as a youngster, which is even odder being that I had never watched the first two.",
            "review_date": "2020-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly My Second Favorite of the Die Hard Movies. Extremely entertaining and very fun.",
            "review_date": "2020-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you love realistic people getting into unrealistic situations, then this movie is for you. I love the Die Hard series, mainly because the odds are always against our star hero. This time Samuel L Jackson is along for the ride and oh, boy is it a fun one. Full of action and one liners. This is a true classic action movie and could be the best sequel to the original.",
            "review_date": "2020-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yippie KA YAY MF,Another Masterpiece.Great music,story and screenplay the action and puzzles were damn engaging and shockingly amazing this movie felt like has vibe of 1st one with extreme level of surprises and mystery.better than 2nd one A Masterpiece!",
            "review_date": "2020-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great action flick and great chemistry between Willis and Samuel L. ",
            "review_date": "2020-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a hidden gem.  Look, it's clear that the Die Hard movies are not tied together, and that they find interesting stories and just place the protagonist name with John McClane.   However, this movie is saved by Samuel L. Jackson.  He is believable and hilarious.  The action is typical for 90s blockbuster, and just a great popcorn movie.",
            "review_date": "2020-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As long as you are willing to suspend all belief in reality, and accept all of the amazing lucky coincidences, then the movie is an enjoyable thrill ride.  The interaction between Willis and Jackson is worth the price of admission.  The ending is very weak.",
            "review_date": "2020-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the best movie in the franchise, but I managed to have fun watching it",
            "review_date": "2020-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This third Die Hard movie was really good. Bruce Willis and Samuel L. Jackson did a fantastic job in this movie. The rest of the cast did a great job as well. The plot to the movie was thrilling and action packed. This movie will blow your mind if you haven't seen it yet. Check out this classic action movie sometime. You'll love it.",
            "review_date": "2020-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unlike Die Hard 2 this one was entertaining despite it's annoying plot inconsistencies.\n\n8.3/10",
            "review_date": "2020-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like new york city funny movie",
            "review_date": "2020-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the tradition of Die Hard exposition, With A Vengeance starts more or less with McClane in the back of a van and while he gets over his hangover his cop buddies rattle off about five things that will come in to play later on. I don't know if that's genius or nonsense. \nEqually baffling is the outlandish way that McClane and Sam Jackson's Zeus meet. Is it edgy and dangerous or is it in bad taste? Although most of the rest of the film plays with race politics in an interesting way (Zeus at the phone with the cop is a dicey moment given recent history) and its interesting pre-9-11 to see how brutal the train crash is. \nFortunately this is one of the only things in this movie that seems dated, just like the first Die Hard, McTiernan directs a clean, crisp, energetic and pacey intelligent action flick. It's got some nice musical theme incorporations, and it's got a very claustrophobic directing style that sometimes works, and a Lethal Weapon witty buddy repartee. \nBut the piece de resistance is Jeremy Irons' Gruber who is as silly as he is sadistic. He's a real genuine pleasure and him and the film is deeply sinister with real stakes even around the whole of New York. \nI have to admit I see this film through rose tinted nostalgia glasses, but I do love this film, it's fun, competent and modern with enough red herrings to choke ten cats and a great Shane Black sensibility. I do think it still holds up, but what the hell do I know, even John McTiernan called the plot \"frail and outrageous. I hope people enjoy its ridiculousness.\" I do Sir, I do.",
            "review_date": "2020-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one is as good as the 1st the addition of Sam Jackson is great Willis puts on another great performance and its an overall good time with a solid ending",
            "review_date": "2019-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great 90s action flickp",
            "review_date": "2019-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The franchise puts McClane in ever-greater chaos, as does the urgency and tension in the situation he engages in. Willis and Jackson deliver genuine and hilarious chemistry amidst absurd and cartoony action scenes that amuse the viewer.",
            "review_date": "2019-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thoroughly enjoyable ",
            "review_date": "2019-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie Bruce Willis Samuel L Jackson funny jokes action comedy good movie check it out",
            "review_date": "2019-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is probably the Best Die Hard movie and one of the best action flicks ever made! Its an incredible experience and just shows how the so called movie critics are detached from reality and of what people really want. I highly recommend it",
            "review_date": "2019-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To be honest... how many tri-quels (if that's even the right word) are even worth looking at? Well I can assure you, this tri-quel most certainly is. Samuel L.Jackson outshines (as always) the main character but both Jackson and Bruce Willis make an amazing duo. Nonstop on the edge of your seat. It is a tad bit on the long side, could've been shorter . But thankfully there's never a dull moment. Best Die Hard ever. ",
            "review_date": "2019-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best in the series ",
            "review_date": "2019-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This addition to the Die Hard franchise is second only to the original, Sam Jackson and Bruce Willis together was an awesome collaboration.",
            "review_date": "2019-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The talented cast and action brings this sequel together",
            "review_date": "2019-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best action sequels ive seen",
            "review_date": "2019-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best of all Die Hard's sequels",
            "review_date": "2019-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bruce Willis and Samuel L. Jackson have an awesome chemistry. ",
            "review_date": "2019-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this film. Always a toss up between this and the first Die Hard for which one is superior, but I think Die Hard 3 just about wins it.",
            "review_date": "2019-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite a good effort for a third instalment, and despite the obvious logical bullshit, partnering up with Samuel L. Jackson was a great move.",
            "review_date": "2019-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely an upgrade from die hard 2. Watching Bruce Willis and Samuel L Jackson run around New York together is very fun.",
            "review_date": "2019-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Critics are being retarded",
            "review_date": "2019-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most fun ever have with Die Hard.",
            "review_date": "2019-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The third in the series and still going strong!",
            "review_date": "2019-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good movie with good action and great chemistry between willis and jackson. probably my favorite of the first three (about 2 viewings)",
            "review_date": "2019-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die Hard with a Vengeance manages to successfully shake up the Die Hard formula with evocative New York filming and an effective spin on buddy cop movies. Irons makes a charismatic villain, and like all the best Die Hard movies there's a great group of supporting characters. The film admittedly runs out of steam three quarters of the way through and has an underwhelming climax, but at least it manages to recapture some of the tongue in cheek charm of the original on the way there.",
            "review_date": "2019-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Above-average thriller with strong protagonists and uniquely exciting action sequences. Only flaw is a mediocre villain.",
            "review_date": "2019-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It runs out of steam near the ending but talk about a movie that's much more awesome than critics give it credit for. Bruce Willis and Samuel L. Jackson have great chemistry that totally belongs to a buddy cop movie despite the latter not even being a policeman, the action sequences are fun, the villain is cool and John McTiernan is back making the genre shift to Lethal Weapon in a Die Hard movie all the more welcoming. The conclusion needed some improvement but otherwise, Die Hard with a Vengeance just might be the best of the Die Hard sequels.",
            "review_date": "2019-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The chemistry with Willis and Jackson is off the charts. Die Hard is as immersive as ever due to the fact that you care about the duo and intrigued on how the next riddle is solved in another very clever and brilliantly paced addition to the franchise. The story ties together with the first movie nicely and remains fresh while still feeling familiar to the first two. An action movie classic.",
            "review_date": "2019-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "could be as good as the og if the villian had a btr death",
            "review_date": "2018-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "2nd best in the franchise. I love it.",
            "review_date": "2018-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Almost as good as the original.....almost....the ending was eh....ok",
            "review_date": "2018-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all time fav!",
            "review_date": "2018-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good action but plot holes hold this one down. A hero needing redemption but is this a sequel to only part 1? Part 2 had him in LAPD with his family,.. ",
            "review_date": "2018-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A standard action movie that could have any generic action hero in the title role, but entertaining enough.",
            "review_date": "2018-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Die Hard, with suspence, raw action and humor. The best villain of the series as Jeremy Irons and the supporting hero as Samuel Jackson along with Willis reach the Lethan Weapon charisma with a touch of maturity in the genre.",
            "review_date": "2018-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My second favourite part of the Die Hard series. It's awesome!",
            "review_date": "2018-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first two but still a fun ride.",
            "review_date": "2018-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first but a HUGE improvement over the second.",
            "review_date": "2018-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fablous movie with amazing chemistry between Willis, and Jackson, and also between Willis and Irons. There are many twists and turns that make this a fabulous movie. ",
            "review_date": "2018-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really great movie. Samuel L. Jackson's character is great. Bruce Willis continues to be exellent playing John McClane. Jeremy Irons was outstanding as the Main bad guy in this movie.",
            "review_date": "2018-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4/5.  A really good sequel that tries something different, and for the most part succeeds.  I don't love the 3rd act, and it can be a little tough to follow, but Jeremy Irons is an excellent villain, and Bruce Willis and Samuel L. Jackson have great chemistry.",
            "review_date": "2018-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's die hard classic. C'mon let it be, its good!",
            "review_date": "2018-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4 to 4 and a half stars. Underrated.",
            "review_date": "2018-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Again, Bruce Willis plays the heroic asshole we come to love, but it's not enough to overshadow its generic plot and unconvincing villain. \"Die Hard with a Vengeance\" is another unoriginal action thriller that aims for \"booms\" rather than a decent plot. It starts off fast without any character buildups then it ends up with an underwhelming ending that will some movie viewers unsatisfied. The only good thing about this movie is the banter coming from Bruce Willis and Samuel L. Jackson's interactions. Those two were definitely the highlights in this movie.",
            "review_date": "2018-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The least good of the trilogy, but full of funny moments and explosions, and the always great Sam L Jackson.",
            "review_date": "2018-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not good but not bad either. Switch off your brain grab a beer kill an hour or two.",
            "review_date": "2018-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The second best Die Hard film. Very entertaining. It keeps everyone’s favorite NYC cop, John Mclain, and brings new things to the table such as Sam Jackson, and a new setting. This movie unlike Die Hard 2 tries something new. Sure the plot is kind of generic but it’s a lot of fun at the same time. It’s not a movie you really supposed to take seriously, it’s just a movie you’re supposed to sit back and watch.",
            "review_date": "2018-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Real good Sam l Jackson rocks ",
            "review_date": "2018-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whilst smart and largely entertaining, a number of action sequences break through the suspension of disbelief barrier with wild abandon. Willis and Jackson's characters work well together but the villain never really makes much of an impression and the ending is somewhat underwhelming.",
            "review_date": "2018-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How did this get a 53 percent on Rotten Tomatoes?!? That’s so wrong! This movie is a blast(not anywhere close to as good as the first one) but still probably the second best in the series",
            "review_date": "2018-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Got off to a great start with the Willis/Jackson banter and chemistry. I really enjoyed the both of them trying to solve the riddles together and then the plot got way TOO busy and confusin...helicopters, subway trains and car chases and German neo Nazi types...WAY out there...but I stuck thru it. This is the only movie that I ever saw Sam L Jackson play a nerd. It was just fun to watch the movie because of that.",
            "review_date": "2018-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I rate this movie right up there with the original. Awesome suspense from beginning to end. Samuel L Jackson compliments Bruce Willis very well. This movie was filmed before Jackson became over-exposed and watered-down as an actor, so his role is much more bearable than what you may be used to. Jeremy Irons nails the villain role. And Willis/McClane is as good as ever. Having the movie set in NYC, McClaine's home turf, makes for excellent drama and excitement.",
            "review_date": "2018-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The second best Die Hard movie!",
            "review_date": "2017-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Featuring the return of John McTiernan as director, \"Die Hard with a Vengeance\" serves a very interesting plot-line about John McClane (Bruce Willis) being used as a tool of vengeance by the villain mastermind Simon Gruber (Jeremy Irons), the brother of Hans Gruber! The result is a pretty decent sequel to the first two films: the acting is pretty good (Willis as the hero who is now tired of \"being at the wrong place at the wrong time\", Irons as the clever villain, & Samuel Jackson as the very reluctant, yet helpful (& humorous) civilian Zeus Carver) despite issues with the general dialogue & the action sequences are decent. However, it seems to me that while the cinematography was fitting for the mid-1990s New York City setting, I was more used to the cinematography of the first two films (which were fitting for the late-1980s, early-1990s setting); furthermore, the explosions seem not as impactful compared to the first two as well. Of course, times change so that - the cinematography - was to be expected, I guess.\nOverall, \"Die Hard with a Vengeance\" is a pretty good sequel to the first films - a little less kick-ass, but it still delivers as another treat for fans of action films! Pretty awesome!\n\nAnd this time around, the film does not take place during the Christmas holidays like the first two films, but it does make references to the holiday. So I wouldn't consider \"Die Hard with a Vengeance\" to be a Christmas film.",
            "review_date": "2017-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unlike the previous film, which was sort of a rehash of the original, Die Hard: With a Vengeance takes a new road and benefits greatly from it. Bruce Willis and Samuel L. Jackson boast great chemistry and both give terrific performances. Jeremy Irons is perfect as Alan Rickman's (sort of) brother, giving Simon Gruber the same accent as and similar personality to Hans while still making the character his own. The film as a whole does suffer from a diminishing supply of fresh ideas, but it's great enough that it doesn't matter.",
            "review_date": "2017-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another ok die hard movie, it's just so generic, just another action movie.",
            "review_date": "2017-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A quite ludicrous but still great Die Hard sequel that gets personal.",
            "review_date": "2017-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than the second one",
            "review_date": "2017-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As far as threequels go, \"Die Hard: With A Vengeance\" is more than just a success. Not only did it - at the very least - hold my attention and keep me entertained, but one can even say there are a few sparks of brilliance littered throughout, such as the additions of Samuel L. Jackson and Jeremy Irons to the gallery of new figures John McClane has to traverse. However, I can't help but feel that there's a bit too much going on here at times. Juggling McClane and Zeus, the cops, and Jeremy Irons's character all at once does seem to get a bit too strenuous for director John McTiernan here for a bit, but by the time the third act rolls in, it all makes sense and its smooth sailing from there on in. Definitely not the best \"Die Hard,\" but it is most certainly one of the better ones.",
            "review_date": "2017-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Having seen Die Hards 1, 4, and now 3, With a Vengeance is easily my favorite. Its structure is pretty clever, the banter is constant, and the set pieces are cool. All of the main characters could be described as \"kind of annoying\" - including McClane himself - because they have the unfortunate tic of cracking jokes immediately after hearing that hundreds of children's lives are on the line. So it's insensitive for sure, and I'm not sure what they were going for by casting the black man as the racist, but Samuel L Jackson is in peak form so it can be...mostly forgiven. I take issue with Jeremy Irons' over the top performance (magnified when he and his goons put on 'flawless' American accents - like really, did he only hire thugs who went to Julliard?) but it kinda fits the film, I guess. He's just never terribly intimidating. Either way, a very fun watch, with a lot better one liners than the original.",
            "review_date": "2017-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent. Terrific performance by Samuel Jackson.",
            "review_date": "2017-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot is absurd. The ending is borderline terrible. But Bruce Willis once again gives John McClain so much life and the film introduces yet another strong villain that is performed brilliantly by Jeremy Irons as well as the addition of Samuel L Jackson's lovable sidekick.",
            "review_date": "2017-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The third installment in the Die Hard franchise takes us to New York City and the subway system is the target of seemingly random bombings.  Bruce Willis and Samuel L. Jackson keep some of the momentum going as an odd couple and Jeremy Irons does what he can as the lead antagonist, but pales in comparison to Alan Rickman.  The whole thing is filled with action and loud explosions but the premise is not as enthralling as the first two and neither is the sense of urgency.",
            "review_date": "2017-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favourite Die Hard. Hey Zeus! Samuel L. Jackson is brilliant in this role. Larry Bryggman shows he could have been Great in The Movies and not just a Day Of Our Lives Kinda Guy.",
            "review_date": "2017-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The same stuff can be said about Die Hard: With a Vengeance as can be said about it's predecessors. It is fun for the fans of the franchise.",
            "review_date": "2017-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While not exactly as fresh as the first, Die Hard 3: With a Vengeance cleverly raises the stakes with more over-the-top thrills and a charismatic cast.",
            "review_date": "2017-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 2nd best Die Hard in the series yet somehow its ranked lower than both 2 and 5? Seriously?!?!  Don't get me wrong I actually really enjoy 5 and 2 just didn't cut it for me.",
            "review_date": "2017-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can never get enough of this awesome film! I know just about almost every line used! This one, I'd say, is the most fun humorous entry in the \"Die Hard\" series!",
            "review_date": "2017-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can never get enough of this awesome film! I know just about almost every line used! This one, I'd say, is the most fun humorous entry in the \"Die Hard\" series!",
            "review_date": "2017-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review (1~5)\n\n#Content: Script 3 | Acting 3 | Cinematography 3 | Film Editing 3\n\n#Visual: Costume Design 3 | Makeup & Hairstyling 3 | Scenic Design 3 | Lighting 3 | Visual Effects 2\n\n#Sound: Score & Soundtracks 2 | Sound Editing & Mixing 3\n\n#Overall (1~10): 6",
            "review_date": "2017-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "John McClane's slightly abrupt final showdown with a German accented Jeremy Irons may not live up to expectations but the majority of the movie provides classic 90s action packed and humorous entertainment.",
            "review_date": "2017-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A big improvement to the second but still not as awesome as the first. Die Hard 3 does deliver great intense action. the story was great, the villain was great. I loved how they made Hans Gruber's brother Simon the Next big Die Hard Villain, Jeremy Irons was Badass! Also loved how they added Sam L Jackson to the Die Hard Franchise. Great film. One of the 90's best action flicks",
            "review_date": "2017-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Man this movie is just so much funny than all the other combined",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the best Die Hard, it's just a game of cat and mouse the whole movie.",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film starts out strong, with the charismatic lead of Bruce Willis and the hilarious addition of Samuel L. Jackson, but builds to a lackluster climax. Despite that, where this installment lacks in tension that the first one had, this third entry contains some worthy humor.",
            "review_date": "2017-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the best die hard besides the original",
            "review_date": "2017-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Critics are wrong. This is better than 2!",
            "review_date": "2016-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die Hard With A Vengeance is the film that I think best represents the franchise as a whole, which is ironic considered it is largely forgotten by many. It may not be a perfect film like the original, or a disaster like the last one, but it features all of the elements that made the first one great, but also some of the problems that would go on to plague later installments. If I were to compare it to its conterparts, I would say it's not as good as Die Hard, but better than Live Free Or Die Hard, and much better than it's predecessor, Die Hard 2, which may be one of the most overrated sequels of all time. My favorite aspect of Die Hard With A Vengeance is the aspect of Bruce Willis and Samuel L. Jackson teaming up, and the concept works even better than I thought it would, and while not being as iconic as Hans Gruber, Jeremy Iron's villain is just as much fun, and when it comes to Die Hard, that is what matters most. Does the film provide the viewer with a fun experience? The answer is yes, and that is why I recommend Die Hard With A Vengeance.",
            "review_date": "2016-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the best, it's lacking in some areas.",
            "review_date": "2016-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterful thriller that throws John McClane into an exciting story that doesn't require him to shoot his way out of every situation. Don't fret! He does plenty of that as well, but he is forced to use his brain along with his brawn, and I still believe Willis' work as McClane; an average, ordinary cop that is thrown into a situation he can't handle on his own.",
            "review_date": "2016-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, intense, and smart at all the right times. Die hard with a vengeance is an amazing follow up that almost matches up to the original, although the ending is a bit rushed.",
            "review_date": "2016-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing film nearly on par with the first Die Hard, but not quite.\n\n9.75/10 or 5 stars",
            "review_date": "2016-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Third entry to the popular action series brings the action and suspense that was missing from the second entry. John McClain must play a deadly game of \"Simon Says \" with a terrorist. Samuel L. Jackson also stars.",
            "review_date": "2016-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bruce Willis and Samuel L. Jackson are amazing together!",
            "review_date": "2016-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "cool movie bruce and  sam l Jackson rock    mr irons needs to play a bad guy in a bond movie",
            "review_date": "2016-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies of all-time. #classic",
            "review_date": "2016-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although boasting some great chemistry from Bruce Willis and Samuel L. Jackson, the third entry in the Die Hard Franchise lacks its predecessors' punch.",
            "review_date": "2016-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Die Hard sequel even though it still doesn't match the original and its ending is muddled.",
            "review_date": "2016-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A unique set of action sequences - New York itself makes for an exciting playground - and the series is enriched by the addition of Irons and Jackson. But Bedelia is sorely missed - in fact it's a sore point that the only female of significance in the action has absolutely no lines. Otherwise it's an effective flick.",
            "review_date": "2016-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die Hard: With a Vengeance is the third entry in the Die Hard series and it shows that the series is not going to die hard (until It's a Good Day to Die Hard). Reason Being is that though the second one was ok and was a bit to over the top, campy and clichéd at some points, this one is never that but rather a more successful and better sequel that actually ties into the first one, I won't spoil how but it definately works. The films main protagonists are Bruce Willis as John McClain, as always, and Samuel L. Jackson as Zeus and they both bring terrific performanes and both have great chemistry and wirk off one another beautifully and the same goes for the villain Peter played by Jeremy Irons. Another thing in this movie that is terrific is the action and tension, because, unlike it's predecessor's,John Mclain is everywhere and not solidified in one location which makes way for tons of great ideas and plenty of room for stellar action. The one flaw that I had with this movie, much like everyone else, is the ending (Now they're are going to be SPOILERS coming up so if you haven't seen it yet go see it than come back and finish reading). The film decides to go one direction which is the bad guy gets away and the heores lose which would've worked, because it's a new take on a Die Hard movie that we haven't seen before and I would've been all in for it, but unfortunately the film immediately changes the idea and has an asprin bottle tell him where they are hiding out at and when they're is only like 10 to 8 minutes left in the movie him and the NYPD go and destroy Peter and his entire army in a short amount of time and then the film ends making it feel rushed and leaving you to wonder \"Why didn't they just keep the ending where they lost because it would've been better. But, in the end, Die Hard: With a Vengeance is a great sequel that surpasses it's predecessor and is a great time.",
            "review_date": "2016-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I actually love this movie. It's my favorite of the sequels, mostly because of Willis and jacksons interplay",
            "review_date": "2016-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the second film was not nearly as good as the first, Samuel L. Jackson almost single handedly brought this film nearly back to the quality of the first film. Great script and interesting premise. It is funny to know that the FBI actually interviewed the screenwriter because his heist was so well thought out.",
            "review_date": "2016-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had seen this film when it came out and didn't recall. This film stands out the test of time very well. Over the top effects, unlikely story, a great thriller that grips enough to the end. Great villain. S.L. Jackson is sympa in this.",
            "review_date": "2016-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had seen this film when it came out and didn't recall. This film stands out the test of time very well. Over the top effects, unlikely story, a great thriller that grips enough to the end. Great villain. S.L. Jackson is sympa in this.",
            "review_date": "2016-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed it. Better than the second one",
            "review_date": "2016-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 'Die Hard' franchise is without question one of diminishing returns with each new outing but that doesn't mean this third outing is completely without merit. Sam Jackson is as fun to watch as always and the first half is riveting but once the gold heist kicks into full effect the film loses a little bit of much needed steam.",
            "review_date": "2016-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It opens with a bigger setting than the first two and possibly an interesting story. This quickly fades in Jackson screaming over and over again and bullet point action sequences. Then it ends in a jumble of events none of which seem that important.",
            "review_date": "2016-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brings back the charm and fun of the first movie after a bad sequel, and puts forward-- what is essentially-- a great buddy cop movie.",
            "review_date": "2016-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Come on 51%, its way better than die hard 2.",
            "review_date": "2016-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is the best Die Hard movie in the series!",
            "review_date": "2016-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe not quite as good as the first two, this third film in the series is still one of the best action movies of the 90's. With Samuel L Jackson co-starring, this film is not disappointing at all.",
            "review_date": "2016-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very underrated film, the best of the die hard franchise imo",
            "review_date": "2016-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a fun action movie that has a very different mould to the first two films. Bruce Willis and Samuel L Jackson form a great buddy cop partnership and Jeremy Irons is more than interesting as the hero. Obviously it doesn't live up to the original die hard but what does?",
            "review_date": "2016-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film starts off great, however like so many other films out there - it slowly collapses in its second half which I thought was annoyingly way too drawn out. I can understand now why there is a 12 year gap between this instalment & the 4th. The links to the original film are clichéd and the formula is a little recycled for this series but to be fair there's much more enjoyable action going on this time round. It may be severely average but I'll be honest in saying that it held my attention a helluva lot more than the first 2 \"classics\".",
            "review_date": "2016-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than DH2, but not the same as DH1. This is more like a loud, wild goose chase around New York. At times it seems they tried to include some subplots about racism or something, but it never fully manifests. At least this made me worry about McClane and feel he was in danger again. It's not that bad actually. It's not DH1 though.",
            "review_date": "2016-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Equally as good as the original. I grew up watching the first three and they still stands as one of the best action trilogies to date. Such an amazing cast!!!",
            "review_date": "2016-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With McTiernan back at the helm it could only get better. Hard to believe it has been 20yrs since I first saw this one.",
            "review_date": "2015-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die Hard 3 may have shed off the generic and terribly boring plot of Die Hard 2 Die Harder, but it can't match the sheer genius of the original Die Hard with a script bombarded with the unappealing combination of pyromania and racist hate speech and puzzles.",
            "review_date": "2015-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pairing Samuel L. Jackson and Bruce Willis will get you laughs, but the villain is a bit of a downfall from the first and certain characters are forgotten as soon as they are introduced. Other than Willis, only Jackson's and Irons' characters are memorable.",
            "review_date": "2015-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great action flick. Great action...though Samuel L Jackson's Zeus character gets very annoying at times.",
            "review_date": "2015-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mildly amusing action-adventure film. This time, Willis teams up with Samuel L. Jackson and Hans Gruber's brother (played by Jeremy Irons) is the villain for this third entry in the franchise!",
            "review_date": "2015-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good film, directed by McTiernan, and a good dealing, including Samuel L. Jackson and Jeremy Irons.",
            "review_date": "2015-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Action peels away so fast it keeps me guessing how much terrorism is for its own sick sake & how much just for the money.",
            "review_date": "2015-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this - truly great example of 90's action - One reason to cast Sam L Jackson in basically everything!",
            "review_date": "2015-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not quite as good as the first Die Hard movie, but it comes very close, offering humor, action, many intense scenes, and a smart story that uses the full potential of it's unconfined setting.",
            "review_date": "2015-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After the relative disappointment in Die Hard 2, I wondered if it was even possible to create a good sequel in the franchise, but Die Hard With a Vengeance managed to do a pretty good job of it. This time we have McClane sucked into the villain's plan as part of the villain's plan which is a neat shift in the script for these films. It adds a new element to the movie and gives a plausible reason for him to be there aside from coincidence. The addition of Samuel L. Jackson is also delightful because it gives Bruce Willis someone to argue with throughout the film. Jeremy Irons is a great follow-up to the amazing Alan Rickman, and I love his few scenes with Bruce Willis because they play off each other nicely. The villain's plot is much more intricate this time, but I love puzzling through it and trying to understand what was intended. It's nice to see John McClane on his home turf because we no longer have to watch him struggle for support from the other law enforcement, and it adds some emotional impact when some of the cops start to die. The biggest flaw in Die Hard With a Vengeance is that it still clings to some of the highly illogical action that was seen in the first sequel. There are several things that happen to McClane and Zeus that would kill an actual human being, but these guys are indestructible. Despite the super hero nature of the characters in the film, this is still the best sequel they've made in the Die Hard series and I'd gladly watch it again any day.",
            "review_date": "2015-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "87%\nWatched this on 13/08/15\nThis is my favourite Die Hard movie of all five, thanks to Samuel L Jackson and Bruce Willis and an engaging direction from John McTiernan. It's ending is slightly disappointing, but nevertheless, it can also be viewed as a diversion to the usual Die Hard endings.",
            "review_date": "2015-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining enough but lacking \"die hard feel\" of the previous parts.",
            "review_date": "2015-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "while  not as good as the previous two,With A Vengance is fun,exciting,and has the second best villain of the series. and Sam L Jackson is awesome.",
            "review_date": "2015-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zeus lighting bolt your ass!",
            "review_date": "2015-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outright action movie genius made even better by Samuel L. Jackson",
            "review_date": "2015-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die Hard with a Vengeance demands the viewer suspend more disbelief than the previous two films, but it is still a lot of fun, especially with the inclusion of Samuel L. Jackson as McClane's unlikely partner.",
            "review_date": "2015-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good action movie (having Samuel Jackson and Jeremy Irons helps out a bit), but it's nothing if compared to the first one.",
            "review_date": "2015-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Die Hard sequel, but not as good as original. Tons of racist comments too. Ages 15+",
            "review_date": "2015-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the true sequel that Die Hard fans deserve. Bruce Willis returns to form as John McClane, delivering clever lines, eye-catching action and some great chemistry with Samuel L. Jackson.",
            "review_date": "2015-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Samuel l Jacksons breath of fresh air performance isn't enough to save this piece of trash from crashing and burning  horrible movie stick with the first 2",
            "review_date": "2015-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Man, there are much worse action/thriller flicks but this barely goes over the top.",
            "review_date": "2015-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really liked this edition of the Die Hard series, definitely better than the 2nd though.",
            "review_date": "2015-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5/16/15 I re-watched this film and remembered a lot of it, which usually means it is enjoyable.  I liked it this time around, but mainly the first hour to 90 minutes.  After that, some of the implausible events that happen took something away from the impact.  So, it gets a little tire over time, but it is still an entertaining action film.",
            "review_date": "2015-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite Die Hard movie.\nA certified fresh rating of 98%\n   \"Die Hard 3: With a Vengeance is benefited by Bruce Willis and Samuel L. Jackson's chemistry on screen, action and the villain portrayal from Jeremy Irons.\"",
            "review_date": "2015-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Starts fast then the producers pull the parachute.....just crawls to a slow dull end.",
            "review_date": "2015-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die Hard 3 is a welcome sequel. Bruce Willis and Samuel L Jackson are great, and their back and forth dialogue was very entertaining. The action sequences are very well; staged as expected in this series, and the first two acts of this movie are great. They are suspenseful and well executed. Jeremy Irons was a great villain and his motivations were clear. The movie is very well paced and highly entertaining. Unfortunately, the last 20-30 minutes of the film are rather lackluster. The movie struggles to find a conclusive way to end, and has a very rushed feel to it. It is abrupt and makes the last half feel incoherent. However, this is a rewatchable thrill ride, even if it isn't all that original. Die Hard 3: With A Vengeance gets 3.5/5 stars (B).",
            "review_date": "2015-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die Hard: With A Vengeance is my personal favorite of the Die Hard sequels. It has a great plot, Jeremy Irons portraying the villain, and none other than Samuel L. Jackson as John McClane's side kick. What more is there to want?",
            "review_date": "2015-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I see why this one can be disliked my critics, but it's actually a good likeable movie that feels very similar to the early Die Hard films.  It's nice that it has connections to the first, takes us away from a more confined location like the skyscraper or airport, and he now had a partner.  They make a great pair, have some good fitting humor, and are as believable as can be expected.  It has a good pace, always some action and chases, and racing to the next pay phone.  Acting and script are both good, the story is cool and not far from the others, and I am surprised the bad guys get as far as they do given the movie they are in.  Until the very end the German criminals have the upper hand, (of course they are again from\nGermany, because we don't have bad guys here) and their well thought out plan goes smoothly.  It has a large scale feel, and between the two stars, Kruger and John we see a lot of action and excitement.  It's a well done, fasted pace thriller that keeps you guessing and solving riddles until the abrupt but satisfying ending.  Second best film in the classic franchise, and the last before the new reboots.",
            "review_date": "2015-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best of the Die Hard sequels.",
            "review_date": "2015-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How many die Hards can there be",
            "review_date": "2015-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It may not live up to the original by John McTiernen, but it is still a fun movie to watch, despite some horrible profanity.",
            "review_date": "2015-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Far better than you'd expect, with tons of wit & action but a piss-poor ending.",
            "review_date": "2015-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An argument could be made that Die Hard With A Vengeance  is superior to the first Die Hard, but regardless on your feelings of ranking, it's most certainly worth watching if you're a fan of the series to this point.",
            "review_date": "2015-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the smartest out of the Die Hard series, but the chemistry and character development between Willis and Jackson is something to be seen; especially in an action film.",
            "review_date": "2015-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Willis as McClane gets a partner - Samuel L. Jackson, who unwillingly involves himself in a police business to catch the bad guy bombing the city, played by Irons. He appears to be the brother of Rickman's bad guy from the 1st movie, and claims it's a all a revenge for McClane for killing his brother. But in the end it's just about the money from the Federal Reserve Bank. Also couple of time ticking bombs are involved - one at school, another on the ship.",
            "review_date": "2015-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has been a long time since I'd seen this and boy was it cheesy. The plot was quite 'big' in terms of epic involving the whole city for a film of its time, but some of the crazy plot twists were ludicrously over the top to get what they were trying to achieve. Many parts of the film seemed like plot devices with their parts being pointless. The special effects were rather poor and the acting all around was very cliche, all apart from Jackson, who was the saving grace of this film and rescued it. Willis played it by numbers, the bad guys were stereotypes and it all just needed to be over faster. Popcorn fodder.",
            "review_date": "2015-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic still worth watching.",
            "review_date": "2015-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Die Hard: With a Vengeance\" is an amazing film that has a great story, great characters, great acting, and action that definitely delivers in almost all departments!",
            "review_date": "2015-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Samuel l Jackson and Bruce Willis are a great combo",
            "review_date": "2015-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More Die Hard, yes please... not as good as the first, still fun.  I like the Simon says format and it goes away before it becomes too tiresome.",
            "review_date": "2015-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die Hard: With a Vengeance would have been the best first sequel. Not only does it incorporate the first film in a very smart way but it also adds quite a lot to the story and makes the sequel feel bigger and better, although not better than the original, in the best way possible. \n\nThe film starts off with a bang, literally, and it cuts right to the chase with the story. It's an interesting change of pace and seeing as how there is easily enough story to cover the running time, it is more than welcome. The film also does not take place on Christmas, which again, is a nice change of pace and more than welcome but they make a few jokes about it though and they are funny. The story for this film is very interesting and very different, it takes place in a much more open location, the location where he is actually a police officer, and works really well; the script is also as good as ever and really funny too, the chemistry between Willis and Jackson was outstanding and they had me laughing a lot.\n\nJohn McClane is still as awesome as ever and the script is still written in the perfect way for him. The addition of Samuel L. Jackson is brilliant and they work him into the story in a really good way and these two seem to have started a trend that lasted for the next couple films. Jeremy Irons is brilliant as the villain, I won't say his name because that would ruin it for those who don't know but he stands out and is unforgettable, he really does an excellent job and is a fantastic addition. He also has iconic music as his leitmotif, similar to the first film, and not only does it fit really well with him, give the film more identity and that it mimics the first films villain but it's also from another Kubrick film, like the other songs were, which is a nice touch- even if it might be a coincidence. \n\nThe action in this film is excellent and is very entertaining to watch. The film takes place all over the city and everything is always changing, the film has a very good sense of tension and dread and there is just chaos everywhere but not in a bad way. The longer the film goes on the panic in the city gets bigger and bigger and he filmmakers did their job because the film manages to sustain that feeling throughout the whole film. The film also has an excellent elevator scene, which, like the catchphrase, has become a staple of the series but this one in particular is excellent and I haven't seen a more tension fuelled elevator scene with perfect set up again until The Winter Soldier. And it's all accomplished without McClane killing anyone in the first hour, awesome.\n\nI only have two complaints. They shouldn't have visually revealed who was behind everything when they did and kept it in suspense for a little while longer, I can't say much else because it's really hard to talk about the plot in this film without spoiling it but I'll just say, if they had just kept it in suspense for a little while longer and revealed who it was in the bank scene, that would have been great. Also, I think the film should have ended a few minutes earlier than it did. The film looks like it is wrapping up but then goes on for a few more minutes and I don't think it really needed to but it gives us a chance to hear the catchphrase one more time, so there is that. It's different for a film to end that way but it feels really tacked on and added after the fact, though. It's weird.\n\nNevertheless, Die Hard: With a Vengeance is an excellent film and sequel and probably my favourite sequel out of them all and the fact that it has a rotten rating, at least at the time of writing this, baffles me. Adding many new elements but keeping the core basics of what make a Die Hard film work, Die Hard: With a Vengeance is a fantastic sequel and a very enjoyable and exciting watch. This would have been a great end to a trilogy if this was the last one, regardless of what critics say.",
            "review_date": "2015-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "McTeirnan is back with an excellent Die Hard. The plot is great, the characters are great and the action sequences are great. What more could you ask for in a third instalment of a series?",
            "review_date": "2015-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "100%\n----------\n5.0  -  Bruce Willis\n5.0  -  Samuel L. Jackson\n5.0  -  Jeremy Irons\n3.5  -  Kevin Chamberlin\n3.0  -  Graham Greene\n3.0  -  Larry Bryggman\n3.0  -  Colleen Camp\n2.5  -  Sam Phillips",
            "review_date": "2015-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good action movie that has McTiernan comming back from the first die hard to the third installment of the franchise.",
            "review_date": "2014-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A different kinda die hard film\nIt's plot takes it to a whole new level which make it just as entertaining and thrilling as the first\nBruce willis is great as well as Samuel L Jackson as the side-kick \nGreat villain great plot\nSilly moments but still great",
            "review_date": "2014-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bruce Willis and Samuel L. Jackson... Always a great match!",
            "review_date": "2014-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite from the original Trilogy. Willis and Jackson make Gibson and Glover look like Tango and Cash.",
            "review_date": "2014-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good action movie that has McTiernan comming back from the first die hard to the third installment of the franchise.",
            "review_date": "2014-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Samuel L. Jackson and Bruce Willis were great together!  The humour between the two were priceless at times.  Action packed and the best Die Hard yet!",
            "review_date": "2014-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bruce Willis, Samuel L Jackson, Jeremy Irons, car chases, explosions, subways being destroyed, all with practical effects, a guy being beaten with a door on a boat, and it opens with Hot Town Summer in the city followed by a massive explosion?\n\nGreatest. Movie. Ever.",
            "review_date": "2014-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Die Hard sequel, Jeremy Irons and Samuel L. Jackson are welcome additions alongside Bruce Willis's smirking demeanor.",
            "review_date": "2014-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great action movie, with some great comedic moments.",
            "review_date": "2014-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "15/15\nbest action movie ever",
            "review_date": "2014-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good or entertaining as the 1st two films, but Bruce Willis still successfully gives us the good action in this installment!   A-",
            "review_date": "2014-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "100%\n----------\n5.0  -  Bruce Willis\n5.0  -  Samuel L. Jackson\n5.0  -  Jeremy Irons\n4.5  -  Kevin Chamberlin\n4.0  -  Graham Greene\n4.0  -  Larry Bryggman\n3.5  -  Colleen Camp",
            "review_date": "2014-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "100%\n---------\n5.0  -  Bruce Willis\n5.0  -  Samuel L. Jackson\n5.0  -  Jeremy Irons\n4.5  -  Kevin Chamberlin\n4.5  -  Larry Bryggman\n4.0  -  Graham Greene\n3.5  -  Colleen Camp",
            "review_date": "2014-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lot better than the second  this wasn't a carbon cut copy more action and Samuel l Jackson was great here and Bruce Willis was awesome as usual a lot better than the first now is it as good as the first No but it's very entertaining a good return to form for the die hard films \nGrade B",
            "review_date": "2014-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intense and memorable, this entry in the franchise brings more action and an even better setting and cast of characters.",
            "review_date": "2014-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm a huge Alan Rickman fan and an even bigger Bruce Willis fan. Ever since Alan threatened to carve out robin hoods heart with a dull spoon and dazzled me in CLOSE YOUR EYES...I've been enchanted by his as savoire faire. Ever since Bruce made me die laughing in blind date and blew my mind on moonlighting I've been a die hard fan (pun intended). Bruce didn't need to nearly destroy nakatome or freeze his ass off in the first two movies to impress us but he did. However, nothing could have prepared me for how perfect this third instalment was. The brilliance of the heist and decoy bombs, the hilarious teaming and execution of Willis and Jackson following Simons riddles around the city, the scale of the destruction and access to the gold, the charm of the trucker, the dark and weird villains, the washed-up hero recipe all combine for what is easily a movie hard to beat. There's a kind of poetry to this sequel that is hard to deny and a sort of new cleverness that indicates someone behind the wheel is steering with new intensity and passion. The attention to details is beyond belief. I'm grateful! Thank you!",
            "review_date": "2014-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "what a poor poor movie very disappointing a movie that makes die hard 2 look great Bruce Willis is not even john mclaine seems like he's in the movie to collect a paycheck the movie is more bloody for no reason this movie tries to hard to me its trying to be like lethal weapon and its failing Hans gruber's brother cmon wow great plot twist this movie fails to capture die hard 2 sensibility and it really fails to capture the originals shear genius poor excuse for a sequel unnecessary too the only reason to watch it is is if you want to see a good performance by the great Samuel l Jackson",
            "review_date": "2014-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though there are several plot conveniences, the addition of Samuel L. Jackson as Bruce Willis's partner makes the movie much better than the previous installment.",
            "review_date": "2014-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is my 3rd favourite in the iconic Die Hard franchise. It has solid action, witty humour and its nice for John McClane to have partner for the most part. With a Vengeance has a bit of everything, as is the most similar to 4.0. Although its execution wasn't as good it is one of the better sequels to its original and Die Hard still hasn't lost its charm, albeit under all the macho and blood. Jeremy Irons is my favourite Die Hard villain of all, and is a terrific actor.",
            "review_date": "2014-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is hard to believe an action franchise can maintain such high standards through three movies. Rather than everyone's favorite rouge cop stumbling into another again, this movie does something different. This time trouble seeks him out in his hometown of New York City. Not only that, but this time another innocent civilian finds himself implicated in John McLane's crisis. It is nice to see a reshaping the template from the first two movies. There is no \"here we go again\" generic sequel feeling to this. Samuel L Jackson brings intensity as Willis' informal partner. Bruce Willis still delivers exactly what a movie like this needs. He is just as tough and stubborn as ever, but has the qualities that make us care about his character. He and Sam Jackson work well together. Another nice touch is how this terrorist threat links back to the conflict from the first movie. Jeremy Irons makes another worthy British villain. His bomb threats, riddles, and scavenger hunt approach to his dastardly plan move the story along well, and continue to change in a gratifying way that builds good suspense. The only letdown is the showdown in the final scene. These movies are not supposed to be realistic, but this last scene takes things a little too far. Still, when everything else works so well in terms of the story, the action, and the characters, this is forgivable.",
            "review_date": "2014-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is so over the top that it took every ounce of creativity for the sake of our own entertainment! I wish Bruce Willis and Sam Jackson can once again star together in a film just like this one!",
            "review_date": "2014-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my mind, I always believed that this was the best Die Hard in the series. Everything about the movie was awesome. There was plenty of suspense, there was Samuel L.Jackson, there was lots of action, and a very interesting story. Highly recommended for any action fan.",
            "review_date": "2014-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bruce Willis and Samuel L. Jackson team up for an awesome action movie that has good action sequences and a cool opening.",
            "review_date": "2014-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this film the cast are hilarious and sam jackson is f ing hilarious just such a good film\nIm not sure but I even think willis tried in this",
            "review_date": "2014-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A predictable and drawn out last half doesn't rub off an intriguing and suspenseful first. Irons stands out as the slick and cold villain who almost meets the brilliance of Rickman in the first installment.",
            "review_date": "2014-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Again. This movie was fun, but some stuff didn't make sense.",
            "review_date": "2014-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die Hard 3 started off fast and entertaining. From riddle to riddle it was fun to watch. But later into the movie it just started to drag on and on and didnt finish off to its promising beginning. Die Hard 3 was a decent installment",
            "review_date": "2014-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A pretty unreasonable plot and an attempt to copy and paste the original bad guy were the only downs to this film.  Die Hard 3 is a fun film to watch.  The chemistry between Sam Jackson and Bruce Willis is fantastic and it essentially make the movie.",
            "review_date": "2014-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slightly better than Die Hard 2, but of course not as good as the original Die Hard.  This one had a pretty cool plot and setting with a cool nod and tie in to the first film.",
            "review_date": "2014-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie came out 12 days before I was born in exactly 1995",
            "review_date": "2014-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With this having been the first DH film I ever watched (and the only one so far I have seen upon its original theatrical release), I hold a quiet sense of satisfaction that over time it seems to have become generally people's favourite of the series, next to the original. It is much more original than its predecessor, and has much higher-caliber supporting players in Jeremy Irons and Samuel L. Jackson--not to mention the best director the franchise has ever had.\n\nThis was great to see once again, and I STILL have nightmares with that wicked Katya (played by composer Sam Phillips) slicing my head off...",
            "review_date": "2014-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Samuel L. Jackson and Bruce Willis' are a superb on-screen team, and whilst Jeremy Irons is deliciously malevolent as the villainous Peter Gruber, its a shame to see him paired with some of the most generic, underdeveloped villains in cinema history. However, with visceral action and great chemistry between the main three actors, Die Hard 3 is possibly just as good as the first.",
            "review_date": "2014-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This the second best \"Die Hard\" movie of the series. Bruce Willis and Samuel L. Jackson's chemistry together is amazing. And Jeremy Irons owns his role as the villain playing Hans Gruber's brother Simon Gruber.",
            "review_date": "2014-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This the second best \"Die Hard\" movie of the series. Bruce Willis and Samuel L. Jackson's chemistry together is amazing. And Jeremy Irons owns his role as the villain playing Hans Gruber's brother Simon Gruber.",
            "review_date": "2014-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While some may consider it a far cry from the original, it's the chemistry between Willis and Jackson as well as Irons' great villain that elevates \"With a Vengeance\" to a great end for the \"Die Hard\" trilogy. And, as far as I'm concerned, the last \"Die Hard\" movie ever made.",
            "review_date": "2014-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is my favorite die hard movie. it's just everything you could possibly want from die hard movie",
            "review_date": "2014-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My second favorite die hard movie. This is one of the most underrated movies of the 90s. I had action, humor, and Samuel l Jackson. What more can you ask for? Obviously it's not as good as the first die hard but it gets closer than any of the other sequels.",
            "review_date": "2014-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed this more than the other two to be honest. The story was good and had some good action, also had Samuel L Jackson who is amazing throughout.",
            "review_date": "2014-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The second best!! I really thought this was perfect, it loses a little steam somewhere halfway through but it's still great fun",
            "review_date": "2014-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Built 'round a triangle of stars (Willis/Jackson/Irons) this movie doesn't manage to get better than its predecessor. The plot and action scenes are even cheesier than in Die Hard 2 but the interaction between Willis and Jackson in the leading roles makes it watchable.",
            "review_date": "2014-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"JOHN MCCLANE MUST SAVE NEW YORK\" \n\n- The third installment in the 'Die Hard' film franchise surrounding the action hero John McClane is this 'Die Hard with a Vengeance' from 1995. I find this part better than the second movie. The action takes place in New York city and has everything a good action movie needs: lots of shooting, high speed chases, a great villain and a slightly humoristic note. I would also like to mention the soundtrack, which was very well chosen. With Bruce Willis (Die Hard, The Sixth Sense), Samuel L. Jackson (Pulp Fiction, Jurassic Park) and Jeremy Irons (Beautiful Creatures, Kingdom of Heaven). \n\nAfter a bomb goes off in the Bonwit Teller department store in New York, a man who calls himself 'Simon' (Irons) telephones to the police and claims that he has placed more explosive devices in the city. In order to stop them from going off, he demands that John McClane (Willis) performs a series of childish tasks. The first one is to wear a sign saying 'I hate all niggers' in the centre of Harlem. It doesn't take long before shop owner Zeus Carver (Jackson) notice him standing on the street. He goes outside to talk to McClan, but can't prevent a group of teens wanting to beat him up. \n\nBack at the police station, Simon calls again. He wants McClane and his new made friend Zeus to go to a certain location and solve a riddle. Doing so, the two men get to know that one of the bombs is on a subway train. Who is this crazy Simon? And can they stop his bombs that threaten New York?",
            "review_date": "2014-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's fun to see how McClane plays Simon's little game in NYC, with Samuel L. Jackson at his side, and the film delivers the goods with a vengeance. Lots of action and explosions, just like what you would think. Some parts feel like an afterthought (the ending), but most of the movie works well as a Die Hard movie.",
            "review_date": "2014-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's no Die Hard, but it's packed to the core with action - and the interplay between Bruce Willis's McClane and Samuel L. Jackson's Zeus is consistently hilarious. There's even a good old-fashioned \"yippee-ki-yay\" before it's all over.",
            "review_date": "2014-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "way better than the second one.  Adding a buddy-cop element made it much more entertaining.",
            "review_date": "2014-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tying up one of the best action trilogy's ever! This third entry explodes with great performances and intense action. And holds one of the best buddy chemistry with Bruce Willis and Samuel L. Jackson.",
            "review_date": "2014-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "SLJ is the man.  Good well timed humor mixed into the action!",
            "review_date": "2014-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "*****\nAlthough some may argue that Die Hard: With a Vengeance is not as good as the original because it lacks the suspense etc. I judge a movie by how much I enjoy it. And in the case of this film, I enjoyed it just as much as the original, maybe even slightly more!",
            "review_date": "2014-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The action goes back to its roots and pulls out something clever and witfully charming in comedy and action.",
            "review_date": "2014-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Back in the day when Bruce Willis still had a tuft of hair left he teams up with Samuel L Jackson who plays an angry black man and for me spoils the film. \nDropped into the film based merely on his then new popularity Jackson plays one of the most obnoxious,racist characters ever, every time hes on I want to switch off.\nAs a side show to Jackson the story gets a bit silly and when the ending arrives you cant help but feel a sense of de ja vu.",
            "review_date": "2014-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still loved the series. First two were better",
            "review_date": "2014-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As good as the first.",
            "review_date": "2014-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely not that good.  Pretty boring.",
            "review_date": "2014-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite in the Die Hard series. 4/5",
            "review_date": "2014-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Taut, fast-paced, and packed with nonstop action and humor, Die Hard: With a Vengeance isn't without flaws, but it serves up plenty of popcorn entertainment.",
            "review_date": "2014-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "still an Awesome movie even though it's the third one!!",
            "review_date": "2014-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bruce Willis returns as his most famous movie alter ego John McClane. The washed up battle wearly NYPD detective. Here this adventure is set in a pre 9-11 New York City.\nMcClane is aided by Samuel L. Jackson as Zeus Carver as he races across New York to solve the never ending problems purposely set by Jeremy Irons as Simon Gruber. Gruber is the younger brother of Hans Gruber from Die Hard.\nI rate this instalment as better than Die Hard 2, 4.0 and Good Day To Die Hard.\nJackson adds comedy value to the guns and braun of Willis.\nThe movie is somehow nearly 20 years old as of writing. Willis still has the last streaks of head hair!\nMy only criticism of the movie is perhaps the final quarter which seems to veer off at a tangent.\nMcClanes colleagues at the NYPD precinct also lack the like ability of the LAPD guy in Die Hard 1 & 2 (Al?)",
            "review_date": "2014-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its a really good movie i love watching this movie ive seen it soo many times and i still love watching it",
            "review_date": "2014-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good strong league and very good action and shooting",
            "review_date": "2014-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic action and a fast paced movie. This is my favourite Die Hard movie!",
            "review_date": "2013-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very entertaining!!! \nPutting Samuel L. Jackson As Bruce Willis partner was a great idea.",
            "review_date": "2013-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hans Gruber was such an iconic villain, but his brother just doesn't give that vibe. Liked the chemistry between Willis and Sam Jackson.",
            "review_date": "2013-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "personally think its better or as good as the first one, Has a better darker feel with alot of great action  - 9/10",
            "review_date": "2013-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good movie, not as good as the first one, but better than the second one. I love the plot but some parts don't really make sense. The movie gets you really tense and it has some good action scenes. One major plot twist but it's done in a good way. Pretty good movie, i recommend it to most people.",
            "review_date": "2013-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite of the five. Samuel. L. Jackson. and Bruce Willis are the best partners ever!!! (90%)",
            "review_date": "2013-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Christmas with the McClanes\" came a little early in 1995, so much so that they just finally decided to scrap that whole Christmas theme, outside of a few cute, but somewhat forced winks at \"Die Hard\" and Christmas fans, either because these films are running together too much as it is without the Christmas theme, or because the \"Christmas in July\" novelty was old back in the '80s and '90s. I don't know about a Christmas theme, but this film is certainly bringing back John McTiernan, or at least I think they are, because, like I said, the first \"Die Hard\" and \"Die Hard 2\" ran into each other so much that I couldn't even tell the difference between direction. Well, if Renny Harlin was, by chance, key in their decision to give \"Die Hard 2\" the subtitle \"Die Harder\", then you can definitely feel his absence, as \"Die Hard with a Vengeance\" is a pretty cool title, even though I doubt the effectiveness of a vengeance exacted when you're dead, and in a hard fashion no less. You know what, I think this film's title gets a whole cooler when you see it on the poster, right above Samuel L. Jackson's name, which, of course, makes everything a little bit cooler. By that logic, this film's title, alone, was downright awesome five years later, when Jackson did a certain other cop film, because people could look back and think of this as the ultimate super-cop team-up between John McClane and John Shaft. Shoot, and on top of all of that, they're going up against Jeremy Irons, who was born to play a clichéd, intellectual terrorist mastermind, so they may as well have kept up the Christmas theme, as this is a Christmas present to action thriller fans if I've every heard of one. ...Nah, nevermind, because the filmmakers were right if they did, in fact, feel that, even without the Christmas theme, these films carried too many similar elements, including certain flaws that haven't gotten any less forgivable the third time around.\r\n\r\nAs much as I joke about how much this series' installments run together, seeing as how the first two entries were too close in content for comfort, this particular film is pretty distinguished from it predecessors, although it's hardly different from thrillers of its nature, and no matter how much the attempts at complexity work to settle predictability, it's pretty easy to tell where this trope-heavy path is leading, no matter how much it stretches on. Longer than the still draggy \"Die Harder\", this film runs around the same length of the original \"Die Hard\", which was, of course, by no means reasonable, so, as sure as sunshine, while there is a touch more eventfulness to this narrative than the ones, or rather, \"one\" followed by the predecessors, storytelling is still packed with draggy material and even some excessive filler. The final product is arguably not quite as overlong as one might think when comparing the layers of this story concept and the interpretation's final runtime, but this is still about as overdrawn as the first two films, as its story concept is still too thin to sustain a length of almost two hours and a quarter, no matter how many questionable paths they try to take. Sure, there are some cheesy moments in dialogue and comic relief, but it's the plot structure that is most questionably drawn by writer Jonathan Hensleigh, who all but convolutes the narrative with overblown set pieces, but not without placing some thinness to characterization. As one might expect, this script is hardly subtle, and it's hard to ignore this when director John McTiernan bloats his storytelling atmosphere with a momentum that may be fun in its tightness and all, but carries some sense of overambition that stresses problems, which are limited in quantity, but considerable in magnitude. What missteps there are in this perhaps intentionally flawed, over-the-top blockbuster are very recurring, and while I'm not asking for much out of this effort, this is still kind of an underwhelming thriller, like its predecessors. Of course, also like its predecessors, this film sure provides plenty of fun, enough so to succeed as an action thriller, complete with, well, some thrilling action.\r\n\r\nNot quite as directly brawl-driven as the first two installments of this series, this film's action aspects even deliver on thrilling non-combat set pieces whose tight momentum reinforces a sense of race against time, while the hand-to-hand, or gun-to-gun, or explosion-to-explosion set pieces that we all know and love about this franchise prove to be well-staged and choreographed, with a certain intensity and slightly over-the-top grandness to both entertain and keep up some tension. What combat there is is as thrilling as it usually has been in the series, at least up to this point, and when we're looking at relatively simple chase sequences, you can also expect plenty of thrills, yet this is still a less action-oriented installment in the thriller saga, so don't expect too much biting action. Of course, that's not to say that the story, alone, doesn't have some bite to it, because even though meat is limited, partly due familiarity and largely due to this flick's being barely, if at all less minimalist than its relatively simple predecessors, the formula is distinguished from the formula followed by \"Die Harder\" and \"Die Harder\" for you to gain a particularly firm grip on intrigue, which is very present, thanks to riddle-driven complexities and other colorful, if questionably drawn attributes that trip up the mind in a fairly fun fashion, often complimented by tension, and near-consistently brought to life by John McTiernan. McTiernan is about as bombastic in his storytelling as he was when he worked with the first \"Die Hard\", but an overtly brisk pacing does more than just beat you over the head and flavor up thrilling action, sustaining a velocity that graces heights in conflict handling with tension, and never lets up on a colorful atmosphere to entertain thoroughly. McTiernan's storytelling is tense about as often as it is faulty, yet fun never abates, driving the film, at least as a fluff piece, complete with all of the thrilling action and \"complexities\" that I addressed earlier, as well as the colorful performances that you might expect from a cast like this. The supporting players are pretty decent and all, with Jeremy Irons being convincing and even morbidly charming in his portrayal of a flamboyant and dangerous intellectual antagonist, but it's the leads who really keep things going, with Bruce Willis not being given the dramatic material that he sometimes had to reinforce a sense of consequence in the first two films, but still delivering on that classic action star charisma, which Samuel L. Jackson all but matches with his trademark, over-the-top intense charm, whose bonding with the charm of Willis produces a delightful frenemy chemistry that does much justice to the buddy aspect which drives this particular \"Die Hard\" installment in a lot of ways. Willis and Jackson keep the momentum up about as much as anyone, and there are plenty of people and aspects to sustain a fun factor, which ultimately crafts quite the entertaining thriller, regardless of the shortcomings that we've come to expect out of films like this.\r\n\r\nOverall, while this film is distinguished from its predecessors, by no means is it all that distinguished from formulaic thrillers of its type, featuring bloating in both unsubtle storytelling and length to only stress the natural shortcomings that secure the final product as underwhelming, yet are challenged enough by thrilling action, an intriguing narrative, thoroughly well-paced direction and a colorful cast - headed by the delightfully charismatic duo of Bruce Willis and Samuel L. Jackson - that \"Die Hard with a Vengeance\" is able to stand as a fun, if overtly fluffy third round in a classic popcorn saga.\r\n\r\n2.5/5 - Fair",
            "review_date": "2013-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "EXPLOSIONS, CUSSING, DUMB HUMOR.  Thats what I want when I watch a Die Hard movie and thats what you get.  Deal with it.  This one is just a little better than some of the others because it includes Samuel L. Jackson and the old Charleston Bridges.",
            "review_date": "2013-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like its predecessors, Die Hard: With a Vengeance satisfyingly blends humor and high octane action.  The twist to this Die Hard story is that instead of being confined to one location, John-wisecracking-McClane is forced by the antagonist to go all over New York City.  Does it work? Yes.  Bruce Willis and Samuel L. Jackson play off each other perfectly, the action is well choreographed and exciting, and Jeremy Irons is competent as Simon Gruber.  It doesn't reach the heights of the 1988 classic, but it's a definite step up from part 2 and a strong action picture.",
            "review_date": "2013-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "where the series turned into Carmen Sanediego meets Wheres Waldo and Jackson played his standard \"everythings about race\" card",
            "review_date": "2013-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "John McClane is back and this time is New York City. While the Christmas setting has been dropped, this film is still great and still a true Die Hard film. McClane must team up with Zeus Carver and must complete a series of clues to find several bombs that have been placed in NYC by a mysterious person known as Simon. The twists are terrific and the action keeps getting better, with each scene outstaging the other. Bruce Willis and Samuel L. Jackson work perfectly together in this film, with Jackson adding great comic-relief. Jeremy Irons is also perfectly cast in the role of the villain Simon, who is probably the Die Hard's Franchise's best villain since Hans Gruber. The film moves at a great pace, while also making several unexpected references to the first in plot structure.",
            "review_date": "2013-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now that was a lot of gold",
            "review_date": "2013-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die Hard 3: With a Vengeance is bolstered by its awesome villain, great chemistry between Willis and Jackson, smart dialogue, and abundance of good thrills, but it suffers from an inane plot (even by Die Hard standards) and a rushed pacing with no buildup.",
            "review_date": "2013-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bruce Willis on board check,now add Samuel L Jackson with Jeremy irons as the vilian and this makes one of the ultimate ways to wrap up a trilogy obviously still not as good as the first film but close.",
            "review_date": "2013-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining enough as it is being a buddy cop movie and having such a great actor like Jeremy Irons playing the villain, I feel like some of the charm that the first and second had is lost at this point.",
            "review_date": "2013-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "riggs and murtaugh were awesome in this",
            "review_date": "2013-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was alright.\n\nIt was also way too long for it's own good, and you know what, it over stayed it's welcome.\n\nBruce Willis is back with a real performance, seriously lacking in a lot of his recent work, and he actually plays John McClaine. Samuel Jackson plays the sidekick, who talks about being black for most of the movie. They have a good chemistry, but the film as a whole is a bit messy.\n\nAt some points, the film starts to make you wonder if the film would work better if McClaine was not there. It would definitely run smoother. For the first hour it worked as a funny and campy action movie, but then it just started to drag, and really felt repetitive after a while.\n\nIt has a dip in the middle, and then picks up when the scene in the school takes place, but then when you think it ends, and you feel mostly satisfied, you forget about one major plot point, where then this badly executed chase scene occurs that dragged the film down for me. I just got a little bored. it became more and more implausible and silly, and I just turned off.\n\nDie Hard with a Vengeance isn't as mediocre as Die Hard 2, but it definitely overstays it's welcome.",
            "review_date": "2013-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's only on this most recent watch that I've realised Die Hard With a Vengeance's true greatness. First of all here is a third parter that doesn't suffer the third parter curse of being an utter disaster. It also mangabeys to surpass the second film in merit (although I do have a big soft spot for the relentless action trash that is Die Hard 2) \n\nEveryone's favourite cop, John McLane is back in this big and bold third parter. This film follows the recipe that made the first a success. Some fantastic character interaction between our leads, enough action and explosions to keep the audience more than occupied and a quality bad guy. This time round a rather menacing Jeremy Irons gives a splendidly sinister performance. \n\nYes there's a few over the top moments and a couple of unnecessary and almost redundant characters but this is a very solid sequel to one of the best Action films ever made.",
            "review_date": "2013-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm a huge fan of Die Hard, and since everyone has been singing praise over this film, I was excited to check it out, and let me tell ya, I LOVED it. The acting is top notch from Willis and Samuel L. Jackson. The story is brisk and suspenseful, and the villain is awesome, even if his motives got a little confusing towards the end. The action was on par with Die Hard and even exceeded it in some areas. The music was standard action movie music, nothing special, but then again the Die Hard series has never been known for having an catchy themes. The direction is clear and confident. The writing is excellent as well. And the editing was one thing that surprised me about the film, it was fantastic. Seriously, this film is very stylish for a Die Hard movie. This film is a great improvement over the sub-par Die Hard 2 and is my second favorite Die Hard movie. Yippee-ki-yay, indeed. \nOverall: A brisk and fun action film that is also clever and well written. \nFinal Score: 8.5/10",
            "review_date": "2013-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe not as bad as it looks. But story is too much all the time.",
            "review_date": "2013-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die hard with a vengeance is an action packed, funny and exciting film with great characters and hilarious chemistry between Bruce Willis and Samuel L Jackson.",
            "review_date": "2013-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm a huge fan of Die Hard, and since everyone has been singing praise over this film, I was excited to check it out, and let me tell ya, I LOVED it. The acting is top notch from Willis and Samuel L. Jackson. The story is brisk and suspenseful, and the villain is awesome, even if his motives got a little confusing towards the end. The action was on par with Die Hard and even exceeded it in some areas. The music was standard action movie music, nothing special, but then again the Die Hard series has never been known for having an catchy themes. The direction is clear and confident. The writing is excellent as well. And the editing was one thing that surprised me about the film, it was fantastic. Seriously, this film is very stylish for a Die Hard movie. This film is a great improvement over the sub-par Die Hard 2 and is my second favorite Die Hard movie. Yippee-ki-yay, indeed. \nOverall: A brisk and fun action film that is also clever and well written. \nFinal Score: 8.5/10",
            "review_date": "2013-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bruce Willis is still in it. He's always in action, making bad jokes and saving people one year at a time.",
            "review_date": "2013-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movie sequels of all time and  the villains is a total badass",
            "review_date": "2013-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The last of the good ones in this series.",
            "review_date": "2013-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Add a Review (Optional)",
            "review_date": "2013-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die Hard 3: With a Vengeance plus the addition of Sam L. Jackson proved to be a formidable installment. It couldn't top the original that's extremely hard to do. At times the dialogue did tend to go for a long span of time that was the only negative.",
            "review_date": "2013-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ties with part one for being the best of the series.",
            "review_date": "2013-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An entertaining movie full of action and humor, no doubt better than the atrocious second installment even if not in the same level of the original film. And despite a flawed last half, it has Samuel L. Jackson stealing the scene and Jeremy Irons as a great villain.",
            "review_date": "2013-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bruce Willis and Samuel L. Jackson are a great pairing!  Good suspense and the action is solid but also a little hokey.  Jeremy Irons is a good villain.",
            "review_date": "2013-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than the second one!",
            "review_date": "2013-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I quite enjoyed this film.the action was entertaining the script wasn't too bad, Willis and Jackson work well together on screen. A thoroughly good caper.",
            "review_date": "2013-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Almost as good as the first honestly. For being the third movie in a series this was totally awesome! Typically the third movie in the series is nothing above average. Die Hard 3 is far above average. I loved Samuel L. Jackson in this. Him and Bruce Willis made quite the pair of heroes. They had some great chemistry going on. I liked every aspect of this movie. The story wasn't very original, but it was very well executed. And the action was badass!",
            "review_date": "2013-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome. A very good action film and revenge story. Really like the link between this and the first Die Hard as well; however, it doesn't match the hardcore popcorn action movie that began the franchise.",
            "review_date": "2013-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too much action, and little plot, for my liking. Not bad, though.",
            "review_date": "2013-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great actioner.",
            "review_date": "2013-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite a letdown. They should have stopped at 2.",
            "review_date": "2013-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is better than than the second die hard and close to the first, this makes up for what was lacking in Die Hard 2 fluently AND WITH A VENGEANCE!",
            "review_date": "2013-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die Hard: With A Vengeance continues the adventures of John McClane, who this time is asked to play Simon Says with a terrorist, which turns out to be Hans' brother, and if he fails a bomb explodes! so it's up to John McClane and Sam Jackson to save New York from the terrorist, this is an exciting, funny movie, way better than the second one and more menacing. The chemistry between Bruce Willis and Sam Jackson is awesome, they crack jokes and make the movie better. The only problem is the final scene, which, without spoiling feels rushed compared to the rest of the film, but it still is a great action movie and an improvement over the second one.\n4.5/5",
            "review_date": "2013-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yeah, its not as down to earth or intense as the original and the climax is kind of lame but Die Hard 3 boasts some excellent onscreen chemistry from Sam Jackson and Bruce Willis, some great action scenes, and a suspenseful mystery plot.",
            "review_date": "2013-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the better sequels to die hard. the chemistry between john and zeus were great. the bad guy was alright not the best.",
            "review_date": "2013-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An enjoyable movie all around. My favorite of the 5",
            "review_date": "2013-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die Hard with a vengeance. Yes, the title has literal meaning in the film. This is an extremely underrated movie and beats the hell out of Die Hard 2. This one takes a different direction from the first two films, instead of being stuck in a skyscraper or an airport John Mclane is being ran all over NYC in an attempt to halt another terrorists plot, led by none other Simon Gruber portrayed by Jeremy Irons. Samuel L. Jackson does an excellent job as Mclane's sidekick. The only fault I can find in this film is that the ending seems to separate itself from the rest of the movie.",
            "review_date": "2013-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Samuel L. Jackson is sick and tired of these motherfuckin' Germans and their motherfuckin' gold. And so is John McClane, in what's at least the funniest, and all around most amusing (if decidedly *not* best) Die Hard movie.",
            "review_date": "2013-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Putting Sam Jackson was smart\n\nDie Hard 3 was better than the second one in my opinion. Mainly because of Sam Jackson's clever humor he brought into it. But I can't say it's better than the original here.  But give it credit than being better than the second.\n\nI liked it, I give it 8 out of 10",
            "review_date": "2013-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the worst Die Hard film.  And this is coming from a guy who thought 1 was okay.",
            "review_date": "2013-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've never been a big die hard fan, but the movies were enjoyable. I'd rate this one lower if it weren't for the other two sequels. in this day and age it feels refreshing how \"simpler\" action movies were. not overstylized slo-mo impossible super human stunts, etc. - although, halfway through the movie it did turn into a looney tunes cartoon.\n\nif you've seen the previous two die hard movies, you've already \"seen\" this one. it's watchable.",
            "review_date": "2013-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest sequel to the Die Hard franchise!",
            "review_date": "2013-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite of all the Die Hard movies.. The combination of SL Jackson and B Willis is some of the best onscreen chemistry I've ever seen. Loads of action as well as comedy make for an excellent movie where there's never a dull moment..",
            "review_date": "2013-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still a great film but it lacks the action we wanted",
            "review_date": "2013-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an incredible cast. Bruce Willis is still gives the audience what they need, Samuel L. Jackson is of course awesome, and of course Jeremy Irons is one of the best villains in Die Hard history.",
            "review_date": "2013-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With great action, a interesting villain, and two great leads with chemistry Die Hard With a under rated sequel that is almost as good as the first Die Hard",
            "review_date": "2013-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful movie in the Die Hard cannon every bit as good as the first and second movie. The plot is usual for a Die Hard movie. The acting is awesome, especially by Willis, Jackson and Irons. Jeremy Irons gives a commanding performance as the main baddie and the interplay/chemistry beween Bruce Willis and Samuel L. Jackson is funny as hell. The special effects were good and the action scenes were very good, albeit slightly (I believe) more mellow and less extreme than the first two movies. Good good good good!",
            "review_date": "2013-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While entertaining, something was missing and it became impossible to ignore the improbabilities.",
            "review_date": "2013-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Basically a rip-off of the runaround scenes in 'Dirty Harry' (1971) stretched into a thin premise. Overplays the race-card with an obvious ham fist that felt outdated in 1995, and even moreso now. [rolls eyes] (Although the first glances between Willis and Jackson are priceless.) By contrast, the racial subtext in 'Dirty Harry' is more subtle and progressively-minded, within by far the superior film. \n\nThis is the weakest instalment in the Die Hard series.",
            "review_date": "2013-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My 51st R-rated movie!  Better than the second, but still not as great as the first by a small margin.  Has lots of great action, thrills, heart, and humor.  Great performances from Bruce Willis, Jeremy Irons, and Samuel L. Jackson, who heavily benefit from chemistry and connection.  The return of director John McTiernan also gives some returning elements from the first one, which are more humor than the second, and more tension.   Also, it still has \"yippie-ki-yay mother******\".",
            "review_date": "2013-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A improvement over Die Hard 2, Die Hard With A Vengeance is the best sequel to the original because it has the director from the first film. The film has great chemistry with Bruce Willis and Samuel L. Jackson, well shot action scenes, and a great villain.",
            "review_date": "2013-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it got mad points for the explosions",
            "review_date": "2013-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Die Hard movie directed by John McTiernan. The movie itself is ok, not the best Die Hard film put on the big screen. It's more of a thriller than an actual action movie. More brains than brawn, the only parts that really bug me in this movie was the racial arguments between John McClane and Zeus and also the thing I really got irritated was the ending, I find it really rushed and cheesy. Not worth seeing if you're an action fan, but a Die Hard fan, you will need to see it. Yippee Ki-Yay",
            "review_date": "2013-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "John McTiernan returns to the series he knows best crafting a film that is exploding with fun and excitment. \"Die Hard With a Vengeance\" has sensational set pieces, a gripping story and an always likable performance from Bruce Willis (not to mention Samuel L. Jackson) as the sarcastic, tough as nails cop who always finds himself in a bad situation.\nBut it sure is entertaining for us.",
            "review_date": "2013-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Audiences are right this time.Action extravaganza masterpiece.",
            "review_date": "2013-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why 50%???? this movie was awesome!.",
            "review_date": "2013-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jeremy Irons arguably the best valain in DIe Hard series, I like his appearance every time he's on screen. Sharp and portrait his character on a different level than Bruce and Samuel, To me this movie is better than 2.",
            "review_date": "2013-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good Die Hard sequel. John McTiernan (Director of the first Die Hard) did this again. Simon Gruber is after John McClane for killing his brother and he is after millions of gold. That's a really good storyline and the only thing that sucks is the ending... You will find out about that, when you watch it. Still watch the third movie because its really entertaining",
            "review_date": "2013-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "lots noise fighting and good honest fun",
            "review_date": "2013-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best of the sequels, but not quite as good as the first.",
            "review_date": "2013-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as either of the first two. Too much was done and not enough ass-kicking.",
            "review_date": "2013-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From the Director of the original Die Hard movie, John McTiernan yet strikes again in this new Die Hard sequel, the movie is about the Vendetta of Hans Gruber's Death, who is Simon Peter Gruber. The cast is good, it is really intriguing. But then the ending is what lost it... Find out what that is!.But the movie is still good! Yippee Ki Yay",
            "review_date": "2013-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WAY better than the shitty second/",
            "review_date": "2013-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By far in a way better than the second and whilst not as good as the first it is only a little less good.",
            "review_date": "2013-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although these movies will never reinvent the wheel, it's always a highlt entertaining and comfortable visit with McClane and his brand of mayhem",
            "review_date": "2013-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die Hard 3: With a Vengeance does not meet the high standards of the other Die Hard films, but it was still very entertaining. Samuel L. Jackson was fantastic in the movie, which balanced out the weak antagonist, thin script and the not-so-much tension.\n\n6.5/10",
            "review_date": "2013-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A return to the gritty John McClane that I came to love from the first 'Die Hard'. A good plot with a surprisingly welcomed addition of Sam Jackson as John McClane's helper 'Zeus'. Great stunts and action, everything you'd expect from a 'Die Hard' movie that the filmmakers take seriously.",
            "review_date": "2013-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The banter between Bruce and Samuel L is electric, better than the second and a compliment to the first, with a vengeance succeeds.",
            "review_date": "2013-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sam Jackson is funny in this movie, and theres a bunch of explosins",
            "review_date": "2013-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Highly underrated.  Die Hard 3 is very good and action packed and shows a very badass and gritter McClane hunting down terrorists in NYC.",
            "review_date": "2013-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite Die Hard sequel. It's great.",
            "review_date": "2013-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fairly standard action fare. It is another Die Hard, plain and simple. You probably won't regret watching it.",
            "review_date": "2013-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favourite of the 3. Samuel L. Jackson adds to it for sure",
            "review_date": "2013-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A excellent film in the Die Hard series!",
            "review_date": "2013-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No matter if this does not get high ratings from serious people. I like it when Bruce Willis kicks some serious behind in his sleeveless shirt. One should not expect literary conversations when watching Die Hard, but bad guys with german accents, fire arms of all kinds, blood, sweat and all kinds of mayhem. That's what it is all about. Nothing less, nothing more. And Bruce.",
            "review_date": "2013-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Had it's funny moments for sure (Sam Jackson's great), but the story and action set pieces are disappointing.",
            "review_date": "2013-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WHat a great way to come back from Die Hard 2! Had some humour, a good villain and a giant chase. Defiantly a good way for John McClain to return.",
            "review_date": "2013-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one is underated.",
            "review_date": "2013-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still not being bether that the first one, but Bruce Willis and Samuel L. Jackson partnership, and the badass Jeremy Irons the movie was incredible fun!",
            "review_date": "2013-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the ending that this great trilogy deserved. It's got the same set-up as the original but with a twist. I know usually when films try pulling that off it doesn't work and it fails miserably but this movie perfects it. It's the original Die Hard but in a city with a Lethal Weapon set-up. Oh and since its a buddy cop system it has the perfect partner for the loud mouth John McClane (Bruce Willis). And that partner would be Samuel L. Jackson. And it's his only role that beats Pulp Fiction in my opinion and it barely beats it but it beats it with style. This movie focuses less on violence and more on explosions and it has a really good plot and plot twist. It was a truly great ending to the best trilogy and best movies ever.",
            "review_date": "2013-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "simon says watch this",
            "review_date": "2013-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably my second favorite die hard and best team ever",
            "review_date": "2013-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A breath of fresh air comes in the form of Samuel L Jackson joining up with Willis  on a wild goose chase around New York, the scope is massive and the dialogue between Jackson and Willis makes for some very funny moments.",
            "review_date": "2013-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The unexpected amount of suspense and fun the film brings makes up for its ending that almost feels stapled on.",
            "review_date": "2013-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A rare trilogy for an action entry and the leading man in the movie is Bruce Willis...",
            "review_date": "2013-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Die Hard 3\" re-awakens the action saga with more laugh-out-loud moments, improved performances and an epic return the the New York City cop screw-up McClane.",
            "review_date": "2013-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie, I enjoy it more now then I did at the time it was released. Absolutely hated it for the longest time. Guess I'm used to all the extremely uncomfortable racial tension now. Still not happy with the super convenient dismissal of Mrs.McClane from the series. Really sucks how they turned John into a mostly deadbeat dad. Irks me something fierce.",
            "review_date": "2013-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok i thought this movie was ok/good but the action was terrible and Samuel Jackson was too much of a worry wart while Bruce Willis was trying to get his job done.  Also, Jeremy Irons played a good villianm, but why all the stupid riddles that John McClane could easly see as fake!",
            "review_date": "2013-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie I loved it more then die hard 2 it had a good plot comedy for Samuel L Jackson just loved it",
            "review_date": "2013-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I actually liked this one better than the second one. It was a fun run-around action movie. Plus I enjoyed Bruce and Samuel's chemistry together. 6.5/10",
            "review_date": "2013-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jeremy Irons is a boon here, keeping audiences interest though the various plot turns. Bruce Willis, while slightly worn down, tends to keep the McClane character strong. The action is tense and the stakes are high.",
            "review_date": "2013-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as great as the first 2 films but still damn fun to watch!",
            "review_date": "2013-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my favorite out of the franchise so far. It perfectly balanced both humor and suspense, and I loved the addition of Samuel L. Jackson.",
            "review_date": "2013-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With Samuel L. Jackson and Bruce Willis, how can you go wrong",
            "review_date": "2013-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the original, but a decisive step up from the sequel. Willis and Jackson have a great rapport and the movie is undeniable fun.",
            "review_date": "2013-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still not as good as the first one, but it's getting there.",
            "review_date": "2013-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The MacGuffin plot is actually more interesting and fun than the actual plot. The film has not aged all that well, and the only thing that makes this film more than your average thriller is Bruce Willis as McClane, Sam Jackson as Zeus and the film's attempts at wit. The only thing memorable about this film is Willis, and that it was the last Die Hard film to not suck (though it did start the downward spiral of the franchise and the aggravating title trend we see in each new Die Hard film today).",
            "review_date": "2013-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fav so far of the ones I saw!!!",
            "review_date": "2013-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Explosive! An epic adventure from start to finish! Not as good as the first but way better than the second!",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loy Machedo's Movie Review - Die Hard 3: With a Vengeance (1995)\nHow do you ruin a great franchise and destroy a great movie sequel? Simple - Employ the services of John McTiernan as the Director. Would you seriously believe that even with a Power Cast of Bruce Wills & Samuel Jackson and larger than life crash-boom-bang stunts - they could not give us a decent sensible movie??? Terrible Script, Horrible Characterization, Miserable Directing and most Irritatingly Obnoxious Dialogues to add to misery to this Festering Foolish Film. Makes you wonder - how does Bruce Wills Character not suffer the misery of banged up joints, smashed muscles and inhuman stunts that goes with age? And then in the end - he not only loses a lot of blood, but also his shirt (he always does) and yes - he successfully kills the villain in the most comedic & humorous methods possible. \nWatch it when you are doing the dishes or mopping the floor. You would be spared the suffering I had to endure. \nOverall Rating - 2 out of 10\nLoy Machedo\nloymachedo.com | loymachedo.tv",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Second best of them all",
            "review_date": "2013-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is exciting, fast and thrilling; it rides hard on the action leaving little room for story depth just straight forward action with unbelievable acting by the leads and the movie did not have any of the other main cast from the first two movies, regardless this movie is just a wonderful action movie that we all should get the thrill of seeing.\nThis is one wonderful Die Hard addition, as our hero is paired with another great actor Samuel L. Jackson as McClane goes up against a vengeful terrorist, who is here for one reason payback as McClane took down his brother in the first Die Hard movie but payback was just part of the check list also making out with over 140 billion in gold from the Federal Reserve Bank of New York was also part of that list.\n \nThe movie starts with a big explosion, and unlike the first two McClane was in full control of what was going on, a twist from the previous 2 films and a welcome twist if I can say so myself. The second Die Hard movie (Die Hard 2: Die Harder) ended with McClane and Holly walking off happy, this starts with McClane all washed up from a split from his wife.\n\nThe movie plot is about a man who called himself Simon who goes about detonating bombs in New York. Simon now calls the police department and started a game of Simon says, and the pawns were John McClane (Bruce Willis) and Zeus (Samuel L.Jackson). Zeus came onboard the train ride when Simon asked McClane to go to a black neighborhood wearing a sign saying \"I Hate Niggers\". Zeus saved McClane, and Simon made him and McClane run around New York City trying to stop bombs, till McClane and Zeus got ahead of him and finally took him down with a \"Yippee kai yay, motherfu@#er\".\n\nThis movie is directed by John McTieman who directed the first movie and the movie is based on the characters created by Roderick Thorp, and Samuel L. Jackson was praised for his role in this movie as he was just wonderful playing Zeus Carver and the villain Simon, played by Jeremy Irons was not as grand as Alan Rickman who played Hans Gruber.\n\nLike Hans Gruber said in the first Die Hard (1988) movie, \"John Wayne doesn't always walk away into the sunset with Grace Kelly (with John McClane correcting him that it was Gary Cooper)\", so is this movie set. As our hero becomes more and more ingenious with how he saves the day, we are given some reality as McClane's life at home is going down the drain and in the end of this one his wife is not hugging and kissing him all over.\n\nDie Hard with a Vengeance cost 20 million more than the 2nd movie in the franchise and it made over a 100 million more than the previous Die Hard 2, making its total box office gross over 360 million (from a 90 million production cost). After this the producers waited over 12 years before they made another Die Hard movie, which was released in 2007 Live Free or Die Hard and a follow up six years later A Good Day to Die Hard (2013).\n\nI love this movie, and Simon says, \"Everyone should go see this\" because to me this movie was better than the second in the franchise.\n\nwww.lagsreviews.com",
            "review_date": "2013-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good and hilarious and for those who have not seen the third but saw the first surprise villain!",
            "review_date": "2013-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay, THIS is the best die hard movie. When I was about to see the first, THIS is what I was expecting. A lot better than the 1st, 2nd, 4th, and the 5th.",
            "review_date": "2013-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining John McClane opus even if it is slightly flawed. Decent action but the puzzles the villain gives are a little too much. Die Hard was a decent action series up until the lamer 4th one. The point of McClane was that he was an everyman and still somewhat macho so even though he was starting to face really impossible odds..it seems like this is more connected to the first one and that works out in its favor.",
            "review_date": "2013-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The second best die hard movie",
            "review_date": "2013-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Would've been perfect if the kills weren't cheap.",
            "review_date": "2013-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aside from the original this installment is the next best. Excellent action entertainment from beginning to end.",
            "review_date": "2013-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Redeemed the series from the weak Die Hard 2.  This third film is much more on par with the awesomeness of the first one while throwing Sam Jackson in the mix to create fantastic chemistry.",
            "review_date": "2013-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the closest Die Hard follow-up to the original in my opinion- it's unique, quirky and still an action film. Samuel L Jackson makes for a great sidekick (even though Willis is just as much of a sidekick in this one.) and Irons is a terrific bad guy. In some ways superior to Rickman in my view. The secondary bad guys (and girl) are really good in this one too- a big scary guy like in the first one and a vicious female character for good measure. The plot is decent with there being comedy, action and an interesting premise even though it does fall over itself somewhat as it goes on.\n\nIts an interesting action film and that's what Die Hard should be- it's not just about the action scenes (they are great in this one but there's maybe not enough of them) it's also about pushing the boundaries of the genre and taking it somewhere different- this one does a brilliant job of that- the most monotonous wild-goose chase imaginable with two leads whose eyes are saying \"I'm too old for this shit\" (Yes, I like Lethal Weapon too) and yet there's action, drama, intensity, comedy and strong character development all round too. It also does a remarkable job in creating the atmosphere of NYC with a particularly memorable opening scene- one of many extras that makes this film a classic.",
            "review_date": "2013-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really like the first half of this Die Hard which was actually a screenplay for a movie called 'Simon Says' and the real life New York location adds to the action. Second half feels bolt on. Willis and Jackson spar well off each other.",
            "review_date": "2013-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it was a bit overwhelming, a little pointless, and cheesy, Die Hard With a Vengeance improves over the 2 DH installment. Jackson and Willis still work fine, together or not, even if I have seen better from Jackson.",
            "review_date": "2013-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was the first Die Hard I saw on the big screen and it did blow me through the back of the theater. The Gruber family continues to make John McClane's life pretty miserable. First in an LA Skyscraper, then a DC Airport and now he is back on his home turf, New York City. This Gruber doesn't really want to confine McClane to one location, he wants John running all over the city, literally, chasing riddles. Many lives are at stake and once again there is only one man who dares to get the shit kicked out of him to save us all. Die Hard With A Vengeance is Action Flicking at it's best, completing the greatest Action Trilogy of all time.",
            "review_date": "2013-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Vengeance ditches the one man, one location formula of the franchise's first two installments in favor of a more sprawling story that can be convoluted at times, but is great fun nonetheless and never fails to keep you on the edge of your seat. Willis is as wry, profane and self-deprecating as ever in his most iconic role, and is matched wonderfully with Samuel L. Jackson as his forced-to-be partner in crime. Combined with a much more charismatic villain than round two, this third film is, in my opinion, the second best of the Die Hard series",
            "review_date": "2013-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This installment was probably the best in the series because it had an actual supporting cast to help Willis out.",
            "review_date": "2013-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most underrated Die Hard. Samuel L. Jackson is awesome as always",
            "review_date": "2013-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably my 2nd favorite Die Hard film, it was great to see Willis & Jackson team up once again, and it's the closet sequel thus far, to be anywhere close to the original film.",
            "review_date": "2013-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best one of the series, narrowly edging out the original and blowing the others away.",
            "review_date": "2013-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie put Samuel L. Jackson in the wrong place at the wrong time or rather for the story in the right place at the right time to become McClain's first partner in this wild action ride.",
            "review_date": "2013-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yippee Ki-Yay Motherfucker!",
            "review_date": "2013-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was good but not as great as the other two. B+",
            "review_date": "2013-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Here comes the best one of the franchise and to this day it hasn't been topped! This is a mad film directed by a master of action with a cast completely driven & having a blast. Yippikaye motherfuckers!",
            "review_date": "2013-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Getting ready for the 5th episode! :)",
            "review_date": "2013-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is back on par with the original.  The action is great, but the writing almost makes this more of a thriller than anything.  It actually feels like there's something at stake, and action flicks that do this are always a cut above the rest.  Willis is better than ever, the villain is excellent, and Sam Jackson always raises entertainment value.",
            "review_date": "2013-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I need to give this movie another watch, but as i remember, its my least favorite of the first four Die Hard movies.",
            "review_date": "2013-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everything adds up in this one ad results to a very suspenseful action flick. The only bad thing about this one is that the final scenes don't pack that much punch.",
            "review_date": "2013-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Undeniably crazy fun. Willis and L. Jackson makes a pretty great pair.",
            "review_date": "2013-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not to be racist but this one was good...but not AS good...",
            "review_date": "2013-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable and entertaining and always on the move with a frenetic style; playful t times and its one of the best renditions of John McClane.Suffers from a strange third act and a somewhat less than stellar Jeremy Irons.",
            "review_date": "2013-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film has Bruce Willis returning as John McClane and also starring Samuel L. Jackson and Jeremy Irons... That should be the end of the review right there (too... much... awesome). John McTiernan (director of the first Die Hard movie) returns to deliver a sequel that's grittier, darker and just as action packed as its predecessors. A lot of critics gave this movie crap but to be honest they were way too harsh because this film is incredibly underrated and completely worthy of its title. \"With a Vengeance\", has John McClane in a place in his life we haven't seen before; he's an alcoholic, left his wife and got suspended from the police force. McClane gets brought back into the fray by vicious terrorist bomber Simon (Jeremy Irons) who has a personal vendetta against McClane involving his past. So John, along with some help from a shop keeper named Zuess (Samuel L. Jackson), must stop more bombings from taking place while taking down Simon and his overall operation by playing a series of mind games throughout the streets of New York. Where the second installment (Die Hard 2) followed the structure of the original too closely while expanding in all of the wrong areas (using the same enclosed plot in an airport setting), \"Die Hard 3\" does the opposite; it changes the game entirely by making a completely different action movie. Making the grungy streets of New York the primary setting was smart because it adds that much more weight to the mounting tension the film tries to build while adding some new elements altogether (car chase scenes, public interactions and weather conditions). This movie works more as a crime based action/thriller with a constant ticking clock element present. The film doesn't waste any time throwing us head first into the action but it still spends the appropriate amount of scenes developing characters and showing us just how far the hero has fallen (McClane's addiction and home troubles). Simon (Jeremy Iron) is an excellent villain; he's cold, calculated, intelligent and always plays games with the hero and the audience's mind. He ranks overall second best next to Hanz Gruber (Alan Rickman) in the whole series and his relation to McClane's past adds an interesting overall dynamic to the story. Zuess (Samuel L. Jackson) is a great character who has good chemistry with the beat down McClane adding some more comedic chops and wit to the movie. However, \"With a Vengeance\" is not without its flaws; it's too long, focuses too heavily on racial/stereotype based humor and lacks a little bit of the charm the original will always carry with it. Though shot well enough, the action in the movie is mostly gun related and is missing a lot of the great hand-to-hand combat the other Die Hard flicks nailed perfectly. All in all, this is a completely acceptable sequel to a great action film series and anyone who's a fan of action or Die Hard should definitely see this one.",
            "review_date": "2013-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than the second one, feels a bit less mechanical, largely due to the presence of Sam Jackson.",
            "review_date": "2013-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Die Hard with a Vengeance\" was the first \"Die Hard\" I saw in the theater and it's my favorite of the sequels.  John McClane is back and this time he's not in the wrong place at the wrong time.  He's the right man, being targeted by a terorrist bomber named Simon(Jeremy Irons) who wants to play a game of simon says.  If McClane doesn't do as he says, then he will blow up anything from a subway to a school in New York.  McClane gets help from Zeus(Samuel L. Jackson) a guy who saves his life in Harlem, and they try to stop Simon and find out why he is doing all this.  John McTeirnan was the director of the first movie and this is the only sequel he came back for, probably why it's the best.  The action is phenomenal, the story is exciting, and Irons' Simon is the best of all the villains in the series, besides Hans Gruber.  There are some scenes that are very over the top, but this is probably the most grounded of the entire series.  Great movie, and if your looking for a roller coaster ride of a movie, then pop this bad boy back in.",
            "review_date": "2013-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Way better than the second film, but still has its faults. The movie is a great sequel that has a lot of tense moments that really have you at the edge of your seat, but unfortunately the pacing or introduction at times is done very strange. The bad guy isn't introduced until an hour in...we get to know next to nothing about his reluctant partner played by Samuel L Jackson. The movie ends satisfactory though it definitely could have been tightened a bit!",
            "review_date": "2013-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is so far my favorite Die Hard sequel. An extremely fun film. \nGRADE:A-",
            "review_date": "2013-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Die Hard With A Vengeance\" is John McClane (Bruce Willis) at his best. First and for most, like most action or superhero films, the villain is almost as important as the protagonist, in that there must be a charisma in that person that keeps the audience watching, acting as almost a focal point for the plot. Alan Rickman in the original \"Die Hard\" is almost unbeatable, in character and performance. But introducing Jeremy Irons into this third film is genius and he carries this role with a vigor lacking from the villains in \"Die Hard 2\". The supporting roles are much more fleshed out in \"Die Hard 3\", more so than any of the previous installments, helped mostly by the big name face of Samuel L. Jackson being apart of the entire film and almost initiating a sort of buddy cop film. Touching on issues of terrorism and racism tend to date this film, but being the first \"Die Hard\" to take place in New York, there is a uniqueness to this film that makes it better than the rest. Tack on a plot that keeps you guessing, splitting the film in different sections, with John playing \"Simon Says\", to John finding out the pivotal secret, to John chasing Simon (Irons) through tunnels. Everything about this film screams action and Bruce Willis produces some of his best work in this third appearance as McClane. \"Die Hard With a Vengeance\" proves to be my favorite \"Die Hard\" film yet.",
            "review_date": "2013-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die Hard With A Vengeance is about as good as a sequel to the iconic Die Hard movie could ever hope to be. This is an always funny and consistently engaging action thriller that is one of the best of its kind.",
            "review_date": "2013-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THE GOOD- The action starts instantaneously with a boutique getting blown to bits.  The initial set-up for this movie is fresh and exciting with McClane and his reluctant partner (Samuel L. Jackson) skowering the city for bombs.  The rapport between the two characters is classic stuff and adds to the movie greatly.  The plot moves in a progression, from searching for bombs, to a big heist, to following the bad guys and putting the kibosh on them.  This makes the movie constantly fresh as the movie never lags because of the constant developments.  The action sequences are excellent (the scene with the bomb in the subway).  Jeremy Irons hits it out of the park as Simon, a menancing, nuanced villian.\nTHE BAD- The last third of the film the realism sort of flies away.  One scene, McClane and Zeus (Jackson) fall a hundred feet from a bridge onto the deck of the boat and walk away from it. \nTHE DEAL- Despite the exaggerated sequences in the later parts of the film, it still works because the story is well layered and you want to see what happens next.  This is a great, classic action film.  Not only is this my favorite of the series (I used to watch this movie every day on VHS).  But this is one of my favorite movies of all-time.  Even if you are not as passionate about this film as I am, you will find it to be an at least 'good' action film worth watching.",
            "review_date": "2013-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This didn't get anything HARD for me.........If you, ya know.....catch my hostages?",
            "review_date": "2013-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very underrated; a funny, frantic and entertaining offering.",
            "review_date": "2013-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An interesting turn for the series. It felt different then the other Die Hard's and thats not bad. Only Bruce Willis returns from the other films so it feels slightly removed.",
            "review_date": "2013-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The second best in the series. The action fun, but not entirely remarkable. But the chemistry between characters is awesome, and certain scenes are just knockouts. The ending disappoints.",
            "review_date": "2013-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die Hard: With A Vengeance was originally meant to be more of the same taking place on a Caribbean cruise ship, but the idea was abandoned when Steven Seagal did that in \"Under Siege\". Two rejected screenplay later and the studio chose to make last minute changes to a screenplay. That screenplay was meant to be Lethal Weapon 4 and would have made sense since the buddy-cop dynamic has been established in that series, but as a sequel to Die Hard it mostly works adding a breath of fresh air for the formula.\n\nDie Hard: With A Vengeance has John McClane and a racist store owner force to play a bomber's deadly game as they race around New York while trying to stop him. It's slightly better than the second in some areas. The plot doesn't take place entirely in one area giving way to some unexpected events. The villain is much better with an intelligent plan that is far fetched, but mostly  makes logical sense. The buddy-cop dynamic allows for more humor, depth, and some room for the two too argue that's fun to see. It does unfortunately retain the over the top nature making you question the lack of logic. One instance includes McClane momentarily surfing on top of a truck in a tunnel that's being flooded. Moments like these take you out of the moment making you see it from your \"film snub\" (or critic) view point. Anyone who's not McClane and racist store owner Zeus are incompetent. Not just in poor police work, but we're also talking about basic human thinking. Like the worst security guard in action movie history repeatedly shooting a wall when he sees no one coming his way and his unintentional comedic death. Also seeing the villain execute his plan brings the pacing to a halt and the last minute twist in discovering the villain hideout is ridiculous. It retains some of the same problems, but offers something new to the formula.\n\nBruce Willis is once again excellent as John McClane. Though slightly less enjoyable since his character won't stop bringing up his headache. Samuel Jackson is good too playing an opposite character to that of Willis. When Willis and Jackson are on screen together give way to the film highlights. They have chemistry together and both clearly show they're having fun even with bickering with one another. Even when the pair are separated both manage to hold your attention. Jeremy Irons is an improvement as the film villain. He's as charming as he is twisted. The action scene in this sequel benefit from John McTiernan direction. Even with less gun fights, his brings plenty of energy whenever a fist fight, gun fight, and explosions occurred. However I do question John McTiernan decision to include a pointless sex scene just because he can. The editing could have shorten the film length some area. I felt there was certain parts that were unnecessary.\n\nDie Hard: With A Vengeance contains enough new ideas to succeed as a proper sequel and not simply rehashing the premise twice. The pairing of Willis and Jackson alone elevate the film from being a standard buddy-cop action film.",
            "review_date": "2013-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Plot became extremely ridiculous and formulaic, it really seemed like a rip off blockbuster now. However, you are still forced to watch it if want to continue along the rest of the franchise.",
            "review_date": "2013-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's the most fun-packed entry in the trilogy of films\nMcClaine is down in the dumps this time around with his suspension and marriage gone\na new foe of an old enemy from the past makes his way into the city and starts causing mayhem and destruction\nMcClaine has no choice but to team up with Carver to solve several riddles in order to prevent any more explosions putting civilians in danger\nWillis and Jackson are quite an ensemble on-screen duo constantly going at each other's throats while also trying to put aside their prejudice and indifferences\nthey still manage to get the job done\nJeremy Irons is a pretty suave and smooth adversary but doesn't quite hold a candle to Alan Rickman from the 1st movie\nthe action is dazzling, great chase scenes, gunfights and it is a serious race against time which makes it really heartpounding and suspenseful\nand of course other side characters are just simply side characters\nthe real excitement lies with the two leads",
            "review_date": "2013-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Filled with great action scenes and thrilling moments, Die Hard With a Vengeance is the best of its series so far.",
            "review_date": "2013-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely entertaining sequel with the awesome addition of Samuel L. Jackson as a sidekick and a great villain that harkens back to the original. If it weren't for the horrendously absurd tacked-on ending I could've rated it higher but seriously....what the hell happened in the final eight minutes?",
            "review_date": "2013-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "he didnt say Jesus, he said hey zues.",
            "review_date": "2013-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really enjoyed Die Hard 3 and ties for my favorite of the series. I like how we dont see the villian intill about 30 minutes into the movie and before that hes just a voice. I felt the race against time like these characters did and thought it was very entertaining. The action is top notch here, as usual.",
            "review_date": "2013-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the best sequel out of the die hard movies very fun  if it was not bad ending i would give it 5",
            "review_date": "2013-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "+: John McClane off course...\r\n-:  the end",
            "review_date": "2013-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think RottenTomatoes is broken. That would be the only reason that Die Hard 2 has a fresh rating and this doesn't. This movie is awesome.",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Looking back at the first two DIE HARD movies, you realize that John McClane's (Bruce Willis) adventures have expanded from the first movie's confined space of a high-rise building to the first sequel's larger space of an airport. In this third installment, creatively titled as DIE HARD WITH A VENGEANCE, the space is now widened to New York City. While the familiar sense of claustrophobic tension is getting lesser this time around, fans will be delighted that original DIE HARD director John McTiernan made an exceptional comeback to the franchise he first started back in 1988. The good news is, DIE HARD WITH A VENGEANCE is marginally better and more engaging than the slightly lackluster DIE HARD 2 (1990). But like DIE HARD 2, the overall execution isn't as tightly focused as the original movie.\n\nhttp://caseymoviemania.blogspot.com/2013/02/die-hard-with-vengeance-1995.html",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "John McTiernan returns to the Die Hard series with a vengeance, and directs this thrilling and action-packed third installment.  This time NYPD detective John McClane must play a deadly game of Simon Says with a terrorist who's threatened to detonate a series of bombs planted throughout New York City unless John completes a series of tasks.  Unfortunately, the story's overly complicated and falls apart in the last act.  Additionally, the villains are underdeveloped and don't feel organic to the plot.  Still, McTiernan does a great job at crafting dynamic and intense action sequences that grab the audience.  And the performances by Bruce Willis, Samuel L. Jackson, and Jeremy Irons are fairly strong.  A bit contrived and over plotted, Die Hard With a Vengeance doesn't live up to the previous films, but it still manages to deliver some exciting thrills and explosive action.",
            "review_date": "2013-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ALWAYS HAVE LOVED THESE BUT I DON'T LIKE THEM NO MORE...don't know why",
            "review_date": "2013-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This third entry into the Die Hard series not only blows the second film right out of the water, but also gives me the same feeling of entertainment that I had with the first film! While Die Hard With a Vengeance (aka Die Hard 3) is still not as good as the original, it comes pretty damn close! In John McClane's (Bruce Willis) latest adventure, a terrorist is placing highly concentrated bombs all over New York City. If the NYPD wants him to not set the bombs off, he demands that McClane do everything that he tells him in a game of \"Simon Says.\" During his first task, John is saved by Zeus (Samuel L. Jackson), an innocent civilian, from being attacked by a gang of people because of a controversial sign that he has to wear. Now, Zeus is caught up in this exciting action film as John's partner, and together they must work to stop the bomber before anymore innocent lives are lost. I really loved this great entry into this great series! Once again, Bruce Willis does an amazing job as John McClane. I've mentioned why in both of my early Die Hard reviews, so I'm going to move on to Samuel L. Jackson. The man not only plays John's partner very well but also creates very funny comic relief. Every time he opened his mouth, I was busting a gut! Plus, the two men had great chemistry together and pulled the film along quite nicely. I also enjoyed the main villain in this film. The way that he spoke slyly was very threatening and believable. Now, while I did love this film, there are flaws. They weren't big, but they were there. The issue that I had with the film is the way that it's written. There are points where I was able to predict some of the \"twists\" in the film. Fortunately, the writer had a few tricks up his sleeve and pulled some twists that I never saw coming, so it balances the whole thing out. Die Hard With a Vengeance is a great addition to the Die Hard films! It can be a bit predictable at times, but you'll completely forget about as you're sucked into this well done movie!",
            "review_date": "2013-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "why is this film not out in the uk on blu-ray ?????????????? the other 3 are ????????????? :(",
            "review_date": "2013-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yippee ki-yay mother f*cker",
            "review_date": "2013-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was a much better follow up of the original with of course great acts by Bruce Willis and Samuel L Jackson makes it that much better. Great action and better acting than Die Hard 2. Boy the Die Hard series is a classic masterpiece!",
            "review_date": "2013-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'lets make the movie again just so you can say yipee kiyae mother fucker at the way end.'",
            "review_date": "2013-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not as great as the first two, but still a worthy action film! the chemistry between Bruce and Samuel is really fun to watch!",
            "review_date": "2013-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a bit slow during the first half like the action was sleepwalking, but woke up after some clock-tickings. The third Die Hard is good as the first, better than the second, and the funniest. (A)\n\n(Full review coming soon)",
            "review_date": "2013-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Critics suck. This is the 2nd best Die Hard movie, behind the original.",
            "review_date": "2013-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only good part was Samuel L. Jackson",
            "review_date": "2013-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "no more help from Alan...",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like this one better than 2, but its not better than the first one or Live Free. Jeremy Irons does his best to be better than Rickman, but comes up short. Otherwise, more of the same: Explosions, gun fights, and McClane's famous arrogant attitude make this a fun film.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die Hard at its best.  Loved the addition of the \"Simon says\" tasks, which bring out a whole new dynamic between the 2 main characters.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Die Hard moves away from its previous formula, but back in '95 this is where a good time at the theater could be found. Really holds up. Great action film. The ending still feels abrupt though.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Improvement over \"Die Hard 2\", thanks to mixing up the formula & adding a sense of fun to the series, even if it peters out in the end.  McTierman direction is a nice return to form, and pairing McClane with Zeus (superbly played by the great Samuel L. Jackson) is a welcome change to the franchise.  Jeremy Irons is also a plus as a villain, bringing the right combination of menace & charm that you root for him even when you hate him.  The only downside is the story, which is excellent for the first two-thirds but ends rather anti-climatically (something the filmmakers themselves admit to).   Overall, still a fun ride and, to date, the best of the Die Hard sequels.",
            "review_date": "2013-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fast paced and breathtaking action, Die hard with a vengeance is the best die hard sequel after the original and Samuel L. Jackson is a great addition to the cast.",
            "review_date": "2013-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first three, even though it does have Sam Jackson.",
            "review_date": "2013-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Time to die hard again this time with vengeance as John McLain once again played by Bruce Willis but and once again delivers the fun and joy the series has brought to us it gives us action suspense and a new take on the series.",
            "review_date": "2013-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "to me the best ones in the series is this one and the first one. like that jeremy irons is the villian. have always likes jeremy irons. he is classy as always but with a creepy edge to him. great interaction between them.",
            "review_date": "2013-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting villain, dynamic characters, exploration of racial issues, riddles for the audience, and thought-provoking psychology. What more could you ask for from the third installment of an action series?",
            "review_date": "2013-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best one! Gotta love Bruce Willis in a vest!",
            "review_date": "2013-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love the bit when he rips into the boy for having a stutter...why don't you come over here and k k k k kill me :o)",
            "review_date": "2013-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "that wonderful blend of non-stop mindless violence an NYC. Its not Amadeus, but its not a Sandler film either.",
            "review_date": "2013-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The third \"Die Hard\" film is much better than the second and is my personal favorite of the series.  John McClane, now suspended from the NYPD, jumps back into action when a terrorist bomber requests his contact.  This film ties in with the first one and features a nice blend of great action scenes and even some comedy.  Samuel L. Jackson was the real standout performance for me.  This movie does a great job of getting rid of the bad taste from the previous sequel.  Fun and enjoyable, 4 stars.",
            "review_date": "2013-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb action thriller. Bruce Willis did an amazing job.",
            "review_date": "2013-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant - Great baddie & S.L.J is a great source of comedy",
            "review_date": "2013-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In spite of some truly great opening scenes, it eventually becomes tired, and frankly dumb. Shame really, cause it starts off brilliantly.........hate it when that happens....",
            "review_date": "2013-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The series just keeps getting better. Does not repeat the others but dares to be different and is better for it!",
            "review_date": "2013-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It dosent feel like a die hard movie but it is a good fun action movie.",
            "review_date": "2013-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An improvement over the weak Die Hard 2, plus Jeremy Irons as a good villain and a different game for Die Hard.",
            "review_date": "2013-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The weakest of the franchise, and it is not even close.  The plot is absolutely ridiculous, and for an action movie, the action is severly lacking.   In most \"Die Hard\"s John McClane takes down wave after wave of henchmen with guns or even his barehands.  For most of this movie, he is solving riddles or elementary school math problems.  I might be less harsh if it was another action movie, but it's not.  It has \"Die Hard\" in it's title and that means something.  The few positives are when the action is there it is good (ex. - elevator scene) and the pairing of Bruce and Samuel L. is pure poetry.  It's just a shame that their genius had to be wasted on this dud of a script.",
            "review_date": "2013-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "enjoyable, not as great and some real liberty taken with the \"god mode\" premise i've seen alot of, yet sam jackson makes it better and the story is good. action is good. its good.",
            "review_date": "2012-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "McTiernan is back with some great camerawork and there is some great editing. Direct references to the first two instalments are kept to a minimum in an excellent screenplay which amounts to Dirty Harry on steroids. Willis and Jackson are a great double act. Other than the reliance of virtually obsolete phone booths and a great shot of the twin towers the film looks like it could have been made yesterday rather than 18 years ago.",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw it but don't remember that much.",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great run around NYC!",
            "review_date": "2012-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked this film, but I can see why others didn't, but still a good action film.",
            "review_date": "2012-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is Die Hard's shining moment of fame. This is probably the best film out of the three original ones. Die Hard WIth A Vengeance is an action classic in my opinion and might be one of Bruce Willis's best movies. The main plot is that Gruber's Brother is planting bombs all over L.A. When McClane is called out of his suspension, he is asked by Simon Gruber to play a game of Simon Says with him leaving clues all over the city where the bombs are. When he tells him to wear a racist sign on him, he meets Zeus who owns a store and explains to him why he is doing this. Zeus saves him from Da hood and is partnered with him for the rest of the day trying to find Gruber. This is the definition of a buddy film. Bruce Willis and Samuel L Jackson are one of the best partners in film ever. Just put them together in a blender and you get perfection. The villain is one of the best. He is so sinister and threatening. Samuel L Jackson is the best thing in the whole entire movie with his amazing performence as Zeus. The action scenes are some of the best in the series with an explosive subway scene. Die Hard With A Vengeance is the best film in the whoe series.\n\n94/100 A-",
            "review_date": "2012-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still love it after all this time.",
            "review_date": "2012-12-25",
            "source": "rt",
            "lang": "en"
        }
    ]
}