{
    "rating": 8.7,
    "release_date": "1995-06-02",
    "num_reviews": 50,
    "genres": [
        "Romance",
        "Drama"
    ],
    "summary": "A moving love story about a photographer on assignment to shoot the historic bridges of Madison County. He meets a housewife, whose husband and children are away on a trip, and the film traces a brief affair that is never sordid but instead one of two soul mates who have met too late.",
    "reviews": [
        {
            "content": "Clint Eastwood's emotional classic is an example of sentimental filmmaking done right, and proves that an action director can make a slow and complex drama.",
            "review_date": "2023-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic, heartfelt and heartbreaking all at once.  I cried, and I never cry at a movie, but just this once.",
            "review_date": "2023-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "based on the best-selling book by Robert James Waller Clint Eastwood and Meryl Streep star as two people who begin a passionate affair when the movie starts her children are all grown-up and making peace with her recent passing going through her personal belongings both of them stumble upon her diary which she recorded everything about her encounter with the man since they met Robert Kincaid is a photographer working for National Geographic and Mrs. Francesca Johnson from Italy lives with her family in Iowa in the 1960's one day he's driving through her part of town and she decides to take a ride with him it's an unlikely connection the both of them never expected to have the children start to understand why she took this route and that deep down she always loved her family this film is very long and focuses on the entirety of the running time following these two and their day but their chemistry saves a lot from all its shortcomings not one I'll go back to anytime soon but Eastwood shows he can handle drama and complex human relationships",
            "review_date": "2023-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like all romantic movies they are slow, predictable, and the entire movie is dependent upon the chemistry between the two lead roles and their chemistry with one another to bring a believability to the love story. Safe to say this was a believable and enjoyable love story that is relatable to people of all sexes and ages.",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First up I did not read the book, but based on Rotten Tomato's high critical ratings I dove in to see two of my favorite actors. But I'll never get this time back: 1. I didn't see any story-telling value in making the wife Italian. 2. I realize people may quickly become infatuated with each other, but for the nomad photographer to invite this married Iowa farmwife to spend the rest of their lives - based on a couple of days - together was intellectually insulting. 3. On a small but irritating point, no man in 1965 was wearing his hair coiffed like Eastwood. 4. Most enjoyable for me was seeing the period-correct vehicles. A must-pass.",
            "review_date": "2022-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought it was a masterpiece and that Clint Eastwood was at his finest as actor/ producer in this picturesque and symbolic film about traditional family, respect, loyalty, love, passion-however fleeting, duty, restraint, decency, and humility. Meryl Streep was excellent, as usual.",
            "review_date": "2022-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Meryl streep is the most amazing actor of our time. she has never failed in a role. she dives into the characters unlike anyone I have ever seen. there were moments of this movie that I felt that Clints style of acting was old but somehow so classic. Meryl brought this movie home. it was poetic and gorgeous! Love this movie.",
            "review_date": "2022-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A thoroughly captivating and ultimately very moving romantic drama, \"The Bridges of Madison Country\" gives life to its doomed romance every step of the way. Meryl Streep, Clint Eastwood and the latter's direction are terrific, thus elevating the story to a tangible film full of small and grand moments of realism, from the cute, fun and exciting to the sad, despairing and heart-wrenching, while the present-day inserts offer great comic relief as well as on-point transgenerational insight.",
            "review_date": "2022-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film has a slow pace but I thought it was quite lovely. If your in the mood for a somewhat philosophical/mildly thought provoking weepy type sentimental watch then this is a good choice to go for.\n\nI remember hearing about it when I was much younger, in my teenage years I think and I was told not much happens in it and that its pretty boring. I can understand why some people would say so - in one sense I suppose not a great deal does happen but I like it in terms of the depiction of companionship, the way the two main characters naturally grow closer during the few days they have together. There are some nice pieces of dialogue and I did feel quite emotionally connected to Francesca Johnson (Meryl Streeps character). I thought it had a somewhat similar feel and pace to it as the recent film version of Our Souls At Night, which stars Robert Redford.\n\nThis film certainly won't appeal to all but I liked it as a bit of an easy and comforting watch and it'd take a strong person not to feel at least a little emotional at times, so I'd say its an effective film. Overall, yes, I would recommend this film.",
            "review_date": "2022-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My 2022 quest to see all films starring Meryl Streep continues.\n\nThe Bridges of Madison County is a lovely romantic drama that gently unveils the four-day relationship between a lonely Iowa housewife and a world traveling photographer that occurred in 1965.\n\nThe film opens in \"the present\" as siblings Michael and Carolyn Johnson arrive at their childhood farmhouse to settle the estate of their mother, Francesca (Streep).  They are puzzled when it is revealed that their mother has requested to be cremated and that her ashes be scattered at the nearby Roseman Bridge, rather than being buried next to her husband.  As the two begin going through their mother's belongings, they discover that she once had a very brief yet intensely meaningful affair with professional photographer Robert Kinkaid (Clint Eastwood).   As they begin reading the journals in which Francesca detailed her time with Kinkaid, the two children come to understand their mother in a more mature way as they also question the trajectories of their own lives and marriages.\n\nFrancesca is an Italian war-bride whose marriage was, at least partially, a means to relocate to the United States.  As the story unfolds it becomes obvious that small farm life in Iowa was not what her dream had been, but it was now her reality.  When her husband and two children head off to the State Fair, Francesca elects to stay home in order to have four days to herself.  Fate intervenes when photographer Kinkaid arrives in her driveway to ask her for directions.   He's visiting Madison County to photograph its covered bridges for National Geographic magazine.  Francesca offers to ride with him to help him find Roseman Bridge and the two strike up a conversation that leads to dinner as the two discover their mutual admiration for each other.  Neither has any intention of advancing things beyond friendship and discussion.\n\nStreep gives a reserved and authentic performance accompanied with her Italian-Americanized accent.  This role garnered Streep with one of the twenty-one acting Oscar nominations she has received.  She unveils the mundane despair that Francesca endures with a magnificent deftness.  Francesca's history is fully established through Streep's facial expressions and physicality.   Eastwood, who is the film's director, is sublime as the earnest and passionate Kinkaid, a character keen from his observations of life and the bigger world.  It's a wonderful departure from the gruff and angry characters he typically plays.  \n\nMy one complaint with the film is that the actors playing Francesca's adult children in the \"current day\" scenes are quite dreadful.  In fact, the first 15 minutes of the film set in current day is like watching a poorly directed and poorly acted junior high school production.  The staging is bizarre, and the dialogue is utterly contrived.  Then switch to the past and Streep and Eastwood somehow convert that junior high feel into a Broadway production.  The transitions are jarring because of the drastic contrast in acting skills between the two time-periods.  Thankfully, Streep and Eastman prevail… as does the film.  It's a touching tale, and one well worth experiencing.",
            "review_date": "2022-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Starring Clint Eastwood, it is a so romantic drama!!!!!!!!!!!!!",
            "review_date": "2022-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow what can I say. A love story filled with real passion.",
            "review_date": "2022-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit too cheesy for me to overly enjoy, but 'The Bridges of Madison County' is a sweet romantic drama.\n\nClint Eastwood and Meryl Streep are a strong pairing and produce very good performances, with Streep particularly standing out... even if her acting Italian doesn't always feel convincing, to me anyway. The parts of the story told via Annie Corley and Victor Slezak aren't the best, though the eventual pay-off with their characters is worthwhile.",
            "review_date": "2022-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Script, cinematography, everything in this film is perfect, for sure one of clint's best as a director. masterpiece.",
            "review_date": "2021-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sinfully good of great storytelling of one kind of fully wrong love but once in a lifetime. Clint Eastwood and Meryl Streep portrait memorable cinematic heartbreaking experiences.",
            "review_date": "2021-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Streep's an Italian lady that is in rural Iowa with a family and packed up dreams when Eastwood comes to photo some bridges.  Classic tale of romantic love vs. dutiful and faithful love.",
            "review_date": "2021-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfectly led by a unforgettable performance by Meryl Streep and magnificently directed by Clint Eastwood, the film transcends everything.",
            "review_date": "2021-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I tried to be strong, but I succumbed to this movie. Great directing, an amazing score, a powerful performance by Meryl Streep give this movie so much force. At first I thought this was just a case of horny middle age people wanting to get laid, but the first person narrator does a great job of making you understand how moving a situation can be.\n\n\nSad Clint Eastwood in the rain is a very powerul image",
            "review_date": "2021-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow touching movie. Very good!",
            "review_date": "2021-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not bad but it's really slow and not much happens. It's like watching a long, mostly casual conversation between two people who meet and just happen to take immediate interest in each other.",
            "review_date": "2020-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What would it profit a man to gain the whole world but lose his soul?\n\nOne line near the closing says it all ... do whatever it takes to be happy in this lifetime. What a sad commentary on this movie and the ethics of our day. We are created for so much more! We are created for eternity, love, faithfulness. Clint Eastwood and Meryl Streep do not lead us to happiness but to recommend ruin for our very Souls.\n\nThankfully, God offers forgiveness and healing... profound and eternal happiness, wonderfully expressed in Romans 8.",
            "review_date": "2020-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Streep lifts Eastwood's performance and he does not lessen hers. She's really the star and, as we all know and have known, she's always been the star.\nIt's Eastwood as a director that keeps this film believable. No matter how good or bad you think the film is or is supposed to be, it is believable at its foundation.",
            "review_date": "2020-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An unusual romantic drama that touches the viewer's heart. The performance by Meryl Streep transmits the passion, pain and hope that Francesca experienced. The story of this film is about love against common sense, and it moves us.",
            "review_date": "2020-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The performances make the film just a bit better than the boring script.",
            "review_date": "2020-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "based on the best-selling book by Robert James Waller Clint Eastwood and Meryl Streep star as two people who begin a passionate affair when the movie starts her children are all grown-up and making peace with her recent passing going through her personal belongingsboth of them stumble upon her diary which she recorded everything about her encounter with the man since they met\nRobert Kincaid is a photographer working for National Geographic and Mrs. Francesca Johnson from Italy lives with her family in Iowa in the 1960's\none day he's driving through her part of town and she decides to take a ride with him\nit's an unlikely connection the both of them never expected to have the children start to understand why she took this route and that deep down she always loved her family\nthis film is very long and focuses on the entirety of the running time following these two and their day but their chemistry saves a lot from all its shortcomings\nnot one I'll go back to anytime soon but Eastwood shows he can handle drama and complex human relationships",
            "review_date": "2020-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Breaks my heart beautiful film",
            "review_date": "2020-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slower than molasses running off a bridge in Madison County. Can we get thru one movie without Streep sounding out of place with a forced accent. I must be from another planet. Brutal.",
            "review_date": "2020-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Streep plays lonely, unsatisfied housewife ready to throw herself at the first man she sees. Kincaid conveniently manages to get lost outside of her home to become that man. Streep's character is irritating, and her Italian accent is laughably bad. We are expected to believe that these two are \"soulmates\" after only a few days, but there is no chemistry between the two and the relationship feels very much forced. I can't buy into this cheesy fantasy, and can't understand how this movie was ever esteemed by anyone. This film is far from fresh.",
            "review_date": "2020-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the great romance movies with two amazing actors. The scene in the rain, gets me everytime.",
            "review_date": "2019-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cliched, unconvincing, and slow.  There were no surprises here, and the diary/flashback mechanism was awkward and unwieldy.  These faults lie with the schmaltzy source material. ",
            "review_date": "2019-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good rating because of her self-control.",
            "review_date": "2019-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best romance movie ever made! With the best movie song ever sung: I See Your Face Before Me!",
            "review_date": "2019-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great romantic movie and a turn for Clint Eastwood who is anything but soft and genteel in most of his roles. I think The Bridges of Madison County is the best romantic film ever made. However, In Waller's book, Francesca is much more vulnerable and much more delicate, plus she's thoughtful and gentle. But in the film, Meryl Streep's version is so different from the book. Meryl plays a very tough woman and looks like a real farmer's wife,it works beautifully though! This film is definitely your best choice if you are fond of romantic love story. I am not a big romantic but I can understand a great movie when I see one.",
            "review_date": "2018-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this electrifying tale..\n\nThe Bridges Of Madison County\n\nThe Bridges Of Madison County is a character driven romantic drama about a strange and unique friendship that takes place within four days. \n\nThe chemistry between the lead cast is the primary reason why there is such pulsating energy emitting from this electrifying tale. The crisp and the uneasiness is bred, without any flirty talks and the way it surfs around the edgy with a shady note, is stupendously breathtaking. The attraction depicted in here plays a vital role and the makers being aware of the strength of the cast, milks it out from them that lures the viewers in, in its innocent bubble. The background score is mesmerizing, the cinematography is pure magic with fine editing and well detailed camera work. \n\nContrary to premise where it suggests it has a limited span to be spent upon, the feature is maturely calm and soothing where eschewing their characters appropriately, the actors cast in their spells in a subtle tone. The narration is adaptive, elaborative and exquisite with gripping screenplay and pragmatic conversations. \n\nSculpted to communicate for subsequent generation, the tale speaks volume metaphorically in those calm silent pitches that is harrowing and heartwarming at the same time. Streep is a revelation in her convoluted and unsure portrayal that is probably one of her best and underrated performance and on the other hand Eastwood is poised and reserved, supporting her thoroughly in each aspect.\n\nLaGravanese's exquisite adaptation gets better execution than anticipated from Eastwood's deck and is probably his finest act. The poem that flows fluently across the entire feature, a stunningly beautiful tale and stellar performances at the heart of it are the high points of the feature. \n\nThe Bridges Of Madison County is a rare art where its poignancy is naturally cathartic for its innocence foliated through chivalrous allegory.",
            "review_date": "2018-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a quite a slow and sombre film but it was incredibly directed by Eastwood. The film has that old stylish storytelling that is lacking in modern filmmaking, it is heart wrenching even though at its core is an over the top plot. This is one of those times you must go with the plot and not pick it apart, there are holes but at its centre is two master actors at the height of there careers. I thought this was going to be a boring love piece and avoided it for this reason but I must say it is an adult focused film that is incredible. If you are lacking the adult focused drama that the 80s and 90s was quite excellent at producing, this is one of those films that you need to see. Eastwood as both the star and filmmaker exceeds, but Streep is the anchor of the film. 08/09/2018.",
            "review_date": "2018-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have to give this movie real credit for making me care about it's characters. It's hard to see Clint Eastwood as being anything other than, well Clint Eastwood but  he pulls it off here well enough for us to suspend our disbelief. Meryl Streep is perfect in her role and the Chemistry between the pair,  whilst not sizzling, bubbles well enough for us to happily go with it. A cracking romantic drama.",
            "review_date": "2018-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting movie to watch. Eastwood and Streep's performances are undeniably great. Very sentimental.",
            "review_date": "2017-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this for the first time today, and funnily enough (without looking at Rotten Tomatoes), the first thing I said was that the film was slow and full of schmaltz.  It was certainly a powerful film, but I felt like that every scene was so full of emotion and unspoken drama that it got a little tiring towards the end.  Nonetheless, Meryl Streep impresses as always by losing herself in her role, and Clint Eastwood is able to hold his own opposite her.  The tragedy of unrealized dreams is also easily relatable.  The film is a good choice if you're in the mood for a dramatic love story (and perhaps a good cry).",
            "review_date": "2017-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of my fav romantic movies",
            "review_date": "2017-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much more straightforward romance than I was hoping for.",
            "review_date": "2017-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think the story is a bit boring and slow moving. I also don't like that it seems to condone infidelity. However, Meryl Streep is charming.",
            "review_date": "2016-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie that really gives you a different perspective on the perception of love . Thoroughly enjoyed the movie and the message it was purveying.",
            "review_date": "2016-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderfully engaging scrip. A level performances. Might prefer a tighter version.",
            "review_date": "2016-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "82%\nSaw this on 03/7/16\nThe Bridges of Madison County has one of the most underappreciated performances from Clint Eastwood. This is one amongst the finest Eastwood performances, though the same cannot the said about the film. The film is lumbering, lethargic and the romance is at times so tedious that I felt it can only satsify the most ardent romantics. Meryl Streep also gives a good performance, in fact this is one of the very few starring roles of the actress that I've seen. To my surprise the film was really satisfying in the end with potent sentimentality, not maipulative melodrama.",
            "review_date": "2016-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I preferred the earlier Dirty Harry films.",
            "review_date": "2016-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "@jim Carter it's one of the bloody best movie",
            "review_date": "2015-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What makes \"The Bridges of Madison County\" so romantic is its pulsating desire, slow like honey and sultry summertime heat.  Famously, the film is considered to be better than its source material - whereas Robert James Waller's novel of the same name is said to contain passages schmaltzier than your favorite Hallmark channel TV-movie, Clint Eastwood's 1995 adaptation converts syrup into lush longing.  It is about two people who find a love rare and certain but choose not to go through with a relationship due to responsibility and circumstance; we feel their burning for one another ripple throughout our bodies, affecting us at every turn.  Most romantic melodramas choose to go the happy ending/tragedy route; \"The Bridges of Madison County\" is such a successful foray into a genre because it places painful reality into a sublime mixture of cinematic tenderness.  \n\tMost are still familiar with the story twenty years after its introduction: it frames the four-day love affair between Italian housewife Francesca Johnson (Meryl Streep, who completely disappears into the role) and National Geographic photographer Robert Kincaid (Eastwood), who accidentally fall into each other's lives after Robert innocently stops at Francesca's house for directions to the nearby Bridges of Madison County.  What begins as an exchange of manners turns into something more after she decides to follow him along on his photography excursion instead of politely moving on.\n\tFour days is a short time for anyone to fall head over heels in love, but Francesca and Robert have an uncommon connection - it only takes a few late night talks for them to discover that they were made for each other.  But, alas, she is happily married, with two teenage kids; her husband, a working man, is kind to her, fond of her company.  Her children need her more than ever.  But for Francesca, who moved from Italy to Iowa because of the union, there is something left to be desired - and Robert fulfills everything her spouse cannot.  He is considerate of her emotions, aware of her hidden talents.  He sees her as a remarkable woman rather than a dutiful housewife.  The climactic sight of her clutching her husband's truck door, contemplating whether to jump out and run after Robert, is devastating - to stay is painful, but to leave would be a tidal wave of brutal catharsis.  \n\tThe entire romance is told through flashback - as \"The Bridges of Madison County\" opens, the children of the now deceased Francesca are brought to her Iowan home to look over her will, discovering the affair after finding a trio of journals that chronicles those meaningful four days.  This narrative device would be manipulative anywhere else, but in Eastwood's no-nonsense hands, it makes the story all the more poignant.  Now adults with marital troubles of their own, Francesca's children are old enough to understand just how sacred romance is - and how much of a generous tragedy it was for their mother to give up the passion of a lifetime for them.\n\tWith Eastwood at the helm, \"The Bridges of Madison County\" teeters on the sappy, but, for the most part, remains a plausible tale of love for the ages.  His use of a minimal soundtrack evokes the atmospheric, dripping nature of the erotic tension that vibrates between Robert and Francesca; his pauses to study the silent emotions of the leading characters gives us a chance to become them, to potentially see life through their eyes.  Richard LaGravenese's script is considerate, thoughtful; he gives the central figures room to breathe, to consider every possible outcome.  Waller's maudlin prose (not read by me) is completely washed away.  LaGravenese's linguistic maneuvers are incredibly deliberate.\n\tBut while \"The Bridges of Madison County\" is a distinguished romance film, there is something too faraway, too dreamy for it to be anything besides a weepy tale of splendor in the grass.  It feels so personal that it doesn't have much meaning for anyone other than Robert, Francesca, or Francesca's children.  It doesn't seem real, rather sweepingly cinematic.  It's a tragic fantasy.  But it is prosperous when it comes to presenting us with genuine emotion, and Streep's performance is uniformly excellent.  Perhaps I didn't attach to it as much as I would like to because I'm not the intended audience - but that hardly matters.  Here is a romance so refreshingly honest one hardly has time to consider its bathos.",
            "review_date": "2015-08-30",
            "source": "rt",
            "lang": "en"
        }
    ]
}