{
  "title": "Jaws 3-D",
  "rating": 5.0,
  "release_date": "1983-07-22",
  "genre": [
    "Adventure",
    "Thriller",
    "Horror"
  ],
  "summary": "The sons of police chief Brody must protect civilians at a SeaWorld theme park after a 35-foot shark becomes trapped in the park with them.",
  "critic_reviews": [
    "It's harmless but unsurprising...Without Steven Spielberg's timing or John Williams's music, the shark's periodic visits become feeding scenes rather than ferocious attacks. It's like watching someone make regular raids on a refrigerator in search of midnight snacks.",
    "Although shot well and boasting some effective 3-D work, this is a woefully inadequate effort, and the series began to slip into inadvertent self-parody.",
    "The Jaws cycle has reached its nadir with this surprisingly tepid [Arrivision] 3-D version.",
    "A toothless, tedious farce which deserves to sink without a trace.",
    "A right royal turkey."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "“Facepalms”Okay, What the hell is this?, With terrible visuals (Even for the 80’s), and ridiculously stupid writing, Jaws 3-D is a film that should be avoided like a Shark.",
      "review_date": "2019-12-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nJaws 3-D is horrible. The most fake shark is in this film, dull and lame characters, but worst of all, they try 3-D effects and in theaters, there were no 3-D glasses for the film! It is so boring and is the first bad Jaws movie.",
      "review_date": "2017-10-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nJaws 3 is A movie where A Shark goes loose in SeaWorld Which to me had a good concept but the movie was not so good The scenes where something is moving slowly is horrible it's absolutely the worst Jaws 3 In this shark is not so good It hisses sometimes IDK what they were thinking about that And the Characters are just boring the only character I kinda like Calvin as a character where is the owner all round very funny movie u can watch to pass your time All round I give Jaws 3 An D",
      "review_date": "2021-03-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A completely needless sequel, if the shark doesn't scare you then the laughably bad special effects will. Jaws:The Revenge gets alot of flack but Jaws 3 is just as bad if not worse when it comes to being a bad sequel. It's an awful movie",
      "review_date": "2019-06-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Jaws 3-D proves how unnecessary is a third sequel added to Spielberg's work; from its awful cast, inept direction, sorry visual-effects and truly disappointing conclusion.",
      "review_date": "2017-09-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis movie, without a doubt, tried to rely more on star-power and less on story-line. The 3D (which was \"in\" at the time) was a bad idea too because the technology just didn't hit the way it does now.I dunno, it seemed like they should have waited and done it 20 years later because the timing also was bad considering the competition and the movies that were coming in 1984 (like Ghostbusters) just killed the very little chance this movie might have had.The story seems to pick up about 15 years after Jaws 2's timeline. There is very little mention of the past events and i don't even remember Roy Scheider's character even being mentioned (although his death was referenced in Jaws 4) in this movie any more than a passing thought.The entrance of the sharks was so......convenient? And they seemed to be following the play-book to the absolute letter (at the start) then they just bring the sharks (baby then mother) out into the open.The only real memory, from seeing that movie, was going \"Hey, it's the guy from 'Manimal'!\" (Simon MacCorkindale) who, if you weren't a kid growing up in the 70-80s, you would have almost no reference to understand who he was. The animation (from this age) was laughable but, back then, it was passable.Let's sum it up: The story was just terrible, the structure changed too much and too fast, and some the characters were (in that era) at the top of their game.The movie is \"watchable\" (like background or \"i'm too stoned to get off the couch so i'll watch this\") but not something you would (probably) waste time to see twice.",
      "review_date": "2019-12-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Jaws 3 is still scary but has bad acting. Jaws 3 is much more different and way more boring it's an awful movie but still kinda scary so that's a plus.",
      "review_date": "2017-09-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Jaws 3D is completely unneeded and makes very little sense from a story point of view but had its moments of fun and excitement. The visuals even for its time were horrible the cast was underwhelming. Don't expect to much from this one.",
      "review_date": "2017-12-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "After a young great white shark finds its way into a sea-themed park managed by Calvin Bouchard (Louis Gossett Jr.), workers try to capture it. But the facility's attempt to keep the shark in captivity has dire consequences: A much largerAfter a young great white shark finds its way into a sea-themed park managed by Calvin Bouchard (Louis Gossett Jr.), workers try to capture it. But the facility's attempt to keep the shark in captivity has dire consequences: A much larger mother shark appears in search of its offspring. Among those who must battle the angry aquatic killing machine are marine biologist Kathryn Morgan (Bess Armstrong), her co-worker Mike Brody (Dennis Quaid) and a pair of friendly dolphins. Final Grade is an F.",
      "review_date": "2018-06-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I gotta admit, this movie does look good on paper but how it’s executed into this film is garbage.",
      "review_date": "2018-05-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Never saw Jaws 3-D but I've seen Jaws 3 which is exactly the same film apart from this 3-D nonsense so I'll review Jaws 3 and give you my own personal opinion about the second sequel to the 1975 brilliant original.... The second Jaws movieNever saw Jaws 3-D but I've seen Jaws 3 which is exactly the same film apart from this 3-D nonsense so I'll review Jaws 3 and give you my own personal opinion about the second sequel to the 1975 brilliant original.... The second Jaws movie and first sequel had a great ending with the shark being electrocuted or something was okay but sucked compared to the 1975 original which was faultless besides the ending which was daft..... JAWS 3 however has none of the original characters like Chief Brody from the first two movies but has Dennis Quaid (The Parent Trap)and a bunch of other crap actors. The shark looks fat, fake and pretty hilarious to say the least and if it were a shark who could operate on land instead of in the water I could easily outrun it because it's slower than a snail. All of the characters are unlikeable except Quaid who I like. There is blood and a few deaths and it's done well and the scene where the shark breaks the glass panel underwater and it shatters and makes the humans have to swim for their life is good. Besides that I'd say Jaws 3 is one of the worst movies I've ever seen but better than Jaws 2.",
      "review_date": "2020-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Yeah... not good. I don't dislike 'Jaws 3-D' as much as most evidently do, though.Dennis Quaid and Bess Armstrong are actually pleasant in terms of the cast, none of those behind them are anything worth noting but are somewhat serviceable.Yeah... not good. I don't dislike 'Jaws 3-D' as much as most evidently do, though.Dennis Quaid and Bess Armstrong are actually pleasant in terms of the cast, none of those behind them are anything worth noting but are somewhat serviceable. I will say I didn't enjoy the plot, but only because it lacked something worth watching - it's poor, not terrible. More of the shark was wanted, but I would personally say that about the preceding two films as well.Parts of this 1983 flick that are terrible, though, are the special effects, especially right at the end. There is also some poorly done green screen and it, clearly, has a dire cover. There's no doubting this being made was a cash grab, that's basically the only reason to ever go 3-D, but a cash grab doesn't necessarily mean it's an awful film; which this isn't, in my opinion. It's simply bad. The cover is hilariously awful though, granted.",
      "review_date": "2022-02-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "this movie is a big disgrace to the first 2 jaws! which are okay movies! but this movie was overrated!",
      "review_date": "2021-03-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is not a good film. If I hadn’t had the cinema experience in 3D VR then I wouldn’t have enjoyed this. The characters are very forgettable, the effects (especially the underwater viewing tunnels) are weak but the biggest issue is thatThis is not a good film. If I hadn’t had the cinema experience in 3D VR then I wouldn’t have enjoyed this. The characters are very forgettable, the effects (especially the underwater viewing tunnels) are weak but the biggest issue is that there isn’t much sense of scale. The shark doesn’t seem that big at all because there is not attempt, apart from a moment near the end with a person in the shark’s mouth, to really show the size of the shark in relation to anything relatable. There aren’t many deaths. The in-you-face 3D moments are not very well done. The only positive was that it wasn’t too boring, just about enough happened to hold my attention. Hated the casual drink-driving!",
      "review_date": "2022-02-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is the movie since morbius came out. This gooooooooooooooooooooooooooooooooooooooooooooood",
      "review_date": "2022-09-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nJaws 3-D was just not a good movie.  The plot was pointless, there was no continuity, the music did not match the scenes in the movie and this all in all was just a large SeaWorld advertisement.  However, this was better than the subsequent “Jaws: The Revenge.”  Here’s why: The acting was much better, at least provided the bad scripts the actors were provided with.  Dennis Quaid, Lea Thompson, and the other actors did a good job in acting.  The 3-D graphics did not always look good, but with the technology Universal had in 1983, I can tell they tried.  Not a good movie, but not a terrible one either.",
      "review_date": "2022-10-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This Movie is laughably bad. Its full of Wisconsin level of cheese, and very bad 3D and CGI.",
      "review_date": "2022-12-26",
      "source": "metacritic"
    }
  ],
  "num_reviews": 22
}