{
  "title": "Star Wars: Episode VI - Return of the Jedi",
  "rating": 8.4,
  "release_date": "1983-05-25",
  "summary": "The Millennnium Falcon flashes through hyperspace and creatures from all over the galaxy defy the Galactic Empire. After rescuing Han Solo (Harrison Ford) and Leia (Carrie Fisher) from certain doom at the hands of crime lord Jabba the Hutt, Luke (Mark Hamill) rejoins Yoda. Only by completing his Jedi training can he become a true JediThe Millennnium Falcon flashes through hyperspace and creatures from all over the galaxy defy the Galactic Empire. After rescuing Han Solo (Harrison Ford) and Leia (Carrie Fisher) from certain doom at the hands of crime lord Jabba the Hutt, Luke (Mark Hamill) rejoins Yoda. Only by completing his Jedi training can he become a true Jedi Knight and defeat Darth Vader and the dark side of the Force.… Expand",
  "critic_reviews": [
    "Among the ties with the past, the opening portion introduces a comic orgy that is deliberate parallel cantina scene in “Star Wars” and among the new thrills there is an airborne vehicle chase through a forest, projected at a speed to leave audiences dizzy.",
    "'Return of the Jedi' is fun, magnificent fun. The movie is a complete entertainment, a feast for the eyes and a delight for the fancy. It's a little amazing how Lucas and his associates keep topping themselves.",
    "But with 'Jedi,' listen to the creaking, huge metal door that opens and leads the androids C-3PO and R2-D2 to the cave of Jabba the Hutt, where, at the beginning of the film, good-guy space pilot Han Solo is frozen in a carbonite mold like some kind of nouvelle cuisine side dish. It will remind old-time radio listeners of the creaking door of the 'Inner Sanctum' show, and it serves the same purpose. Both are doorways to adventure...And before this portion of the 'Star Wars' saga is history, let us take time to praise the principal performers.",
    "The Jedi return to us at last, older, wiser and frankly irresistible. Of all its many qualities, Return of the Jedi is fully satisfying, it gives honest value to all the hopes of its believers. With this last of the central \"Star Wars\" cycle, there is the sense of the closing of a circle, of leaving behind real friends. It is accomplished with a weight and a new maturity that seem entirely fitting, yet the movie has lost none of its sense of fun; it bursts with new inventiveness. With Jedi, George Lucas may have pulled off the first triple crown of motion pictures.",
    "Best of all, a revisit with Jedi makes a viewer appreciate spectacle, presentation, mythology -- that, and the power of a bitchin' helmet to speak volumes in a language even an alien can understand. [Special Edition]",
    "The most disappointing of the original three episodes but still charming and thrilling.",
    "It is not as exciting as Star Wars itself, which had the advantage of novelty. But it is better and more satisfying than The Empire Strikes Back, which suffered from a hectic, muddled pace, together with the classic problems of being the second act in a three-act play.",
    "Less original than the first \"Star Wars\" and less resonant than \"The Empire Strikes Back,\" but packed with fast-paced action and downright cuddly Ewoks.",
    "Cuteness is the watchword here. The dark, eerie atmosphere that oozed from every frame of \"The Empire Strikes Back\" is gone. Instead, for Return of the Jedi, we have good triumphing decisively over evil, a too-pat resolution to a love triangle, and walking teddy bears.",
    "A potent reminder that these characters and the actors who brought them to life will never return again. Seeing the very end of an endlessly hyped trilogy somehow puts a lump in the throat. [Special Edition]",
    "Even more than its predecessors in the \"Star Wars\" series, Return of the Jedi is about incredible special effects and astonishingly effective costumes and makeup. The characters and dialogue get lost somewhere between the bug-eyed monsters and the exploding spaceships, but it is all so much fun it probably really does not matter a whole lot.",
    "The dialogue is repetitive (\"I won't give in to the dark side of the Force!\" \"You will!\") and significant characters from earlier films -- notably bounty hunter Boba Fett and Yoda -- are dispatched without fanfare, and the whole business has a slightly rushed, perfunctory feel at the same time that it feels oddly attenuated.",
    "Brings things to an almost cheesy conclusion. Given the gripping, dark elements that creator George Lucas introduced in the two previous films, the third movie’s outcome smacks of PG-rated populism rather than artistic fulfillment. But the experience is still highly entertaining. [Special Edition]",
    "All the parts of Return that deal with Luke's faith in his father and his appeals for him to reject the dark side of The Force are very emotional. In fact, the best sections of Return are extensions of the melancholy implications of \"The Empire Strikes Back.\" [Special Edition]",
    "Ultimately, Jedi even backs off some of the more tantalizing possibilities suggested by the cliffhanging scenario of \"Empire.\" This inhibition appears to grow out of consideration for the feelings of the juvenile audience, which can enjoy an abundance of thrills and close calls while resting assured that nothing catastrophic is going to be fall the heroes.",
    "Hamill is not enough of a dramatic actor to carry the plot load here, especially when his partner in so many scenes is really little more than an oversized gas pump, even if splendidly voiced by James Earl Jones.",
    "Unfortunately, the problems with Jedi cannot be fixed even with the best digital software in the galaxy: the weak story (another death star assault, another visit to Dagobah, the exotic planet of the trees, annoying teddy bears), the bad performances..., the burp jokes (three in the first half hour--I guess I missed the toilet humor in the first two) and Luke's bizarre-looking hair mop. It's sad. [Special Edition]",
    "Unfortunately, it conveys the sense that the machinery has already started to wear down, and the inventiveness to wear thin. To be sure, the film abounds in action. Some new peril besets Luke Skywalker, Han Solo or the Princess Leia almost too regularly every 10 minutes. But there's a kind of desperation about it, a feeling that Lucas and co-writer Lawrence Kasdan are simply trying to figure out what they can do next to amuse the kiddies. The stuff of legend that inspired and elevated the earlier episodes has here been replaced largely by the stuff of comic books.",
    "While a certain amount of drama is found in these revealing scenes, it is somewhat dis­sipated in the romantic relations between Leia and Solo....The dialogue given to the lovers is laughable, and their performances match it. So what is presumably intended as a great romantic finale comes to little, which might equally be said of the film as a whole....The appeal, perhaps, will be strongest to the young.",
    "Return of the Jedi doesn't really end the trilogy as much as it brings it to a dead stop. The film...is by far the dimmest adventure of the lot.",
    "There is hardly any point in discussing the direction of a picture like this, in which almost every shot has been predetermined by the requirements of the special effects, yet director Richard Marquand fluffs the two or three real opportunities he has, rendering the long-delayed character climaxes with a chilly indifference."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Yes, the movie is filmed as if it was filming a family recreation. Its choppy and messy, but what it doesn't fail is delivering the epic conclusion of the long space opera franchise to the audience.",
      "review_date": "2011-09-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The best of the series (and an amazing series it is). This is the quintessential sci-fi/fantasy movie. I love everything about it. It's easily in my top 5 movies of all time.",
      "review_date": "2011-09-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In comparison, it is nowhere near the quality of the previous installments (despite what many fanboys would have you believe) but Return of the Jedi still stands up on its own and doesn't have to rely on the original two to be considered aIn comparison, it is nowhere near the quality of the previous installments (despite what many fanboys would have you believe) but Return of the Jedi still stands up on its own and doesn't have to rely on the original two to be considered a great film. If I had a more flexible rating scale to use, I would give an 8.5/10, but anything more would and I would be lying to myself.",
      "review_date": "2012-01-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie's metascore is the the same as Episodes I and II and is below Episode III. Something is seriously wrong here! Probably the most underrated movie in the Star Wars saga.",
      "review_date": "2015-08-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I don't care whatever you have to say about Return Of The Jedi, it is awesome. It provides an unforgettable ending to a stellar franchise. It is smart, funny, action packed, and reveals everything the trilogy had to offer. Don't get me wrong,I don't care whatever you have to say about Return Of The Jedi, it is awesome. It provides an unforgettable ending to a stellar franchise. It is smart, funny, action packed, and reveals everything the trilogy had to offer. Don't get me wrong, A New Hope and The Empire Strikes Back are WAY ahead of Return of The Jedi. Still. it is an awesome movie.",
      "review_date": "2015-05-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Ewok scenes were stupid. But Return of the Jedi is still a good film, and a satisfying end to the trilogy. I was a little disappointed with some of the plot devices used, but seeing Vader throw the Emperor down into the Death Star's coreThe Ewok scenes were stupid. But Return of the Jedi is still a good film, and a satisfying end to the trilogy. I was a little disappointed with some of the plot devices used, but seeing Vader throw the Emperor down into the Death Star's core still gets me every time. 8/10",
      "review_date": "2010-08-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A great way to say goodbye to the series, while it wasn't as believable as the others, or as enjoyable, it's still a great movie, if your a fan of the previous movies you'll like this.",
      "review_date": "2011-03-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Shockingly seen by many as the weakest entry in the original trilogy, Return of the Jedi was easily my favorite one. Featuring far and away the most interesting story, Return of the Jedi is a blast that manages to make the two hours fly by atShockingly seen by many as the weakest entry in the original trilogy, Return of the Jedi was easily my favorite one. Featuring far and away the most interesting story, Return of the Jedi is a blast that manages to make the two hours fly by at record speed. The acting is quite good for the most part (minus some minor slip ups), the story is phenomenal (religious undertones anyone?), and the special effects are top-notch. There was much criticism thrown towards the Ewoks, but I loved them. Not only are they adorable, but they were good characters. In addition, the showdown between Darth Vader and Luke Skywalker, as well as that between the Emperor and Skywalker was riveting and really well done. The characters in this one continue to show incredible depth and really feel as though they are authentic humans. While Empire Strikes Back is also a very good film, the sufferings of being the middle film held it back from greatness. That problem does not exist in Return of the Jedi as not only does it end quite satisfactorily, but it does so after two hours of pure adrenaline and enjoyment. Well written, well directed, and all around well put together, Return of the Jedi is the strongest entry in the original trilogy.",
      "review_date": "2015-06-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Star Wars franchise 'end' in one of the most uniquely way ever seen in movie history.\r As expected; 'Star Wars: Return of The Jedi' continues where 'The Empire Strikes Back ended'. It starts with the same high-paced and highlyThe Star Wars franchise 'end' in one of the most uniquely way ever seen in movie history.\r As expected; 'Star Wars: Return of The Jedi' continues where 'The Empire Strikes Back ended'. It starts with the same high-paced and highly entertaining plot as what the fifth entry had. The opening scene and its first 30 minutes are actually the best in the whole franchise. It continues with the fun and nuanced characters and the beloved chemistry we all have fallen in love with. Surely; it's no 'Empire Strikes Back', but it still stands out as a great film! It might be less inventive with a somewhat similar plot as episode four, and much less chemistry between characters. But it's still very good! We see Luke develop, changing to the better, having to choose from the better good or loose to the hate. A wonderful character arc! There's so much emotion to the movie too, not to mention depth and power to the plot! But as previously mentioned; it's not as stunning to the eye as the previous movie, not as flawless or powerful neither. But it still stands on its own as an entertaining and somewhat characteristic movie. Yes the effects are old; but it's very good for a movie that came out in the 80s, so don't you dare to criticize the movie because of that. One thing that drastically worsened the ending was the newer special edition. It totally ruined the ending. I mean Anakin Skywalker as a ghost, really?! Not to mention the stupid and unnecessary new CGI-footage. A stupid but understandable attempt to connect the prequel with the original movies.\r Star Wars: Episode VI - Return of the Jedi is an awesome movie. The story is magnificent and beautiful, not to mention the fantastic music, the great actors and the high amount of action! But it suffers with a less inventive plot and less depth to the characters.\r Personal Rating: 80/100\rCritical Rating: 75/100",
      "review_date": "2015-12-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Return of the Jedi is the best and worst of the Star Wars trilogy. The film goes to the darkest places. The confrontation with the Emperor is the trilogy at its best and darkest. This final confrontation is the ultimate showdown that feelsReturn of the Jedi is the best and worst of the Star Wars trilogy. The film goes to the darkest places. The confrontation with the Emperor is the trilogy at its best and darkest. This final confrontation is the ultimate showdown that feels like what the trilogy has been building up to. The culmination of Luke’s character and the final fight between him and Vader. An epic space battle swarming overhead. This is a big and grand epic finale that is bogged down by pacing issues. The fight on the ground while charming isn’t as interesting and not only is goofy but drags the film out. The opening Jabba fight feels disconnected and occasionally too showy. The film isn’t as character driven relying a lot on the flashyness of Star Wars and many characters outside of Luke and Vader aren’t given as much to do. Nonetheless, it is still good fun. For all the issues this film has there is still some amazing stuff some of the best ever. If the film could just tune out the lame stuff and pace itself better this could’ve been the best of the series arguably. Instead, this is the least of the trilogy as even the first one didn’t have any real issues. Still impressive though that a trilogy could have a solid run all the way through.",
      "review_date": "2015-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Yes, Return isn't as good as the first 2 movies, but it is definitely better than a 52.  That's the same score as Attack of the Clones!  I wish George Lucas would've made some sequels, though.",
      "review_date": "2012-08-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie wasn't quite as good as the previous two, but I remember really enjoying it as a kind and it wrapped up the original Trilogy nicely and had lots of new vehicles and characters to keep us entertained. Yeah I was gonna give it a 9This movie wasn't quite as good as the previous two, but I remember really enjoying it as a kind and it wrapped up the original Trilogy nicely and had lots of new vehicles and characters to keep us entertained. Yeah I was gonna give it a 9 but I'm thinking back and I loved this movie when it was released too so I'm bumping it up to a 10. If it's not a 10, it's like a 9.8 at least anyway. It's still way better than the prequels lol.",
      "review_date": "2012-12-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The chronological final installment (for now!) of the storied Star Wars film franchise does not disappoint in any way.  One of the best examples of bringing closure to a series of movies, where ends are tied and threads are brought closure.The chronological final installment (for now!) of the storied Star Wars film franchise does not disappoint in any way.  One of the best examples of bringing closure to a series of movies, where ends are tied and threads are brought closure.  The sequence of events are amazing, and the drama is at a high pitch.  Everything I wanted in a finale.",
      "review_date": "2012-12-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Good start, good end. Bad ewok and Death Star II storyline. Also, Yoda tells Luke not to face Vader in Empire Strikes Back, and that his Jedi training is not complete. But in this one, Yoda tells him all he needs to do to complete hisGood start, good end. Bad ewok and Death Star II storyline. Also, Yoda tells Luke not to face Vader in Empire Strikes Back, and that his Jedi training is not complete. But in this one, Yoda tells him all he needs to do to complete his training is to face Vader. What's that all about? This movie could easily have been better. Worst of the Original trilogy, but I'd still call it better than Revenge Of The Sith.",
      "review_date": "2013-03-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "10/10, it's an outstanding film that doesn't rely on its predecessors. Great special effects, terrific performances, overall an amazing way to end the original trilogy. Personally I think Return of the Jedi is BETTER than Episode 4.",
      "review_date": "2015-04-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A satisfying ending to the epic trilogy, this Star wars film is fun, action-packed, well-paced and intriguing, but it is less resonant than IV and V and it is more childish.",
      "review_date": "2016-01-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A decent finale to the star wars saga, well no longer finale ;). if it werent for the ewoks and the lame way the empire goes out, this could have been the greatest in the franchise",
      "review_date": "2015-05-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The third in the series of the original films often gets the least praise it seems like. People really like to bash on the little ewoks for some reason. It was the prior generation’s jar-jar binks I suppose. Despite this fans got a thrillingThe third in the series of the original films often gets the least praise it seems like. People really like to bash on the little ewoks for some reason. It was the prior generation’s jar-jar binks I suppose. Despite this fans got a thrilling conclusion to the series with some of the best special effects ever seen on the screen. It’s really a shame they did not start making 3 more star wars movies right after Return of the Jedi was completed. With the advanced special effects and actors more mature it could have been so amazing!\r What’s nice about the third film is seeing how the actors have changed over the years. Luke really does look like an adult now. He plays on the border of light and dark. And watching the movie you think it could go in many ways. There is much to enjoy and re-enjoy as you watch this movie over and over again. I love every bit of it.\r Spoilers Below\r Best Actor\r Mark Hamil’s Luke Skywalker does the best job I think for this final film. The focus was really on him and it’s great to see the character changed in this one. He holds his outbursts in more and Han serves that purpose more. Luke is very focused on his task and you can see how he’s trying to hold it all together throughout the movie.\r In some ways there are not as many surprises in this move as the first two in the trilogy. It’s wrapping up what was said in the first two, especially the 2nd. That might be a drawback to this film. But it’s really tense not knowing which characters will make it through to the end. All heads of the river coming to the end as it were which is really fantastic.\r In second place would be the emperor. It was a trick role to play. Does he act crazy or in control. Too much and it would seem cheesy and too much might seem to dark and absent for somebody that is supposed to be the leader of the dark side. Once again could you imagine how awesome these would be if they were rated r!\r Worst Actor\r This is a hard one to pick. I’d maybe pick Leia and Admiral Ackbar. Leia is in the movie a lot but she seems to be missing that edge she used to have. She just kind of goes along with being a slave girl. Later with the ewoks she seems sympathetic almost like she’s on a vacation. Maybe Han’s making her soft. But it seemed off a bit.\r While admiral Ackbar is only a minor role it could have been much more. I would’ve liked to seen more radio chatter with him directing the big capital ships. And more command people directing what’s going on. Just to give a bigger attack scale.\r Best Scene\r Story wise the best scenes are at the end with Luke & Vader and the emperor. The scene on the radar station walkway and the spire tower. These don’t really need to be explained why. But as just a fan of movies I loved the epic space battle. It was so amazing. It still is. Nothing really has topped it yet. And think how long ago it was. Going inside the new death star was a nice spin and it looked amazing and flew by so fast. So many great scenes and moments in this movie.\r But now in reviewing this movie I appreciate the Jabba scenes a lot more. They are filled the brim with so many alien characters and details. It’s a feast for the eyes and ears.\r Worst Scene\r When I’d watch the movie as a younger person I thought the Jabba scenes lasted too long. Maybe combine Luke & Leia’s story. She brings chewie and Luke sneaks in and they both fall into the ranchor pit. It seemed like the section was too long. Maybe it was knowing as a kid the more exciting, for a kid, ewoks and space battles were coming up. And I could simply not sit still anymore.\r Having a longer Yoda scene would’ve been nice. It was just too convenient to have him die the exact 10 mins that Luke was there.\r Hits\r-\tEpic conclusion to the saga!\r-\tLove always wins.\r-\tBest space battle, Ewoks! Did I say Ewoks!\r Misses\r -\tShort lightsaber battle. Too much cutting back and forth.\r-\tLando needed a side-story / mission.\r-\tNot seeing the emperor saber fight.\r Grade A",
      "review_date": "2015-12-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I honetly find this one overrated. Jabba is a bit weird and the ewoks are horrible, but it does still deliver some of the great things that made star wars what it is. The only thing I don't get though, is why yoda is telling him to fight whenI honetly find this one overrated. Jabba is a bit weird and the ewoks are horrible, but it does still deliver some of the great things that made star wars what it is. The only thing I don't get though, is why yoda is telling him to fight when he was doing the opposite in the last movie. Overall it isn't as good as the first two, but still an enjoyable film.",
      "review_date": "2015-08-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nA new Hope was brilliant, Empire Strikes Back was close to perfection... but this one wasn't so special. The first act set in Jabba's Palace was fine, but after that, when they go to the forest moon of Endor, meet the Ewoks and Luke confronts the Emperor, it just goes downhill. The scenes where Luke resists the Emperor's temptation are long and boring (apart from the lightsaber duel between Luke and Vader), and the Ewok scenes are ridiculous and cartoony. Honestly, it's a sad way to end such a great franchise.",
      "review_date": "2015-11-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It may not reach the greatness of it's predecessors, but Return of the Jedi is still a mostly enjoyable end to the original trilogy. It leaves none of the conflicts from the first two unresolved and although it was a bit ridiculous to see theIt may not reach the greatness of it's predecessors, but Return of the Jedi is still a mostly enjoyable end to the original trilogy. It leaves none of the conflicts from the first two unresolved and although it was a bit ridiculous to see the Empire get overpowered by a bunch of teddy bears, I can excuse it because those things were friggin' adorable. Naturally of course, it has flaws, such as a slight decline in quality after a certain point (and the shockingly casual death of Boba Fett). Overall, it's not as good as the first 2, but it's a fun movie and a mostly satisfying conclusion.",
      "review_date": "2015-12-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Amazing movie and has a great end to darth vader. The emotion and amazing story that this movie has is amazing. (When I review Star Wars movies I say amazing a lot) This movie is awesome I have no idea on my the critics gave it 52 know idea.Amazing movie and has a great end to darth vader. The emotion and amazing story that this movie has is amazing. (When I review Star Wars movies I say amazing a lot) This movie is awesome I have no idea on my the critics gave it 52 know idea. This movie was amazing.",
      "review_date": "2015-12-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Star Wars Episode 6 Return Of The Jedi is a underrated masterpiece. We get to see Jabba, The Emperor, and most importantly we get to see Darth Vader redeem himself. The special effects are on point, the score is amazing, and the charactersStar Wars Episode 6 Return Of The Jedi is a underrated masterpiece. We get to see Jabba, The Emperor, and most importantly we get to see Darth Vader redeem himself. The special effects are on point, the score is amazing, and the characters are still lovable. A perfect conclusion to the original trilogy.",
      "review_date": "2015-12-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Although the weakest in the originals, it's still a bit of excitement left over from this movie before the prequels came 16, 19, and 22 years later and its sequel 32 years later.",
      "review_date": "2015-12-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "WHAT I LIKED: A worthy end to one of the best movie franchises in history - Return of the Jedi succeeds in building up an hour's finale for the franchise to end with whooping heights and touching lows. The journey of these epic characters inWHAT I LIKED: A worthy end to one of the best movie franchises in history - Return of the Jedi succeeds in building up an hour's finale for the franchise to end with whooping heights and touching lows. The journey of these epic characters in this epic world steps up a level in a film where world building is taken to a whole new level, as is the development of the characters we've grown to know and love. Star Wars goes out with a big bang\rWHAT I DIDN'T LIKE: The ride isn't as smooth as it's two predecessors, and it takes a little while to get going\rVERDICT: An amazing end to an amazing trilogy. This film will always hold a special place in people's hearts.",
      "review_date": "2016-01-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I dont understand why the critic score is so low. Like what?? Ok, 4 and 5 are better, but this one is pretty good too. Ewoks are kinda silly. Other than that, the movie is damn fine. the emperor is not like one of those big bad deep voicedI dont understand why the critic score is so low. Like what?? Ok, 4 and 5 are better, but this one is pretty good too. Ewoks are kinda silly. Other than that, the movie is damn fine. the emperor is not like one of those big bad deep voiced villain. no. in fact, hes a bit corny, which is creative. the space battles is amazing. the best one if u ask me. sabre duel luke vs vader is pretty sweet too. Doesnt need all the flips and jumps. dialogues can do the trick as well. dont watch the 3d/enhanced/remastered versions though, just the originals. the new ones are abomination. it's nice to have few new scenes which tie in the prequels, but seriously vader screaming NOOOOOO while throwing the emperor into the hole??? what the f??",
      "review_date": "2016-02-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A decent film, though easily the worst of the original trilogy, Return of the Jedi is a fun filled thrill ride that is also filled with flaws, including some dialogue that would set up the **** on the movie industry that is the prequels.",
      "review_date": "2017-02-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Being the final film in the original trilogy, it's a bit surprising that Return of the Jedi is my least favorite of the three. It's still a fine film and plenty of fun to watch, but the plot is the weakest of the trilogy (besides the ending),Being the final film in the original trilogy, it's a bit surprising that Return of the Jedi is my least favorite of the three. It's still a fine film and plenty of fun to watch, but the plot is the weakest of the trilogy (besides the ending), and those damn Ewoks get on my nerves a bit. The ending was very fitting and provided a nice close to the story, though. In terms of the sci-fi genre, Return of the Jedi is an all-timer, but with its two predecessors in the series being classic level movies, it's hard not to think of it as the inferior one.",
      "review_date": "2018-04-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "C3PO is rightfully made a god in this episode,not just of the Ewoks but of a God of classic characters. There are many other great characters in this final episode of the saga and I could go on for days about them,but I won't! This episode isC3PO is rightfully made a god in this episode,not just of the Ewoks but of a God of classic characters. There are many other great characters in this final episode of the saga and I could go on for days about them,but I won't! This episode is my favourite,the right balance of humour and action. God and evil. Victory and Defeat. There are many poignant and thought provoking scenes,for example Yoda's death and Darth Vader returning back to his roots as Anakin. A masterpiece of cinema,even though it's not quite a 10 in my books.",
      "review_date": "2010-09-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "this should NOT have the same score as Attack the Clones, that was boring badly Written, and just a Big CGI-fest made to make money",
      "review_date": "2011-04-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Yes this movie isn't quite as good as the first two, but it is still a masterpiece. In fact I dare say that this is one of the few great threequels in existence. The only other ones that I can think of are The Dark Knight Rises, Toy Story 3Yes this movie isn't quite as good as the first two, but it is still a masterpiece. In fact I dare say that this is one of the few great threequels in existence. The only other ones that I can think of are The Dark Knight Rises, Toy Story 3 and Lord of the Rings: The Return of the King. That's about all I can think of right now when it comes to GOOD threequels. I mean, Pirates of the Caribbean 3 sucked hard and it was as disappointing as Spiderman 3 and Shrek the Third. Why do people tend to say they hate this one?\r It's really infuriating when people say that this is the worst of all the Star Wars movies. It isn't. The worst one is The Clone Wars, a movie with TV production standards, literally. I loved (almost) every single minute of this timeless science-fantasy classic, and I still love it.\r Return of the Jedi is uneven at times but it all works really well as an entertaining epic for almost everyone. Star Wars will always be the franchise that started it all, the series that changed cinema forever and will last until the end of time.\r I hope you enjoyed this review, and may the force be with you.",
      "review_date": "2012-10-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If my memory serves me right, this was the first Star Wars movie I ever saw (around the time the Special Edition VHS came out). I love it, just as much as I love every other Star Wars movie. Unfortunately, this was the movie where hatersIf my memory serves me right, this was the first Star Wars movie I ever saw (around the time the Special Edition VHS came out). I love it, just as much as I love every other Star Wars movie. Unfortunately, this was the movie where haters began their reign by hating on the Ewoks, and continue to this day on hating anything Star Wars that isn't Episodes IV or V. Seriously haters?",
      "review_date": "2011-03-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Star Wars: Episode VI - Return of the Jedi is another fantastic Star Wars film. There are so many great, unforgettable scenes from the sand barge to the speeder bikes to the mother of all space battles. The only real problem are those Ewoks.Star Wars: Episode VI - Return of the Jedi is another fantastic Star Wars film. There are so many great, unforgettable scenes from the sand barge to the speeder bikes to the mother of all space battles. The only real problem are those Ewoks. Seriously?! A bunch of teddy bears with rocks take down \"an entire legion of [the emperor's] best men\". Every time I see those stormtroopers panic, throw aside all notion of tactics or strategy and run off willy-nilly into the bushes... Sigh. But still a great movie, though.",
      "review_date": "2015-11-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ignore all negative criticism; this film is easily the most exciting film of the whole lot. We are drawn into a world of tension as we watch the destiny of Luke Skywalker unfold. Yes, Jabba's Palace fails slightly, but the escape fromIgnore all negative criticism; this film is easily the most exciting film of the whole lot. We are drawn into a world of tension as we watch the destiny of Luke Skywalker unfold. Yes, Jabba's Palace fails slightly, but the escape from Tatooine is great and the Battle on Endor is amazing. I simply don't understand where all this criticism is coming from; an epic conclusion!",
      "review_date": "2011-12-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "For years I pretty much dismissed Star-wars after \"Empire Strikes Back\" but recently I began to see this as the jewel of the series. There are problems though. First off I actually found the Ewoks, although there mainly to sell merchandise,For years I pretty much dismissed Star-wars after \"Empire Strikes Back\" but recently I began to see this as the jewel of the series. There are problems though. First off I actually found the Ewoks, although there mainly to sell merchandise, rather interesting.  A carnivorous groups of tree bears who worship golden robots. Lucas should have explored them a bit more. It would have been great to see these cuddly creatures feasting on the bones of captured storm troopers. After all the movie already established that they consider humans a healthy source of food. That aside what I finds to be the main flaw of the movie is the death of the emperor. In episode IV the first movie there is a classic good vs evil battle. When the rebells blow up the Death Star evil is defeated. This sets up \"Empire\" quite nicely. We find out Vader is actually Luke's father. Luke is vulnerable to the dark side.  In \"Jedi\" Luke is courted by the emperor who wants to replace the aging Vader, while Vader want to recruit Luke to run the dark-side like a father son company. What \"Jedi\" does, is it introduces a more eastern concept of the light side dark side struggle. Amidst the rebel attacks Luke must come to term with himself. He can no longer simply try to defeat the dark-side in him. He must make morally complicated choices. Act in anger and attack the Emperor thus darken his sole to help his friends survive, or let them die while retaining his innocence. Unfortunately These ideas get clouded by the need for a happy Hollywood ending, So Vader toss the emperor down the shaft and another death stars blows up. First, this has always been highly disappointing for the Emperor to die in such a mundane way. Vader should have done this years ago is what I was thinking as a child. As an adult I ponder on the existence of evil, how it is something that one must come to terms with live with, but never vanquish. If one take Luke putting down his light saber as the climax of the scene it retains that power. We now know what path he is on, but I suppose Ewoks dining on storm trooper, while Luke turns his back to the Emperor would have left many of ten year olds scratching their hear.",
      "review_date": "2011-03-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is more playful than the first two (until the end).  It's not quite as brilliant but it's solid, simple entertainment at its best. It's so incredibly fun to watch. What more do you need?",
      "review_date": "2011-08-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is a perfect end to the original trilogy. I just wished George didnt mess with the film in the remakes.",
      "review_date": "2017-12-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I find this Star Wars to be the best of the sequel trilogy. A dozen vital questions in the saga are answered here. It all feels like it ends to quickly despite the long running time, but the story is anything but thin. I find this Star WarsI find this Star Wars to be the best of the sequel trilogy. A dozen vital questions in the saga are answered here. It all feels like it ends to quickly despite the long running time, but the story is anything but thin. I find this Star Wars to flesh out the characters way more than the others.",
      "review_date": "2012-05-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I watched this over and over, its so exciting! the ewok battle was rediculous and how come luke didnt get scarred from the emperors force lighning? only a bit of it killed darth. but i loved it.",
      "review_date": "2011-12-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ultimately, the final film in the original trilogy failed to deliver. IV and V were so much fun, and contained a lot of darker elements that are noticeably absent in this film. The ewoks were a particularly despicable addition, with thereUltimately, the final film in the original trilogy failed to deliver. IV and V were so much fun, and contained a lot of darker elements that are noticeably absent in this film. The ewoks were a particularly despicable addition, with there dumb teddy bear faces, and unblinking eyes. Yes, this film is flawed, however, it is still a pretty decent movie, and much better than any of the films in the prequel trilogy.",
      "review_date": "2012-02-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The late Richard Marquand got the nod as the director over the superior Kershner, director of Empire Strikes Back.  That's not to say he didn't craft an interesting film, but many of the superior forces in Empire were lacking.  The film neverThe late Richard Marquand got the nod as the director over the superior Kershner, director of Empire Strikes Back.  That's not to say he didn't craft an interesting film, but many of the superior forces in Empire were lacking.  The film never truly reaches 'crisis' state, as it aspires to so often, and leaves one feeling like the characters are never in any true peril.  A somewhat missed opportunity in the franchise, but still a worthy conclusion.",
      "review_date": "2012-08-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I loved this movie and thought it was just amazing.  Awesome special effects.  It was also filled with amazing fight scenes and was plain cool.  George Lucas is a great director and people who say he is bad don't know anything about StarI loved this movie and thought it was just amazing.  Awesome special effects.  It was also filled with amazing fight scenes and was plain cool.  George Lucas is a great director and people who say he is bad don't know anything about Star Wars.  There is plenty of action in this movie and it is great movie for it's time  and for along time it will be remembered",
      "review_date": "2012-03-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Of the original trilogy this is undoubtedly the weakest film. However this does not make it a BAD film - just far less impressing than A New Hope and The Empire Strikes Back. Despite this, it is still an exciting film that could have beenOf the original trilogy this is undoubtedly the weakest film. However this does not make it a BAD film - just far less impressing than A New Hope and The Empire Strikes Back. Despite this, it is still an exciting film that could have been done far worse and serves up as a satisfactory, if not perfect, ending to one of the best science fiction films of all time. Collapse",
      "review_date": "2012-05-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Its not as good as the franchises' first two installments, but Return of the Jedi rounds the series off on a high note, particularly with the powerhouse ending.",
      "review_date": "2012-07-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is the movie that turned my world upside down!! I am an absolute Star Wars geek!! I have a huge collection of figures and even a tattoo of the Imperial logo on my leg. Return of the Jedi is what grabbed me and pulled me into the StarThis is the movie that turned my world upside down!! I am an absolute Star Wars geek!! I have a huge collection of figures and even a tattoo of the Imperial logo on my leg. Return of the Jedi is what grabbed me and pulled me into the Star Wars galaxy. I absolutely loved this movie growing up. It's definitely my favorite Star Wars film. Empire is a close second though. The only thing that drives me nuts about the movies is when George Lucas had to \"touch it up\" and he added that horrendous redone band scene in jabbas palace. Every time I see that it makes me cringe. Other than that hands down best Star Wars movie ever and definitely the best fiction ever!!! The Star Wars galaxy is one of the greatest things ever created for sci-fi dudes!!",
      "review_date": "2012-08-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis is one of the movies i will remember for all my life, and it will always be a classic. It's the finale to Star Wars and it's in my opinion the best of the star wars movies. The different sceneries are amazing, you can't really expect what will happen next and the characters are very deep, It generally has an epic feel. Especially the scenes with Vader, Sidious and Luke  get so tense you can feel their emotions even when they are not talking. And ofcourse the father-son relationship prevails. Hurray-Hurray. A must see for me!",
      "review_date": "2012-09-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An incredible sequel of the Star Wars saga, The ultimate film of the first trilogy has more adventure and less dark compared to the empire strikes back. The scene of the spaceships battle against the Deathstar continues to amazing me I stillAn incredible sequel of the Star Wars saga, The ultimate film of the first trilogy has more adventure and less dark compared to the empire strikes back. The scene of the spaceships battle against the Deathstar continues to amazing me I still loving that movie like all of them.",
      "review_date": "2012-09-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "While I still enjoyed this, I found it slightly inferior to the earlier films. The Ewoks were kind of a waste of space, the action was slightly lack luster, however the scenes of Tatooine were amzing, the climatic battle with the Death StarWhile I still enjoyed this, I found it slightly inferior to the earlier films. The Ewoks were kind of a waste of space, the action was slightly lack luster, however the scenes of Tatooine were amzing, the climatic battle with the Death Star and Vader were equally brilliant, so it can be excused  for its flaws.",
      "review_date": "2012-11-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The best part of the original trilogy will thrill you! Star Wars ended. Ended as one of the best movie franchises to date! But, wait... it didn't end! Hell yeah!",
      "review_date": "2015-12-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Clearly, Jedi is the less impressive of Star Wars' first trilogy, but it is still a spectacular viewing. The last act can be considered one of the greatest moments in the Star Wars saga.",
      "review_date": "2016-01-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Critics say this is the worst movie or the old trilogy or below this standard of its predecessors, but in my opinion he is the same level as the others, because in addition to closing the old trilogy decent shape, it has everything a fan ofCritics say this is the worst movie or the old trilogy or below this standard of its predecessors, but in my opinion he is the same level as the others, because in addition to closing the old trilogy decent shape, it has everything a fan of Star Wars or the iconic characters, a new kind of Ets, and epic duel Luke and D.Vather.",
      "review_date": "2013-05-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "While not as resonant as \"Empire Strikes Back\", and not as original as the first, \"Star Wars: Episode VI  Return of the Jedi\" may be the weakest of the original trilogy, but its still pretty good with a great ending climax that is sure to notWhile not as resonant as \"Empire Strikes Back\", and not as original as the first, \"Star Wars: Episode VI  Return of the Jedi\" may be the weakest of the original trilogy, but its still pretty good with a great ending climax that is sure to not disappoint most Star Wars fans.",
      "review_date": "2013-07-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a fun film (however it is the worst of the original trilogy), full of great visuals, creatures, action sequences and has some great acting in there.  However, it gets over the top with some of its creatures, but never ceases toThis is a fun film (however it is the worst of the original trilogy), full of great visuals, creatures, action sequences and has some great acting in there.  However, it gets over the top with some of its creatures, but never ceases to entertain.  This film is a great addition to Star Wars, and is another highly respected movie on my list.",
      "review_date": "2013-07-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Lots of world building and great sci-fi action.A fitting end to the series.",
      "review_date": "2019-12-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film started off quite strong but then escalated into a rehash of Episode IV. I would have to say though it did end on a high note and introduced one of my favourite childhood clans, the Ewoks.",
      "review_date": "2015-12-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is a bit sloppy at times compared to the rest of the trilogy, but it delivers the epic conclusion to our favourite sci fi franchise we've all been looking for! The dark side toys with Luke, keeping the dark tone from the previousThis film is a bit sloppy at times compared to the rest of the trilogy, but it delivers the epic conclusion to our favourite sci fi franchise we've all been looking for! The dark side toys with Luke, keeping the dark tone from the previous film, and the fight between Vader and Luke is so savagely executed that it's the most thrilling of the original trilogy to watch! The battles are epic, which is what you hope for in a film like this, and despite the Ewoks being a little silly, they still hold an ace battle against the storm troopers. Still good direction in the film and superb acting, but a little shadowed by the behemoth that was episode V.\rAnyway, now that i have reviewed all star wars films, i'll put them in order with my full score.\r1. Episode 5 - The Empire Strikes Back 97/100\r2. Episode 4 - A New Hope 90/100\r3. Episode 6 - Return of the Jedi 86/100\r4. Episode 3 - Revenge of the Sith 81/100\r5. Episode 1 - The Phantom Menace 66/100\r6. Episode 2 - Attack of the Clones 54/100",
      "review_date": "2015-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's a pretty good conclusion to the classic trilogy, \"Return of the Jedi\" is overall a bit too long, but thankfully it entertains, thanks to its improved action beats and decent performances. Admittedly, the dialogue is repetitive. I canIt's a pretty good conclusion to the classic trilogy, \"Return of the Jedi\" is overall a bit too long, but thankfully it entertains, thanks to its improved action beats and decent performances. Admittedly, the dialogue is repetitive. I can agree with that. How many times did the Emperor kept saying \"Now you will die\" or \"This is the end of the rebellion\"? Nevertheless, I liked the atmosphere, the settings and the special effects were usually good. So friggin' excited for Force Awakens. Friday seems like a light year away.\r Final Score: 8/10",
      "review_date": "2015-12-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The main problems that keep this sequel from being amazing are firstly the ewoks. The worst part of the original trilogy by far. Next is the movie starts strong and comes to a screeching hault when we arrive on endor. And the movie doesntThe main problems that keep this sequel from being amazing are firstly the ewoks. The worst part of the original trilogy by far. Next is the movie starts strong and comes to a screeching hault when we arrive on endor. And the movie doesnt keep the dark tone set up in Empire, it regresses and goes the other way. However there is lots to love in this film. overall it is a ddecent film",
      "review_date": "2014-05-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The film is good, but not as good as others in the trilogy, but still has a good and interesting history, great special effects, and good action scenes.",
      "review_date": "2015-05-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ewoks? Cute, but can they really beat the Empire? COME ON! Thats a really crutial point of the movie and they f**ked it up! I heard in the original script they were actually going to a Wookie plannet, Kashyyk, well we didnt get to see that.Ewoks? Cute, but can they really beat the Empire? COME ON! Thats a really crutial point of the movie and they f**ked it up! I heard in the original script they were actually going to a Wookie plannet, Kashyyk, well we didnt get to see that. Shame. Also: Why did the Emperor actually lead the rebels to the ACTUAL generator? Why not lead them to a fake place?",
      "review_date": "2016-01-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great story, and very climactic ending, but too drawn out in the middle.Plot: 3.5/5Action/ Entertainment: 3.5/5Visuals/ Music: 4.5/5Acting: 5/5",
      "review_date": "2018-01-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A beautiful conclusion to the Star Wars saga. Took what came before and ran with it both thematically and technologically.",
      "review_date": "2019-12-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI love this movie. It's a great story about a father and son. Luke brings Darth Vader back to the light side of the force and becoming Anakin once again. This movie has the most heart out of any of the other Star Wars movies. I grew up with the prequels and love them too. But the reason I like the Prequels so much is because of the original trilogy. I love Luke and Darth Vader. So to finally see how Anakin became Darth Vader was incredible to me. To see Darth Vader as Anakin in his prime fighting Dooku was a dream come true. But without the original trilogy I wouldn't give a **** about the prequels. Although I still don't give a **** about Disney Star Wars. If you loved the original trilogy but hated the prequels not sure how you could like any of the Disney Star Wars movies. At least the prequels had a good story with character progression and respected the force. Disney Star Wars is a joke going by their own rules about how the force works. Disney Star Wars creates problems for the Original trilogy and the prequels because of what they did with the force. So I don't count Disney Star Wars as real Star Wars.",
      "review_date": "2019-12-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A less satisfying piece of work from Star Wars, but it still gives a great sense of completion to the original trilogy's story.",
      "review_date": "2018-03-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's true that it's not better than last two films, but it's still George Lucas's masterpiece with great ending. This ends the story of Anakin Skywalker! Actually I want to give like 8.5/10 because it's so good, but it's not in the same levelIt's true that it's not better than last two films, but it's still George Lucas's masterpiece with great ending. This ends the story of Anakin Skywalker! Actually I want to give like 8.5/10 because it's so good, but it's not in the same level with A New Hope, so that's why I finally chose 8/10. George Lucas is a genius!",
      "review_date": "2018-05-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The last film in the Star Wars trilogy is a true popcorn film. The universe and characters are as great as always, the locations and places are entertaining, and the film moves fast and is incredibly fun. They take some of the characters inThe last film in the Star Wars trilogy is a true popcorn film. The universe and characters are as great as always, the locations and places are entertaining, and the film moves fast and is incredibly fun. They take some of the characters in wildly new and entertaining directions but sometimes the writing and dialogue feel inconsistent at times. Some re-used plot devices such as the new Death Star feel lazy, and some moments are ridiculously stupid, but overall the film is fun enough to forget most of it and offers much entertainment and joy while giving closure and satisfaction with then ending.",
      "review_date": "2018-12-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "its just an amazing film not quite reaching empire or hope but its still one of my favouritesthe space battles epic and endor bike chases, sarlacc pit and of course Luke vs Vader such an emotional ending, and the redemption of vade.",
      "review_date": "2021-01-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It actually sickens me to see how low the official critic rating is for this absolute master piece. If (for some reason) you haven't seen this film, you must see it. Star Wars is the most brilliant idea i have ever seen from a director, andIt actually sickens me to see how low the official critic rating is for this absolute master piece. If (for some reason) you haven't seen this film, you must see it. Star Wars is the most brilliant idea i have ever seen from a director, and Return of The Jedi is such a great ending to the series. I know you have to respect opinions, but after seeing the critic rating, it made me wish that the critics would be instantly fired from the business. There's no way i can begin to comprehend how you can actually dislike this movie. To think that that piece of crap Pirrhana 3D actually recieved better ratings. NO ONE EVER LISTEN TO CRITICS. THEY HAVE NO IDEA WHAT MAKES A GREAT FILM.",
      "review_date": "2010-10-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Definitely the worst out of the Original series, but its still one hell of a film full of heart and a conclusion that really does leave you satisfied. In fact i would also say that this is probably one of the most memorable Star Wars filmsDefinitely the worst out of the Original series, but its still one hell of a film full of heart and a conclusion that really does leave you satisfied. In fact i would also say that this is probably one of the most memorable Star Wars films and easily the most entertaining out of the 3, it has a lot of action and really just feels like it was made to satisfy the fans. My biggest issue with the film is how they handled everybody's favorite bounty hunter and the fact that the little bear cub people *im not a huge star wars fan boy dont kill me* are very irritating.",
      "review_date": "2015-12-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I actually can't believe the critic rating is so low for this cult classic. There's a reason that the film kick started the biggest toy franchise in history. Truly unique and so quotable.",
      "review_date": "2010-10-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The was a few problems with this film, and it wasn't as good some the other two in the trilogy however, this was still a great film and the score of 52 by critics is BS.",
      "review_date": "2012-12-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Return of the Jedi is the final chapter in the Star Wars saga. It ties up all the lose ends and leaves nothing unanswered which is impressive to say the least. After losing hold of the galaxy to the Empire the last Jedi, Luke Skywalker,Return of the Jedi is the final chapter in the Star Wars saga. It ties up all the lose ends and leaves nothing unanswered which is impressive to say the least. After losing hold of the galaxy to the Empire the last Jedi, Luke Skywalker, fights the Empire at its heart against Darth Vader and the Emperor. The story at this point becomes slightly cliche but it can be forgiven for its awesome fight scenes and great CGI.",
      "review_date": "2012-10-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "'Return of the Jedi' is a criminally underrated film. However, it is, admittedly, the weakest of the trilogy. The Ewoks are childish and the battle on Endor is not particularly believable, but its faults are redeemed by its better moments- in'Return of the Jedi' is a criminally underrated film. However, it is, admittedly, the weakest of the trilogy. The Ewoks are childish and the battle on Endor is not particularly believable, but its faults are redeemed by its better moments- in particular, the final space battle and the confrontation in the throne room. The film has a lot of heart, and the conclusion is a satisfying one of redemption.",
      "review_date": "2015-11-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of my favorite Star Wars movies. It has the story, characters, and a great ending that was expected, but needed. I would say watch it, as soon as you can.",
      "review_date": "2017-05-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not my favorite of the original 3 but quite necessary to wrap everything up.  I and just about everyone else hated the little bears.  What a cheesy attempt at merchandising.",
      "review_date": "2011-03-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The film is slow and monotonous, at least, until the very end, which is powerful, and is remembered as a classic movie sequence.",
      "review_date": "2012-11-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "After witnessing two great Star Wars movies, I was super stoked to see the conclusion of the original trilogy. 2 hours later, I realized that I didn't love this movie. Granite, it's not bad at all, but it didn't fully deliver as an all aroundAfter witnessing two great Star Wars movies, I was super stoked to see the conclusion of the original trilogy. 2 hours later, I realized that I didn't love this movie. Granite, it's not bad at all, but it didn't fully deliver as an all around exciting finale. Let me get my negatives out of the way. The style of this movie didn't seem as cool as before. The previous two movies had great affects for there time and still hold up pretty well. The effects in this movie are easily outdated. And because of that it sometimes took me out of the movie. I also didn't find all the characters to be well written and I think the performances kind of show. For me, it's mainly from Han and Leia. I understand that Han is going through a character arc, but he doesn't feel like the Han Solo I knew from the previous too movies. Leia was kind of the same way, but not to the extent I felt with Han's character. And of course, the ewoks. Granite they are not Jar Jar bad by any means, but seem to cute for a movie that should be more of a fulfilling finale. I don't think they truly needed to be written in the movie. Now for the good! While I mentioned some of the writing wasn't as well written with certain characters, Luke Skywalker was great. I love him becoming a Jedi and journey he goes on to confront Darth Vader. In fact, that whole storyline is what I loved the most. The confrontation, the lightsaber fight towards the end, everything going on in those scenes were nothing short of perfection. In many regards, that should be the case since this is the main story we are following. I even loved the emperor. While I got a taste of what he was like in the prequels, it felt like I met this character for the very first time in this movie. And I loved how he wasn't simply over the top, but he was very controlling and threatening. I thought he added a lot to the confrontation between Luke and Vader. And then we get to the cute party scene at the end and the series is over... For now! Overall, even with its flaws, there's still lots of good that comes out of it as well. But it's not always well rounded all the through like I hoped. Nevertheless, I still liked \"Return of the Jedi\" and I'm going to give it a B!",
      "review_date": "2015-12-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis one is OK, just OK. After the good 'Star Wars' and the great 'Empire Strikes Back', you see 'Return of the Jedi', and *SPOILER ALERT*, the good guys win. Of course everyone wants to see the good guys win, but announcing the outcome in the title is not exactly a smart move. Nor were the Ewoks, and the ending party didn't need to last as long as it did. Then again, the scenes with the Emperor are legitimately pretty creepy, and who can forget the (take your pick of stupidly awesome or awesomely stupid) line \"IT'S A TRAP!!\" 'Jedi' is the weakest link in the original trilogy for its tonal inconsistencies, but it is still far better than any of the prequels.",
      "review_date": "2015-02-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There is a videogame maxim that should've been applied to this movie. \"Everything should have consequences\".\r Now Episode 4 suffered from a thick plot that didn't give time for enough character development, Episode 5 ended up being a bigThere is a videogame maxim that should've been applied to this movie. \"Everything should have consequences\".\r Now Episode 4 suffered from a thick plot that didn't give time for enough character development, Episode 5 ended up being a big scary BOO to the audience that didn't pay off with any serious consequences, except Han Solo's \"temporary death\".\r Return of the Jedi doesn't have any of these problems I guess, the payoff's there, the characters have greatly matured since the last movies, especially Luke, and I appreciate the progress in every aspect.\r Now a lot of people would point out that this is again a Death Star to destroy, and again it's about a magical hole to destroy the Death Star, and again it's about Vader VS Luke.\r Personally, I don't even see that as criticism. It's the third movie in a trilogy, you're surprised that it's like the two others? I don't mind the lack of originality at all, and the slight differences in plot twists and surprises are largely enough to keep me interested through and through.\r The problem is simply the numerous inconsequential elements of this movie, which pop out even more than in the last two ones.\r The Empire captures Han's party? Eh, the Ewoks will free them.\rThe Ewoks bring virtually nothing but cute teddy bears to the Star Wars universe? Eh, it's no matter.\rThe Imperial Fleet gets to attack the much smaller Rebel Fleet? Eh, it's ok, they'll still survive until the end cause the plot demands it.\rLuke tries to sways his father back to the Light Side? Eh, he won't do it.\rLuke is actually about to die? Eh, he'll turn to the Light Side to save him.\r It's as entertaining as the last ones if you ask me, slightly less maybe, but not by a decisive margin. The only thing is, while Empire Strikes Back felt like a big scary phantom that ended up being empty threats at the end, this one feels like...nothing.\r No real terrible things happen, everything ends up fine as can be, nothing bad that happens ever lasts for a long time if it's about the characters we know and like.\r The ultimate example of this movie's problems? The moment where Luke throws away his lightsaber after realising that he's becoming like his father, a pawn of the Emperor.\r \"Very well, come to my side and take your father's place!\"\r\"Nope.\"\r\".........oh well then, I guess my plan is ruined and I'll just kill you.\"\r Well for something that's been built up for 20 minutes, that was a quickly ended climax.",
      "review_date": "2014-07-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It may of played it safe , it may have less of an original plot , it still is a great movie. Its up there with the best.Might not be one of the best SW movies , but its one of the best movies of all time.",
      "review_date": "2016-12-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "the greatest finale in the trilogy and we will treasure it always.",
      "review_date": "2010-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What's this? If Randall saying in Clerks 2 LOTR is 3 film about walking Star Wars is 3 film about rescue, rescue, and rescue. The first film: rescue princess leia, the second film: rescue Luke Skywalker and the third film: rescue Han Solo. IWhat's this? If Randall saying in Clerks 2 LOTR is 3 film about walking Star Wars is 3 film about rescue, rescue, and rescue. The first film: rescue princess leia, the second film: rescue Luke Skywalker and the third film: rescue Han Solo. I guess Lucas have no idea with his story. It's too lame, too long and poor storytelling just about rescue in space.",
      "review_date": "2015-03-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I love the star wars mythology and that is why I think this messy try-hard rehash stinks so much. The final hour is particularly dire. What a disappointing way to finish a legendary saga. Oh, and the ewoks! Why did Lucas think the franchise I love the star wars mythology and that is why I think this messy try-hard rehash stinks so much. The final hour is particularly dire. What a disappointing way to finish a legendary saga. Oh, and the ewoks! Why did Lucas think the franchise needed furry smurfs? This mov ie makes AOTC look good and ROTS look like Dr Zhivago. Only TPN comes near it in terms of crappiness.",
      "review_date": "2007-09-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very, very, very sad end for a great saga, this natural trash movie should be completely redone, and even George Lucas recognize he made a lot of mistakes in the series and if he could he would change that, only  children or completely blind,Very, very, very sad end for a great saga, this natural trash movie should be completely redone, and even George Lucas recognize he made a lot of mistakes in the series and if he could he would change that, only  children or completely blind, insane ans brainless fanatics with childish behaviour thinks George Lucas  don't make mistakes, but even him agree with this. For little children this a good film, but for the old fans the only scene in the whole film that is great is the death of Darth Vader, and it's all, don't buy or see this film, only this scene.",
      "review_date": "2011-08-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "probably the one of the worst film ever made. i mean the worst film to the end of the series. even the phantom menace is better. the plot was terrible. i don't know why george lucas written return of jedi so awful. the only one good thingprobably the one of the worst film ever made. i mean the worst film to the end of the series. even the phantom menace is better. the plot was terrible. i don't know why george lucas written return of jedi so awful. the only one good thing from this movie: visual effects.",
      "review_date": "2015-03-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Easily the worst film of the original trilogy. It lacks originality and is really just a recycled version of the 2 previous films. The acting is pretty terrible as well. A huge disapointment.",
      "review_date": "2011-11-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "RE: The Star Wars Prequels...This film was George Lucas's warning from history.We were taken to such dizzying heights with The Empire Strikes Back, that it should have been predictable that we'd have to be brought crashing back down toRE: The Star Wars Prequels...This film was George Lucas's warning from history.We were taken to such dizzying heights with The Empire Strikes Back, that it should have been predictable that we'd have to be brought crashing back down to planet Earth with this anti-climactic conclusion to the saga.There was no way to better the excitement of the destruction of the first Death Star or top the \"I'm your father\" cliff hanger. So all George could think to do was...do it all again.Once we get past the Star Wars edition of the Muppet Show at the start of the movie, we are then presented with another flawed Death Star and another addition to the Skywalker family. All the character development from the first two films is discarded and it's like watching a TV special.As for the ending...all I can say is avoid the Blu Ray edition.Fo me, Han Solo will forever be encased in Carbonite. His friends endlessly scouring that galaxy far far away, in a vain effort to rescue him.And I didn't even mention the Ewoks!...oh damn!",
      "review_date": "2011-09-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The original Star Wars is a classic space opera that invokes the sense of adventure in our hearts, making it a great watch. The second one was even better, furthering the plot and containing even more action and drama. However, this end toThe original Star Wars is a classic space opera that invokes the sense of adventure in our hearts, making it a great watch. The second one was even better, furthering the plot and containing even more action and drama. However, this end to the trilogy is a weak mess of a story with almost none of the charm that the first two movies had. It does have an excellent first act, and the conclusion is fulfilling . Overall, worth a watch just to finish the story, but not a great movie by any stretch of the imagination.",
      "review_date": "2011-11-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Richard Marquand just couldn't grasp hold of how the Star Wars series flowed. The third Movie gave all the all the opposites of what the originals provided us with. It was Corny, Uninspiring, and Immature.",
      "review_date": "2012-02-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Could be better, but still much better then later SW movies, prequels and sequels. I return to this movie quite often and enjoy it a lot. The big plus of the movie is ease of connection. Very important for me when watching movies.",
      "review_date": "2021-03-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'm not a massive fan of Star Wars but Return of the Jedi has enough exceptional sci-fi elements and adventurous feelings for it to be a satisfying conclusion to the original Star Wars trilogy.",
      "review_date": "2014-01-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Return of the Jedi is on a slightly lower plateau than the first two due to bad editing and loose screenplay. However, it's still a pretty good conclusion to these movies.",
      "review_date": "2014-04-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "one of the worst star wars movies how does the empire get massacred by bares this movie is the 2nd worst star wars not as bad as episode 1 though its still bad though i hate how they changed the end to sell toys as well",
      "review_date": "2015-08-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nReturn of the Jedi is my least favorite of the originals, but it still holds a special place in my heart.  Jabba's palace scene might be possibly my favorite scene in Star Wars.  The battle between Luke and Vader was both emotional and awesome.  The problem with the movie lies with the poor comedy and with the ewoks.  I also feel like the conversation between Leia and Han at the end felt very weird, especially after Leia kissed Luke.  Overall, I would give this movie an 8.2!",
      "review_date": "2018-01-01",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 121,
  "genres": [
    "Action",
    "Adventure",
    "Sci-Fi",
    "Thriller",
    "Fantasy"
  ]
}