{
  "title": "The Right Stuff",
  "rating": 8.1,
  "release_date": "1983-10-21",
  "genre": [
    "Adventure",
    "Biography",
    "Drama",
    "History"
  ],
  "summary": "The story of the original Mercury 7 astronauts and their macho, seat-of-the-pants approach to the space program.",
  "critic_reviews": [
    "Kaufman's love for the Yeager character pays off in the magical closing sequence of the film, when the \"best pilot in the world\" eyeballs anew Air Force jet and says, \"I have a feeling this little old plane right here might be able to beat that Russian record.\"",
    "Consistently compelling, capturing all the ambiguity and tension of the book.",
    "Rarely has a film made a historic accomplishment seem so vivid and personal.",
    "Kaufman (like Tom Wolfe, whose book The Right Stuff this is taken from) is well enough aware of the media circus surrounding the whole project, but still celebrates his magnificent seven's heroism with a rhetoric that is respectful and irresistible.",
    "Director-writer Philip Kaufman's script brings a wealth of humor to a faithful retelling of the astronauts' fascinating stories, the actors fit smoothly into their roles and even physically resemble their characters, and the direction is well-paced and visually exciting.",
    "A GREAT American movie in a new epic form, The Right Stuff fuses the comic and the heroic to emerge as a knockabout social comedy that also packs a thriller inspirational and -- why deny it?-- patriotic wallop.",
    "The Right Stuff is a humdinger. Full of beauty, intelligence and excitement, this big-scale look at the development of the US space program and its pioneering aviators provides a fresh, entertaining look back at the recent past.",
    "If the movie does not have that almighty precious thing, at least it had the wit to look for it in the right place. Moviegoers seeking a grand yet edifying entertainment, right-stuffed with what Kaufman calls \"seriousness of subject matter and a wild humor that comes out of left field,\" now know where to look too.",
    "In a brash, beautiful, deeply American film, Kaufman has combined the resources and ingenuity of movie making with the freewheeling, damn-the-conventions style of of the New Journalism and come up with a generous, high-spirited look at the bravery and lunacy that was that era.",
    "There are moments of dramatic licence, but overall The Right Stuff is a terrific historical film about the space race: accurately reflective of a complex reality, beautifully filmed, and done with wit, energy and an impressive sense of balance. Top marks.",
    "The titular “stuff” is shown to be a combination of courage, determination, and recklessness, but, as Kaufman’s stirring epic reminds us, an equally important motivation for greatness is the fear of being merely second best.",
    "THE RIGHT STUFF, Philip Kaufman's rousing, funny screen adaptation of Tom Wolfe's book about Project Mercury and America's first astronauts, is probably the brightest and the best rookie/cadet movie ever made, though the rookies and cadets are seasoned pilots and officers."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Reasonably entertaining, well-acted and directed but not always compelling over a long runtime.",
      "review_date": "2019-10-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is the only film I have ever seen where the entire cinema audience, spontaneously, stood up at the end with a standing ovation.  It's that engrossing, and that well done, and stays true to the spirit of Tom Wolfe's book, which is itselfThis is the only film I have ever seen where the entire cinema audience, spontaneously, stood up at the end with a standing ovation.  It's that engrossing, and that well done, and stays true to the spirit of Tom Wolfe's book, which is itself one of the great masterpieces of American literature, vividly conveying the drama, humor, tragedy, and glory of US experimental aviation and spaceflight in the 1950s and early 60s.One of the greatest ensemble casts ever put together delivers many simultaneous career-best performances as the Mercury Seven.  Astoundingly well-cast, with the slight exception of Sam Shepherd who's just a little too movie-star for the Yeager part and whose fake drawl doesn't quite make it.  However, they managed to get the *actual* Yeager in there, as a local yokel in a bar scene, so it all evens out I guess.Considering the relatively primitive special effects technology available in those times, it's notable how good the flight scenes are compared to more recent big-budget films -- in many scenes better than \"First Man\", for example.  The director, editor, and cinematographer just had superior skills and execution compared to their counterparts today.  They did much more, with much less.This film needs to be brought back for another go-round, another wide release, so that a new generation can stand up and cheer one of the great stories of American history.",
      "review_date": "2018-10-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An entertaining and compelling biopic that at times becomes a slog with it's 3 hour plus running time.",
      "review_date": "2021-01-21",
      "source": "metacritic"
    }
  ],
  "num_reviews": 15
}