{
    "rating": 8.6,
    "release_date": "1967-04-10",
    "num_reviews": 130,
    "genres": [
        "Drama"
    ],
    "summary": "Beautiful young housewife Séverine Serizy (Catherine Deneuve) cannot reconcile her masochistic fantasies with her everyday life alongside dutiful husband Pierre (Jean Sorel). When her lovestruck friend Henri (Michel Piccoli) mentions a secretive high-class brothel run by Madame Anais (Genevieve Page), Séverine begins to work there during the day under the name Belle de Jour. But when one of her clients (Pierre Clémenti) grows possessive, she must try to go back to her normal life.",
    "reviews": [
        {
            "content": "The cinematography and the acting are the two factors that boost the film the most. The story might lack depth and sometimes it might get longer than it should be, but in all Belle de Jour is enjoyable.",
            "review_date": "2023-03-24",
            "source": "rt"
        },
        {
            "content": "Hypnotically good. I struggled to see what was going on until the very end and irrespective of that I as already enjoying the film. Done expertly and still feels like a film pushing boundaries even all these years later.",
            "review_date": "2022-09-13",
            "source": "rt"
        },
        {
            "content": "\"Belle de jour\" has a reputation that preceded it upon my initial viewing of the film, this being that it is one of the most artfully done and surreal erotic works in all of film.  While the film itself is sexy in it's own perverse way it is more a realistic, if somewhat disturbing, expression of sexual liberation and fantasy in this case of many different individuals.  Not only is Belle de jour (The working name for Catherine Deneuve's character Severine) finding her sexual fantasies finally fulfilled in the brothel house in which she makes her way too after collapsing to her boredom and compliant existence, but also the customers who come to the brothel.  Each has their own fantasies and ideas for indulging in these fantasies with the girls and express it in varied and at times downright disturbing ways.  The film isn't one filled with nudity and pornographic portrayal but with just enough to skin and just enough lingering of the camera to realize what is happening and then we move on to the next event.  It's a masterpiece in this regard, as it captures the disturbing and masochistic tendencies of Severine as Belle de jour who is finally content in her life after becoming a prostitute.  She still has a husband, however physically lacking to her needs, that she loves and doesn't want to hurt and also a moral belief that what she is doing is wrong and she will indeed be punished for it.  The film will meet this fate in a more literal way than one dealing with spiritual punishment as the gangster who has fallen for her shows up at her home and threatens her secret and in a very real way, her entire existence.  The film ends with dire consequences for both Severine's husband and the gangster who is infatuated with her however, Severine herself essentially gets away with her sexual debauchery.  What a great and surreal work where Catherine Deneuve portrays the title character flawlessly and is reminiscent of her character in \"Repulsion\" for Roman Polanski even though both works are different works entirely.  I would highly recommend \"Belle de jour\" for anyone interested in cinema within a serious scope of realizing and appreciating technique and story as well as disturbing and surrealist ideals.  This is a masterpiece by one of the greatest of French Director's Luis Bunuel's works and is thought provoking cinema on a hard to cover and display topic that is indeed captured with passion.",
            "review_date": "2022-08-19",
            "source": "rt"
        },
        {
            "content": "Adapted from the novel by Joseph Kessel, already married housewife of a year, Séverine Serizy (Catherine Deneuve) who happens to be sexually frustrated is unable to be intimate to her respected husband as a result of her past history.  She then enters into a brothel/ escort service using the alter ego name \"Bell de Jour\" hence the title.   As it appears she only responds intimately if men are aggressive towards her.",
            "review_date": "2022-07-08",
            "source": "rt"
        },
        {
            "content": "Wait, her backpack is a cute dog? Yeah, she's still in a child like state of mind or something. Catherine Deneuve is really pretty. In this movie, she looks almost porcelain-like. Like a mannequin or doll. She's like a lost little girl in the world trying to fulfill her s**ual repressed desires. It seems she was lusted over by some random hairy plumber/worker when she was just a kid. Eww. That sequence was so clever. The minute she walks up the steps into the building of where the brothel is, the camera does a quick zoom-in into her face and we catch a glimpse of her past where she was given the body of Christ by a priest when she was a kid, but rejected it. \n\nGod, it's really uncomfortable watching Belle have her first experience not only in the brothel, but having s**. It makes me uneasy. It seems she responds to heavy scolding like a child would. I do have to say though, that scene with the professor who likes to get dominated around was hilarious. The way he takes the whip away from Charlotte telling her, \"No, no yet. Give it to me\" and she's like, \"Oh, sorry\" was hilarious. That asian guy was kind of funny too, even though I didn't know what the f**k he was saying. \n\nMan, people have some really bizarre and weird fetishes/fantasies. Like that one rich guy who wanted Belle to pretend to be his deceased daughter and rest in a coffin. Dressed in a black see-thru gown with a crown of flowers, which btw I really liked that whole outfit she had on. Dude wtf?! That's so dark! Pierre was shot by Marcel and is now in the wheelchair that he saw outside the hospital that one day with Belle. That's some pretty damn good foreshadowing right there. Pierre seems to be blind, can't speak and can't move. I feel like that was Bunuel's dark humor at play because that's just ridiculous of a result from being shot.\n\nReally interesting character study of a movie. Smart commentary on how men might s**ualize and view women as playthings or toys that they can play with whenever they want. And also good commentary on how childhood trauma can scar a person well into adulthood. With that being said, I would not watch this movie again. I don't feel like it's something I would be compelled to watch again. It's pretty bleak, sad and depressing.",
            "review_date": "2022-01-04",
            "source": "rt"
        },
        {
            "content": "One of the great films and amongst the greatest by this master. The story unfolds as a sort of modern fairy tale. But what is very real is the expression of someone's hidden desires and where that can lead. Luminous performances back up the perfect shots and editing to create a true masterpiece. He makes unlikely behaviour and melodrama seem a logical part of the human condition. Almost liberating in that it allows us to accept and understand - and pay for - our own foibles. There are consequences, but ultimately perhaps no judgement.",
            "review_date": "2021-11-30",
            "source": "rt"
        },
        {
            "content": "Like most surrealist works, Belle de Jour is meaningful in a way I don't entirely understand. In pictures like this, the audience must grasp what they can and unite the ideas through whatever compartmentalizing process they are capable of. There is symmetry, connecting ideas, dream logic, things we can put together to try to make some equation of. These are the graspable concepts, whereas some of the more random occurrences may be transcendent, or even completely dissociated. \n\nIs there a puzzle to put together? Belle goes through phases of her prostitution journey. She comes from a marriage to a Ken doll, where curiosity suddenly has her in bed with a candy man, a gynecologist (failed), an Asian businessman with a mysterious buzzing box, a necrophiliac duke, and a nihilistic sociopath she kind of falls in love with. Does that add up to something? Is it running parallel to some classic literature or poetry? Some are from the book, others altered to fit Bunuel's narrative - why? She is trailed by her husband's promiscuous sadist of a friend, who is somewhat responsible for getting her into this seedy brothel. \n\nI appreciate that Bunuel doesn't feel constrained by a heavy reliance on connectivity. There are unthreaded, free floating ideas which don't ever make their way back, except perhaps in the audience's own narrative. However, some of these are questionable. We get a couple flashes to what are likely her younger self, once molested by an older man, another at a Catholic ceremony. I can't see past anything besides us going, \"ooh, so that's why she's this way.\" That just somehow isn't that satisfying for a film claiming not to be judgmental. It offers a slightly ambiguous explanation that maybe detracts from the mystery. This is, after all, a dark and strange journey through a woman's masochist liberation - should anything try to explain that?   The film does feel like an exercise more than an experience at times. Bunuel does tend to have phases (or stages) of a dream in his pictures, but sometimes they are less obvious, as in Exterminating Angel. By the end, it's not entirely clear where we've ended up; it may even be a ‘choose your own ending' scenario. Nevertheless, we get a final shot that shows the horse and wagon which started the picture, a simple full circle unification in an attempt to make things neater than they need to be. Or, perhaps subverting this method by leaving us with anything but neat, which is probably truer. Well, there you go, I just gave you two endings to my review, which is exactly what Bunuel does.",
            "review_date": "2021-05-24",
            "source": "rt"
        },
        {
            "content": "Despite nearly bursting with the strange, unusual, or surreal, Belle de Jour has got to be among the more conventionally structured Buñuel films, a distinction which seems to originate from the literary basis of the source material (an unusual choice for the director who championed so much originality in his screenplays). Still, Buñuel absolutely makes the material his own, introducing key elements to differentiate his interpretation of sexual identity and attraction, painting it as exceedingly irrational, diverse, intermittently perverted, and near universal. The film does not seek objective answers in the motivations of its protagonist, Deneuve's Séverine/Belle de Jour, instead playfully leaving details of her fantasy-fueled desires unclarified, capped off by the film's famous scene of a Japanese businessman presenting a box of unknown contents to the brothel workers, eliciting a range of reactions without revealing their source, and ultimately leaving with visual cues scattered as to his activities but only brief responses to hint at detail; it's relatively unimportant to the overall plot, but vital to Séverine's character development. Particularly well-captured by Deneuve and enticingly strange, Belle de Jour may be the pinnacle of \"slightly surreal erotic dramas\", easily outstripping the less well-conceptualized attempts from other directors, such as Kubrick's Eyes Wide Shut or (somewhat less directly related), PTA's Phantom Thread. Though at points I did struggle to confirm that this was actually directed by Buñuel; after all, I didn't see a single animal maimed or killed. (4.5/5)",
            "review_date": "2021-05-05",
            "source": "rt"
        },
        {
            "content": "Acho que me perdi nesse filme... O povo falava tão bem...mas achei ok. :-x",
            "review_date": "2021-04-10",
            "source": "rt"
        },
        {
            "content": "Came across this as supposedly a \"sexy film,\" however like most of those supposedly sexy films it really wasn't. The main actress is beautiful and I did enjoy the juicy affair plot line in the end, but it wasn't really a film like that. It was more of a psychological drama/thriller like Rosemary's Baby or one of those other horror films from the 70s/late 60s, like a lot of French films. I usually hate most French films bc I don't generally like that genre of film, but this one seemed more believable/well done than most. I hated the ending of this movie, but the rest of the film was pretty interesting. I still don't know if I believe she did all this just from one groping experience as a child, but maybe. I wish the affair part had been more developed so we could see why he got so jealous exactly/steaminess. Film was well casted, enjoyed some of the dream sequences, and the plot was pretty gripping.  Might be good as a film that gets redone nowadays.",
            "review_date": "2020-09-22",
            "source": "rt"
        },
        {
            "content": "Unbelievable cinematography, script and an unforgettable Deneuve.  One can only imagine how much better it could have been with a larger budget",
            "review_date": "2020-08-09",
            "source": "rt"
        },
        {
            "content": "The best of both worlds: Art House and Masochistic psychology case study. Some parts needed better editing but for a surrealist film it is surprisingly accessible. Fascinating to watch how the exposure to being sexually taken advantage of as a child creates the split worlds of sexuality as an adult. Beautifully cast and era defining wardrobes make this a fun film to watch.",
            "review_date": "2020-04-08",
            "source": "rt"
        },
        {
            "content": "provocative, interesting, amazing story! ",
            "review_date": "2019-06-11",
            "source": "rt"
        },
        {
            "content": "The young and beautiful wife of a wealthy businessman is drawn to working anonymously as a prostitute in order to satisfy her masochistic sexual desires. A typically cool and at times uncomfortable drama, impeccably acted by Deneuve et al. Bunuel never explains, but his matter-of-fact direction acts as a corrective to the dreamlike narrative. ",
            "review_date": "2019-06-05",
            "source": "rt"
        },
        {
            "content": "Catherine Deneuve is wonderful in this great study of human character and psyche, that doesn't stay only in the sexual aspect which is the core theme. One of the best Bunuel films.",
            "review_date": "2019-04-21",
            "source": "rt"
        },
        {
            "content": "A pretty blond girl is dating a rich, slick fella. She is kind of a housewife and  I guess she finds her life a bit boring at times. That's why she tries out a career as a prostitute. Not the street kind, but more like a recident girl that you can visit if you know your way around the town of Paris.\n\nMorality and sexuality are the two biggest keywords here. She know it's wrong, but she kinds of like the idea of doing it. It's like a kick.  Very daring film as it's actually 50 years old now. Things you should not talk about and absolutely not add to film are shown and spiced with some bondage erotic scenes and hints. Some seem pretty violent and raw too.\n\nWeird scenes appear several times, often in the mentioned bondage setting or something similiar.\n\nOnly my second film from Bunuel, but my favorite so far. Catherine Deneuve seem pretty perfect for the role and is supported by solid actors too. It's done without music and is pretty straight forward production-wise. It's plain, but fittingly so. The story and the main character is the motor of the film, the subtle surrealism is making it something special.\n\n7.5 out of 10 coachmen.",
            "review_date": "2018-07-18",
            "source": "rt"
        },
        {
            "content": "With its highly intriguing plot on pleasure and satisfaction, and its central character seductively played by Deneuve, Belle de Jour is an unforgettable cinematic experience. Bunuel is definitely at its best in this very sensual and surreal movie.",
            "review_date": "2017-10-27",
            "source": "rt"
        },
        {
            "content": "Very memorable movie with great pacing. The acting was great and it seemed like it could be a deep character study of Belle De Jour. Very depressing movie as well.",
            "review_date": "2017-08-16",
            "source": "rt"
        },
        {
            "content": "This is sure not a errotic theme. It's the melancholia of a severe depressed mind and it's self study.",
            "review_date": "2017-08-12",
            "source": "rt"
        },
        {
            "content": "I only rarely vouch for a classic film to be remade but I would absolutely love to see a modern day take on this delightfully French flick about a woman finding sexual freedom away from her perfect husband and in the arms of shall we say \"less-than-perfect\" paying customers. \n\nThere's a lot to chew on here in terms of content, the film looks gorgeous, and the whole thing breezes by at a perfect pace thanks to astute direction by Bunuel, who easily ranks as one of my favorite French filmmaker.",
            "review_date": "2017-08-01",
            "source": "rt"
        },
        {
            "content": "Belle de Jour is an engrossing personal drama with an innate understanding of human nature, which draws in the audience and makes it hard to turn away from.",
            "review_date": "2017-07-14",
            "source": "rt"
        },
        {
            "content": "Ahead of its time and to this day relevant, Belle De Jour is a masterwork from Luis Bunuel featuring an excellent performance from Catherine Deneuve and consistently challenging the audience's perception of sexuality and morality and the crossover relationship between the two.",
            "review_date": "2017-06-18",
            "source": "rt"
        },
        {
            "content": "A mischievous exercise in surreal eroticism, Bunuel's Belle De Jour is like sexual desire put under a microscope: with a perverse filter.",
            "review_date": "2017-06-16",
            "source": "rt"
        },
        {
            "content": "The premise of a pretty young housewife (Catherine Deneuve) who has dark sexual fantasizes and becomes a prostitute in order to engage in them is interesting, but the execution is lacking, and seems quite dated.  To start with, there is no emotional honesty in this film, it's instead antiseptic and superficial.  Deneuve's acting is poor, displaying all the range of a mannequin.  Director Luis Buñel weaves fantasies directly into the plot, but not in ways that hadn't been done before in 1967, and far from \"surreal\".  There is nothing erotic at all here, and the fantasies seem suspiciously like male fantasies, not female.   I did like how Buñel avoided using a soundtrack, and the creepiness of the husband's friend (Michel Piccoli), but that's about it, otherwise it was a snooze.  It's a little mystifying to me as to how this film is a masterpiece, but I guess to each his or her own.",
            "review_date": "2017-05-28",
            "source": "rt"
        },
        {
            "content": "A bored housewife begins working at a local brothel and soon falls prey to an obsessive client who tries to manipulate her emotionally and reveal everything about her double life to her husband.",
            "review_date": "2017-05-18",
            "source": "rt"
        },
        {
            "content": "A film about prostitution that makes you believe that women want to be prostitutes, that they are \"sexy during the day\" that they comes from a bourgeois background and that they are happy to do this. Not a word about the 99.99% of prostitutes for whom life is a living hell, not a word about these immigrants who come from the \"third\" world to be sold, against their will to rich Americans. They want to make western men believe that all prostitutes are white and look like Catherine Deneuve !  After \"Paris at all prices\" that made you believe that illegal immigrants live in luxury, this french film gives men a good conscience to go see whores. This is sick.",
            "review_date": "2017-04-04",
            "source": "rt"
        },
        {
            "content": "A bored housewife begins working at a local brothel and soon falls prey to an obsessive client who tries to manipulate her emotionally and reveal everything about her double life to her husband.",
            "review_date": "2017-02-04",
            "source": "rt"
        },
        {
            "content": "A simple premise that has lots of insight by Bunuel. It's mainly an interesting dissection on gender. Bunuel also keeps his dreamlike imagery throughout here to really put you in the daze of the protagonist's psyche. Catherine Deneuve is fantastic.",
            "review_date": "2016-10-05",
            "source": "rt"
        },
        {
            "content": "Ugh, I don't know. A bland morality play with a beautiful woman. I love Catherine Deneuve but found this to be mostly a snoozefest, perhaps, I'm very willing to admit, because this sort of thing has been done so many times since. I was actually sort of enjoying the beginning of this, a woman exploring her sexuality and trying to become more comfortable with her past and herself. But unfortunately Bunuel had to ruin it by punishing his lead in several ways and leaving her with a 'curse' by the end. Maybe you had to have been there at the time. Or maybe you just need to be male.",
            "review_date": "2016-10-02",
            "source": "rt"
        },
        {
            "content": "Belle de Jour is an intelligent, hugely entertaining picture not about sex, but about fantasies - and how deep they can go, and how far they can take us.",
            "review_date": "2016-05-19",
            "source": "rt"
        },
        {
            "content": "I don't understand why this film is considered to be great at all, and generally I'm not seeing any reasons given for its supposed greatness other than simply stating that it's great. Is the story good? No, it's pointless and sensational. Is the cinematography good? No, it's dull and forgettable. Is the message memorable/good? No, it's so one-noted and ambiguous that you can't even tell what Bunuel is saying (probably best not to know). This film fails on all the basic elements of what a film should do for me. If you're stretching yourself, you can try to say that the film is a commentary on the mixing of elegant society with base desires. On the less ad hoc level, it is a film that is made to fulfill a fantasy. Much like Séverine's fantasies, it is a dreadfully painful and particularly undesirable fantasy to have.",
            "review_date": "2016-05-15",
            "source": "rt"
        },
        {
            "content": "cinegeek.de Belle De Jour, ein Film, der mich immer und immer wieder heimsuchte. Es ist die Geschichte einer gut situierten jungen Frau, die sich zwei oder drei Tage pro Woche in einem Bordell prostituiert. Vermutlich ist es der berühmteste Erotik Film der Moderne und wahrscheinlich auch der Beste! Das kommt daher, weil Belle De Jour Erotik von innen her versteht. Nicht nur als Anblick von nackter Haut und Schweiss, sondern als Imagination. Wir sehen den Film durch die Perspektive Severines, einer 23jährigen respektablen Ehefrau, gespielt von Catherine Deneuve. Luis Bunuel verbrachte ein ganzes Leben damit, gerissene Filme über das Geheimnis der menschlichen Natur herzustellen. Eine wesentliche Sache war ihm bewusst, welche die meisten anderen Regisseure nie herausfinden würden: Für eine Frau wie Severine resultiert der erotische Aspekt nicht daraus, wer im Raum auf sie wartet, sondern einfach dadurch, dass SIE den Raum betritt. Sex, das macht sie mit sich selbst aus. Liebe ist etwas anderes. Das Subjekt von Severines Passion, das ist immer Severine selbst. Sie führt eine wenige ergiebige Ehe mit einem jungen, gutaussehenden Arzt namens Pierre (Jean Sorel). Dann gibt es noch einen Freund der Familie, den düsteren Henri (Michel Piccoli, der dafür geboren wurde, so zu schauen, als ob er damit etwas bestimmtes andeuten wollte). Auch Henri fühlt sich angezogen von Severine; von ihrer blonden Perfektion, ihrer Reserviertheit und kalten Geringschätzung seiner Person. Einmal weist sie Henri zurecht, er soll seine Komplimente für sich behalten. Severines Geheimnis ist ihr zweites Leben, dass sie in der Welt ihrer Fantasie führt. Es besteht eine Kluft zwischen ihrem geheimnisvollen Lächeln und dem, was sie tatsächlich denkt. Bunuel selbst hält für seinen Fetisch von Füssen und Schuhen auch etwas Raum in Belle De Jour bereit - er versteht, dass ein Fetisch eben nichts weiter ist als ein Fetisch! Severine ist Masochistin und lässt sich gern roh behandeln. Einiges, was sie erregt, wird im Film nicht vorgeführt, denn es gehört ihr allein. Darüber hinaus erleben wir die berühmten Fantasy Sequenzen des Films, in denen Severine ihre Sexualität auslebt. Der Wendepunkt ihres Lebens tritt ein, als sie von einem Bordell hört, in dem Hausfrauen nachmittags arbeiten. Die Adresse bekommt sie von Henri. Severine klopft und eine ältere Businessfrau, namens Madame Anais (Genevieve Page), öffnet. Zunächst ist Severine verunsichert, läuft weg, aber sie kehrt zurück. Madame Anais hat genug Erfahrung, um Severines Bedürfnisse zu erkennen. Sie weiss, Severine braucht eine starke Hand. Es gibt in Belle De Jour keine explizite Sex Szenen. Am meisten blieb mir die Sequenz in Erinnerung, in der ein Kunde eine Box öffnet und den Inhalt den Damen zeigt. Wir sehen nichts davon und verstehen es auch nicht wirklich. Nur eine summende Stimme vernehmen wir... Die erste Prostituierte verweigert den Wunsch des Kunden, Severine auch. Schnitt. Was war in der Box? Die Wahrheit interessiert Bunuel nicht. Es geht um das Symbol: Es muss etwas ausgesprochen Wichtiges für den Kunden gewesen sein. Etwas, dass für ihn eine erotische Bedeutung hatte. Dann kommen zwei Gangster in Madame Anais' Bordell. Mit dem Jüngeren beginnt Severine eine Affäre, die uns ironischerweise zum melodramatischen Finale leitet. Severine fühlt sich von den rohen Strassenmanieren des Gangsters angezogen. Er gehört zu ihrer Phantasiewelt - ansonsten kümmert er sie wenig. Der Gangster selbst kann nicht verstehen, dass sich so eine Frau für ihn interessiert. Wir umso mehr! Luis Bunuel ist einer der grössten Filmemacher aller Zeiten. Ein Surrealist als junger Mann, der die menschliche Natur mit tiefem Zynismus betrachtet - nicht zornig, sondern amüsiert. Er war fasziniert davon, dass unsere Obsessionen eine stärkere Wirkung haben als der freie Wille. In vielen seiner Filme erleben wir, wie die Figuren scheinbar frei handeln - in Wahrheit jedoch nicht. Bunuel glaubte, dass sich viele Menschen früh auf ihre sexuellen Vorstellungen festlegen, um dann ein Leben lang daran fest zu halten. Severine ist so ein Mensch. Sie betont an einer Stelle, dass sie sich nicht zu helfen weiss. Severine ist verloren. Sie weiss, dass sie ihren Mann mit einem Gangster betrog und bereut es resigniert. Doch sie kann eben nicht aus ihrer Haut. Ihr Schicksal scheint vorherbestimmt, so wie das ihres Mannes, der den Gelüsten seiner Frau nicht gewachsen ist. Alles scheint unvermeidlich. Einmal lehnt Severine die speziellen Praktiken eines Kunden ab. Madame Anais nimmt sie mit ins Nebenzimmer, um durch ein Guckloch zu schauen und zu lernen. Es sei ekelhaft, wehrt Severine ab. Dann sieht sie wieder durch das Loch.",
            "review_date": "2016-04-21",
            "source": "rt"
        },
        {
            "content": "Catherine Deneuve was such a belle once.\nI couldn't quite stand the film however.",
            "review_date": "2016-02-12",
            "source": "rt"
        },
        {
            "content": "Since you only come in the afternoons.",
            "review_date": "2016-02-07",
            "source": "rt"
        },
        {
            "content": "Though not as dreamlike as one might expect coming from someone like Buñuel, Belle de Jour is a deeply intelligent, deliberately bizarre look at sexual repression and class structures. Buñuel attributes Séverine's subconscious desires to her upbringing and the rigid social mores cultivated by religious institutions. Though she lives a relatively perfect, upperclass life, she wants something else sexually, something indicative of the ways in which society teaches men and women how to behave and how to perceive each other. Her life at the brothel is an independent entity that satisfies that need, her clients revealing quite a bit about what Buñuel is trying to say about what men and woman have been taught to want. Men want children or sex dolls or subservient slaves that they can abuse and control; Séverine wants to be abused. Buñuel doesn't single out these desires as natural so much as he makes clear that they are learned, decidedly unnatural. The decision to merge reality and her dreamworld is an intelligent one as well, and makes for one of the best portrayals of the almost precognitive nature of dreams I've ever seen.",
            "review_date": "2016-01-28",
            "source": "rt"
        },
        {
            "content": "Certainly one of Luis Bunuel's most accessible works, made all the more fantastic by Catherine Deneuve's sultry performance.",
            "review_date": "2015-10-21",
            "source": "rt"
        },
        {
            "content": "F\n\n8.3\n\n[Luis Buñuel]",
            "review_date": "2015-08-24",
            "source": "rt"
        },
        {
            "content": "This movie was quite different than what I expected, but nonetheless very interesting mainly because of Deneuve's character. She was a very intriguing person that clearly doesn't have a clear pointing view and with all those dreams, it's hard to know what's real and what's not. But still, her performances was very good. \n~August 20, 2015~",
            "review_date": "2015-08-20",
            "source": "rt"
        },
        {
            "content": "Luis Bunuel's Bell de Jour, power seems to grow stronger the more I've seen it.  \nThis is a prime example of Surrealist Film put into complete action. Filmed in 1966, the film is dated. But it is clear that Belle de Jour was way ahead of the cultural curve. At the time of it's release it was considered controversial, perverse, bordering on pornography and shocking. It no longer holds that level of shock for audiences, but it bravely attempts to explores the mind of a female masochist close to 50 years ago when there was no clear understanding available.  Catherine Deneuve, in all her Yves St. Laurent and blond glory, is an upperclass young married woman who has begun to find her marriage boring. Her husband, similar to a sexless Ken doll, obviously holds no erotic connection for her. Distant and cold. Alice  is rather \"removed\" from her own life. Her day is pointless. And, with very clever editing  Buñuel manages to reveal a great deal about her childhood that connects to her adult self. It is clear that she desires a force of eroticism from her husband that is beyond his understanding. When Alice hears about the existence of underground Parisian brothels where lower class housewives earn extra money. She ventures to explore this world. And, it is in this brothel that she discovers and has her sexual desires fulfilled. Alice's reality has already been mixing with fantasy long before she explores the world of prostitution, but the viewer's ability to detect \"reality\" from \"surreality\" has become challenging.  As Alice begins to learn how to assert her power and sexuality as a woman, we are grappling with the differences between her reality and fantasies as much as she.  Buñuel's conclusion offers two endings employing visual and audio editing but don't expect resolution or any clearly defined answer. In the end, it does not matter. The merging of the \"real\" with the \"fantasy\" is the \"surreal\" is, in many ways, an exceptional way to form this void. An individual who only seems to come to life when punished. The character is not intended to be fully formed. Alice is a stunted beauty at the mercy of not only her situation and those around her -- but to her eternal confusion between reality and fantasy. A cinematic masterpiece that continues to stand the test of time and presents an oddly valid connection to the root of masochism. This is essential viewing for anyone who loves film.",
            "review_date": "2015-06-30",
            "source": "rt"
        },
        {
            "content": "I had only seen this once before and it was nice to revisit this masterpiece from Luis Buñuel.  The blu-ray look great and perfectly captures just how stunning Catherine Deneuve is.  She plays a homemaker who is both repressed and bored so decides to become a prostitute, for the afternoons only so as not to interfere with her marriage.  This is a fascinating film and again, another must see for all film lovers.  Check it out!",
            "review_date": "2015-06-06",
            "source": "rt"
        },
        {
            "content": "Quite surreal, it's difficult to keep track of what's happening as real life, fantasy and flash backs are blended together. None of the synopses I've read really capture the feel of this movie. I suppose this movie is more complicated than a couple of lines can lead you to believe. One of those movies that leave you thinking long after it's over.",
            "review_date": "2015-05-12",
            "source": "rt"
        },
        {
            "content": "There is something about glamour that is so ... unglamorous.  Once you get past the pristine mist of designer products, enviably beautiful people, and inexplicable shine (Is it the money? The power? The final hour?), what's left? Someone who carefully dresses their life with opulent panache can never truly be happy; a few too many Benjamins cannot purchase a coherent existence.  Look at all those 1950s housewives: while they might have a husband all the other ladies on the block swoon over, while they might have perfect kids, and while they might have the most picturesque house in the county, behind their cherry red lipstick and gleaming manicured nails is a hollow interior.  Choose style over substance and you'll be left with a designated look, not a feeling.  \n\tSéverine (a luminous Catherine Deneuve in her breakthrough performance) is suffering from such problems.  She has recently married Pierre (Jean Sorel), a nice enough, handsome enough, rich enough surgeon that leaves her well-off but somewhat fatigued.  Her afternoons may as well have tumbleweeds rolling through their mundane rituals, but even when Pierre comes home from work, there is hardly a spark being set off: it seems that once you settle down, you settle down, and if you haven't married a spitfire, you can't expect to be continuously knocked off your feet.\n\tSéverine spends most of her days in the grips of sexual fantasy, mostly sadomasochistic and mostly reprehensible.  We only vaguely know her background, but Séverine's desires to be punished, objectified, and hated act as the gasoline to her sensuous fire.  In a brief flashback, we see her as a young girl disobeying her priest during communion; is it because she is stubborn, barbed, or corrupt? One can hardly say; in \"Belle De Jour\", she is a maiden of glaze that projects more emotion with her slender hands that her face.\n\tIn a casual conversation with friends, the very scandalous idea of prostitution is brought up.  It's the world's oldest profession, but is it as prevalent as it used to be? An outsider makes it clear that, yes, something so taboo is still alive and strong.  The tone of the exchange is hardly serious, but Séverine's dead expression says otherwise.  She doesn't want to say it aloud, but the idea of becoming a call girl brings an adrenaline kick like no other.  She isn't doing anything important in the afternoon; why not entertain herself (and other men) until her husband brings home the daily bacon?\n\tWhen \"Belle De Jour\" turned into an international success in 1967, Luis Buñuel was nearing 70, an age where most directors should be retiring; but at 67, Buñuel is at his most salient and his most stingingly observant.  One might initially expect blatant erotica with a film so sexual at its core, but \"Belle De Jour\" is even sexier than all those immodest \"Emmanuelle\" moneymakers; it holds the power of suggestion like a little girl clinging to an antique China teapot after her grandmother tells her not to drop it.  The film doesn't need, nor give into the urge, to set the screen on fire with slow-motion, sweaty, softly lit love scenes.  As audience members, we expect too much; a screen can blur reality until it turns into a massive smudge.  We've come to believe that if we're watching an action movie, we're going to see some witless but thrilling bloodshed; if we're watching a film deemed to be erotic, there better be some soft-core movement.\n\tBut what if the usual frankness was taken away from us, and we had to use our insight to fill in the extensive blanks? No matter how disappointed our inner 13-year old selves become, not showing something that we want to see is much more affecting than pouring sexuality onto the screen like an unstoppable liquid.  Yet when a film as pointed as \"Belle De Jour\" contains so much mystery and so much surrealism, it's difficult to be completely focused on whether Deneuve will show as much skin as we want her to (spoiler: she doesn't).  Everything seems to have a double-meaning, an introspective question; our lingering arousals are put on hold in favor of trying to make sense of it all.\n\tThere are a few times where Séverine exclaims that she could hardly live if she weren't also moonlighting as a prostitute, but there's something about how she says it that suggests otherwise.  Is she doing it because she's dissatisfied, because she's disturbed, or is it something else? Personally, I think the authority involved is what turns her on.  Her entire life, Séverine has mostly likely been looked at as an untouchable beauty that may as well be an object; people are afraid to approach her, scared that they might somehow morph her astonishing good looks.  But as a lady of the day, men are no longer wary of her.  She is giving her body to their depressing needs, and where most would feel materialized, she feels empowered.  She doesn't have to be known as a surgeon's wife any longer; she is in control of the success of a romp, and being the focus of a man's humiliating passion puts her on a pedestal after acting as an ethereally attractive shadow for so long.\n\tBy the end of the film, though, it's hard to tell what has been real and what has been fake.  Throughout much of its course, the fantasies and the flashbacks are completely separate, and we think we know what is and what isn't reality.  But the conclusion (which would be unfair to tarnish), is so unpredictably bizarre that it offsets everything.  It suddenly becomes a film, open to nearly anybody's interpretation.  That's what has made Buñuel's movies last so long; with their abstract themes, it's hard to truly understand what he's trying to say, but he gives us enough content to keep us intrigued long after we've seen them.  \"Belle De Jour\", as simple as it may seem at first, is knotted in its meaning, and the untangling process may take longer than a few days.",
            "review_date": "2015-03-20",
            "source": "rt"
        },
        {
            "content": "Watching something good,one of my favorite French flicks.",
            "review_date": "2015-03-06",
            "source": "rt"
        },
        {
            "content": "A beautiful, twisted surreal look at fantasy and desire.",
            "review_date": "2015-02-08",
            "source": "rt"
        },
        {
            "content": "Para o mestre do surrealismo Luis Buñuel's quando uma mulher como Severine, vai de quarto em quarto para fazer sexo, a carga erótica não vem de quem está esperando no quarto, mas do fato de que ela está caminhando para ele. O sexo é sobre si mesma. Amor, claro, é outra questão. muitas imagens que cada um interpreta à sua maneira, dificilmente duas interpretações deste filme serão coincidentes. ****",
            "review_date": "2015-02-02",
            "source": "rt"
        },
        {
            "content": "Quien mÃ s podrÃ¬a interpretar el papel de Severine, nadie mas que Catherine Denueve misteriosa belleza gÃ¨lida. PelÃ¬cula del gran director Luis BuÃ±uel sobre la falsa moral de la sociedad tocando temas como el voyeurismo, masoquismo y demÃ s temas tabu en el aÃ±o de su estreno. Inolvidables las fantasÃ¬as de Severine castigada por su marido.",
            "review_date": "2015-01-20",
            "source": "rt"
        },
        {
            "content": "Incredible articulation and artistry.",
            "review_date": "2014-12-25",
            "source": "rt"
        },
        {
            "content": "Belle De Jour explores the conflict of human baseness and social etiquette, through Bunuel's elegant dreamscape. 8/10.",
            "review_date": "2014-12-17",
            "source": "rt"
        },
        {
            "content": "Director Luis Bunuel's masterpiece is one of the most enigmatic films of its period. Erotic but not gratuitous, the film is infused with a certain elegance which seems out of place in the setting of a brothel, where much of the action takes place. Ultimately, it may be that this film is nothing but the fantasy of a bored, sexually repressed housewife, played perfectly by the gorgeous but frigid Catherine Deneuve.",
            "review_date": "2014-10-20",
            "source": "rt"
        },
        {
            "content": "\"It is possibly the best-known erotic film of modern times, perhaps the best.\" - Roger Ebert",
            "review_date": "2014-10-09",
            "source": "rt"
        },
        {
            "content": "Penetrando tanto no inconsciente de sua protagonista quanto no inconsciente da sociedade moderna, Luis Buñuel compõe outra poderosa crítica à hipocrisia e às repressões da ordem cristã-burguesa, lidando com um tabu extremamente forte para sua época e, por que não, para os próprios tempos atuais.\n\nLeia mais: http://cinema-mon-amour31.webnode.com/news/a-bela-da-tarde-%28belle-de-jour%29%2c-de-luis-bunuel-%28frança%2c-1967%29/",
            "review_date": "2014-08-24",
            "source": "rt"
        },
        {
            "content": "an amazingly-acted sexual noir tale of exploration, sadomascochism, and commentary on social and gender relations\nLuis Bunuel explores the life of a woman moonlighting in a brothel to pay off her expenses and discover the underground sex world\nCatherine Deneuve perfectly plays Severine having quite the fantasy of being punished and not being fully satisfied by her husband\nunfortunately being in the oldest profession in the world has downsides of its own; she's shy, afraid of the new lifestyle, and even has a client that becomes very possessive of her\nthis is the life she chose for herself but is the real world more exotic for us or the dreams we conjure up?\neven after 50 years this blend of erotic cinema still provokes our way of thinking and hitting so many levels of what men and women expect from each other\na foreign film that's worth a second glance",
            "review_date": "2014-08-07",
            "source": "rt"
        },
        {
            "content": "Buñuel's elegant and perplexing film is one of his finest master-pieces. Exploring the sexual confusion of a young woman, Belle du Jour is certainly erotic, yet it never comes off in bad-taste, even in its extra-kinky fantasy sequences. It's not a stretch to see this as one of the first films to capture S+M on screen, but it's done in a way that's psychological and enticing in only a way Buñuel could capture. Up there with Polanski's Repulsion as one of the signature feminist films, that happened to be directed by a man.",
            "review_date": "2014-08-03",
            "source": "rt"
        },
        {
            "content": "I give it four stars just for its unique approach to a French woman's dreams and fantasies. Of course Catherine is beautiful and the content was original. It wasn't too racy. 1001 movies to see before you die.",
            "review_date": "2014-07-27",
            "source": "rt"
        },
        {
            "content": "Catherine Deneuve is a sensation in surrealist Bunuel's \"hooker by day\" classic. It's one of those films you'll either love or hate, and I kind of like that.",
            "review_date": "2014-07-24",
            "source": "rt"
        },
        {
            "content": "Interesting Buñuel piece about a woman seeking liberation by being a \"woman of the day\" since she is only available while her husband's at work.\n\nWhat follows is a series of events that takes her down a new road she might not be ready for. Deneuve is excellent in her role. Buñuel offers some classic imagery that he has been famous for.\n\nBut, in the end, you wonder if there is much point beyond Deneuve's journey. And, the ending is left to interpretation. That isn't bad, and is actually the highlight of the film, since it is where the film is set free.",
            "review_date": "2014-07-24",
            "source": "rt"
        },
        {
            "content": "way better than the remake",
            "review_date": "2014-07-22",
            "source": "rt"
        },
        {
            "content": "An interesting psychographic study that isn't as sexy as I thought it would be, but still interesting. French diva Catherine Deneuve gives a great performance in her breakthrough role as a sexually frustrated housewife that ends up in a brothel. The dream scenes are distinctive for surrealistic film-making, but all in all the graphic depiction is rather conventional and therefore bearable for every movie fan.",
            "review_date": "2014-06-23",
            "source": "rt"
        },
        {
            "content": "An erotic masterpiece. Whereas Spielberg was forced into allowing the viewers imagination run wild, Bunuel intends on this as part of the experience of watching the film.",
            "review_date": "2014-06-22",
            "source": "rt"
        },
        {
            "content": "was it all in repressed severine's mind? \nan exercise in surrealism that was an engaging watch (and pretty to look at too).  some credit definitely goes to catherine deneuve and her severine.",
            "review_date": "2014-06-08",
            "source": "rt"
        },
        {
            "content": "So, I ended up watching this movie today and I feel scared. \"Belle de Jour\" is perhaps Bunuel's most accessible work but, it still is a remnant of a monstrosity, with a subject matter that would make even the modern viewer cringe. Belle, Severine is a woman haunted by her own desires, and curiosities. Here, Bunuel decodes the secret to an erotic material in full, that the best eroticas are don't show more, they leave more to the imagination and titillates us through curiosity. The film explores the realities and fantasies of Severine and in doing so, often times it seems like Bunuel is laughing at the entirety of the bourgeois, making fun of them. So, when the people walk into the whorehouse where Severine finds work, he contrasts their real life descriptions with their sexual fantasies, creating scenes that on the surface look like they were meant to showcase the fall of Severine, but, seem like an attempt to make fun of the people who are using her. Her fantasies, her turn ons are all obscure, scary almost and yet, they are real when they are shown in the film, perhaps because they are so important to the protagonist. At the end, when the carriage bell rings, you are one with her, and the film has come a full circle. Only you are left uncomfortable with what you have viewed. The actress gives a memorable performance, and her beauty, almost unmarked seems to be the perfect face of this kind of film. Even in the scene where she is tied, with blood coming out of her face, there is a sort of innocence, a sort of unchanging quality in her that makes it all seem alright. The film borders on the haunting sometimes, and in the end, it is almost scary. There are moments which remind me of some characters I love. This woman walking past Severine as she watches the door leading to the whorehouse filled with doubt, exhibits a disdain towards her and immediately reminds me of the mysteriousness of Arnold Friend. I do not know if the name of Anais, given to the businesswoman in charge of the whorehouse was a homage to Nin, but, sometimes it feels like this will be the one film that comes closest to depicting the intensity with which the writer wrote.",
            "review_date": "2014-06-02",
            "source": "rt"
        },
        {
            "content": "Full of the intellectual mischief of Luis Buñuel, the striking visage of Catherine Deneuve, and a sexually uninhibited plot, this is a droll, sophisticated, continental film which stylishly revels in psychological insight and commentary on manners.",
            "review_date": "2014-05-13",
            "source": "rt"
        },
        {
            "content": "Buñuel delivers his sexy masterpiece elegantly. Deneuve is a goddess",
            "review_date": "2014-04-15",
            "source": "rt"
        },
        {
            "content": "A bored, frigid housewife with vivid masochistic dreams becomes a prostitute to add excitement to her life. Boy, does she get it.",
            "review_date": "2014-03-26",
            "source": "rt"
        },
        {
            "content": "It was inevitable that Bunuel would make an erotic film.  It was also inevitable that it would be one of the best.",
            "review_date": "2014-03-20",
            "source": "rt"
        },
        {
            "content": "An interesting look into an unusual character, Severine/Belle is compelled by her subconscious desires to pursue another life outside her rather uneventful everyday married life. What we come to learn during the film is that she has a history of defiance and forbidden pleasure, which has shaped her into to the quietly repressed but deeply sexual person she is now. Those two elements interplay wonderfully and Severine sees her marriage (seemingly?) get better when she unleashes her inner desires. The film features a lot of contrast as a tool to explore its story, most notably including Severine's daydreams into the narrative. What I wasn't happy with is the gangster storyline which takes the story into a place which felt out of place in this psychological drama and some on the nose dialogue, but the overall impression is good, just not spectacular. Bunuel isn't overtly visual but shows everything that needs to be seen and despite some pacing issues around the middle and particularly the ending, Belle de Jour keeps the audience mostly interested. Catherine Deneuve is perfect as Severine, but the others play it a little flat, at least for me. It's certainly an interesting film, but is a little content light across the board, most notably in story.",
            "review_date": "2014-02-08",
            "source": "rt"
        },
        {
            "content": "A wonderful parable of love, relationships and the place in both for fantasy and imagination. Certainly much more enjoyable to watch, not to mention better acted and directed, than recent delvings into that subject matter, like Lars von Trier's Nymphomaniac (though that wasn't the latter's point). Intensely beautifully photographed, with wonderful performances, most especially by Catherine Deneuve. You can't go wrong with 60's and 70's Bunuel, that's for sure.",
            "review_date": "2014-02-06",
            "source": "rt"
        },
        {
            "content": "Catherine Deneuve stars as Severine, a bored bourgeois housewife who has a rather frigid sex life with her husband. She assumes a double life and goes and works for a high class brothel where she feels safe to explore and satisfy her prolific sexual fantasies.\n\nFor such a sexual storyline, the film is rather chaste and this is its advantage. Sex is never shown on camera and the fetishes of her clients are hinted at and left to the imagination. A great scene has her presented with a buzzing box by an Asian client. The only thing shown is the look on their faces which give little away and the audiences imaginations are left to run wild.\n\nSeverine's dual life is upset when she falls for a gangster client who infracts into her respectable life with dire consequences.\n\nIt is certainly a film of its time. Highly stylised in the look and also the attitude of the mid-sixties. It could be mistaken as a take on a male fantasy, but the film never completely subjugates the women and it is Severine who is experimenting with her own sexuality and no character's psychology is stamped out as this or that.\n\nIt's a beautifully complex film, bizarre at times, but never simple.",
            "review_date": "2014-02-03",
            "source": "rt"
        },
        {
            "content": "Genial, obra maestra!",
            "review_date": "2014-02-01",
            "source": "rt"
        },
        {
            "content": "A compelling film that showcases the fine, yet never blatant line between sex, love and one's own desires.",
            "review_date": "2014-01-11",
            "source": "rt"
        },
        {
            "content": "http://filmreviewsnsuch.blogspot.com/2014/01/belle-de-jour.html",
            "review_date": "2014-01-07",
            "source": "rt"
        },
        {
            "content": "Now this is the kind of film that comes to my liking.",
            "review_date": "2014-01-01",
            "source": "rt"
        },
        {
            "content": "bildigimiz bunuel ve aristokrasi elestirileri.",
            "review_date": "2013-12-24",
            "source": "rt"
        },
        {
            "content": "Catherine Deneuve's inexcusably wooden acting dooms this from the moment of casting.  She is the Victor Mature of female players.  Imagine, say, Anna Karina in this role!",
            "review_date": "2013-12-04",
            "source": "rt"
        },
        {
            "content": "I've just been reading all the reviews and ratings of the top critics that have seen Belle de Jour, and some of them had rated this movie very high. I am unable to share the same rating because I did not like the movie and I could not waste a good review on it.This movie was nothing special. It was actually boring. Some scenes pretend to be real but it was not defined She did not wanted to be intimated with her husband, but then she want to prostitute.huh? I never could understand this part. I never could trace when she was dreaming or when it was real in the movie.I have to say, maybe someone more familiar with Bunuel's work could understand this movie. I think even if Bunuel could have thrown any crap on the screen, his fans would find it brilliant.Sorry I did not.",
            "review_date": "2013-10-23",
            "source": "rt"
        },
        {
            "content": "Libelo do Buñuel à repressão sexual é bem desenvolvido e entrega uma grande atuação de Catherine Deneuve.",
            "review_date": "2013-09-29",
            "source": "rt"
        },
        {
            "content": "More psychological than erotic, maybe seeing it today you lose a bit of the original strength while remaining a great movie. The photography and dialogues are beautiful, the end and the beginning are connected by theprotagonist's morbid imagination. Very good.",
            "review_date": "2013-09-21",
            "source": "rt"
        },
        {
            "content": "More psychological than erotic, maybe seeing it today you lose a bit of the original strength while remaining a great movie. The photography and dialogues are beautiful, the end and the beginning are connected by theprotagonist's morbid imagination. Very good.",
            "review_date": "2013-08-27",
            "source": "rt"
        },
        {
            "content": "It is pointless to find any logical explanation for Belle de Jour.  This is clearly not Luis Buñuel's intention. The merging of the \"real\" with the \"fantasy\" is the \"surreal\" and the perfect way in 1966  to attempt to explore such a culturally challenging topic as The Female Masochist.\n\nBelle de Jour as perfect example of an accomplished artist who desires to make his audience think and contemplate what has been seen. A key desire that our culture seems to be losing at a horrifying pace. As a world culture, we appear to be losing the ability to actually think. \n\nWithout question, this is one of if not the most important Surrealist films ever made. A must see!",
            "review_date": "2013-08-04",
            "source": "rt"
        },
        {
            "content": "there is a point at which the film stands still a bit too long, but taken as a whole its commentary on the human psyche is very interesting and effective.  of course, deneuve is very good, as are each of the supporters, and the mapping of the film was well done.  a very good film.",
            "review_date": "2013-07-30",
            "source": "rt"
        },
        {
            "content": "I love Bunuel's view about humanity, hypocrites by nature",
            "review_date": "2013-07-11",
            "source": "rt"
        },
        {
            "content": "Not a bad choice for a Buñuel virgin. I thoroughly enjoyed seeing his masterful manipulation of his surrealist techniques and his tasteful execution of \"sexual depravities\" without having to resort to showing any nudity or crass sex scenes. At the end of the film, it's interesting to note that in a way, this is like a mix of Inception, The Housemaid, and Mulholland Drive, but satisfyingly less complicated. It doesn't mean that it won't leave you scratching your head, as Buñuel decides to keep this film open to your own interpretations. \n\nOn the film's technical aspects, there is no background music except for the all-important bird/bell sounds; and the cinematography & lighting are not as visually satisfying as other films i've seen. It's probably intentional on Buñuel's part, I wouldn't know.. but it doesn't affect the quality of the film at all. The smooth/uninterrupted editing, I think is nicely done because the transition between Belle's fantasies & realities looks seamless which adds to the film's puzzling \"which is which\" reality. But the \"fantasy\" scenes, in my opinion, are just excellent in its simplicity, not too much garish artsy fartsy touch, but enough technical creativeness to give the audience a pure surreal treat. \n\nCatherine Deneuve IS Belle de Jour. I just love her in this one.",
            "review_date": "2013-06-15",
            "source": "rt"
        },
        {
            "content": "quite possibly Bunuel's masterpiece",
            "review_date": "2013-06-04",
            "source": "rt"
        },
        {
            "content": "Yes, it IS one of the most erotic films. Of course with Bunuel's dose of sarcasm.",
            "review_date": "2013-05-23",
            "source": "rt"
        },
        {
            "content": "She's a  wealthy but bored  young woman married to an attractive and busy husband.  She lacks passion for him and starts to have strangely sexual fantasies and daydreams. One day someone tells her about a whorehouse in innocent conversation and feels intrigued.  She then out of curiosity investigates and gradually agrees to be a prostitute from 2-5. The rest is suspenseful and tragic showing a wide gamut of human sexuality. It must have been SHOCKING to 1960's audiences.   French babe Catherine Deneuve is SENSATIONAL in the lead role. She is dispassionate from her own sensibilities, implying that Deneuve chose to play the character as a mentally ill person which is brilliant.",
            "review_date": "2013-03-09",
            "source": "rt"
        },
        {
            "content": "Amazing, this left me stunned. A masterpiece and a landmark in french cinema.",
            "review_date": "2013-03-02",
            "source": "rt"
        },
        {
            "content": "Hardly a premise at all, this film really didn't have much to say and kept talking about it over and over again.",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "Best not to try and watch when tired...will only confuse you more.",
            "review_date": "2013-01-26",
            "source": "rt"
        },
        {
            "content": "Luis Buñuel, the greatest voice in surrealist cinema, has a unique style and technique as a filmmaker: the always-revelatory interrogation of dreams, the magisterial triumph of mad love, and as in all of his films, the 'systematic derangement of the senses' professed by Rimbaud. In the world of Buñuel, dreams rule one's thoughts; they send one plumbing the depths of consciousness, in pursuit of the unknown. In Belle de Jour, Séverine lives in an almost fictional reality, attending the brothel as work during the afternoons, and living a bourgeois conventional life at night. She is soon torn between both realities, as waking life and dreamless sleep begin to merge and confuse one another, to the point of madness. Marcel is one of Buñuel's most unforgettable characters, colorful and poetic in appearance. His gangster suave, flamboyant dress, and ruthless personality are packaged so perfectly well by actor Pierre Clémenti, that it truly makes him one of the most interesting characters in cinematic history. Before there were gold grillz and rappers with platinum caps, there was Marcel. My golden cap is proudly inspired by this film and the character of Marcel as well. 'Belle de Jour' is one of Buñuel's greatest and most accomplished works: true Art in the highest sense of imagination. Ranked within at least my top ten favorite films of all-time.",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "A well made film by Luis Bunuel.",
            "review_date": "2012-12-28",
            "source": "rt"
        },
        {
            "content": "Rating: 3 stars\nArthouse Rating: 3.5 stars\n\nLuis Bunuel created the colorful and seductive work of Belle de Jour. An emotionally but not sexually pleased woman, who goes into prostitution, and also has several bondage fantasies. The film opens with one of these fantasies, and similar to the opening suicide scene in Harold & Maude, we are informed it isn't reality. Everything does feel real enough though, the genuine development of the character \"Belle de Jour\" was paced professionally. The tension between her and an obsessive client brings a true turning point in the story.\n\nThe film had you sucked in the whole time, it played with your mind, and pushed the borders. While it did expose some taboos to the screen, I believe it didn't go to far, as to making the viewer turned off. While it was entertaining, I believe the end was unexplained. Bunuel had the potential to pull anything out during the full film, but the ending was delicate, and it ended up coming out of nowhere. I have no true explanation, while it did stick to you, I think it'll result in the movie being forgotten in the mind. The core of the film is toned, but there was no outer result.",
            "review_date": "2012-12-26",
            "source": "rt"
        },
        {
            "content": "I guess this as little surreal as it gets for Bunuel.\n\n1) Observation: Catherine Deneuve is a great actress. And, she's really really hot.\n2) Question: Is it Dream or Reality?\n3) Answer: Who cares?\n\nFor some months now, Luis Bunuel starts to grow in my appreciation. He's a pretty neat director, who not only makes interesting films but also challenging ones.\nIt's films like that, that I describe as entertaining, although Bunuel may not agree with this result. He doesn't aim for entertainment, maybe not even for provocation or critic but just to use the medium as sophisticated as possible. He never gets more normal than in Belle de Jour, but still, in the end we can't tell if it's dream or reality.\n\nThis is the kind of film, we film buffs love. And we love them for a reason. Bunuel treats us like a thinking person. Modern blockbuster directors would create sophisticated gimmicky dream worlds, full of CGI eye candy. But would they make a better movie or a movie that better conveys what he wants to tell us. Probably not.\n\nThis is psychoanalytical storytelling in the tradition of Schnitzler, put on screen in the purest possible form. Not so much visual storytelling than a great use of storytelling tools that originated in literature. But still as freaky and creepy and morbid as we love our Bunuel.",
            "review_date": "2012-12-13",
            "source": "rt"
        },
        {
            "content": "Astounding work by Catherine Deneuve showing here her true star power and talent and Luis Bunuel's careful screenplay and pacing make this film both challenging, tensely paced, sexually explorative (especially for this time period) and well worthy of multiple viewings as its ideas and themes of blurring reality with fantasy only get stronger with age.",
            "review_date": "2012-12-07",
            "source": "rt"
        },
        {
            "content": "Erotic & mind bending. It looks like Godard but thinks like Buñuel.",
            "review_date": "2012-11-18",
            "source": "rt"
        },
        {
            "content": "Bunuel è il poeta cinematografico  dell'ambisguità e ancora una volta punta il dito contro il bigottismo ipocrita della borghesia in una storia in cui si confondono sogno e realtà, dove il primo è spesso a servizio del secondo. Bellissima Catherine Deneuve. Definire \"erotico\"  e scandaloso un film in cui si intravede un fondoschiena ai giorni d'oggi risulterebbe proprio ridicolo.",
            "review_date": "2012-11-16",
            "source": "rt"
        },
        {
            "content": "no es la mejor pelicula de buñuel, es la unica conclusion a la que puedo llegar al ver este film...",
            "review_date": "2012-11-05",
            "source": "rt"
        },
        {
            "content": "Bunuel, possibly the greatest director of all time (behind Jean Vigo, for me) has made a film I never expected him to make. \"Belle de Jour\" is an inward film as a whole, but outward within itself. It is absolutely perfect. Inward, being Bunuel just wanting to scope the modern feminine desires of the modern bourgeoisie, which is internal as a general focus of film. The way I mean it's outward is that Severine only has the internal meaning to pursue her dark fulfillments, but as she eventually does, she finds herself completely open within Bunuel's vision. It's all through the vague lens of Bunuel, and it's absolutely stunning (and French).",
            "review_date": "2012-11-03",
            "source": "rt"
        },
        {
            "content": "With all the praise, I found Belle de Jour to be great but a little disappointing. As a piece of erotic cinema that's sexy and doesn't show a single moment of flat out nudity, this is top notch. If that sounds boring, then don't watch it. Severine is a frigid young wife who sleeps in a different bed than her husband. He doesn't always want to have sex with her, but even when he wants to lie down with her she tells him no. So why does she choose to be a prostitute? There are a couple of flashbacks that show her uncle molested her and the day she refused to take the bread at her first communion. I wish there were more of these. I felt like it was starting to explain Severine, but they just stop. We also get to see her sexual fantasies, such as her husband tying her up and whipping her, which actually comes back and bookends the film with Severine dreaming that her husband is no longer paralyzed and they are on the same carriage riding on the same road once again. That's the whole point of this film, I guess. Sometimes you act on things that make you feel good instead of things that are right. Severine wasn't too bright by going to the up-scale brothel that Pierre's friend, Henri, tells her about. So go figure when he finds her there one day. There are three clients that we see Severine with. One is a strange man who wants to roleplay as if he's her employee who has done a bad job. Another is a fat asian man who wants god knows what. And then there's the boy who falls in love with Severine who becomes angry when she leaves the brothel and he's jealous of her husband. This is why he shoots him in the end. And Henri comes by to tell Pierre exactly what Severine has been doing. Pierre's paralyzed and deserves the truth as to what happened. If there was more characterization and motives behind Severine's character then I probably would have absolutely loved the film. But as is, it's on the way to greatness then stops when it's nearly there.",
            "review_date": "2012-10-19",
            "source": "rt"
        },
        {
            "content": "One of the most amazing surrealistic film after Un Chien Andalou, It's so beautifully directed, every scene in the film blended so well together. The acting was so natural, Catherine shines as Severine. There are so much subtext and sexual innuendos but yet there is nothing graphic. I can't express how much I appreciate the direction of Bunuel. One of the best films from the French Cinema.",
            "review_date": "2012-10-04",
            "source": "rt"
        },
        {
            "content": "It's sleazy in the classiest way possible. Buñuel explores a woman's repressed fantasies with his signature, dream-like style.",
            "review_date": "2012-09-27",
            "source": "rt"
        },
        {
            "content": "Outstanding Denueve as the backbone of this poetic but confusing blend of reality and surreal.Shall not miss it.",
            "review_date": "2012-09-26",
            "source": "rt"
        },
        {
            "content": "The best thing of this film is that Bunuel created a surreal; and open-to-interpretation story with rather simplistic imagery.  No wonder it is a classic.  I am debating between choosing this one or \"That Obscure Object of Desire\" as my tavourit Bunuel long film.",
            "review_date": "2012-08-29",
            "source": "rt"
        },
        {
            "content": "I wasn't sure what to make of this as it was first starting out, and thought I'd perhaps let myself in for one of those 'World Cinema' films that is more about titillation than depth. As it is, this is actually an excellent film and one I may even rate higher upon another viewing. I now get what all the fuss about Catherine Deneuve is about, and I found this film surprising and sad.",
            "review_date": "2012-08-16",
            "source": "rt"
        },
        {
            "content": "Guess it was avant garde back then in 1967. Perhaps too much enigmatic stuff even for the French.",
            "review_date": "2012-08-07",
            "source": "rt"
        },
        {
            "content": "Deneuve is great here.",
            "review_date": "2012-07-28",
            "source": "rt"
        },
        {
            "content": "Another proof that people living in the 60s and 70s were a bit perverted (and the French particularly so). A great work of a deranged mind.",
            "review_date": "2012-07-28",
            "source": "rt"
        },
        {
            "content": "Belle De Jour is a subtle, enthralling movie that explores the divide between lust and love, elegance and depravity. There is a mystical sort of enchantment that carries through the film, which is boosted by its well placed surreal moments, which are always harkened by the tinkling of bells. Very well directed; the story is crafted with masterful skill.",
            "review_date": "2012-07-12",
            "source": "rt"
        },
        {
            "content": "The late 60's/early 70's were an emancipatory time for the depiction and discussion of issues regarding sexuality in film.  France was one of the first countries to take greater storytelling risks in this regard, and even to this days many of those films remain highly compelling.  Luis Bunuel's classic 1967 classic \"Belle De Jour\" is a terrific film that displays the shift during the openness that was creeping into film artistically and in an engrossing fashion.  The film depicts the story of a bored, beautiful housewife (Catherine Deneuve) who decides to work as a prostitute during the day while her husband is at work.  While the film could have veered into exploitation easily with a plot of this ilk, it stays well-crafted throughout the running time.  Deneuve's performance in particular gives the film a huge jolt of energy; her character Severina is the sort any actor would be delighted to explore, as her transition from a timid woman with a secret desire for unorthodox sexuality into a strong-willed individual and then into a woman who sees her secrets erode the life she has built, the range of the role is vast.  Deneuve handles it skillfully and the changes the character experiences always feel organic and natural.  I also felt the way the interaction with the other girls in the brothel was treated like routine work chatter was interesting.  The film takes a huge shift in tone the last 30 minutes which might be jarring to some, but it makes logical sense in the manner in which it plays out.  Despite the lurid topic, the sexuality in the film is not at all graphic;  Severeinas fantasy sequences will lightly shock some, but there isn't much here that hasn't surfaced in a PG-13 film.  The thing that makes this film still very watchable is that it tells it's story very well, and uses suggestion rather than non-subtle graphic imagery to illustrate that story.  The overall effect is still entrancing.",
            "review_date": "2012-07-12",
            "source": "rt"
        },
        {
            "content": "A shocking examination of sexuality in its time, and both thought-provoking and unsettling.",
            "review_date": "2012-06-09",
            "source": "rt"
        },
        {
            "content": "Another on my list of \"finally seen.\" Deneuve is fantastic and fantastically gorgeous in her signature role. One of Bunuel's best and most accessible. Sexy and disturbing.",
            "review_date": "2012-05-26",
            "source": "rt"
        },
        {
            "content": "Visually definitely worthwhile, but unfortunately lost it's social impact due to the oversexualization of our society.",
            "review_date": "2012-05-19",
            "source": "rt"
        },
        {
            "content": "Of course repression and perversion (like repression and fantasy, or repression and liberation) go together.  But, more importantly, they depend on property--as Bunuel and this film know well (unlike critics/intellectuals who may know surrealism or Freudianism, but don't know communism/Marxism).",
            "review_date": "2012-05-15",
            "source": "rt"
        },
        {
            "content": "This was a very elegant movie to start off the weekend. Iconic and provocative without showing too much skin. Catherine Deneuve delivers so much with so little",
            "review_date": "2012-05-05",
            "source": "rt"
        },
        {
            "content": "Perfect direction and performances make this an unmissable exercise in French New-Wave's underbelly.",
            "review_date": "2012-05-03",
            "source": "rt"
        },
        {
            "content": "Bunuel's Erotic-Surrealist masterpiece...",
            "review_date": "2012-04-21",
            "source": "rt"
        },
        {
            "content": "Belle De Jour \r\nDirected by: Luis Buñuel\r\n\r\nThe version I watched was U.S. version presented by Martin Scorsese. This film, which is based upon the novel of same name by Joseph Kessel from 1928. Belle De Jour (French for prostitute, who works during daylight). Catherine Deneuve plays Severine Serizy, a humble housewife, who has fantasies and fetish about bondage.\r\n\r\nI have never watched any of film by Luis Buñuel, hence I should state here, that I was very much carried away by the photography work on the film, the surrealist-approach. Though this movie leaves us ponder over its climax, which is too complex to understand, but based upon hints mentioned in the beginning, anyone can easily understand this. \r\n\r\nAs Luis would portray religion in most of movies (I read some of his interview), he similarly uses brief clip of Severine being baptized, before she embarks upon her new profession of prostitution (which to me seemed as if she is having beliefs conflict within herself).\r\n\r\nAll other characters seem to understand the nature of the film, thus they have worked satisfactorily in the movie. \r\nA promising movie, not to be missed.",
            "review_date": "2012-03-31",
            "source": "rt"
        },
        {
            "content": "At least this time, Bunuel had a narrative storyline with only surrealist images peppered in.",
            "review_date": "2012-03-26",
            "source": "rt"
        },
        {
            "content": "I'm probably one of the few who was just bored.",
            "review_date": "2012-03-24",
            "source": "rt"
        },
        {
            "content": "4.5: Criterion certainly knows what they are doing.  One could play the loop of the shoes walking up stairs over and over again in a museum and it would not seem at all out of place, but this is of course true of many sequences in Bunuel pictures.  It looks incredible on Blu-Ray, but this is exactly what one would expect.  The story is unforgettable as are the characters.  Deneuve is perfect in her role as well.  She is just the right blend of vulgar and proper to seem effortlessly sexy and elegant throughout.  I really hope Criterion releases That Obscure Object of Desire on Blu-Ray sometime in the near future.  Early Bunuel is great, but I'd be hard pressed to choose between the two periods.  One could definitely argue that he got better with age.  He didn't lose his fetishes though, even if they are more subtle and polished.  They are also surrounded by and incorporated into a more conventional style and story.",
            "review_date": "2012-03-13",
            "source": "rt"
        },
        {
            "content": "A wealthy but bored newlywed, eager to taste life to the fullest. High five Bunuel.",
            "review_date": "2012-03-01",
            "source": "rt"
        },
        {
            "content": "One of cinemas greatest surreal films.",
            "review_date": "2012-02-12",
            "source": "rt"
        },
        {
            "content": "My favorite part was the most eloquent use of the word \"dumper\"",
            "review_date": "2012-02-10",
            "source": "rt"
        },
        {
            "content": "What made Luis Bunuel such a timeless film-maker, was his acute sense about the nature of the human condition, the animalistic base of man, and the veneer of social etiquette...Belle de Jour, while not in any way his magnum opus, is a prime example of the director's extraordinary talents...",
            "review_date": "2012-02-08",
            "source": "rt"
        },
        {
            "content": "Catherine Deneuve stars as a young housewife with masochistic fantasies who feels compelled to work as a prostitute during days while her husband is at work.  An ambiguous, dreamlike ending caps this subtle, psychologically complex drama.",
            "review_date": "2012-02-06",
            "source": "rt"
        },
        {
            "content": "Beautiful, funny, sad, weird.",
            "review_date": "2012-01-21",
            "source": "rt"
        },
        {
            "content": "At the beginning seem confusing. However, this film managed to make something different, unique way, a curious and gives good results for the whole, of course adjusted to the year of production.",
            "review_date": "2012-01-16",
            "source": "rt"
        },
        {
            "content": "is a fascinating cinematic achievement that dares to connect Deneuve's porcelain beauty to a world of bourgeois rebellion. - Cole Smithey",
            "review_date": "2012-01-14",
            "source": "rt"
        },
        {
            "content": "Finally viewed the international classic \"Belle De Jour\" .This story has Deneuve as a bored young socialite rich housewife named Severine who has it all, but the problem is she can't get no sexual satisfaction with her husband a doctor. Her only escape is to daydream of odd and rough sex of being tied up and playing rough. So finally she decides to take up a job as a prostitute in a brothel house! And this new secret life has it's good fun moments, but it has it's negatives and real down parts. As love is found thru tragic means still the life of fantasy and erotic lust is not what it seems for Severine. Overall good erotic fantasy film that showcases how sexy daydreams can lead to love while paying a price.",
            "review_date": "2012-01-11",
            "source": "rt"
        },
        {
            "content": "Bunuel is a director who knows that a great deal of eroticism comes from our dreams and subconscious desires.",
            "review_date": "2012-01-11",
            "source": "rt"
        },
        {
            "content": "A historical landmark, and a fully fledged examination of human eroticism, but not necessarily entertaining to watch.",
            "review_date": "2012-01-01",
            "source": "rt"
        }
    ]
}