{
    "rating": 9.4,
    "release_date": "1967-05-10",
    "num_reviews": 470,
    "genres": [
        "Western"
    ],
    "summary": "In the Wild West, a murderous outlaw known as El Indio (Gian Maria Volonte) and his gang are terrorizing and robbing the citizens of the region. With a bounty on El Indio's head, two bounty hunters, Monco (Clint Eastwood) and Col. Douglas Mortimer (Lee Van Cleef), come to collect the prize. Upon their first meeting, the two men view each other as rivals, but they eventually agree to become partners in their mutual pursuit of the vicious criminal.",
    "reviews": [
        {
            "content": "I like this one better than a Fistful of Dollars, and it only got better from here with the trilogy. The villain had depth to him and once again, Clint Eastwood's screen presence and Ennio Morricone's score are outstanding and beautiful! The final duel, the scenery, the tension between characters, it all works! This is classic filmmaking and I'm glad that I gave all 3 movies a try instead did just skipping to The Good the Bad and the Ugly. It will be a sad day when Clint Eastwood passes on but he will always remain a legend in the world of movies and rightfully so. Good directing from Serio Leone as well!",
            "review_date": "2023-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More like a fistful of grand more.  Hahaha.",
            "review_date": "2023-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another stylish Sergio spaghetti western classic.",
            "review_date": "2023-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Leone is a master of his craft and it shows in each of his Dollars movies",
            "review_date": "2023-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lacks some of the brooding intensity of its predecessor, but For A Few Dollars More excels thanks to wonderful direction, visceral storytelling and a great on-screen pairing between Clint Eastwood and Lee Van Clee.",
            "review_date": "2023-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another cool and quite enjoyable western by the great Sergio Leone.",
            "review_date": "2022-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lee Van Cleef gets a chance to be a cool hero with Clint Eastwood in a stylish and epic western",
            "review_date": "2022-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clint Eastwood spaghetti westerns never disappoint.  One thing I particularly like about these quality fiction movies that's often overlooked is that they're normally based on actual principles that people faced in the Old West, and there's historical validity in the premises of the movies.  \n\nThis movie is about bank robberies done by Mexican banditos.  When the West was being settled, territorial disputes over the land with Mexico were often rooted in the difficulties towns and forts had in the ability to protect citizens from outlaws.  The Mexican seat of government was very far to the south, and Mexico would typically not send anyone to protect the settlers from bandits and resentful Native American raids.  Banks could be robbed easily, taking everyday people's money, which is why this is a common theme in movies like this.  This movie is one of many that illustrate why so many in the North American West grew resentful of Mexican rule, and eventually started rebelling against Mexican authority and petitioning to become American.  The towns had practically no law enforcement being sent from Mexico to protect money and property, but the Eastern United States was sending settlers in droves to strengthen the settlements with more people.  When you hear resentful Mexicans claim that they own the U.S. or that it stole this land from them, you can see even in works of fiction why the westerners' sympathies were with the Americans—who improved law and order.",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A major improvement on Fistful. The plot is actually coherent, the dubbing is much less awful (still not amazing), and the set design and music are still excellent. The directing also feels much more intentional here and uses interesting angles and symbolism to change the mood of each scene.\n\nThe partnership/rivalry (AKA dick-measuring contest) of Clint Eastwood and Mortimer is funny and brings a lot of humanity to the characters. Their eventual \"friendship\" actually feels earned instead of forced, and it's a lot more engaging than the forced romance of the first film.\n\nIt still suffers from some of the same issues that plagued its predecessor, mainly dragging on about 20 minutes too long and having a bunch of fucking Italian people wear brownface and do awful Mexican accents. But other than that, it's pretty enjoyable.",
            "review_date": "2022-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Good, the Bad and the Ugly is maybe the best western ever.  For a Few Dollars More was one of the worst. The plot is weak or horrible and the action was boring and slow but the setting was good in Texas and Mexico even though yhr the filmed in Italy.",
            "review_date": "2022-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film contains more of the same from the mysterious man - I love me some C. Easwood - mean and moody etc. There's something charming about the budget English dubbing (from the original Italian, I believe) and (if anythng moreso) the instrumental, sometimes quite high pitched music played in the background. It is quite atmospheric and I enjoyed the battle or confrontation scenes. I think I liked that there are a number of young children and babies present in various scenes featuring the local villagers, giving an extra sense of urgency and fragility in terms of the innocents caught in the cross fires.\n\nI'm not sure I'd say its as good as the original 'Fistful of Dollars' film but its still a decent watch and I'd recommend it on that basis.",
            "review_date": "2022-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone and Clint Eastwood reunite for the second of the Man With No Name trilogy and this one takes all the good of the first film and amplifies it with a script Leone himself thought up!  \"For a Few Dollars More\" teams up Clint Eastwood and Lee Van Cleef as two bounty killers out for the same bandit, each for their own reasons.  First of all, the film picks up after the first film and continues the exploits of the \"Man with no name\" and is filled with amazing set pieces and beautifully choreographed gunfights throughout an original take on the revenge motif.  The film is filled with great and truly stylish sequences and filled with witty and cool dialogue.  Clint Eastwood as the quiet drifter and Lee Van Cleef as the brother out for revenge both do a terrific job in giving depth to their characters and make this an even more intense film than the first in the trilogy.",
            "review_date": "2022-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was way too long.  The characters held few surprises.  Fun to watch Clint & Lee Van Cleef together.",
            "review_date": "2022-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest 02 hours: and 12 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For me slightly better than the 1st...thanks to Lee Van Cleef...a classic piece of cinema",
            "review_date": "2022-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sonic I think it's weird that you are watching the movies",
            "review_date": "2022-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb second entry in the 'Man With No Name' Trilogy, featuring some superb acting and atmospheric action.  Clint Eastwood is his usual stoic excellence as Blanco, while Lee Van Cleef steals the show as a rival bounty hunter with a mysterious past.  They are matched perfectly against the great Gian Maria Volonte as Indio, the psychotic villain you almost feel sorry for.  Behind the camera, Sergio Leone crafts another epic western, with a nicely twisty story along with some iconic shootouts (the final dual remains one of the best ever filmed).  Of course, Ennis Morricone delivers another brilliant score as well.  All in all, another brilliant western from Eastwood & Leone.",
            "review_date": "2022-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think I enjoyed this more than its predecessor and while also chock full of cliches I never found myself rolling my eyes or looking at the time.\n\nThe story offered more character development than Fistful as well, and I make that statement somewhat tongue in cheek, but I did appreciate the inclusion of Mortimer and felt the added component definitely made this more interesting.",
            "review_date": "2022-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the second film of the dollars trilogy.\nGreat cast, great music, great direction. Everything you want for a good western.",
            "review_date": "2022-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just for the record I happen to love all three films. For a Few Dollard More is an amazing film though perhaps not as influential as The Good, The Bad and The Ugly. There is one improvement over that film though, and that is the writing of Clint Eastwood's character, more developed and more compelling. A Fistful of Dollars is also great because of everything that makes TGTBATU and FAFDM so good, but I do consider the other two more influential on the genre and also Akira Kurosawa's Yojimbo, which used the film as its inspiration, to be the superior film. Back to A Few Dollars More, the stylised visuals are stunning to look at, the scenery is the very definition of epic and the cinematography sweeps. Ennio Morricone's score is both elegiac and operatic in tone and the story of greed and revenge that focuses mainly on the pursuit of bandit Indio draws you right in and never lets go. The dialogue is peppered with grit and dark humour, which is well-balanced with neither over-powering the other, while Leone's direction is superb. Clint Eastwood plays his more developed character with immense charisma, Lee Van Cleef is suitably vengeful and again Gian Maria Volonte snarls convincingly. Overall, a wonderful film. 10/10 Bethany Cox",
            "review_date": "2022-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yet another gripping Leone western featuring \"The Man With No Name\" which does not disappoint.",
            "review_date": "2022-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The definitive spaghetti western, but with its own mad history. 9/10",
            "review_date": "2022-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'd rank it slightly below the original, but that's unimportant as 'For a Few Dollars More' is still a lot of fun.\n\nClint Eastwood is tremendous again as the lead character, while Gian Maria Volonté reappears as a different character - usually I'm not a fan of actors playing different characters in a series, but I must make an exception here as Volonté is terrific; just as he is in the preceding 1964 film. One newcomer to the cast is Lee Van Cleef, who is brilliant too.\n\nA story regarding bounty hunting was always going to be enjoyable, which is most definitely the case here. The aforementioned trio are massively entertaining. I particularly found the ending to be one of the best parts of this.\n\nI was excited to check out 'The Good, the Bad and the Ugly' even prior to watching the first two films, given it's the one I knew most of beforehand, but its two predecessors really have wet the appetite and then some!",
            "review_date": "2022-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"For a Few Dollars More\" - I saw this recently decades after my first viewing and, much to my chagrin, have to re-rate this as quite an amateurish movie. This movie glamorizes lawlessness, cowboys, and wanton killing in quite childish black-and- white plots in cheap sets while endowing the heroes with superhuman qualities like immortality and hair's breadth precision (literally!) with a handgun. To round it off, the actors cannot act - I was astonished to see how bad Clint Eastwood was an actor. (Although, I can see why he developed a cult following.) I liked Lee van Cleef, but that could be more due to his character and looks. The one thing I really enjoyed about the movie is its  famed musical score, which has indeed become more charming with time.",
            "review_date": "2022-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favourite of the series, for sure. Grimaldi's artful style stretches the tension out to almost unbearable levels at points. Of course, it's also beautifully shot with great dialogue.",
            "review_date": "2021-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What do you get when you combine Ennio Morricones flawless score in a film with Clint Eastwood and lee van cleef?... A classic spaghetti western! Eastwoods intro is so well done and establishes his character as a BadAss gunslinger cowboy bounty hunter that doesn't mess around both Eastwood and lee van cleef are perfect for these kinds of roles in western movies and absolutely steal the show when they team up to take down El Indio while not as good as some of Sergio leonne's other westerns like the good the bad and the ugly its still worth the watch",
            "review_date": "2021-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cinema's most honest cash grab.\n\nI love \"Fistful of Dollars\" and \"The Good, the Bad, and the Ugly,\" but this movie doesn't do it for me.\n\nIf you can excuse the fact that the cast is recycled from the first movie (including a half dozen bad guys  who died in \"Fistful\"), you're left with a ham-fisted melodrama, that's constantly making mountains out of molehills.\n\nWhy the f would the bad guy fixate on the watch of some people he murdered years agos, when apparently he murders twelve people every day, before breakfast? Who knows, but it cues the overly dramatic music to play in literally every scene he's in. \n\nAnd this movie is full of plot holes:\n\nWhy would Manco(Eastwood), hold a telegraph man at gun point and force him to send a telegraph, if Manco knows how to send them himself? And if he doesn't, why doesn't the telegraph man send \"Help I'm being held captive\"?\n\nHow does a bank even use a safe full of money hidden in a cabinet if they'd have to destroy the cabinet every time they want to open it?\n\nAnd having Manco admit that he is a bounty hunter to the bad guy, and the bad guy saying \"that's the one answer you could have given,\" is stupid. The bad guy is stupid, Manco is stupid, everyone is stupid, most of all the writer.\n\nBut anyway Lee Van Cleef is good in it, so there's that.",
            "review_date": "2021-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone directs Clint Eastwood and Lee Van Cleef in a western?  Of course it's good!",
            "review_date": "2021-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Other than Clint Eastwood's cool charm, it's hard to understand the mass appeal of Sergio Leone's spaghetti westerns.  In For a Few Dollars More, Eastwood's character teams up with Colonel Mortimer (Lee Van Cleef) to hunt down and kill the dreaded Indio Gang in order to collect the lucrative bounty. The movie has its positive attributes – Eastwood and Van Cleef both do a good job, director Sergio Leone seems to have an eye for expansive, dust-swept vistas, and some of the sets are impressive.  However, the film is hindered by far too many steely-eyed close-ups, bad dubbing done by weak actors, a sometimes overbearing score by Ennio Morricone, stilted dialogue, horrible sound effects, and an abundance of outdated fast zooms.",
            "review_date": "2021-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After the predecessor, the second chapter of the trilogy continues to offer a suggestive narrative.Leone's direction continues to convey strong emotions and totally immerse the viewer.",
            "review_date": "2021-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good compelling villain and amazing score and cinematography. Clint Eastwood dazzles and the suspenseful yet easy to follow plot is for sure satisfying!",
            "review_date": "2021-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot is not the best, but it's just too fun.",
            "review_date": "2021-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a Few Dollars more is an interesting western with great performances by the leads of Eastwood, Van Cleef, and Volonte. It was a bit confusing at first to have Volonte back from Fistful of Dollars in the role of the main villain- but playing a different character. After a few minutes I figured out he was a totally different character and this \"trilogy\" is only loosely connected, more like an anthology with the similar casts/creative teams working on each film. Volonte is as great as the villain here as he was in Fistful- he is the type of character you love to hate. Every scene he is in you just want to reach through the TV to strangle the guy. Van Cleef and Eastwood both bring a lot of charisma as likable anti-heroes. The revelation at the end of **SPOILER** the Colonel's sister having been raped & murdered by Indio adds a needed personal touch to the action. Instead of simply being two guys out for some cash- it becomes a story of vengeance for a horrific act of evil. Without this I think the film would be much more disposable- but you really feel for the Colonel at the finale and it is gratifying to see him get his closure.",
            "review_date": "2021-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Check out 55:44. A UFO caught on film?",
            "review_date": "2021-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's a wonderfull film. Classic by 1965's. Clint eastwood and Lee van Cleef are carisma.",
            "review_date": "2021-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the Good the Bad and the Ugly but still one of the best movies ever made",
            "review_date": "2021-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An astonishing upgrade since the previous film in the Man With No Name Trilogy, For a Few Dollars More left me infinitely more invested in their story and characters rather than A Fistful of Dollars. It seemed to be more suspenseful, engaging, thrilling, and even more iconic at some times.",
            "review_date": "2021-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This classic spaghetti western movie was very good. Clint Eastwood, Lee Van Cleef, Gian Maria Volonte, and the rest of the cast did a spectacular job in this classic movie. The plot to the movie was action-packed, thrilling, and intense. These classic movies are what makes Clint Eastwood a legend. If you haven't seen this classic western yet, check it out sometime. It'll blow your mind.",
            "review_date": "2021-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Highly entertaining although I feel it didn't need to be 130 minutes long, which caused minor pacing issues in the 2nd half.  Lee Van Cleef's 'Mortimer' is such a badass and my favorite character in this sequel.  I liked how he used a stock attachment with his revolver.  I also liked the 'Indio' villain and found him menacing.  Good stuff overall, I'm looking forward to 'The Good, The Bad, and The Ugly'.",
            "review_date": "2021-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "God damn, I miss the western era so much. This movie is beautiful in every way, good plot, great jokes, outstanding action for the time. Clint Eastwood looks hot and cool, as well as he plays the role of his character really well. The soundtrack in this movie is what carries the atmosphere and authentic of the film. It is truly heartbreaking that Morricone has died this year. A real legend. The soundtrack \"The Vice of Killing\" now plays on repeat in my eats throughout the entire day. Haven't seen \"The Good, The Bad, and the Ugly\" yet, but I am sure it is also a masterpiece and is even better than this one. Even if you don't like westerns, this movie will change your mind. I was never a big fan, but this film here made me feel different about that topic.",
            "review_date": "2020-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a Few Dollars more is actually better than a Fistful of Dollars. Great movie!",
            "review_date": "2020-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everything great about \"A Fistful of Dollars\" (stylish direction, iconic score, American star(s)) has been both carried over and expanded here with an involving, manly story.",
            "review_date": "2020-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When the coronel and The Manco find each other it turns out an exciting release that many movies lack today",
            "review_date": "2020-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Also Fantastic Clint Eastwood is the Man 😎✌🏻",
            "review_date": "2020-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Every bit as good as the original.",
            "review_date": "2020-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My personal favourite in the \"Dollars Trilogy\". I love this western, Clint is great but for me Lee Van Cleef is the best actor in this film, Gian Maria Volonté is a fantasitc villian in this compared to his role in the previous film.",
            "review_date": "2020-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The bit where Man With No Name (Clint Eastwood) is hat blasting Douglas Mortimer's hat away from him is honestly brilliant. \n\nAlso, I bloody love everything in this movie, the plot, the characters, the dialogue, the gun fights, the composers theme which is used throughout this movie and Clint Eastwood being a bad ass throughout. \n\nOverall, it's an amazing Spaghetti Western movie with lots of action and lots of good moments throughout. I'd recommend for you to watch this after you've watched A Fistful Of Dollars, that's also really good but I prefer this one a little bit more but yeah, it's honestly worth the watch.",
            "review_date": "2020-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This takes everything that was good about Fistful of Dollars, but takes those elements into a story that is higher-stakes and more emotional. Gian Maria Volonté is brilliant as El Indio with his guttural laugh. The scenes where they plan and eventually rob Santa Cruz bank encapsulate what is good about these movies: action, double-crossing, cunning, and grit. My only criticism is the timepiece subplot which seemed too laboured.",
            "review_date": "2020-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's something magic about those spaghetti westerns. And this sequel to the first 1964 film, which is a super classic western, still manages to also be a classic. But it's different from the first movie, in the ways that it's got a longer runtime, which gives a opportunity for the plot to develop itself more. And it also cuts down a little on the sweaty, bloody violence that its predecessor had. The film offers beautiful cinematic landscapes, a memorable musical score, some very captivating gunfights, and another iconic performance by the great Clint Eastwood. And Lee Can Cleef is also good in his role as a vengeful bounty hunter. I honestly consider this movie to be a piece of art. And overall, this is a very good, very interesting Western. I'm curious to check out the 1966 sequel. Recommended!!",
            "review_date": "2020-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clint Eastwood once again earns the title of being the greatest of cowboys on screen, in this masterpiece.",
            "review_date": "2020-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the best sequels of all time. Eastwood at his best and one of the greatest western movie series ever.",
            "review_date": "2020-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is probably the greatest Western film ever. Lee Van Cleef is amazing in it, but the film is made by the performance of Gian Maria Volonté, whose portrayal of a vicious, cunning villain overshadows the stellar performances of the other actors.",
            "review_date": "2020-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clint as always magnificent",
            "review_date": "2020-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Takes inventory of everything that worked about its predecessor and doubles down, whilst also looking to patch up the things that didn't quite come across as well as they could have -- just as every sequel should. \"For A Few Dollars More\" elevates the Dollars trilogy with much more likable leads, a surplus of action to savor, and a score that -- I swear to God -- has at least three or four themes that'll turn into genuine earworms for you in the days following your viewing of the flick. Clint Eastwood and Lee Van Cleef are a joy to watch onscreen, with their friendship ultimately providing the most satisfying element of the entire experience (especially once the ending comes around). Major props also go to Gian Maria Volonte for bringing the dastardly, yet tortured spirit of \"el Indio\" into the fold and then some. You can see a lot of \"Once Upon A Time In The West\" in this, both thematically and narratively. And even though it's not as filmically brilliant as that film, it definitely ages better (subtextually speaking) and is simply more efficient overall. Great film.",
            "review_date": "2020-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Introducing elements of originality and this time aided by the star power of Van Cleef, For a Few Dollars More builds on its (albeit informal) predecessor, but has the narrative capability to stand on its own legs. (4/5)",
            "review_date": "2020-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a Few Dollars More improves well after the success of A Fistful of Dollars. I love the new characters, the performances, the gun battles, and the finale. Clint Eastwood and Lee Van Cleef are the best tag teams in Western movies. There's nothing bad to say about this Sergio Leone film. Overall, The Man With No Name survives this review yet again.",
            "review_date": "2020-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two of the handsomest men in Westerns perform to the music of Ennio Morricone, and neither has two left feet. Choreographed killing machines.",
            "review_date": "2020-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The second movie in the 'Dollars Trilogy' featuring Clint Eastwood. In my opinion this second film was better than A Fistful of Dollars.",
            "review_date": "2020-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic. The first two films in the so-called \"dollars trilogy\" are, in my opinion, the best.",
            "review_date": "2019-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptional performances by three heavyweight actors, Gian Maria Volonte and Lee Van Cleef  and Clint Eastwood, along with great direction, editing, cinematography and gripping and unique music by the great Ennio Morricone, make this movie a real standout. Stylistically iconic, this Sergio Leone opus has an endlessly fascinating and spellbinding story that surprises to the end.",
            "review_date": "2019-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Arguably the best western ever",
            "review_date": "2019-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To consider this one of the rare sequels that improves upon their predecessors would be an understatement. With a taut screenplay, tight editing, impressive camera work, Superb cinematography with beautifully framed shots, Morricone's atmospheric and slow-burning score, a nuanced direction and an unmatched chemistry between Clint Eastwood and Lee Van Cleef, one of the most intimidating villains in a Western, I wouldn't be exaggerating if I said that For a Few Dollars More is about on par with Leone's masterpiece The Good, the Bad and the Ugly. The latter is still my favourite of his, but I really think For a Few Dollars More has a more daring, challenging and unpredictable script! The complaint I have is that the first act is a bit too cheesy unlike the rest of the film. Hence, there is kind of a jarring tonal shift between the first and the second act.\n\n(9/10)",
            "review_date": "2019-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A killer Western full of shooting and storytelling.\n\nDirector Sergio Leone's Western drama For a Few Dollars More (1965) is a genuine classic of the Western genre. It features an all star cast, iconic score, clever direction, brilliant writing, and awesome shooting. Leone's direction takes you from jails, banks, towns, and hotels alike in the El Paso area recreating an older era with gritty realism and sweat laden faces. Leone finds the balance between gunfire and character drama with heaps of comedy scattered throughout for an entertaining Western that feels like no other.\n\nLeone's writing is impeccable here as For a Few Dollars More establishes all his characters and their personality quickly, then leads into a massive genius twist that takes your breath away. Leone films everything with attention to detail as to where characters, and the audience, are looking at all times. For a Few Dollars More is one giant magic trick. \n\nYou are so preoccupied by the leading men's performances and the criminal's plot that Leone leads you astray from the real story here. Leone keeps you entertained with witty remarks, casual insults, funny jokes, lightning fast gunplay, and intricate bank robberies that you never paid close enough attention to the Colonel. Leone uses the camera to shift the viewer's focus to the bullets and comebacks, so that you are never truly aware of Indio and the Colonel's connection. \n\nFor a Few Dollars More's twist that the Colonel's sister was raped by Indio causing her to commit suicide to stop her own rape is one of cinema's greatest story reveals. It is executed so beautifully with Indio's nostalgic reminiscing of his past with flashbacks and the mesmerizing sound of a musical watch.\n\nSpeaking of the use of sound in For a Few Dollars More, Ennio Morricone's score is iconic and vital to the story and film. The beautiful lullaby played by the musical watch is haunting, both during El Indio's duels as well as his remembering his past. Anytime that theme plays, you are captivated by its tune. Morricone's score itself is full of piano, whistles, and strings that stir your soul and transport to a time of bandits, bounty hunters, and duels galore. Leone's direction with the score in mind is perfect for creating suspense based around the music's timing. It is safe to say that For a Few Dollars More would not be the same film without Ennio Morricone!\n\nLee Van Cleef is introduced with his wide array of arsenal and devastating accuracy, while Clint Eastwood is heroic and clever in his own way outsmarting and quick drawing faster than anyone. You are immediately drawn to both leads with their piercing eyes and gripping gravitas. They are both charismatic and memorable, so much so, that you end up rooting for both of these serious gunfighters. Van Cleef and Eastwood are killer character actors with cool and collected personas that grip you like no other Western leads other than Charles Bronson is Sergio Leone's Once Upon a Time in the West. Lee Van Cleef is cool because he is mysterious and skilled without having to show off unnecessarily. Eastwood's quiet nameless hero is compelling thanks to his acting prowess and his character's impressive quick draw skills with a pistol. I will never tire of seeing Clint Eastwood acting like he just shot 3 men at once with precise aim.\n\nAs for the antagonists, the talented Gian Maria Volonte is mad as the villain and erratic robber El Indio. This is Volonte's finest hour as an actor. His insanity is developed and displayed in his killing of civilians, soldiers, and his own men alike. His wild laughter echoes throughout the film and his duels are quietly disturbing as he reaches for his gun with a callous disinterest. My favorite aspect about his performance is certainly his mad eyes daydreaming of his grotesque past. Likewise, Klaus Kinski even gets a supporting role as the hateful hunchback henchman to Indio. His crazy eyes, mouth twitches, distinctive hunchback, and outward rage makes Kinski's appearance in For a Few Dollars More unforgettable.\n\nIt's fun to see Joseph Egger back from A Fistful of Dollars as a prophet instead of an undertaker. His silly encounter with Clint Eastwood is a highlight for me especially when the train passes his home and everything starts shaking.\n\nOverall, Leone polishes off his style from the entertaining, but small A Fistful of Dollars into a massive scale crime narrative and secret revenge tale within For a Few Dollars More. It leaves you with a sense of accomplishment as Lee Van Cleef's character is burned into your mind satisfied with his avenging his sister, while Clint Eastwood rides off into the sunset with carefully counted currency.",
            "review_date": "2019-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "enjoyable spaghetti western with a great cast and a few twists in the story to keep it entertaining",
            "review_date": "2019-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great and underrated score ",
            "review_date": "2019-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My personal favorite in Sergio Leone's trilogy. Fantastic filmmaking, dialogue, Eastwood and Van Cleef make an excellent duo, the villain is scary and memorable, and classic western shootouts. Watch it!",
            "review_date": "2019-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My personal favorite of Sergio Leone's western trilogy. The heroes are engaging, the villain is intense, the story is more personal for its leads, and of course great western style shootouts!",
            "review_date": "2019-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Having recently watched \"The Good, The Bad, and The Ugly\" I was curious to check out more entries in this trilogy. I think \"For a Few Dollars More\" has some things that make these classic Westerns worth checking out. The first is just how fun Clint Eastwood's character is in the movie and the second is just how good the score sounds. While I didn't quite like this movie as much as the one after it in the series, I thought it was solid and think fans of Westerns will appreciate it. The movie is okay overall but it builds up to a very well-made finale. ",
            "review_date": "2019-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fir A few more dollars. Great acting from both Clint Eastwood and Lee Van Cleef. The style great like the first one. The characters are written well acted well, and over all executed brilliantly. The action is filmed very well and has some of the best duels in films yet. The music connducted by Ennio Morricone is amazing and fits with all the fights and the rest of the movie. Over all I give it a 8/10",
            "review_date": "2019-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone's masterpiece direction with  that masterpiece score from Ennio Morricone... Clint Eastwood, Lee Van Cleef and Gian Maria Volontè... This is Legend for 6 stars.",
            "review_date": "2018-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The middle film in the unofficial Man with no name films For a few dollars more is a fantastic chapter with certain shlock elements which seem dated. Eastwood returns as the bounty hunter as does a new dude played awesomely by the great Lee Wan Cleef. He is so good that you almost start believing he is cooler than Clint. Both meet one another and together they pursue the bandit El Indio and his henchmen who are planning a raid on the biggest bank in the region. El Indio is played by the great Gian Marie Volonte, who if you ask me should be equally well known and beloved as Le Cleef or Eastwood. It is a shame that such a great performance is not measured in the same words as the more popular ones. He was amazing as the middle brother Rojos Ramon in the previous film and just as devilish in this. The cinematography and look are fantastic- old film stock shot in hot, humid rocks. In a western the location is perhaps as important as the theme and Leone's films exemplify this. Unmissable film.(One of the greatest middle films of all time).",
            "review_date": "2018-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How many films are still talked about , whistled , loved than eastwood with his only , man with a name western classic. Manko if u missed it.",
            "review_date": "2018-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bizarre film, like an art piece trapped in its western holdings (or the other way around), it's alternately hilarious, revisionist, straightforward, and deeply moving, but never all at once. It's disjointedness is its only downfall.",
            "review_date": "2018-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some pretty great lead characters, really good action, a good plot and an amazing soundtrack. A good movie.",
            "review_date": "2018-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A major step up from its predecessor, For a Few Dollars More excels at fleshing out its characters and providing an effective amount of surprises and masterful tension all accompanied by another killer performance by Eastwood, beautiful cinematography, and a haunting score.",
            "review_date": "2018-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A major improvement over the first. Better characters, better gunfights, better western. A true spaghetti western!",
            "review_date": "2018-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ennio Morricone gave a classic soundtrack to thIs Sergio Leone epic.A visual and sound masterpiece. A must watch. My favorite.",
            "review_date": "2018-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the best western movie ever period! It is better than both The good, the bad and the ugly and Once upon a time in the west. The music is superb as expected from Ennio Morricone. The drama between Colonel Mortimer, and Indio exciting. The conversation that Clint Eastwood and Lee van Cleef has after their initial beef must be the best dialogue in any western movie. \"Tell me colonel have you ever been young?\" \"Yes and just as wreckless as you, then something happened that made life very precious to me\"  This is a must see. The environement and the sunlight feels so alive as well.",
            "review_date": "2018-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Very Good Followup A Great Western Movie",
            "review_date": "2018-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "but you made a mistake..\n\nPer qualche dollaro in più\n\nAs always Sergio Leone takes too much time in making a point which takes away the interest no matter how intriguing the plot is, but besides that it is well crafted.",
            "review_date": "2018-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a hell of a lot darker than the first one, but the plot is far more solid.",
            "review_date": "2017-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For A Few Dollars More: Another powerful preformance by Clint Eastwood with an a powerful soundtrack and direction from Serigo Leone makes For A Few More Dollars another western masterpeice and a great western sequel.",
            "review_date": "2017-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The gritty 'spaghetti' western genre introduced to Hollywood audiences with A Fistful Of Dollars continues with an even better film a year or so later.\nClint Eastwood returns in a kind of 'man with no name' character although that is perhaps a misnomer as he has a name Monco.\nHere the story centres around deadly bounty hunters purring like cats at reward posters for murderers and robbers wanted dead or alive with handsome rewards on offer.\nThe screenplay is very clever and features a web of double crossing, partnerships and crime.\nThe film benefits from a bigger budget than its predecessor it seems which may have allowed the good casting of Lee Van Cleef as a fellow bounty hunter that is an older version of Monco. Deadly with the gun and equal in thirst for rewards.\nThe music score by Ennio Morricone is a joy. I would rate him alongside the likes of John Barry and John Williams.\nI can't praise the film enough. This sub genre has certainly reinvigorated my love of western films. \nNext....The Good, The Bad and the Ugly.",
            "review_date": "2017-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a Few Dollars more is definitely the weakest of the Dollars trilogy. Clint Eastwood and Lee Van Cleef make a good team, but it just drags on a bit too long. Plus, Ennio Morricone's score seems a little more grating than normal. Still, though, this is a classic Western and it's worth a watch.",
            "review_date": "2017-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great Clint Eastwood Western!",
            "review_date": "2017-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite western. Badass characters, action mixed with an emotional quest and Ennio Morricones awesome score create this EPIC movie",
            "review_date": "2017-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sharing the sharpness of both its predecessor and successor, the central Spaghetti Western of the Dollar Trilogy marks the arrival of the charismatic man in black (Lee Van Cleef), portraying a bounty hunter looking for a few dollars more (interestingly more money than in the 1st film, less than the 2nd ). And there's nothing like its chivalrous duel with Eastwood in the hat scene. They are two relentless antiheroes portrayed in a parallel manner by two intimidating sequences at the beginning of the film. And the final duel is a fantastic prelude to the astounding final truel of 'The Good, The Bad and The Ugly'.",
            "review_date": "2017-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first or third movie of the Dollars trilogy, but still enjoyable.",
            "review_date": "2017-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this is one of the best movies ever made and still holds up to this day. In fact,I saw it just before posting this review and realised how great the story is,how great the characters are and the musical score is absolutely legendary. For a movie that was made so many years ago and for it to still leave such a lasting effect on the viewer is awe inspiring. Everything from the stunning cinematography to some of the most memorable scenes ever put on film with witty dialogues and carefree nature of the protagonist to some of the deadliest confrontations make it all the more memorable. Not to mention the stylish presentation. All in all even though it's supposed to be a sub-genre,to me it's one of the best westerns ever made.",
            "review_date": "2017-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If the first film is already a masterpiece; This raises a quality of history in general; What movie; What a script, it has been a long time since I was surprised by a movie. Well done; A jaw-dropping soundtrack and photography is too much; Simply sensational; I want to watch the third one already.",
            "review_date": "2017-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome!\nDon't miss it!",
            "review_date": "2017-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This second film in the Man With No Name trilogy is even better than the first. With a more expansive story, way better action, a great counterpart to Eastwood's character, an even better score, gorgeous settings, great cinematography and even a humorous script despite even more brutal violence this is up there with the best Westerns.",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great western. I think I really enjoyed this a little more than the prequel. I loved Clint and Van Cleef working together.",
            "review_date": "2017-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great Western showing the story of two bounty hunters taking down the criminals.",
            "review_date": "2017-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "10 out of 10:\n\nFor a Few Dollars More kind of improved over the first with a better story and more thrilling action, while keeping the great acting and directing.",
            "review_date": "2017-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally saw ffirst  time ever 12-2016 on tv.  A classic.  But wierd cuz 'spaghetti Western' filmed in Italian and dubbed entirely.   A lot of 'posing'.  But beautifully done.",
            "review_date": "2016-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's impressive how Sergio Leone and Clint Eastwood manage to make the value of entertainment on this film spectacular and still be able to make such an well crafted story, also, Ennio Morricone's score is one of cinema's finest.",
            "review_date": "2016-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So much death in the movie. This script was genius, I am a fan of the sequel. I just love this movie. Great to watch, interesting story, and the amazing music.",
            "review_date": "2016-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Again directing and music take over. Ending makes all repetitions worth.",
            "review_date": "2016-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fine sequel from Sergio Leone other film, A Fistful of Dollars, and another classic western film.",
            "review_date": "2016-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What this quasi-sequel to 'A Fistful of Dollars' lacks in relative excitement to the first film, it more than makes up for in production value with a budget that I'm sure had a....few dollars more???\n\nKill me.",
            "review_date": "2016-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first IMO, it drags and is overlong, but its best moments and amazing soundtrack make up for it.",
            "review_date": "2016-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a Few Dollars More is the perfect spiritual sequel to A Fistful of Dollars. Eastwood is a charismatic lead, Lee Van Cleef brings unexpected depth, and Gian Maria Volonte is perfect as the thoroughly hateable and psychopathic villain.",
            "review_date": "2016-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When a second movie can't be carried by the same character alone, what could be possibly better than to couple Eastwood with Lee Van Cleef as two crude bounty hunters driven from different reasons to the same goal?",
            "review_date": "2016-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 2nd of The Man With No Name trilogy.  It establishes the relationship between \"Angel Eyes\" and \"The Man With No Name\".  The film was largely lifted from Akiro Kurosawa's Yojimbo.  This film is a great Leone spaghetti Western, and one of the best ever made.",
            "review_date": "2016-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hoping to see the first one to finish off the dollar sequals. This movie was spot on perfection, and the writing was good as always. I was very entertained from this as much as I was with The Good the Bad the Ugly. The music was still matching with the mood, and it was kinda funny seeing Clint do a Karate chop. The story was fascinating, and the characters were bad-ass.",
            "review_date": "2016-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story goes slow - it isn't racy.. Yet, it maintains a grip and never gets boring, not even the \"filler bits\" of riding through the hills.. Of course, when you have Ennio Morricone's score nothing can feel dull and/or dreary. Clint Eastwood's \"cool quotient\" is way too high here.\nFor a change, there is no female lead who makes a namesake appearance.\nIf for nothing, one has to watch just for the background score.\nMust watch.",
            "review_date": "2015-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Almost as good as the third film, its really something in its own right.",
            "review_date": "2015-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A step above 'A Fist Full of Dollars'.  From the story, which breeds more than just tough guy challenges the baddies because he can, to the iconic filmography and sound track, this film has heart. There is relatable motivation to put the mad dog down. And when the ultimate scene comes it has been constructed with such rhythmic proficiency, it could hardly more satisfying. The match of our co-stars aside, what amazes me is how long a stair down in the tavern or the street can be carried for so long without the scene falling stale. So much is said by saying so little with these performances. You're just left to admire the ride.",
            "review_date": "2015-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just a fun classic Clint western.",
            "review_date": "2015-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A more poetic film than its predecessor.",
            "review_date": "2015-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Of the three, I'd say this was the best. In fact, probably one of the best Westerns I've seen.",
            "review_date": "2015-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great western from a great trilogy",
            "review_date": "2015-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nope.  This one is definitely my favorite of the trilogy.  It's dizzyingly good.  the score totally knocks it out of the park.",
            "review_date": "2015-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This felt much more cohesive than its predecessor. It felt about a decade ahead in production value. Very entertaining stuff. There were a few cheesy, unexplained parts that certainly wouldn't have been left in a modern movie, but overall, it held up.",
            "review_date": "2015-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The second part of Sergio Leone's \"Dollar\" trilogy (beginning with 1964's \"A Fistful of Dollars\" and closing with 1968's \"The Good, The Bad, and The Ugly\"), 1965's \"For a Few Dollars More\" is a wonderfully grimy spaghetti western that improves upon the brazen badassery of its predecessor.  Throw Clint Eastwood back into the ring and you have yourself an anti-hero more parched for the sweat of a knife fight than John Wayne; add the beady-eyed Lee Van Cleef into the mix as his right-hand man and you have yourself an anti-hero more famished for the blood of a gun battle than Clint Eastwood.  The film is a never-ending sphere of poetic carnage, incessant perspiration, and pseudo-virility - the exquisite restraint of Leone's direction, along with the near-silent machismo of its leading players, makes \"For a Few Dollars More\" an irresistible product of subgenre ecstasy.\n\tEastwood and Van Cleef co-headline as The Man With No Name and Col. Douglas Mortimer, two rival bounty hunters who decide to join forces in hopes of capturing sadistic bandit El Indio (Gian Maria Volonté).  The plot, as simple as I've just described it, is stronger than that of \"A Fistful of Dollars\" - The Man With No Name is now no longer a cunning criminal but a sorta-kinda good guy wanting to make right in the West and for himself; style is still the most pertinent force in every frame, but this time around there's a story strong enough to give all the dust-and-tumbleweeds swagger cinematic weight.\n\tThe new assurance is so tenacious, in no doubt, because of Leone, who is confident enough to work from his own material rather than someone else's (\"A Fistful of Dollars\" was adapted from Akira Kurosawa's \"Yojimbo\", the screenplay penned by five other co-writers); \"For a Few Dollars More\" takes what was great about its predecessor and ups nearly every detail.  It's more bold in its close-ups, moody pauses, and portrayals.\n\tAnd while Eastwood is still the same indestructible force of machismo he was in the previous film, it's Van Cleef that steals the show.  With his dragon eyes, beak nose, and abiding glare, he's an anti-hero that looks the part of the villain - Mortimer is a man of few words, yet Van Cleef is able to speak volumes through his gallant body language.  He and Eastwood have the kind of chemistry only assassins can mirror, pairing not out of friendship but out of necessity.  Maybe they don't like each other, but they sure do know how to work well together.\n\t\"For a Few Dollars More\" is probably the weakest of the trilogy (\"A Fistful of Dollars\" felt so new, so vital, \"The Good, The Bad, and The Ugly\" a blending of the strongest elements of the spaghetti western), but it's the weakest of one of the most perfectly made trilogies of all-time.  Leone is never one to take it easy, and neither is Eastwood.",
            "review_date": "2015-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Adding onto \"A Fistful of Dollars,\" \"For a Few Dollars More\" brings just as much excitement and style to the genre.",
            "review_date": "2015-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best in the Sergio Leone trilogy!  Better production value than the first, and Eastwood's and Van Cleef's characters are fun to watch. So much better than the two other films!",
            "review_date": "2015-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great follow up to the initial part in the trilogy. The addition of the charismatic Lee Van Cleef and making him the equal of Clinton's Man Without a Name was a stroke of genius. The plot is unlikely to say the least, but that is irrelevant, as this is all about mood, fantastic action scenes, an over the top music score and intriguing, unexpected editing of the visual storytelling. I'm not a big fan of violence in films, but here it's almost poetic.",
            "review_date": "2015-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "75%\nSaw this on 8/7/15\nIt gives it's protagonist a purpose by making him a bounty killer and adding Lee Van Cleef into the series, but still it's the weakest movie in the trilogy mostly because of it's extreme lack of pace and a deficiency in genuine thrills. The music is good (but feels like a slight modification of the original, but towards the end, it becomes really terrific), but the film simply uses most of the notable elements from the original film which increases the predictability. The film, even though at 2 hours and 12 minutes feels more than The Good, The Bad and The Ugly in length. Also Clint Eastwood doesn't have much role in this film when compared to the original film, however, Van Cleef gets a meaty role and their face off scene is great.",
            "review_date": "2015-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two Words: Clint Eastwood",
            "review_date": "2015-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sequels may be looked down upon in many cases, but \"For a Few Dollars More\" is an exception. Few Dollars does fall flat more often then not, but not entirely because it is a sequel. Not entirely? What I mean by not entirely is that there are repetitions or familiarities. Sequels suffer most often from familiarities, but Few Dollars doesn't painfully suffer from it itself. Ultimately it has to do with one scene, ultimately. But it's insufferably obvious and opens your mind to all the minor familiarities (i.e. the scene in which Eastwood and Cleef are beaten as the villain watches with a gut-busting laughter) Ennio Morricone's score adds additional personality to a film already drenched in it. Eastwood's \"Man With No Name\" is iconic in itself, there isn't much talent to behold or credibility to give to an otherwise archetypical character. But he's full of giddy one-liners. Essential to mention is a newcomer to the \"Dollars\" trilogy, Col. Douglas Mortimer (Lee Van Cleef). Near the end, Mortimer and \"Monco\" (as they, ironically, call \"The Man With No Name\") are going they're separate ways after a shootout which was questionably lacking \"Monco\". It's obvious that \"Monco\" is the protagonist in this trilogy, but at the significant final shootout (another familiarity from the previous film) I was questioning whether we were switching perspectives from \"Monco\" to Mortimer. Mortimer is an interesting character and has more humanity to his character than \"Monco\" even with his gunslinging arsenal, but this is \"The Man With No Name\" trilogy, right? \"Monco\" is there at the shootout but not the one participating in it, Mortimer is the one participating in the final climatic shootout. Though it suffers from familiarity and a lack-there-of protagonist, Ennio Morricone returns on the score, Sergio Leone reprises directing with a giddy, quintessential stylistic approach,  and Gian Maria Volonte returns as a worthy antagonist. Most notable are the situations and thrilling plot that's more mature than Fistful. \"For a Few Dollars More\" is that rare occasion when the sequel is, astonishingly, superior.",
            "review_date": "2015-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This sequel is way more fun compared to the 1st one. More stare downs, more manly faces and those sweaty looks, with their hairs on their faces and smoking tobaccos. In short, it's a fun watch in this very manly western film. One of the reasons that I love in this film is the chemistry between Clint Eastwood and Lee Van Cleef. And Gian Maria Volonté as the main villain, I mean superb performances for these actors. Another Iconic western film that I will never forget. And the restoration on blu-ray is impressive. I really like it. A must watch, a must have and definitly you will enjoy this one. 4/5 stars!",
            "review_date": "2015-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A defining western, with style.",
            "review_date": "2015-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This sequel is way more fun compared to the 1st one. More stare downs, more manly faces and those sweaty looks, with their hairs on their faces and smoking tobaccos. In short, it's a fun watch in this very manly western film. One of the reasons that I love in this film is the chemistry between Clint Eastwood and Lee Van Cleef. And Gian Maria Volonté as the main villain, I mean superb performances for these actors. Another Iconic western film that I will never forget. And the restoration on blu-ray is impressive. I really like it. A must watch, a must have and definitly you will enjoy this one. 4/5 stars!",
            "review_date": "2015-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This second western in the Man With No Name trilogy is a strong sequel. The action is well executed and memorable. Clint Eastwood is great as the lead and the new members of the cast are quite good. The villain this time around is better, he's given more backstory and depth then the last villain. The direction and score are great as well. The movie however doesn't give as much depth or reason to root for the heroes as I was hoping. It's also not as quotable or original as the first. The movie is also pretty predictable. In the end, it comes close to being as good as the original but falls a bit short, but still should provide for great entertainment. For a Few Dollars More gets 4/5 stars (B+).",
            "review_date": "2015-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great set up.  Characters were amazing.  Badass yet again.",
            "review_date": "2015-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Influential in a way that was sometimes or somewhat mostly successfully attempted by other films, this another western classic turns out to be superior of its kind by how it was skilled and masterfully done thanks to the returning team of the previous western tale of \"the man with no name.\" (A-)\n\n(Full review coming soon - with better wording probably)",
            "review_date": "2015-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great achievement for the cinema. her is my very top western movies and you are welcome to write your ide:\n\n1) For A Few Dollars More (1965)\n2) The Good, The Bad And The Ugly (1966)\n3) Once Upon A Time In The West (1968)\n4) Unforgiven (1992)\n5) Open Range (2003)\n6) Searchers (1956)\n7) The Magnificent Seven (1960)\n8) Django Unchained (2012)\n9) My Name Is Nobody (1973)",
            "review_date": "2015-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first, but with a new story and same style. Definitely an excellent sequel to bridge it's predecessor.",
            "review_date": "2015-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With the introduction of Van Cleef this sequel goes up a notch. A quality stand-off and Morricone score makes this one of the greatest Spaghetti Western's of all time.",
            "review_date": "2015-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With the beautiful soundtrack from Ennio Morricone this is another masterpiece from Sergio Leone, a range of big names, not only Clint Eastwood and Lee Van Cleef but Gian Maria Volonte, Klaus Kinski, Luigi Pistilli at others, the end is overwhelming and spectacular, a must for the western lovers!",
            "review_date": "2015-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another phenomenal Spaghetti western directed by the great Sergio Leone. Clint Eastwood and Lee Van Cleef are fantastic together. And Giana Maria Volonte is just as superb as the villain as he also was in \"A Fistful of Dollars,\" as he is in this 2nd adaption to the Man with No Name trilogy.",
            "review_date": "2015-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funnier and more playful than the first one but mostly very much like AFOD. I guess I won't add to much text here, since they got so many similarities. I'd rather focus on the differences.\n\nI think I like the story is even better and there are more impressing gun shows here. The music is also better here - something that's pretty incredible, a wild archievement. The characters are equally cool, with a more psychotic villain and two bad ass guys here instead of one. Mortimer is an amazing character, but \"The Man With No Name\" is naturally the most bad ass one though. It's cool that Klaus Kinski is in it, a face I never thought I would see here. The showdown is fantastic but not as great as the forst one on my opinion.\n\nIn total I liked the first one a tiny bit better. Maybe I was a bit fed up with the wild west after the first flick, but I doubt it. So, if you dig the first, you will dig the second film. No need to see them in order, but I've read that the third one got small connections with the first two. Looking forward to it.\n\n9 out of 10 chimes.",
            "review_date": "2015-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clint Eastwood returns as the Man with No Name and the sequel to a Fistful of Dollars in For a Few dollars more. The movie is not a direct sequel, as actors from the first film particularly  Gian Maria Volonte returns, but as a different character. This time Eastwood is a bounty hunter who must pair up with Van Cleef to take down a bank robbery gang. For a Few Dollars More, is a more direct movie, that has more action, more interesting characters and is a better movie than its predecessor.",
            "review_date": "2014-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my favourite of the three. Despite the ambivalence of the \"heroes\" being bounty hunters there's a very strong sense of right and wrong, sacrifice and comradeship in this film. The plot is finely developed and the twist with one of the two lockets in the final gunfight really makes it. The interplay of orchestral and locket music in the final scene is masterful. Neither Mortimer of Manco say much but everything they do say is to the point. Action and music speak louder than words and never more so than in this film. The extra organ music is used sparingly and just at the right moments. \n\nI love the way Mortimer stands so erectly in the final shootout and Indio slouches - expressing in body language their morality or lack of it.",
            "review_date": "2014-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For some reason, I have always thought of this film as the least of the Sergio Leone/Clint Eastwood films.  Boy was I wrong.  While it's not quite \"The Good, the Bad and the Ugly\" (but what is?), it really towers over \"A Fistful of Dollars\", and that's an incredible film.",
            "review_date": "2014-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "return on the shooting locations in 2014...\n\nhttp://lieuxdetournages.over-blog.com/et-pour-quelques-dollars-de-plus",
            "review_date": "2014-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Certainly more focused and complex than its predecesor. Dispite its lenght, For a Few Dollars More adds a style of its own to the formula, setting an interesting conflict that breeds space for later great achievements in the genre.",
            "review_date": "2014-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliantly executed western, for a few dollars more sees the return of Clint Eastwood a.k.a. the man with no name. A brilliant sequel and as good if not better than the first. This film captures the western feel perfectly and is one of the best westerns in my personal opinion.",
            "review_date": "2014-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest in cinema history. Everything from the score, to the acting, to the cinematography - nothing can touch the best of the Dollars Trilogy",
            "review_date": "2014-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everything that I liked about A Fistful of Dollars was even better in For a Few Dollars More. The plot of this movie is very simple. A man named El Indio is busted out of prison, and 2 bounty killers are on his trail hoping to collect the big price on Indio's head. The use of music was superb in this film. Most notable is the playful light music box tune utilized to create a great deal of tension and dread. It's a strange contrast that works amazingly. Once again the standoff moments were superb, and Leone threw a lot more of them into this film. I enjoyed how he even put a twist on the standoff by including a scene that had some humor between the 2 bounty killers shooting one-another's hats. My only regret is that they had some emotional stakes they could have added into the final face-off, but they didn't reveal them until the very end. Clint Eastwood and Lee Van Cleef were great in the roles of the 2 protagonists. I did find that it kind of felt like there wasn't enough screen time for both of them, but I appreciated their banter whenever they were on screen together. Perhaps the most surprisingly impressive acting came from Gian Maria Volonte. He adds some real depth to the character of El Indio, you can see he has so much going on behind those eyes.\n\nI appreciated how they gave the villain so much back story. Usually in this type of film I expect the black hats to be one-dimensional, but we get to see some of the things going on in Indio's head and why he is so crazy. I still struggled with the voice dubbing in this movie. It's really distracting, and even though I should, I just can't seem to get past it mentally. It's actually to the point where I'm still noticing it and thinking about it 2 hours into the film. My other issue with For a Few Dollars More is the bullet sound effect. Each shot is way too loud and piercing. It sounds like every bullet is ricocheting off of steel or something, and I literally had to turn the sound down in a couple of the gunfights because that repetitive noise kept ringing out. Now I have to talk about some of the amazing editing decisions that were made in For a Few Dollars More. The way they cut certain images with others and threw in some noises as well was fascinating. The most memorable were all the flashes between character's faces and Indio's wanted poster. They completely revealed the thoughts of the characters without saying a word. There were a few other camera and editing tricks that I thought added a lot to the feel of the movie, but I won't detail them all here. Suffice it to say, this really is a great film, and if you can get past the dubbing it is one you absolutely must see.",
            "review_date": "2014-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the better Spaghetti Westerns with all the best players: directed by Spaghetti Western Master Sergio Leone, music by the brilliant Ennio Morricone, Clint Eastwood and Lee Van Cleef as tough cool Bounty Hunters, Gian Maria Volonté and Kalus Kinski as Crazy Bandits (and Kinski can pretty much outcrazy anyone).",
            "review_date": "2014-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just fucking love western!",
            "review_date": "2014-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good second instalment to the dollars trilogy. I liked the first one better, I felt this one was a little slower to start. Once again though, the last 40 minutes are great, and the final showdown is pretty good. I liked  how they added Lee Van Cleef. The Man with No Name rides on!",
            "review_date": "2014-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The second of Leone's legendary trilogy is much better than the previous.",
            "review_date": "2014-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The second installment of sorts in Sergio Leone's epic Spaghetti Western Trilogy. This time Clint Eastwood and Lee Van Cleef make an unlikely team of \"bounty killers\" to catch the brilliantly played and highly intimidating Gian Maria Volonte. Classic score and uniquely stylized elements.",
            "review_date": "2014-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quality entertainment.",
            "review_date": "2014-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As good of a sequel as youll ever see",
            "review_date": "2014-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good follow up that introduces another badass mofo to go along with Clint Eastwood, Douglas Mortimer played by Lee Van Cleef. For some reason, I wasn't quite as captivated by this one as the first, but definitely worth a watch.",
            "review_date": "2014-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are no flaws in this movie. The writing is amazing, the characters are well developed, and the story is unforgettable! This is my favorite movie of all time!",
            "review_date": "2014-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The lesser of the Man With No Name trilogy, but nonetheless a phenomenal and stylish western.",
            "review_date": "2014-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With very significant improvements in the script and characters, not to mention continual progression of Sergio Leone, Ennio Morricone and Clint Eastwood's respective excellence, For a Few Dollars More is a very worthy successor to A Fistful of Dollars.",
            "review_date": "2014-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This may be one of the best trilogies ever created. Not only did this sequel heavily improve upon \"A Fistful of Dollars\", but it paved the way for \"The Good, The Bad, and The Ugly\" by pairing Eastwood's Man with No Name with another bounty hunter who is out to make some cash and get revenge along the way.",
            "review_date": "2014-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While often overlooked, \"For a Few Dollars More\" is my favourite film in the Dollars trilogy thanks to taut pacing, spectacular camera work and superb acting.",
            "review_date": "2014-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A meaty, juicy, ripsnorter of a spaghetti western. Johns Ford and Wayne have their place but their version of the West was looking tired and perfunctory by the '60s. \"A Fistful of Dollars\" is the first of The Man with No Name series but I find it rather tentative and slightly pedestrian. For me, \"For A Few Dollars...\" is where the golden age of the spaghetti western really begins, revitalising the genre and taking it down a whole different road. It's a bold, sassy and assured piece of work, featuring stellar performances from Eastwood, Van Cleef and Gian Maria Volonté as the downright nastiest villain of them all, El Indio. Watching this in 1965 must have been like sitting down to a taco after an eternity spent crawling through the desert eating sand...",
            "review_date": "2014-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Flanked by Clint Eastwood and Lee Van Cleef and featuring an underrated performance by Gian Maria Volonte as El Indio, 'For a Few Dollars More' enhances the suspense and thrill of 'A Fistful of Dollars' while perhaps not reaching the heights of 'The Good, The Bad, and The Ugly.'",
            "review_date": "2014-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a Few Dollars More is one of the few sequels that is actually better than the original, and with how good A Fistful of Dollars was that's saying something. This is the movie where some of Sergio Leone's signature marks came into play, a blend of comedy and tragedy, lots of close ups, use of flashbacks to tell parts of the story, while they might have sprouted in earlier works, this is the one they are in full force. Also the story in this is excellent, one of the finest examples of revenge used in film, and the combination of great acting, writing, and directing really make you connected to the characters and the struggles they face. Of course, like in other Leone movies, there are plenty of little moments that give the movie it's unique personality you can't find anywhere else. This is a must see western that's worthy of a place on the shelf for any movie fan.",
            "review_date": "2014-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the narrative is not quite as compelling as the first",
            "review_date": "2014-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While there was a few weak/weird sequences, and a snails pace, the movie had a really strong ending and overall story.",
            "review_date": "2014-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful and dramatic Western classic, this is one of Leone's greatest cinematic efforts and is lead by the powerhouse that is Clint Eastwood.",
            "review_date": "2014-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic with lots of swagger.",
            "review_date": "2014-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overall another solid and fun filled western",
            "review_date": "2014-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Early movie night with Grace... about her age when I first saw this...",
            "review_date": "2014-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A pseudo sequel to the classic A Fistful Od Dollars, this second episode feels bigger and it's for the best because as much as the first episode, this is a masterpiece. One of my favorite film.",
            "review_date": "2014-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't like the sequel as much as A Fistful of Dollars.  But that's like saying I didn't like iPhones as much as Droids.  Both films are great and the gap between how much I like either is minimal.  I will say For a Few Dollars More is a much more mature film in terms of style and production.\nMy one issue is the combination of the movie's length and the sparse dialogue.  The plot is cool and so are the characters.  So my issue really might have been I wasn't in the right mindset for the movie when I watched it.\nI did really enjoy Lee Van Cleef as Col. Mortimer.  He might've even been a little cooler than Eastwood.  I think that comes from that Master-Apprentice relationship they developed.  Eastwood's Stranger is a total uber-badass, but as in life, there's always someone better, and I think Mortimer fits that bill.  In A Fistful of Dollars, I viewed the Stranger as the template for great anti-heroes like Han Solo.  In this, Mortimer is the template for both bounty hunters like Boba Fett and masters like Obi Wan Kenobi.  \nAs everyone knows, if you have to watch a Western, watch these films.",
            "review_date": "2014-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone's sophomore film in his Spaghetti Western trilogy and is a major step up from A Fistful of Dollars. This was a film that didn't appeal to me, the first time I have watched it but as I watch it more and more along with others within the trilogy, I start to see the great things about this film. For A Few Dollars More is much more bigger and a much more better written film than it's predecessor.\n\nFor A Few Dollars More was written by both Leone and Luciano Vincenzoni. Both have written a story that is engaging and this is due to a plot with much bigger stakes, and rewards, and also much better written characters. This film fleshes out the characters much more than it's predecessors, taking it's time to show each person's agenda and their personalities, yet Leone and Vincenzoni still has kept the unpredictability that was found in the first film. Oddly enough, even though Eastwood's character is the main star, the film's emotional significance was much more apparent on Mortimer and El Indio. Their back story is the reason that I care about these characters, it tells us why they are who they are. For A Few Dollars More's script has it's humor pumped up in comparison to the first film and I felt that this work. It actually gives the film much more character and helps not make the tone of the film too negative.\n\nSergio Leone has created a film that is much more cinematic and traditional in comparison to the first film but at the same time not trading off the uniqueness of the first film, which was the slow building tension and the close ups of people's faces focusing on their reactions and the emotional facial acting by the actors. This film does increase the beat of the film, with editing that moves the film along at a pace that keeps us on our toes. Leone has definitely have gained much more confidence going towards this film as the film doesn't feel as indulgent as the first and seemed to show much more enjoyment with the story than the first film. This film's budget was much higher than the first film which allowed him to create settings that feel real and lively.\n\nMassimo Dallamano is back as the cinematographer of this film. The film looks much better than the first film and this may be due to the increase in budget and shot at better locations or it could be due to Dallamano and Leone has a much better understanding of what they want for this film. The film still retains that style from the first film with close ups that take it's time to move things along but it's much more improved here as they have used different angles and techniques in constructing these shots, allowing them to feel fresh. Dallamano has the camera move in this film much more than the first. The first film has it's shots set up in a way that doesn't require the camera to move or zoom into anything. This movement makes the film move faster and exciting.\n\nEnnio Morricone comes back to do the score for this film and it's just as great as the first one. The score here sounds much more fuller and dramatic, this may be due to a much larger story and much more characters focused on. Morricone's score here may not be as memorable as the first or third film but it definitely fits with what is shown on screen and it doesn't feel recycled. The film's score feels fast and upbeat, which sound great in moments of the film that have characters riding their horses on the beautiful backdrops. Morricone also has a much lighter and smaller track that plays during the build up of climax, the music that comes from the lockets. It sounds beautiful and it connects with the emotional weight during these situations.\n\nThe film's cast is much bigger in this film and the film is now shared with three characters rather than a main focus on Eastwood. Clint Eastwood is great here as expected but not as memorable as A Fistful of Dollars. Lee Van Cleef brings something different to the film which gives the film much more personality. Leone loves to have actors banter in his films and it's definitely apparent here with the focus on the friendship on both Eastwood and Cleef's characters. Both actors work well together and it's a shame that this isn't the case for the next film. Gian Maria Volonte is back for this film as the antagonist, this time his character is much better written and his acting is much more effective but it may not appeal to everyone as he has increased the dramatics in this film in comparison to the first film.\n\nFor A Few Dollars More is a much better constructed film than A Fistful of Dollars with a bigger and better story and improvements on the acting and photography. The film is great to watch on its own and does not require to watch the first or third film to understand but if you have seen the other films you get to pick up on the small things that Leone has put in this film.",
            "review_date": "2014-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On par with the first of the \"trilogy\". I thoroughly enjoyed this from start to finish. Whilst this seems to be the least referenced of the 3 films in popular culture, its a shame because this deserves to more remembered than it probably is. The film is filled with great tense stand offs, classic old school shoot outs, over the top death scenes and even crazier over the top music cues. Awesome ending.",
            "review_date": "2014-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone's oddly paced exercise in indulgent film-making borders on self-parody.",
            "review_date": "2014-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a Few Dollars More is more refined than the first, but still provides all the action (and cigars) that the first had, and throws in a partner for Eastwood which makes it all the more interesting.",
            "review_date": "2013-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic western film.  The theme that is played on the trinket is absolutely amazing, and every scene with it being used is incredibly tense.  Lee Van Cleef... very intense in this movie!",
            "review_date": "2013-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the weakest of the trilogy, but it's still a powerful piece from Sergio Leone.",
            "review_date": "2013-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great editing, great direction, and great cinematography; Sergio Leone's \"For a Few Dollars More\" proves you don't need dialogue to tell a story.  Instead, you use images and music to do so.  Well done.  This is what you call \"Cinematic Art.\"",
            "review_date": "2013-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's hard to pick, because now I have to rewatch 1 and 3, but I think this might be my favorite. Mortimer and Indio made the movie, and TMWNN maintained his reliable level of interest. This movie was so atmospheric that I actually felt like that was the better New Mexico even though I live here.",
            "review_date": "2013-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am not a huge Western fan. I'm sure this is a very good one, but when the only things I'm comparing it to are Butch Cassidy and The Good/Bad/Ugly, this doesn't stack up.",
            "review_date": "2013-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The middle installment of Leone's must see spaghetti trilogy.",
            "review_date": "2013-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clint Eastwood makes the bad ass action heroes of today look wimpy.",
            "review_date": "2013-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great 2nd movie in the Dollars trilogy.  Leone really builds up suspense using extreme close up shots of to help convey each actors feelings.",
            "review_date": "2013-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though not the best in the series, its still a worthy addition into the Dollars Trilogy where you can see Sergio Leone slowly building u style and class for the grande finale.",
            "review_date": "2013-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone's sophomore film in his Spaghetti Western trilogy and is a major step up from A Fistful of Dollars. This was a film that didn't appeal to me, the first time I have watched it but as I watch it more and more along with others within the trilogy, I start to see the great things about this film. For A Few Dollars More is much more bigger and a much more better written film than it's predecessor.\n\nFor A Few Dollars More was written by both Leone and Luciano Vincenzoni. Both have written a story that is engaging and this is due to a plot with much bigger stakes, and rewards, and also much better written characters. This film fleshes out the characters much more than it's predecessors, taking it's time to show each person's agenda and their personalities, yet Leone and Vincenzoni still has kept the unpredictability that was found in the first film. Oddly enough, even though Eastwood's character is the main star, the film's emotional significance was much more apparent on Mortimer and El Indio. Their back story is the reason that I care about these characters, it tells us why they are who they are. For A Few Dollars More's script has it's humor pumped up in comparison to the first film and I felt that this work. It actually gives the film much more character and helps not make the tone of the film too negative.\n\nSergio Leone has created a film that is much more cinematic and traditional in comparison to the first film but at the same time not trading off the uniqueness of the first film, which was the slow building tension and the close ups of people's faces focusing on their reactions and the emotional facial acting by the actors. This film does increase the beat of the film, with editing that moves the film along at a pace that keeps us on our toes. Leone has definitely have gained much more confidence going towards this film as the film doesn't feel as indulgent as the first and seemed to show much more enjoyment with the story than the first film. This film's budget was much higher than the first film which allowed him to create settings that feel real and lively.\n\nMassimo Dallamano is back as the cinematographer of this film. The film looks much better than the first film and this may be due to the increase in budget and shot at better locations or it could be due to Dallamano and Leone has a much better understanding of what they want for this film. The film still retains that style from the first film with close ups that take it's time to move things along but it's much more improved here as they have used different angles and techniques in constructing these shots, allowing them to feel fresh. Dallamano has the camera move in this film much more than the first. The first film has it's shots set up in a way that doesn't require the camera to move or zoom into anything. This movement makes the film move faster and exciting.\n\nEnnio Morricone comes back to do the score for this film and it's just as great as the first one. The score here sounds much more fuller and dramatic, this may be due to a much larger story and much more characters focused on. Morricone's score here may not be as memorable as the first or third film but it definitely fits with what is shown on screen and it doesn't feel recycled. The film's score feels fast and upbeat, which sound great in moments of the film that have characters riding their horses on the beautiful backdrops. Morricone also has a much lighter and smaller track that plays during the build up of climax, the music that comes from the lockets. It sounds beautiful and it connects with the emotional weight during these situations.\n\nThe film's cast is much bigger in this film and the film is now shared with three characters rather than a main focus on Eastwood. Clint Eastwood is great here as expected but not as memorable as A Fistful of Dollars. Lee Van Cleef brings something different to the film which gives the film much more personality. Leone loves to have actors banter in his films and it's definitely apparent here with the focus on the friendship on both Eastwood and Cleef's characters. Both actors work well together and it's a shame that this isn't the case for the next film. Gian Maria Volonte is back for this film as the antagonist, this time his character is much better written and his acting is much more effective but it may not appeal to everyone as he has increased the dramatics in this film in comparison to the first film.\n\nFor A Few Dollars More is a much better constructed film than A Fistful of Dollars with a bigger and better story and improvements on the acting and photography. The film is great to watch on its own and does not require to watch the first or third film to understand but if you have seen the other films you get to pick up on the small things that Leone has put in this film.",
            "review_date": "2013-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you haven't seen any western movies in your life, start with \"The man with no name\" trilogy. All of them are just above everything else.",
            "review_date": "2013-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "awesomatic of the aaromale spaghetti western movie!! Clint Eastwood \\m/ _/\\_",
            "review_date": "2013-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps not Sergio Leone's best work but more then satisfactory. Clint Eastwood teams up with Lee Van Cleef  delivering gunfights and explosions that make it wonderful.",
            "review_date": "2013-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone's \"Dollars\" trilogy continues to rock with the brilliant sequel For A Few Dollars More.",
            "review_date": "2013-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best of Eastwood's westerns. Very powerful.",
            "review_date": "2013-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good western with some interesting twists in the end.\nIt rises up a new point of view when it comes to Lee Van Cleef playing the role of a good guy.",
            "review_date": "2013-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm no fan of old westerns. I understand they didn't have our technology. But, I expect movies to be made with at least good dialogue and acting. These Spaghetti Westerns are good. I particularly like how they capture the lawlessness and violence of the US / Mexican border (at that time).",
            "review_date": "2013-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the few old westerns I can watch and enjoy.",
            "review_date": "2013-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great sequel to A Fistful of Dollars.",
            "review_date": "2013-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a simple yet fun western. It is technically a sequel, but the cast is the only continuation from the first movie. Just like the first movie, A Fistful of Dollars, none of the characters have much of a back-story or depth. The plot is thin and the structure is more of a series of interesting situations loosely tied together. Normally this is a bad thing but this movie makes up for it in other ways. The main characters may be vague but they have a good-natured chemistry that is a delight to watch. Lee Van Cleef and Clint Eastwood play two mysteriously silent rugged bounty hunters that reluctantly team up. Their lightly humorous dialogue and tough guy mannerisms are what make the movie so enjoyable. There is not a lot of realism to the action scenes but they are fun and exciting. This movie series takes the short crescendo of the western shootout and extends it to a 15-man all out gunfight. It is a major step forward for action movies, making for a prolonged fast pace and way more adrenaline. This is deservedly labeled a classic because it is so successful at keeping things fun and simple.",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bounty hunters off with a personal reason to kill ...master piece",
            "review_date": "2013-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Normally, movie sequel intend to suck. I mean it is just not as good as the original film, right? Well, \"For a Few Dollars More\" is apparently MUCH better than \"A Fistful of Dollars\". Sergio Leone not only recaptures those badass moments from the original, but improved and delivered one hell of a bloody sequel. Our favorite Laconic Bounty Hunter is back, but this time he is not alone. He has to take down an escaped convicted from committing more acts of crime. With the help of a Colonel turned Bounty Hunter, the Man with No Name must find how to work as a team this time. Like the original, this film does a great job in capturing the smooth and glowing world of the wild west. The performances were just like the original, pure amazing. Clint Eastwood doesn't fail again and so does our villain of the film. El Indio, played by Gian Maria Volonte played a MUCH better villain than the one he played in the original. He had a better back story and was more emotional than his portrayal as Ramon. Lee Van Cleef, played a terrific partner to The Man with No Name. He was badass and had the exact same awesome moments Eastwood has in this film and the other combined. Like the original film, I was never bored with this movie. It was just another pitch perfect Western film that deserves to be put on the big screen again. The action was bloodier, the story was much more personal, and the end fight scene was just as good as the end fight from the original. I'd say you go see this film....like now......as soon as you are done watching \"A Fistful of Dollars.\"",
            "review_date": "2013-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fistful of Dollars made the spaghetti western a great genre and For a Few Dollars more elevates the genre even more.  To say the least, the film is amazing.  Eastwood, Van Cleef, and Volonte all give memorable and powerful performances.  The story is simple, but manages to be powerful and very memorable; the same can be said for the films brilliant writing and direction.\n\nI kept the review short simply because you really should spend less time reading this and watch this film.  It's a great sequel to Fistful of Dollars and transits into The Good The Bad and The Ugly very well and is why the man with no name trilogy is so perfect.  In short, this film is full of awe and easily one of the greatest westerns of all time.",
            "review_date": "2013-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a Few Dollars more is everything a great sequel to a great film should be, adding onto its original with a brand new concept and a fresh story to prolong whatever was dynamic about the original. Here we see Clint's extinguished Western outlaw in a partnership to take down another vicious killer, Indio, who has a dark past through a musical pocket watch with a timeless chime. When I think about Westerns, this is exactly what I envision. Men armed with a scenario of life or death for an opportunity that can be only taken once and is gone with the speed of an oncoming bullet. Perfection once again.",
            "review_date": "2013-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a great movie. It improved from Fistful in almost every way. The villain was better, the shootouts were better, and the story was even better. Not as good as the third entry but definitely a great Western.",
            "review_date": "2013-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you enjoy westerns then you'll probably enjoy this one with Clint Eastwood.",
            "review_date": "2013-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Deeper and richer than A Fistful, this is a significant upgrade in almost every way. The direction is tighter and more focused, while utilizing the now famous but then fresh framing techniques that Leone is known by. Similarly to A Fistful, the faces tell the story here, and they don't come much more striking than Van Cleef and Eastwood who own every inch of the screen when they appear. And the music? Ennio Morricone brings the unorthodox and funky sounding, but also the grandiose and the classical, and well none do it better. Anyone who wants to say they are a western fan needs this in their life.",
            "review_date": "2013-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now THIS film I loved. The second in the Dollars trilogy is a thrilling, classic Sergio Leone spaghetti Western, almost as great as \"The Good, The Bad and The Ugly\". Clint Eastwood and Lee Van Cleef are marvelous together as a pair of bounty hunters trying to bring down a gang of murderous bank robbers. It's fun, it's thrilling and even though it's well over two hours, the time seems to just fly by. It's everything I want in a great Western. Again, extra points for the great Ennio Morricone score",
            "review_date": "2013-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a Few Dollars More, the second entry in Sergio Leone's dollars trilogy, may be the weakest of the three, but it's nevertheless, classic western at its finest!",
            "review_date": "2013-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "top ten best western's ever, and one of the best duel scenes ever filmed.",
            "review_date": "2013-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. I love Sergio Leone's movies. This is a great addition to the trilogy. It has great action and acting. I just thought the plot was a little confusing and it left me with some questions.",
            "review_date": "2013-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favourite of The Man with No Name trilogy. It combines some of the best music I have ever heard with some of the best acting I have ever seen. A brilliant masterpiece and definitely worth seeing.",
            "review_date": "2013-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Could be the best\"dollars\" film",
            "review_date": "2013-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone once again changes the western genre with For A Few Dollars More, the second movie in the Man With No Name trilogy. I really couldn't ask for more, since it had more Eastwood, had a chilling soundtrack by Morricone, a great direction from Leone, and an awesome performance by Lee Van Cleef. The chemistry between Eastwood and Cleef made this movie alone, but of course, there's so much more to this movie than that. Once again, there's an interesting story, and this time, it's about two bountry hunters (Eastwood and Cleef) teaming up to take down the leader of an outlaw gang, also known as Indio. All of this leads up to one of the most haunting, chilling finales I've ever seen, and an overall classic western that yet again redefined the western genre. To me, I think the trilogy progressively gets better by each movie, and that shows Leone's improvement as a director. I honestly think Leone is practically an artist with his masterful use of blending the different western elements and showing it through a different lens, and that makes this a must-see western movie. This is my 2nd favorite western movie (The Good, The Bad, and The Ugly being not only my favorite western, but my favorite movie of all time).",
            "review_date": "2013-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not quite as good as A Fistful of Dollars, but managed to split focus between The Man with No Name and the Colonel fairly well, and gave the villain some more development. Very solid, all around.",
            "review_date": "2013-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An improvement over a certain \"Fistful,\" a richer story, gorgeous cinematography, and an exquisite Ennio Morricone score drive the point home.  The story is richer than its predecessor's as there is a strong emotional motivator between the villain and a key good character, greatly enhanced by Morricone's beautiful work.  Eastwood and Van Cleef are a good leading pair, with the former being his zen self with aplomb.  As the second film produced of the Dollars Trilogy, the production value went up and the feel was definitely more epic, in a ramp up to the finale.  This influential film finds Leone on the precipice of making his greatest, most epic works. (6 April 2013)",
            "review_date": "2013-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Vast landscapes and gritty gunfights galore! Love it!",
            "review_date": "2013-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best westerns that I have ever seen.",
            "review_date": "2013-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "PERFECT!! there's  no other word to define this movie",
            "review_date": "2013-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After the success of Fistful of Dollars, Leone returns with another poetically violent and original kind of western in this story of two men taking on the famous evil gunslinger El Indio. Though it is often the least talked about addition in the dollars trilogy, For a Few Dollars More may also be the most action packed. Structurally, it's simple but flawless, and offers the same wonderful photography that films by Sergio Leone are renowned for, as well as another memorable score by Ennio Morricone. Clint Eastwood returns as the man with no name and strengthens the character's legacy, while Gian Maria Volonté's show stealing performance is an underrated compelling portrait of evil and madness.",
            "review_date": "2013-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first, but with a new story and same style. Definitely an excellent sequel to bridge it's predecessor.",
            "review_date": "2013-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably my favourite western",
            "review_date": "2013-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good western film with Clint Eastwood and Lee Van Cleef dove tailing well together. The film follows these two men as they aim to capture Indio, either dead or alive. There is a nice little twist at the end and overall and enjoyable film.",
            "review_date": "2013-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lee Van Cleef almost feels out of place being less belligerent than Eastwood, but their duo is the stuff of western legend. Leone upped the ante from A fistful, and delivered a film so interesting and visually surreal, that it's influence would last for decades.",
            "review_date": "2013-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great movie in the bunch",
            "review_date": "2013-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How could this be rated lower than A Fistful of Dollars? This is a minor masterpiece, and that's only compared to the reputation of Leone's later masterpieces. I loved this from start to finish, unlike the skeletal Fistful of Dollars. I'd recommend this as a good place to start with Leone, being more accessible than the intimidating length and scope of his three masterworks. It's just amazing, full of simply breathtaking shots, haunting music, blah blah. Great, and you won't notice its age once.",
            "review_date": "2013-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This follow-up to \"A Fistful of Dollars\" is even more stylish, humorous, and bloody than its predecessor.  The dialogue is clunky, not because of the poor English dubbing that is common throughout Sergio Leone's spaghetti westerns, but because Clint Eastwood's stogy-chomping protagonist loses some of his mystique when he is made to chat at length with townsfolk or a fellow bounty hunter.  But colorful characters and creative set-pieces more than make up for this misstep.  Lee Van Cleef proved an effective counterpart to Eastwood and would reappear, in a different role, in \"The Good, The Bad, and the Ugly,\" the grandest and last film in Leone's \"Man With No Name\" trilogy.",
            "review_date": "2013-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily my favourite of the Dollars trilogy.And the best spaghetti western ever made.",
            "review_date": "2013-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb spaghetti western yet again from Sergio Leone! In my opinion this surpasses its predecessor in many ways, story, characters. Ennio Morricones score is yet again remarkable and amazingly unique.",
            "review_date": "2013-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Man With No Name returns for another epic western.",
            "review_date": "2013-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A solid entry into the series, and pretty thought provoking.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid western. I love Lee Van Cleef in this movie more than I like Eastwood, though. Does that make me terrible?",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "8. Still a marvelous story, but it just doesn't seem as intelligent.",
            "review_date": "2013-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favourite of the trilogy. Indio's pocket watch chime haunts me in my sleep...",
            "review_date": "2013-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Here again Clint hit the screen with is magnum. Good plot and very good acting.",
            "review_date": "2013-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful. Emotional. Brutal. FfFDM is an excellent concept with an awesome delivery. This movie brought me into westerns and I will not get out. The best of all of it is Morricone's music. I am brought to tears whenever I hear The Musical Pocket Watch. I want to shout from the clay-shingled rooftops \"WATCH THIS MOVIE!\"",
            "review_date": "2013-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst of the trilogy but still the best trilogy ever, along with Lord of the Rings.",
            "review_date": "2013-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly enjoyable western. Sergio Leone continues his epic trilogy with solid storytelling. In many ways \"For a Few Dollars More\" is a better film than its predecessor but it unfortunately doesn't have the same nostalgic feel.",
            "review_date": "2012-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another genre classic, this time with Lee Van Cleef stealing the show.",
            "review_date": "2012-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the most ruthless villains in this western.",
            "review_date": "2012-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a Few Dollars More merits its status as a western classic, thanks to Clint Eastwood's lead performance, Ennio Morricone's musical score, and Sergio Leone's stylized direction.",
            "review_date": "2012-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Starring Clint Eastwood and Lee Van Cleef with director Sergio Leone, this Spaghetti western is the second film in the \"Dollar Trilogy.\" The film opens with two bounty hunters, and in two separate instances we quickly realize their skill in bagging their man. However, when a notorious outlaw, \"El Indio,\" and his gang begin to cause trouble, both men are intent on getting the reward. Reluctantly they agree to join forces and Manco (Eastwood) joins Indio in his robbing of a bank so the two mercenaries can bring him down. The bandits get away with the money and then later they overhear the intentions of Manco and the Colonel, and so they rough them up. In secret Indion has them released, then sends his gang after them so he can get away with the money. However, the colonel took the loot and so the next morning he and Manco systematically mow down the bandits. Indo comes for the money and shares a tense moment with the colonel only to have Manco appear too. Using the chime of a pocket watch, they face off. In the end one man leaves, his revenge complete and the other takes the reward. Although this is not the best Eastwood western, it certainly had some action-packed moments that were very entertaining.",
            "review_date": "2012-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clint Eastwood and Lee Van Cleef - the dynamic combo that made this movie so fantastic.... It's a Sergio Leone's masterpiece trilogy...",
            "review_date": "2012-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "don't fuck with lee van cleef",
            "review_date": "2012-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The bank heist plot is a little more straightforward and a little less interesting than the one in 'Fistful', but a big plus is the steely rivarly/partnership between the bounty hunters played by Eastwood and Lee Van Cleef.",
            "review_date": "2012-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "top notch actioner and a damn good sequel",
            "review_date": "2012-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the purest masterpieces of the entire film company!",
            "review_date": "2012-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable and at times, so cool, that I can't feel my feet! At other times though, this is one of the most badly made films that I have ever seen, but this seems be a genre of polar extremes.\r\n\r\nClint and Van Cleef are brilliant and the story and direction leave you with a fun and gripping movie experience. It's hard to peg this film and really understand it but in the end, who cares!!! Watch and enjoy this masterpiece of confused and indulgent cinema...",
            "review_date": "2012-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie of the dollars trilogy",
            "review_date": "2012-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great western in the \"No-Name\" trilogy, but drags a bit for an Eastwood western.",
            "review_date": "2012-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a Few Dollars More is a highly stylish and grim film.",
            "review_date": "2012-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not just ONE kick ass bounty hunter, but TWO!!! Hells yeah! Great story. And the beginning credits were cool.\r\n\r\n2008 Movies: 112",
            "review_date": "2012-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is good as prequel, and Lee Van Cleef's addition just makes it more interesting to see the show steeling moments compared to Clint Eastwood, though Eastwood scores. Both of the protagonist's intro scene was one of the best in western classics I would say.",
            "review_date": "2012-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another fine western from Leone.  How can you miss with Eastwood and the great Lee Van Cleef in starring roles as bounty hunters chasing a gang of bandits.  Another unforgettable soundtrack from Ennio Morricone.",
            "review_date": "2012-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Leone's 'A Fistful Of Dollars' is a bona fide western classic, but amazingly he managed to top himself with this \"sequel\". Yeah, I know it isn't REALLY a sequel. In fact Leone's \"Dollars\" trilogy actually have no connection with each other, and Eastwood's so-called \"Man With No Name\" actually has many!",
            "review_date": "2012-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now that's how you make a Western",
            "review_date": "2012-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"For A Few Dollars More\" proves that Leone didn't lose his touch; this sequel continues what its predecessor has left with the addition of a second bounty hunter, Lee Van Cleef. The film features strong performances, stylish direction, and a terrific score from Ennio Morricone, making this spaghetti meal even more delicious.",
            "review_date": "2012-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another solid Eastwood Western",
            "review_date": "2012-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For me, this my favorite in the Dollars Trilogy. It is the smaller scale of the three films, but also the most personal for the characters invovled. It is a good old fashioned tale of revenge with Clint Eastwood and Lee Van Cleef being total badasses. I think Eastwood's Man With No Name was more fleshed out in this film and I like how he and Van Cleef's character teamed up to kill a ruthless killer with also a dark past. \n\nGrade: A-",
            "review_date": "2012-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite of the Man with No Name films and vastly underrated.",
            "review_date": "2012-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gritty, exciting, thrilling, these are but a few words to describe For a Few Dollars More. As well as that the film blends in its own humour and doesn't consistently relish in its dark themes, keeping the audience entertained from the opening shot (quite literally) to the duel finale!",
            "review_date": "2012-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More Clint. Almost as good as \"FFOD\".",
            "review_date": "2012-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best episode of the Dollar Trilogy. Atmosphere and music by Ennio Morricone do it's best.",
            "review_date": "2012-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A just realised that Armadillo in Red Dead Redemption is modeled after a town in this movie.",
            "review_date": "2012-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing cowboy movie. Clint Eastwood makes cowboy movies incredible",
            "review_date": "2012-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing cowboy movie. Clint Eastwood makes cowboy movies incredible",
            "review_date": "2012-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This delicious spaghetti western is the best out of the trilogy. The shoot outs and action are on a melodramatic scale ~ savor every moment.",
            "review_date": "2012-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most of this is magnificent but once our heroes team up, things just fall apart. The  plot takes a sort of thirty minute hiatus. When it comes back, its great, but this film could have been, would have been better in fact, thirty minutes shorter.",
            "review_date": "2012-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone gives us a very well done western, a plot very well run and although perhaps no better than the good, the bad and the ugly. If it is a great addition to the dollar trilogy. That's for sure.",
            "review_date": "2012-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great followup to the first film and Lee Van Cleef's characters is a scene stealer.",
            "review_date": "2012-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It lacks some of the mystique that made the first film so entrancing but the Man With No Name's unflappable cool, Ennio Morricone's magnificent score, brilliant sense of compositional photography, and the intense shootouts still makes the film feel like part of the greatest western trilogy of all time. For A Few Dollars More even adds some new elements to the formula with the hugely interesting relationship between the two equally badass bounty hunters and the disturbed villain.",
            "review_date": "2012-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fistful of Dollars, sucked, 40%. Few Dollars More, good, 60%. Good/Bad/Ugly, overrated, 80%.",
            "review_date": "2012-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While The Good, The Bad, and The Ugly is still the best of the trilogy, this is a worthy prequel. It's interesting to see Eastwood and Angel Eyes getting along so well... until the third installment, where they're at each other's throats. Unfortunately, it doesn't benefit from a lack of Eli Wallach.",
            "review_date": "2012-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of few movies that had a sequel that was good and not a disappointment.",
            "review_date": "2012-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are not so many movies that can capture silence and non-verbal communication as well as this movie. Killing for money is not heroic but pays well. Secondly, it is hard to think man-with-no-name being a pig-farmer without excitement of bounty-killing; time for pig farming came much later (Unforgiven).",
            "review_date": "2012-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's every bit as entertaining and funny as a Dollars film would attest, but it's even better because after the small scale FISTFUL, this is the first real taste of the Western grandeur that would infuse Leone's next two films. Lee Van Cleef is highly charismatic, playing a much more honorable character than in THE GOOD, THE BAD, AND THE UGLY, and Eastwood is of course iconic, creating with The Man with No Name and his honorable amorality a new kind of Western protagonist.",
            "review_date": "2012-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best westerns ever.",
            "review_date": "2012-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than the first.  Clint Eastwood is still awesome.  Lee Van Cleef's character is good, too.  Great score and mostly cool cinematography (and no annoying screaming child in white) make this worth watching.",
            "review_date": "2012-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as \"A Fistful of Dollars\" as the shooting skills get a little absurd but still a fun pic.",
            "review_date": "2012-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The second, and equally enjoyable entry in the Dollars trilogy sees the return of the legendary Man With No Name.  This time around, however, the characters and their motives are much more complex.  This adds another dimension to the story, in that it's not just a mere display of gun-play and violence.  There is more of a method to all the madness.  Stunning shots of barren landscapes, tight close-ups, tense stand-offs, and the revolutionary musical talents of Ennio Morricone are all just as important to the cinematic experience as the first film, and its clear that everyone involved was a lot more comfortable and confident this time around.",
            "review_date": "2012-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The second of the Dollars Triology...The music is as mesmerizing as ever from Ennio Morricone...Clint Eastwood is as enigmatic as he has always been...this is probably the first western movie of Sergio which starts with a dialogue...probably there is not much left to comment as this movie is already in the list of the must watches...good movie...",
            "review_date": "2012-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Here is a gloriously greasy, sweaty, hairy, bloody and violent Western. It is delicious. \" Roger Ebert",
            "review_date": "2012-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In a way, it was the bones of the trilogy.",
            "review_date": "2012-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slightly smarter and more original than its predecessor, and a worthy continuation of its groundbreaking cinematic style.",
            "review_date": "2012-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its got that old school feel, ADR and all, the soundtrack is great and its got Clint. A great sequel.",
            "review_date": "2012-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's way more entertaining/satisfying than its dull predecessor through its better directing, story, characters and music composition. Weak points are probably the choppy acting and overdone style, but they also add to the fun. I really loved it throughout, one of my favourite Westerns so far. Deserves its classic status.",
            "review_date": "2012-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So good! The man with no name is such a great character. I can hear the whistling now... Ennio! You are the best.",
            "review_date": "2012-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone once again creates a master piece in this follow up to Fistful of Dollars. Eastwood plays his part brilliantly and everyone else provides excellent performances to help this film create one of the best if not the best trilogy ever!",
            "review_date": "2012-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone is a perfectionist behind the camera, you can see if from the vast selection of cinematic techniques that fill this film. Without his example maybe action films would not be the same as they are today.",
            "review_date": "2012-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The follow-up to A Fistful of Dollars, and the second of the trilogy, Leone proves he doesn't need the template of Kurosawa's Yojimbo to make the character his own and to create an inventive and superb 'spaghetti western.' Not the best of the trilogy, but most certainly an essential classic.",
            "review_date": "2012-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ole Indio.  This is a classic. Watch it",
            "review_date": "2012-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Motivated by Ennio Morricone..:|",
            "review_date": "2012-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok ok im a hudge Clint Eastwood Fan!!",
            "review_date": "2012-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a Few Dollars More was an awesome spaghetti western and was as badass as the original A Fistful of Dollars, and its rare that a sequel is just as good as it's predecessor, so that's an added benefit.Cling Eastwood is as badass as ever in his iconic unnamed character, and to make things more epic he teams up with fellow badass western legend Leo Van Cleef, and their complex character chemistry never let's you know if they're friends or enemies. As it is I'm still unsure to this day.And Sergio Leone's direction is immaculate because no other man could deliver this film so perfectly, and its iconic for his trademark direction and the awesome musical score by Mastermind Ennio Morricone. Honestly, there's just too much awesome cheap action in For a Few Dollars More for you to pass up, and it embodies the spaghetti western feel with awesomeness in its atmosphere and good pacing, as well as impeccable intensity when the story asks for it, so it's hard to find any flaws with For a Few Dollars More, and it matches its predecessor greatly.",
            "review_date": "2012-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one will strike you in some scenes, and will touch you in others. Films like these are known for their cinematography and scale, but this one really knocks the hats off the others in the Dollars trilogy (see what I did there?).",
            "review_date": "2012-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 2nd of the \"Man with No Name\" trilogy is a great film, but not the best (that being the 3rd film \"Good, Bad, and the Ugly).",
            "review_date": "2012-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining in a Way That Only a Western Can Be. Looking Forward to Finishing the Trilogy Sometime Soon.",
            "review_date": "2012-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite of the trilogy",
            "review_date": "2012-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Grit, Grime, and Greatness",
            "review_date": "2012-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a few dollars more, you can get \"A Fistful of Dollars\" and its sequel; a $30 value for only $14.99. This title really does sound like paid programming, and hey, I can understand why, because I'd imagine that around this time, Sergio Leone couldn't stop thinking about money after Akira Kurosawa's lawsuit. It would appear as though \"A Fistful of Dollars\" was either ripping off more than just other westerns or just ripping off westerns so much that it actually fell into the trope of being a westernization of an Akira Kurosawa film. Man, with \"Seven Samurai\" turning into \"The Magnificent Seven\" and \"Rashomon\" turning into \"The Outrage\", I'm willing to bet my own fistful of dollars and a few dollars more that if Terrence Malick ever does a western, it will probably be a remake of \"Dreams\"... or \"I Saw Dream Like This\" or \"Such Dreams I Have Dreamed\" or \"Yume\" or whatever that movie that no one - including myself - saw is called. Those Japs are sure weird with their titles, whether they're making it too long and descriptive or simply giving it too many alternate names, though not quite as many alternate names as some of these Sergio Leone westerns, especially \"Duck, You Sucker!\" or \"A Fistful of Dynamite\" or \"Once Upon a Time... the Revolution\" or \"Giù la testa\", all of which really were the same film, and I mean that literally, not in that they were all following a formula, or at least not as far as titles are concerned, because Leone was clearly not that good at coming up with titles outside of \"A Fistful of\" or \"Once Upon a Time\". Hey, maybe Leone should have been a little bit more formulaic with his titles, because this is officially supposed to be the \"Dollar Trilogy\", so I have no idea where he got the title \"The Good, the Bad and the Ugly\" after two movies with \"Dollars\" featured pretty prominently in the titles, or, for that matter, where he even came up with \"Dollars\" in the titles to begin with, because I'm not noticing a whole lot that has to do with money in these films. Hey, Leone could title these films anything he wanted to, just as long as those titles were attached to a good film, something that this film definately is, though not without a few hiccups.\r\n\r\nRunning nearly 40 minutes longer than \"Fistful\", this would be considered quite the expanded sequel, when really, the film, as a story, is not that much longer, with the rest of time is filled out by long periods of pointless, dragging nothingness. I'm kidding, it's not just the slower points that meditative on total nothingness, for although the story is very much broader and more layered, the film limps far too often, getting to its point at a far too steady pace, or at least it feels that way, seeing as how the transitions between character focus are so jarring that the breaks in the exiting story really glare. It's good to see that Sergio Leone was working on taking out that hurried feeling that plagued his preceding films, but maybe this film is a little loose, feeling a touch limp in its progression, with a dry dilution of consistent oomph and even a few dull points making it all the worse. The film is not at all consistently boring, though it is steady to a fault and only occasionally with steam, being plagued by loose story structure and some spots in the in story flow. Were the film tighter, it would have been a superior sequel, and yet, as it stands, it breaks even enough to come out on par, at least. Sure, the film takes its sweet time getting to the point, yet the wait itself is enjoyable enough to get you by until it reaches its point, which is, of course, worth that wait.\r\n\r\nIn the latter parts of \"Fistful\", grit and bruality audaciously kicked in and pulled a lot of gutsy moves that upped tension and intrigue. This film is more consistent with that grit, maybe not to where it transcends its many dry spells and storytelling faults, but the film has the guts to pull some unique and heavy twists and turns, and knows how to use them, with Sergio Leone manipulating the offputting environment - really brought to life by fine production designs - and Ennio Morricone's sweeping, defining score as effective supplements to the atmosphere, which may not always deliver on the oomph, but really hits hard when it does, especially when the tension-riddled and well-staged action comes into play. Still, although the film's expansion gives us an extra dose of raw grit, the added layers and scope also gives the film more room for entertainment, and while that entertainment value lapses quite a bit throughout the film, there are more points where the film does fill those openings for entertainment. The film's focus is more versatile, with more characters feeling written more like genuine humans and less like plot devices, and the performers behind those characters make that additional depth all the stronger. Charm and memorable uniqueness is found in even some of the most briefly-present, while the highter roles earn investment, whether it be Lee Van Cleef as the reliably skilled, yet offputtingly mysterious Colonel Douglas Mortimer or Gian Maria Volonté as the effective love-to-hate dirtbag antagonist El Indio. Still, we all know that it's gonna come down to Clint Eastwood, who once again brings home fiery charisma and compelling mystery as out nameless protagonist, further solidifying his presence as both a worthy icon and deeply involving lead. The film is not at all spotless, yet it pulls moves that are strong enough to evoke the predecessor, whether when your placing something on par with a strength in \"Fistful\" or deeming something better, and with plenty of depth to break up, if not intensify entertainment, this follow-up stands as a worthy companion piece, as well as its own enjoyable piece.\r\n\r\nIn the end, the hurrying that plagued Sergio Leone's previous efforts have all but diminished, yet this film makes up for that with many a long period of nothingness, made worse by faults in storytelling, some dull spots and a consistent underwhelming dryness in the air, leaving the film to run the risk of falling beneath the enjoyment value of the predecessor, only to split the difference by adding more scope and audacious depth, grit and tension to make more powerful the fair deal of truly engaging moments and sharp action, while retaining general entertainment value, intensified by a slew of charismatic performances - especially those by leads Lee Van Cleef, Gian Maria Volonté and, of course, the real man's man with no name, Clint Eastwood -, thus making \"For a Few Dollars More\" an overall satisfying and compelling equal continuation to Leone's classic saga.\r\n\r\n3/5 - Good",
            "review_date": "2012-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slammin follow up to \"Fistfull of Dollars.\" Both Eastwood and Van Cleef are good in this one.",
            "review_date": "2012-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This story forces the man that the audience knows as a loner to team up with a man who is his equal to take down a gang of bandits. Although this film is usually overshadowed by \"A Fistful of Dollars\" and \"The Good, the Bad and The Ugly\", it's equally as strong because it's story stands out like the rest of Leone's films.",
            "review_date": "2012-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "sometimes vicarious living is wonderful. can you spot the car at the beginning?",
            "review_date": "2012-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When the pocketwatch stops playing, something is going down! Not as good as the 1st or 3rd, but it's entertaining",
            "review_date": "2012-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely better than the first film in the trilogy but still not my cup of tea.",
            "review_date": "2012-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like the final standoff with the music from the pocket watch playing.",
            "review_date": "2012-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "though it may not be as powerful as its predecessor, it still packs a punch, and through the whole movie i was wondering what colonel mortimer would do at the end. regardless, it ended cleverly and did not disappoint.",
            "review_date": "2012-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone's \"For a Few Dollars More\" has a bit more to offer than \"A Fistful of Dollars.\" It clearly isn't great in my opinion because it feels like Leone has not really found what actually works from start to finish.  There are rough edges, most notably in the climax where it just seems uneven, at times what the characters do and say works, at times the presentation seems disjointed. Also, the film tries to dig deeper, however it is unsure of what to do, relating to the past of Van Cleef and Volonte's character. Ennio Morricone's music is splendid! I particularly admired the sequence where Van Cleef and Eastwood are face to face. The performances are fine, could have been better, especially of Volonte, since he is the main villain. Then again, I think it really falls on the director's execution. The great Klaus Kinski definitely made his mark in the short screen time he had. Not much else to say but that it was still entertaining, I have great admiration for Westerns! A good picture, for sure.",
            "review_date": "2012-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eastwood kicked a ton of ass in this film!",
            "review_date": "2012-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was my favorite movie out of the man with no name trilogy",
            "review_date": "2012-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even better than the first film in the series! With a more interesting plot and fantastic performances from Eastwood, Lee Van Cleef and Gian Maria Volonte this ranks right up there with the best westerns!",
            "review_date": "2012-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "long live the spaghetti western!!!",
            "review_date": "2012-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this again just last night. the whole thing seems huge; I'm surprized the narrative really holds together at all.",
            "review_date": "2012-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this is the first time that I've rated a Sergio Leone film lower than 5 stars, but I have my reasons. For a Few Dollars More, being the third in the \"Dollars trilogy\" (or the \"Man with No Name\" trilogy, if you buy into that marketing strategy), is not quite up to snuff with the other entries in the series - or even in the rest of Leone's body of work. First of all, there isn't a clear focus on who is who and what is what... that is we can't really connect with the characters because we have a difficult time latching onto their characters. It doesn't make for very compelling drama. Second of all, Eastwood's character seems to take a backseat in this one. He doesn't do a whole hell of a lot and is even a bystander in film's climactic shoot-out. That just doesn't sit well with me. The ideas are there, the score is great and Gian Maria Volonte's villainous role is just superbly performed, but it feels like a step back to me. I love Sergio Leone's work, but this feels weak, and that's saying a lot being that everything he ever directed is basically a masterpiece of the art form. I don't discount it, but it isn't the strongest entry in the trilogy.",
            "review_date": "2012-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone's For a Few Dollars More, the second movie to The Man With No Name trilogy, is yet another classic for the western genre and just as good as the first. For a Few Dollars More is about two bounty hunters, The Man with No Name and Col. Douglas Mortimer. These are two of the best shooters in the west and always catch who their hunting down. One day one of worst criminals, El Indio, gets broken out of prison which brings The Man with No Name and Mortimer together. These two killers team up to find this madman. The Man with No Name is in this for the money and Mortimer is here to seek revenge on Indio from what he did to him in the past. A Fistful of Dollars was a magnificent western and in the sequel For a Few Dollars more it doesn't disappoint what so ever, this movie is everything you would want for a sequel. The thing about this series is that each movie seems to get better and better unlike some movies were the movies just get worse. Just like the first movie this is a western classic. The story to this movie is just great because it was clever and fun to watch. There is never a dull moment in these movies and all the events in this movie are just perfect for the movie. Just like the first movie the shootouts are exciting and has some funny comedy. All the actors in this movie are great just like the first movie. Clint Eastwood is back and still the cool guy he was in the first movie but he's not the only cool guy in the movie. In this movie Lee Van Cleef joins the series and his performance in this movie is just amazing. His character is just like Eastwood's, clever, smart, and deadly. Every time Eastwood and Van Cleef are on screen together it's just great because they were a perfect duo in this movie. Overall For a Few Dollars More is another Western classic and if you liked the first you'll be sure to like this one.",
            "review_date": "2012-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic in its truest form. Leone manages in every shot, every scene, every little facial expression and every character quirk, albeit with a bit of editing difficulty for the released production, to portray the craft, the will, the greed and downright arrogance of man. He certainly had a heavenly gift (not unlike Kurosawa). And I cannot emphasise how much grandeur Morricone brings to his films. Sheer...fucking...geniuses...both of them!",
            "review_date": "2012-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gets very close to \"The Good, The Bad And The Ugly\" quality.",
            "review_date": "2012-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Keeping the gorgeous stylization from the first installment was a solid choice, but now adding a far superior storyline, involving some pretty serious stakes, was an even better one. I like this film quite a bit more then the first. For one, I wasn't so distracted by the cooler then cool \"Man With No Name.\" Leone refrained from the overwhelming amount of one liners and flashy gun tricks in order to bring more depth to the character, a very effective decision. I also appreciate the extended length of many of the scenes which was seriously lacking in the first. Leone never rushed through them, but instead took the necessary time to let us soak up every ounce of this boiling plot. Finally, bringing in Lee Van Cleef as Eastwood's counterpart was a brilliant addition. They have genuine chemistry together which only adds the the films greatness. This is the perfect film to follow up to an introduction like the first. I'm greatly excited to see how this fantastic series will conclude!",
            "review_date": "2012-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Leone classic",
            "review_date": "2012-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Western Spaghetti Classic....with a duel",
            "review_date": "2012-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though not as essential as its predecessor, For A Few Dollars more shows Leone's style evolving. Nice addition with Lee Van Cleef as well.",
            "review_date": "2012-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was another great western and a great sequal. For me though I always preferred the first and the third but I still loved the film.",
            "review_date": "2012-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i loooooooooooooooooooooooooooooooooooooooooooooooove this movie and i recommend it to everyone who would like to watch a movie.",
            "review_date": "2012-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OK but not great spaghetti western",
            "review_date": "2012-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fleshy, sweaty, violent Western. 4 stars.",
            "review_date": "2012-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "better than original in many respects but just as awesome as original. the soundtrack is good and much of the music is repeated from original.",
            "review_date": "2012-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Where life had no value, death, sometimes, had its price. That is why the bounty killers appeared.\"",
            "review_date": "2012-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For A Few Dollars More centers on The Man With No Name (Clint Eastwood) teaming up with a bounty hunter (Lee Van Cleef) in order to bring down a crazed desperado (Gian Maria Volonte). This sequel improves upon its predecessor by featuring a more emotionally resonant story that better showcases the strengths of the filmmakers. Eastwood and Van Cleef are at their gritty best while director Sergio Leone frames every scene with fiery and suspenseful intensity. It's almost needless to say that nobody can use music as a narrative device with the same flair as composer Ennio Morricone, but I'll state it just the same.",
            "review_date": "2012-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone's second western appears more folk legend than film.  Revenge, love, and greed set to Ennio Morricone's apparitional score make For a Few Dollars More Leone's best.",
            "review_date": "2012-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is just as thrilling and grim as the previous entry in the Dollars trilogy but it does suffer from a few more lulls in the script where there hadn't been any before.",
            "review_date": "2012-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good, but not great.",
            "review_date": "2012-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "About as good as \"Fistful of Dollars\" but has a better villain and a better showdown at the end (that locket music is haunting, too).",
            "review_date": "2012-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saying this isn't as good as the others is like saying Godfather wasn't as good as Godfather 2. The fun still roles, Eastwood's the man!",
            "review_date": "2012-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is by far my favourite Western. The scene where El Indio gets out the pocketwatch for the first time is on my list of all time great scenes. The tension between the two protagonists is unbearable whilst Morricone's amazing score cranks it up even further. All the time the chimes of the pocketwatch play down to a fateful conclusion. Van Cleef out cools Eastwood in this one -'This train stops at Tucumacari'.",
            "review_date": "2012-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A significant step forward from A Fistful of Dollars, with the usual terrific compositions, Morricone score, and taciturn performances.",
            "review_date": "2012-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my most favourite Western ever, directed by the brilliant Sergio Leone. It stars the cool Man with No Name (Clint Eastwood), who in this is up against bounty hunter Col Douglas Mortimer (Lee Van Cleef), to capture dastardly bandit Indio (Gian Maria VolontÃ¨) dead or alive for a massive reward. Full of the best gun fights, shoot outs and stand offs, in a vibrant world full of gangs and twisted strangers. The film also has an incredible music score from Ennio Morricone. This is Clint Eastwood and Sergio Leone at their best.",
            "review_date": "2012-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A real step-up from A Fistful of Dollars, you can see how Leone had learned from the earlier film. There's less longeuers (though some, which is a shame), better pace, more warmth and more wit (which seems strange I know in a film with so many violent incidents). Really it's an excellent film that if it had fifteen minutes or so shaved off would have been perfect.",
            "review_date": "2012-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Certainly underrated, this film is grossly overshadowed by its successor The Good, the Bad, and the Ugly. Of the three films from the so-called Dollars Trilogy, this film is the deepest and most mature. From this reason alone it serves as a better film than The Good, the Bad, and the Ugly, which is essentially just a popcorn movie with good photography.",
            "review_date": "2012-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The sequel to A Fist Full of Dollars nearly reaches the heights of the first film. It's arguably better, since it includes three deeply developed characters (and two American actors along with the impressive Gian Maria VolontÃ¨ as Indio) unlike the first movie (which really only had one character - the Man with No Name - along with a bunch of useful composites to drive the awesome plot). \n\nLee Van Cleef was f-ing awesome. No other actor (aside from Eastwood and John Wayne) works better in a Western. \n\nThere's one other area where this improves upon the original: the music. Ennicio Morricone gives us pounding soundtrack that's actually an important part of the plot. It's not quite as good as the score for the Good the Bad and the Ugly, but that one may have been the best ever produced.\n\nOne final note: the choices for Italian actors sometimes creates hilarious results. Indio's gang is full of some colorful weirdos. The english dubbing is a bit better, as well.",
            "review_date": "2012-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as epic as \"A Fistful of Dollars,\" but thanks to Clint Eastwood's performance and pulse-pounding action, this movie is great, nonetheless.",
            "review_date": "2011-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I own this on DVD and on Blu-Ray in a three movie pack along with:\n* Fistful Of Dollars (1964)\n* The Good, The Bad And The Ugly (1966)\n\nand i also own the \"Two-disc collector's edition\" DVD.",
            "review_date": "2011-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So good, so badass!! Lee Van Cleef steals the show. The last 25 minutes are outstanding!!",
            "review_date": "2011-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "100% classic spaghetti western",
            "review_date": "2011-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone is in my top five of the greatest film directors of all time and this film helped keep the ball rolling.",
            "review_date": "2011-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The second of the Sergio Leone's famous dollars trilogy, and I frankly enjoyed it a lot more than a Fistful of dollars that has set the tone for better movies, including the good, the bad and the ugly that was released a year after this second installment. The addition we had in here was the sublime performance of Lee Van Cleef portraying Colonel Douglas Mortimer, who partnered up with the man with no name, with an equally strong performance delivered by Clint Eastwood. The two bounty hunters had to work together to take down Indio and his partners, one of the most fearful gangs in the west. Ennio Morricone returns with the famous whistle tune that spaguetti westerns became characterized for. The small watch playing a little tune was a great and intelligent subplot thrown by Leone to create extra tension during shootouts. \nDefinitely the most underrated movie of the trilogy, and still lives in the shadow of the good, the bad, and the ugly.",
            "review_date": "2011-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The sequel to A Fistful Of Dollars, this is a fantastic follow-up. It has everything the first film has and the characters are more three dimensional and interesting. While, to be perfectly honest, I enjoyed the first film had slightly more, I wouldn't say this is the inferior film. The only flaw I can think of (and this is a personal opinion) is that the film boasts both brilliance and complexity, yet lacks some of the charm that is present in the other two of the series. As I say, this is a personal opinion, and most seem to think higher of this film, but there it is. Anyway, not to be negative, I still think it is a brilliant and fascinating movie, and all the praise it recieves is justified.",
            "review_date": "2011-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movie's I've ever seen. This movie has it all: great acting, memorable story, awesome actors, good humor. It's really really good.",
            "review_date": "2011-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant sequel with Clint Eastwood as the man with no name even though people call him Manco.\r\nAlso stars Lee Van Cleef as a bounty hunter who forms a partnership with Clint and goes after a killer who is worth a lot of money.",
            "review_date": "2011-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "These Clint Eastwood spaghetti westerns have an unmistakable charm!",
            "review_date": "2011-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cool western. Great music. Sweet ending. Two bounty killers teaming up... sweet.",
            "review_date": "2011-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a step up from the first",
            "review_date": "2011-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Proving itself to be even better than its predecessor, Sergio Leone's For A Few Dollars More is a genuinely spectacular and high quality film that features a complex plot and brilliant performances from Clint Eastwood and Lee Van Cleef.",
            "review_date": "2011-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another must-see Italian speghetti western.",
            "review_date": "2011-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The addition of Lee Van Cleef puts this one above it's legendary predecessor. Eastwood is at the top of his game, once again.",
            "review_date": "2011-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Westerns not a favourite genre but have decided to tip my toe into a few \"classics\".  This had a very intense last 30 minutes and of course an excellent soundtrack.",
            "review_date": "2011-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even better than the first one",
            "review_date": "2011-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant sequel, even better than the first. Loved it. Another great Sergio Leone movie. Eastwood at his best.\r\nBuilds up hype to the legendary third film.",
            "review_date": "2011-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A finely constructed yet badly toned Western flick that seems to be much better than its predecessor, but--surprisingly--isn't.",
            "review_date": "2011-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this one, I am the Dollars Trilogy's biggest fan.",
            "review_date": "2011-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A real improvment from a fistfull of dollars, just a year had gone by but everything was really much improved, the cinematography was great and a really good stand alone film...not just the \"movie before the good one\" some very innovative scenes and humor..and what sticks out there is the scene when they step on eachothers toes and shoot the hats....gotta have been awsome in 65, still is today aswell.",
            "review_date": "2011-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The thing I love about Leone's westerns is that they feel like so much more than a western. They have richer characterizations and plots than just archetypes and cliches.  This is a hell of a movie. It might be the best of the so-called \"Man With No Name\"  or \"Dollars\" Trilogy.  Lee Van Cleef is just as badass as Eastwood is.  Morricone's score is pretty awesome too, I love the motif of the little watch jingle.  I enjoyed every minute of this one, and while \"The Good, the Bad, and the Ugly\" is a great classic epic western...this one is probably my favorite of the three.",
            "review_date": "2011-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With pulse-pounding suspense, a smouldering soundtrack and two staggering lead performances, Sergio Leone's second instalment in the 'man with no name' trilogy is tremendously entertaining and totally unforgettable. Eastwood and Van Cleef ooze coolness and the film's sleek cinematography renders almost every shot a work of art. At times the narrative is sluggish and the film's secondary characterisation is vague, yet Leone's direction is superb and the narrative is gripping from start to finish. A delicious classic of the Western genre and a real must-see movie.",
            "review_date": "2011-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On a technical level, The Good the Bad and the Ugly is a more well made spaghetti western. On an entertainment level, this film is superior, even more so than A Fistful of Dollars. An engaging and surprisingly connective western.",
            "review_date": "2011-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best westerns",
            "review_date": "2011-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic! Great movie",
            "review_date": "2011-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Volonte steals the movie from Eastwood and Lee in many ways.",
            "review_date": "2011-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For A Few Dollars More is the second part of what is commonly known as The Dollars Trilogy. What seperates good movies from great films is legacy, and how the film stands the test of time, and this film does it wonderfully. Unlike \"A Fistfull Of Dollars\" (1964), this story is completely origonal, and so simple, but so effective. We are also introduced to Lee Van Cleef, who, when paired up with Clint Eastwood's character \"The Man With No Name\", become one of the most badass killing teams that has ever graced the screen. The battle/dueling scenes are classic, and are quite epic to watch at times. An almost flawless film, but like the first part, I have to complain about the the audio, which at times is so off, actually takes away from the impact the scenes have to offer (for example, a man falls to the floor and dies, but the gunshot doesn't go off until two seconds later). That shouldn't be a surprise as the film cost almost nothing to make, and was edited in cheap Italian studios. For A Few Dollars More has enough gunshots and explosions to make anyone experience something fantastic.",
            "review_date": "2011-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "better than original in many respects but just as awesome as original. the soundtrack is good and much of the music is repeated from original.",
            "review_date": "2011-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most complete and spectacular of Leone's westerns, this really boils down to the once in a lifetime performances of Clint Eastwood and Lee Van Cleef. As world-class bounty hunters chasing the same contract, the two agree to an uneasy truce before turning every trick in the book to double-cross and one-up each other. It's an unrelenting barrage of stern-faced masculinity, bravado and marksmanship, with filthy hired hands perfectly willing to trade bullets around every other corner. As with each of the director's dust-soaked pictures, this film covers for its small budget with an excess of personality and buckets of atmosphere, which results in a tougher, bolder, more genuine take than the most expensive Hollywood blockbusters of today. The infamous showdown with a truly despicable set of bounties may be what sends this picture riding off into the sunset, but it's a quieter scene earlier in the story that's always stuck with me: two grizzled old hunters trying to impress one other with nothing more than an empty street, a set of pistols and a pair of bullet-riddled hats.",
            "review_date": "2011-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The last 10 minutes are perfect, the beginning of the end for the Western.",
            "review_date": "2011-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A satisfyingly original western with many a great and oddly cartoonish action scene.",
            "review_date": "2011-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The second in the \"Dollars\" trilogy has plenty of great laconic tough-guy action, a decent enough plot, and some dandy acting from Eastwood and Van Cleef especially, and the villain, \"El Indio,\" is actually given a millimeter or two of depth. But a lot of it's silly, substituting stylization for sense, and there are some odd choices (e.g. a key device in the film is the gun fight when a musical watch stops playing, but in the scenes when this occurs, there is often intrusive music playing over what ought to be the key cue!). I'd call it a semi-classic.",
            "review_date": "2011-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What Sergio Leone gets right is the look of the period. Those sprawling empty spaces outside the townships, the saloons, the bounty posters etc. Apart from central characters, the extras he use for comedy does a job similar to what actors in similar roles do in Jackie Chan's dubbed movies. I don't understand why this movie is rated R as there is no swearing, excessive killing but hardly any graphic violence, a little nudity that could have been done without. The lead characters are extremely stylized, it is hard to connect with their situation as they seem to popping bad guys in the most ridiculous way possible. It features most things that are common in a western - railroads, bank heists, prison breaks, bounty hunting, revenge etc. It is an entertaining film with a conventional and neat story but could have done without a lot of sugar padding.",
            "review_date": "2011-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The second film in the Man With No Name trilogy. Great",
            "review_date": "2011-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "super stylish and pure fun to watch.Eastwood and Van Cleeve are fantastic.Watch for Maria Volente's character' Indio'.might have inspired Gabbar Singh's character in Sholay.",
            "review_date": "2011-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best westerns ever made. The music, the characters, the action all flow together perfectly. I loved the reveal at the end of the flick that illuminates upon a certain characters true motives. The villain of the picture was great sinister, and sadistic. Really a must see.",
            "review_date": "2011-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another masterpiece, perhaps my favourite in the Dollars trilogy?",
            "review_date": "2011-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favourite of the Dollars Trilogy. There's just a level of fun in For a Few Dollars More, that there isn't in the other films. The chemistry between Eastwood and Van Cleef is fantastic, and while maybe not as good as the scores for the two other films, Morricone's score is still excellent. I love the use of the watch chimes. Plus it has one of the best villain in film history!",
            "review_date": "2011-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone's For a Few Dollars More, is the second film in his acclaimed dollar trilogy. Once again we follow Clint Eastwood as the bounty hunter, the man with no name, in this film he goes under the name Manco. This time he's after the big score, to capture over a dozen bandits who have stolen money from a safe. But He is not alone, he have to work with another bounty hunter named Col. Douglas Mortimer (Lee Van Cleef) who's motive is revenge, not money. The most interesting new element in this picture is of course Lee Van Cleef's character, with might seems like a villain that every body is afraid of. But we get deeper into his character, and we start to care and sympathize with his goals. I also admire his fearlessness, specially in the scene where he light a match on The Hunchback's (Klaus Kinski) hump. An amazing scene with no dialogue, just a lot of tension between both characters. Thumbs up.",
            "review_date": "2011-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The middle element of Sergio Leone's \"Dollars\" trilogy, between \"A Fistful of Dollars\" and \"The Good, the Bad and the Ugly.\" In my opinion, this is the best of the three, although there isn't much in it. A little more complex, ambiguous and interesting than \"A Fistful of Dollars\", and doesn't seem to lose its way like \"The Good, the Bad and the Ugly\" does at times. But what the heck. All of them have great minimalist cinematography and superb Ennio Morricone scores and this trilogy changed cinema forever by bringing ambivalent moral codes and real characters into westerns. See them all.",
            "review_date": "2011-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The MUST see of all Eastwood westerns.",
            "review_date": "2011-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Favorite of the series",
            "review_date": "2011-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As slow as it is at times, Sergio Leone's For a Few Dollars More is a magnificent masterpiece that can speak a language so profound, words are not needed. In some of the most deep moments in this film, eyes do all the talking, and with the superb acting by Eastwood, Cleef and Volontia, it is easily captured. The action sequences are quick, brutal and methodical, encapsulating the character of the perpetrator. This film will always be known in history as one of the best. A parent to today's children.",
            "review_date": "2011-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Man wth no name flicc.....\"This train will stop at Tulcomcarri\".....lol",
            "review_date": "2011-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than A Fistful Of Dollars, but nowhere near as good as TGTBATU. It was not my intention, but since Netflix loves me so much, they sent me this one last, even though I had the correct order of the 3 films in my queue...whatever. So, as I was watching this one with my dad, we realized a few interesting things. Lee Van Cleef plays a different character, he's a good guy in this one! Gian Maria Volonte also plays someone else. And I kinda think Clint plays someone different in all 3 too, but I'm not sure yet. Ehh, whatevs. Another fantastic score from Morricone, and excellent camerawork from Leone. These are easily 3 of my favorite westerns (even though they're not really westerns...maybe we should call them spaghetti easterns!)",
            "review_date": "2011-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite of the \"Dollar\" trilogy.  Leone's screen compositions and timing are exquisite, Eastwood seems to be having a mischievous blast, and Van Cleef adds an aura of mystery to the proceedings.  What puts it on top is its emotional edge, which isn't present in the other films.",
            "review_date": "2011-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Goes down in my list as the 2nd best western i have seen...Clint Eastwood Lee Van Cleef and Sergio Leone are deadly together......Gian Maria Volonte is superb as Indio.....great music....great plot...great buildup of the story.....\n\nClint Eastwood is brilliant...but i was surprised by Van CLEEF...his best definitely...and Gian Maria is pure evil....One of the greatest Westerns of all-time...one of the best movies of all time in fact.....Sergio Leone take a bow....",
            "review_date": "2011-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone is one of cinema's greatest directors. The second part in his Dollars trilogy, For A Few Dollars More is is an astounding sequel to For A Fistful Of Dollars. This follow up film is grand, and epic. This film is even bigger A Fistful Of Dollars. With every film that Sergio Leone made, he would outdo the next one. A tremendous, talented director, Sergio Leone is the only director in history to perfect the Western genre and deliver constantly entertaining Westerns. Clint Eastwood returns in top form as the man with no name. Accompanied by Lee Van Cleef who also star opposite Eastwood in the third part: The Good, The Bad and the Ugly, Sergio Leone's second film follows two bounty hunters (Eastwood, Van Cleef) who decide to team up to capture a criminal by the name of El Indio, brilliantly played by Gian Maria Vonlonte. As usual, Ennio Morricone's wonderful talents are used here and he delivers one powerful score. Morricone and Leone were an incredible team and their efforts are legendary. For A Few Dollars More has everything you'd expect from a Leone Western. A great story, mixed with drama and action. Leone was a master storyteller and I admire everyone of his films. I think that his films really revolutionized the way people make movies. For A Few Dollars More is an epic follow to A Fistful Of Dollars, and with that said, it's really hard to pick a favorite Sergio Leone Western. Each of his films are so well crafted and plotted that it's impossible to dismiss him. He was a powerful story teller, but I do not view him as a filmmaker, I view him as an artist. His pictures were art. Simple as that. This is yet another terrific piece of cinema that true film buffs will enjoy.",
            "review_date": "2011-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I started the trilogy the other way round... The movie purposefully gets slow at instances to leave the Sergio Leone effect... Clint and Van Cleef both are bloody cool... The end is nerve-wrecking... The typical Leone touch (read Super-natural touch) in music as well as story... Must watch :)",
            "review_date": "2011-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The second installment of the cult classic Spaghetti Western trilogy from Sergio Leone and Clint Eastwood is a unique experience. The director's approach to the Western movies stands in stark contrast from the so called Classic Westerns made in America. The adjectives to describe the director's style would be sweaty, dirty and unforgiving.\n\nMuch of the movie's strong resolve is thanks to the main star of the show. Back in the 60s the rather unknown TV show star Clint Eastwood really hit gold with Sergio Leone's Westerns. In the movies he pretty much defines his future career as a tough man with few words. The For a Few Dollars More as a movie can be considered as an evil and twisted triangle between the three main stars of the show. The main star being Clint Eastwood as the silent bounty hunter Monco who is looking to strike rich by catching and collecting reward from a rampaging group of desperados. Lee Van Cleef's character Col. Douglas Mortimer is after personal revenge and finds it beneficial to work together with Eastwood's enigmatic character. The collaboration of these two men take them to hunt down a common foe Indio, by Gian Maria VolontÃ (C), who is a ruthless outlaw out there to bring the world down burning. \n\nThe story is easily approachable, straight to the point and fits well for the movie as it gives ample time for the actors to define their characters. Combining the unique style of the directors with the excellent performances by all of the main stars of the show, the For a Few Dollars More is an instant classic in my books and acts as a reference point to other westerns out there.",
            "review_date": "2011-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are few musical themes that match the simple power of Ennio Morricone's watch melody in this film.",
            "review_date": "2011-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lee van Cleef is such a badass. I did not realize the extent of his badassery until now. I blame \"Sabata\".",
            "review_date": "2011-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like the prequel it was enjoyable and atmospheric. Again a little bit slow but can't argue with the acting and the haunting quiet of this film. Lots to chew on in this film.",
            "review_date": "2011-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "thought this was even better than Fistful of Dollars\n\nonly slightly though!",
            "review_date": "2011-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Man with No Name trilogy keep getting better with the second entry \"For a Few Dollars More\" where along with Clint Eastwood and Gian Maria Volont returning, you've got the addition of Lee Van Cleef as a bounty hunter. This is Sergio Leone's thrid best film in his career and Ennio Morricone's second best score to date alone with gorgeous cinematography.",
            "review_date": "2011-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There goes the neighborhood. And the idea that guns are best in single barrels. Take pride in continuity of the fact that Sergio Leone settles for nothing less than the very best, to dig his teeth in the girth of a genre he knows and loves, and that he stores his biggest ideas for. The times start getting nailed down in \"For a Few Dollars More\", the stellar sequel to '64's heavily-influenced \"A Fistful of Coins\". The offspring of early-20th century tech geeks are tossing up new design innovation for weapons, and folks are finally wizening to the often limitless financial potential in a lifeless body when you aim sharp enough to drown their tell-tale hearts, like hippie freaks reading their munchies for foreign paranoia.\n\nIn a new branch of the Western woods, Clint Eastwood's Man With No Name comes to run smack into a bounty hunter named Col. Douglas Mortimer (Lee Van Cleef) shaking up residents in hot pursuit of bandit El Indio (Gian Maria Volonte). One beef: the Man's tracking the same scent. A team-up? Why not -- Mortimer keeps a mind for the impending, while No Name the storied traditional. So the latter (referred to in this film as Manco, meaning in Spanish \"one-armed\") breaks from jail an Indio crony and ever so dangerously slips into the gang as they prep a bank heist in El Paso, once mission impossible for the crew. It's all blueprint for a crackdown on Indo and his $10K government DOA; ditto for the godfather's gang, among whom include a young Klaus Kinski as a Mortimer left-standing jonesing to spill the beans on their charade.\n\nBut besides all that, what's the harm of dabbling in some foul play? Oh yeah, there's also the conscience rumor that Mortimer or No Name might use their undisclosed knowledge to over the shoulder finish each other off. It gives \"For a Few Dollars More\" a sense of dread that makes \"A Fistful of Dollars\" look innocent in comparison. Because in Leone's massive West, retribution sways in the endless shrapnel autopsy for blood like we're in Chinatown and there's no water. Mortimer and No Name masquerade on the same side in the creation of the tri-state's new vocational border, eyes peeled not for the obscurity of a gunshot but in the humane schizophrenia nearest the trigger. As usual, if shit were to blow, it wouldn't end at the tip of a single finger -- you're prey to a whole fistful.",
            "review_date": "2011-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The man with no name is back for more action in \"For a Few Dollars More.\" Clint brings back the rapacious rifleman out to cash in with the life of the bounty hunter. The criminal Indio has escaped from jail and hatches a new plan to rob the El Paso bank. So the man learns there is another dog in the fight; Mortimor, an ex colonel now in the bounty business. Spaghetti western angles, dialogue and action permeate this opulent sequel. Clint is cocky with a side of insouciance. Fun, violent, sexy. The epitome of what makes a good western.",
            "review_date": "2011-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfect example of a sequel out shining the original. One of the best Western films ever made.",
            "review_date": "2011-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"When the music ends, pick up your gun.\"",
            "review_date": "2011-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is actually my personal favorite film of the trilogy. Everything about it is so iconic. The film is overlooked because it is the middle film, but I feel like it deserves more recognition. The ending gun fight alone is worth watching the entire film for. The cast is fantastic from Clint Eastwood to Gian Maria VolontÃ (C), and even a young Klaus Kinski pops in to say hello. The standout however is Lee Van Cleef's Colonel Mortimer. His characterization of The Man in Black is brilliant. The final revelation at the end, which involves his character and ties up a major plot point, gives me chills each time I see it.",
            "review_date": "2011-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After wathcing Fistful of Dollars, I was eager to watch the second movie in this great Man With No Name trilogy, and after watching it I must say -  it was so awesome. The movie is thrilling, intensive, built properly and simpley - enjoyable! Sometimes it was hard for me to believe this movie is from 1965. Clint Easwood and the other actors are just wonderful, and the directing is splendid too. Now all I have to do is to find 3 available hours and watch the last movie of this terrific trilogy (and probably the best of them) - The Good, The Bad and The Ugly. For the time being, For a Few Dollars More gets 4.5\\5.",
            "review_date": "2011-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a more likable Man With No Name and the strong performances from Lee Van Cleef and Gian Maria VolontÃ (C), the second installment of Sergio Leone's legendary Dollars Trilogy is superior to the first. Much of what applied to A Fistful of Dollars goes here as well, with VolontÃ (C) in a new villain role and Clint Eastwood's Man With No Name (now called \"Manco\") as mysterious as ever. This time, however, he has met a true equal in skill, in the form of Cleef's Colonel Mortimer. However, instead of gunning each other down, they decide to team up to capture the highly wanted bandit El Indio, with his mysterious watch tune. The plot flows much better than the first Dollars film, as it is original and not just ripped from a Kurosawa film, and Manco is more likable than Joe in the sense that him and Mortimer are clearly \"the good guys.\" Overall, a better film than the first, and a remarkable Spaghetti Western.",
            "review_date": "2011-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the better Spaghetti Westerns with all the best player: directed by Spaghetti Western Master Sergio Leone, music by the brilliant Ennio Morricone, Clint Eastwood and Lee Van Cleef as tough cool Bounty Hunters, Gian Maria VolontÃ (C) and Kalus Kinski as Crazy Bandits (and Kinski can pretty much out-crazy anyone just by opening his eyes).",
            "review_date": "2011-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This pretty much cements the Dollars Trilogy as one of my favorite film series. It does what a good sequel should, it gives you a longer, darker, more detailed story. A more twisted villain, and a new hero that adds a interesting dynamic to the story. Lee Van Cleefs character was, to me, the most interesting part of the movie. Sergio Leone has a way of making the first 75% of these movies good, yet somewhat bland, but his endings always blow me away despite the fact that everyone knows the bad guy is gonna get his at the end. The man knows how to set up a shoot out.",
            "review_date": "2011-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like all of Ennio Morricone's work, the score is incredible. Sergio Leone crafted an exciting story here, and its just great fun all around.",
            "review_date": "2011-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great western.  Sequels rarely surpass the original, but it does this time.  Adding Van Cleef's character scared me because who wants Eastwood to share time on screen?  It really works though, with some great moments in the final firefight.",
            "review_date": "2011-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit more fleshed out and complete than Fistful although Leone rarely ever let logic in a script interfere with his filmmaking.  Lee Van Cleef is great as Colonel Mortimer and gives No Name some good competition in the bounty hunting field. He's more in it for revenge concerning the villain El Indio, nicely played for violent craziness by Gian Maria Volont. (There seems to be a progression in the crazy villain types in the No Name series which reaches its pinnacle of infamy with Eli Wallach's Tuco, but El Indio is sufficient.) Anyways, there's also Klaus Kinski in a bit part and some awesome gunplay. It could have been shorter, but again Leone compromised with no one concerning length and always took plenty of time to develop his characters and story.",
            "review_date": "2011-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whilst 'A Fistful of Dollars' introduced Sergio Leone's new, grittier Wild West, 'For A Few Dollars More' continues to ground the genre whilst pushing even further. \r\n\r\nI firmly believe this is a sequel to 'Fistful of Dollars'. Eastwood s the man with no name is back and he looks, sounds, and acts identical to how he did in the previous instalment. However, an extra outlaw is added into the mix in the form of another Western Legend: Lee Van Cleef. Famous for his role in 'High Noon', Van Cleef has all the features of a classic villain. Indeed, when we first see him ruthlessly killing for bounty, we get a sense that he is the main antagonist. What surprises us then, is when he lends a helping hand, and ultimately is the hero who slays the real antagonist - whilst Eastwood smokes and acts almost as a referee. \r\n\r\nIn this regard: Van Cleef is as prominent as Eastwood - and is just as memorable. Whilst in 'A Fistfull of Dollars', it was Eastwood s performance that stood out the most, in 'For A Few Dollars More', it is Van Cleef who steals the show. He is intimidating to the last, yet for this movie somehow manages to be incredibly likeable. \r\n\r\nAs is standard for a sequel, the entire scope is raised. The whole 'adventure' seems to take place over a much larger area. The settings are much more expansive, and the cast is much more extended to include a sub-villain in addition to Van Cleef as a sub-hero alongside Eastwood. The plot is much more layered, with seemingly two plots merged together - the two bounty hunters (Van Cleef and Eastwood) rivalling for the prize before coming to a mutual respect (in what is my personal favourite scene of the movie), and then the two working together to destroy a group of bandits who simply want to rob a bank. With any normal movie, the Director would either just focus on one, or demote the other to a sub-plot. This may mean that having what seems like two movies placed one-after-the-other makes the whole movie rather over-long. And that is the only flaw: that there is just too much. \r\n\r\nSimultaneous to Leone breaking the boundaries and innovating not just the western, but filmmaking altogether; Ennio Morricone likewise does this with his musical score. It is a bridge - with the main theme incredibly similar to 'A Fistful of Dollars', yet we hear some samples (particularly during the duelling sequences) of what is yet to come in arguably the greatest movie soundtracks of all time: 'The Good, The Bad, and The Ugly'. \r\n\r\nOverall: this outing is far superior to the first, but in retrospective the movie is merely building up to Leone's next, and arguably greatest, movie...",
            "review_date": "2011-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lee Van Cleef is the more interesting point from the movie.",
            "review_date": "2011-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the best western ever! yeah I said it",
            "review_date": "2011-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gian Maria looked really like a mad man i liked",
            "review_date": "2011-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The immediate predeccessor to \"The Good, The Bad, and the Ugly,\" \"For a Few Dollars More\" is overlong, but very entertaining. The movie follows two bounty hunters (Clint Eastwood and Lee Van Clief) in a quest to find some vicious criminals in order to collect a great some of money (for the time that is). There are some pretty grim scenes up to the climax, especially considering when this film was released, particularly when the chief thug (Gia Maria Volonte) murders a family, including an infant, in order to gain revenge on someone who had originally caught him. That was a little disturbing. Other than that, it is visually stunning and quite suspenseful western film. I wish it was little shorter, but perhaps that's just my own little problem. This was the warm up to the great, iconic film that followed under Sergio Leonne's direction. A very good warm up indeed.",
            "review_date": "2011-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty much right up there with The Good, The Bad and The Ugly. Holy crap. There's just so much to love about this one.",
            "review_date": "2011-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This second of the Trilogy is underated....another masterpiece from director Sergio Leone. Another amazing score from the master himself:Ennio Morricone",
            "review_date": "2011-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fully fledged epic that acts amongst the greatest of the spaghetti westerns next to The Good, The Bad and the Ugly.",
            "review_date": "2011-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the weakest of the dollars trilogy, becoming too slow too often, but it's still great entertainment and a fine addition to the series.",
            "review_date": "2011-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Where life had no value, death, sometimes, had its price.\"\r\n\r\nThe Man with No Name joins forces with a rival bounty hunter to capture the crazed outlaw Indio.\r\n\r\nThe second installment in The Dollars Trilogy is is regarded by most critics as the weakest of the series.  However, while i feel it's not as important as the original (A Fistful of Dollars created the spaghetti western after all) and not as memorable as the final picture (The Good, The Bad, and The Ugly has overwhelming style),  For a Few Dollars More is nevertheless, every bit as good as it's brethren with it's borderline cartoonish confrontations between characters and tense atmosphere.  The action is over-the-top, carefree, and fun while the screen looks great filled with such a vast, beautiful, and harsh landscape.\r\n\r\nFor a Few Dollars More is undoubtedly a Sergio Leone film.  He is a patient director, utilizing long silences where the actors communicate with facial and body gestures rather than vocals and the violence is high in frequency and glorified in nature.\r\n\r\nThe picture has the unfortunate qualities of being the sequel to a groundbreaking endeavor (A Fistful of Dollars) and exhibiting restraint of intrusive style compared to it's successor (The Good, The Bad, The Ugly), but For a Few Dollars More is still an incredible work of stylized western themes and male bravado.",
            "review_date": "2011-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even Better than the first Leone's second installment is a brilliant Western worth Checking out.",
            "review_date": "2011-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I find myself becoming more of a sucker for spaghetti westerns with each subsequent film. Sergio Leone's second part in his \"Dollars Trilogy\" follows two bounty \"killers\" as they attempt to infiltrate a gang of outlaws who, in turn, are trying to pull off a big bank robbery. I went into the movie blind so I didn't know what to expect. Naturally I had a blast. Clint Eastwood and Lee Van Cleef just ooze confidence and sheer awesomeness. I found myself waiting in earnest for each scene that they had together. Along with having these two western powerhouses, other Sergio Leone regular Gian Maria Volonte makes yet another appearance. His character is much better in this film than in A Fistful of Dollars in my opinion. The gunplay is as impressive as ever and, at times, kinda played for laughs. One scene in particular involving just Eastwood and Van Cleef had me chuckling to myself quite a bit. Also, in keeping with the fantastic soundtrack of the first film, Ennio Morricone makes another awe-inspiring soundtrack. The films with his soundtracks are always better for them and this one is no different. It adds the perfect amount of tension, bravado, and even comedy at times. I would have to say that this is pretty close to taking the top spot of the trilogy for me.",
            "review_date": "2011-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Where life has no value,death,sometimes, had its price.That is why the bounty hunters appeared.\" This how starts \"for a few dollars more\" this incredible tale of two skilled bounty hunter who came across each other way to catch a wanted and renowned bandit.\n\nFor a few dollars more is probably the most romantic movie of the dollar trilogy by leone.In many point it points out values which should define true men in any era even in the wild west.Honour and respect are particularly put ahead.And that make for a few dollars more the most moralist and philosophic movie of the dollar trilogy though the less entertaining. \n\nOn a technical point the movie is still amazing .The quality of the realization and the details are of first hand even if we can notice a difference between the realization of this second opus and the much more violent first one.In general,the plan use for this movie are less technical than the first one and particularly the last one of the trilogy movie of the dollar .It is then less sensational on a technical point but not less good .The editing is exceptional with the help of an awesome screenplay acting  music and  cinematography that definitely captivate the audience.Once again Sergio leone is good as it can by bringing an artistic plan to his work and serving the story to the best of his ability.He is an almost perfect story teller.\n\n\n\"For a few dollars more\"is truly gripping entertaining and interesting from the beginning to the end and is probably the most accessible of the dollars trilogy for a large audience.The first scene is also certainly one the best ever to happen in a western.it is just awesome.The characters are very interesting and aside from manco (the man with no name) they all have an interesting aspect especially Mortimer and el indio.\n\nAnyway the movie is recommended for everyone and especially to western fan it is awesome!!",
            "review_date": "2011-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a few dollars more is a good sequel to the original A fistful of dollars because it copies a lot of what made the first film so good and also brings a lot that is new all the while maintaining the same entertainment as the first. If you liked the first one then you will like this, it's a good film even though at times a little self indulgent.",
            "review_date": "2011-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even better than the first film in the trilogy.  When you consider the era this film was made, it makes the cinematography that much more amazing.  Great story, great characters, great film.",
            "review_date": "2011-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Confused me at first, because I was treating it as a sequel to the first (fistful of dollars), but it is anything but. Standing on its own, it's a little weak on the story, but makes up for it in the music, acting and overall atmosphere. An amazing movie. Can't wait to see 'Good the Bad and the Ugly'",
            "review_date": "2011-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Proving itself to be even better than its predecessor, Sergio Leone's For A Few Dollars More is a genuinely spectacular and high quality film that features a complex plot and brilliant performances from Clint Eastwood and Lee Van Cleef.",
            "review_date": "2011-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The second in Sergio Leone's 'Dollars' trilogy, For A Few Dollars More continues the previous year's A fistful Of Dollars' violent epic but adds further cinematographical beauty and two other truly great performances from Lee Van Cleef as Col. Douglas Mortimer and Gian Maria Volonte as El Indio.  Leone introduces new motifs into the film such as the music watch that chimes just before a duel takes place and acts as a trigger for two protagonists' memory of lost love.  I'd say this is equal to the first film but both have to take a bow in front of the two later Leone masterpieces The Good, The Bad and The Ugly and Once Upon a Time in The West.",
            "review_date": "2011-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If The Good, The Bad, and The Ugly is the Dark Knight of westerns, then For a Few Dollars More is the Batman Begins. It's nothing too spectacular, but it's an entertaining shoot-em-up western with stellar performances and well-constructed sets.",
            "review_date": "2011-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My first western film to have watched it what a direction from Sergio Leone, and touch of performance from Clint Eastwood and Lee Van Cleef. \r\n\r\nThe Great thing about this classic western is that the entire cast is memorable each frame grips you, with exciting new thrills at every other second of the film. What else to speak about the music score by Ennio Moriconne, he is simply god of music, legendary score and indeed superstitious.",
            "review_date": "2011-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not my favorite in the trilogy, but deservedly the darkest and most brooding. Maybe this was the true stepping stone in Leone's filmography, as so many fans of the series claim.",
            "review_date": "2011-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed this thoroughly from start to finish, kind of a weird villain but honestly its a spaghetti western so whatever ;)",
            "review_date": "2011-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not quite as captivating as the first, but this is anything but a bad movie. The plot is more cut & dry compared to the original with an adequate amount of twists to keep you entertained. The characters and screenplay are well thought out with great cinematography as well. It just lacked some of the mystery that the first one had to keep you on the edge of your seat. It did its job in that it got me excited for the conclusion which if rumors are true, will not disappoint.",
            "review_date": "2011-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "if u like western, if u like eastwood, it's something inevitable for u.",
            "review_date": "2011-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A refinement of the genre: better characters, music, and intensity.  Tough as nails and unrelenting; good or bad.",
            "review_date": "2011-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The second in the \"Man With No Name\" trilogy (following A Fistful of Dollars and followed by The Good, the Bad, and the Ugly) and maybe the weakest of the group.  The movie actually has more plot and plot development than the other two movies including backstories for many of the main characters, but it doesn't have the same kinetic energy of the other two movies.  This possibly could make it better in many eyes, but I felt the \"thinky-ness\" of the movie bogged it down but made it an entirely different feel from the other stories.  Visually it is great, and Lee Van Cleef's character is very interesting by the end of the film (Eastwood's character is intentionally more of a mystery).",
            "review_date": "2011-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "...or The Man with No Name begins to discover that he has a soul. Every bit as good as it's predecessor, and with (slightly) more of a conscience.",
            "review_date": "2011-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite of the 3 original ones, with great acting and a good plot line. 90/100",
            "review_date": "2011-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sequel to 'A Fistful of Dollars' the film initially sets itself apart from its predecessor by being a completely original film. 'Fistful' was a pretty close adaptation of Akira Kurosawa's 'Yojimbo.' The only element returning to this film was Clint Eastwoodâ(TM)s character with no name. While the character was modeled around ToshirÅ\u008d Mifune in 'Yojimbo,' it's pretty clear in this film Eastwood began to depart from this mold and take the character in his own direction. The changes are slight and are in the right direction, but he no longer rubs his chin as a nod to ToshirÅ\u008d. While I didn't like this film as much as âFistful,â\u009d itâ(TM)s still pretty solid and has a fantastic ending!",
            "review_date": "2011-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a Few Dollars more pits Eastwood's Man with No Name against Lee Van Cleef's rival bounty hunter as they set out to take down the same outlaw. While the plotting isn't as succinct, Leone's style has moved up a level from the previous film and is more elaborate and inventive.",
            "review_date": "2011-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a bigger budget, and the buoyed by the success of 'A Fist Full Of Dollars', this film raises the standard. It's here we get to see the fully realised iconic Leone close-ups and stand-offs. And Lee Van Cleef is fantastic, cooler than Eastwood and that's saying something.",
            "review_date": "2011-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The second and my personal favorite of Leone's \"man with no name\" trilogy has Eastwood teaming up with Lee Van Cleef to collect the bounty on a deadly outlaw and his gang. Great movie. A bonifide classic.",
            "review_date": "2011-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I got excited watching this film. Best western I've ever seen. Truly a masterpiece.",
            "review_date": "2011-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "...or The Man with No Name begins to discover that he has a soul. Every bit as good as it's predecessor, and with (slightly) more of a conscience.",
            "review_date": "2011-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sequel to \"A Fistful of Dollars\" seems like a foregone conclusion considering its worldwide success. But in 1964, there was nothing inevitable about it. Sergio Leone had received no financial compensation from the considerable box office of his first Western and wished to make a personal, partially autobiographical project about growing up in Trastevere during the 1930s. However, he was under pressure to repeat his Western success and Italian lawyer Alberto Grimaldi offered Leone 50% of the profits plus expenses. This was an offer that a man with a wife and children to support couldn't refuse. So he set out on the development of  the ironically titled \"For a Few Dollars More,\" wishing to top his earlier film. This determination shows in the finished product. \"For a Few Dollars More\" is a more ambitious film than its predecessor in terms of narrative, character and style and it's the film which really shows Leone developing the epic side of his filmmaking which would come to fruition in \"The Good, the Bad and the Ugly.\" It may not be Leone's best film, but it may be his most purely enjoyable; an exercise in narrative filmmaking which brims with style and confidence.\n\nLeone brings back the Man With No Name - this time briefly given the name Manco - in the shape of Clint Eastwood and explicitly makes him a bounty hunter (called bounty killers in the film) with no other motivation than money. This gives the film a specific historical context during the late 19th Century when law and order in the West was maintained in a decidedly fragile state by a haphazard system of local Sheriffs and traveling Judges. Bounty hunters were encouraged as an efficient way of finding and dealing with fugitives. Eastwood's all ready iconic character is joined by a new figure; Colonel Douglas Mortimer played the great character actor Lee Van Cleef. Mortimer is also a bounty hunter but one haunted both by his past as a soldier and a tragic family history. After a brief, witty confrontation , the two men team up with the common goal of bringing to justice El Indio (Volonte), a deranged, dope-addled bandit who is inextricably linked to Mortimer's family tragedy.\n\nThe sweeping confidence of the film reflects a director who is finally able to do what he wants in the way he wants. Leone's work is immensely stylish, packed with increasingly exotic use of close-ups and pacing which, while never slow, is a little stately in a manner which often recalls Luchino Visconti. There is more intentional humor in this film than in its predecessor with whole sequences built up for the sake of a humourous pay-off, such as the scene with the apples towards the end. There's a lushness to the film, both in its stunning visuals which make full use of the landscape in a way which Leone would intensify in his next two films, and in its emotional richness, largely supplied by the character of Colonel Mortimer. In \"Fistful,\" there's not a great deal of motivation or even characterisation. In this film, Mortimer's character is all motivation and, partly due to Lee Van Cleef's sympathetic and witty portrayal, he comes across as the main target for our sympathy. Virtually every Spaghetti Western which followed the huge success of this movie in Italy would feature a flashback to explain the motivations of a particular character but few are either as simple or as effective as the one here. Leone keeps this in the background at first, with unexplained memory 'flashes' from El Indio that are later revealed as his connection with Mortimer. The pocket watch watch, with the initially unexplained portrait of a lady, is well used too, providing another angle of narrative suspense.\n\n\nEverything in\"For a Few Dollars More\" seems a little bigger than in its predecessor. The violence is a little more graphic and sadistic, Carlo Simi's production design of El Paso - Leone's first great bustling period location - is on a larger scale and the psychopathic, sociopathic behaviour of El Indio is more melodramatic and theatrical. Gian Maria Volonte takes the opportunity to go over the top with both hands, consuming the scenery with relish as one of the nastiest, most irredeemable bad guys in cinema history. In contrast to this slightly garish conception, Clint Eastwood's performance seems all the more restrained and funny. He gets comic effects simply by doing very little and allowing all around him to emote their way into the stratosphere. His character is made even less heroic, again being the hero mostly because of his charisma and finally being slightly redeemed through his friendship with Mortimer. This friendship adds a more human dimension to the whole film, bringing in complex emotions which the first movie ignore. Leone originally wanted Lee Marvin for the role but couldn't afford the actor's asking price and Van Cleef's warm, likable performance is masterful; a mature, if cynical, reflection contrasted with Eastwood's youthful arrogance, even though Van Cleef was a mere five years older.\n\n\nLeone's style is developing and the movie contains most of the elements which will be considered hallmarks of his film making. Along with the harshly cynical view of the world - good men have to turn to violence because of the greed and corruption around them - and extreme sclose-up shots, we get more religious iconography creeping in - the church in which El Indio delivers his speech about robbing the bank being an example - and the recurring motifs such as the circular dance of death during the final gunfight.All in all \"Dollars is a worthy second film in an unintended trilogy with the best saved for last.",
            "review_date": "2011-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not quite as good as A Fistful Of Dollars but still a very good watch, For A few Dollars More sees Clint Eastwood return as the man with no name. Making his debut in the Dollars trilogy is Lee Van Cleef, playing a sharp shooting Colonel who goes bounty hunting while away from the army. As too does Eastwood's character, until the two join forces to bring down a volatile bandit named El Indio whose just escaped from prison. Just like its predecessor this film is awesome and cool, and goes deeper into the characterization and backstories of the characters. The only thing that lets it down ever so slightly is probably the partnership of Van Cleef's and Eastwood's characters as they are two different sides of the same coin; both wanting the same thing but for a different reason. But as I say only ever so slightly. Sergio Leone has done it again with another gripping and stylish western which strengthens the Dollars trilogy. Eastwood, Van Cleef, and Gian Maria Volente all deliver good performances and make a quality ending when everything is explained and comes to a head.",
            "review_date": "2011-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fleshy, sweaty, violent Western. 4 stars.",
            "review_date": "2011-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the original, but still a fun ride. Keep ignoring the plot holes or you won't have any fun.",
            "review_date": "2011-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the purest masterpieces of the entire film company!",
            "review_date": "2011-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the purest masterpieces of the entire film company!",
            "review_date": "2011-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "my personal Favorite of the trilogy",
            "review_date": "2010-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The premise alone makes this a fascinating and entertaining movie from start to finish. Whats so different about it from all of Leone's other movies is that it focuses less on the setting and more on the characters of the movie, rather than how their story fits within a particular historical setting. With \"Once Upon a Time in the West\",\" the Good, The Bad, and The Ugly\" and even \"Once Upon a Time in America\", we see the environment shaping the characters, and in this we see the exact opposite. And the revenge story fits in so perfectly at the end, giving even more meaning to the masterfully crafted story.",
            "review_date": "2010-12-30",
            "source": "rt",
            "lang": "en"
        }
    ]
}