{
    "rating": 9.2,
    "release_date": "1967-08-02",
    "num_reviews": 90,
    "genres": [
        "English"
    ],
    "summary": "African-American Philadelphia police detective Virgil Tibbs (Sidney Poitier) is arrested on suspicion of murder by Bill Gillespie (Rod Steiger), the racist police chief of tiny Sparta, Mississippi. After Tibbs proves not only his own innocence but that of another man, he joins forces with Gillespie to track down the real killer. Their investigation takes them through every social level of the town, with Tibbs making enemies as well as unlikely friends as he hunts for the truth.",
    "reviews": [
        {
            "content": "One of the best movies I've seen in years. It's gritty, and it really makes you think about racism, while maybe giving you a bit of hope for humanity (see Steiger's character). Quite progressive for 1967 I believe. Steiger starts as a racist at the start of the film, but he develops respect for Poitier as the film progresses. This isn't overdone, but it is certainly optimistic. The film is a noir mystery, but it doesn't rely on the plot directly for its thrills. For this reason, and because it's only 110 minutes long, I forgave this. I truly enjoyed watching it.",
            "review_date": "2023-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Led by the powerhouse central performances from the late, Sidney Poitier and Rod Steiger, Norman Jewison's thought-provoking mystery drama, \"In The Heat of the Night\", didn't just turn out to be a timeless classic upon release, but it also keeps on to resonate even today.",
            "review_date": "2022-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is very much a film of its time, or so I'd like to say, although it would be naive of me to claim that racism has been utterly removed from the world, or indeed the setting of this film - southern USA. It does well at highlighting the prejudice African Americans faced, regardless of their professional occupations or not. Its a sobering watch in parts - the way the local police chief laughs off some of what the African American (Virgil Tibbs) says, ignoring his clearly decent background makes for depressing viewing certainly.\n\nHowever, there is also prejudice shown towards others in this film, mainly that of womenn. I'd say it does well at highlighting such social issues and is a relatively engrossing watch. I would recommend this film, yes.",
            "review_date": "2022-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest 01 hour; and 49 minutes ever!!!!!!!!!! In memory of Sidney Poiter!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A slow-burning, blood-pumping and finely acted police procedural that attempted to illustrate contemporary policework in the South as all impulse and no reason.",
            "review_date": "2022-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is as good as everyone says it is, a groundbreaking classic.  But, it's not perfect.  It lags and some of the scenes feel like filler to the runtime that important to the story.  Plus, I know it's the point but practically all the white characters had some racists traits.  But epic performances with flawed human beings not just one note caricatures.  But the compelling story is enough to keep you guessing and wanting to know the truth.",
            "review_date": "2022-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well acted, and an interesting take on 'solving' racism, but unrealistic, predictable, and slow at times. Poitier was extremely expressive using his body and face, and the police were tragically incompetent and dim-witted in comparison, as intended. The story arc was acceptable if you're not looking for realism, although not unexpected, and it felt like some of the runtime could have been shaved off. It wasn't what I'd call especially enjoyable though, and there could have been a bit more character development. The villain didn't get much attention at all. However, the sets/props/costumes looked the part, the cinematography and visual effects were reasonable, and the soundtrack was catchy.",
            "review_date": "2022-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie with such great actors. Sydney at his finest. We have lost a true icon.",
            "review_date": "2022-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the Heat of the Night utilises a Murder investigation in small town Mississippi (yes I totally had to use the rhyme in my head to type that out) to explore the tinderbox theme of race relations in the deep south. \n\nSidney Poitier plays big city cop Virgil Tibbs passing through town, at first accused of a crime purely because of his skin colour, and then roped into assisting/solving the investigation. Rod Steiger is Gillespie a racist police chief with serious Andy Sipowicz level short sleeves, more intent on 'keeping the peace' at the cost of true justice, happy with pinning the blame of any suspect, guilty or not, that will allow him to keep a lid on things. \n\nPoitier combines quiet dignity and controlled anger in the face of the south's blatant racism and when his anger does bubble to the surface, such as the  iconic delivery of his 'They Call Me Mr Tibbs' line (which is also the title of the sequel) the results are pure fire. Steiger wins the begrudging repect of the audience as he chooses right over wrong in his defence of Tibbs in several key moments of blatant racial discrimination and outright hatred. \n\nI was a little skeptical as to why Tibb's police chief in Philidephia is SO keen for him to stick around to help solve this Murder in an entirely different jurisdiction - but hey it serves the story so let's just go with it. \n\nDirector Norman Jewison, creates an atmosphere of tension, evocative of the title with the oppressive night time heat dripping from the frame and felt even more soundly when accompanied by THE Ray Charles' fantastic theme song. \n\nOnce again, for a movie that was made 55 years ago it also sadly still relevant today - in a society where we have just seen the conviction of three white men for the murder of an unarmed African-American male and the numerous reports every day of racial charged wrongful arrests - the fact that Poitier is arrested within the first 10 minutes just because of the colour of his skin - feels as though we could he watching the exact same story in 2022. \n\nOn a lighter note - one of the police officers in the movie is named 'Shagbag'.",
            "review_date": "2022-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This classic crime movie was really good. Sidney Poitier, Rod Steiger, Warren Oates, and the rest of the cast did a fantastic  job in this movie. The plot of the movie was dramatic, thrilling, and suspenseful. It's about trying to solve a murder with all the help you can get even if you don't like who you're working with. If you haven't seen this classic movie yet, check it out sometime. It's a definite must see.",
            "review_date": "2021-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In Black History Month, it seem apt that this is screening on TV. One of the most influential cop thrillers of all time, driven by an iconic performance from Sidney Poitier, In The Heat Of The Night won 5 Oscars including best picture. Released a year before the assassination of Martin Luther King, the film encapsulates the racial tension in the Deep South at the time harrowingly and accurately, as Poitier plays a highly respected detective from Philadelphia who has to join forces with a local bigoted sheriff to solve a murder.",
            "review_date": "2021-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Poitier and Steiger's authentic performances cause the solving of the crime to be of secondary interest as the dynamics involved in the relationship between these two very different men prove far more interesting.\n\nI appreciated the fact that while exploring the effect race had in the interactions among the characters (unavoidable given the time and location), the film didn't limit itself to this alone and added shades of urban, economic, and educational elitism into the relationships and interactions as well.\n\nThis is another film that goes in the large, embarrassing box of \"and this wasn't even that long ago\" snapshots of America and should leave little doubt after watching why issues surrounding race and policing are still a factor today. 7.5*",
            "review_date": "2021-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much more than just a police procedural or murder mystery, Norman Jewison's In the Heat of the Night is a racially charged film about a black police officer trying to solve a murder in rural Mississippi.  Sidney Poitier is great as Virgil Tibbs, but the film belongs to Rod Steiger as the explosive chief of police, a performance that won him an Oscar.  The film is propelled by the performances of its stars, a fantastic music score by Quincy Jones, and some beautiful cinematography by Haskell Wexler.  In the Heat of the Night was released in the midst of the civil rights movement in 1967, but, sadly, is probably as relevant today as it was over fifty years ago.",
            "review_date": "2021-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes, \"they call me Mr Tibbs\", that single line and the ferocious act of Mr Poitier at this time resume the whole story. Everything is said in those few words and in those burning eyes. I watched this movie as a kid and never forgot it",
            "review_date": "2021-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best crime drama!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2021-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The mystery could have unfolded in a more clever way but the acting is top knotch and worth the viewing ",
            "review_date": "2021-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie doesn't hold up well over time.",
            "review_date": "2021-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's an invaluable gem.   People should watch Portier movies.  Fortunately they cast great people around him like Steiger who could help illuminate prejudice without caricature.  But it's Portier's weight of performance that makes  his movies memorable and significant.",
            "review_date": "2021-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What is a film good for, if it does not tell a story, if its characters do not evolve and transform, and above all, if it does not leave a lasting impression, enough to make us challenge our very own version of prejudice?",
            "review_date": "2021-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant film with superb acting from Poitier and Steiger. Also, one of the most iconic moments in cinema. This is a must see.",
            "review_date": "2020-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece of a crime drama/mystery, wrapped inside a story of Southern American racism with more than a hint of a Western in its framing that in turn alludes occasionally to Greek myths and legends (think the central character's name, the name of the town it all takes place in). Never less than gripping, the quiet power of Poitier's performance is a thing of wonder; that he was unrecognised at awards for it I would like to be able to put down to a lack of showiness in his work, but it's much more likely to be a result of the cruel irony of a structurally racist industry failing to reward an African American actor for his work in a film which highlights racism.",
            "review_date": "2020-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sidney Poitier ... icon.",
            "review_date": "2020-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolute masterpiece acting from the two main leads. Sidney Poitier in deep south Mississippi in the 60's, so the racism is in full force here. A murder mystery, with a black detective from Philly and a white Southern small town sheriff working together reluctantly. \"They call me Mr. Tibbs!\" Must watch classic.",
            "review_date": "2020-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As far as mystery/murder movies goes, this is fairly weak.  However, that was not the main purpose of this movie.  As an approachable look into the systematic racism that existed in the deep south at the time of this movie, and how racism can express itself in some surprising ways, this movie does its job.  This is one of those movies that not only survives through the passage of time, but thrives.  It is as relevant today as the day it was first screened.",
            "review_date": "2020-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Virgil Tibbs (Sidney Poitier) — remember the name — is a black homicide detective from Philly who unfortunately finds himself in a one-horse town in rural Mississippi… in the 1960s… The overt racism begins with him being arrested for the murder of a white man because he's black — your standard redneck racism (rebel yells from cars with confederate flag plates popping into his bumper to run him off the road, not being served in a diner, not wanted in the same room, etc. etc.) and for some reason, Virgil argues with police chief Gillespie (Rod Steiger, who won an Oscar for his performance) to stay in the town to help solve the murder. The dead man is a businessman who was setting up a factory in the small town and may have made a few enemies. Or, maybe he was the victim of a senseless crime?! Honestly, it doesn't really matter because the crime and its resolution aren't very interesting. Instead, In the Heat of the Night merits a view for the acting — the scene with Virgil, Gillespie, Purdy (James Patterson) and Delores (Quentin Dean), is phenomenal — the thrills of watching Virgil escape the roving rednecks, and the friendship forged between the Philadelphian and the Mississippi police chief. I mean, the film did win Best Picture at the 40th Academy Awards, although, The Graduate is definitely the better film. Also, Poitier gets to slap a racist white man… in Mississippi… in the 1960s, which was yuge — the slap-back heard round the world. And, of course, can't leave out the famous \"They call me Mister Tibbs!\" ranked 16th on AFI's 100 Years…100 Movie Quotes list.",
            "review_date": "2020-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is not very gripping, but the performances turned in by Poitier and Steiger are flawless, and make this a movie worth seeing. This movie really illustrates how bad racism once was in this country, and how this has been so very drastically improved over the past 50 years.",
            "review_date": "2020-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just looking at \"In the Heat of the Night\" from a cultural standpoint, the movie is important even today. While I didn't find it to be the most entertaining movie in the world, I thought it was a fairly unique mystery movie. The mystery element is intriguing but what this movie tackles even more so is race relations of its time, particularly in the South. I feel the movie gets most of its tension as a result of Sidney Poitier's character being in almost constant danger while undergoing this investigation. I felt the mystery could have possibly unfolded in a more interesting way as it feels like the big reveal just happens near the end instead of clues being dropped periodically. It might not be my favorite mystery movie, but this is definitely one of the most thought-provoking products of the 1960s that is worth checking out.",
            "review_date": "2020-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For In the Heat of the Night, a mystery film that deals with prejudice and racial discrimination, I formed a theory concerning the murder Mr. Tibbs (Sidney Poitier) and Sgt. Gillespie (Rod Steiger) investigated. In Sparta, Mississippi, Philip Colbert was an industrialist who financed a factory on top of an old orchid plantation owned by Endicott (Larry Gates). Endicott, a racist owner of a cotton plantation, became upset about the news, so he sent a group of white hooligans to rob him. The scene of the crime took place in the construction site full of dried orchid roots and pine pegs. Ralph, one of the hooligans and cook in a low-class diner, (Anthony James) wanted to stash Colbert's money in a purse and a fake pie to pay for an abortion. This serves as an explanation as to why he hides the lemon meringue pie from customers. Before, he raped and impregnated sixteen-year-old Delores (Quentin Dean), causing the ire of her brother Purdy (James Patterson), one of the gang members. During the robbery, Ralph accidentally killed Colbert, stole the murdered victim's Lincoln, put the carcass on the passenger's seat, and dumped the body in an alley near Delores's home. Meanwhile, at 2am, Sam Wood (Warren Oates) ate at Ralph's diner, took a good look at Delores, and discovered Colbert's body. So, with that said, Ralph is not only a racist murderer, but also a monstrous statutory rapist.\n\n(4 Fly-Ridden Lemon Meringue Pies out of 5)",
            "review_date": "2020-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Timeless and still incredibly powerful.",
            "review_date": "2020-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Both actors were superb in the main roles.",
            "review_date": "2020-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Blending two genres is difficult enough, but In the Heat of the Night manages to put together three: comedy, drama, and thriller. Tricking the audience into thinking it's a one-note revenge power trip initially, the slapping scene and its implications for the tone are profound. Appealing on both a surface level and as a serious commentary on race and identity in the Civil Rights-era Deep South and anchored by a charismatic and powerful performance from Poitier, the film still feels electric decades later. The film could have easily slipped into portraying its setting and characters as simplistic caricatures, but opted for a degree of complexity that is certainly commendable, particularly in the depictions of Tibbs and Gillespie. (4.5/5)",
            "review_date": "2020-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Twin excellent leading performances from Rod Steiger and Sydney Poitier.  The film feels dirty and very gritty from the streets and the colours. The murder case is the second part with prejudice and racism. The film shows how the police force in this town are pretty poor and inadequate at their jobs. With many false arrests. Mr Tibbs is the clever and intrigued to solve it correctly. His relationship with Chief Gillespie is the most interesting as shown in the scene at the chiefs house but he does not like a black man feeling pity for him. Initially Gillespie is dismissive but he understand how important and how good Tibbs is at his job. This holds the film together. The music is very of its day but works well. From the opening song which sets the scene. The famous slapping still has impact and shows maybe change with the civil rights. He won't take being slapped and stands up for himself. At the time it was shocking with the use of the n word, nowadays it isn't as shocking. It shocks in how America was and at times probably still is now.",
            "review_date": "2020-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Norman Jewison's celebrated film about a black police officer helping out a racist white police chief with a murder investigation in a small Mississippi town is rightly famous. This isn't just because it won the Academy Award for Best Picture and a few other Oscars besides, but because by tackling the issue of racism head-on whilst the Civil Rights Movement was in full swing, it made for a powerfully topical movie. \nBased on a novel by John ball, In the Heat of the Night is on one level a police procedural, as a rich industrialist is murdered in Sparta, Mississippi, and the police have to find out who the killer is. On this basic level alone, the story works well, throwing up false leads as the actions of motivations of several possible suspects are explored, whilst eventually revealing the real culprit in a way that is both satisfying within the context of the narrative but genuinely surprising. Some well-used misdirection helps: since Colbert's factory might have resulted in an influx of black works to the town, Gillespie and Tibbs both suspect that it was racially motivated and thus so does the audience. With Harvey Oberst, Endicott, and Sam Wood all written as plausible suspects, the story then shows how the police working out that each is innocent, at least of murder.\nBut the murder mystery is not of course the film's main selling point. That is the unlikely pairing of Rod Steiger's racist, redneck Chief Gillespie with Sidney Poiter's educated, well-spoken homicide detective Virgil Tibbs. If pairing up two protagonists who clearly aren't going to get along and having them gradually develop a mutual respect was a movie cliché even in 1967, it doesn't detract from the quality of either Stirling Silliphant's screenplay or of the performances of the two leads. It also doesn't change the fact that witnessing on screen the all too believable racism that Tibbs faces is still appalling, from the moment that Sam Wood arrests him for murder simply because he's black and a stranger in town. Later, he faces lynch mobs, whose violent intention is still not quite as reprehensible as plantation owner Endicott's polite, quietly offensive views. \nTibbs is superbly written and Poitier plays the role with colossal dignity and a simmering, barely suppressed fury when he's confronted with bigotry: a particularly believable touch is when he confesses to Gillespie that he allowed his own prejudices towards Endicott to lead him to assume that he was responsible for Colbert's murder. Tibbs returning Endicott's slap was so celebrated at the time because it was genuinely shocking to audiences; now it's celebrated simply because Endicott is so arrogant that he can't imagine that it would happen – or that Gillespie would simply stand back and allow it to happen – and is seen weeping after his visitors depart. But it is Tibbs' relationship with Gillespie that provides the film with its heart, from the moment he calmly allows Wood to arrest him and Gillespie to interrogate him before revealing that he is a police officer. \nRod Steiger's performance as Gillespie is perfectly pitched: for all his obvious ingrained prejudices when they first meet, he swallows his pride enough to realise that asking Tibbs' for help might allow him to find the killer, and despite later clashes, they end up becoming – if not exactly friends – then at least two men who respect and understand each other. One of the film's best scenes is when they sit and talk in Gillespie's house and Gillespie opens up enough to talk about his life, but stops short of accepting pity; Steiger is incredibly believable. Their final scene together is nicely understated: Gillespie carries Tibb's suitcase for him to the train and they say goodbye in way that allows both actors to say a great deal with very few lines. \nJewison makes much use of close-ups, exploiting the facial expressions of the actors, especially the two leads to good effect, and he also proves adept at handling the film's few action sequences, such as when Harvey is pursued by the police and the fight in the warehouse, which has a real sense of danger. Quincy Jones' soundtrack also helps to enhance the feel of the film, providing exactly the Southern feel shot through with blues that was intended. It would be nice to believe that the racist attitudes challenged by In the Heat of the Night were a thing of the past; even if that were true however, in challenging bigotry it remains as powerful and relevant today as it was in 1967.",
            "review_date": "2020-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"They call me Mr. Tibbs!\" Though I had never seen the movie, or the long running TV series based on it, I was familiar with what the overall premise was. That didn't matter in the least. The 1968 Oscar winning Best Picture, In the Heat of the Night, was a tour de force of acting skill as Sidney Poitier and Rod Steiger are superbly matched head to head.\n\nSteiger plays small town (fictitious Sparta, Mississippi) Police Chief Bill Gillipsie. Gillipsie is a somewhat lazy and very bigoted man, steeped in the numerous privileges his skin color and bravado provide him in a southern town where desegregation is barely a decade old. Sidney Poitier plays Philadelphia homicide detective Virgil Tibbs. Tibbs is initially hauled into the Sparta Police Station because he happens to be at the local train station early on the same morning a murder occurs. Oh, and also because, well… he happens to be a black man with a large amount of cash on him. For Gillipsie's deputy that's reason enough to accuse him of murder.\n\nOnce Virgil's status as a big-city police officer is discovered, events lead to him and Chief Gillipsie being reluctantly forced to work together to solve the murder. The whodunit quickly takes a back seat though, as issues of race and preconceived notions related to race eclipse the film. Quincy Jones provides a score that eloquently supports the film and often drives it. Some of Sidney Potier's best moments are when he is telling a story through his facial expressions alone, devoid of any dialogue. Rod Steiger takes a role that easily could have fallen into caricature or stereotype, and provides it with just the right smidgen of humility that you can actually buy into the hesitant mutual respect that they each express at the film's satisfying finale. Steiger would win the Oscar for Best Male Dramatic Performance for his role.\n\nFrom an historic perspective, it was fantastic seeing Tibbs return a back handed face slap to local white cotton plantation owner, Mr. Endicott. Endicott says, \"There was a time when I could have had you shot,\" and as a viewer I couldn''t help but think, \"Well those days are over.\" Ironically, during a later scene when Officer Tibbs is questioning a local woman of color, he tells her, \"There's white time in jail and there's colored time in jail, and the worst kind of time you can do is colored time\". At this moment, as a viewer I had to acknowledge, \"I guess we haven't come so far after all\".",
            "review_date": "2020-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that manages to balance an intense, whodunnit mystery with timely social themes and a lot of character development, In The Heat Of The Night feels just as powerful and urgent today as it did back in 1967. The behind the scenes stories are almost as fascinating as the movie itself, with Sydney Poitier sleeping with a gun under his bed while filming in Mississippi, due to the antagonism he had previously experienced in that very same state. You could almost call it a buddy cop movie, where the 2 conflicting officers don't get along, but eventually develop a mutual respect for one another. But this movie is much deeper than that, tackling issues of racism and discrimination by showing that, at heart, we all just want to see justice prevail, and that working together, regardless of colour, creed or background, we're all in this together. The plot seems confusing at times, and some of the dialogue is rendered inaudible due to the often thick accents. But it's a film of legendary status for good reason, and if you consider yourself a true movie buff, it's a movie you have to see at least once.",
            "review_date": "2020-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece. Its beautiful, realistic, rich. It says a lot and does almost all of it between the lines.",
            "review_date": "2020-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would give 10 stars if possible such a great movie!",
            "review_date": "2020-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A thoughtful murder mystery about America's racism problem.\n\nDirector Norman Jewison's mystery drama In the Heat of the Night (1967) is a riveting murder investigation into a small Mississippi town called Sparta. This rural hellscape is as brutal, barren, and backwards at its ancient reaching name suggests. Jewison's setting of the American South is apt for a story about deeply brewed hate since they have a long history of hate crimes, hate groups, and racist Southerners. It's the most dangerous and unnerving backdrop for Sidney Poitier to be in really.\n\nJewison's direction is stalwart and steady creating a haunting atmosphere in this little Mississippi town. The slow panning shots and long still shots of characters allow for anything to happen. The camera follows characters down long streets and hallways for a creepy effect. You can tell that In the Heat of the Night's long winding cinematography influenced The French Connection and Mississippi Burning. The slow methodical approach to the film's investigation gives you a similar vibe to a dark thriller like L.A. Confidential or Zodiac.\n\nQuincy Jones' score is a blend of jazz, soul, and funk that makes chase sequences feel brisk and make nighttime scenes feel disquieting. Jones composed the perfect soundscape for In the Heat of the Night's moody tone. Ray Charles' main theme is a wonderful bringer of jazz and soul for an authentic feel and somber vibe.\n\nSidney Poitier is steadfast and intelligent as the brilliant homicide expert Detective Virgil Tibbs for the Pennsylvania Police Department stranded in Sparta, Mississippi. His calm and professional demeanor is impressive as poor Poitier is arrested, insulted, threatened, ridiculed, and assaulted by every racist redneck in Mississippi. He plays it cool and comes out of In the Heat of the Night looking like the smartest detective ever.He acts with a subtle nuance that depicts Tibbs as clever, observant, and even hateful to those who wrong him, which gives his character a realistic complexity. Poitier is captivating to the brutal end and a fine leading man.\n\nFurthermore, Rod Steiger steals the show as the incompetant racist Chief of Police Bill Gillespie. His stocky stature, slow speech, rage filled voice, and angry banter is unforgettable. I think he only manages to upstage Poitier because it is a loud obnoxious role like how he chew gum with his mouth open or is quick to arrest the first suspect he sees. His on screen chemistry with Poitier is interesting as it really looks like they despise each other.\n\nI should mention a young Scott Wilson gets a strong supporting role as the racist local Harvey Oberst wrongly accused of the murder. I like Warren Oates as the bumbling racist beat cop Officer Sam Wood.\n\nIn short, In the Heat of the Night is a poignant crime drama on American racial politics, police corruption, police procedure, and American justice. Ironically, this piece of cinematic Americana is directed by a Canadian director!",
            "review_date": "2019-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best 20 movies of last century",
            "review_date": "2019-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie...The story will keep your glued to your seat, and the acting is amazing.  Have seen it about 100 times. I think it changed the history of movies and Poitier doesn't get enough credit for his work.",
            "review_date": "2019-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Many state \"Star Wars\"as the first revolutionary modern film to transform early 20th century filmmaking into what it is today, but one should take a good hard look into this stunning crime-drama that predates the famous sci-fi flick by 10 years.\nNorman Jewison's marvelous direction and camera work show a beautiful, ugly urban landscape in the American South where an unpredictable mystery plot is taking place; spearheaded by a one-two knockout punch from both Sydney Poitier and Rod Steiger. \nPoitier in particular, has a way of using body language more so than words. The result is a performance that transcends off the camera, off the screen, and onto your living room floor (or wherever you're watching the film). He is that good. Steiger works as a great contrast to the sophisticated Poitier by making us believe he's a rough caloot who is initially prejudice, but can learn to appreciate others when given the chance/exposure.",
            "review_date": "2019-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh god, the magnitude of racism, racial abuse, discrimination and hatred the black people have had to endure !!",
            "review_date": "2019-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So begins my love of the actor Sydney Poitier.",
            "review_date": "2019-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While traveling in the Deep South, Virgil Tibbs, a black Philadelphia homicide detective, becomes unwittingly embroiled in the murder investigation of a prominent businessman when he is first accused of the crime and then asked to solve it. Finding the killer proves to be difficult, however, especially when his efforts are constantly thwarted by the bigoted town sheriff. But neither man can solve this case alone. Putting aside their differences and prejudices, they join forces in a desperate race against time to discover the shocking truth.\n\nIt's a pleasure, all too rare, to watch two splendid actors pitted against each other with equal force such as Sidney Poitier and Rod Steiger in the exceptional murder mystery, In the Heat of the Night. Oscar-winning police drama about racism has heavy themes.",
            "review_date": "2019-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love it.  What more can I say?  It feels modern and sophisticated and smart and enlightening.",
            "review_date": "2018-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true classic. Worth watching and rewatching.",
            "review_date": "2018-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a shattering and revealing showdown iterated in a night..\n\nIn The Heat Of Night\n\n4 And A Half Out Of 5\n\nIn The Heat Of Night is a rare cinematic art that redefines the genre on its own terms and grasps for something that seemed beyond impossible to achieve and that is its maturity on conveying a message. The scrutiny in here is thought out with each individual character's perspective that makes not only its characters three dimensional but also a more mature and stronger plot that isn't here to merely deliver a nail-biting thriller drama but an all direction view of the black and white aspects of the truth. \n\nIt may be short on technical aspects like background score, production and art design, but is utterly adequate on editing and cinematography. The adaptive screenplay by Sterling Silliphant is witty, strong, gripping and aware of the characteristics of the characters well enough to keep the audience engaged throughout the course of it and offer them thought-provoking homework, too along with that. \n\nNorman Jewison; the director, is in his A game as his pitch on the emotions and the stakes creates the anticipated impact and draws out the best outcomes from the screen. Sidney Poitier is convincing as a protagonist but the real game changer in here is Rod Steiger in his parallel role steals the show with his stellar performance. \n\nIn The Heat Of Night is a shattering and revealing showdown iterated in a night whose discectomy is just pleasingly ingenious to encounter",
            "review_date": "2018-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well written crime drama from 1967 with a fantastic performance by Sidney Poitier.",
            "review_date": "2018-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as I was expecting. The racial dynamics are a little dated in that the film seems to be about how African-Americans are people too, something which shouldn't need to be spelled out anymore (if it ever did).",
            "review_date": "2018-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a great watch and much better than its sequel which i unwisely watched first",
            "review_date": "2018-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tense. Hard. But powerfully incredible.",
            "review_date": "2018-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the Heat of the Night is an amazing film that perfectly captures a time and place. The atmosphere and behavior of the characters all fits perfectly for the deep south in that time period. It’s powerful because we get to see all ranges of racism, and even certain people slowly finding ways to get past their prejudice. Perhaps the most remarkable performance in that regard is Rod Steiger who plays the police chief that has to admit something that is completely out of character for him...he’s not as good as a black man. The conversations between the two leads are so entertaining because you can sense the slowly developed respect they both find for one another. The real magic of this movie is the remarkable performance of Sidney Poitier. He brings a pride and gravitas to the situation that allows us to see why he is in charge despite the fact that others try to intimidate him. His controlled silence in the early scenes in the face of all the judgment tells us all we need to know about the character, and it’s surprisingly impactful when he delivers that iconic line. When he takes a lead role in the autopsy in a later scene it is satisfying to see him in the dominant position for a change. Perhaps the most unexpected thing in the entire film is that we are even allowed to see his fallibility as he succumbs to some prejudice of his own. With all this talk about the amazing acting performances and the racial issues, I’ve almost left out the primary plot of the film. This story is also a great murder mystery. I’m always delighted by that genre and I love the fact that we are allowed to piece together clues along with the characters in the film. It’s an intriguing mystery with quite a few false leads and dead ends to keep you guessing. There’s very little that I dislike in this film. There is one acting performance that I didn’t love, but I’ll avoid going into that with much detail because I don’t want to spoil anything. The point is that any complaint is a pointless nitpick when I’m talking about a film as superb as In the Heat of the Night.",
            "review_date": "2018-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excellent film noir with great performances by the leads and a social commentary that not only was potent for the time, but still resonates.",
            "review_date": "2018-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50 years later, and the story of police brutality and structural racism still holds true.\n\nSECOND WATCH: In a sense, I wish this felt more dated: I wish the filmâ(TM)s blatantly racist cops felt as out of step today as Qâ(TM)s funky score, which screams 1968; of course, that the score is so in tune with its era is the pointâ\"while the racism may seem extreme by todayâ(TM)s standards (though not unrealistic or unimaginable or even unfamiliar), the film is trying to capture and expose its moment, and it is only by accident (or, rather, institutional inertia) that so little has changed in the past half-century. Then again, in one of the key scenes of the film, Jewison points directly to the slow churn of structural machinery, the continuum of racism across generations (which is one reason, I suppose, that racism and nationalism are such easy bedfellows)â\"a full century after the Civil War, and there are still plantations and, for all intents and purposes, modern slave owners. To discover the monstrous heart of white supremacy, one does not need to step back time, whether 50 or 150 years; rather, the film signifies how one only needs to step into the American heartland, where such cruel institutions seem eternal, forever of their own moment and ours.",
            "review_date": "2018-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is more of an important movie but, it's a damn good movie about race in a small town. It was needed at the time & is still very good today.",
            "review_date": "2017-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No one asks Mr Tibbs who he is.",
            "review_date": "2017-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my Top 40 Playlist. Stellar beyond stellar acting and relevancy. So controversial for it's time. Not shot down south but in Southern Illinois. Poitier is Brilliant, Rod is Brilliant and Warren Oates almost STEALS the show. Lee Grant is BEAUTIFUL in this movie as a character, wife and STRONG FEMININE HEROINE for Racial Equality.",
            "review_date": "2017-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beyond its social commentary, In the Heat of the Night operates as a suspenseful murder mystery.",
            "review_date": "2017-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "lol this movie was really about how crappy people were and how crappy they STILL are.",
            "review_date": "2017-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You had to be Poitier to get any respect back then.",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "10 out of 10:\n\nExciting, intriguing, well directed, and spectacular performances makes In the Heat of the Night a smart detective movie.",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tense, timeless, and unfortunately still timely.",
            "review_date": "2017-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "IDK if i shared this last night so either way i will now cuz its a true classic and approp for MLK weekend to view a slice of American history in a movie that both feels dated and yet incredibly relevant...its certainly strongly set in its era of 60s south with heat you can feel thanks to great filmmaking and acting and Steiger and Poitier give amazing performances as does Warren Oates and the others are all good...a highly intelligent not overly didactic important i dare say film",
            "review_date": "2017-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A-\n\"They call me... Mr. Tibbs\"\nThis quote has been parodied in the animated films 'The Lion King' and 'Sausage Party' and remains to be one of the greatest quotes in the history of film. I have heard that 'In the Heat of the Night' is a staple of modern times for its commentary on racism, leading it to win the Academy Award for Best Picture. Sidney Poitier didn't win the Oscar for 'Best Actor', but his tense, angry performance is one worth mentioning when talking about one of the greatest characters in cinema. I admit that the film is laughable and doesn't hold up well at times, but it is still a great movie that is worth a viewing.",
            "review_date": "2016-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitly a classic...especially if u relate it to the time it had been made. And the funny thing is...if u travel the south nowadays there are places still looking like Sparta...which in my view is more good....living history",
            "review_date": "2016-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Effective crime thriller despite a limp ending and a very slow pace.",
            "review_date": "2016-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"In the Heat of the Night\" has not aged a day, and stands just as applicable and important to society now as it did upon its release in 1967.  I cannot think of a better film to win the Best Picture Oscar than this absorbing police thriller.",
            "review_date": "2016-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic that oozes the Mississippi heat from every pore; brilliantly paced and fabulously acted piece that has stood the test of time.",
            "review_date": "2016-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film ahead of its time.",
            "review_date": "2016-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the Heat of the Night is as compelling as a crime drama as it is sharp on its social commentary, benefiting from outstanding performances from Sidney Poitier and Rod Steiger.",
            "review_date": "2016-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the pacing is a bit slow this movie is fascinating.",
            "review_date": "2016-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very engaging and provocative movie that deals with multiple themes like racial prejudice, discrimination, carelessness of law and loneliness all engulfed inside a central crime thriller plot. What works even better is the character development which is elevated even beautifully by Rod Steiger's masterful performance. While the additional layers are well written and even well executed, the central plot lacks the required thriller element partially due to emotional disconnect with the victim, leisure progress of this plot and way too many distractions. \n\nOfficer Sam Wood (Warren Oates) comes across a deceased body of a rich business man on the road during his scheduled patrol in the night. He duly informs Chief Gillespie (Rod Steiger) who takes over and orders Sam to keep a check on some usual notorious places. Sam finds a black man with a fat purse waiting to get on a train. Coming from a racist southern town, Sam duly hauls the black man to the station without even questioning him marking him as a prime suspect. When the chief finds the black man Virgil Tibbs (Sidney Poitier) to be a police officer from North and that too one of the best Homicide experts, he reluctantly requests his help in turn mounting the wrath of the town on him. \n\nIt is a movie with extreme highs and a moderate lows. While the conversations between Rod Steiger and Sidney Poitier are electrifying, the general behavior of the town is provocative and many external plot elements inducing the required urgency for a thriller, the general progression of the central plot is hampered by a leisure screenplay and too many distractions. The climax revelation needed to be a lot more intelligent given the buildup. Rod Steiger's Academy win is one the most unconventional and well deserved I have come across. Apart from Rod Steiger, Sidney Poitier and briefly by Lee Grant and Larry Gates, the host of other supporting characters performances were too ordinary. \nSome of the memorable scenes that impressed me \n1) Tibbs consoling Mrs. Colbert \n2) Tibbs altercation with Endicott and Chief Gillespie's response to that. \n3) Chief Gillespie's personal confession about loneliness \n4) Climax parting scene \n\nThe complex premise and masterful performances elevates the simple dull plot",
            "review_date": "2016-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really well acted, solid plot, great script (which balances humor and the seriousness of the situation in hand brilliantly), solid score and title track and the prejudices it deals with still resonate today so imagine their impact at the height of the civil rights movement.",
            "review_date": "2016-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "89%\nWatched this on 20/2/16\nDoes more justice to it's themes than what films like Mississippi burning could do. In the heat of the night is a mixed bag, it combines murder mystery, taut acting, tension and social commentary all at once in the same movie. This is yet another forgotten classic which gets its head right and message straight. This is the story of a town that refuses to change in a time where Hollywood perhaps had its most phenomenal changes from the ultra conventional styles.",
            "review_date": "2016-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is actually great.",
            "review_date": "2015-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a story about good cop and bad cop. A story about two policeman that begin to respect each other durng a crime investigation and leave aside the prejudice and bigotry un a southern city. Some scenes and quotes are memorable.",
            "review_date": "2015-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really well-made murder mystery, with the added tension of having the main character, Vigil (Poitier), be black detective from Philadelphia, but stuck in rural Mississippi in the 1960s. Some great to-and-fro between him & the chief (Steiger), who becomes a more understandable character as the film progresses. Crazy to believe some of these attitudes still existed 50 years ago! Solid ending, well-paced & the Ray Charles song is pretty great.",
            "review_date": "2015-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They call me Mister Tibbs!",
            "review_date": "2015-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"In the Heat of the Night\" is still a suspenseful mystery and important portrait of racism in the south the 1960s was known for.",
            "review_date": "2015-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a classic! great that producers had the nerve to release this when racism was at probably its worst in the deep south",
            "review_date": "2015-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sidney Poitier used to be the most badassed actor then he became a nice old man",
            "review_date": "2015-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful film with strong performances throughout especially from Poitier, Steiger, Grant, Dean, and Patterson. It is well written and directed with tense and gripping scenes only needed the strong dialogue and not violence.",
            "review_date": "2015-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fatest, slickest comebacks east of the Mississippi.",
            "review_date": "2015-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Potentially a great deal more audacious in 1967 than now when racism may be less overt than shown here (it has only gone undercover, sadly).  Sidney Poitier plays Virgil Tibbs, a Philadelphia homicide detective who gets stranded in Sparta, MS, after being apprehended as a murder suspect (racism) and then asked to help out (but not really - racism again).  Rod Steiger plays the new Chief who has to overcome his own redneck impulses while trying to stifle the racist tendencies of his force and the local townspeople.  Of course, Poitier solves the crime (despite being misled at one point by his own tendency to suspect rich white racists); however, this isn't really the focus of the film (i.e., I'm not sure the facts of the case lead easily to the real killer).  Nevertheless, the political points made here are still well worth it (try if you wish to substitute a Muslim cop into the Poitier role and see how it plays out in your head).  Norman Jewison does an OK job directing, although some elements feel a bit schematic and the score by Quincy Jones is dated (sound and use). But you can always rely on Warren Oates!",
            "review_date": "2015-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie. In the Heat of the Night does a fantastic job of illustrating the southern discrimination and aggression during the Civil Rights Movement era, as well as setting up an intriguing murder mystery. The script is very well-written, and the performances are great, especially Steiger and Poitier.",
            "review_date": "2015-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sparta, Mississippi is a homely little town. It's small, desolate, and drenched with unbearable heat.  The citizens are self-serving.  The picturesque advertisements that paint the faces of the middling businesses are deceiving.  At times, the town resembles something out of a '60s teen romance film, a quaint but calm setting that lets love grown on trees.  But like in \"Twin Peaks,\" there is a labyrinth of an underground that takes the wholesome Coca-Cola posters and white swing-sets and knots them into a dirty, unsightly torrent of dust and hatred. \n\tWhen a prominent entrepreneur is murdered, his body discarded in an alleyway, the town's police force doesn't know what to do with the case.  Most people have mutually decided to mind their own business, only to join forces when an unwanted visitor makes their way into the isolated bubble that is Sparta.  Murder was hush hush before.  Bodies being dumped in the middle of the street is something completely new to the citizens.  \nChief Bill Gillespie (Rod Steiger) orders his staff to search the area, looking for anyone who may have seen or heard something, or, simply looks guilty.  One officer finds an African-American man (Sidney Poitier) sitting alone in a train station; Sparta, being the brewery of racial tension that it is, doesn't ask any questions when he is arrested purely on the basis of his skin color.\n\tBut once he arrives at the police station, he makes a fool out of everyone; he introduces himself as Virgil Tibbs, a Philadelphian homicide detective that is merely passing through the town to catch an upcoming train to Memphis.  He wants nothing more than to leave, but his chief orders him to stay and aid the investigation.  Gillespie has never known anything other than bigotry, but he is suddenly forced to push his personal views aside and follow the duties of a policeman.  Tibbs, meanwhile, has to continuously defend himself from the prejudiced people of Sparta, some of whom are viciously violent when it comes to keeping the status quo in check.\n\tIn 1967, the social climate of America was drastically changing.  After years of fighting for equality, blacks were finally getting the respect they deserved, even if that process was more gradual than it should have been.  Varying cultures were beginning to have more opportunity than ever.\n\tBut then, there were towns like Sparta, buried in the deep South.  In the middle-of-nowhere and completely separated from the open-mindedness of the big cities, the Spartas of America didn't want and perhaps weren't aware of the changes that were being made in society.  \"In the Heat of the Night\" remains so important because it's both a steadfast look into the ugliness of prejudice and a snapshot of a transitioning world.\n\tBeneath all the sweat, snarling animosity, and tumbleweeds, there is a triumphant truth to every single scene.  All his life, Bill Gillespie was taught that African-Americans were underneath him, him being a superior, mighty being.  But when Tibbs comes onto the scene, we can see a newfound flicker in his eyes.  He wants to scream and shout the most appalling things imaginable and put down his newfound colleague in the same way he has treated the black citizens of Sparta.  Yet, he can't.  Tibbs is a better man and a better detective.  He's a hell of a lot smarter than he is, too.  In just a matter of days, a realization hits Gillespie unexpectedly.  Maybe, just maybe, no race is more sophisticated than the other.  Maybe.  \n\tThe fact that, less than 50 years ago, cities were still as racist as Sparta is stunningly maddening.  But Tibbs and Gillespie's relationship represents something more than just two guys attempting to get along.  The film represents something more too.  Take away the mystery, the formal vocations, and the suits, and you get a full view of a predominantly white society finally understanding the wrongs of their past.  As hesitant as they may be in terms of correcting them automatically, there's a knowledge that going on with such discrimination will be venomous, a severe death wish on every person in the room.\n\tPoitier and Steiger are absolutely excellent.  They are capable foils that bounce off each other with ceaseless energy.  Poitier is electric, stoic and utterly powerful; the scene in which he slaps a small-minded plantation owner is totally sensational.  Steiger is extremely fascinating to watch - he isn't your average movie bigot, as there is a lurking variable that fuels his hate more than mere racism.  \n\"In the Heat of the Night\" is Southern-fried and completely without boundaries.  It's an above average detective film, but beneath its whodunit tropes lays a scathing commentary that still remains relevant.",
            "review_date": "2014-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A cinematic classic that has transcended its roots to be one of the defining films of the 1960s. Political and social concerns aside, 'In the heat...' makes for a great cop and buddy film that many have tried to emulate but few have captured either its importance or its power.",
            "review_date": "2014-11-25",
            "source": "rt",
            "lang": "en"
        }
    ]
}