{
    "rating": 8.4,
    "release_date": "2009-08-07",
    "num_reviews": 310,
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "summary": "Tom (Joseph Gordon-Levitt), greeting-card writer and hopeless romantic, is caught completely off-guard when his girlfriend, Summer (Zooey Deschanel), suddenly dumps him. He reflects on their 500 days together to try to figure out where their love affair went sour, and in doing so, Tom rediscovers his true passions in life.",
    "reviews": [
        {
            "content": "My favorite movie of all time. The pacing, the story, the soundtrack, Zoey Deschanel absolutely gorgeous. I saw this at a stage in my life that just hit me different.",
            "review_date": "2023-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the movie you can't shut off! Off the chart great! Hollywood should take notes & revisit this formula of actual great writing, acting & directing! Joey Levitt is maybe the most underrated artist in Hollywood & this is a very good example of his brilliance. Almost every young man has lived through something similar to this life story. Other than the hokey korokke scenes every line, scene & casting choice are dead on perfect.",
            "review_date": "2023-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this has to be one of the most realistic romantic dramas I've seen in my entire life. Usually, every romantic drama ends with the couple getting back together or one of them dying, in some movies, it does make sense and in others it just feels like they did it just for the sake of shock/dramatic value. This film also does something similar, but the impact it leaves is just on another level. I won't spoil anything for you considering the story but I urge you to please watch this film as it teaches you an essential thing about life and about love.\n\nFirst off, Joseph Gordon-Levitt is just an amazing actor, he gives his all for the role of Tom Hansen, you feel for him and you desperately want him to get the girl of his dreams who he considers \"THE ONE\". Zooey Deschanel is also really good as Summer, she perfectly realizes her role as this mysterious girl who reveals things about herself only with people she's comfortable with.\n\nOne thing which I loved in particular about this film is the screenplay, he uses the intercut technique for this film with one event playing out in the future and then going back to the past to provide context for that particular event. It normally confuses the audience but here, it works wonders and conveys certain character emotions with a real impact.\n\nOne scene I just love in particular is the expectations/reality scene which was wholesome and equally heart-shattering at the same moment. It comes at a particular moment in the film where Tom has one last shred of hope left and it's taken away from him whilst changing the context entirely to an event that will happen in the future.\n\nOne thing which really bugs me about this film is that there is no context provided for Summer's side of the story, I understand that you want to make your audience resonate with Tom's side of the story but I really want to know what really prompted Summer to do certain things which she does or why she does it. If I had context for Summer's side of the story, I think the film would've managed to make an even larger impact.\n\nOverall, definitely recommended (especially for that extremely brief Harrison Ford cameo).",
            "review_date": "2023-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a normal love story, the film offers a novel perspective on the romantic comedy genre since it deviates from the standard storyline of a male meeting a lady, they become romantically involved, confront a challenge, and then getting married. Instead, the movie focuses on the difficulties and reality of relationships, emphasizing how they can be both compassionate and devastating.\n\nOutstanding performance by Joseph Gordon-Levitt as Tom, a hopeless romantic who becomes deeply infatuated with Summer, a person who refuses to have any faith in romance. He captures the spirit of Tom's struggle as he strives to align his ambitions of the relationship with gratitude and complexity. The viewers commiserate with the character's sensitivity as they support him while having to confront the hard truths of his circumstance. The person to whom Tom is attracted, Summer, is played magnificently by Zooey Deschanel. Her persona is mysterious, intriguing, and complicated as she sorts through her own beliefs about love and relationships. The film's non-linear narrative, which swings between various periods of Tom and Summer's engagement, serves as one of the movie's finest components. By illustrating how the individuals' emotions and interactions shift as time passes, this framework gives the narrative richness. The audience rarely knows for sure where the plot will continue, which appeals to the sensation of unpredictability.\n\nThe movie's usage of the soundtrack seems to be another outstanding aspect. Incredible compositions from artists like The Smiths and Regina Spektor are included in the background, which flawlessly captures the vibe and flow of the narrative. The audio provides the film with an additional emotional context that strengthens the audience's attachment to the characters and their path. The concept for the movie is superb and sophisticated, it generally avoids the usual clichés and rather concentrates on examining the intricacy of interpersonal connections and human traits. The people's conversations are compelling and sincere, reflecting the positive and negative aspects of their connections in a manner that seems realistic.\n\nIts candor on the obstacles of romantic partners is what makes the film so remarkable. The romance appears in the movie as something chaotic, spontaneous, and even torturous but nevertheless worthwhile to pursue. Even though it doesn't sugarcoat the reality of sorrow and regret, thus it acknowledges and embraces the enjoyment and solidarity that may emerge from experiencing love for the first time. With Summer's personality trying to defy the stereotype of the female companion, the movie confronts sexual conventions and expectancies. Layered and multifaceted, her ambitions, desires, and insufficiencies are all represented by Summer which results in contrast with various other romantic movies.\n\nTo summarize, 500 Days of Summer is a stunning, comforting, and thought-provoking film that presents an entirely novel perspective on the romance genre. The non-linear plot, remarkable cast, and fabulous soundtracks offer this movie highly recommended to anyone who appreciates an unforgettable romantic story. It will have you giggle, shed a tear, and end up leaving you feeling excited more about how influenced love and interpersonal relationship can be, and it's definitely going to be recognized for many decades to come.",
            "review_date": "2023-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"500 Days of Summer\" (2009) is a romantic comedy that tells the story of Tom Hansen (Joseph Gordon-Levitt), an aspiring architect who falls in love with Summer Finn (Zooey Deschanel), a free-spirited co-worker who does not believe in love. The film explores their relationship over the course of 500 days, jumping back and forth in time to show the ups and downs of their romance.\n\nOne of the strongest aspects of the film is its unique and inventive narrative structure, with the film's non-linear storytelling adding depth and complexity to the film's portrayal of Tom and Summer's relationship. The film's writing is sharp and witty, with witty dialogue and charming comedic moments that effectively capture the ups and downs of romantic relationships.\n\nJoseph Gordon-Levitt and Zooey Deschanel both deliver strong and charming performances, with their on-screen chemistry adding an extra layer of depth and warmth to the film's narrative. The film's direction, by Marc Webb, is stylish and visually appealing, with the film's cinematography effectively capturing the film's romantic and whimsical tone.\n\nHowever, some may argue that the film's portrayal of love and relationships can be somewhat idealistic and naive, with the film's resolution feeling unsatisfying and unrealistic. Additionally, some may find the film's quirky and quirky style to be grating and insincere.\n\n\"500 Days of Summer\" is a charming and inventive romantic comedy that explores the complexities of romantic relationships, including the difference between expectations and reality. Through the ups and downs of Tom and Summer's relationship, the movie examines themes such as love, heartbreak, and self-discovery, ultimately leaving the audience with a message about the importance of learning from our experiences and moving on. With strong performances, stylish direction, and witty writing, \"500 Days of Summer\" is a movie that will appeal to fans of both romantic comedies and quirky indie films.",
            "review_date": "2023-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is absolutely amazing!!!!!! You will and you will cry!!! Please watch!",
            "review_date": "2023-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful cinematography — horrible ending. However, did love that they portrayed unrequited love, but at times went a bit too Disney in its portrayal for my taste.",
            "review_date": "2023-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the storytelling in this movie is outstanding!",
            "review_date": "2023-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was so vibrant and carefree and I can't believe I haven't seen since 2023!!  2009 REALLY was a very different time.  So much has changed in our society since then.  Today's reality makes me sad but when I watch this movie a great big smile comes to my face!  I enjoyed this movie so much...!!!!",
            "review_date": "2023-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "500 days of Summer is great. Good acting, nice n fresh visual ideas and an uncommon story. I Love that there's no standard happy ending for the leads but pure acceptance of how life really sometimes is.",
            "review_date": "2023-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Recently, I watched \"500 Days of Summer\" and it was a lot different than I expected it to be. The story plot revolves around Tom's girlfriend Summer breaking up with him suddenly and him getting over it to find his true passions in life, and then revolving back into the relationship cycle and meeting someone new. I loved this movie because it showed me that love can be found after many tries and, like Summer believed, it's okay to not be in a serious relationship. Tom went through all the stages of grief because, in his mind, he believed that Summer was the only one and planned an entire future with her, while in reality he was creating an image in his head that might or might not be fulfilled. Life can come at you fast, and you can't forget yourself in the process of meeting others. You should be the majority source of happiness for yourself and work on yourself for the purpose of being a better person, not impressing other people. The only guarantee in the world is your own life and death, but that isn't a bad thing, you as a person can surpass the goals you've set by a mile if you truly believe in your own determination and self-worth.",
            "review_date": "2023-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was average 🤏",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is just, WOW. I love the way they put up the order of time. The concept was interesting! Do not ever question the cinematography because it was SO GOOD AND PRETTY! I could not outguess the plot and for me, it was cool ESPECIALLY THE ENDING! I would definitely love to watch this movie over and over again",
            "review_date": "2022-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie screenplay ever written!",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptional.  Anytime it's on I watch it.",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "JGL is the bad guy, not Zooey.",
            "review_date": "2022-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great cinematography and story.",
            "review_date": "2022-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film about what our expectations of love and relationships are and the reality of what they become is refreshingly told in a real way that other contrived Hollywood fare can't come close too. Gordon-Levitt shines as the every man and helps make this the best rom-com of 2009! *** 1/2 out of ****.",
            "review_date": "2022-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "See that's the real drama; you can't have love and success together in your life. Tom and Summer once again after Mia and Sebastian reminds you that; and I think that world needs these beautiful movies.\nP.s: Mia and Sebastian: La La Land\n\nAnd about my special scene; in about 1:12:00 of the movie Tom is talking about how these cards have turned us into liars, preventing people from expressing their feelings in their own words.\n\nI mean look at the lines:\nTom: People buy cards cuase they can't say how they feels, or they're afraid to.\n.\nTom: It's these cards and movies, and the pop songs; They're to blame for all the lies and the heartache, (and)everything...\n\nAnd it was in these two minutes that I once again remembered the value of norm-breaking and anti-stereotype dialogues.",
            "review_date": "2022-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Special Effects: 1,0/Sound Effects: 1,0/Acting: 1,0/Story: 2,0",
            "review_date": "2022-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't understand why so many people love this movie very overrated and boring I mean sure the actors have great chemistry but other than that it doesn't have much to offer",
            "review_date": "2022-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Misery. Sadness. Loss of faith. No reason to live. This is perfect for you!\"\n\n(500) Days of Summer delivers a twist on the traditional rom-com structure, though it's arguable whether or not the film even classifies as a rom-com with the structural alterations done to it. Completely told from the perspective of one of the two individuals, the film chronicles a collapsing relationship using a distinctive time-jumping mechanic but is more about Joseph Gordon-Levitt's Tom than it is the relationship; even if the film ends on a somewhat whimsical note and has a fair number of jokes, it trends more towards a critique of Tom's behavior and a distinction between mindless affection and love than it does a pure rom-com. Tom is in love with the idea of Zooey Deschanel's Summer and their superficial similarities, not Summer herself. He's shown to be dismissive of her own desires with his consistent, one-sided pursuit of a relationship against her will, and by the end of the film there really isn't much to suggest Tom has learned anything at all; his new relationship is shown to be founded on the same 'we like the same thing!' principles and even his next love interest's name (Autumn) suggests that Tom is heading down a similar, repetitive pathway without evolving, peppy end credits music be damned. \n\nIt's not really a relationship movie as much as it's a movie about a guy in a relationship, dissecting a male point of view and all the pitfalls of his unhealthy dynamic - obsessiveness, self-deception, etc. Quite a bit darker than it appears on the surface, but plenty entertaining and neatly put together with its staggered chronology and side-by-side shots. (3/5)",
            "review_date": "2022-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "my name is autumn and it made me feel warm at the end. lovely movie",
            "review_date": "2022-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A cute, funny a good message on life and love.",
            "review_date": "2022-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5 years ago- A poignant, rare break up movie with an excellent soundtrack. Neither lead breaks the mold too much and the film could have benefited from using Moretz more",
            "review_date": "2022-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartbreaking yet beautiful. A pet peeve of mine in film is when every single movie ends on this high note or this good, unrealistic note. This movie did the complete opposite. While still leaving the audience with hope for Tom, Marc Webb was still able to move us to tears with this detailed, unique love story. First, let me start by saying that I have never seen a movie done like this before. I loved the out of order countdown and contrast between Summer and Tom as the days changed. I also loved the little details (for example, the background of the numbers and how as it nears 500, it becomes dull and brown, whereas day 1, it is bright white). Great acting all around, some really great shots, and beautiful symmetry. Overall, an untraditional love story that leaves you broken, yet hopeful.",
            "review_date": "2022-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i like so much, kinda hard to see cause its boring",
            "review_date": "2022-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best and most original romantic comedy of 2009. Quirky, hilarious, and wistful, Marc Webb's feature film debut (he's done plenty of music videos) is smartly observant and honest about relationships and love. Joseph Gordon-Levitt and Zooey Deschanel are perfectly matched and have great chemistry. He gets the big comic meltdown and hysterical musical number, she brings the bittersweet touches. The dialogue is witty and always funny. Even as the story embraces romance movie clichés, it flips them in clever ways. There's droll narration and lovely cartoon effects to go with the sentimental moments and painful longing. It all adds up to an intoxicating romance that, even if it may not quite reach the realms of greatness, is certainly a nice change of pace from the crude/raunchy romantic comedies coming out of Judd Apatow's movie factory. Simply wonderful",
            "review_date": "2022-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great film and will speak to anyone that has tried to find love and built up a preordained relationship in one's head contrary to the reality of how the other person actually feels about you. Part of me wishes I saw this when I was in my early 20s but I'm equally appreciative of the perspective I have now - I didn't expect to like this film as much as I did. Great movie and message.",
            "review_date": "2022-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In terms of plot, the film has more in common with 2016's La La Land, and it explores the different expectations, for better or for worse, of these two characters. It is not unrealistic, or contrived, as many romantic comedies can be, but a true love story in the sense that it is raw, and features the many problems two people can have when they are together, just because of the fact that they are two different people.",
            "review_date": "2022-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally managed to get through this after a couple of tries.  On the up side, 3rd Rock does a great job at being emo.  The mood is subdued, and they clearly keep the tone realistic.  I think the movie does a great job portraying the ups and downs of young love, along with all the confusion and point of view bias.  If I was young, dumb, and suffered a recent break up, this would be just the movie.  OTOH, now that I am older, it seems like so much sentimental schlock.  But I don't think this movie was made for me.  Also, a rare miss for Hitgirl.",
            "review_date": "2022-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rarely watch romance movie but this one is awesome.",
            "review_date": "2022-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A refreshingly realistic relationship brought to life with wonderfully original direction.",
            "review_date": "2022-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a catharsis for me. Love it.",
            "review_date": "2022-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A narrated film, we're told at the beginning that it isn't a love story, but it is.  Most of it is unrequited love, but at the end, there is... well, I don't want to ruin it for you.  An interesting story all around.",
            "review_date": "2022-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The soundtrack was top tier. Need I say more?",
            "review_date": "2022-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only romance every one actually has to watch once in their lifetime!",
            "review_date": "2022-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching it for the first time 10+ years after release I found it underwhelming considering the hype it had at the time and the reputation it still has.  It had the typical rom-com elements and tropes but never wanted to commit which for me swung the tone around too abruptly especially at the end.  The non-linear format throughout the movie also didn't seem to serve the narrative in any way (other than starting with the breakup and then going to the beginning).  \n\nGordon-Levitt(Tom) was hitting his prime here so no complaints on his acting, and despite her later rep as playing the stereotypical Manic Pixie Dream Girl I thought Deschanel(Summer) was actually pretty subdued in the movie; for me it worked showing how Tom was projecting his idea on what he wanted Summer to be.\n\nOther than those points I found it middling and vastly overrated compared to a movie like Nick and Nora's Infinite Playlist which just came out a year before and had better chemistry between the leads, a better soundtrack, and a much better use of the setting.",
            "review_date": "2022-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exploration of a relationship. Great music choices.",
            "review_date": "2022-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Doesn't age well or pass the Bechdel test.",
            "review_date": "2022-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I guess this is technically a rom com as it's got both rom and com, but it's actually way too good to be saddled with that label. Just a great, funny, heartbreaking film with a fabulous sound track",
            "review_date": "2022-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So well acted it makes me gutted for Joseph. Great film",
            "review_date": "2021-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very well acted and a very good movie, I had to go to a independent movie theater just to be able to watch it and wasn't disappointed.",
            "review_date": "2021-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An Impetuous love story. that welcomes you in to the day dream of falling in love and the Blindness or obsession that comes along with it. dives into the fog of love and thinking you know exactly how the other person feels. and how devastating it is when you realize they don't feel that way. but life leads to something else always. its a lovely Love story. relatable in fact. always Love Zoey Deschanel.  the Cinematography of the movie made you feel so up close to the story! loved it.",
            "review_date": "2021-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a love story, and that's what makes it so great. We've all obsessed and fantasized about unrequited love and this film captures that in us perfectly. Zoe and Joseph nail their roles and the cinematography tells this story so well.",
            "review_date": "2021-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A cleverly structured storyline and surprisingly upbeat tone for a tale of heartbreak help add to the genuine bits of comedy. Charming and endearing without the sappy sentimentality and doesn't have an average effect of the male audience.",
            "review_date": "2021-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, I liked it alot even though it made me feel awful, you guys should watch it",
            "review_date": "2021-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much like tenderness itself, (500) Days of Summer delivers an immersive, remarkable experience with a relatable story when love–and life–happens.",
            "review_date": "2021-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie. It was a great story told out of order. Joseph Gordon Levitt and Zooey Deschanel are amazing in this movie. Great soundtrack. Quite funny and so enjoyable to watch. It was very realistic and still holds up so well! A great movie that you could get more from with multiple viewings.",
            "review_date": "2021-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A self-aware romantic comedy that has a lot to say on love and relationships, acting as somewhat of a critique of the genre at times.  Clever screenwriting, brilliant editing and great music choices make for a movie that's both interesting and a lot of fun, with a pair of fantastic performances at its center.",
            "review_date": "2021-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun film.\n\n'(500) Days of Summer' impressed me. It features a fairly unique and a pretty refreshing romcom story, which is told in an interesting way. Joseph Gordon-Levitt (Tom) is very good, as is co-star Zooey Deschanel (Summer). The pacing is good, as are the comedic aspects. All in all it's a pleasant watch.",
            "review_date": "2021-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fresh and original .",
            "review_date": "2021-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I genuinely think this has one of the best screenplays ever. The way it employs the unreliable narration is transcendent, to say the least. Clues to the main character's unreliability are in plain sight, yet we can't help taking every chance to put the blame on Summer, simply because the [love] story is told from a one-sided perspective, that of the selfish character of Tom. With a ridiculous amount of charm, mostly derived from the electric chemistry between its two leads, and a slick non-linear narrative structure, (500) Days of Summer is disguised as a Romantic-Comedy with a new spin on the genre tropes, while it actually serves as a clever subversion of them that effortlessly fools us all.",
            "review_date": "2021-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Marc Webb, in a bold debut as a director, presents a complex film about young relationships. It's about the love two people feel and the heartbreak that comes with it when the relationship doesn't work out.",
            "review_date": "2021-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A manipulative and oblivious romcom with sincere and clever storytelling. \"(500) Days of Summer\" has a lot of problems, but I forgive most of them because of the original and enduring writing and emotional moments. The comedy is clean and crisp as well. I highly recommend this film.",
            "review_date": "2021-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a little bit all over the place with it's out of order sequences and gloomy take of life's soul mates.  Joseph Gordon-Levitt was pretty good.  His bff's were good.  Zooey was just Zooey.  It's like everything else she's in.  I think that the movie shot from Joseph's characters point of view during a 500 day span made me miss the Zooey true love aspect of it which fell short for me.  She seem the cynic throughout the movie and then BAM we are suppose to believe it love at first sight?  Ending was predictable.  All in all the director did a more than decent job telling the story it just wasn't for me.  Not a feel good rom-com.",
            "review_date": "2021-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film successfully breaks down many cliches from love movies. It's funny, entreteined, and you can feel empathy for the characters.\n500 Days of Summer is pretty good love movie that is different from the others in a good way.",
            "review_date": "2021-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A deconstruction of the manic pixie dream girl and the nice guy trope through the lens of a doomed romance.",
            "review_date": "2021-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film 500 Days of Summer can easily be classified as a \"comfort movie\". I'm a bit of sucker for rom-coms so naturally I was drawn to the appearance of the film. However, after watching the movie it is evident that it is unlike any other sappy rom-com of its genre. The characters and storyline do not depict a perfect, fairy tale romance, but rather a much more realistic perspective of relationships. I think the purpose of the movie and characters can be easily misunderstood by audiences. The main characters have a good level of complexity and depth which is what creates such an intriguing story. The film really illustrates the contrast between expectation versus reality. While nothing quite dramatic occurs in the plot of the film, something kept me watching until the end, and brings me back to watch again and again. 500 Days of Summer is one of those movies you can watch repeatedly and find something new every time. It is not necessarily a movie with the typical \"happy ending\" like most comfort movies, but instead leaves viewers with a new perspective of love.",
            "review_date": "2021-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It broke my heart in the best way possible. \nI think it was very original how they tell the story by days and not exactly linear.",
            "review_date": "2021-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a masterful blend of art house originality and realism with just enough mainstream cliches and tropes to keep even just your average movie goer entertained for the entire runtime. Nonlinear storytelling becomes inconsequential as you realize the story coming together as a whole and the deeper meaning and message behind it all. I think this is one of the most underrated romance/non-romance movies of its time. Masterpiece.",
            "review_date": "2021-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartwarming about how one cannot always get what they love and the film has a good concept of reflecting the past 500 days for the main character. This is my first film that I watched that has Joseph Gordon-Levitt. I think he did a great job as Tom, with the right expressions after he lost Summer and showed contrast in the end as a new and improved him. I liked Zooey Deschanel more after watching this film, as her character had a lot to show: her uncertainty in relationships, the tiredness of them, the unexpected transition to being a wife, and still having a good relationship with Tom. This film is one that makes me think of how a relationship is filled with obstacles, but with the mutual love for one another, it is possible to be long lasting. One of the finest romance-drama films after hundreds of films I have watched.",
            "review_date": "2021-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Impressively filmed, deftly written and directed, and with charming lead performances from Joseph Gordon-Levitt and Zooey Deschanel, it's an honest, clever, realistic, quirky, offbeat, rewarding, relatable and thoughtful depiction of romance and its hardships, although its ending undermines its themes.",
            "review_date": "2021-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So beautifully and cleverly made. One of my favourite romance movies.",
            "review_date": "2021-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mild but liked it. Joseph Gordon-Levitt definitely out-acted Zooey Deschanel.",
            "review_date": "2021-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think it's overrated. It's an interesting look at how we perceive relationships and how we define love differently and how our search for our version of love clouds our judgment. If I were younger, I may have enjoyed this more for its message. But seeing it for the first time, at 31, having been in a strong relationship for over 8 years, I can't really relate to it. Also, it doesn't really pull you in and it's a bit slow.",
            "review_date": "2020-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I decided to watch this with a special person in \nmy life. One of the worst decisions ever. Straight \nup BS 🙌🏽",
            "review_date": "2020-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This feels like a high school movie -- but for people in their 20's[?]. I found this movie to be pretty original, relatable, but I also found it to feel pretty forced at times. 6.8/10, C+",
            "review_date": "2020-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my new favorites! Definitely a must-see for those who are tired of the same old romantic comedies and are looking for something a little more unique!",
            "review_date": "2020-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A spectacular and wildly original rom com with an all time great soundtrack and star making performances from its two leads, (500) Days hasn’t been topped in its genre since its release over a decade ago. A must watch for any helpless romantic, it has infinite rewatch ability with some truly hilarious moments and incredibly filmmaking tricks. (Expectations Vs. Reality scene is a landmark scene imo) if you’ve never seen this movie do yourself a favor and find it on streaming or rent it off amazon. ",
            "review_date": "2020-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wholesome time with a bubbly personality, but ultimately falls into cliché as time has aged.",
            "review_date": "2020-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great fantastic very touching movie about a couple who isn't a couple but in my mind are. It's confusing but anyway starring zoey don't know how to spell her last name and Joseph Gordon levitt. This movie gave me the realness of a couple I've wanted in a movie. Romantic drama movies rarely do that now and I applaud this movie for doing so. And a little heads up don't watch this if you're in a relationship. Watch this if you're single.",
            "review_date": "2020-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie with a great storyline and great characters! It is beautifully edited with one of my favorite scenes ever, the reality versus expectations scene! And the soundtrack is amazing too!",
            "review_date": "2020-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This may be the most realistic depiction of a relationship ever portrayed on screen. This movie has great dialogue and great acting.",
            "review_date": "2020-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic and essential.",
            "review_date": "2020-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They were both annoying but the acting was good. Clever premise. I liked it better this second time because I love Zooey.",
            "review_date": "2020-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fresh and entertaining take on the rom com genre, actually this isn't a love story, as clearly said in the beggining of the film, but in fact, is a story about heartbreak. 500 days of Summer manages to balance heartbreak and humor with expertise, add two grear performances by Joseph Gordon Levitt and Zooey Deschanel at her charming best, and you get not exactly a perfect movie but a film that feels fresh, while it does many things right, the transitions from each day can be seen as tiring and messy.",
            "review_date": "2020-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The actors are great but there characters become grating at times. The ending for me makes the entire thing feel kind of pointless.",
            "review_date": "2020-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not typical romantic film. It really connects with audience. It never gives you feeling like fairy tell. Anything form the movie can happen with you or would have with you. \nMust go for this movie. everything in this movie is excellent. Acting, story, cinematography, music and yeah the climax.\n500 days of summer is one of the realistic movie one will ever watch. The emotions have been perfectly defined . The pain one go through after breakup.and how to pull our-self out of it 💓. It teaches us something more about love and our past lovers .\n\nWhenever i hear romantic word this movie always comes in my mind.",
            "review_date": "2020-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "*My thoughts on (500) Day of Summer*\n(500) Days of Summer is a Romantic Comedy about a guy named Tom Hansen (played by Joseph Gordon-Levitt) who reflects on all 500 days he spent with his ex girlfriend, Summer, (played by Zooey Deschanel) and tries to think of what went wrong in their relationship. (500) Days of Summer is such a unique film because it's not like the regular sappy, unrealistic romance films that we all see today, this film tells a realistic portrayal of a relationship. The movie doesn't lie to the audience about what love is like the hollywood style rom-coms and it even references that in a scene where Joseph Gordon-Levitt is talking about how movies and music are to blame for the lies about love, this movie shows how a relationship builds up and how it breaks down. This is also a movie that is very self aware and doesn't take itself too seriously as a romance film which is why the romance and comedy work so well together. This film is absolutely hilarious, it knows when and when to implement humour correctly and when to implement drama correctly. The screenwriting for this film is brilliant and the directing is great, when scenes in the film show how happy Tom is, you just can't help to smile as well. The performances in this film are great, Joseph Gordon-Levitt and Zooey Deschanel are both excellent in their roles. Joseph Gordon-Levitt in my opinion is such an underrated actor and he is great in this role, along with his other movies like 50/50. The storytelling in general was flawless and unique unlike the modern day clique type romance films because this film has its own style as it uses a non-linear narrative structure of telling the story as it might show day 35 in one scene then in the next scene it might go to day 290. It's such an original film and I love it. Overall this movie is great and it's definitely my favourite rom-com. 5/5 stars",
            "review_date": "2020-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful movie about love and heartbreak that isn't your typical, predictable romance movie. This is worth checking out.",
            "review_date": "2020-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Literally awesome movie ever at breakup!Felt like sweetest poison of truth at ending amazing movie amazing acting just everything was amazing!",
            "review_date": "2020-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a good chioce for a movie night with gf/bf or friends.",
            "review_date": "2020-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great romance movie of showing the art of puppy love and unrequited love. It depicts the life of most of the lonely man out there seeking for love. After all, you're just another passer-by of her life.",
            "review_date": "2020-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3/5. Called out the ending within the first 5 minutes of the film",
            "review_date": "2020-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It works, it just works",
            "review_date": "2019-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun, comic and identifiable. Mark Webb has managed to bring a deep message about love along with an attractive and funny storyline.",
            "review_date": "2019-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is absolutely honest and true.",
            "review_date": "2019-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece in non-linear storytelling. I hesitate to call it a romantic comedy because it actually inadvertently pokes fun at the genre. With a budget of only $7.5mil, it puts to shame movies with 10x the budget. Lastly, any movie critic that gave this movie less than two stars should probably be working at a fast food restaurant asking, \"Would you like fries with that?\" instead of writing movie reviews.",
            "review_date": "2019-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Joseph Gordon-Levitt masterfully delves into the intricacies of a complicated relationship in a film where the protagonists are simultaneously insufferable and lovable. Although many viewers will finish the movie with the wrong idea about the main protagonist, this film is at its core a critique of male entitlement told through the lens of a romantic comedy. ",
            "review_date": "2019-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Essentially boils down to a hipster love story, which for me is blah. Zooey Deschanel is cute indeed, and JGL has his charms but for the most part was a bit on the annoying side. Not a fan of the back and forth timeline either. Overall a big MEH.",
            "review_date": "2019-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's pretty rare for nowadays movies to show a different aspect of love and finding your soulmate beside happy and predictable endings and without a touch of realism in it. this movie did it perfectly. ",
            "review_date": "2019-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just a very well cast and well acted film which explores the relationship of two people. ",
            "review_date": "2019-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes, it has that quirky, hipster quality but i like the way it presents relationships and how we can alter situations in our head. Joseph Gordon-Levitt was perfect for this role. ",
            "review_date": "2019-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie!    Very sweet and a realistic view of relationships 🤓 tomato",
            "review_date": "2019-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a fun movie, but that was about it. I enjoyed it. It was a very lighthearted film . ",
            "review_date": "2019-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The closest to realism a rom-com could probably venture to. 500 Days of Summer will make you feel things you don't want to feel in the most bitter-sweet way possible.  ",
            "review_date": "2019-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've seen this movie so many times and still love it! Although it has a bittersweet ending, it teaches a valuable lesson to those looking for soulmates. ",
            "review_date": "2019-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this film. I love romances but as the narrator says, this is not a romance. Speaking of the narrator, he is great. It isn't intrusive to the plot and he is entertaining. The soundtrack and song choice is great and fits the theme perfectly. The basic concept is awesome, the idea of the movie being based on days of â~Summer' provides a great sense of time and pacing for the plot. Artistically it is great as well, intermittent parts where the movie shifts genres and a comparison of fantasy to reality looks and feels awesome, the greeting card esc backgrounds are nice too. The cast, Summer is well done and she plays her role to a tee, Tom's sister is fun, and adds some humor and personality to Tom. Through all of this the absolute star of this film is the one and only Joseph Gordon-Levitt. He doesn't have many lead roles and here is where he is given the chance to show off his prowess and his ability to show what feels like real emotion. Terrific ending, I am blown away by a rom-com-tragedy.",
            "review_date": "2019-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprised by the negative reviews for this film! For people who say this film is too fluffy and adorable, didn't you notice how from the beginning, we already know the relationship is going to fall apart? For me, that made the adorable moments take on the flavor of over-idealized memories of sometime you already know has left you. The flavor of sadness and anger and confusion because it's hard to figure out how things that seemed so real were actually insincere or shallow or fleeting. I've been both characters at different times and i think this movie really captures a lot of subjective truth. The worst parts of the film were Tom's insanely fancy apartment for his greeting card writer's budget? And I wish we could have a mirrored story showing Summer's side of the story. I've been in her position and it's tough to be with someone who idealizes you and ignores what you really say and do.",
            "review_date": "2019-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A decade later, and it’s still the best Romance/ Comedy ever made IMO. It’s just so true, and unforgettable. And if you’re trying to get over a break up, this is the perfect movie for you; that’s how I first got introduced to this movie, and it helped. ",
            "review_date": "2019-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "500 Days of Summer succeeds in a lot of aspects. From its characters, to its style to the way it choices to tell its story. The film is a knockout when looking at these aspect as it creates a fun, light hearted feeling to itself.\n\nThe film mainly loses me when it comes to the relationship between the two main characters themselves.\n\nWhilst the relationship was believable and kept me invested, it left me with many questions that I felt the film either didn't answer or failed to properly answer. This created the problem of the film's characters making certain decisions and taking certain actions for the sake of the plot, which was disappointing as the film does a great job making the characters likeable and interesting.\n\nDespite my personal problems with the film, I feel it doesn't overshadow everything the film does right. Although I probably would't watch it a second time, I would defiantly recommend it to people.",
            "review_date": "2019-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A romance thatâ(TM)s a little less sentimental than usual and a beautiful snapshot of Los Angeles and the young people who inhabit it.",
            "review_date": "2019-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "such a beautiful movie... excellent music, the \"truth\" about love.",
            "review_date": "2019-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is a little self-indulgent, and at first I really disliked it, but as one gets older, he really starts understanding and sympathizing with the characters more. Never thought I'd give this movie so many stars, but I guess I've been in JGL's shoes at least once by my age. That being said, remember to keep communication clear. JGL clearly could have told Summer what he wanted and expected in the beginning, but he dilly-dallied after that company karaoke event. Part of the movie wasn't just his fantasy, but also his inability to man up.",
            "review_date": "2019-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unpredictable.  At one moment, charming, romantic, disarming, unsettling.  As real as figuring out real love.  Hopefully will go down as a classic.  Two great actors in their prime working with a raw, real script.",
            "review_date": "2019-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant I never tire of watching it",
            "review_date": "2019-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very touching movie, oddly accurate and realistic (the overall) which makes it enjoyable to watch, you can easily relate to the character, at least i could. Anyway if you're emotionally down this might be the movie to see, besides the actors are very much charismatic.",
            "review_date": "2019-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb deconstruction of the romance genre.",
            "review_date": "2019-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I absolutely love this movie. It’s by far my favorite romantic comedy. Should’ve at least been nominated for best screenplay at the Oscars. ",
            "review_date": "2019-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film wasn't like your typical rom-com; it was original in many ways. I really appreciated the use of the split screens that differentiated the difference between expectations verses reality. For me, it really makes you question whether you should expect more or expect little when it comes to love and all other things revolving around relationships. Overall, the film was done well.",
            "review_date": "2019-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I heard someone once say this is the only love story you ever need to watch. They aren't wrong; the story of Tom and Summer's relationship is one that we can all learn from to improve our own lives.",
            "review_date": "2018-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This might be my favorite film ever! I have watched it over and over and quote from it! I can't believe it's nearly 10 years old now. It think it's funny, sad, charming, and teaches some good points about love and change.",
            "review_date": "2018-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the should be in the top 100 movies one of the best romantic comedy i have ever seen and its simply bad ass. it doesn't matter how matter how many times i see it it never gets old and i always get the same reaction when i watch it the first time",
            "review_date": "2018-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched it because it was recommended by a friend. My friends know me well because even if this hit way too close to home, this movie totally captures how it is to be in this guy's situation without being overly dramatic. Maybe if you've never felt that way this movie won't do it for you but I loved it, even though I usually find Deschanel annoying.",
            "review_date": "2018-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wowwww what a movie smart and break all the rules of love story realy realistic and it get you feel in this world not in a fantasy recomend!!!",
            "review_date": "2018-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a very unique romantic comedy that has remained in my head for the past decade.",
            "review_date": "2018-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies ive seen\nAll it features is the worst parts of hipster culture rolled up in the hate story of a typical nice guy douche and a mentally screwy fuckgirl",
            "review_date": "2018-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was almost good.",
            "review_date": "2018-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally a realistic \"love story\" that doesn't have the dreaded cliché happily ever after.",
            "review_date": "2018-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good that this movie did not last 500 days.",
            "review_date": "2018-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This romance-comedy was hilarious and I enjoyed every minute of it.",
            "review_date": "2018-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite featuring the manic pixie dream girl trope this movie is still a must see due to the wonderful lead performance from Joseph Gordon Levitt.",
            "review_date": "2018-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If there's a film that better critiques the harmful romantic mindsets of the teens and twenty-somethings of the 2000-2010 decade in such a charming way, I've not seen it.",
            "review_date": "2018-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the drama and romance movie 500 Days of Summer, the idea of fate is communicated throughout the film. The stars of the movie Zooey Deschanel and Joseph Gordon Levitt, show the struggles of love in the 21st century. The portrayal of lost and gained feelings gives insight to how often we in real life face challenges with love.\n\tThroughout the movie the characters Summer Finn and Tom Hansen are in constant uncertainty with their love for one another. Tom is a hopeless romantic and a firm believer in love at first sight, he feels this instantly when he meets Summer. However Summer thinks otherwise, she informs Tom that there is no such thing as love and that it is a fantasy. Nonetheless Tom continues to pursue Summer and falls even deeper in love as they go into a dating phase. What Tom doesn't realize is that Summer doesn't love him the way he loves her and she communicates to him multiple times that they are just friends. Tom doesn't take this rejection well and becomes depressed and cynical, leaving him to believe that Summer was right, that nothing means anything and love is just a fantasy.\n\tTom once said before Summer broke his heart, \"I love her, I love the sound of her laugh, I love her cute knees, I love this heart shaped birthmark she has, and I love the song I hear when I'm with her.\" After his brutal break up, so to speak with her he repeats, \"I hate Summer, I hate her hair, I hate her cackling laugh, I hate her knobby knees, I hate that splotch she calls a birthmark, and I hate this song!\"\n\tA few months later Summer invites Tom over to her place for a party and Tom's expectations exceed reality. At the party he comes to discover that Summer, whom he still loves, had recently become engaged. This breaks him down for months, until he finally gets up, quits his job, and goes on to find his passion in life. More months pass and Tom runs into Summer again, and she tells him that he was right all along about love and that it does exist. This leaves Tom bewildered and somewhat satisfied. Later that day Tom meets another woman named Autumn.\n\tI enjoyed this movie because it explained the ups and downs of love and the very realness of fate. I also enjoyed the actors in the film, Zooey Deschanel and Joseph Gordon Levitt, and how they conveyed the lack of love in their relationship. Tom and Summer weren't meant for eachother, they were destined to meet new people to fall in love with. Which Summer had already done and now its Tom's turn. The film shows that just because love fails once doesn't mean it always will.",
            "review_date": "2018-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious and heart warming.",
            "review_date": "2018-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Painful. No chemistry. Depressing. Dull. Disjointed. Lousy. ",
            "review_date": "2018-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Props to anyone who can watch this movie and be okay with the ending. But overall wonderful movie in every way possible.",
            "review_date": "2018-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty accurate to relationships now a days ,\nthis movie really goes deep into how some\ngreat chemistry's between people end up being\nsomething that could of being amazing.",
            "review_date": "2018-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A different take on a romcom, which in a way is refreshing. However, the movie is not particularly funny and I personally find the constant backs and forth in time to be confusing.",
            "review_date": "2018-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seriously funny, thought provoking and a wonderful cast. A romance film which is one of a kind.one of the best ever.",
            "review_date": "2018-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie gives an unpretentious portrayal of love while superbly excels the idea of bitter-sweet. The directing from Mark Webb is artistic, immaculate and help makes Joseph Gordon-Levitt and Zooey Deschanel characters bona fide and profound.",
            "review_date": "2018-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "nothing is meant to be...sometimes coincidence  happen ha ha",
            "review_date": "2018-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a Romantic Comedy without the romance and the comedy. This movie has very few redeemable qualities. The cast is unmemorable except Gordon-Levitt and Deschanel, most of the characters are annoying, and the story is very bland. The thing that really drags this movie down is Deschanel, she is just so annoying and very bland. The redeeming qualities are Gordon-Levitt is amazing and relatable and the ending is pretty good. I do wish that they added a few minutes to the movie just to show us what happens to Tom and Autumn but they didn't. This is a movie you watch after a break up or with some friends just as a random movie night, if you want to watch a good movie with a very similar premise just watch Don Jon a much superior Gordon-Levitt movie.",
            "review_date": "2018-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An unique look at love and heartbreak, '(500) Days of Summer' offers a fresh take to the genre and solid performances from its leads, but at times the characters are insufferable and the narrative seems lost.",
            "review_date": "2018-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the best movie ever!",
            "review_date": "2018-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring and pointless",
            "review_date": "2018-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a standout! It's exceptionally clever with wonderful dialogue. In my opinion, if it's not already, it'll be a cult classic.",
            "review_date": "2018-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the best no romantic movie",
            "review_date": "2018-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not gonna get emotional here, (famous last words before someone gets emotional) but if you've ever gone through a breakup and felt like the Beatles were breaking up a second time you were so torn up about it, this film is therapeutic.\n\nAn incredible mix of sensible humor and relatable characters, told with one of the most unique and badass framing devices I've ever seen, \"500 Days Of Summer\" is one of my all time favorite movies. I'll revisit this about two or three times a year, and anyone who doesn't like it I will make them kill me before I stop trying to sell them on the merits of this film.\n\nTo listen to the bros sing drunk karaoke and tell you how they'd try to pick up a chick at IKEA, head on over to broforcesquad.com",
            "review_date": "2018-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "500 Days of Summer stars Joseph Gordon-Levitt and Zooey Deschanel where Joseph falls in love but the girl doesn't.  I read that 75% of the movie truly happened.  You want a love story this is one that doesn't not end happily.  The storyline very well depicts how some women truly are crazy but I also blame the guy for not expressing his desire.  At times it was not fun to watch, I just left bad for him.  At their final dance she never mentioned to him about her intentions to marry.  The final scene in the park must have been his imagination, his expectation that did not come true.  Overall it was very engaging and definitely keeps your attention, add this to your library.",
            "review_date": "2018-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Rom Com in my opinion.",
            "review_date": "2017-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Had its moments. Really cool to see how after a certain amount of time things just weren't the same anymore.",
            "review_date": "2017-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved how honest and realistic it was on how relationships work and how expectations and reality clash. It is a very original film that catches the viewers attention with symbolism and without being edgy.",
            "review_date": "2017-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of most clever and witty romantic comedies in years. Gordon-Levitt and Deschanel have electric chemistry that only adds to a well written film. It turns the genre on its head. It's brutally honest and realistic. There's a tremendous soundtrack, some heartbreaking scenes, and two characters who you can get behind. The \"expectations/reality\" scene is remarkable. One of my favorite films of all time.",
            "review_date": "2017-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The anti-Manic Pixie Dream Girl movie cunningly disguised as a Manic Pixie Dream Girl movie. Owes a huge debt to another favourite of mine, \"Gregory's Girl\", but I wont hold that against it as it stands high on its own merits.",
            "review_date": "2017-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie so much, It got me through some pretty hard heartbreaks and its always a must watch for me.",
            "review_date": "2017-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice to see a proper rom com for once.  Levitt and Deschanel give strong performances in a film that takes risks with its narrative structure and ending.",
            "review_date": "2017-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cute, could get annoying at some point, but luckily it stays fresh all the way through. More than a decent love story. Thumbs up!",
            "review_date": "2017-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of most clever and witty romantic comedies in years. Gordon-Levitt and Deschanel have electric chemistry that only adds to a well written film. It turns the genre on its head. It's brutally honest and realistic. One of my favorite films of all time.",
            "review_date": "2017-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just the right amount of pessimism and optimism for me. I related to both characters pretty easily. And it was nice the way they did the time jumps so it wasn't the same boring boy-meets-girl drab.",
            "review_date": "2017-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The quirkiness can feel forced, and there's the tiniest bit of an identity crisis throughout, but overall \"(500) Days of Summer\" is an enjoyable film with a core relationship that feels authentic and engaging.",
            "review_date": "2017-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A romantic greeting-card writer is caught completely off-guard when his girlfriend, Summer suddenly dumps him. A nonlinear 500-day reflection in which he realizes what he did wrong in order to move on. The acting by Joseph Gordon-Levitt and Zooey Deschanel is truly convincing and it is not a cliché movie to be a romantic comedy, which is rare, but rather the opposite, it is actually very relatable and similar to what life is really like.",
            "review_date": "2017-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of my favorite romantic comedies to watch on any occasion, great film.",
            "review_date": "2017-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes, it's a subversive take on the romcom. But a sloppy execution, mediocre performances, and plenty of indulgent, cringe-worthy scenes leave me disappointed.",
            "review_date": "2017-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This has to be my all time favorite movie! The cinematography is spectavlcular and I am so in love with the plot. This movie hit a close topic for me and I will never not appreciate it! THIS is a must-see!",
            "review_date": "2017-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good movie, with a beautiful story for those who suffer from love",
            "review_date": "2017-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Delightful, charming and smartly inventive.\n\nThe story or boy meets girl has been told and re-told a thousand times over. But 500 Days of Summer exhibits a cleverly constructed structure telling of the high and lows of a relationship between Tom and Summer. The usual structure is thrown out of the window and instead highlights dozens of moments big and small, happy and sad, as the story of Tom and Summer gradually draws ever closer to the 500th day and whatever that particular day brings with it.\n\nAccompanying this fantastic and creative storyline are two brilliant lead actors. Both Joseph Gordon-Levitt and Zooey Deschanel were perfect for the roles. Not only is their off-screen chemistry replicated on-screen, they create a perfect balance in their relationship as it moves on throughout the film.\n\nA unique romantic comedy that is unlike any before. The film's realism in terms of actual relationship's rather than Hollywood's clichéd perfect romance is a big factor in why this film has received not only a high mark by me (a very honour indeed!) but also esteemed film critics that have remarked upon the innovative and delightful storyline, structure, acting and music. The combination of it all thus creates a romantic comedy that has surpassed them all in delivering a believable and heart wrenching story of relationships.\n\nhttps://rwh92.wordpress.com/",
            "review_date": "2017-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "500 Days of Summer is one of my all-time favorite movies and I will tell you why. The male protagonist in the story is simply someone I can highly relate to. The idea of love, friendships, and relationships all get complicated and this movie portrays a story of all three so well. It makes us think of past experiences with relationships and how something can feel so wonderful and at the same time so confusing. Simply put, it is a love story that isn't a love story.\nSounds complicated? Yes, it does. It is what relationships and love can do to a person. Sometimes we see things that may be perfect for us that are actually imperfect. The story was good, but I feel like something else really made this film stronger. After watching it the second time or more, I noticed very subtle expressions from the male protagonist that really amazed me with his acting skills in this movie. You can almost feel how he felt during his moments whether it was during his attraction or anger. You could see it in his eyes and simple facial expressions how he truly reacted to every detailed moment or comment. The emotions felt so real and that is what made this movie even better. If you do not know what I mean, you must see it for yourself. Or if you have watched it already, watch it again and pay attention to the detail in the main character's expressions and how he reacts to every comment the lead female says.",
            "review_date": "2017-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Charming, funny, heartbreaking, beautifully acted even though you know at the beginning it's truly not a love story. Great to revisit at times.",
            "review_date": "2017-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All time favorite movie. Not only is the story line so real in today's day and age, but the cinematography is beautiful. The way they utilize colors and provide enticing visuals make the movie that much more in depth. Characters were well developed and portrayed in an unusual and artistic way.",
            "review_date": "2017-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining, but quite poorly acted and way too cute for its own good.  The style was nice but kind of obvious.  I understand it was Tom's movie and told through his alternating rose- and black-colored glasses, but we literally never got to know a single thing about Summer. That's kind of a problem.  Best scene:  Expectations vs. Reality.  Good soundtrack.  Though as the movie states, liking the same things -- like musicians -- isn't enough of a reason to love something.",
            "review_date": "2017-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A poignant, rare break up movie with an excellent soundtrack. Neither lead breaks the mold too much and the film could have benefited from using Moretz more.",
            "review_date": "2017-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That was a very long Ikea ad....",
            "review_date": "2017-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When we revolve the time qhen we first met someone 2e loved. When we revolved around someone that breaks our heaRt in the end. When we naturally think life revolves around us when we got loyal friends and family. When naturally we depend on thkngs that revolve when it transports us, it moves us, it is industry that influence us, it is built in us. When we have a solar system that revolving is natural when we have four seasons and a sun. 2hen we revolve around holidays each year to work for a greeting card company. When we share the same common revolving interests. When we gave always revolved around ourselves and share the same similarities when they do to and others to them. When revolving around some things is just who We are and shapes our habits. When we revolve around things when we strive for perfection. 2hen not everyone shares in what we revolve around. When our brains are wired to revolve when we have songs that stick in our head when they are catchy. When revolving is obsessive when it's constant. When we are addicted to revolving when drinks are involved. When we don't always revolve on what most people revolve to being independent. When we all have a representative of those things we revolve around to know you either stay revolved or not with them (ie santa). When we just like revolving around some people when their Ora is positive and fresh. When everyone revolves around somethings including machines. When we revolve around our imagination of a perfect or ideal life when we picture ourselves together in a joking manner. When we revolve around the idea of somethings to either believe or not believe in some things. When we revolve around somethings when it happens it's a victory, it's an accomplishment, it's a song and dance that we rejoice in. When we naturally revolve when the concept of dating has always been home, work, personal life and back again. When we revolving too much, we get tiresome that change is needed. When we revolve around the ideas we think is right and suitable we draw it out and show. When we are open to revolve around somethings we are trusting to those we are accepting and comfortable with. 3hen we revolved around some people for too long that we need a detour qhen things go south and negative.\n\nWhen we revolve around somethings for too long and enjoy the ride if both spaces we share and circulating back and forth we can't help but want to settle and breed on each other's gravitational space. When we revolve around some people for too long we spin. When we can just see that we are revolving and headed towards somewhere that we were clear we would steer clear. When we have revolved around many others spaces. When revolving around our own space mixed with others it could get toxic. When we naturally produce waste that revolves when it's part of life. When our memory captures good moments like film the revolve and project like films. When our stuff revolves and circulating around and around we naturally revolve. When the reason we are good at revolving when we have deep feelings to express ourselves and thoughts in which others cant. 2hen we are good at revolving but slow down we need grease to get us going again on a different line. When we can't revolve around other gravity when their pull is too strong. When some revolving routEs we taken we may think is different but the same. When some revolving routEs are like train tracks we enjoy over and over again but we eventually have to get off. When it's a short or long enjoyable ride that is addicting that we miss that makes revolving extra more enjoyable. When we revolve around and around like dancers we take the same route back to and revisit old acquaintance. When we revolved around the same route to know that others have taken the route and detoured to another direction. When we wish those would still remain revolved around us but can't. 2hen We remain still in the same place and haven't revolved out to being confronted about it that makes seem as if we haven't launched at all. When we are revolving around alone being toxic to those nearby. When revolving so much drains our energy and time ticks aWay. When we could careless when we revolve around in our negative space. When our industry has revolved around special moments and emotions and stood past the hand of time to kno2 it is still a thriving and needed industry qhen times are hard and busy to express what we want. when we revolvE and dwell on the past and see the subtle signs we could have saved ourselves the energy and trip, 2hen others are thinking of detouring. When 2e are ready to be launched into a different solar system and revolve around some other orbits. When we learn to revolve orbits and see how to launch, soar and circle patterns then we steer clear of dangers and mark our plans to fly smoothly. When we rather revolve around more steady and firmly in placed orbits that we rather revolve around. When we countless orbits to revolve around that we happen to confidently find life When we least expect it.",
            "review_date": "2017-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So very realistic. A movie with great performances that is actually pretty funny and has great poetic moments. \"Not a love story\" told through the perspective of a guy who falls into love and the roller coaster of emotion because of it. Recommended for most ages 91% 9/10",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "super cute movie. want to rewatch it!",
            "review_date": "2017-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good movie to watch",
            "review_date": "2017-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Smart, funny and refreshingly unconventional, 500 Days of Summer's sharp script and charming performances from Joseph Gordon-Levitt and Zooey Deschanel elevate this romantic-comedy to a cult status.",
            "review_date": "2017-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clever take on coming of age a bit late ... for a young man hooked on a young woman who's \"there\" but just not quite enough in spite of how things seem. Great opener from the author about the movie being a work of fiction, etc!! Deschanel is always watchable and nicely cast. One wonders if she wouldn't have been part of a good pairing for \"La La Land\" with her retro band background. Maybe next time ... :)",
            "review_date": "2017-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A comic drama that, far from provoking laughter, presents a relatively well-founded idea about destiny, and the search for love, being the most salvageable themes of this history full of clichés. It is a film that deals with the relationship between Tom and Summer who find themselves working in a company dedicated to the production of gift cards. Over time, they are discovering which are the intentions of one with the other and this is made through a trip in the time in which is navigated between the memories of Tom, that are narrated by a third that never appears. The story unfolds in Los Angeles, and the name of the girl makes an interesting analogy regarding the season of the year, which functions as how brief and momentary an encounter of any kind can be but that being little or much, occupies an important space in our lives. The fact that the argument is not chronological, which does not confuse unless you really have problems as to the notion of this, is a strength in the film because it reveals that memories usually have no order and that after a painful experience, these events are satiated and constantly jump from the sad to the joyful. I loved the fact that the story is being told by a man and not a woman, which brings to us a new perspective of how different can these roles be developed in real life. The problem with it is that it is simply not funny, although it has funny moments but they are not enough to make the plot dynamic, but rather quite relaxing. The most serious is that the relationship between them is uninteresting and as you move forward, their  feelings are shown very superficial and unconvincing. The character of Deschanel is completely detestable, confusing and impossible to be wanted or even understood. Even so, the film retains this tender touch and sweetness that this genre must have, however the main idea is lost several times in how banal and mechanical are the characters all the time.",
            "review_date": "2017-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its ok. extremely hipster. zoey is not a great choice for him but they kind of just fall into it i suppose. its pretty good.",
            "review_date": "2017-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It made me feel very very very sad and angry. Particularly sad.",
            "review_date": "2017-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A refreshing romantic comedy that's thoughtful and distinct from the generic feel good sensation of the genre, and that's because of it's honest dramatization and narrative, which is ultimately satisfying. \n\nIt is subtly thoughtful and moving because of how Tom portrays qualities of all people who undergo breakups; stubborn, lazy, and mopey. And how his non-linear narrative arranges his memories of his relationship from worst to best. \n\nThe choice of using a non-linear style of jumping back and forth between scenes and memories is creative and realistic in this film because it is timely for it's character Tom, though confusing at first. \n\nThe screenplay is creative and artistic in it's approach in portraying how Tom views his relationship. On a certain scene, he's got a musical sequence to the groove of \"You Make My Dreams Come True.\" And then another scene, a black-and-white-silent-film-type of scene that' emulates a confessional.\n\nWhether you're about to watch this for the first time, just finished watching, or hitting the replay button, know that this movie is anchored on Tom, and how he champions his convictions about love and destiny. The screenplay and the non-linear fashion, that everyone talks about, is solely and mutely told from Tom's frame of reference-His expectations that stem from pop culture, how his expectations have been inscribed to his character, and how his expectations fail him. \n\nIt's ending scene is memorable because the movie presents it's message in an inspired, thoughtful, and abrupt fashion.",
            "review_date": "2016-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is not another common romantic/comedy movie a la Jennifer Aniston. This is something more.",
            "review_date": "2016-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny and entartaining, with a great performance from Zoe Deschannel. The soundtrack is amazing.\nI would definitely recommend it.",
            "review_date": "2016-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun romance film about breaking up.",
            "review_date": "2016-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As imperfect humans do we tend to remember things in an order organized from worst to best - never-ending is the dwelling upon situations either doused in some sort of emotional trauma or some sort of discontent.  Sometimes are good memories premier, but we're more inclined to lying awake at night beating ourselves up over moments we wish we could take back.\n\tAs the entirety of subversive romantic comedy \"(500) Days of Summer\" is told in flashback, kicking off at the tail end of a failed romance, it would perhaps prefer to focus on the finer feelings of its central doomed relationship to its slow burns of heartbreak.  But because it's eerily close in its resembling to one's memory bank - it tells of the five-hundred day long relationship between Tom (Joseph Gordon-Levitt) and the eponymous Summer (Zooey Deschanel) in a non-linear style that jumps back and forth between seemingly unrelated days (from Day 2 to Day 250, for example) - there's never a moment not shaded by longing bittersweetness, by empathetic relatability.\n\tBecause we've all had relationships like the one spotlighted in \"(500) Days of Summer.\" An underdog in a genre that takes a liking to perfect matches and champions the unrealistic ideology that is the soulmate, in place is the kind of unbalanced courtship wherein one party is deeply in love while the other is consistently unsure of their true emotions and eventually becomes a heartbreaker.  \n\tThe looming relational train wreck, immediately (and bitterly) is autobiographically revealed at the film's opening, but even without it would we be easily equipped to tell that Tom and Summer's love is distinctly one-sided - Tom would kill for the titular, quirky brunette beauty without hesitation, whereas Summer, despite obviously caring a great deal for the beau she does, in her defense, declare that she doesn't much want to begin with, isn't so sure she can commit to making such declarations surrounding the opposite party anyway.\n\tAnd yet the tragicomic trappings of \"(500) Days of Summer\" arguably make it more memorable a romantic comedy.  How energizing it is to have a genre gem in which the leading couple isn't actually made for each other, in which happy endings aren't so certain in their happily ever after positioning, in which the male hero's more than an idealistic pile of charm and in which the female of interest has more to worry about than her romantic life.\n\tThe screenplay, by Scott Neustadter and Michael H. Weber, is appealingly offbeat, packed with charismatic artistic detours that include a musical sequence and a talking head style, black-and-white documentary imitating confessional.  The direction, by Marc Webb, enchants without running into schmaltz.  Levitt is humanely congenial, Deschanel lovable if damaged.\n\tBut by \"(500) Days of Summer's\" end are we, at odds with its mostly impeccable technical and artistic risks, left feeling as though it could be something more than it is.  Pestering me is the notion that we could have been presented with a primary cinematic romance that didn't so often take on the tone of lovestruck boy running after girl who doesn't like him all that much (Summer's various states of disregarding paired with her brushes with ingenuity and authenticity make her a sometimes difficult character to understand - though I suppose that could be precisely the point).  Badgering me is the idea that the characterizing of the beginning and ending of Tom and Summer's relationship is so strong that the juice coming in the middle almost seems nonexistent (which is, therefore, a detrimental setback).  Still, the movie's beautifully nonconforming and oftentimes categorically superior - it's genre fodder a cut above from its formula driven peers.",
            "review_date": "2016-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some days i hate it, some days i love it.",
            "review_date": "2016-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While Deschanel was wonderfully charming, Levitt ruined the film along with Arend. The musical numbers were not impressive and the story was really superficial. If you are looking for some cheesy romantic comedy with no chemistry then this will do, otherwise please avoid.",
            "review_date": "2016-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing strory. Tight Script. soothing music. All makes you to fall in love. but unlike the usual romcoms, it has the so  desperately wanted twist",
            "review_date": "2016-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hey look! An actually really good romantic comedy! Those are pretty rare. Anyway, I really enjoyed this film. It's incredibly weird and over the top with it's quirkiness, but yet still manages to be believable and make a point. It's so clever and so original with it's style that you can't help but smile the whole time.",
            "review_date": "2016-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THIS MOVIE SUMS UP MY LIFE I REALLY LOVE THIS MOVIE",
            "review_date": "2016-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply one of the best (or the best?) Rom-Com of the last 20 years.\nIt gives an honest and sincere view on the complicated process of falling in love with somebody, helped by the innate charisma of Joseph Gordon-Levitt and Zooey Deschanel.",
            "review_date": "2016-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you ever want a go-to romcom, this is the one. Joseph Gordon-Levitt and Zooey Deschanel hit it out of the park with their acting and chemistry together. This really is the movie that catapulted JGL's acting career into what it is today. The movie is filled with funny, enjoyable moments such as the \"You Make My Dreams Come True\" scene. However, it doesn't take anything away from the plot and the issue it tackles. This movie does an excellent job detailing the reality of love and relationships and avoids all the fairy tale bs in the majority of other romcoms. It's a movie any young teen should see before venturing into the fantastic, yet confusing and stressful world of relationships.\n\nThe movie is presented in a creative, non-linear fashion taking the viewer back and forth through the 500 days that Tom experienced with Summer, culminating in the 500th day, which brought the entire movie full circle. The ending scene is ONE OF THE BEST of all-time and truly presents the message of the movie: that although a relationship you were once in, which ended abruptly and hurt you, but brought you so many happy memories, dwelling on what once was will only hurt and cut you deeper and prevent you from seeing what new memories and opportunities lay right in front of you.",
            "review_date": "2016-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Marc Webb's excellent direction in 500 Days of Summer streams through my mind and allows it to think and feel about the film's subject, especially when it features the brilliant chemistry between Joseph Gordon-Levitt and Zooey Deschanel.",
            "review_date": "2016-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great fantastic very touching movie about a couple who isn't a couple but in my mind are. It's confusing but anyway starring zoey don't know how to spell her last name and Joseph Gordon levitt. This movie gave me the realness of a couple I've wanted in a movie. Romantic drama movies rarely do that now and I applaud this movie for doing so. And a little heads up don't watch this if you're in a relationship. Watch this if you're single.",
            "review_date": "2016-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"500 Days of Summer\" is a movie that runs the basic novel cliché, the film tells the story of Tom Hansen (Joseph Gordon-Levitt) who falls madly beautiful beautiful Summer Finn (Zooey Deschanel), they spend 500 days together, but then she simply exchange with a non-linear narrative and a good script, it surprises for their doses of humor and high drama, mixed with good performances, choreographed dances and cool soundtrack, the film surprises as touches a point which many have passed, and it is very easy to identify with the movie and buy the suffering by Tom, the film itself warns us at the beginning that this is not a novel, but it's easy to cheer for the couple, then get angry with Summer, but then we understand their motives and morals that the film wants to spend. It's always nice to watch a romance that runs away from the cliché.",
            "review_date": "2016-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cinematography, acting, music, plot are all phenomenal. The film makes no false promises of a cheesy love story or boy becomes hero. Rather it is a very real, human, relatable experience that makes you resonate with the characters. It's a film where everyone can say \"I know that feeling\", or \"I've been there\". We have all been a Tom or Summer at one point or knew one, and can recognize the flaws in them as if they were our own and give us clarity and awareness. Such a beautiful, heartfelt story that is a true depiction of romance and dating in real life.",
            "review_date": "2016-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Liked Levitt in this one , but how he holds up with Zooey beats me ...i would ban her much earlyer out of my life ! Just friends ??? Phoe . SOMDVD",
            "review_date": "2016-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun movie for anyone in there 20's and possibly other ranges. Both leads do a great job of delivering dialogue in a well directed script. There are several fun moments in this movie that may come off as cheesy if you aren't fully invested. There is a lot of jumping around but it gives you the feel of hearing a friend telling a disjointed tale of his love life. The manic pixie dream girl character may be over done today, but this was one of the first movies that started things off. Definitely a cute watch, not  technically a romance so don't let that turn you away.",
            "review_date": "2016-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cute and relatable, \"500 Days of Summer\" is yet another solid romantic comedy where Joseph Gordon-Levitt can shine. \n\nTom Hansen, a greeting card writer, falls in love with the secretary of his new boss. However, when it's stated that she doesn't believe in love, nor does she want a serious relationship, he accepts in hope that he can make something more of it. \n\nI knew little, if anything about this movie going into it, but I was excited to watch it. I picked it up on Blu-Ray at my local DVD store for a few bucks and I was finally excited that I had the chance to watch it. To my surprise, it actually turned out to be pretty good. Granted, it doesn't feel like anything new or original, and nothing here is going to blow your mind, but it's a very cute and honest romance that will be able to hit home for more than a few people.\n\nFirst and foremost, I am a fan of Joseph Gordon-Levitt and I've liked Zooey Deschanel in the few things I've seen her in. Individually, they each fill their roles real nicely and Levitt has always been a great, comedic/dramatic actor, but together, they create this very charming and pleasant atmosphere that I'd like to see more of. They work really well together and they build off of each other pretty well. They bring out the personality of the characters and they're able to help relay this great and real message about love.\n\nI feel like the best words to describe the script was cute and realistic. For starters, whenever I say a romantic movie's screenplay is cute, that's a really good thing for me. When I'm able to giggle and relate to the things that the characters themselves are doing, it just helps bring this new experience that I only get to experience every so often in real life. When I say realistic, that means that this movie is completely honest about how our minds work when it comes to different scenarios of love. In the end, all of us just want to love and when we think we've found love, we'll do what we can to pursue it. Even though it's obvious that this is probably not the path that Tom should take, considering he's blatantly told that, it shows how clouded our minds can get and how love can easily take over the human brain. I really like the message this movie portrayed about love and how difficult it can be sometimes.\n\nAlthough I understand why they did it, I'm not sure I liked the format of this movie. They were constantly jumping back and forth from day 1, to day 494, back to day 23, then to day 254, and it just got really confusing at a point. It felt like they were jumping from timeline to timeline just for a few comedic moments and it felt a little bit messy. \n\nI also felt the narration was unnecessary. We didn't need the narration to help guide us through, especially since neither of the characters were doing it. I felt like it could've been more meaningful if Tom was narrating the story, but instead, it was some random guy doing it. It felt out of place and awkward at times to the point where it just got annoying.\n\nThe resolution of the story was also out of left field. I won't spoil anything, but the way it resolved not only conflicted with some moral values of one of the characters, but was a very quick and cheap way to wrap things up. It helps resolve Tom's character but it honestly makes Summer's character more unlikable for me. \n\nStill, in the end, I had plenty of fun with the movie and I was able to leisurely laugh and smile throughout.",
            "review_date": "2016-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An honest romantic comedy with more comedy than romance.",
            "review_date": "2016-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'500 Days of Summer' starts as a quintessential romantic-comedy movie that toys with cliches, but eventually shatters the conventional romance platitude with it's creatively executed non-linear storytelling, bold and beautiful script, and solid performances from the lead cast. Ultimately, '500 Days of Summer' is one of the most genuine, and most memorable romantic-comedy movies in recent memory.",
            "review_date": "2016-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of those movies I loved, the moment I watch it, It's honest, it's raw, it's funny and clever, it make you feel and see that relationships are complex, and most of the time both sides have a point. People don't always look the same thing, it's a great movie, and the acting by both leads is nice.",
            "review_date": "2016-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gah. Why is Tom pretty much me. I've never found a movie so relatable before it might be my new favorite.",
            "review_date": "2016-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is what I call a clever movie with a beautiful twist.",
            "review_date": "2016-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a fantastic film. Its a pretty accurate depiction of some themes in modern society",
            "review_date": "2016-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is an indie dream; the highs are so beautifully high and the lows were a masterpiece!  Soundtrack to die for, perfect with a glass of wine!",
            "review_date": "2016-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A romantic comedy that is so self aware about itself, it's oddly psychological.",
            "review_date": "2016-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "500 Days of Summer is funny, unique and very real. The characters all have qualities that we share as humans as well as flaws and are all interesting and convincing. Overall this is defiantly a feel-good film and a convincingly real one at that with relatable characters and hysterical moments.",
            "review_date": "2016-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sweet, heartwarming, and funny, 500 Days of Summer is one of the best romances in the world.",
            "review_date": "2016-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thought this was bad back when I was a naive young idiot and now it's even worse. \nTry to name one person more unbearable than Zooey Deschanel.",
            "review_date": "2016-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From a unique and artistic standpoint, 500 Days of Summer does an incredible job. However I felt the story could have been more complete. Non the less, it is a good movie.",
            "review_date": "2016-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jeremiah \nI am interested to see 500 Day of school.",
            "review_date": "2016-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes there are different ways of expressing love, now Hollywood has proven they can in a heavily clever and charming tail of boy meets girl, they have cleverly shown that love stories and stories about love are different, they have shoved this clever tail into a ever more exciting non-linear set up, which makes the film even more charming. Hollywood newcomers Joseph Gordon-levett and Chloe Mortez join Hollywood regular Zooey Deschanel to delight this tail even more, amazing cast fitted with a clever little story and even better directing and then finally chuck in a vintage charm of a soundtrack and that meets a perfect little romcom that will delight audiences even more than the trailer expected. A big thumbs up to such a charmer if a flick!",
            "review_date": "2016-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a film that is praised as original and funny quite often, in my opinion it isnt very funny and not very original! Well, technically it does have stuff which i havn't seen before (and i know thats basically what original means). But its not good original. It feels like they added all the original stuff in just for the sake of being original, without really putting much thought in to it. I never got connected to the characters and thats because they are not honest, they're just movie characters. If you want to see an honest romance, watch Blue Valentine or Richard Linklater's the before trilogy.",
            "review_date": "2016-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very slow rom-com, with charming narrative but not innovative story.",
            "review_date": "2016-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(500) Days of Summer is a cute romance-comedy that could happen in real life to anyone. It is not a cliché love story, and the story is kinda timeless. I enjoyed this movie very much, and I love it.",
            "review_date": "2016-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably my favorite movie about love (but not a love story).  Zooey Deschanel and Joseph Gordon-Levitt have the most charming relationship and chemistry.  The movie is delightful even when it punches you in the gut with reality (although it's hard to imagine anyone not loving Tom\nin reality).  It's one I can rewatch and laugh and sigh over the highs and lows of trying to find \"the one.\"",
            "review_date": "2016-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It could have used a better over-arching story, but 500 days of summer is smart and fresh.",
            "review_date": "2016-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't get how they saw this and thought \"gentlemen we have our next Spider-Man director.\"",
            "review_date": "2016-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Offbeat romantic comedy with flash back and forwards on the 500 day timeline. Zooey comes across as sexy without baring any skin. Nice ending without being soppy",
            "review_date": "2016-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love movies and I try to find something I like even in the genres I\ndon't really watch. Romance and Independent films are some of those\nfilms that I do not watch that often, So why 10 out of 10 stars? I\nthink its because this movies does something that not other movie in\nthe same genre does. Its a \"Chick Flick\" that's more leaned towards\nguys. I have seen this movie pretty close to around 10-15 times and It\nhas never gotten old for me. It's not just about a guy trying to get\nthe girl but more about the guy trying to keep the girl. I think Tom\nplayed by Joseph Gordon-Levitt is such a relatable character for any male that\nhas chased after the girl of their dreams. Everything from the music to\nthe drama is something I never get tired off. Ill have to give this\nmovie my highest recommendation.",
            "review_date": "2016-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Massively let down by what I was promised was a great film.  I rate Gordon-Levitt highly, but felt that he was very limited with this sad sad character.  The film didn't make me laugh, it didn't feel romantic and it certainly wasn't dramatic!",
            "review_date": "2016-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was cute, kind of charming and funny, and enjoyable for a romantic comedy, though unorthodox. I hate most romantic comedies, but this I didn't mind. Shows the more honest ugly side of love, which I respect more than the other lying fake crappy romantic movies.",
            "review_date": "2016-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of my alltime favorite movies. i can watch this 100 times and love it more and more",
            "review_date": "2015-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "500 Days of Summer will forever be one of my favorite movies. It has a simple charm that is blended effortlessly with the non-linear presentation of a romance that many people can identify with. Joseph Gordon-Levitt and Zooey Deschanel knock their performances out of the park; along with an array of side characters that support and amplify their performances. From heartfelt moments to spats of laughter 500 Days is an enjoyable ride that I can watch again and again.",
            "review_date": "2015-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite Romance film of all time.",
            "review_date": "2015-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "''Before you uninstall any software from your system even it ask you the reason for your action and when all of a sudden a girl avoids you and says things are changing between us and I am not sure about our relationship, this leaves a boy in confusion, he deserves the answer and by recalling the days he spent with her, begins his try to figure out their awful change in relationship that made him loose his ardour'' very simple storyline with effective presentation and intense performance 2009's coming of age romantic drama ''500 Days of Summer'' surely leave a mark.\n\n''Coincidences, that's all anything ever is, Tom had finally learnt there are no miracles, there's no such thing as fate, nothing is meant to be...'' the dialogues, narration and the intensity of the frame to frame presence pulls us totally into its flow, Joseph Gordon Levitt with his ardent performance as happy go lover boy and with an intense pathos shades steals the show, he casts the charm with his tremendous acting abilities, Zooey with her calm, simple performance gains the attention and mark her stand as a good actress.\n\nNon-linear narration of the story and unique try in framing and presentation especially the frame of distinguishing reality from expectations are some honourable attempt that gains special attention, beautiful syncing background music are adding marks for its soft and realistic narrative flow.",
            "review_date": "2015-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "summer will pass, and autumn will come",
            "review_date": "2015-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the best romantic comedy since When Harry Met Sally. Clever concept, funny dialogues, believable romance, and has a great idea about relationships. Every single character brings life and charm to this film. Also, this is one of the only romantic comedies I can and will watch over and over again.I think the length of this film was not sufficient and they did not let the relationship between Gordon-Levitt and Deschanel blossom so when they broke up, the audience will feel a lot more emotion and saddened by the \"hard and cruel\" fact that they are not meant to be together.",
            "review_date": "2015-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As realistic and honest as it is heartwarming and funny, 500 Days of Summer is a movie with an outstanding personality and an engrossing narrative, all enhanced by it's excellent pacing, smart direction and fitting soundtrack.",
            "review_date": "2015-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply one of the best (or the best?) Rom-Com of the last 20 years.\nIt gives an honest and sincere view on the complicated process of falling in love with somebody, helped by the innate charisma of Joseph Gordon-Levitt and Zooey Deschanel.",
            "review_date": "2015-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What kind of fucked up movie is this i just cried my fucking eyes like 3 time. She just gave up on  him like nothin. But wait theres more then he meets an autumn ????? That just made the other girl look like shit like she was just another season like fuck is wrong with all you.",
            "review_date": "2015-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "500 Days is different love story, and worth watching.  I would have rated it higher, but I found the non-linear presentation confusing.  It felt like taking Shakespeare in class and having to read it a couple of times to figure it out.",
            "review_date": "2015-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I came away really enjoying this movie. Reminds me a tad bit of Annie Hall.",
            "review_date": "2015-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film felt uncomfortably familiar. As much as I wanted I just could bring myself to like Summer. It may have been intended to have a happy ending but it didn't feel that way",
            "review_date": "2015-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So true its almost painful to watch",
            "review_date": "2015-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Keeps being good no matter how many times I watch it.",
            "review_date": "2015-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a movie for retards...I luv both of them but the movie was so boring...",
            "review_date": "2015-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very creative and beautiful film that takes romance and studies and makes a satire out of the \"love\" dilema. With a great script, a perfect pace and beautiful shots, its hard not the get sucked into this strange tale.",
            "review_date": "2015-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched the film (500) Days of Summer. It includes a few twist and a lot of humor.  This movie goes deep into real life love and the ups and downs of how it may happen. \n     (500) Days of Summer is a romantic comedy that shows the love story between two co-workers. It's setup like a timeline, flashback to show how what happened between them. The main character, Tom, has a crush on a girl, Summer, who works in the same building as him. This film shows how they meet, get to know each other, be together, then finally apart. Tom fell in love with a girl who doesn't believe in true love and now is trying to remover what went wrong. It's funny that he consults to his friends for help.  The plot is different from a normal rom com and gives a huge conflict between the characters relationship. It has some good comedy and gives you the thought of what went wrong for them. \n     This film gives an overall theme of \"true love will find its way around.\" (500) Days of Summer can teach you how a relationship can happen and if maybe they were meant to be. It shows that his love will find its way around and adding humor and drama. Not only does it entertain but this movie describes how someone's love life can happen and how to make sure you end up happy. The director here shows the ups and downs on how to get to know someone but hopefully in the most normal way. Also with the crazy things done and how what's meant to happen will happen. \n     The film itself was good. The locations and costumes were realistic. It has a bright lighting and music that matches the story.  The movie has cool shots showing the landscape and the characters together. It also has funny moments showing before and after. \n     Overall, I enjoyed the movie. It had a good setup that's different and a unique storyline. Many twist and turns were there and there really was a nice ending. I would recommend this movie as a morning movie just to sit back and enjoy. It's really cute and funny and has something different then the rest. \n\n-BJ (8th Grade Student)",
            "review_date": "2015-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can relate to him!",
            "review_date": "2015-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "500 days of summer is an exceptional rom com that features a unique narrative to a thoughtful love story (I mean, a story about love) and extremely likable leads.",
            "review_date": "2015-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie ever In my top list. Kind of movie you can watch over and over. Realistic. Reality vs expectations. Movie is gold",
            "review_date": "2015-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Marc Webb's warm, wonderful, complex romantic comedy is something special.",
            "review_date": "2015-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sophisticatedly funny, smart, witty, and real, 500 Days of Summer is a good film, that includes great editing and acting.",
            "review_date": "2015-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A refreshing romantic-comedy with a sad tale behind it. Joseph Gordon-Levitt has outdone himself.",
            "review_date": "2015-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At the start of this film you are told that \"this is not a love story\". This stops you from turning off immediately and shortly afterwards you recognise that this film is going to contain lots of good music so you stick with it. You are sort of conned as it is a full on indie Rom-com which is hopping backwards and forwards chronologically to hide it's unimaginative story. Points given for the music and Belle and Sebastian reference but not much else.",
            "review_date": "2015-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watch this movie all the time. It's filmed in a way that you could watch it over and over again whilst learning something new. I relate to Summer Finn and I don't find her to be a bad person. She's reasonable and original. It's interesting watching two worlds that are so different yet similar come together. It's a darkbased/reality/romance that to some may come confusing but to others makes alot of sense. I highly recommend this! If you find my review boring as shit prove me wrong and watch the fucking film! :)",
            "review_date": "2015-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent, good soundtrack and acting performances.",
            "review_date": "2015-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie doesn't have any sense.. I waited for something to happen but the movie ended before it.  Poor acting for the actress and poor story ... or script... how ever it is supposed to say",
            "review_date": "2015-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie in my opinion",
            "review_date": "2015-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No other romantic comedy has ever captured the feelings inside romance so potently. It's fun until it's painful, it's goofy until it's serious, it's passionate and then it moves on. It isn't just about love, it's an near perfect metaphor for it.",
            "review_date": "2015-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i would say its unique, its stylish in its own thing the way in its cinematography. That's how this romcom drama looks like. Story telling is genius and yet compelling at times. It shows how a guy falls in love in a wrong i mean very wrong place to a woman's heart which is really not ready to commit with him at all. In short he was \"Friendzoned\" as to speak. Though this film is an intelligent one, very interesting and easy to watch and very recommended. To all any sort type of couples out there, well this film is for you. 4 out of 5. Great job Marc Webb..",
            "review_date": "2015-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A creative, original romantic (sort of) comedy with several laugh out loud moments, and a non-Hollywood twist for an ending.",
            "review_date": "2015-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful love story which is full of surprises. Movie with amazing tone, screenplay, direction and sonorous soundtrack.",
            "review_date": "2015-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's solid. Moments feel real. Actual funny and smart rom com",
            "review_date": "2015-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "dont understand the good ratings? very weird,sad and wrong",
            "review_date": "2015-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really creative, inventive romantic comedy that tells an usual story about a tragic but relatable relation, with an amazing script and great performances, 500 days of summer shows that not only true love stories are worth telling.",
            "review_date": "2015-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As near perfect a film as I'm ever likely to watch",
            "review_date": "2015-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable anti-rom-com with a twist. You wouldn't wanna meet a woman like this on POF :)",
            "review_date": "2015-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a romantic comedy...",
            "review_date": "2015-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"500 Days of Summer\" is the \"Annie Hall\" of the 21st century.",
            "review_date": "2015-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a great movie, Joseph Gordon-Levitt is awesome! This movie was just great a one of a kind film.",
            "review_date": "2015-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best romantic comedies I've ever seen",
            "review_date": "2015-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best rom-com I have ever seen, other than maybe Midnight in Paris. Very existential. Most guys can relate to Gordon-Levitt's character at some point in their lives.",
            "review_date": "2015-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Officially the best soundtrack of any movie I own. (500) Days of Summer is such an amazingly moving and heartbreaking movie. You know right from the get-go that it isn't a love story, but like Tom after hearing Summer say that she doesn't want anything serious, it still breaks your heart when they don't end up together. The way the movie is told and directed is brilliant (out of sequence/chronological order). A movie that overwhelmingly hits so close to home for me. This is the movie that really sealed the deal, for me, on how great an actor Joseph Gordon-Levitt is (this and Brick). One of the best indie films ever made. I love every second of this movie.",
            "review_date": "2015-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quality film.  I know this is technically a chick flick, but I love the way this is filmed, and the comedy is great.  There were some times here where I legitimately laughed out loud at some of the jokes.  This is just a really likable film, and I'm glad that I saw it.",
            "review_date": "2015-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I cried. I laughed. Good stuff.\n\nDon't expect a ton of laughs. This is more of a movie with heart, but the moments where I did laugh were big laughs unlike anything in several years.",
            "review_date": "2015-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most clever and original romantic comedy to date. I'm aware of the comparison with Annie Hall. I like this as a more modern take on love. One of the best and most creative endings I've ever seen.",
            "review_date": "2015-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know not all movies are going to be \"happily ever after\". This movie perfectly sizes up adult angst in the game of love... and the guy sometimes doesn't get the girl. Still, I loved the journey, the characters...even though I wanted to through a brick at both of them. But that is what a good movie does, it moves you to feel... something.",
            "review_date": "2015-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A funny and charming romantic comedy that starts off seeming like it'll be predictable but takes pretty much every direction we wouldn't expect it to take (in a good way).",
            "review_date": "2015-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first time I watched this, I watched it from his perspective, the guy perspective, my perspective. I ended up angry and frustrated, blaming the girl for all his misery and woe. After a second viewing, where I saw the film from her perspective, I saw how wrong I was and how I am not so different from the main character, idealizing, expecting, and over assuming. This film has really, changed how I feel about the whole relationship idea.",
            "review_date": "2015-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's one of those special rom-coms that'd managed to be charming with plenty of humor, nice points from a perspective, and an appealing pair to an average moviegoer's taste, with the outcome being the cherry on top when it's a different turn-out by avoiding predictability. (B+)\n\n(Full review coming soon)",
            "review_date": "2015-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "500 Days of Summer was a very different take on a romantic comedy. It really worked for the better in this case! The story follows Tom and his hopeless affection for the new assistant Summer in his greeting card business. Throughout the movie they go through many ups and downs and makes for really good entertainment! The transition between their up times and down times shown through the look of the background whenever they show different days was really neat and clever. I'll have to say that this movie sealed the deal that Joseph Gordon Levitt is an amazing actor. He nails it in this movie! Zooey Deschanel too, while not as likable as she is in other things, did a great job. The film's themes of heartache and love is realistic as hell, I mean this is real stuff! While I do appreciate a good straightforward love story at points, it was nice to see a much more realistic view on a possible failed relationship and the struggles that a couple can have. The story has many morals and themes to it, some more hopeful than others but effective for sure. The one that I took from it is that we are not destined to be or stay with one person, life just sort of happens and affects the way we love. The two leads had perfectly shown chemistry of how this is proven. The end of the movie in my opinion was probably as perfect as I wanted it to be. I honestly loved that ending a lot. 500 Days of Summer was a really realistic and tragic story about how a relationship can really take its turns and hit us hard. Something really clicked with me in this movie as the credits rolled. Maybe it's just that the soundtrack was really suiting and made me get that wonderful feeling that I had just seen something special. A-",
            "review_date": "2015-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't get it.\n Lame. Plastic. Forced, unfun.\n\nIt was touted as humorously quirky, funny, endearing, accessible, romantic, and enjoyable.\nIt was none of those things.",
            "review_date": "2015-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Refreshingly honest and led by two extremely charming, offbeat performances from Joseph Gordon-Levitt and Zooey Deschanel, (500) Days of Summer is a remarkable feature-film debut for both director Marc Webb and writing duo Scott Neustadter and Michael H. Weber. While the rom-com formula has been around for decades prior to this film, Webb, Neustadter and Weber have taken an overly familiar genre and crafted something truly inventive and stylishly clever. This is certainly one of the best romantic comedies of the 21st century.\n\nFull review at http://silverscreenfanatic.com/2015/02/10/benjamins-stash-58/",
            "review_date": "2015-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love is real, or maybe is not exists.",
            "review_date": "2015-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is an anomaly. Coming at a time when everyone was tired of rom-coms promising to be something new and exciting, this movie was marketed as a rom-com which was new and exciting! But that's the only way to describe this little gem of a movie. Sure it's not perfect, but it's difficult to find a movie with such a beautiful sense of melancholy, flashes of laugh-out-loud comedy and a emotional ride from highs to lows which actually effect the viewer. \n\nTom Hansen (Joseph Gordon-Levitt) is our not-quite-typical lead. Working at his dead end job as a greeting card writer and half aspiring to be an architect, his routine life is one day interrupted by Summer Finn (Zooey Deschanel). Tom is immediately enraptured by Summer's stunning looks and intriguing demeanour and decides that he must have her. This is where the film takes a little detour from the schmaltzy beaten track of your run-of-the-mill rom-com. Everything is just a little bit off the normal axis, with endings being presented at the beginning of stories, beginnings taking place at the end and everything else just a little bit out of whack. \n\nThis Pulp Fiction-esque narrative style is one of the film's strongest points. Instead of ridiculous running to airport scenes or appearing in the pouring rain outside the girl's front door, we are told from the very beginning that \"This is a story of boy meets girl, but you should know upfront, this is not a love story.\" So with the big climax taken out of the equation, the entire film turns into a story about what happens in between the meet-cute and the weepy finish. But wait, there aren't any of those either! Tom and Summer meet boringly at work and the big weepy finish simply doesn't exist. Now you start to get the sense of just how brave director Marc Webb and writers Scott Neustadter and Michael H. Webber have been. Each different scene is prefaced by a number, representing days since meeting Summer. Thus the brackets around (500). This is a tricky narrative style to keep up throughout an entire film, but they manage it. Just. Often the film can feel as if they may be on the very, very edge of using the technique as a stunt, but they never quite slip into that territory. Instead, the film is as light and fresh as new love itself, though never afraid to plunge you from joy straight into sadness. \n\nAnother pitfall which many rom-coms fall victim to is a terrible script. Filled with schmaltz and stilted dialogue, they can easily lapse into a slew of cliches, each one less romantic and less comedic than the last, and very rarely actually achieve either of their abbreviated genres. This film, however, is filled with plenty of each. There are moments which will having you rolling around on the floor with laughter and moments which are nothing short of romantic poetry. None of the lines feel forced, each one flowing naturally from each character. This gives the film a realistic feel which is also missing from the main selection of rom-coms available today. It feels as if the characters have been plucked from reality and put onscreen, not the other way around, making the experience of the film all that much more meaningful. \n\nBut it's the acting which is the film's real achievement, particularly from the two leads. Jospeh Gordon-Levitt is an absolute revelation here. He never over-dramatises the sadder scenes which would comprimise the feeling of reality, and he plays the humourous moments with the expertise of a seasoned professional. In fact, the entire film rests on his performance. If he had failed, so would the film. And in such a strange style as this, it would be easy for his performance to be lost in the melee of different days of Summer, but, to the writers and directors credit as much as his own, his performance is fantastically memorable and is one of the reasons that you'll come back for repeat viewings over and over again. His performance also achieves the difficult task of being likeable to both sexes, playing sorrowful and morose, but not to the point that he seems like a the girl in the story. Summer, the actual girl in the story, is played perfectly by Zooey Deschanel. Playing a woman who lives in the moment often means that characters have ridiculous and intrusive trademarks like eating dessert first at dinner. For NO REASON! Anyway, Zooey is fantastic, playing Summer with fantastic restraint and none of the over-the-top melodrama that usually accompanies such performances. She makes it difficult for the viewer to figure out whether she's the devil or just misunderstood, or whether it's Tom's fault that she keeps slipping away. \n\nBut the film is about two things really: the innovative style and Joseph Gordon-Levitt. These two aspects of the film work together brilliantly to create a melancholy piece with fantastic humour and bittersweet romance which can leave you perplexed, upset, happy and sad all at the same time. And yes, the ending may make you hurl, but if you can look past that, you've got a truly fantastic film which will stand and benefit from repeat viewings, which is really the only option after watching it once. \n\nDefining Scene: \nExpectations vs. Reality. Incredibly innovative and pure genius.",
            "review_date": "2015-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very different rom com",
            "review_date": "2015-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my favourite film and I'm not ashamed to admit it. If you haven't watched this yes, just do it",
            "review_date": "2015-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film makes me so angry. I hate Deschanel so much in this...",
            "review_date": "2015-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although I am not a fan of the \"Rom-com\" genre, (500) Days of Summer is created in a unique non-chronological style, strengthened by a memorable soundtrack, great acting, and quirky humor, making it truly an enjoyable film to watch.",
            "review_date": "2015-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You suspect where it is heading and you feel that everything inside you resists its direction because what if it tells you something about yourself? This movie is full of light, blue eyes, beautiful songs and other things that you want to spend your days among.",
            "review_date": "2015-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "JGL and Deschanel really come through for the script. 500 days provides laughs and is a quality, atypical rom-com.",
            "review_date": "2015-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Finest Drama dunked into an excellent slice of life!",
            "review_date": "2015-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fantastic movie with more honesty about relationships than most romantic movies.",
            "review_date": "2014-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The performances were weak behind a well-written script. Joseph-Gordon Levitt did a decent job if anything but Zooey Dechanel was a bad casting choice in my opinion. Whenever she acts I feel as if she takes the whole life and emotions out of the movie. Other then her this movie was alright. The music fit very well with the movie and scenery was also cool. 2 stars thanks to Zooey Dechanel",
            "review_date": "2014-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ingenious and uncanny, 500 Days of Summer is an unusual romantic comedy that despite having an indie feel to it, makes it a great watch thanks to strong, charismatic performances delivered by its' leads JGL and Zooey Deschanel and a refreshing, brilliant narrative.",
            "review_date": "2014-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Creative storytelling, an excellent soundtrack, and Deschanel's magic give 500 Days of Summer the indie credibility to take cheap shots at romance in an appropriately sincere but not overly dramatic way.",
            "review_date": "2014-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful 500 days of summer. I felt that story was kind of awkward but i loved the kindness and honesty of this movie.",
            "review_date": "2014-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A romance movie for anti-romantics, (500) Days of Summer is an inventive addition to the genre.",
            "review_date": "2014-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never following the traditional rom-com formula, \"Summer\" is a refreshing, funny and ultimately satisfying film with great performances from leads Levitt and Deschanel.",
            "review_date": "2014-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its unique way of storytelling with its well-arranged film editing. (500) quite gives you sensation throughout the movie of both warmth and grief.",
            "review_date": "2014-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good movie, so sweet, funny and not what I was expecting.",
            "review_date": "2014-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolute smart intelligent sophisticated masterpiece of filmmaking with phenomenal performances that deal with love fate heartbreak a phenomenal film which totally was not cliche note to Nicholas sparks this is \nHow you make a romance film \nGrade A+",
            "review_date": "2014-10-06",
            "source": "rt",
            "lang": "en"
        }
    ]
}