{
    "rating": 3.0,
    "release_date": "2009-05-22",
    "num_reviews": 110,
    "genres": [
        "Comedy"
    ],
    "summary": "Megan White (Shoshana Bush), a naive teen, and Thomas Uncles (Damon Wayans Jr.), a student from the wrong side of the tracks, find common ground in their love of dancing. Megan and Thomas join forces to perfect their moves and win the mother of all dance battles, though they face stiff competition Nora, the school's queen of the dance floor.",
    "reviews": [
        {
            "content": "Good movie itself but not that many laughs",
            "review_date": "2022-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The general consensus of this film is mind boggling. Maybe Wayans brothers were just way ahead of their time. \n\nThis films follows the plot of Save the Last Dance almost verbatim, parodying many other films of the time along the way, such as Step up, Twilight, Ray, and High School Musical.\n\nIf you haven't seen any of the films it's parodying, you'll likely just be confused. However, if you have, you'll be in stitches the entire film.",
            "review_date": "2022-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LOL, the funniest 01 hour: and 23 minutes ever!!!!!!!!!!!! The spoof movie I will never forget!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sometimes I love tastefully done black Movies, but in this case I laughed my head off because the stunts were incredibly dumb and so was the movie!",
            "review_date": "2021-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the best comedy since that 1978 classic, Animal House.  The Academy Awards will be flying when thus hits the theaters again.",
            "review_date": "2021-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "if you didn't watch it don't watch it you won't like it.",
            "review_date": "2020-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay watch at best, don't want to watch again, and I can't really recommend.\n\nFor the most part, they managed to focus on dance movie references, but there was a Catwoman and Twilight reference that were really odd.\n\nI spent a lot of the movie questioning if things were funny or how offensive they were and if it was okay. Kind off pulled me out of the movie.",
            "review_date": "2020-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Where has this been hiding? speaking of hiding, months of quarantine in usa, this was a good morning blessing! hilarious flick, so stupid, rude, offensive, hope to watch later tonight.        Deep into The Ozarks for dinner   4/30/20",
            "review_date": "2020-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i want to wathc the movie pplsssssss",
            "review_date": "2018-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible movie, but can still give a few laughs. The acting is lacking and so are the verbal jokes, they didn't put any effort on these,  the only jokes that work are the slapstick and nonsense ones... and the movie doesn't manage to make them work at all because only like 3 actors manage to make you laugh.",
            "review_date": "2015-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are some movies you just have to stop watching after 15 minutes because you know they won't get any better. This is one of those films.",
            "review_date": "2015-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a fan of the Wayans Brothers but not a fan of dance films, I didn't know what to really expect from Dance Flick.\n\nAlthough parody movies are often very stupid, since Dance Flick is a parody of a genre which is already ridiculously stupid, it has a lot of comedic potential, as well as the fact that it has major participation from the Wayans Brothers who are some of the funniest people to have happened to spoof humour in a long time. But despite their best efforts, Dance Flick eventually succumbs to its wounds and falls into the same bland and humourless territory that many other spoof films do these days.\nDance Flick has a very funny opening scene due to capitalising on the over the top nature of Wayans Brothers style of over the top humour which puts a lot of comic emphasis on African American stereotypes. But soon after the intro, it becomes a generic story about Megan White, a girl whose has lost her mother, moved in with her alcoholic father and started at an inner city school for performing arts while she tries to leave dance behind. Unfortunately, Megan White is not an interesting character and Shoshanna Bush is not that funny in the role. I mean her performance is ok because considering the stupidity of the material presented to her and she does have a certain charm to her, but she isn't funny. Her character is a whiny and repetitive one who isn't nearly as funny as Cindy Campbell from Scary Movie. Dance Flick puts way too much focus into her and not enough into the Wayans Brothers who are the best source of comedy in the film. So unfortunately, much of Dance Flick is wasted potential.\nThe general structure of Dance Flick is that it is a story about a girl trying to achieve her dreams while breaking away at random points to deal with subplots which feel like a series of comedic sketches. And for most of the time, the sketches are the funny parts while the main plot simply isn't. While Dance Flick could have spoofed dance battle movies, it keeps its focus a lot more on legitimate dance films instead. Of the two, dance battle films are a lot more ridiculous and as the film reveals in its opening scene, its form of parodying the genre is pretty hilarious at times. But soon after this gets reduced simply to a series of moments that detract from the actual intentions of the film. Dance Flick fails because it goes into territory which is inferior to what it could have been going into, and the jokes aren't funny because they only feature inconsistent appearances by the Wayans Brothers who are the only consistently funny element of the film and that is because of their over the top nature. Since they are absent from the spotlight in the film most of the time, Dance Flick ends up being an underwhelming film which just misses the mark and goes into dull and repetitive territory which has its gags getting stale pretty fast and failing to make the comedic impact that it really wants to. You can tell that with Dance Flick the five Wayans who have written the film had the best intentions and really tried, but a lot of the material just isnt funny and it is pretty bland when it could be hilarious. I mean the intro scene of the film was great because of its over the top nature and ridiculous parodying of dance battle films, but once it turns into the story about one girl's journey to prove herself and achieve her dreams, it just loses its edge. Dance Flick is better for its subplots than it is for its central plots, and it contains many unfunny female characters while featuring a lot of hilarious male African American characters. So despite having five writers collaborating, the communication occurring between them must not have been that strong. They were smart enough to ensure that the story was not reliant fully on pop culture references and that it was parodying genres as a whole and not just specific films. But it parodied the wrong dance genres and misused a hilarious cast by focusing on restrained humour instead of over the top jokes. A spoof film house to be out there and really excessive with how it lays down the thick headed and stupid humour, but Dance Flick is so cheap and so tame that it doesn't seem as if the filmmakers were really trying. \nDance Flick does not achieve the same heights as the better spoof films and although it is far from one of the worst, it had potential to be a lot better which is wasted on tame jokes. Although Dance Flick is directed by a Wayans and written by several Wayans family members, the humour does not adapt to their iconic style and tries too hard to appeal to a wider audience by not boxing the film in. Unfortunately, the tame humour and uninspiring dance story make it a lot more female oriented without even poking much fun at how the genre is very female focused. Despite appearances by Marlon Wayans who makes a brief but hilarious presence during his short period of time on screen, Shawn Wayans' series of small appearances which are essentially one laugh after another and the consistently funny lead performance of Damon Wayans Jr. in his first leading role in a comedy, Dance Flick is only sporadically funny at best and is more focused on storytelling than originality and over the top humour, so it simply is not enough to do.\n\nSo despite the efforts of the Wayans Brothers and a few really funny moments, Dance Flick is too tame for its own good and spoofs the wrong dance movies a bit too often so that its jokes to not reach the grasp needed to succeed as Wayans Brother quality humour in the best sense.",
            "review_date": "2014-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Damon Wayans Jr. stepping in for his older uncles and father in doing a spoof film of the various dance movies. Pretty silly and over the top, but that's what those movies were like too. A pretty good spoof of those movies, not quite at the levels of the first 2 Scary Movies, but I till liked it.",
            "review_date": "2014-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bit too silly at moments  (13)  OWN BLU",
            "review_date": "2014-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I laughed maybe four times and one of those laughs came from a Ray Charles impression.",
            "review_date": "2013-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know it sounds insane, but I have this incredibly vague feeling that I was supposed to find this film funny.",
            "review_date": "2013-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the funniest movie ever",
            "review_date": "2013-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"You have more chins than a Chinese phone book!\" :)",
            "review_date": "2013-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The parodies here feel worn and are not as forthcoming as other spoof comedies of this style.  As material is thin in the ground some of the film references date back to the early 80's.",
            "review_date": "2013-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Flick in the sense that it made me flick the channel over within seconds. Since 'Don't be a Menace' and 'Scary Movie', the Wayans brothers have been swiftly falling from the funny tree and I think 'Dance Flick' is a sign that they have hit the ground.",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So funny you have to see it",
            "review_date": "2013-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ridiculous ! Stupid ! Unfunny ! Completely idiotic and waste of time ! DO NOT watch this crap ! One of the Worst  comedy ( parody ) ever made !!!",
            "review_date": "2013-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "uhm .. where tf is the whole movie ?",
            "review_date": "2013-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the best spoof, but definitely not the worst. Every 15 mins there is a funny joke that will make you laugh.",
            "review_date": "2013-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An Okay Spoof Movie, Dance Flick Can Either Be Funny Or Really Unfunny.",
            "review_date": "2013-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stupid, But Can Be Funny In Some Parts.",
            "review_date": "2013-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like most spoof movies, it has it's moments of laughter, but ultimately falls short of sufficient laughs.",
            "review_date": "2013-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched about five minutes of this, and I had to quit. This parody genre has run it's course after the third scary movie, and this one is just resurrecting the dead corpse for about the hundredth time...",
            "review_date": "2013-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Did you know the dad from My Wife and Kids directed this shit",
            "review_date": "2013-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i thought this movie was funny but also kinda stupid.",
            "review_date": "2013-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film had it's definite moments of hilarity, but in all honesty this is definitely a film you'd have to be in the mood to watch, but non the less the parodies in this film make it worth watching.",
            "review_date": "2013-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just as bad as you'd think it would be. And then just a bit better.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1/2 a star because 0 isn't a viable option.",
            "review_date": "2013-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny lol. Not as good as White Chicks but watchable. Parody of Save the last dance and other movies.",
            "review_date": "2013-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a good parody movie but all parody movies dont have great ratings",
            "review_date": "2012-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A few funny laughs though a pretty disappointing film overall",
            "review_date": "2012-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I laughed at everything but then again I laugh at almost everything. I liked the jokes.",
            "review_date": "2012-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Desperately unfunny comedy that lurches clumsily from one tedious spoof scene to the next.",
            "review_date": "2012-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"THIS MOVIE IS GHETTOFABULOUS\"! I LOVED IT & SO WILL YOU ! YOU WILL LAUGH UNTIL YOU CRY LAUGHING !",
            "review_date": "2012-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a great movie.. but it was more of what they said not what they did. You really have to pay attention to catch the funny stuff.",
            "review_date": "2012-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie was more funny then i thought! its recommende that u dont watch it unless u seen most of the dance movies which i did.",
            "review_date": "2012-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny as hell in part and stupid too but the balance is just about right. great bad taste and toilet humour all the way!",
            "review_date": "2012-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Way to confusing to follow",
            "review_date": "2012-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the silliest movie I have ever seen, but I can't deny that some parts made me laugh so fucking loud",
            "review_date": "2012-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wanna say this was the best parody in a while but it wasn't",
            "review_date": "2012-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great,funny, cool too oh and crazy",
            "review_date": "2012-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dumb and unfunny. A waste of time, Dance Flick doesn't bring the laughs of Scary Movie first movies.",
            "review_date": "2012-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "some funny parts.. but not as good as the other \"movies\"",
            "review_date": "2012-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was really a disappointment, don't watch thinking you'll get a good laugh, cause that's all you'll get, a laugh.",
            "review_date": "2012-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It had it's funny moments. IT wasn't too good but then I didn't get the more recent news item references.",
            "review_date": "2012-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Dumbest Movie yet I walked out...\"do not see this movie\"!!",
            "review_date": "2012-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "IT TURNED OUT TO BE REALLY FUNNY, A LIL' ON THE GROSS SIDE! HAHA.",
            "review_date": "2012-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ms. Sindelar Liked This Movie And It Made Her Laugh, I Got This Movie On DVD For Ms. Sindelar To Watch From Netflix Once.",
            "review_date": "2012-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worth a watch for spoof comedy fans.",
            "review_date": "2012-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is just dumb...I don't really care for the spoof movies to be honest.",
            "review_date": "2012-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the eyes of a teenager, this film would be HILARIOUS! In the eyes of an adult, this movie would be a random, brainless flick! I am not an adult so I enjoyed this film! It was crude but it was definitely worth a watch!",
            "review_date": "2012-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wana see this so bad it looks so funny",
            "review_date": "2012-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You know what even for a spoof movie, this is insanely boring.",
            "review_date": "2012-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't understand how this can maintain anything above a 0%...",
            "review_date": "2012-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Typical sexual and stereotypical sillyness from the Wayans brothers.",
            "review_date": "2012-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "DANCE FLICK: the musical!! This movie was really funny! I'm glad the Wayans Bros. still got it!! Scary Movie 1 & 2 were the best and they finally took back their parody of movies!! I'm thinking sequel!! David Alan Grier had me rollin'!!",
            "review_date": "2012-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much funnier than I expected!",
            "review_date": "2012-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like the comedy genre but this movie flopped.",
            "review_date": "2012-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good spoof of save the last dance",
            "review_date": "2012-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn't finish it. Stupid.",
            "review_date": "2012-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another one of these.",
            "review_date": "2012-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hate the dance movies so this was hilarious",
            "review_date": "2012-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm sure when you see this you know what you are getting into, and probably already made up your mind if it's for you or not.  It has some really funny moments, but I'd say a good half of the jokes fall flat.",
            "review_date": "2012-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the funniest parody film in a while.",
            "review_date": "2012-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as I hoped it would be.",
            "review_date": "2012-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am by no means a Wayans Hater (I rather enjoy most of their films) but this was a sad...sad...sad attempt at comedy. Falling in place with all the other lackluster and downright tedious spoofs Dance Flick had a chuckle or two but most of the gross out humor and one liners were so reused that the house fly buzzing around the room was more entertaining than this disappointing Wayans brother attempt at comedy.",
            "review_date": "2012-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slightly humorous but yet another spoof movie that doesn't reach the heights of the spoofs of old (Airplane! or Scary Movie 1)",
            "review_date": "2012-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So bad it's almost good.",
            "review_date": "2012-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not bad for a Wayne's Bros film.",
            "review_date": "2012-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When it comes down to it, this movie was just plain corny and not funny.",
            "review_date": "2012-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was not nearly as bad as I thought it was going to be.  It helps since it was create by the Wayans rather than the team that did Date Movie and others like it.  That being said, it still was not very good, but I was not repulsed.  It helps if you start watching this film with very low expectations.",
            "review_date": "2012-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the greatest spoof film, but it does have some funny moments. I liked Little Man and White Chicks better than this film. I thought the problem with this film was that they spoofed too many movies. I did like the Fame music sequence spoof and the Hairspray spoof. I didn't really care for when they spoofed Save the Last Dance or even Step Up. I thought David Allan Grier's character was too over the top and didn't like his Dreamgirls spoof.",
            "review_date": "2012-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I found this really silly but great for a laugh at the same time. I am all in this silly type of comedy.",
            "review_date": "2012-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not nearly as inspired as the \"Scary Movie\" franchise.",
            "review_date": "2012-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just a bad movie.....worse than other comedy spoof movies.",
            "review_date": "2011-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was expecting comedy on the level of The Scary movies but this didn't even come close.I should have known better when I saw a guy using pissing on someone as a dance move!!!",
            "review_date": "2011-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "funny... but stupid!",
            "review_date": "2011-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably one of the stupider spoof films I have watched. While I may love the Wayans brothers, they should have stopped after Scary Movie. This was just idiotic and not funny in the slightest. Don't bother, seriously!",
            "review_date": "2011-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a good parody movie but all parody movies dont have great ratings",
            "review_date": "2011-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I miss the 80`s and partially 90`s when spoof movies were funny!",
            "review_date": "2011-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i'll bet the miracle of birth looks better than this poop of a million parodies. /:",
            "review_date": "2011-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie lol so many times",
            "review_date": "2011-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's like \"Scary Movie\", but with amazing dance moves...",
            "review_date": "2011-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'll admit these Wayans brother spoofs aren't the best movies out there. But they are decent spoofs. This movie lacked the funny aspect. It didn't really have any laugh-out-loud moments. It fell short even for these type of spoofs.",
            "review_date": "2011-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They pretty much got every dance movie and threw it to the ground. Enjoyable. And that's coming from a dancer.",
            "review_date": "2011-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was just dumb. Watched less then 15 min then turned it off.",
            "review_date": "2011-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its cute and funny movie. Although its disgusting I still like it.",
            "review_date": "2011-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": ": too lame, though there were only a few good laughs.",
            "review_date": "2011-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "JUST AWFUL just awful i laughed twice that's it.",
            "review_date": "2011-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny at times, there was a few laughs here and there. Not one of the best films that take the piss out of other films but wasn't all that bad. I would still reccommend it.",
            "review_date": "2011-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super bad, but they put heaps of flicks in it, so points for trying",
            "review_date": "2011-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As it didn't have the word \"movie\" in the title I thought I'd give it a go but it was just awful. My expectations were low and were met.    It started off OK (referring to the first 5 minutes) but it went downhill from there and proof that no one has a clue how to do spoofs anymore.  It did manage to spoof the genre to some extent but mostly fell in the trap of lazily picking characters from recent films and crow-barring them in hoping they'll be funny.",
            "review_date": "2011-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first good Wayans brothers flick since Scary Movie, this once still resorts too often to cheap stereotypes.  Still, the laughs are there.",
            "review_date": "2011-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ick. Awful. Pathetic",
            "review_date": "2011-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although incredibly stupid at times, there is just enough charm and creativeness to appreciate. The Wayans brothers always fascinate me and hardly ever disappoint.",
            "review_date": "2011-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty lame dance-movie parody film.  While it does have a few laugh-out-loud moments, it's mostly stupid comedy that misses much more than it hits.  It's a film where the best parts are in the previews.  While it makes fun of films such as Stomp The Yard, Step-Up and even Twilight, Dance Flick parodies some movies that aren't even relevant anymore like Save The Last Dance.  I was dissapointed since the Wayans were involved, I thought they could bring some life back to the \"parody movie franchise\" but it's really no better than the last few tries.  The cast is tolerable, Shoshana Bush is a cutie and Damon Wayans Jr. has some promise but all together, the cast is nothing stellar.  \r\n\r\nGets A-List Rating Of: Suck It!\r\n\r\nFor my full video review of Dance Flick, visit the following link: http://www.youtube.com/watch?v=AenBz6hLPHA",
            "review_date": "2011-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "clearly hands down the worst movie parody i have ever seen. very very stupid gags and i hardly laughed at all. this movie was not even funny. i guess if someone had seen some of these dance flicks the movie may have been funnier, but i doubt it. the best part of the movie is the gay pride celebration. i couldnt even figure out what they were thinking is some of the scenes, the costume was terrible and i was just confused and upset with how ridiculous it was. dont waste your time with this film.",
            "review_date": "2011-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With the visionary minds of Marlon and Damon Wayans.  I had the largest expecttations that it would fly.  But some birds had their wings clipped at a certain point of their life.\nThe movie starts out very funny, a typical dance-off as scene in more serious productions but the only thing that makes this movie different from the rest is that it's the first to parody dance films but instead almost makes fun of it's self in a very desperate attempt to catch a laugh.  The movie mainly follows a girl, Megan White (i won't give her real name, perhaps she'll be forgotten starring in this role and therefore have a better chance in the long run in a more decent film) and Tom Uncles, a more professional street dancer whom trains Megan how to be better, faster, and more flexible with her moves (kinda like Save the Last Dance).  The movie takes an unexpected turn and even though my favorite parody directors (The Wayans) are behind this so call movie, The guys whom struck gold with ScaryMovie 1 and 2, it seems they've struck a grave of dead cats with Dance Flick.  The movie turns into a more cheap stereo typical spoof comedy with amazingly unfunny humor and jokes about project life that has never been in good taste nor cleaver spouted out in the most ridiculous manors.  And to top it off; if you didn't laugh at the bad joke the first time, you better get used to it because the film will definitely run it over and over and over again.  It's almost as if the Wayans got lazy and took some writing tips from \"Meet The Spartans\" and \"Disaster Movie\". What age group finds this abomination of humor funny?  I don't think there is one.  Not to mention the random scenes of guest star character's popping into the show for 6 sec. and then leaving whom have nothing to do with the movie nor add any intelligent humor, nor actually bash any characters from what it is they're trying to parody.  This is the first movie I saw in theaters that half way through, I wanted to leave.",
            "review_date": "2011-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film contains enough yuk-worthy gags for it to be enjoyed in partial viewings.",
            "review_date": "2011-03-12",
            "source": "rt",
            "lang": "en"
        }
    ]
}