{
    "rating": 9.2,
    "release_date": "2009-05-29",
    "num_reviews": 210,
    "genres": [
        "Drama"
    ],
    "summary": "Soon after buying an expensive cello, Daigo Kobayashi (Masahiro Motoki) learns that his orchestra is disbanding. Daigo and his wife move back to his hometown in northern Japan, where he answers an ad for what he thinks is a travel agency but is, in actuality, a mortuary. As he learns and carries out the rituals used in preparing the dead for their final rest, Daigo finds his true calling in life.",
    "reviews": [
        {
            "content": "In returning back where he came from, Daigo Kabayashi is as lost as Professor David Lurie from J. M. Coetzee's novel, Disgrace (1999). One might argue that the Professor is responsible for his own disgraceful homecoming, but such a person would have to be reminded of fate's brutality, that what the leg that will be broken will be broken. There is no more escape for the professor than there is for Daigo, a cellist who has to go back home when his orchestra is disbanded, even before he has paid off the expensive cello he just got. The thing that connects these two so strongly is the new \"vocations\" each one finds in his own wasted dreams: the professor has his sick dogs, and we're not so sure he cares that much about his work on Byron. Daigo finds his dead, and the cello is now just a hobby. And perhaps because he doesn't care about an audience anymore, he becomes an artist by departing from that stiff professionalism that had driven him to buty the expensive cello in the first place. In a way, his new \"art\" is the key to that childish fascination that is the mark of the true artist, and with the audience gone so goes the cares and so enters the true artist. Yet in this great transfomation, or metamorphosis, is weaved the metamorphoses of others, so that the movie is more than a portrait. It is a symphonic masterpiece, and Daigo is happy if happiness exist, even though the path to that happiness has wiped the smile perhaps entirely from his face.\nAt the end, I thought I saw in his cheeckbones the cheekbones of Kafka, but that might be an optical illusion. They do look alike if you ask me.",
            "review_date": "2023-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A cellist living in Tokyo, Daigo (Masahiro Motoki) is forced to return to his hometown when funding is pulled from his orchestra. Unbeknownst to his wife, he accepts a position that involves preparing the deceased for their final departure, leading him to reevaluate his life and, perhaps more importantly, his relationships with those around him.  Departures is a languid, meditative film, meticulously directed and beautifully shot – every shot is perfectly framed and expertly blocked.  The characters all resonate in some way, regardless of their views on Daigo's profession or their own responses to death.  It is a moving and impactful film that, despite the subject matter, is never overly sentimental or maudlin.",
            "review_date": "2022-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful film with incredibly good and beautiful feelings that make your heart move, so beautiful and extremely well acted. Great cinema.",
            "review_date": "2022-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies, beautiful and real.",
            "review_date": "2022-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Departures loses its sense of humor about halfway through and turns a little sappy.  However, I liked the movie very much and recommend it.",
            "review_date": "2022-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a wonderful movie about death. The only fly in the ointment is that it never tells why Daigo's father left him and his mother. It would be great if the movie had focused a little bit more about this. I really love Shokichi's line \"I'm good at burning things.\" when he prepare to cremate Tsuyako.",
            "review_date": "2021-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very artistic film that show us the importance of change and the balance between life and dead",
            "review_date": "2021-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "lol it's quirky & kind of funny. i'm not sure i would recommend it to anyone, but i did enjoy watching it.",
            "review_date": "2021-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "About 30 years ago, I learned of the taboo nature of the subject of disposing of the dead in Japan from Masato, my favorite sushi chef. I finally got him to rent director Juzo Itami's \"Tampopo,\" which remains one of my favorite films of all time, and I assumed that he would also love it (especially since he was involved in the food industry himself). Instead, while he said that he thought it was very funny, he'd found Itami's \"The Funeral\" (which I had also seen and enjoyed, though not nearly as much) to be much funnier because to even talk about things like the details of a funeral, e.g., the costs of the different casket options, let alone joke about them, was just something that you didn't do in Japan. I later learned that even to this day, if you are a male from some areas of Tokyo or have one of certain surnames, and start to date a woman, her parents may hire a private investigator to see if your family was in the business, which would disqualify you as son-in-law material.\n\nI think that you should understand this to truly appreciate what the main character is going through when he takes the job that he stumbles into, and why he can't tell his wife or anyone else that he has. Yet he manages to overcome his internal conflict and see the beauty in the comfort that he helps to bring to the bereaved.",
            "review_date": "2021-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A cellist becomes an encoffiner when the orchestra disbands. And the consequences of taking this new job, the protagonist keeps facing different things which changes his view on life, forgiveness, acceptance and death. Yōjirō Takita keeps his audience serene throughout the movie. A must-watch.",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily grasped but requires a firm chomp, careful you don't bite on your tongue cause it softly hits hard.",
            "review_date": "2020-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By far best Japanese movie of all times. One of the few not fighting, but very sensitive japanese movies, brilliant!!",
            "review_date": "2020-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a Film about a coffin man - One who prepares a body in front of the family of the deceased. It is Not Morbid and touches on Shēngsǐ (life and death) a word we don't have in English. Budism based.\nIt dives into the people involved with death as unclean in Japanese old fashioned culture and ties this to food. Extremely well thought out and well done film.\nAfter this fim you will lose your fear of our concept of a Western death, so not only is it highly inspirational but can help you think about such matters more positively. It is the best International Film for myself on a very unusual topic. Great director and based on the Japanese book Coffin man.",
            "review_date": "2020-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie blew me away. The director was able to represent such strong and deep emotions in a poetic form. Love it!",
            "review_date": "2020-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful film, full of emotion and capturing the drama of everyday life and death. \nQuite and intense highlighting the importance of ritual in saying final goodbye's and final recognition of the part a person has played in life.",
            "review_date": "2020-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Departures (Japanese, \"one who sends off\") is a 2008 Japanese drama film directed by Yōjirō Takita 🍿 \n\nIt's ok, but I feel mixed about this one 😉\nI'd recommend it if you like this genre, but if not then probably give it a miss 👍🏼👎🏼",
            "review_date": "2020-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A substantially overrated Oscar winner.  It does have some remarkable scenes.  The Japanese do death and ritual very well.  But character development is weak, as is the story.  It really needed some fleshing out.  But there are moments to savor.  The acting by the younger actors is weak, and the wife's is some sort of anime characterization.  A good idea, which could have been great with better development.",
            "review_date": "2020-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is about as poignant as it gets. Skip the dictionary. Watch this film for a definition of the word.",
            "review_date": "2019-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Departures has a terrific, intriguing first act with an interesting subject matter, good humor and fine storytelling. But afterwards, the movie became clichéd, highly emotionally manipulative and it frustratingly refused to tackle its many themes in any more sophisticated manner. It's very well made and interesting, but ultimately overly simplistic for what should have been a very complex film.",
            "review_date": "2019-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Firstly I wonder how a film with such a deep topic can be so flat and toneless. Secondly I ask myself in which universe Japan enters this movie for the Academy Award, being the same year of the amazing \"Still Walking\". And thirdly the most amazing thing: I really need to know how is possible that won the Oscar! I am very puzzled.  ",
            "review_date": "2019-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you don't like this movie you simply don't have a heart and deserve to have your body chucked into the ground like a piece of garbage unlike how the film portrays death.",
            "review_date": "2019-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Undertaking is an important occupation in Japan, I gather, but not a respectable one. A film of lyrical beauty that manages to both move and amuse, all while  reforming an undeserved social taboo.",
            "review_date": "2018-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Moving, engaging, thought-provoking movie.  \n\nWhen his orchestra is dissolved, cellist Daigo Kobayashi is left unemployed.  He and his wife move back to his home town where he answers a job ad, working with 'Departures'.  He gets and takes the job, thinking it's a travel agency, but it turns out it involves preparing people for cremation or burial.  Is he cut out for this and what will his wife and friends think?\n\nGreat movie.  Engaging story, as we follow Daigo and how his unexpected, and largely unwanted, role changes his life.  Quite emotional as we see the effect his work has on people, how people respond to knowing this is the last they'll see of a loved one and how death can leave to recriminations and falling outs among family and friends.\n\nThought-provoking, as we are left to ponder our own lives and how we handle death.\n\nWon the Best Foreign Film Oscar in 2009.",
            "review_date": "2018-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful-yet-simple tale, Yojiro Takita's film is a humble delight in which the adversity of death is explored in a rather engaging way, apart from its enjoyable cast and thought-provoking script, the movie benefits, as well, from a beautiful direction, a captivating soundtrack and, of course, a deep analysis regarding the value of life, the appreciation of it, and the profound heartbreaking conception of loss and death.",
            "review_date": "2017-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An extremely beautiful, tightly-woven story Okuribito is. It is such a brilliant tribute to death.",
            "review_date": "2016-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, sensitive, emotional. It made me wonder if this type of departure is avail able in the UK. A film I will watch again.",
            "review_date": "2016-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Made tears roll down my face multiple times. That is unheard of!\n\nA bit predictable and the \"movie\" ending ties it all in a nice little bow.",
            "review_date": "2016-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A not-bad-but-not-great melodrama. Some really great scenes, but many of the characters lack depth (especially the women) and the whole thing is just a bit over-done, and half an hour too long.",
            "review_date": "2016-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well written movie, which touches many themes most importantly dealing with death and watching others grief upon it. One side of it is very soft and touches our heart but on the other hand it is not as astonishing as we expect it to be. Story and even scenes are very predictable. Ending also could be seen from minutes away from it. Director has worked hard on the interior of Coffining but failed to bring deeper sentiments onto screen. Tsutomu Yamazaki's portrayal of a Boss who teaches the protagonist is the most fabulous quality of the movie. Actor actually work the role around and inside. Masahiro Motoki and Ry?ko Hirosue are very convincing although camera sometime focused on Ry?ko more then it needed. Her character as a devoted wife is well however it is not explored much. Ritual of coffining are filmed very good. The sub plot of protagonist's relation with his father was good but there could have been more about it. Over all a light hearted sentimental film.",
            "review_date": "2015-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was amazing!!  The acting, visual, music... it was funny & sad... and taught about the Japanese culture...A REAL GEM!!",
            "review_date": "2015-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "heart-warming movie about relationship in life, one of the best Japanese movie!",
            "review_date": "2015-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful...stunningly emotionally beautiful",
            "review_date": "2015-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sure it's kind of predictable, but it's a unique story and generally appealing to everyone. I'd say worthy of the Oscar!",
            "review_date": "2015-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Regardless of its slow moving plot and length, Departures is a somber and emotional drama that is a uniquely satisfying viewing experience.",
            "review_date": "2015-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful! I will never forget this film.",
            "review_date": "2015-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful & peaceful film .. an interesting perspective on Japanese rituals for the departed ..",
            "review_date": "2015-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie of Japan",
            "review_date": "2015-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excellent movie, which definitely deserved its Oscar award for Best Foreign Film. Set in Japan, Departures is a beautiful reflection on life, death, family, and finding your calling. The main character changes careers and becomes an undertaker. In this role, he is exposed to families who have lost a loved one, and he comes to learn much about himself in the process. A viewer who has little/no knowledge about Japanese culture will learn a good bit about the Japanese undertaking rituals. (I assume the movie depicted these accurately--it was all new to me!) Scattered between very poignant and moving moments are a few witty events, which may actually make you laugh out loud. Masahiro Motoki did an excellent job as the lead, and I'd love to see him in more dramas. This is a \"must\" for foreign film buffs.",
            "review_date": "2014-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once you realize what the film is about, you're taken by total surprise as to its beauty and humanity.",
            "review_date": "2014-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I did not like this film but I liked the idea of the film. I enjoyed learning about the Japanese tradition of a coffin ceremony to ready the corpse for burial. I do not have experience with the Japanese culture or language so I found the exposure  enlightening and broadened my horizons. The actual ceremony is very unique and a pleasure to watch. The movie plot is very weak and the movie moves along slowly.",
            "review_date": "2014-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit naive and not as smart as it should be, yet it's a sweet little film.",
            "review_date": "2014-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just love this film. Many times I do feel uneasy with Japanese style (too sentimental at times, too violent at other times, too obscure in terms of expression, sometimes too slow...). But this film has a PERFECT balance. It just makes me laugh and cry at the right time, as very few films do. Let alone the music, a wonderful soundtrack.",
            "review_date": "2014-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sublime and honest from start to finish, Departures is an unbelievably beautiful look at life at a time of death, love at a time of grief, and the strange cycles that life brings to us humans",
            "review_date": "2014-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant, touching and sentimental film unlike anything you have ever seen before!",
            "review_date": "2014-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While not really into sub-titled movies, I thought I would give this a try.  Was totally enthralled after five minutes!  Even taped Downton Abbey so I didn't have to pause the movie!  Excellent treat ... Not just because the acting was superb, but because of the insight into the subject matter!  Truly entertaining.",
            "review_date": "2014-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful film about undertaking and reconciliation.",
            "review_date": "2014-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When an orchestral cellist loses his job (because the orchestra folds), he accidentally finds another as one who prepares the dead for cremation. His potential artistry is apparent to his new employer who apprentices him. Unfortunately, this line of work is seen as \"dirty\" and disgusting - that is, until his artistry is seen.  Respect, honor, and compassion are key ingredients.  Wonderful cello music rounds out this subtitled film.",
            "review_date": "2014-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's great that Takita could take a typical sob story but really turn it into something artistically and emotionally genius.",
            "review_date": "2014-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent.  Beautiful.  Have a box of tissues ready...",
            "review_date": "2013-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Very heartbreaking and emotional. The characters don't develop too well though. But, I loved the movie.",
            "review_date": "2013-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this. Was difficult at first to know if I did or not as it starts out a little strange, not quite comedy, not quite odd ball movie, but irons out to a very poignant story posing  complex considerations on loyalty, honour & of coarse, mortality. Very much a 'Bushido' type film if ever there was one out of the Samurai genre. Could watch it again to capture its subtleties.",
            "review_date": "2013-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Departures is a beautiful film about a subject I thought I would have no interest in. In fact, had I read the synopsis before I saw it, I might have skipped it altogether, but I'm surely glad I took the time.",
            "review_date": "2013-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful, sensitive and symbolic movie that explores life through death.",
            "review_date": "2013-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful film, it is one of my favorite movies. It has a grim attitude at times but can be light and overall remarkable.",
            "review_date": "2013-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie! \"A moving celebration of life through showing reverence for death.\"",
            "review_date": "2013-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great Japanese film about various departures of different sorts. It quirky and funny yet has some very emotional moments. The only film I can remember which bought a lump to my throat.",
            "review_date": "2013-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Giving this film a second look, I now believe it was better than what I had initially thought of it.",
            "review_date": "2013-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are many award-winning films out there that I have never seen; not because I don't want to see them, more because I'm not aware of them. This is a case in point; the winner of the 2009 Oscar for best picture in a foreign language, amongst many other awards; it wasn't even released here in the UK until December '09 and even then it had little (or no) publicity behind it. Needless to say, it wasn't until I happened upon it in the TV listings that I became aware of this film. I have to say I was impressed! It had more emotional depth than many western films on a similar subject. Here's a very brief summary before I go deeper into it.\n\nWhen cellist Daigo Kobayashi (Masahiro Motoki) loses his job, he returns to the town where he grew up. Taking his wife, Mika (Ryôko Hirosue), with him, they go and stay in his mothers' old house. She had passed away two years previous and had left the house to Daigo. Looking for a job, he sees an advert that looks a little cryptic; something to do with 'Departures'; but still, he rings up and gets an interview. He is employed almost immediately without knowing an awful a lot about what his new career will entail. His new boss, Ikuei Sasaki (Tsutomu Yamazaki), is quite enigmatic but soon all becomes clear. The job is to perform a ceremony for the dead; cleaning and dressing the body, applying make-up and placing them in the coffin. All this is done with great reverence with the departed's friends and family looking on. Daigo soon learns though that this kind of work is frowned upon, but by then he has come to love what he does. How will his wife react and what will he find out about his family now he has returned home?\n\nBeautifully shot with some great exteriors; the landscape take quite a big part in this film. There were some lovely comic moments as well as some quite distressing scenes as the families go through all kinds of emotions as the say goodbye to their loved ones. I'll admit to having found it quite touching at times and even shed a tear or two for my dear departed mum. Of course music plays quite a big part in the film and there are some really touching scenes as Daigo plays his cello out in the fields. I did find, however, that the final act didn't quite have the emotional punch I had expected. Yes, the emotions were there, but it didn't quite hit home the way I anticipated. Even so, it's a film I really enjoyed and one I would happily watch again someday.\n\nSteelMonster's verdict: RECOMMENDED\n\nMy score: 8.2/10\n\nThere are extra bits & pieces (photos, links, trailer and BIGGER PRINT) on my blog at:\nhttp://thoughtsofasteelmonster.blogspot.co.uk/2013/07/film-review-departures-2008.html\n\nEnjoy!... :)",
            "review_date": "2013-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie about the Japanese encoffining ceremony (to clean and prepare the dead body then put it in the coffin while all family members watch it). It's never somebody's dream job, but the main character had to give up his musician career playing cello in Tokyo orchestra after it is disbanded. Interesting subject and captivating from the beginning. As you watch people dealing with death and taboo, you learn about life. Very touching and well acted. It is not all a melancholy film, however - there are many funny moments mixed in, to prevent an overly melodramatic feeling. The only negative -if I have to dig- is; it is a little bit predictable at the end. But for me the movie is more about how we feel when we watch it and not too much about how it is done. Very recommended.",
            "review_date": "2013-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Peaceful and quiet. It's a special occupation that we don't really know. But this is really touching.",
            "review_date": "2013-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Oscar winner for Best Foreign Language Film is, as expected, an accessible, yet heartwarming drama about music and death as the inert main characters: death as a gateway to the eternal, music as the machinery to heal the wounds of the heart. Conquered by a great cinematography (which is extremely common in Japanese feature films), the story acquires effectiveness in a gradual way, which allows us to get over the unnecessary melodramatic elements and the uncalled uncomfortable \"comedic\" moments, such as Daigo playing the cello with a rotating camera around beautiful landscapes or the initial \"humor\" that was suddenly killed afterwards. Props to Ryoko Hirosue for portraying the wife that any man would want; her smiley, tender and cute personality remarkably resembles that of my girlfriend, with the exception that she would have accepted any job I had taken since the beginning.\n\n76/100",
            "review_date": "2013-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "interesting story! great japanese movie! no doubt it won a lot of awards! Bravo Takita-san :)",
            "review_date": "2013-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Departures\" weaves a deep, beautiful poem about life and death in an agonizingly parsimonious way but loaded with sudden emotions.",
            "review_date": "2013-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't know what to expect when I came across Departures. I knew that it was generally enjoyed by critics and moviegoers and I even added it to the list of films I wanted to see. I expected to enjoy it, but not only did it deliver enjoyment, it blew me out of the fucking water. Departures is a beautiful film about both life and death, and despite having some rather depressing subject matter, it finds time to focus on the happy and funny times in life. I could just end by saying that I think everything about this film is perfection, but the best way I could truly describe Departures is that everything feels alive - even some of the smaller, more inconsequential scenes felt like they had meaning and gave each of the characters a life of their own. The film is darkly humorous, beautifully written, heartfelt, superbly acted, and never once boring despite being more than two hours long. I cannot recall being bored once while I watched this because it was so engaging and mesmerizing to me. For me, Departures is one of the best dramas and best films I've ever seen. There's no question about it, if you love a good film, you must see this one because it is a damn fine film that deserves more attention.",
            "review_date": "2013-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overwhelmingly tender.",
            "review_date": "2013-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's both sentimental and funny. It deserves its Oscar win for the best foreign film.",
            "review_date": "2013-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was really interesting to how reverent passing can be. In the western world we don't want witness the undertaking process before the funeral service. It was very sentimental and moving. I felt like it provoked a lot of emotions and thought, however, I feel it lacked a certain depth to really drive the emotion home. It was very slow yet captivating.",
            "review_date": "2013-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This will probably be the first time you realize how much beauty there is in death. Outstanding writing. Must see.",
            "review_date": "2013-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Okuribito\" surprised me with how emotionally powerful and philosophically profound it managed to be.  It doesn't start out this way, choosing rather to gradually transform from an awkward, culturally-esoteric affair to a reverant study of death and dying that reaches across geographical abberations.  To fully appreciate it takes patience, but the rewards are numerous and long-lasting.  It's much, much more than the light-hearted comedy/drama some critics are waving it away as being;  it is in fact a modern masterpiece of the highest caliber.",
            "review_date": "2013-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just finished watching this. Will be thinking about this for some time...",
            "review_date": "2013-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very moving insight into Japan's culture and the rules of it's society. It's very slow paced though, so either commit to it or you'll be drifting away after the first hour.",
            "review_date": "2013-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outstanding - I laughed, I cried, and I thoroughly enjoyed it from beginning to end! Now I see why it won an Oscar - it deserved it!",
            "review_date": "2013-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nelson Ercia Abesamis, get hold of this film.",
            "review_date": "2013-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A musician/cultural sophisticate wannabe is shocked when hired to regularly participate in the traditional though frowned upon Japanese preparation for departure ceremony but slowly comes to find humanity in the highly orchestrated rituals of the process.  A well done work and very engaging, altho often as obvious as all hell.  I personally found the old timer's (Yamazaki) version of the process more poetic.",
            "review_date": "2013-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Country: Japan\r\n--------------\r\nTrully speaking, I felt bizarre after watching DEPARTURES (OKURIBITO), not because I didn't like it while winning the almost most credible award; the Academy award, but because I really liked it.\r\n\r\nFor me, the movie to some extent is mediocre; mediocre actors especially Ryôko Hirosue (the wife) and a predictable plot. Yes it's simple, yet predictable in many places.\r\n\r\nThis contradictory feeling may come out of its witty execution dealling with an intense issue (death and propably life) that could have been handelled through an overly dramatic way, but what really fascinating is being crafted in such light heartedly way.\r\n\r\nThe first part has its reasonable share of humor but not slapstick comedy, then it deepens gradually to have its moving and emotional scenes supported by such a great sentimental score. Cinematography is also great and has its impact on dilevering the scenes.\r\n\r\nWhat seems to be great fun is discovering more about the Japanese culture and traditions in a more rural but honest way, rather than the usual image of modern Japan, the matter that is reflected even in using a classical orchestral score.\r\n\r\nAt last, a resonant line saying \"What I believed to be my dream, was propably not my real dream\" makes one think and may it be a turning point in someone's life as it was for Daigo.",
            "review_date": "2013-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, beautiful and moving",
            "review_date": "2013-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i hate the wife in this movie... the actress.  that prevented me from liking it.",
            "review_date": "2013-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The focus of this Japanese film is on the profession of encoffiners, people who prepare bodies for burial. The subject of death, unemployment, dark secrets and relationships is balanced with humor.",
            "review_date": "2013-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A prizewinner. It's witty and weepy at the same time/will make you laugh and cry multiple times. And you'll gain respect for those who work for the dead.",
            "review_date": "2012-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Departures takes the viewer on a powerful trip to explore Japanese culture and its rituals surrounding death. Telling the story of a young cellist, who starts to work as an undertaker after his orchestra gets disbanded, turns out to be one of the more strong and involving drama film in recent times. \n\nHaving watched the film without any preconceptions, Departures turned out to be one of the better drama films in a very long time that gives insight on a universally interesting topic, Death, and how Japanese culture deals with it. Rarely in these days films are involving enough to make a true emotion impact on viewer, so I was positively surprised to see Departures being an exception. On multiple occasion the film sparks powerful feelings - I have to admit shedding a few tears while watching Departures - and at the same time makes the viewer process and think about death from their own subjective point of view. \n\nStory wise the film focuses on Daigo Kobayashi (Masahiro Motoki), a gifted cellist who never quite made it in the musical scene and how he ends up working as an undertaker. Daigo has to face many hardships due to his new career choice, but ultimately discovers that being an undertaker is what he was meant to do.\n\nOn top of engaging story, Departures is wonderfully acted by all actors involved, with Masahiro Motoki deserving a special remark for his great lead performance. Motoki depicts his character Daigo in very controlled Japanese manner, all the while being very lifelike opposed to the generic iron masked actors found in most Asian films. It must be said that the film is extremely slow paced which might turn away some viewers, but I found the whole subject and Japanese approach towards death absolutely fascinating.",
            "review_date": "2012-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A struggling orchestra cellist suddenly finds himself without a job and takes his wife back to his home town to start anew. Somewhere along the way he begins his strange new career as a specialist who prepares recently deceased bodies for their funeral. He is reluctant at first and ashamed as he keeps it secret from all those who are close to him. Soon though he finds a sense of fulfillment out of it and feels proud to be such a person of service who can give something as cherished as a beautiful piece of closure to all those who are grieving. And despite everybody who presumptively disapproves of his profession, he keeps on doing what he does in helping others in a time of need and even finding a piece of salvation in it all for himself. . . Darkly humorous at times (it opens up with him unknowingly working on a transsexual) and tip-toeing around some very genuine dramatic themes, \"Departures\" really tackles the full spectrum of life and one's own mortality. It has the element of what made me such a fan of the show \"Six Feet Under\" in how it used death and dying to showcase what living is really all about. There are moments where the story-telling comes across as plain easy, but more often than not it gets masked by the overall sincerity of the film as well as its players. Definitely no surprise why this one took the prize for Japan's best film as well Oscar gold for the Foreign Film category.",
            "review_date": "2012-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One reviewer called this \"bland sentimentality\".  This movie was anything but bland. While it came close to overstaying its welcome it ended on time. It is a beautiful film that celebrates death as part of life and how the dead deserve to be treated with love and kindness just as the living do.",
            "review_date": "2012-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film tells the heartfelt story of the japanese casketing ceremony. While  \"Departures\" offers much in witty humor, you will ultimately be overtaken with facination of a ceremony for the dead being made to be so beautiful.",
            "review_date": "2012-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "rare plot, well-delivered reminder for us about death",
            "review_date": "2012-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yojiro Takita's drama about an out-of-work cellist (Masahiro Motoki) who finds a new job â\" and calling â\" in preparing the dead for burial is an unusual pleasure and revelation. The movie really make you think about life, death and afterlife",
            "review_date": "2012-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie: 10/10\nCharacters: 9/10\nEmotiveness: 10/10",
            "review_date": "2012-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Academy Award winner for best foreign film, Departures is simply one of the most impressive, most poetic and emotional touching the last years. It's the story about the young cellist, Diago who's borrowed to much money for his cello that he has no other choice than to sell it. He have an extreme erge of going back to his hometown, his mother died two years ago and left the coffee shop she used to run.",
            "review_date": "2012-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining, funny, and touching. The lead is a very good actor, maybe the best Japanese actor around.",
            "review_date": "2012-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An heart warming movie, touch deep into our heart",
            "review_date": "2012-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "love every bit of it, make you think about afterlife and what you have done in this world",
            "review_date": "2012-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "................................................................................................................ A very touching and tearful perfect movie about life and death and family. A must-see.",
            "review_date": "2012-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A romantic and quietly intriguing film about Japan's relationship with its dead. Still and reverent, it drifts carefully away from moments of broad comedy as we - and the story's new encoffineer - learn more about the complex and delicate rituals that celebrate the end of a life and all that came before. Pensive and thought-provoking, and to us, startlingly alien.",
            "review_date": "2012-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie, this is one of my favorite movie. I cried so much watching this movie, very moving.",
            "review_date": "2012-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't even know that this movie won the Oscar for the best foreign movie in 2008.   I enjoyed it very much....",
            "review_date": "2012-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very moving as it approaches finish.",
            "review_date": "2012-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are few films that delve into the Japanese art of beautifying the dead. Nonetheless, Y?jir? Takita's 2008 film \"Departures (Okuribito)\", which took home the best Foreign Language prize at the 2009 Academy Awards, does exactly that.\r\n\r\nThe film is loosely adapted from Aoki' Simmon's 2002 autobiography, \"Coffinman: the Journal of a Buddhist Mortician\". Hero Diago (played by former boyband heartthrob Masahiro Motoki) is a down-on-his- luck Tokyo cellist who loses his job when his orchestra disbands.\r\n\r\nHe returns to his remote home-town with his meek, adoring wife Mika (Riyoki Hurosue) and takes residence in his late mother's house in an effort to reinvent himself. He discovers a newspaper advertisement for what he thinks is a travel agency helping out with \"departures\", only to learn that the position is for a firm that specialises in departures of a very different kind. A departure from which no traveler returns: death. This fosters his initiation into the subtle art of \"encoffinment\". The story that follows is a moving portrait of living with death as our protagonist must overcome his revulsion at his new line of work, while confronting some personal demons.\r\n\r\nThe ensemble is appropriately dramatic. Particularly notable is the leading man as well as his mentor Mr. Sasaki (Tsutomu Yamazaki) who hires him and Yuriko Uemura (Kimiko Yo), a fellow employee at the funeral agency.\r\n\r\n\"Departures\" follows in the path of other distinguished Japanese cinema such as Kurosawa's \"Ikiru\" and Juzo's \"The Funeral\". But while \"Ikuru\" and \"The Funeral\", focus more on the repercussions of death, \"Departures\" centres on the ceremony, the rituals of encoffinment and the passing into the afterlife. The film looks at abandonment, both in life and death as a cruel certainty. The film's greatest asset is its shimmering and poignant cinematography. A wind-tossed cherry blossom tree in such a film is inevitable, coming to life in spring to remind the Japanese that life is renewed after winter, only to die quickly after. In appreciating that transience, the Japanese seek to define themselves.\r\n\r\nBy framing the harshness of death with the gentle treatment of the dead at the hands of Diago, the audience sees how the caring preparation of the body allows it to be softly ushered towards the final stop. This juxtaposition simultaneously confronts the taboo role of a figure who continually faces death, but creates an art form; one which is imbued with kindness and beauty.\r\n\r\nAided by the use of classical music that decorates the soundtrack, Takita juxtaposes the sacred and the profane in a soft, pretty film lined with enough perversity to arrest the viewer. The film's alignment of the sublime and ridiculous is sparing, but enriches the tale.\r\n\r\nIn 2009, this film beat out the critically acclaimed, \"Waltz with Bashir\" and \"The Class\", to win the Best Foreign Film prize at the Oscars. Beneath its pretty, emotional façade lie many layers that touch on the grizzly yet entirely normal nature of mortality. It's all there if you scratch beneath the surface.",
            "review_date": "2012-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Taking a while to find its tone, with - I think - a not always successful use of bathos, this becomes a powerful, moving and original tone with some very satisfying insights into death, reputation, marriage, loyalty, loss and reconciliation.",
            "review_date": "2012-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a look at a different side of Japanese culture\nin my opinion the movie is slow and moving and it's about... like the secretary says super-niche line of work",
            "review_date": "2012-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this movie. Saw it at least 4 times. Loved the music score.",
            "review_date": "2012-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful look into a peculiar profession.",
            "review_date": "2012-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It expose you into the world of japanese culture respecting the decease.",
            "review_date": "2012-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intensely moving and unexpectedly funny. Death as a subject matter may be extremely confronting and devastating, but, as the film demonstrates, if approached correctly, is capable of profound warmth and tenderness, losing its forbidding aspect. Okuribito may be emotionally manipulative, but if you fail to be moved, you're a real hard bastard indeed.",
            "review_date": "2012-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An extremely satisfying combination of values, music, and humor! Joe Hisaishi made a great classical soundtrack and the acting in this movie was surprisingly good and notable! I enjoyed this movie and it's better than some of that garbage that's being made in Hollywood lately!",
            "review_date": "2012-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such an unusual movie...very memorable.",
            "review_date": "2012-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daigo Kobayashi is very attatched to being a cellist in an ocherstra, which unfortunately has recently been dissolved. He now finds himself living unemployed, and looking for a job. He moves back into his old hometown with his loving wife to start a new life, with a new job. But little does he know that his life is about to take him on a strange yet beautiful journey working as a funeral professional who prepares lifeless bodies for both burial and entrance to the next life.\n\nAs dark as the plot might sound to be, this is actually a very touching film. It makes sure to bring joy into its main theme, \"death.\" To bring great feelings into such a serious subject is hard to do, but this film sure does a great job on it. There are however, some gloomy moments in Departures but only when necessary. It seems as if this film knows a lot about human nature, and nature itself which makes it seem very realistic. From humor, to sadden, to hopes and dreams, to death, and so much more, these feelings are all balanced in such a great order that makes its viewing experience come alive. Departures really is a beautiful movie about life itself. Just life. Not religion and other's beliefs (even sometimes seeming like it), but life and nothing more.",
            "review_date": "2012-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This picture is great , the script was also very fresh .",
            "review_date": "2012-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Winner of best foreign film at the Oscars, this is an incredibly moving film that celebrates life through the eyes of a failed musician turned 'encoffiner'. Quiet and deliberately paced, but packs strong dosages of spirituality and emotional core.",
            "review_date": "2012-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Few movie can be at moments funny and in others devastating, and Okuribito (Departures) is one of these. Is an elegant, poetic, and touching film about the life and the death, with  exquisit pieces of music, sometimes is too complicated to describe all the sensations in this laudable japanese masterpiece. Is brilliant... mournfully.",
            "review_date": "2012-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touching, graceful, human movie.",
            "review_date": "2012-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The dilemma of Okuribito might be a little lost to those who don't have much knowledge of Asian, specifically Japanese, culture.  In a society where taboos and superstitions rule everyone's lives, the story of this film is actually much more than just a person coming to terms with an unrespectable job but a parable about how the unpleasant shouldn't always be swept under a rug.  The social stigma against being conscious of the dead is explored marvelously without being too didactic because the film understands that, while it's making a statement about a Japanese mindset, it is still a story about a person trying to find more meaning in his life.   Furthermore, despite it's heavy subject, Okuribito is able to have fun with its characters with a lot of sincere comedy moments that really help soften you up for the heavier scenes.  This balance between comedy and drama is marvelously handled by writer Koyama and director Takita as you come to understand that the unpleasantness of death can't be hidden away forever and avoiding it like the plague would be counterproductive.  That said, the film does fall flat on a few occasionally overly sappy and largely unnecessary moments such as the cello sequence.  At times, the film is also too afraid to move on to another scene as it's unsure whether it brought its point across.  This adds to a very slow viewing experience especially at the beginning of the movie and, some segments in the final act.  However, as a movie it's a very sincere and solid exploration of Japan and its relationship with the dead.",
            "review_date": "2012-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very unusual subject dealt with beautifully.",
            "review_date": "2012-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the film was quite predictable in its touching moments, it was nonetheless fantastically directed and very well acted. Its not often that you can sit engrossed through a slow film, but this had me captivated from beginning to end.",
            "review_date": "2012-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is a very emotional and fulfilling movie.  for anyone who is not that familiar with the cultures of japan I would highly recommend viewing the interview with the director before watching the movie.  The cellist movie played throughout this movie truely adds to the emotions demonstrated in this movie.  The ending of this movie is exceptional and is just a really strong movie on a culture in japan that basically look down out until necessity calls. Atode.",
            "review_date": "2012-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautifully photographed film depicting that respect for each other and one's self can be learned through service to each other.   Okurbito is also a fascinating look into aspects of Japanese culture that are totally foreign to to virtually all Americans.  The pace is a little slow, but all of a sudden you are transfixed by the moving transformations of the characters.\n\nStunning performances by Masahiro Motokj as the protagonist, Tsotomu Yamazaki as his mentor, and Kazuko Yoshiyuki as the keeper of the bathhouse.\n\nThe music is perfect for the film's moods.",
            "review_date": "2012-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most human films I have seen.",
            "review_date": "2012-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quiet and understated, yet deeply moving.  An incredibly powerful film.",
            "review_date": "2012-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After losing his job as a cellist for an orchestra in Tokyo, Daigo (Masahiro Motoki) and his wife Mika (Ryoko Hirosue) move back to his home in the interior of Japan. As such, he looks for a job and gets a well-paying one as an individual who gives respect or prepares those who have just died. He at first disdains the job but ends up keeping it, which for some reason is resented by the towns' people, and to whom he keeps this a secret from his wife, of which she eventually finds out due to some bizarre, humorous tapes. Daigo also gains a better understanding of life, and remembering back to his happy childhood, wondering what did become of his father after he left his family when he was very young. Both funny and powerful, this slow-paced movie is a memorable character study on an individual, as well as informative film one on a career type that I had never really hurt of. I find it ironic that people declare this career as disgusting, since they are the ones who hired Daigo and his company to perform the act of preparing the deceased individual. Nicely composed story, with very nice photography to spare. Incidentally, actor Motoki has some sort of defining age thing going. The actor is in his mid-40's here, but he really looks like someone who is still in his 20's.",
            "review_date": "2012-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best japannesse films i have ever seen",
            "review_date": "2012-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite being a tad predictable, Okuribito is a great movie with great characters and a pretty good story. It also has the honor of being one of the most touching movies i've ever seen. A great film, and a sure tear pusher.",
            "review_date": "2012-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another lowlife who thought he could get by on music alone gets what he deserves. Karma can sometimes be awesome!!!",
            "review_date": "2012-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A profoundly moving and brave film about a taboo subject.  It was the pick, for me, of the 2008 PIAF films at Somerville, Perth, Western Australia.  A deserved winner of Foreign Language Oscar.  Motoki plays the cello in the same way as he handles the deceased - with reverence, dignity and precision.  Great performances from Motoki and Yamazaki.  Like 'Barbarian Invasions', a film about death which is utterly life-affirming. As for the music - sublime. Phil.",
            "review_date": "2012-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant and beautiful film. Both funny and sad.  Truely worth the Oscar it won in '09.",
            "review_date": "2012-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An incredibly paced perfect blend of unique black humour & heartfelt human drama. An exceptional in general but a true masterpiece for Japanese Cinema.\n\nThe story of a newly sacked cellist who quickly transitions into the death business with prepare prior to funerals.\n\nThis story of this man & his battles & his emotional journey in this career. A particular scene of memory is the 360 degree shot of him playing his cello in the background of Japanese mountains...this is a memorable & touching film.",
            "review_date": "2012-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Death. Beautiful and peaceful. Interesting peek into japanese culture surrounding the death. Enjoyable.",
            "review_date": "2012-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While at times predictable, its a very touching and enjoyable film.",
            "review_date": "2012-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best Japanese films I've ever seen. Love the soundtrack too.",
            "review_date": "2012-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most beautiful movies we've seen.",
            "review_date": "2012-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Started out amusing and awkward but rapidly depreciated into overly slow repetitive  funereal rituals that went nowhere...again and again. Two hours too long.",
            "review_date": "2012-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of my all time favorite movies. It really pulls at your heartstrings and deals with the acceptance of death and life and forgiveness.",
            "review_date": "2012-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant. Simply brilliant.  Confronting but wonderfully scripted and made.",
            "review_date": "2012-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great music scores are what the japanese does best.",
            "review_date": "2012-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very rare tight story from Japanese. A good one.",
            "review_date": "2012-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a must see movie, I love the cello music in this. Doug, now I understand why you said the cello is for me.",
            "review_date": "2012-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Japanese Oscar winning film.....sensitive, emotive, humorous at times, beautifully filmed. Also a fascinating insight into a subject rarely seen.",
            "review_date": "2012-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie which talks so much about Life and also about death. Heart touching & keep the viewers spellbound....... watch out for the background cello score & lovely japanese country side and tribute to death in a japanese style..... a must watch",
            "review_date": "2012-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whilst I normally have a healthy dislike for films that drip in sentimentality, I am nowhere near cynical enough to have immersed from this one without having been profoundly moved.",
            "review_date": "2012-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dark yet inspiring. A movie that guides its viewers to depths of pain and confusion felt by the protagonist. It shows how not by anything else but indifference, one dies before one actually truly dies. Emotional death - the most paralysing of all deaths.",
            "review_date": "2012-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Un film Ã (C)minemment touchant! A very touching movie!",
            "review_date": "2012-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film which captured the moments of letting go of loved ones in a compassionate and delicate way.",
            "review_date": "2012-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really enjoyed this film. A unique mix of light and dark. A little cheesy in parts (some of the montages seem almost karaoke-esque) but not enough to be off-putting.",
            "review_date": "2012-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excessively sappy at times. However, Departures includes strong performances and broaches a one-of-a-kind subject (and/or profession) that will entrance any audience.",
            "review_date": "2012-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After this movie one almost wishes to die in Japan...",
            "review_date": "2012-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its a simple premise but lovingly realised. Well worth watching!",
            "review_date": "2012-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow depiction of an interesting Japanese profession, often employing dark humour, but one with a very deep and meaningful conclusion.",
            "review_date": "2012-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Peaceful, touching and quirky funny, Departures is a very positive view on life and the choices we make, despite the topic and the very teary scenes.\r\n\r\nPoetic, slow-paced and beautiful.",
            "review_date": "2012-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a slow movie. However, protagonist Daigo Kobayashi goes through a number of life (and death) affirming choices to see his father off. A great look at the meticulous craft of death and funeral in Japan, regardless of religious belief. Very moving, great emotional performances by Motoki and Yamazaki.",
            "review_date": "2012-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A touching drama of life and death, held afloat by a sense of humor and a sensible cast. Overlong; the second half was less inspired than the first, and in the end it's not as profoundly pensive as it could have been. Memorably beautiful musical score.",
            "review_date": "2012-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "if only I understand this culture maybe I will appreciate more",
            "review_date": "2011-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Instant Japanese classic, deeply moving and astonishingly beautiful, with a reverence and respect for death that is both utterly Japanese and universal.  An Oscar win for Best Foreign Language Film only confirms it's unique appeal for both high laughs and low, deep sorrow.",
            "review_date": "2011-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pleasent enough but a bit twee, very predictable and no real insights.",
            "review_date": "2011-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Poignant, real. I have not seen a more sensitive treatment of death, loss and grieving than \"Okuribito\".",
            "review_date": "2011-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is unexpectedly enjoying - very touching and meaningful.  Though the story is very simple, it is quite interesting at the beginning, and naturally moved to the inside world of an â\u0080\u0098encoffineer'.  The design of every \"departure\" ceremony is also detailed and touching.  Mashiro Motoki is great as the actor of the lead role.  The music of this movie is also elegant and great.\n\nIt is a great watching experience of Japanese movie.",
            "review_date": "2011-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gotta love a film that's perfect in its simplicity.  Departures doesn't try to do anything fancy, it's simply a story of growing up and coming to terms with yourself, and your life.  Our main character (\"Dai-chan\") is at a crossroads in his life, but just as one door closes, another opens, and he finds himself recapturing his roots while settling his demons, working on his marriage, and discovering a new career he couldn't even have imagined.  But while learning to understand the pain of others, he's able to come to terms with his own pain, and is finally able to put his hatred and sorrow away.. for good.  It's difficult to comment on the Japanese acting and emotions, but with my naivety I still thought it was very well done, especially by leading man Masahiro Motoki.  A few times in the film, I felt like \"now would be the perfect time to end it\", yet it continued, and while this almost always means certain death for a movie, 'twas not the case for Departures.  Each added increment added more to the story and more to the closure of the story, and it worked well.  The cinematography, while unglamorous, was beautiful.  There was one scene in the beginning with the red sun rising amidst the backdrop of mountains, and I couldn't help but feel whoever imagined the Japanese flag was probably looking at a scene just like that, the land of the rising sun.  The music only added to the atmosphere of the tale, and in addition to being a major plot element, enhanced the film's depth.  I honestly couldn't find a complaint with this movie; it was unspectacular, but flawless, and exactly what I was looking for.  Good characters, a good plot, and a good evening ;)",
            "review_date": "2011-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Here's a good mixture of emotions, comedy and drama (could as well have served as a thriller had they thrown in some elements!!! JK) that strikes a chord with your heart and makes you chuckle occasionally. But unlike some have experienced, I didn't come across a sequence worth shredding a tear. The duration could easily have been trimmed without affecting the quality of the movie. Reducing the number of encoffining ceremonies wouldn't have affected the significance of the movie or its title in my opinion. The movie left two important situations unexplained/incomplete, all the more for those who need everything spelled out to them!!! I wish the timing was rather allocated to elaborote those matters rather than showing the numerous encoffining procedures. Most disappointing was the sequence towards the end. Either the makers shouldn't have touched that topic (It could have been omitted. That wouldn't have been great, but I'd prefer omission to going for it given the way they did it.), but since they did, I wish they'd given it a decent shape. Except for those minute complaints, I find the movie fit to watch and enjoy. And if you don't mind exaggeration, it's a marvelous family drama not to be missed. The journey of the self-acclaimed loser deserves a watch.\n\n\nTIP: If you don't feel well and feel like throwing up, postpone viewing it for the time being. See if you can get anything else for time pass. Not that it's any hardcore, but at such times, even the least gross scene tend to be harmful. Good for you if it doesn't apply to you.",
            "review_date": "2011-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sombre character piece with a touch and occasionally humorous script. The landscapes accompanied by cello sequences were quite striking.",
            "review_date": "2011-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "on channel 4 at 12.30 must see!!",
            "review_date": "2011-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The gift of last memories.",
            "review_date": "2011-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful film that won Best Foreign Language film Oscar.  This film represents what I love about movies, being able to experience another country and culture/tradition that I otherwise wouldn't have.  It's a really original and interesting story that I really enjoyed watching. Highly recommended!",
            "review_date": "2011-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Touching, meaningful and sentimental film.\r\nAlthough the main story plot of the film is about dead and funeral, it is not that sad and heavy at all. It's quite amusing at the first actually.\r\nDaigo hates his job and feel ashame about telling others, including his wife at first. And nearly want to give it up upon family's and friends's request, but later he experiences joy and feel a sense of fulfillment in his work. Every funeral he goes though becomes a lesson to teach him how to be a professional.\r\nThe last funeral of the film, what he did for his father shows that he is a compete professional comparing at the first.\r\nI also like how Daigo figures out what his father looks like during he performs the service. That last 2 funerals are so touching and I nearly crired during watching it.\r\nOther than Daigo, I think the President of NK Agency, Daigo's boss (Tustomu Yamazaki), also did a very good job in the film. He likes a mentor rather than his boss.\r\nLast but not least, Joe Hisaishi's BGM is as amazing as always. The OST of the film is a must BUY for me!",
            "review_date": "2011-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful film. So moving that many times i was on the verge of tears.",
            "review_date": "2011-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I absolutely loved this movie.  It made me realize how we sometimes don't appreciate what it means to have respect for the dead.",
            "review_date": "2011-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely beautiful and moving.",
            "review_date": "2011-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely beautiful and moving.",
            "review_date": "2011-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most beautiful movies I've seen that has addressed the concept of death.  A film with the perfect blend of gravity and levity.  This delicate balance is masterfully achieved.  Great cast chemistry.  The storyline is perhaps a little too nicely 'gift wrapped' for the viewer and some of the visual metaphors lack subtlely.  However, these aspects are quite forgiveable.  Overall, a very moving film.  Bring out the kleenex.",
            "review_date": "2011-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never has the pace and tone of a film so brilliantly reflected it's story. Beautifully mixed feelings of sorrow and humour are woven through a great story that makes you so eagerly want to visit Japan. The poetry of death is so well delivered, this is a true classic.",
            "review_date": "2011-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a \"must see it\". Believe me...",
            "review_date": "2011-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heart-warming & tender, comical and profound; definitely art-house category.",
            "review_date": "2011-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am lost for words for this movie. A masterpiece.",
            "review_date": "2011-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(talking about salmons in the river...)\n\nDaigo: It's kind of sad.. to climb only to die. \nWhy work so hard if you're going to die anyway?\n\nOld Man: I'm sure they want to go back... to their birthplace.\n\n\n--a total opposite of Peter Pan's 'to die will be an awfully big adventure'--",
            "review_date": "2011-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nice concept with good performances and heart, but at 2 hours, 11 minutes, it begins to drag. The film doesn't have enough material to give to justify that length - after the first hour it just begins to feel like the film is intent on plodding along for no reason other than it'll help to make it seem more meaningful if it's longer.\r\nStill, the awkward pacing towards the end stops it being the brilliant little drama/character piece it could have been, but it's still a reasonably enjoyable bit of work as it is.\r\n\r\n7/10",
            "review_date": "2011-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On the premise that life is beautiful and death can be so beautiful, Departures lives on a story of heartfelt traditional Japanese casketing ceremony boasting metaphors and depth with strikes of wit and humor. Fascinating and moving, the masterful performances, beautiful cinematography, and haunting musical score is none but an ode to beauty and perfection.",
            "review_date": "2011-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't find the ritual very interesting to tell the truth. Actings fine. Story fine. I thought it would be better.",
            "review_date": "2011-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After his orchestra is disbanded a professional cellist moves back to his hometown with his wife and accidentally becomes an encoffineer, giving the deceased their peaceful departure, a sad and beautiful final ritual of preparing the body for the trip to afterlife.\n\nA touching film (even wept a few times, might be due to some unhandled emotions though) that won an Oscar as the best foreign film.",
            "review_date": "2011-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Moving and original but at the end, Departures, feels too long.",
            "review_date": "2011-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a beautiful film",
            "review_date": "2011-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It certainly has an interesting premise, but the plot is so contrived that you can almost hear the gears turning.",
            "review_date": "2011-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a new perspective about life and death.",
            "review_date": "2011-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "though death awaits at the end of life, a salmon is still willing to struggle BIG TIME just to get back to a place called HOME.. \nagain, THE WORLD IS BIG AND SALVATION LURKS AT EVERY CORNER.\nTHIS IS NOW MY ALL TIME FAVORITE MOVIE!",
            "review_date": "2011-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most touching and profound movies I have seen...will stay with me for a very long time.",
            "review_date": "2011-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okuribito is marvelous drama film. It gives great insight about the theme and subject that it carries. Very emotional scenes at some frames, and I must include here that the final scene when he finds a pebble in hand of his father is far more tearjerker scene that I could have expected from this total serious film. It is also to be greatly noticed that there is great stress upon the life of a new encoffiner assigned to the job, who faces corpses of different stature. The scene in which he has to hold legs of two week old deteriorated corpse of an elderly dead woman, is magnificent, that includes his almost puking face. A must watch film, I should recommend.",
            "review_date": "2011-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LOVED it! Laughed and cried. Amazing film. 8-)",
            "review_date": "2011-08-04",
            "source": "rt",
            "lang": "en"
        }
    ]
}