{
    "rating": 1.8,
    "release_date": "2009-10-23",
    "num_reviews": 30,
    "genres": [
        "Comedy"
    ],
    "summary": "Stan (Steve Howey), a slacker video store clerk, his sexy girlfriend, best friend and an exotic dancer take a detour into a town cursed by the biggest monsters in movie history.",
    "reviews": [
        {
            "content": "Have not even seen the movie, no Rox emotive, Rip off van helsing",
            "review_date": "2023-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is hysterical & still currently updated on current events as jokes. Well done & the cast is perfect. I personally recommend to everyone who loves horror & comic. I love it!",
            "review_date": "2023-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is nowhere near the worst parody movie I've ever seen but it's too stupid and tired to even care",
            "review_date": "2022-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I honestly think this movie is hilarious and I've loved it ever since I was a kid.",
            "review_date": "2022-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay so as a spoof movie, fine, whatever. There were some funny jokes, I managed to stay awake for the whole thing, so not awful.\nBut *spoiler alerts contained*. FOR SHAME. The whole effing movie is about them dropping off some porno movies to grandma and after all of that ridiculousness, WE DON'T EVEN KNOW IF THEY WERE DELIVERED. I'm not over it and it's been 24 hours. I'm just not ok with that massive hole in the ending. Sorry, ruined everything. Please can ANYONE tell me if they deliver the movies? PLEASE",
            "review_date": "2022-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is and always will be one of my favourite spoof movies. It has everything.",
            "review_date": "2021-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Had some funny moments in it. Better than a lot of parody movies.",
            "review_date": "2021-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe the worst movie I've ever seen!\n0/10, there's absolutely nothing good about this movie and you're better off watching literally anything else.",
            "review_date": "2021-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it is a silly and crude film. it's terrible don't watch",
            "review_date": "2020-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nope, just as bad as any parody flick that is now a normal expectation/warning of avoidance even though it admittedly went slightly above that very average by a bit when providing few actual humorous moments when not parodying an horrific intellectual property which gotten worse when the climax busted in then the rest is okay to skip and immediately finish the film. (C)",
            "review_date": "2019-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this film is not particularly inspired and the scenes do not make much laugh, i said there are some quite clever finds but in general the film is mediocre ",
            "review_date": "2019-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Underrated great spoof flick.  Must see funny as hell sex jokes good jokes bad jokes memes plain stupid funny as hell. I recommend watching dont miss this gem . Glad i found this stumbling across it in the guide. Stan helsing rules. ",
            "review_date": "2019-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie, basically it is what it is. Hot chicks, you can follow the plot line. It has hilarious moments and some cheesy ones. If you want to disconnect and have a fun time check it out. Did i mention the hot chicks? Lol...",
            "review_date": "2019-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Close to the worse movie ever seen. I dont know how manage to watch the whole thing but it hasn't got one funny bit in it.",
            "review_date": "2019-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It’s juvenile and dull, but there are a handful of borderline clever moments, which is more than can be said for trash like Disaster Movie.",
            "review_date": "2018-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1/5.  I've seen worse parody movies, but I've also seen far better.  Stan Helsing has a handful of funny jokes, but most of the laughs are uninspired and, frankly, stupid.  It completely wastes a fun concept.  Middle schoolers will like this movie, but that's about it.",
            "review_date": "2017-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this movie was a funny and hilarious comedy movie I definitely enjoyed this movie",
            "review_date": "2017-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is ruining the name of a fictional vampire slayer.......",
            "review_date": "2017-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was made to sound like a worthwhile movies online, but after watching it tonight, I was very disappointed.  I feel like I've been exposed to one of those short Facebook videos that reminds you after watching you'll never get that 2 minutes back you just wasted watching that video.  Unfortunately this was a lot longer than 2 minutes, time I'll never recover and wish I could.  Not worth it in my opinion.",
            "review_date": "2016-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Actually not the worst of the apparently never ending horror movie spoofs.",
            "review_date": "2015-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Other than clueless actors with no emotion the only good scenes in this film were of the babes and that's it I dint laugh or even smile through the whole film what the hell happened?",
            "review_date": "2015-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After 30 excruciating minutes, I couldn't take anymore of this unfunny, life wasting piece of shit that is Stan Helsing.",
            "review_date": "2015-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not much to say except: where are the times where movie spoofs still were funny? Not here... This was just stupid...",
            "review_date": "2014-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For being consistently bad and not making me laugh even once, this movie more than earns a half star rating.",
            "review_date": "2014-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pathetic and no different from any other spoof some writers think to be funny.",
            "review_date": "2014-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Director Bo Zenga (one of the executive producers of Scary Movie) must be familiar with the genre he's spoofing. After all the poorly-written Jason Friedberg and Aaron Seltzer films, Bo Zenga delivers a film that's freshly funny and well-written from start to finish and that film is \nthe horror-spoof \"Stan Helsing''. Thumbs up, delivers the goods.",
            "review_date": "2013-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is one of those films which is so bad, it's funny for the wrong reasons.",
            "review_date": "2013-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Being tired of the constant decline of modern parody movies, I really hoped this one would at least be good. Well, I was disappointed, the humor was idiotic at best. Also, regardless of this being a parody of horror movies, there were no mature scenes here, the whole movie was somewhat childish. The only OK thing were the redesigns of some famous horror icons (Michael Myers with a butter knife for example), but after already seeing them it wears off.",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        }
    ]
}