{
    "rating": 8.9,
    "release_date": "1938-02-18",
    "num_reviews": 150,
    "genres": [
        "English"
    ],
    "summary": "Harried paleontologist David Huxley (Cary Grant) has to make a good impression on society matron Mrs. Random (May Robson), who is considering donating one million dollars to his museum. On the day before his wedding, Huxley meets Mrs. Random's high-spirited young niece, Susan Vance (Katharine Hepburn), a madcap adventuress who immediately falls for the straitlaced scientist. The ever-growing chaos -- including a missing dinosaur bone and a pet leopard -- threatens to swallow him whole.",
    "reviews": [
        {
            "content": "I am a huge fan of Katharine Hepburn and Cary Grant but this movie is too implausible and exasperating. Turns out, not every single movie they did is a gem. Hepburn's character is so irritating! Much better screwball comedies out there.",
            "review_date": "2023-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wacky, quick-lipped comedy from Howard Hawks, which foreshadows the director's sharper, later work on His Girl Friday. Bringing Up Baby follows a tightly-wound paleontologist (Cary Grant), out of his element on a fundraising mission, who crosses paths with an accident-prone chatterbox socialite (Katherine Hepburn) and her housebroken pet leopard. Grant's mild-mannered professor is immediately frustrated by the entanglement, but the more he struggles to extricate himself, the tighter he's bound. The girl is quicksand, basically, and she revels in the havoc she plays upon her unsuspecting prey. Eventually, somehow, the two develop a strong affection for one another, but not before they've ostracized a benefactor, misplaced a priceless fossil and spent a few hours behind bars.\n\nGrant was no stranger to comedies (his collaboration with Hawks would continue in the aforementioned Friday), but this was Hepburn's first foray into the genre. Rumor has it she needed a little behind-the-scenes coaching, but she pulls her weight in the finished product and shows strong chemistry with her counterpart. I was pleasantly surprised by the number of laughs in the first hour, especially given the movie's age, but it wanes on the home stretch and I didn't really care for either of the main characters: one irritable wet blanket, one scatter-brained troublemaker. They get into some good scrapes together, but fail to redeem their intrinsic faults and don't quite merit the happy send-off they both enjoy.",
            "review_date": "2022-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most famous and greatest movie of Howard Hawks. Cary Grant and Katherine Hepburne gave an amazing performance and compose a dazzlingly energetic couple, playing\noff each other's polar opposite personalities with impressive cinematic flair.",
            "review_date": "2022-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Bringing Up Baby\" is a film I unconditionally love; it is so utterly sublime a comedy that I was truly sighing, awed, 'it can't get better than this...' at many points. Yet it regularly does; Hawks keeps the momentum going majestically; it is one incredibly surreal, bizarre tangent going off unexpectedly into another, at every juncture. He photographs and presents his actors in the most charming and amusing possible ways, and the film is certainly a more leisurely, perfectly pitched film than \"His Girl Friday\", which I nonetheless admire. There is a beauty in the photography and simple choice of perspectives and angles that matches the\n\nThere is not one actress in the annals of film who I adore more than Katharine Hepburn; she is a compelling performer, of great charm, intelligence and wit; of very real, idiosyncratic looks that to this eye are beautiful, vivacious, impish. In \"Bringing Up Baby\" her Susan Vance is a very interesting diversion from her more usual type of character - the slightly superior, in-control ice maiden, as shown in say \"The Philadelphia Story\". She is phenomenal in that film, yet here beguiling in a completely different fashion, playing a slightly scatterbrained, sprightly, charmingly delinquent woman, who seems to have no control over anything; least of all her feelings for Grant. Her giddy, breathless exuberance and anarchic helplessness are really endearing; it's a wonderful film that stretches out the credulity of Grant's wonderfully straight-laced character's resistance to Miss Vance. The ending is a gorgeous, satisfying pay-off, as he finally gives way, as would we all! It's a charming, suitable ending that rectifies the slight fall-off of the preceding jail section of the film. That is very amusing, but in a more predictable, slightly laboured way. In stark contrast to the first 70-80 minutes of the film, which amounts to about the finest sustained American comedy I have seen of that length - \"Way Out West\" and \"Duck Soup\" being shorter in total.\n\nCary Grant, truly an institution of a comedic player, is very different to his more remembered persona of later years. It's remarkable to see this absurd little man, bespectacled, unworldly and cutting an orthodox figure played so perfectly by the suave Grant. This is gleefully played on with the sublime scene where Hepburn and Grant are trying to catch the leopard - Kate butterfly net in hand! She accidentally happens to break his glasses and is even more taken with him without them... The tension between how we usually remember Grant and the character he is playing here does add an extra layer of amusement to the film. Need I really add that the rest of the film's company are note perfect? Charles Ruggles, Barry Fitzgerald and many more really give the perfectly matched stars a fine backdrop.\n\nI shan't spoil too much of this heady, sublimely silly film... just go and watch it and see Howard Hawks, a master craftsman, at his best - there are no pretensions but making a quite wonderful character comedy - and Katharine Hepburn and Cary Grant on insurmountable form. With these delightful stars and anarchic, scintillating comic material, what we have on our hands is an unutterably fine film, one of my very favourites of all time. Where else are you going to get such plot threads running simultaneously as: a hunt for a rare archeological find buried by a dog, an absurd upper-middle-class family dinner and an escaped leopard?",
            "review_date": "2021-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Arguably the greatest (and funniest and fastest) comedy ever made, for certain the ultimate screwball comedy, never surpassed in its madcap culmination of absurd and hilarious misadventures; with a perfect cast (Skippy and Nissa included) and the chemistry between Hepburn and Grant is breathtakingly immaculate.",
            "review_date": "2021-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A screwball comedy that is an absolute delight. I never lost a grin on my face throughout the whole film.",
            "review_date": "2021-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes, this is a crazy screwball comedy, but it works.\n\nA nerdy college professor is finally about to receive a missing bone for his brontosaurus skeleton in his museum. He also is about to marry a woman who is more interested in his work than in him as a person. On top of that, he has to get in good with a lawyer who represents a society matron who has $! million to give away...hopefully to his museum. Trouble is, a spoiled rich woman keeps getting in his way and interfering with his plans. And the woman even has problems of her own...what is she supposed to do with a tamed leopard (the \"Baby\" of the title) her brother just sent her? And the professor gets unwillingly involved.\n\nThis is a clearly not intended to be realistic, but a comedy of errors a la Shakespeare. Old-fashioned without being dated, and family entertainment with enough spice (such as a torn skirt scene) to prevent it from being insipid. Great light entertainment!",
            "review_date": "2021-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the funniest movies of all time. An absolute gem of a screwball comedy. Truly brilliant work by the incredibly beautiful and ravishing Katharine Hepburn, the truly great comic actor Cary Grant, and the master of screwball comedy Howard hawks.\n\nFunnier every time I see it -- and that must be at least 50 times, with surely many more to come.\n\nOne of my truly favorite movies of all time!!",
            "review_date": "2021-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Atrocious. I know this is supposed to be a classic, but the great Katharine Hepburn plays an insipid, manipulative twit. The plot is inane. The whole thing is shill. Don't waste your time unless you want to watch a lot of morons scream at each other.",
            "review_date": "2021-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bringing Up Baby - 10/10. Howard Hawks, Cary Grant, and Katherine Hepburn are some of the biggest and most successful people from the Golden age of Hollywood. Though each person had amazing careers later on after this film, Bringing Up Baby is a perfect example of a film that was well ahead of its time, and once it was appreciated, was considered as a masterpiece in its respective genre. The movie is probably the first film in the now super popular screwball comedy genre. Back when it came out in 1938, the film bombed at the box office, and even lead to having Hepburn losing out on film roles because of its unsuccessful initial run. But the film gained a better reputation as the film started playing on television in the 50s. Many films of today can learn a thing or two in the way the comedy is presented and delivered in this film. Grant and Hepburn play up the odd couple dynamic really well, with Grant's uptight nature and Hepburn's bubbly mannerisms helping bring a nice levity to the proceedings. The movie is littered with zany moments which feel over the top in the right way. What a lot of comedies do nowadays is try to make shocking moments that are so ridiculous, yet this film understands the perfect balance of zany and natural humour. Hawks provides the viewer with a quick and fast movie which translates really well all these years later. You're aware of it being a classic film, but it doesn't feel that way in the slightest. Time just flies by watching the movie, and its just a really fun time overall. Hopefully the movie never ever is remade, because I highly doubt anyone can top the performances that the whole cast gives in the film.",
            "review_date": "2021-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've just discovered this energetic Hepburn girl and she's pretty darn good.",
            "review_date": "2021-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was no doubt intended to be very silly and not in any way a believable story, which is fine, but it was completely spoiled by Katharine Hepburn's constant awfully annoying whining voice, which I doubt was intentional.",
            "review_date": "2021-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is one of my all time favorites. \nEveryone plays their roles perfectly, even Baby. \nKatherine Hepburn is the wealthy niece of a philanthropist, aunt Mary. Everywhere she goes chaos ensues. Cary Grant is scientist Huxley, conservative & looking to obtain a million dollars for the museum from Aunt Mary. There are 2 pets too! \nIt's a family friendly comedy that performs at every level. Enjoy!",
            "review_date": "2021-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed it until Katherine Hepburn turned up. Annoying, frenetic, exasperating.",
            "review_date": "2021-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny screwball comedy. Archibald Leach!",
            "review_date": "2021-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic film by Howard Hawks with great performances by both Grant and Hepburn",
            "review_date": "2020-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that passing the years becomes better!",
            "review_date": "2020-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A romantic comedy that leans far more into the comedy than the romance, Bringing up Baby is wholesome and funny when exposed in short bursts, but ends up being rather repetitive as the runtime stretches out. Every scene is full of humorous misunderstandings and clumsy physical comedy (lots of falling down short slopes), such that even cinema titans like Hepburn and Grant often feel distressing and just plain annoying (they should rightly be better remembered for their more serious roles), and I can't say that their chemistry is particularly memorable. There are several moments of dubious shooting quality, where actors often talk over one another in a manner that you'd think might justify another take in a film that relies on comedic timing, but were ultimately deemed satisfactory. Plenty of memorable one-liners do help out, and the jailhouse scene brings out the best of the film's formula (particularly Walter Catlett's easily confused Constable), but I can't say this is a top entry among early romantic comedies; the film seems distinctly amateurish compared to the well-aged Gable/Colbert It Happened One Night. (3.5/5)",
            "review_date": "2020-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a pretty daft but humorous oldie. Katharine Hepburn is ludicrously zanily attractive. Carey Grant is pretty good and the whole thing is charming. Enjoyed it.",
            "review_date": "2020-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The actors are still fun but the story is weaker than their other collaborations.",
            "review_date": "2020-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Her role is a spoiled rich brat, not a woman in love. Hepburn is not a good choice for comedy. His motivations are also unclear. I heard that in the original short story they were already in a relationship, which would have made more sense.",
            "review_date": "2020-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Howard Hawks's \"Bringing Up Baby\" is the go-to example of screwball comedy that critics and film-lovers reference most as the definitive model of the genre. Quirky, original, perfectly timed, and with hilarious performances from the likes of Cary Grant and the incomparable Katharine Hepburn. It has been said that Hepburn struggled with a comedy performance, but as a mark of her talent, this never shows through. She is absolutely brilliant in this movie, blending slapstick, witty repartee, and even a little 'come hither' romance in a wild, frenetic script. She even does a mean gangster impression towards the end. Katharine Hepburn, Cary Grant, and a leopard, hey, what more could you want? One of the highest high points of the entire screwball comedy genre, with its sharp script and wonderfully balanced leads. Recommended for all. This film is an absolute joy. 10/10",
            "review_date": "2020-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bringing Up Baby is a fantastic comedy I ever seen!",
            "review_date": "2020-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Grant and Hepburn are phenomenal individually and together, but watching it in 2020 there are enough badly-aged elements - exotic pet ownership, big game hunting, circus animals - to make it an uncomfortable watch at times.",
            "review_date": "2020-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is on many lists among of the funniest of all time. Hepburn and Grant are at their comedic best. I just watched it again and the first half of the movie is hilarious but the second half takes 'screwball' too far and drags on. Hepburn could do anything or be anyone in any film. This is a rare film that she could easily be descibed as 'sexy'. As great as Hepburn is, Grant is even better here. Watch him respond to everything she does to him and you'll see the comic genius that is Cary Grant.",
            "review_date": "2020-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is a GREAT MOVIE, \"Bringing Up Baby\"(1938), that I have seen a number of times, on my TV(I recently saw this on my TV at 7:00pm(CT) Saturday March 07, 2020!)! (My comments here were done at 11:33am(CT) Sunday March 08, 2020.)",
            "review_date": "2020-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1938❗️ & WOW‼️ KATHERINE HEPBURN is wonderful, beautiful & absolutely ADORABLE.  Never saw or heard of this movie before saw on TV 11.6.2019",
            "review_date": "2019-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bringing Up Baby is a hilarious comedy of errors where everything starts to go wrong when the two main characters are together. If it was handled differently this is the kind of thing that could bother me, because I hate to see a protagonist who is a nice guy forced to suffer so much. However, the cast makes it work for me here. Cary Grant is such a great comedic actor that he can be utterly overwhelmed and still seem like he’s having a good time. His struggle to be polite when everything is falling apart around him made me laugh so many times. It also helps that Katharine Hepburn plays her role with so much ignorance. She never once feels malicious, as if she intends to make life miserable for Grant’s character, it’s just that she doesn’t always understand what she’s doing. At times her character feels a little over-the-top and too much of a dizzy dame to be believed. Because the film built so much comedy out of her crazy personality, I was willing to accept it. The supporting cast was also marvelous, especially Walter Catlett when he has to piece together all the insane things that all these characters are telling him in the final act. That whole sequence in the jail had me laughing hysterically. I did think that Bringing Up Baby started to spin its wheels a little too much when they entered the phase of searching for Baby. The jokes all became a bit similar and it felt like people were going around in circles without progressing the story too much. I also knew where it was going at that point so I just wanted them to get there. However, this section of the film didn’t linger for long, and shortly after that they reached the jail and things got hilarious again. One of my favorite things about this style of screwball comedy is that the jokes keep coming rapid fire, so even if something doesn’t work for you it won’t be long before someone will throw out another silly line.This isn’t the kind of movie where they give the punchline and then pause for a laugh, in fact half the times the jokes are just thrown away without bringing any attention to them and you can miss them if you’re not paying attention. This delights me because it will make revisiting Bringing Up Baby a real treat as I discover some of the subtle things I missed the first time. I laughed more at this than most other movies I’ve watched in years, and any complaints I have are really just minor quibbles. This is a movie I hope to add to my collection and watch many more times in the future. I could see it easily becoming a favorite of mine. ",
            "review_date": "2019-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As screwy as screwball romcoms come, Hepburn and Grant—not to mention Skippy the wire fox terrier and Nissa the leopard, doing double duty here as both Baby and her dangerous doppelgänger—are archetypically terrific, all persiflage and pratfalls with the speed of, well, a big cat on the prowl. As a comedy of errors and mistake identities, the plot is Shakespearean while the humor is madcap Marxian, with Hepburn embodying the brothers—the violence of Harpo and the witticisms of Groucho—to Grant's Margret Dumont. No doubt in part due to Hawks' engineering background, the events, outlandish as they are, work like well-oiled gears, each zany scene flowing easily into the next, even as, ironically enough, every character here seems to have a few cogs loose, to say the least.",
            "review_date": "2019-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome. Can hold up very well in terms of comedy and structure with movies today and surpass them. ",
            "review_date": "2019-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Film bring up Blobbo mood.  \nOne of Blobbo 10 favorite films...of which there are about 150.",
            "review_date": "2019-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Classic screwball comedy.",
            "review_date": "2019-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All the bickering and small talks, led to this, one of the finest pair I encountered on screen.\n\nBringing Up Baby\n\nHawks, maybe, has the ingredients that I don't prefer. For, as far as filmmaking is concerned, there are scenes projected in here, that might drop your jaw. The director Howard Hawks must be a good comedian. Since what he finds funny might not marginally come under everyone's jurisdiction. Let us first give the respect to the visual department. How smartly have they pulled off some imageries. For instance, a dog fighting a leopard or in that case anything with leopard. Just like, George Lucas used efficiently productive methods on set to create a whole new world, Hawks is tricking you nicely.\n\nMaybe these are the moments that led the industry to use more artificial things or sprinkle something post production, hence films like Wings makes you challenge yourself. In plot, I'll tell you one thing, the irritation does communicate with me. There are loads of verbal sparrings and loud noises, it's like if Martin Scorsese met Aaron Sorkin and together they were on steroids. It can be too much, easily. The screenplay is smartly and highly detailed and still the gags are kept prior to the narration.\n\nNo matter how well it is done, you can always tell apart after you are done with the film. The chemistry is another major note. It is off the hook and if you want to see a good example, watch them coordinate with each other in sync in the beginning of the party sequence. The issue that I had with was Cary Grant's character and not of Katherine Hepburn. He is the catalyst. She is one smart cookie in every situation. Just watch her get her way out of ticket, she knows what she is doing. Bringing Up Baby is actually a \"how to not\" novel, and unfortunately \"how tos\" are not my thing.",
            "review_date": "2019-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Often regarded as the finest screwball comedy of its kind, Howard Hawks' \"Bringing Up Baby\" represents a very delicate high-wire act of undoubtedly humorous persuasions, skillfully dangling the audience between the zones of unbridled hilarity and persistent agitation for almost the entire running time. This sensation is due in large part to the effective performances at hand, namely the wily and goofy antics of Katharine Hepburn and the hapless straight-man-isms of Cary Grant. The two make for an infectiously goofy onscreen pairing, with the surprisingly meticulous plot of the film facilitating a journey that is -- again -- somehow both exhausting and exhilarating at once. It's a sure-fire success that I won't soon forget.",
            "review_date": "2019-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the best movies of all time!!",
            "review_date": "2019-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot was too complicated and the characters feel more like caricatures than genuine people. The only good things about the movie are Baby the leopard and George the dog.",
            "review_date": "2019-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some jaw-dropping moments that would cause uproar today, an actor far too good looking to be a geek, a brilliant Katharine Hepburn having fun on set and a host of nutty supporting characters add up to four laugh-out-loud moments more than many other so-called comedies.",
            "review_date": "2018-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bringing Up Baby: Pros: - Fantastic Acting - Amazing Directing - Terrific Script - Good Cinematography - Great Editing - Very Funny - Great Chemistry between the two main characters - Hilarious Plot - Phenomenal comedic timing - Most of the pacing is good Cons: - Some of the pacing feels a bit clunky Overall Grade: A (9.5/10)",
            "review_date": "2018-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Far more irritating than funny. \n\nDr. David Huxley has two reasons to be excited.  He is about to be married and the final piece to a brontosaurus, the showpiece to his museum exhibit, will soon be in his possession.  Furthermore, if he plays his cards right, a wealthy donor will donate $1 million to his museum, to aid his palaeontological collection.  Unfortunately, he meets Susan, a woman who seems destined to unintentionally destroy his life.  Huxley soon finds himself playing nursemaid to Baby, her leopard.\n\nDirected by Howards Hawks and starring Cary Grant as Huxley and Katharine Hepburn as Susan, this movie is ostensibly a comedy classic.  That's hard to fathom, unless extreme irritation is classified as comedy.  \n\nThe irritation starts almost from the word go.  Somehow we are meant to be believe that someone stealing another person's car and then smashing it up in nonchalant fashion is funny.  Susan is incredibly annoying and there is no light at the end of the tunnel - the annoyance continues throughout the movie, down to and including the final scene.\n\nIt's not just Susan - the whole 'plot' is random and just involves dumb things happening.  Yes, it's slapstick but there is hardly anything funny about it.",
            "review_date": "2018-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "AFI 100 Greatest Films - #97:  Was surprised how funny I found this comedy 80 years later.  Plenty of slapstick but the real comedy gold is found in the sharply written banter that is expertly volleyed between Hepburn and Grant, who are each excellent.",
            "review_date": "2018-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another classic in the screwball comedy genre, Bringing Up Baby flows through it’s wacky premise with a star-making Cary Grant and the lovely Katherine Hepburn",
            "review_date": "2018-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was so tiresome to watch.  It was too preposterous and forced to be considered funny, and Hepburn's character was far more irritating bordering on infuriating than humorous.  A wild ride of unrealistic and frustrating exchanges about absolutely nothing.",
            "review_date": "2018-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching \"Bringing Up Baby\", which I've seen 3 times now, is like babysitting an annoying child who cries and screams and ignores everything that you tell him/her to do. And when you screw up something, the child will mock you for what you did and tell their parents by exaggerating it beyond belief. If you like kids, you will find all this childish behavior amusing. But if not, well, it makes you want to grab them by the neck and throw it across the room.\n\nLook, I understand its appeal and I don't consider it to be a bad film. But Hepburn's Susan drives me nuts and Grant's David is so clueless and dumb that it makes me want to pull out my hair. They may be good-looking, but I just don't care about these selfish characters.\n\nUnpopular opinion, I know. But I stand by it. One of the most annoying films in history of cinema.",
            "review_date": "2018-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Katharine Hepburn, Cary Grant, and a leopard, hey, what more could you want?\n\n'Bringing Up Baby' is a frenzy of running around, unexpected pratfalls, and clever dialog.  Don't take the movie too seriously, e.g. try to see the plot rationally, get angry at Hepburn's character for doing anything she pleases, etc - it's a screwball comedy.  She is absolutely brilliant in this movie, blending slapstick, witty repartee, and even a little 'come hither' romance in a wild, frenetic script.  She even does a mean gangster impression towards the end.  I think the issue at the box office in 1938 (and subsequent label of her as 'box-office poison'...ha!) was that she didn't fit into accepted standards of \"feminine\" at the time, which is a shame, because she's got it all here.  \n\nGrant is not so bad himself, with that suave accent in a nerdy role, finding himself helplessly drawn into Hepburn's crazy world.  He's much better here than in 1944's \"Arsenic and Old Lace\", despite the obvious comparisons.  I liked this film for both its big 'laugh out loud' moments (which still work after all these years), as well as the little things in the script and performances.  Fun and entertaining, and the two stars really make this one worth seeing.",
            "review_date": "2018-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is entertaining and silly, but the romance never really makes sense, even at the end. Most people that watch this likely aren't as concerned about the romance, so they will be sufficiently entertained. The outstanding 1972 film What's Up Doc? bears such striking resemblance to Bringing Up Baby (not coincidentally) that this film deserves much praise for defining what a screwball comedy is.",
            "review_date": "2017-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I laughed and I laughed and then I laughed some more.",
            "review_date": "2017-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Grant and Hepburn act as expected, and at times are funny, but it has the common ability for a viewer watching a comedy to realize that half of the jokes seem forced and lifeless.",
            "review_date": "2017-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The situations Hawks puts the two stars in are already funny, but with Cary Grant giving arguably his best performance and Katharine Hepburn matching his skill it is one of the best classic comedies. The plot weaves itself in a mess of humorous subplots, but its ability to tie it back to the actual plot and end on a high note is an impressive feat by the legendary filmmaker Howard Hawks.",
            "review_date": "2017-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie makes me laugh!",
            "review_date": "2017-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finished watching the other day with the family. Way too slapstick and idiotic for my taste.",
            "review_date": "2017-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although I love Hepburn and Grant this movie is simply stupid! I can see why audiences didn't like it at the time of its release. Why it gets such high acclaim now is beyond me.",
            "review_date": "2017-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The chemistry between the two protagonists is incredible, almost as incredible as the imagination of the screenwriters of what is probably the greatest screwball comedy ever.",
            "review_date": "2017-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this, and the Philadelphia Story, cemented Hepburn as the leading lady I want to meet. Charm aplenty with lots of chemistry and a story that doesn't let up until the end.",
            "review_date": "2017-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the funniest -- and best -- movies of all time. Cary Grant is a comic genius and Hepburn is charming. Great writing and directing. A classic that hasn't aged one bit.",
            "review_date": "2016-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the classics of comedy cinema for a good reason. It's been nine years since I saw this for the first time, and the fact that I remembered so much of it is telling of its quality. A must-see for any reason.",
            "review_date": "2016-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Howard Kawks' Bringing Up Baby is one of the all time great comedy films. Quirky, original, perfectly timed, and with hilarious performances from the likes of Cary Grant and the incomparable Katharine Hepburn. It has been said that Hepburn struggled with a comedy performance, but as a mark of her talent, this never shows through. And plus, any film with Baby in it is going to be a delight. Recommended for all-this film is an absolute joy.",
            "review_date": "2016-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Being a lying ditzy dumbass doesn't make her likable or quirky. Also, the character's voice is f*cking annoying.",
            "review_date": "2016-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bringing Up Baby is a brisk pleasure of the screwball comedy genre, and Mr. Grant and Ms. Hepburn are so refreshing I could watch this movie again and again.",
            "review_date": "2016-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was fine for its time. A little more slapstick than I'm into, though. I was kind of hoping for more \"It Happened One Night\" and a little less \"Laurel and Hardy Meet a Leopard\". But, eh, what're ya gonna do.",
            "review_date": "2016-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfection.  I couldn't say it better that the critical review who opined, \"how sublime can movies get?\"",
            "review_date": "2016-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the funniest screwball comedies ever. Featuring solid performances all round (including the leopard and dog), perfect timing, fast pace and a very witty dialogue, this film had me laughing on numerous occasions. My favourite film of 1938. 1001",
            "review_date": "2015-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Take one uptight, geeky paleontologist working in a NYC museum, who is desperate for research money, add one brilliant, fast-talking heiress and a deus-ex-machina leopard and you have, in a taut, fast-paced (102 minutes) the greatest screwball comedy Hollywood has ever made.  A great and timeless film, with iconic performances from Grant and Hepburn.",
            "review_date": "2015-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even with its overuse of slapstick Bringing Up Baby is still a fun screwball comedy with 2 talented leads that takes the audience on an amusing adventure.",
            "review_date": "2015-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bringing Up Baby is a screwball comedy that has a lot of laughs, even if it overuses slapstick.",
            "review_date": "2015-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A funny screwball comedy with a wonderful performance from the always wonderful Katherine Hepburn",
            "review_date": "2015-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A klutzy heiress goes through hilarious antics to keep the bumbling paleontologist she loves near her, in this charmingly funny Hawks classic. Cary Grant & the especially funny miss Katharine Hepburn have amazing on-screen chemistry.",
            "review_date": "2015-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious screwball comedy about a stuffy paleontologist who gets suckered into a crazy situation with a fast talking woman who falls for him and does everything she can to keep him from getting married...involving a leopard, a rare dinosaur bone, a big game hunter, the circus, a rich aunt, and grand theft auto...it is a comedy that never stops piling on, and it is still a hilarious movie. Grant and Hepburn are a great comedy team, and I have to check out the other movies they made together.",
            "review_date": "2015-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bursting at the seams with energy, enthusiasm, and wit, Baby is everything a screwball should be, pure unadulterated fun and bliss.",
            "review_date": "2015-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a classic screwball comedy and Cary Grant and Katherine Hepburn are just sublime. Nothing not to like about it.",
            "review_date": "2015-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Howard Hawks clever and silly little film retains a great deal of fun and a great collaboration of charisma between Hepburn and Grant.",
            "review_date": "2015-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With great onscreen chemistry and a top-notch performance from Katharine Hepburn, Bringing Up Baby is easily a screwball classic. There's an absurdness to the script, but it pays off surprisingly well. Only this film could get with Hepburn ripping Grant's coat and him subsequently ripping her dress and make it hysterically clever. Throw in two leopards, zoo control, and dim-witted policemen, and you've got a hit.",
            "review_date": "2015-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Juvenile humor: constant inane talking & adolescent physical gags. Might appeal to 3-stooges officionados. Poorly-done sets.",
            "review_date": "2015-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lovely, hilarious and charming film that's stood the test of time well. Hepburn in particular shines here and any fans of classic comedies will be swept up in the proceedings.",
            "review_date": "2015-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A complete disaster when it was released, 'BRINGING UP BABY' is screwball comedy to the extreme: absolutely absurd, crackling with dialogue moving faster than a bullet, and unapologetically zany... \"The love impulse reveals itself in conflict\"-- IT'S SUPPOSED TO BE RIDICULOUS AND MAKE NO SENSE AT ALL! THAT'S WHAT MAKES IT FUNNY... Zany. Madcap. Screwball!!",
            "review_date": "2015-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That movie was exhausting!",
            "review_date": "2015-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While Grant was at his typical level of good at his younger age, Hepburn was charming in her spirited performance that sometimes can be quite annoying but it pays off during the second half whereas the comedy got to its feet to become funnier, which justifies the worthy experience of being a 4-star film. (B+)\n\n(Full review coming soon - with better wording probably)",
            "review_date": "2014-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The screwiest of screwball comedies!  A delight from start to finish!",
            "review_date": "2014-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Film starts to wear out its welcome by the second act. Hepburn n Grant have good chemistry and Hepburn in particular is rather funny n likable in her role. I did enjoy some of the high fashion costumes in film that Hepburn can pull off. The plot is ridic and starts to drag towards the end with some of the same jokes not being as funny the 4th time around. At the time Im sure it was inventive nd hilarious n Ive seen a lot of current comedies pulling ideas from this, but nowadays its pretty tame n boring cuz weve seen it done before many times. I wouldn't watch again as its very dated and not that interesting/funny for comedy anymore.",
            "review_date": "2014-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining '30s comedy with terrible role models. Cary Grant and Katherine Hepburn make an entertaining onscreen couple.",
            "review_date": "2014-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film in which I feel as though I am going insane alongside Cary Grant's character as he is being driven that way by the character of Katherine Hepburn. This is an enjoyable romantic comedy in 1930's cinema. Hepburn meets and falls in love with Grant in this movie and does anything that she can possibly think of to keep him from marrying another woman, including making him bring a pet leopard named Baby up to Connecticut where her aunt, a woman who has a spare million dollars that may possibly be donated to the museum Grant works for. While up in Connecticut more silly and hilarious antics follows. Though Hepburn's character can be a bit annoying at times throughout the film, the mental agony that is inflicted on Cary Grant due to her behavior is undoubtedly funny.",
            "review_date": "2014-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seems like this is where it all began - the genre of mindless yet endearing comedies with an extremely lovable Hepburn. A delightful watch even in 2014!",
            "review_date": "2014-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful performances between Cary Grand and Katharine Hepburn and the comedy still holds up.",
            "review_date": "2014-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A laugh-a-minute comedy starring 2 of Hollywood's classic and most endearing movie stars. It's so silly and hilarious and so much fun to watch.",
            "review_date": "2014-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The definitive screwball comedy and one of the Thirties Greatest Films.  Cary Grant becomes the patron saint of Geeks while Katherine Hepburn is radiant as the girl in pursuit.  Essential.",
            "review_date": "2014-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The screwball comedy finally has some gags which can laugh my head off. The chemistry between Katharine Hepburn and Cary Grant is great, but they could not be without the supporting cast, plus the lovely leopard and the dog!",
            "review_date": "2014-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "my fave screwball comedy in hawk's skillful hands is just genius",
            "review_date": "2014-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hepburn and Grant are every bit as great as their legacy says in this wonderfully and hilariously absurd escapist comedy. Of course the endless screwball patter and clever slapstick works, but it's all so quietly graceful underneath its chaotic exterior. Stars hang from falling scaffolding, actors work closely with dangerous animals, political correctness is pushed aside...quite simply, this is the kind of comedy you can't make anymore, and that's truly a shame.",
            "review_date": "2014-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is ironic that this enjoyable film flopped when it was still original and now is highly regarded as a masterpiece when it is obviously outdated and full of silly gags for today's standards - and despite her great chemistry with Grant, Hepburn is more irritating than funny.",
            "review_date": "2014-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film doesn't have an actual plot, just a couple getting in trouble until they fall in love at the end, but their performances are at their finest; the film is worth watching.",
            "review_date": "2014-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amusing romantic comedy that had me smiling at times. On the other hand, Howard Hawks seems not to have understood how unsympathetic his characters were... the blithe amorality of his characters works much better in \"His Girl Friday,\" when the goal is to lampoon the cynicism of the newspaper industry. It doesn't work as well, in my opinion, when it appears in a screwball romantic comedy.",
            "review_date": "2014-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Howard Hawks, the director of \"Bringing Up Baby\", was not a name one associates with screwball comedy. Watching this perennial favorite the other night, one wishes Mr. Hawks would have made more comedies like this one because he shows a tremendous capacity for entertaining his audiences. The screen treatment, by Dudley Nichols and Hagar Wilde, made this movie the classic it became to be after not being embraced by the public when it was originally released.\n\nThe pairing of Cary Grant and Katherine Hepburn paid off handsomely. Both actors were at their best in the film. Mr. Hawks got excellent performances of his two stars. Cary Grant's paleontologist, with his glasses, and nervous energy, matches perfectly the the socialite that has designs on him. There is a high level of energy in the film that was a requirement for a movie of this genre.\n\nThe supporting cast is also one of the things that make this film the fun it is. Charles Ruggles, May Robson, Barry Fitzgerald, George Irving, and the rest of the cast do a marvelous job in the roles they created. Even Asta, the Charles' dog, made a valuable contribution to the proceedings by appearing at key moments, even fighting Nyssa, the tamed leopard that is the \"baby\" of the title.\n\nThe best way to enjoy the film is to let the magic Howard Hawks created put its spell on you. It's one of the best films of this genre.",
            "review_date": "2014-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film that all romantic comedies strove to emulate. It's doubtful you'll have a better time at the movies.",
            "review_date": "2014-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is possibly my Dad's favorite comedy ever. I saw it a ton of times when I was a kid, and I still enjoy it now. Classic screw ball comedy. All I can say is \"I can't give you anything but love, baby!\"",
            "review_date": "2014-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic slapstick with a ridiculous amount of wacky, witty humor and featuring an outstanding performance from the marvelous Katharine Hepburn.",
            "review_date": "2014-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bringing Up Baby has extraordinary performances from Hepburn and Grant and their chemistry is evident, the characters are very likable and nicely developed, the pacing is fast and hold one's attention, the story is an engaging wild road trip and it has many witty moments and lines, but something about it just doesn't feel extremely right and that is probably the fact that much of the humor relies on slapstick rather than smart lines and that the film feels weaker when compared to the other screwball comedies of the decade - The Awful Truth and The Thin Man in particular.",
            "review_date": "2014-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Delightful and classic screwball comedy featuring wonderful performances from the very talented cast.",
            "review_date": "2014-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfectly paced and structured. It delivers the laughs and entertainment with ease.",
            "review_date": "2014-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though the final 20 minutes or so fall to the usual Hollywood shenanigans, Bringing Up Baby is a hilarious joy ride resting on the strong comedic/romantic chemistry between Katherine Hepburn and Cary Grant.",
            "review_date": "2014-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't find myself particularly fond of Bringing Up Baby.  I could deal with a story that was a little too ridiculous if it backed that up with some good comedy, but the greater majority of this movie's attempts at comedy were just random pratfalls.  There were a couple of funny moments of wordplay, but you would first need to wade through nearly constant babbling from the cast of the movie that needed to express their every thought and action verbally in case the audience had chosen the wrong direction to point their seat while watching it.  I couldn't even really get behind the performances from Cary Grant and Katharine Hepburn, whose characterizations were too on the nose and annoying for me to find but a few moments of passing affection for them.  Thankfully for this movie, it's already regarded as a classic and has generally favorable reviews, so it will get by without the recommendation that I just can't bring myself to give it. \nFull Review at: http://robertreviewsstuff.wordpress.com/2013/12/12/bringing-up-baby-1938/",
            "review_date": "2013-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed this one. I didn't know Hepburn could do comedy so well. Pretty cheesy but I thought it was good.",
            "review_date": "2013-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While Cary Grant is as good as always, even he cannot save Bringing Up Baby from its annoying jokes and thoroughly stupid plot.",
            "review_date": "2013-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This old comedy is still funny and smart. The acting is excellent. Highly recommended to fans of the genre.",
            "review_date": "2013-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved these two in \"The Philadelphia Story,\" and loved the animal work.  Needed the laugh.",
            "review_date": "2013-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I remember seeing this in a class in high school and loving it. The concept is kind of ridiculous, but it works because the cast is amazing.",
            "review_date": "2013-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent screwball comedy from 1938 in complete contrast to todays CGI inspired films.\nThe simplicity of films like this should inspire cash conscious studios to update them in colour/stereo and with modern day stars.\nThe story centres around a zoology professor who after years of research is nearing the completion of his dinosaur skeleton and getting married.\nA series of mishaps brought about by his clashing with the Katherine Hepburn character put a whole series of obstacles in his way. \nI can see where 1970s and 80s TV sitcoms from my childhood such as the Frank Spencer and Mr Bean characters and escapades drew their inspiration from!\nSimple low budget comedy that is a classic.\nUpdate it for the 2013 audience now.\nThe premise is there just simple tinkering is required and you have a family friendly hit.",
            "review_date": "2013-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another top-notch Grant/Hepburn vehicle.  Wish someone could make movies like this today.",
            "review_date": "2013-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lives up to its reputation. Very definitely not what you expect from 1938.",
            "review_date": "2013-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although it isn't my favorite slapstick comedy I think that Bringing Up Baby is one of the many films that audiences will laugh out loud for. It's funny, smart, has a few plot twists that makes you even more curious as to what the hell is going to happen at the end. Both Hepburn and Grant bring amazing performances to this very smartly written comedy.",
            "review_date": "2013-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Bringing Up Baby\" is a madcap comedy about how the most annoying couple you know met.",
            "review_date": "2013-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Golden Age of Hollywood comedy at its best.  The viewer wants to smack and hug the self-ignorant Hepburn as she sets the hapless Grant on a wild adventure in pursuit of a spotted feline.  'Bringing Up Baby' keeps the laughs coming from start to finish.",
            "review_date": "2013-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic screwball comedy. It's fun watching Katherine Hepburn drive Carry Grant crazy.",
            "review_date": "2013-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all time favorites  the comedy and enter action  of the actors is classic. Something modern movies seldom even come close too.",
            "review_date": "2013-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Katherine Hepburn and Cary Grant display a remarkable chemistry in Hawks's 1938 farce. It works very, very well, and I'm not quite sure why.",
            "review_date": "2013-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was surprisingly really funny. Both Cary Grant and Katharine Hepburn nailed the screwball comedy, and everything with Baby the leopard was great.",
            "review_date": "2013-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Back in the 1930's, one of the biggest film genres in Hollywood cinema was the screwball comedy, meaning comedy with fast-talking, fast-comedic action making the film either really funny or really stupid. Bringing Up Baby, one of the decade's many screwball comedies, is one of the funniest.\n\nPaleontologist David Huxley (Cary Grant) is working on completing his dinosaur exhibit to earn a million dollar grant and even go into marriage with his female partner. While golfing with some potential business partners, Huxley is spotted by wealthy woman Susan Vance (Katharine Hepburn) who vows to marry the man herself. She tricks him into attending her home in Connecticut to help take care of her pet leopard Baby. But the real trouble begins when Baby escapes, the dog George runs off with Huxley's dinosaur bone, and a more vicious leopard escapes from the zoo, looking exactly like Baby.\n\nOther stars in the film include Charlie Ruggles as Maj. Horace Applegate, May Robson as Susan's aunt Elizabeth, Walter Catlett as Constable Slocum, and George Irving as businessman and attorney Mr. Peabody.\n\nBringing Up Baby is one funny movie. And I mean, really funny. The film is directed by Howard Hawks, which surprised me, cause he's known best for directing John Wayne Westerns (Rio Bravo and El Dorado). Hawks can do comedy as well, and Bringing Up Baby proves it.\n\nThe cast is a hoot. Cary Grant and Katharine Hepburn are spectacular together as the unlikely couple in the film. Both actors use their amazing talents and bring out the best in them, even though the two would later go into more dramatic territory in their later Hollywood years. Charlie Ruggles is memorable as the major, while May Robson is hilarious as Hepburn's aunt. Baby the leopard is also well-trained, and is just about as funny as the two leads. So is George the dog.\n\nBringing Up Baby features some of the funniest situations ever put in a film, with some pretty memorable dialogue along the way. In one sequence, when Hepburn distracts Grant from his golf game with Mr. Peabody, Grant repeatedly hollers, \"I'LL BE WITH YOU IN A MINUTE, MR. PEABODY!\" In another, when Grant is forced to wear a woman's bathrobe, and is asked about it by the aunt, Grant jokes, \"Because I just went gay all of a sudden.\" (That cracked me up, right there.) And in the finale, when just about every single character is in the slammer, mostly due to the crazy claims about the leopard, the Constable responds, \"If anyone else claims they saw a leopard I'll put you behind bars.\" Actually the entire jail sequence is one comedic, crazy, ride filled with pure craziness, particularly when Hepburn pretends to be a gangster.\n\nThe thing that makes me mad about this film is that it originally was a box-office flop. How, you ask? Well, Hepburn was difficult to work with, and her attitude caused most audiences to ignore the film. Hepburn was labeled \"Box-Office Poison\" and many directors ignored her. Hepburn finally got her big break a couple years later with The Philadelphia Story, which made Hepburn a major star, and was later called the greatest actress of all-time by the American Film Institute. That's says something when she was called poison for Bringing Up Baby.\n\nBox-Office Poison or not, Bringing Up Baby is one hilarious film, with great performances from Katharine Hepburn and Cary Grant, crazy comedic sequences, and a well-trained leopard. It's a comedy well-worth seeing.",
            "review_date": "2013-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun movie, full of energy, but not one I see myself rewatching for a long time. I never am a fan of the \"everything that can go wrong will go wrong at the worst possible moment\" kind of movie.",
            "review_date": "2013-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic, hilariously funny, and just plain perfect Bringing Up Baby shows us how to create a truly successful slapstick comedy. Katherine Hepburn and Cary Grant make the perfect unlikely duo and provide great charm and chemistry on screen. I only wish it was longer!",
            "review_date": "2013-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Bringing Up Baby\" takes a good while to get started and some of its antics are too dated to merit any laughs, but once the ball gets rolling and the jokes start getting ridiculous, then it becomes a good bit of fun, especially the finale where everything comes together. Cary Grant and Katharine Hepburn have great chemistry with one another.",
            "review_date": "2013-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny still in today's time not any vulgarity or language Must see if you're a movie buff",
            "review_date": "2013-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the many screwball comedies of the 30's and 40's. It was funny, but like many of the silent film comedies of the 20's, nothing about it stood out as being better than the competition.",
            "review_date": "2013-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By design-of-nature and my environment of upbringing, I incline to keep a sensible mind with regard of viewing films, so when a screwball comedy goes it its extreme with uper-rapid pace and madcap characters, it is pretty understandable why initially this Howard Hawks film bombed tragically by its acceptance both commercially and critic-wisely, albeit Grant and Hepburn's dedicative endeavor, a well-crafted film script and its astonishing achievement of the animal (a leopard and a dog) performance (credits to their trainers as well). But now generally hailed as a paragon comedy by consensus, I wonder maybe I was born in a wrong era. I am not saying I dislike the film, it is a tongue-in-cheek urban tale which generates unsolicited laughters abound, but the off-putting disposition of Hepburn's Susan does impede me from fully appreciating this work.\n\nThe story is a straight arrow zoology professor David (Grant) meets a scatterbrain wealthy girl Susan, who is inexplicably smitten with him, they first met in a golf field and without any context, once Susan sets her eyes on him, she is playing all the manipulative tricks to keep David from getting married and as stereotyped as it sounds, after a succession of zany slapsticks (mainly concerns finding a pet leopard and a barking dog), the two prove they really deserve each other.\n\nGrant is quite proficient in his usual orbit of a harmless gentleman with a double chin, plagued by laughter-induced mishaps when he is die hard trying to procure a million dollar donation for his museum, inconveniently the benefactor turns out to be Susan's auntie (Robson). Hepburn, never exemplifies herself as an excellent comedian, makes a great effort to match Grant's comic timing with her hotheaded whimsy, but the result is rather a hyperbole than a substantial stretch. Supporting players are basically expendable, Charles Ruggles' hunting-drivel-talking leopard-growl-mimicking dinner guest is the essence of what a bore a bourgeois boffin could be, and for whom we should all weep.\n\nHawks manages to show off some camera artifices to shot the scenes between human cast and the carnivore feline, it is still magically done although we all witnessed the CGI tiger in LIFE OF PI (2012, 10/10) with awe and amazement, I suggest a remake with swapped sex, a well-heeled young man possessed with a priggish female zoologist, I doubt anyone could take the challenge, sex equality is still a halfway deal, and it goes without saying there will be a slew of CGI beasts around them.",
            "review_date": "2013-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching the IMDb Top 250, this was #250. I found this surprisingly watchable, it was one of my first full black & white films. Therefore, it was the first time seeing both Grant and Hepburn, who was great as mischievous, troublemaking woman, that Grant's character eventually fell for, in what could probably be described as one of the earliest 'rom-coms'. It was entertaining throughout, and the humour definitely holds up 75 years on. 4 stars.\r\n\r\nhttp://toptwofifty.wordpress.com",
            "review_date": "2013-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My fav Grant and Hephburn movie",
            "review_date": "2013-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A stuffy paleontologist (Cary Grant) meets cute with a manic pixie dream girl (Katherine Hepburn). Through a bizarre string of circumstances, he's forced into helping her escort her pet leopard to a wealthy aunt's manor in Connecticut. The plot contrivances of Bringing Up Baby are absurd, but the movie is having so much fun with itself that most viewers won't care. Hepburn and Grant are both delightful and, as ever, Howard Hawks' keen direction allows plenty of room for snappy repartee. It's not quite as masterful as His Girl Friday, but it comes pretty close.",
            "review_date": "2013-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fast dialogue with spectacular actors at their best.",
            "review_date": "2013-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With some of the most frenetic dialogue I have ever seen, this oldie was definitely a comic goodie.   Imagine Who's on First for an hour and a half..  \n\nquite funny.",
            "review_date": "2013-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Proper funny and charming",
            "review_date": "2013-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cary Grant (in a pair of glasses) plays a milquetoast nerdy-nerd scientist who's been assembling pieces of a dinosaur skeleton for years.  While schmoozing a rich lady's lawyer on the golf course, he runs into Katharine Hepburn, a scatter-brained (yet attractive) lunatic who brings trouble with her wherever she goes, especially to the scientist.  For good measure, they throw a leopard named baby (whose favorite song is \"I Can't Give You Anything But Love, Baby\") into the mix and you have what might be director Howard Hawks' screwiest screwball comedy, lighter-than-air and yet heartily amusing.  If there can be any criticism (and really, it's hard to take too critical a glance at something so lightweight), it may be with Hepburn and her portrayal of Susan Vance.  The character is willfully ignorant, is mainly used as a means of advancing the comedic situations.  But in working so hard to achieve this ignorant arrogance, the film loses a little bit of it's momentum (and good will).  It's only once the film really gets rolling that Hepburn's comedic inadequacies can be overlooked (in fact, the film is almost a tale of two performances from Hepburn, the overly affected and forced first half of the performance, and the more flowing feel the performance achieves by the end).  It's an unusual film to say the least.",
            "review_date": "2013-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is such a good movie! Laugh out loud funny, it hasn't aged a bit! and Hepburn is brilliant! Loved it!",
            "review_date": "2013-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Started off fantastic, but became increasingly dated and over-the-top zany as it went on. A lot of the fast-paced dialogue was also hard to follow without subtitles.",
            "review_date": "2013-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "love this movie, just greatness",
            "review_date": "2013-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Looks like screwball comedy is not my thing. :/",
            "review_date": "2013-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Katherine Hepburn steals the show.",
            "review_date": "2013-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There was something so boring and irritating about it. Was it the characters? The plot? It's repetitive nature? Maybe it was all those things and more. I just couldn't finish it, I tried, I really did, I kept telling myself only a few more minutes, but when a movie makes you want to choke yourself you just have to stop watching it.",
            "review_date": "2013-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Katharine Hepburn's performance alone is dynamic in this comedic classic. Bringing Up Baby is comedy gold with brilliance in its ensemble. The laughter is timeless, the dialogue is crisp and, once again, Hepburn and Grant formulate a charming duo. 4/5",
            "review_date": "2013-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the screwballiest of all screwball comedies, this film is a delight! Cary Grant and Katherine Hepburn are perfect!",
            "review_date": "2013-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic screwball comedy. Grant and Hepburn are perfection in this hilarious movie made in 1938. Fast paced witty dialogue and amusing and flirtatious repartee between the two leads make this a thoroughly enjoyable movie.",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In this mile-a-minute screwball comedy directed by Howard Hawks, Cary Grant is forced to deal with Katharine Hepburn's ditsy socialite character. A Paleontologist (Grant) has been trying to assemble a dinosaur but he is missing a bone. On top of that Huxley is about to enter into an unhappy marriage and he also must impress a museum donor. The next day he meets a socialite (Hepburn) by accident and through a mix up he finds himself being taken to her home in order to help take care of a tame leopard named Baby. In the following chaos a dog buries the bone needed for the dinosaur, visitors come, Baby runs away, a wild leopard is on the loose, and the free-spirited girl finds herself falling for \"Mr. Bone.\" To complicate matters, the pair wind up in jail trying to explain their story to a quirky constable. In the end everything works out and despite the craziness, Huxley realizes he cannot live without this girl. This may not be  my favorite screwball comedy, but I would say it definitely is the zaniest and that stands for something.",
            "review_date": "2013-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have seen it with my dad its a classic film that's well written. lol love to laugh :-) would love to see it again",
            "review_date": "2013-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Conflict after conflict, I couldn't help but enjoy this classic display of hilarity.",
            "review_date": "2013-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really annoying and tiresome film with some redeeming qualities. There aren't many movie characters that have made me want to eat my own pubic hair and choke on it like Susan Vance in this one.\n\nNot just her, but almost every character in this film had some annoying qualities. Yes, it was somewhat funny and it has a certain charm, but it's not enough to make the characters bearable.",
            "review_date": "2013-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love Hepburn/Grant!  So funny!",
            "review_date": "2013-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was funny at a lot of points, thanks to the rapid, clever and razor-sharp back-and-forths between the two leading actors. Grant and Hepburn are the perfect couple to deliver dialogue like this. Their chemistry is good and their delivery is excellent. The only problem is the script. Everything is going smoothly, there are funny mix-ups, the growing frustration of the Grant-character and the growing enthusiasm of the Hepburn-character are played out perfectly, until the point in the movie where 'Baby' (the leopard) breaks loose and all characters go to hunt her. That's where the movie starts to drag terribly. The last half hour is a pain to sit through. A very disappointing ending to a promising movie.",
            "review_date": "2013-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It does get in your face at times, and even veers in annoying occasionally, but there's something about the charming ubiquitous unrealisticness of the 1930's boy-meets-girl genre that I just love",
            "review_date": "2013-01-02",
            "source": "rt",
            "lang": "en"
        }
    ]
}