{
    "rating": 8.9,
    "release_date": "1938-02-11",
    "num_reviews": 130,
    "genres": [
        "Adventure",
        "Action"
    ],
    "summary": "When King Richard the Lionheart is captured, his scheming brother Prince John (Claude Rains) plots to reach the throne, to the outrage of Sir Robin of Locksley (Errol Flynn), the bandit king of Sherwood Forest. Rounding up his band of men and eventually winning the support of the lovely Maid Marian (Olivia de Havilland), Robin accuses Prince John of treachery and, when the escaped Richard returns covertly to England, joins forces with the king to prevent Prince John from taking the crown.",
    "reviews": [
        {
            "content": "Under the expertise of Michael Curtiz, Robin Hood is a masterfully done classic with beautiful sets, charming leads, and a story which can't be beat.",
            "review_date": "2023-03-02",
            "source": "rt"
        },
        {
            "content": "The classic Robin Hood story is told in this surprisingly not outdated old school movie that still holds up to this date.",
            "review_date": "2023-01-09",
            "source": "rt"
        },
        {
            "content": "Best of Movies/TV Series Collection",
            "review_date": "2022-12-19",
            "source": "rt"
        },
        {
            "content": "Hasn't aged very well. Very hammy acting and poor audio. Still quite fun and works as a template for the improved later Robin Hood films.",
            "review_date": "2022-06-16",
            "source": "rt"
        },
        {
            "content": "There's something charmingly innocent about The Adventures of Robin Hood. It's the story we're all very familiar with, but with bright-colored costumes and whimsical performances. Errol Flynn steals every scene he's in with such bravado that you can't help but believe he's the legendary outlaw. This adaptation of Robin Hood definitely stands out among the crowd.",
            "review_date": "2022-03-07",
            "source": "rt"
        },
        {
            "content": "This is a superb movie for children and adults.  Errol Flynn and Olivia de Havilland are at their peak. The values of honor, compassion, valor all explode on the screen.  It's a fun movie, exciting, and without foul language or sex.  It is in my top five movies of all time.",
            "review_date": "2022-02-11",
            "source": "rt"
        },
        {
            "content": "The sort of wholesome, lighthearted action-adventure to which more recent classics such as Star Wars owe a great debt, The Adventures of Robin Hood is the perfect film for any family movie night.",
            "review_date": "2022-02-05",
            "source": "rt"
        },
        {
            "content": "This film *is* the Robin Hood of the screen: it's merry and witty, tender and bold, impudent, dashing and brightly clad... and an undoubted legend in its own lifetime! I recently had the chance to see it in the cinema for the first time, with the release of the remastered print, and wondered if it could possibly hold up to televised childhood memories. The joyous answer is that indeed it does. It's not only the breathtaking adventure I remembered; it's a fiery and surprisingly gentle romance that isn't afraid of laughs.\n\nIt's unthinkable, once you've seen it, to imagine this film with anyone other than Errol Flynn. Every subsequent interpreter has had to struggle to reclaim the part from the memory of his roguery and grace - and most modern 'Robin's have been handicapped by an insistence on authentic mediaeval murk and grime. In the 1930s, with Technicolour the latest craze, mud and homespun were the last thing a studio wanted. Flynn's Robin Hood sports the Lincoln green of legend and a forest as brightly coloured as a painted backdrop, and the rich furs and silks on show at Nottingham Castle are straight out of fairy-tale; or an illuminated manuscript.\n\nThe story itself is purest escapist magic. Greedy barons, a wicked usurper, a rightful king in exile, and a proud beauty in distress... and, of course, England's eponymous outlaw hero, robbing the rich to give to the poor with a jest on his lips in true swashbuckler style. The script sparkles. And the stunts, in those days before wire-fu or CGI, are all for real and still take the breath away. Flynn was in superb physical condition at the time - co-star Basil Rathbone, who played his proud opponent and would-be suitor to Marian's hand, Guy of Gisbourne, described him simply as 'a perfect male animal' - and misses no opportunity to show off his flamboyance.\n\nUnlike today's pretty-boy heroes, however, Flynn shows a surprising talent for acting with his face alone. The expressive reaction shots throughout his boudoir scene with Marian tell a different tale to the quickfire banter of his words, and, like Marian, despite ourselves we are drawn in. Olivia de Havilland, as Marian, is somewhat ill-served by her period costume - she is at her most beautiful in this scene, without her hair confined in her wimple - but together they duel their way through a classic tempestuous romance of the high-born lady and the outlaw, ultimately risking their lives to save each other. Marian is no anachronistic action heroine, but no-one, not even Robin, can keep her from what she thinks is right.\n\nAs Guy of Gisbourne, Basil Rathbone is also playing one of the landmark roles of his career, and gives a superb performance. His Gisbourne is no cardboard villain, but a clever, arrogant man, who matches wits and blades with Robin as a worthy rival, and whose courtship of Marian is not without grace. And his wily master, rufous Plantagenet Prince John (Claude Rains, in a small but well-cast part) is no fool either. He knows precisely what he wants and what he can get away with, wasting no time in bluster or empty threats.\n\nComedy of a broader nature is provided by the cowardly Sheriff of Nottingham, and by Bess, Marian's maid. But even Bess's farcical courtship with timid Much (she has buried more husbands than he has had kisses) is not without its tender moments, and perhaps only the Sheriff is entirely a cut-out figure of fun.\n\nFew people can whistle 'the theme from Robin Hood'. But the famous Korngold score, with its full orchestral depth and rousing fanfares, is as familiar today as it was seventy years ago, when it won its Academy Award. From the faultless casting through unforgettable pageantry and timeless romance to the final spectacular duel, when Robin and Gisbourne meet \"once too often\", this picture richly deserves its reputation as *the* Robin Hood on film - from which on present showing it is unlikely ever to be dethroned.",
            "review_date": "2021-12-26",
            "source": "rt"
        },
        {
            "content": "A true classic This Drama I highly recommend it if you're a fan of Cinema in general and is the best retelling of Robin Hood we will ever get",
            "review_date": "2021-11-16",
            "source": "rt"
        },
        {
            "content": "Apart from Errol Flynn's charisma and a few stunts that are mind-boggling for 1938, the film seems a bit dated and doesn't quite hold up to modern standards.",
            "review_date": "2021-10-24",
            "source": "rt"
        },
        {
            "content": "Fun for all ages. Enjoyed watching this movie as a kid and will be happy to show my kids this movie in the future. Fun and funny.",
            "review_date": "2021-04-13",
            "source": "rt"
        },
        {
            "content": "Michael Curtiz's direction and Errol Flynn‘s performance make this one of the greatest films of the golden age of Hollywood.",
            "review_date": "2021-04-06",
            "source": "rt"
        },
        {
            "content": "My all-time number one movie. All star cast of characters including Errol Flynn, Olivia de Haviland, Basil Rathbone, Claude Raines, Alan Hale, and more.",
            "review_date": "2021-04-02",
            "source": "rt"
        },
        {
            "content": "Imagine being a ten-year-old kid in 1938 and strolling into a movie theater to watch this. The massive sets and clanging swords, brought to life in stunning Technicolor, it could and did blow minds and pushed the limits of what an adventure film could be, even if Flynn was relatively familiar and the adaptation of the classic source material was relatively conventional. There isn't as much of a storytelling flair here as you might expect; take the archery competition - John's men deviously scheme it for the audience, and then the film just cuts to the competition itself. There's nothing in the way of preparation or deliberation, everyone knows there's an archery competition incoming so that's where we jump to. But this predictability and lack of imagination is largely compensated for by the visuals, atmosphere, and soundtrack, which are so vibrant and rich that nearly a century has not dimmed their classic appeal. (4/5)",
            "review_date": "2021-03-11",
            "source": "rt"
        },
        {
            "content": "Good acting, scenery, storyline robbing from the rich to give to the poor. Man's movie with a love story. It's worth a one time watch.",
            "review_date": "2020-12-30",
            "source": "rt"
        },
        {
            "content": "While no Robin Hood retelling will ever overtake the Disney animated version, my favorite in the entire catalog, this one does a commendable job in capturing my preferred tone for this hero, a playful seriousness, that allows the action and dialogue to remain lighter while not sacrificing anything in the commitment to the importance of the overall theme. It is also always amazing how quickly movies went from grainy pictures and no sound to this example from 1938 of fast action and eye popping colors.",
            "review_date": "2020-10-27",
            "source": "rt"
        },
        {
            "content": "I've seen so many Robin Hood movies and I know that this is the original Robin Hood movie but I've seen this story before. Nothing special.",
            "review_date": "2020-08-30",
            "source": "rt"
        },
        {
            "content": "A terrific movie and even better than I remember. Errol Flynn is decidedly up to the challenge of playing daredevil, lover and scoundrel. And Olivia deHavilland always gives a great performance. Set decoration is outstanding. Early on there is an action scene inside a castle great room, it includes an absolutely huge fireplace where men are roasting a full-size deer. Not only is the rest of the set truly enormous, but all of this was done before CGI! The sound stage must have been the size of an airplane hanger! With an excellent supporting cast, it is no wonder the movie was a huge box office hit. In addition, this a family movie. Bad guys die with arrows in their chests, but the only blood you see is on a deer that is slain for food and, even then, if you blink, you miss it.",
            "review_date": "2020-08-29",
            "source": "rt"
        },
        {
            "content": "One of the most fun adventure films I’ve seen and easily the best Robin Hood. The cast is great, the action is fun, and the story is classic. I highly recommend it.",
            "review_date": "2020-08-11",
            "source": "rt"
        },
        {
            "content": "The 2 stars are electric. A lot of fun.",
            "review_date": "2020-08-04",
            "source": "rt"
        },
        {
            "content": "Good version of the often told story.",
            "review_date": "2020-07-23",
            "source": "rt"
        },
        {
            "content": "Yes it is dates, over 80 years old now, but if you put the movie in context of the time it was made, and the technology available it really is an enjoyable and well done film.  It really does hold up well after all these years and is a fun adventure.",
            "review_date": "2020-06-11",
            "source": "rt"
        },
        {
            "content": "The movie holds up well even 80+ years later.",
            "review_date": "2020-06-10",
            "source": "rt"
        },
        {
            "content": "The technicolor look is astonishingly good, and makes modern adventure films look like artificial garbage. That being said, this doesn't hold up too well in story and ideals.",
            "review_date": "2020-04-22",
            "source": "rt"
        },
        {
            "content": "I used to watch this every time it would play on TV when I was a child. Loved the Robin Hood story and swashbuckling action scenes. Errol Flynn was at his charming rogue best.",
            "review_date": "2020-02-04",
            "source": "rt"
        },
        {
            "content": "When I was twelve I saw Pirates of the Caribbean: The Curse of the Black Pearl (2003) and was extremely underwhelmed as the film had an overcomplicated plot and featured characters lacking in any depth. Where that film failed this timeless 1938 classic succeeds as it features perhaps the definitive swashbuckler leading man in Errol Flynn and makes a strong argument for the use of Technicolor. It is very easy to fall in love with the film as it is relentlessly entertaining and refreshing in how straightforward it is as it does not attempt to reinvent the wheel but does what has been done before exceptionally well. Unlike later imitators like Ivanhoe (1952) it is still a rousing piece of entertainment and would still bring joy to youth audiences today with it's optimism and simplicity.\n\nIn the late 12th century the honorable King Richard the Lionheart, Ian Hunter, who is devoted to helping the poor and disenfranchised is taken hostage by Leopold V, Duke of Austria and if the English want him back they will have to pay a ransom. In his place his treacherous and corrupt brother Prince John, Claude Rains, ascends to the throne and begins to steal from the poor for his own gain and force them to pay high taxes. The man who defends the poor is Sir Robin of Locksley, Errol Flynn, who steals from the rich and gives to the poor but he faces opposition and in trying to win the heart of Maid Marian, Olivia de Havilland, he must teach her about inequality. He earns a victory in an archery tournament meant to lure him to his execution but when he arranges with Marian to have the King saved she is imprisoned and he must find the King and help him take his rightful place on the throne before it is too late.\n\nThe look of the film is extraordinary as the vaunted bright colors produced by Technicolor are on full display here and it allows the film to be more memorable than most from this era. While later iterations of this story would adopt a cold, blue sepia tone that did not allow for the inherent fun and wackiness of the situation to be exploited. The brightness of this film matches it's innocent tone and sense of freewheeling adventure as it allows for the loveliness of a young de Havilland to be highlighted and the bright fabric of their costumes to come to life. To an adult audience it will be immediately clear that the film has been shot on a studio back lot and an orchard owned by the studio somewhere out in California but this artificiality does not really matter. While watching the film you can revert to feeling a sense of childlike wonderment with the larger than life characters and fantastical locations.\n\nWhat the film also benefits from is smart writing as unlike Ivanhoe it follows the very simple story of a man with socialist ideals facing off against an evil villain who saves the day and gets the girl. It helps that all of the characters proclaim their feelings without reservation and seem to exist in a world where moral grey area does not exist. If performers without the force of personality of de Havilland or Rains had inhabited these roles they might have seemed flat and lacking but they are each aware of what sort of film they are in and play to their strengths wonderfully. She is all doe eyes and breathless proclamations and he plays the type of stern elder statesman who would become his bread and butter in later years. Flynn is not an actor I am enamored of but he fits into this film nicely and for the low bar that he has to jump over with all of the excellence around him he is quite competent. It is easy to see why de Havilland Flynn made so many films together, eight in total, as they have wonderful chemistry and her potential as a great dramatic actress shines through in many of their romantic scenes.\n\nI can't recommend this film enough as while it is hardly important in terms of it's content it stands up as one of the best swashbuckler pictures ever made.",
            "review_date": "2019-12-12",
            "source": "rt"
        },
        {
            "content": "The greatest version of Robin Hood!\n\nMichael Curtiz' swashbuckling adventure classic The Adventures of Robin Hood (1938) remains my favorite incarnation of the Saxon lord robbing the rich and giving to the poor. \n\nErrol Flynn portrays the green hooded archer Robin of Locksley as a charming and charismatic leader and loyalist to King Richard the Lionheart. Flynn is the quintessential actor for Robin Hood due to his amiable attitude, dazzling swordplay, and astonishing archery. Basil Rathbone is sublimely entertaining as Sir Guy of Gisbourne as the villain with his hard glares and disdainful misgivings.\n\nOlivia de Havilland is lovely and enchanting as the heroine Maid Marian. She uses her hopeful eyes to display a fervent amour for Robin Hood, a respectful admiration for Hood's good deeds, and a distrustful disgust at Prince John's treachery and ambition. Speaking of Prince John, Claude Rains is funny as the dastardly monarch, who reign of cruelty terrorized England in the Medieval Ages. \n\nMichael Curtiz' direction features all manner of innovative direction and thrilling action that makes this shorter film feel only a half hour long. From long range arrow shots, splitting arrows, sword fights down staircases, to shadows duelling, Curtiz' style leaps from the screen into your imagination. Combined with Erich Wolfgang Korngold's sweeping romantic score, The Adventures of Robin Hood is a treasure chest of delights.\n\nIn all, The Adventures of Robin Hood is a pleasant time with every viewing no matter how many times I return to Sherwood Forest.",
            "review_date": "2019-11-28",
            "source": "rt"
        },
        {
            "content": "  What's not to like? Brilliant colors. Rousing story. Olivia De Havilland.\nDashing Flynn in the definitive swashbuckler, winning hand of de Havilland (never lovelier as Maid Marian), foiling evil prince Rains, dueling wicked Rathbone. Erich Wolfgang Korngold's outstanding score earned an Oscar, as did the art direction and editing. Scripted by Norman Reilly Raine and Seton I. Miller. Arguably Flynn's greatest role.",
            "review_date": "2019-08-18",
            "source": "rt"
        },
        {
            "content": "So so so good!!!  For a movie like this to work you need a great villain and Basil Rathbone is very great!  Lots of great dialog, including one of my all time favorites.  Marion: why, you speak treason!!  Robin: Fluently!!",
            "review_date": "2019-08-02",
            "source": "rt"
        },
        {
            "content": "Simply beyond criticism",
            "review_date": "2019-08-01",
            "source": "rt"
        },
        {
            "content": "Amazing old-fashioned techni-coloured romp. Fantastic light hearted fun",
            "review_date": "2019-05-13",
            "source": "rt"
        },
        {
            "content": "A really fun, fast pace adventure with only a few technical flaws here and there",
            "review_date": "2019-03-28",
            "source": "rt"
        },
        {
            "content": "The Adventures Of Robin Hood is truly a influence worthy noting of action, adventure and the all-around hero of Errol Flynn",
            "review_date": "2019-02-21",
            "source": "rt"
        },
        {
            "content": "Not a fan of these kind of movies, but this version of Robin Hood is watchable from beginning to end.  Flynn was an excellent choice and makes this movie.  Why didn't they show this to us when we were kids?  The version I saw was not very good.  The technicolor seems off -- not real -- but that is my only criticism.  An interesting myth told in an interesting way that grabs your attention and keeps it.  That's what a movie should do.",
            "review_date": "2019-02-09",
            "source": "rt"
        },
        {
            "content": "The best, GREATEST thrilling and inspiring movie ever made! With 2 of the best movie characters ever portrayed: Errol Flynn as Robin Hood and Basil Rathbone as Sir Guy of Gisbourne!",
            "review_date": "2019-01-26",
            "source": "rt"
        },
        {
            "content": "This film has a special place in my heart. I love it when every character is larger than life. It also reminds you how much presence a good voice can lend to an actor whether your part is big or small. Fun fact: Rathbone and Flynn were both accomplished fencers and this is why they are so engaging. In fact, they would often do their scenes so fast it danced on the edge of becoming truly dangerous. Real quick though, Olivia de Havilland did not hate Errol Flynn. She was head over heels for him for quite some time and they ended up doing something like 9 films together. I think she discusses this in her autobiography. Errol Flynn also fell for her at one point but due to his reputation as a known lothario and their working relationship, he never acted on it. A classic tale of ships passing in the night.",
            "review_date": "2019-01-04",
            "source": "rt"
        },
        {
            "content": "Can any other film come close to the swashbuckling charm of this classic? Perhaps, but not close enough to diminish its charm or remove its place as the greatest Robin Hood tale to grace the silver screen.",
            "review_date": "2018-12-16",
            "source": "rt"
        },
        {
            "content": "Best Robin Hood Movie",
            "review_date": "2018-12-07",
            "source": "rt"
        },
        {
            "content": "simple yet fun the adventures of robin hood is a film that shows the best quality of robin hood making it a benchmark for an robin hood story.",
            "review_date": "2018-10-26",
            "source": "rt"
        },
        {
            "content": "best of Errol Flynn / Olivia de Havilland movies - great swashbuckling",
            "review_date": "2018-08-25",
            "source": "rt"
        },
        {
            "content": "Great chick flick!! ",
            "review_date": "2018-06-18",
            "source": "rt"
        },
        {
            "content": "One of Flynn's best.What great talent on screen and it translates into the best Robin Hood movie ever made.",
            "review_date": "2018-06-17",
            "source": "rt"
        },
        {
            "content": "Although I’m not for old-fashioned movies Robin Hood was pretty good nice fairytale ",
            "review_date": "2018-04-12",
            "source": "rt"
        },
        {
            "content": "It was such fun. Hardly had a dull scene. Definitely recommended.",
            "review_date": "2018-01-21",
            "source": "rt"
        },
        {
            "content": "A fun old movie full of energy and awesome fights.",
            "review_date": "2017-12-29",
            "source": "rt"
        },
        {
            "content": "Such a wonderfully vibrant and good-natured film. Curtiz and Keighley direct the tis endeavor with great panache, style and a sense of adventure. One of the best of the swashbuckler subgenre.",
            "review_date": "2017-12-26",
            "source": "rt"
        },
        {
            "content": "Very clever dialogue in this movie. The set pieces are wonderful, each brimming with life and they take you back directly to that time. A time when things were unfair and kings killed people just for speaking their name wrongly.\n\nClaus Rains plays a vicious, evil,  and corrupt king. But it's very hard to not like him even a little bit, what not with his charm and his humor. Robin Hood, as we all know, is the man of the people. But seeing him in action, was great.\n\nAwesome choreography of sword battles and arrows. And amazing stunt work. Especially when Robin Hood climbs the castle walls. This movie makes we want to live in a castle, own a horse, and learn archery.\n\nIt was a truly surprising seeing a fat wield a sword like a general does. He was quick and abled. This movie is so charming and lovable, it's hard not to watch it. There was something really special in the scene where Robin Hood and Marian see each other in the castle. There's this explosion of chemistry between the two and seeing it in color, instead of black and white, was a real treat. The actress who plays Marian, let me tell you, she a looker, for sure.\n\nI love how it ended. Nothing like good ole' justice being served and everything going back to the way things were - good and just.\n\nOverall, terrific movie with an awesome cast of characters, great story, and terrific stunts and choreography. Robin Hood shows us the importance of what it means to do good. We can all learn from his doings and hope that one day we will all have the leadership qualities such as Robin Hood's.",
            "review_date": "2017-12-25",
            "source": "rt"
        },
        {
            "content": "The best adaption of Robin Hood! Everything about this movie is amazing. From the vast beautiful locations to the colorful outfits. The stunts and fight choreography are stunning an leave you in awe. The dialogue is witty and fun. The actors bring life to the characters and make you believe they are the character.   It's a movie that will fill you with joy and awe.",
            "review_date": "2017-12-22",
            "source": "rt"
        },
        {
            "content": "A splendid and blindingly colorful film about the Saxon hero Robin Hood. This rendering is no doubt definitive in cinematic history.",
            "review_date": "2017-11-06",
            "source": "rt"
        },
        {
            "content": "The Adventure Of Robin Hood is an excellent 1930's era adventure movie, as stated in the title. Errol Flynn's potrayal of Robin Hood as become iconic and the basis for every movie incarnation of the character after this film. The only weakness is the plot, which is pretty linear and thin, but it doesn't being down this movie.",
            "review_date": "2017-09-24",
            "source": "rt"
        },
        {
            "content": "Best adventure film of all time. The cast is perfect and the story dont let down for a second.",
            "review_date": "2017-09-11",
            "source": "rt"
        },
        {
            "content": "Wonderfully done in Technicolor. Beautiful costumes. Albeit boring by today's standards, it was the first Robin Hood film of this caliber.",
            "review_date": "2017-08-27",
            "source": "rt"
        },
        {
            "content": "Wow, for star power, it's hard to beat Errol Flynn as Robin Hood and Olivia de Havilland as Maid Marion.  Flynn had the perfect devil may care attitude for the part of Robin, and his impudence towards the pretender to the English throne is fantastic.  de Havilland is absolutely stunning and plays her part well as the noble who is offended by Robin at first, but is then slowly won over to his humanity and righteousness.  The movie features all of the standard sorts of things we've come to expect in productions of Robin Hood - camaraderie, swordplay, honor, and daring escapes, among other things.  I loved the stunts, including Flynn cutting the rope to a gate, and then being pulled upwards by its pulley in order to get over it while leaving his pursuers trapped on the other side.  The cast is strong throughout, from the main villains (Basil Rathbone and Claude Rains) to charming characters like Marion's old nurse, played by Una O'Connor, who has a little romance of her own.\n\nThe film is in color and quite a production for 1938, really showing how far movies came over the course of the 1930's.  I loved the costumes from Milo Anderson, particularly those for the 22-year-old de Havilland, who directors Curtiz and Keighley wisely took every opportunity to shoot close up, allowing her beauty to shine, and her eyes to display fear, annoyance, anger, and love.   Her scenes with Flynn are magical.  The only thing I fault the film for is the soundtrack, which I found too jaunty and intrusive, even for scenes which had a lot of action in them, but that's a bit of a quibble.  The only reason I don't rate it higher is because the story itself has been done so often that it's lost its shine for me personally, but if classic adventure stories with romance in them are your thing, I think you'll love this film.",
            "review_date": "2017-07-28",
            "source": "rt"
        },
        {
            "content": "True to the source and charming, Robin Hood brings the titular character to life in sweeping swashbuckling manner.",
            "review_date": "2017-07-24",
            "source": "rt"
        },
        {
            "content": "Michael Curtiz's classic, 1938 all-colour swashbuckler is a merry romp that's something of a prototype for the modern action blockbuster with its witty hero, rousing set-pieces and hissable villains (Claude Rains and Basil Rathbone) in memorable form.  With lightning-fast pace, cheeky humour and glorious technicolor abound, this is golden age Hollywood entertainment in full swing, epitomised by an exuberant Mr Flynn as the screen's most endearing Robin Hood.",
            "review_date": "2017-07-16",
            "source": "rt"
        },
        {
            "content": "Definitely the best Robin Hood film of all time. The witty banter, character development and moral lessons make this a feel good movie for the ages. But still plenty of action for those of us that want it.",
            "review_date": "2017-06-06",
            "source": "rt"
        },
        {
            "content": "Claude Rains is the devilishly fun standout performance of this swashbuckling classic as the primary antagonist Prince John.  Olivia de Haviland is the most beautiful image to ever don the seat by John, Maiden Marian.  And Errol Flynn simply is Robin Hood.  Add them altogether, along with beautiful direction, mainly from directing great Michael Curtiz, in glorious technicolor, and this is my favorite iteration of the oft told Robin Hood tale.",
            "review_date": "2017-04-15",
            "source": "rt"
        },
        {
            "content": "Your standard to making swashbuckling adventures.",
            "review_date": "2017-04-09",
            "source": "rt"
        },
        {
            "content": "For me this is the original action movie.",
            "review_date": "2017-01-20",
            "source": "rt"
        },
        {
            "content": "outstanding acting, perfect cinematic atmosphere. Genuine hate from Rathbone to flynn",
            "review_date": "2016-12-06",
            "source": "rt"
        },
        {
            "content": "Classic movie. Childhood favorite. The good guy is awesome and the bad guy is despicable. What more can you ask for? :-)",
            "review_date": "2016-09-29",
            "source": "rt"
        },
        {
            "content": "A role made iconic by Errol Flynn, \"The Adventures of Robin Hood\" does the Old English legends it's based on plenty of justice, and then some.",
            "review_date": "2016-04-26",
            "source": "rt"
        },
        {
            "content": "Wow. True escapism in true Hollywood style! Nothing is real, nothing factual, and nothing thrills more! Again, Hollywood at it's best, a romantic, thrilling romp through the romanticised eyes of a genre that cannot be bettered. Flynn is great and nobody could buckle his swash as he could. Tremendous.",
            "review_date": "2016-04-16",
            "source": "rt"
        },
        {
            "content": "1938's ''The Adventures of Robin Hood'' is after almost 80 years of possible improvement, still the very best Robin Hood film, in fact it is one of the greatest films of all time. \nIs the acting campy? Yes, most certainly but so is the acting in King Kong (1933) and The Wizard of Oz (1939) and those 2 are also considered some of the greatest movies of all time. The campy acting is in my eyes certainly not a flaw, i think the campy acting we had in old movies is only a good thing, it reminds us of how innocent and unexperienced Hollywood was back in the day, and i think that's a beautiful thing that should be treasured.\nAside from the hammy acting, i personally think it's a flawless film, the script is perfect, simple, exciting and emotional, the art direction is top notch, so are the costumes, and music is supportive and beautiful, the stunts and choreography is spot on, the set pieces are enthralling, so are the fun characters, and the pacing is fast to keep the movie going. (especially for a movie that's almost 80 years old, this is one of the most modern, old movies i've ever seen)\nThe innocence of The Adventures of Robin Hood is delightful, this really is a timeless movie for all ages, kids of today could easily enjoy a movie like this too, and not fall asleep. The Adventures of Robin Hood is such a fresh, fast-paced exciting film, it really is something special.\n\nSay what you want about The Adventures of Robin Hood and how campy it may be. In my eyes it's one of the best movies of all time.",
            "review_date": "2016-04-01",
            "source": "rt"
        },
        {
            "content": "Sorry but all i could think of while i was watching this was Robin Hood Men in Tights!!",
            "review_date": "2016-03-16",
            "source": "rt"
        },
        {
            "content": "Marvellous Hollywood epic that epitomises everything that was great about the golden age . Fabulous music, a visual feast and stars when they were really stars, Errol Flynn at his action hero height , the noble thief who has the highest principals and fights for the common man against the wicked King pretender and his thuggish Barons. Shot entirely in Hollywood and with the sheen of those magical historical dramas of yesterday year , men in tights and all. A feast for the senses , a ripping yarn and a must watch which stands the test of time.",
            "review_date": "2016-03-06",
            "source": "rt"
        },
        {
            "content": "http://filmreviewsnsuch.blogspot.com/2016/03/the-adventures-of-robin-hood.html",
            "review_date": "2016-03-03",
            "source": "rt"
        },
        {
            "content": "In every respect, casting, performances, script, directing, music and cinemetography, this film is an all-time masterpiece. It lives on I to the 21st Century as one of the very best ever. If I had to choose one film to demonstrate what the art of cinema can be at its peak, this would be the one.",
            "review_date": "2016-03-02",
            "source": "rt"
        },
        {
            "content": "This is by far my favorite movie, ever",
            "review_date": "2016-02-24",
            "source": "rt"
        },
        {
            "content": "How can anyone who loves movies not love this one.",
            "review_date": "2016-01-21",
            "source": "rt"
        },
        {
            "content": "Una peli de acción promedio, personajes cliché, actuaciones encasilladas, acción poco creible, producción, guión predecible y muchísimas risotadas gratuitas y forzadas.\n\nY aún con todo, una peli genial que da gusto ver, acabas con una gran sonrisa tras disfrutar un buen rato y yo diría que esa es la finalidad del cine de aventuras, independientemente de la era de su filmación.\n\n... esto es la Waterworld o Last Action Hero de los años 30 :D",
            "review_date": "2016-01-17",
            "source": "rt"
        },
        {
            "content": "A high school play with a big budget; this movie will have you wishing they'd taken from the length and given to the trash bin. The story drags, the acting is bad, the dialogue is shallow, and the fight scenes are lame. This is another curious entry into Rotten Tomatoes Top 100 Films of All Time list.",
            "review_date": "2016-01-16",
            "source": "rt"
        },
        {
            "content": "Here we have brave feats of derring-do by Robin Hood (Errol Flynn) and his band of merry men (including Alan Hale as Little John and Eugene Pallette as Friar Tuck).  Their bravery is for a good cause: protecting the poor Saxons from wicked Prince John (Claude Rains) and Sir Guy of Gisborne (Basil Rathbone).  And even though eyes are being poked out and ears cut off by the bad guys, this is still exhilarating and fun, as Robin's rebelliousness is charismatic and cheeky rather than angry.  Of course, the good guys do not always come out on top, but Maid Marian (played by Flynn's usual love interest, Olivia de Havilland) is on hand inside the castle to help them escape.  Director Michael Curtiz (stepping in after William Keighley was let go) keeps things moving at a good clip, such that one fabled episode after another comes rollicking through.  Both the Technicolor and the frequent swordplay are eye-popping as well and you really cannot go wrong if you are looking adventuresome thrills.  Hollywood at its best.",
            "review_date": "2015-12-15",
            "source": "rt"
        },
        {
            "content": "Saw this as kid! Surprisingly enjoyable!",
            "review_date": "2015-12-01",
            "source": "rt"
        },
        {
            "content": "This film is the 1930s version of an action film, and it delivered. The sword fights in it were second to none, and the final battle gave me chills. I loved the mix of comedy and drama. I really did have some hearty laughs thanks to the banter between the characters, and I also tensed up in the more dramatic moments because I didn't know what would happen next. What surprised me most was how much Disney stole from this film when they made their animated version of Robin Hood. That movie copies several scenes from this one beat-for-beat. I've always been fond of that particular version of the Robin Hood story, and I think that translated into some extra love for this one. The stars of the film deserve a special mention. Errol Flynn is like Tom Cruise, as he is suave and charming, but also game to participate in some intricate stunts. Olivia de Haviland is lovely, and brings some strength to a character that might otherwise be your typical damsel in distress. Basil Rathbone is a perfect counterpoint to Errol Flynn, as he has equal measures of charm and athleticism. Finally, Claude Rains plays Prince John perfectly, as a weasely man who will stop at nothing to assume the throne. Needless to say, I quite enjoyed The Adventures of Robin Hood. There were moments when I thought it spent a bit too much time in exposition where none was needed, but I think that was merely the style of movies from the era. I'd recommend this to fans of classic cinema and those who are interested to see the origin of true swashbuckling action.",
            "review_date": "2015-09-22",
            "source": "rt"
        },
        {
            "content": "I've seen so many Robin Hood movies and I know that this is the original Robin Hood movie but I've seen this story before. Nothing special.",
            "review_date": "2015-08-10",
            "source": "rt"
        },
        {
            "content": "Great way to spend a Sunday  afternoon . \nDidn't want it to end. Every cast member was perfectly fitted for their role. Olivia was so beautiful and Earl as cocky as ever. With little in special effects.\nComing up shortly to 70th anniversary and it holds up well.",
            "review_date": "2015-08-02",
            "source": "rt"
        },
        {
            "content": "I have seen this film on several occasions throughout my life, but those viewings were long ago and I may have fallen asleep during some of those viewings. I guess there was nothing really memorable about the movie for me to be excited for when I watched it recently, and that still holds true (I watched the whole film this time, don't worry).\n\nFor one thing, the plot is extremely simple, and to add to the filmmakers wanting to make things clear for the audience, at several points in the movie a paragraph of text is displayed to explain what is going on in certain aspects of the story. Don't worry guys, we can follow this plot. The king of the nation goes missing, and his brother John is trying his best to take the throne for himself. He begins to tax the poor even more to collect a \"ransom\" since word is spread that the king has been kidnapped, but really this is a way for him to buy his way to power.\n\nOn the other hand we have the hero, Robin Hood, an outlaw who for the sake of the use of color in the film is often seen wearing very bright green clothing (and tights). It would make sense for him to dress more raggedly like his followers, but I think at one point it is stated he was a nobleman. This character recruits people of the lower class to reclaim the money Prince John is stealing and return it to the true king, Richard.\n\nWith a large set for the castle and many extras, the best moments of the movie are the swashbuckling scenes in the castle, well- choreographed to get the most action they can into the frame. Not to say the action is amazing, but that it was well-done for when this film was released.\n\nOverall this was a pretty average film, very simple but fun to watch at points, and never too violent - I don't think a single core character is killed in this film. This film would be a great way to introduce kids to \"older\" movies.",
            "review_date": "2015-07-26",
            "source": "rt"
        },
        {
            "content": "Still the definitive, and best, Robin Hood movie. 77 years after its\nrelease, the 1938 version still has no peers. (Second best is the 1973\nanimated version).\n\nAccurate to the legend of Robin Hood, and starring the ultimate action\nstar, Errol Flynn, this movie is a rollicking adventure. Complete will\nall the characters you know - Prince John, Sir Guy of Gisbourne, Lady\nMarion, the Sheriff of Nottingham, Little John, Will Scarlett and Friar\nTuck. Pretty much has the story of Robin Hood I remember as a kid, and\nnot some re-envisioned, rebooted, made-up plot.\n\nErrol Flynn is great in the lead role - every bit the swashbuckling\nhero. Good support from Olivia de Havilland (as Lady Marion), Claude\nRains (as Prince John), Basil Rathbone (as Sir Guy of Gisbourne) and a\nhost of others.\n\nAnother standout feature is the costumes.  Very well done and they work well with the colours of the movie.  Lady Marion's outfits are particularly good.\n\nOnly sour notes are the performance of Ian Hunter as King Richard - it\nfeels a bit weak, especially for a king - and the some scenes feel a\nbit clumsy. Those scenes are probably more due to the aging of the\nmovie - what was quaint then isn't necessary quaint now.\n\nAn action classic.",
            "review_date": "2015-07-12",
            "source": "rt"
        },
        {
            "content": "Classic adventure film that remains one of the best ever produced along with being the best version of the Robin Hood story to date.  Errol Flynn is superb in the title role, capturing the fun of Robin Hood along with a bit of his ego (more than once, it gets him in trouble) while romantically matched by the great Olivia de Havilland, who brings the perfect mix of intelligence & beauty to Maid Marion.  The get a great pair of villains to face off against, with Basil Rathbourne being a physical match for Flynn as Sir Guy of Gisbourne (the final duel is one of the great sword-fights in film history) while Claude Rains brings a charming menace Prince John.  Behind the camera, Michael Curtiz & William Keighley craft a lavish epic, shot in beautiful Techni-Color, with some of the best action & stunts ever filmed (more impressive today since they had no CGI to fall back on) & gorgeous sets.  The story does an excellent job interweaving the many Robin Hood tales, from meeting Little John to the archery competition, while wisely sticking to the true character, one who rebelled against an unjust government's oppressive taxes & regulations over 'robbing the rich to give to the poor' (he has more in common with the Founding Fathers than any socialist/communist).  To date, still one of the finest films Hollywood has ever produced.",
            "review_date": "2015-06-05",
            "source": "rt"
        },
        {
            "content": "My all time favorite movie ever",
            "review_date": "2015-05-21",
            "source": "rt"
        },
        {
            "content": "The kind of exciting, light-hearted, swashbuckling adventure story that Hollywood doesn't tell anymore. It's theatrical, over-the-top, and totally unapologetic.\n\nMichael Curtiz and William Keighley direct this action-packed family tale with so much heart that it's difficult to watch it and not smile. This is the perfect adventure film.\n\nAlso, Hollywood hasn't given us a movie star quite like Errol Flynn since. He wasn't exactly an Oscar contender, but he did exactly what a movie star is supposed to do: he lit up the screen. You look at him in this role and you just know that he's the hero. I don't know anything about him as a person, but his adventurous on-screen persona never ceases to enthrall. Modern audiences may not know his name, but his legacy has left an immovable mark on movie history.\n\nOverall, this is a movie that is about something. It's heroes aren't exactly humble, but they do strive for peace, goodness, and equality. This is a fun and family-friendly Hollywood classic with a constant sense of wonder, and some of the finest sword fights ever put to film. I couldn't have possibly enjoyed this movie more.",
            "review_date": "2015-05-20",
            "source": "rt"
        },
        {
            "content": "Robin Hood is the film that film directors even today would be jealous of making.",
            "review_date": "2015-03-20",
            "source": "rt"
        },
        {
            "content": "Classic! I grew up watching this film on WGN's Family Classics, hosted by Frazier Thomas. This is such an awesome film. Errol Flynn, Basil Rathbone and Claude Raines. A great adventure!",
            "review_date": "2015-03-02",
            "source": "rt"
        },
        {
            "content": "Taking advantage of his brother's imprisonment, Prince John (Claude Rains) allies with the Normans, seizes the throne, and levies stern taxes upon the oppressed Saxons under the pretense of \"collecting ransom for the king's safe return\". The only nobleman who stands in his way is Sir Robin of Loxley (Errol Flynn) and his small army of merry brigands. Freely adapted from the European folklore compiled by Howard Pyle, The Adventures Of Robin Hood boasts a cheeky script, colorful costumes, elaborate action scenes, excellent production values, keen cinematography, fun character actors, and a rousing score by Erich Korngold. This movie is an early highlight of Hollywood action cinema and it's hard to dislike its Technicolor swashbuckling.",
            "review_date": "2015-02-27",
            "source": "rt"
        },
        {
            "content": "Every now and again it's nice to revisit a pure, old fashioned swashbuckling adventure without the post-modernist winks and nudges you can expect today, and this campy, technicolour adaptation of the popular folklore is certainly a stellar example as to why. Innocent and bustling with charm and joy thanks to the amiable Errol Flynn, The Adventures of Robin Hood is harmless fun.",
            "review_date": "2015-02-22",
            "source": "rt"
        },
        {
            "content": "Super, awesome, delightful! Errol Flynn is the ideal Robin Hood. The costumes and the make up may be a tiny bit hilarious, technicolor makes it look like a work of art and a vision that every passionate film maker would strive to measure up to.",
            "review_date": "2015-01-30",
            "source": "rt"
        },
        {
            "content": "Excelente film de aventuras.",
            "review_date": "2015-01-18",
            "source": "rt"
        },
        {
            "content": "Great adventure film with Errol Flynn playing Robin Hood.  The Technicolor looks absolutely stunning and it's hard to believe the film is over 75yrs old considering how great it looks on Blu-ray.  If you've never seen this film, it is most definitely a MUST watch!",
            "review_date": "2015-01-03",
            "source": "rt"
        },
        {
            "content": "One of the all time great swashbucklers? Yes. Has it aged well? Not really. Though that doesn't stop it from being one of the best films ever made. Flynn was at his thigh slapping/belly laughing best with the role and Basil Rathbone and Claude Rains chew the scenery as Guy of Gisbourne and Prince John.",
            "review_date": "2014-12-30",
            "source": "rt"
        },
        {
            "content": "This swashbuckling film might be short on character but makes up for it with adventure & choreography. The dancing sword finale between Flynn & Rathbone alone makes this film a must-see.",
            "review_date": "2014-11-24",
            "source": "rt"
        },
        {
            "content": "Its the classic robin hood original movie done in a big way with sweeping musical score, lots of choreographed action scenes, plenty of well-developed schemes, elaborate costumes, and so forth. I really enjoyed how quick-witted and suave this Robin hood was portrayed. That being said while this one is clearly better in terms of Oscar quality, I still prefer the more dramatic and cheesier Robin hood prince of thieves from the 90's (I grew up with that one). That one is more entertaining and has better developed characters.",
            "review_date": "2014-11-20",
            "source": "rt"
        },
        {
            "content": "This will be the standard all present and future Robin Hood movies will be judged against.  The movie is simply spectacular.",
            "review_date": "2014-09-26",
            "source": "rt"
        },
        {
            "content": "Super entertainment.",
            "review_date": "2014-09-21",
            "source": "rt"
        },
        {
            "content": "Classic film. This is the quintissential Robin Hood. It's also the first colour film depicting his adventures and the one most adaptions since have drawn from, including the Disney one.",
            "review_date": "2014-09-07",
            "source": "rt"
        },
        {
            "content": "A classic to say the least, this Robin Hood movie will please all who see it. Filled with adventure and swashbuckling action, it easy to see why this movie is a flawless masterpiece.",
            "review_date": "2014-09-03",
            "source": "rt"
        },
        {
            "content": "The first great action film of the color era, with an incredible ensemble cast and a score by Erich Korngold that provided the foundation for John Williams' career. Essential.",
            "review_date": "2014-07-19",
            "source": "rt"
        },
        {
            "content": "Robin Hood; The original income redistributer . Released in 1938, the movie holds up really well. It's  an old school action/adventure epic that Hollywood used to love to make. The swordplay scenes are very well done. The action looks fluid even when it's chaotic and there's too much going on onscreen at once. The remastered version looks amazing, the colors pop out. I don't wanna use the term swashbuckling because it sounds cliche bur that's the best way to describe this film.  The original leading man Erroll Fynn and his band of merry men go up  against the odious Prince John.  The mix of comedy and  action adventure was an inspiration to many action blockbusters. It's a classic. And still the best movie adaptation of the English folktale( sorry Sean Connery and Russell Crowe)",
            "review_date": "2014-07-18",
            "source": "rt"
        },
        {
            "content": "Definitely a timeless classic",
            "review_date": "2014-07-18",
            "source": "rt"
        },
        {
            "content": "Esta es la película definitiva sobre Robin Hood: Muchas veces imitada, pero jamás superada.  Errol Flynn es magnífico como Robin de Sherwood, Olivia de Havilland es celestial como Lady Marion y Basin Rathbone es perfecto como el Sheriff de Nottingham.  Las escenas de acción son más que estupendas y la dirección de Michael Curtiz (\"Casablanca\") es ideal. Todo un clásico del género de aventuras.",
            "review_date": "2014-07-06",
            "source": "rt"
        },
        {
            "content": "\"The Adventures of Robin Hood\" is the best interpretation of the legendary title character that has ever been put on the screen.",
            "review_date": "2014-06-27",
            "source": "rt"
        },
        {
            "content": "Stunning, lavish film - Robin Hood how it should be told!",
            "review_date": "2014-04-19",
            "source": "rt"
        },
        {
            "content": "This classic swashbuckler stars Errol Flynn in the role that he is best known for, and there is a good reason why.  Adventure films aren't fun like this anymore...these days if you make Robin Hood it has to be dark, gritty, and realistic. Fun is often forgotten these days, which is why it is wonderful that film lasts so long...we can still have fun be watching old films like this.  This has everything an adventure film should have, and in beautiful technicolor.  I'd definitely recommend this.",
            "review_date": "2014-04-07",
            "source": "rt"
        },
        {
            "content": "It's not better than the animated version :)",
            "review_date": "2014-04-05",
            "source": "rt"
        },
        {
            "content": "The knee-jerking reaction of watching this Technicolor swashbuckler is holy cow how is it possible this picture was made in 1938? Its brightly rich palette, advanced back projection technology, meticulously tailored garments and detailed mise en scène, must be cutting-edge and it did cost a great amount of fortune to make it happen, the most expensive film for WARNER BROS. at its time, but the reward was also colossal. \n\nread rest of my review on my blog: http://lasttimeisawdotcom.wordpress.com/2014/03/27/theadventuresofrobinhood1938/",
            "review_date": "2014-03-30",
            "source": "rt"
        },
        {
            "content": "Adventures of Robin Hood is one of my all time favorites.",
            "review_date": "2014-03-26",
            "source": "rt"
        },
        {
            "content": "If this is poverty, I'll share it with you.\n\nKing Richard of England has been kidnapped leaving the throne in the hands of his snakish brother, John, and John's closest ally, The Sheriff of Nottingham.  Robin Hood is a fan of King Richard and believes his countrymen deserve the best, not the poverty John drives them into by over taxing and micromanaging.  Robin will steal from the rich and give to the poor...until he's caught or Richard returns.\n\n\"We resisted as well as we could.\"\n\nMichael Curtiz, director of White Christmas, Mildred Pierce, Captain Blood, The Sea Hawks, Yankee Doodle Dandee, Four Daughters, We're No Angels, Breaking Point, and Kid Galahad, delivers The Adventures of Robin Hood. The storyline for this picture is straightforward but the settings, costumes, pace, and interactions between characters are perfect.  The acting is also fantastic and the cast includes Errol Flynn, Alan Hale, Claude Rains, Olivia de Havilland, Basil Rathbone, Patrick Knowles, and Eugene Pallette. \n\n\"He ain't going to murder no more.\"\n\nI am a huge Michael Curtiz fan and I also thoroughly enjoy the majority of Flynn's old movies.  This was a very well done Robin Hood picture with great scenes, settings, wardrobe, and a classic medieval feel to it.  The acting was wonderful and the movie was well paced also.  Overall, this is likely one of the top Robin Hood pictures ever made and a must see.\n\n\"You don't have to search for Richard any longer...\"\n\nGrade: A-",
            "review_date": "2014-03-25",
            "source": "rt"
        },
        {
            "content": "The Adventures of Robin Hood is a classic movie, with simple-yet-true values and its charming performances. Errol Flynn is the perfect Robin Hood, and the movie is the perfect treat for movie watchers.",
            "review_date": "2014-03-19",
            "source": "rt"
        },
        {
            "content": "Skips along through the highlights of the Robin Hood legend - or maybe they are not the highlights because they were seared into public memory by this movie. Beautiful score and design support perhaps the greatest swashbuckling hero the hit the silver screen (Errol Flynn, not Robin Hood).",
            "review_date": "2014-02-23",
            "source": "rt"
        },
        {
            "content": "perfect actioner that reminds me of going to the movies on Saturdays as a kid.",
            "review_date": "2014-02-21",
            "source": "rt"
        },
        {
            "content": "In terms of all round film entertainment this is about as good as it gets....drama, comedy, romance, action, suspense, great cast, beautiful settings, music score, etc etc.  How can anyone not like this film?",
            "review_date": "2014-01-09",
            "source": "rt"
        },
        {
            "content": "EXCELLENT Errol Flynn movie !",
            "review_date": "2014-01-01",
            "source": "rt"
        },
        {
            "content": "A must see for children - if only so they get the references by Looney Tunes.  Cast and crew really came together and made a definitive action-romance of the Technicolor age (in spite of the average script).",
            "review_date": "2013-11-11",
            "source": "rt"
        },
        {
            "content": "A technicolor feast boasting huge scale studio production and great stunt work. Incredibly campy, but bestowed with an innate sense of childlike wonder. You feel young watching this film, and it's nearly impossible not to get swept up in the adventure.",
            "review_date": "2013-11-10",
            "source": "rt"
        },
        {
            "content": "Cinematic Dreamland !!!",
            "review_date": "2013-11-07",
            "source": "rt"
        },
        {
            "content": "One of the most artistic movies I have ever seen. The set is amazing and cheerfull acting all around. Two thumbs up!",
            "review_date": "2013-10-17",
            "source": "rt"
        },
        {
            "content": "Much better than I was expecting it to be!  Not at all hokey or cheesy.  A fun adventure in one of my favorite time periods.  The colors in the costumes and sets are mesmerizing, I'll definitely watch this one again.",
            "review_date": "2013-10-09",
            "source": "rt"
        },
        {
            "content": "A goodnatured and adventurous flick with a great cast and witty banter.",
            "review_date": "2013-10-08",
            "source": "rt"
        },
        {
            "content": "Robin Hood and his band of merry men fight the Sheriff of Nottingham.\nCampy and ridiculous, this film seems interchangeable with its parody, Mel Brooks's Robin Hood: Men in Tights. There's nothing new about the Robin Hood legend here except for the remarkable insouciance with which violence and poverty are treated.  I'm sure that it's supposed to be light-hearted and funny, but I found myself rolling my eyes, and not a chuckle escaped my lips.\nOverall, this film is a lackadaisical piece of shit.",
            "review_date": "2013-10-01",
            "source": "rt"
        },
        {
            "content": "My all time favorite movie.",
            "review_date": "2013-08-17",
            "source": "rt"
        },
        {
            "content": "In one of the first films filmed in color, or Technicolor at the time, we learn that the noble Norman King Richard (Ian Hunter) leaves his castle to fight in the Crusades. His brother, Prince John (Claude Rains), assumes the throne and proceeds to tax and oppress the poor Saxon population. One Saxon, Robin Hood (Errol Flynn), forms a band of merry men, such as Little John (Alan Hale), Friar Tuck (Eugene Palette), and Will Scarlett (Patric Knowles), to end the corruption of John's terror, defeat his henchman Sir Guy (Basil Rathbone), and win the affection of Maid Marian (Olivia de Havilland).\n\nAlso, Melville Cooper appears as the Sheriff of Nottingham, Una O'Connor plays Marian's servant Bess, and Herbert Mundin plays Much, the miller's son.\n\nThe Adventures of Robin Hood is a pure, genuine classic. There are many sequences that still hold up well today, especially in today's age with most of the action sequences receiving help from CGI. The score is also one of the all-time greats, and it probably inspired John Williams a lot.\n\nI am very impressed with the cast, particularly Errol Flynn as Robin Hood. Although he was not fond of playing a man in green tights, his performance is great and will be remembered as his most famous role. Considering that he and Olivia de Havilland hated each other in real life, their chemistry comes out really strong, particularly in the love scenes. Basil Rathbone makes a great villain, and his swordfight with Errol Flynn is exciting and suspenseful. Even more impressive is the fact that the stunts in the swordfight inspired the lightsaber battles in Star Wars.\n\nMy only problem with this film is the acting chops of Claude Rains as Prince John. He just didn't seem evil enough to play a jealous brother. Peter Ustinov's voice performance of the same character in Disney's cartoon is more evil than this. Claude Rains has done good villain roles before, such as Hitchcock's Notorious, but this didn't impress me.\n\nFor people who want to take a break from CGI-filled action scenes, The Adventures of Robin Hood is a Technicolor delight. Errol Flynn makes a delightful Robin Hood, and newcomers will sure be thrilled as I am.",
            "review_date": "2013-06-18",
            "source": "rt"
        },
        {
            "content": "Before \"The Adventures of Huckleberry Finn\", Michael Curtiz co-directed this, \"The Adventures of Errol Flynn\"... after doing 111 other projects and before doing 54 more projects. If you think that I'm exaggerating those numbers, I'm not, and before death finally caught up to Curtiz, his name was attached to 166 projects, so I reckon it's safe to say that he had a relatively successful career, as surely as Errol Flynn led a relatively successful career as a swashbuckler, back when most people actually knew what in the world the term \"swashbuckling\" means. Well, of course Flynn was going to lead a successful career as a swashbuckler, because the man had the name of a pirate, or at least the name of an aviator... I reckon. I'm sorry, I'm from Alabama, where we don't say \"aeroplane\" as much as you ignorant Yankees might think, but have to hear it all the time from the satire by, well, you ignorant Yankees who don't realize that we are, in fact, much more cultured nowadays, so much so that we gladly embrace this here old movin' pitture about some fruity-lookin' feller usin' some kind of a fancy bowin' arrow that wouldn't stand a bit of kudzu's chance in a tractor race against my crossbow to save some lady, which is irocnick, or whatever them college folks say, because all he's gonna end up doin' is beatin' her if she comes close stepping out of the line that God put women in to make sure that they don't go and mess up this purtty world that us kindly white men worked so hard buildin' (*insert spit and subsequent ting sound effects here*). Interesting how this opener to a discussion dealing with a classic swashbuckling film set in England during the Middle Ages ended up touching upon redneck satire, but hey, I could have picked a more irrelevant topic, seeing as how we are talking about someone who lived so far south that he was born and raised in Australia, kind of like that Keith Urban feller who plays country music like good ol' Hank Williams. Shoot, I can't even joke about Urban's music being real country, rather than just pop rock with a twang, and besides, I'm really going off topic at this point, because this film is so old that it came at a time when we were just getting used to country music. Oh well, it's still a decent flick, and yet, much like yankee views on the South, its not without some questionable spots.\r\n\r\nIt's a fluff piece of the 1930s, so of course certain lively touches have dated, yet that doesn't really make them any less cheesy, because even though the film hasn't turned cornball by now, it is not without somewhat cheesy moments of fluffy filler that throw you off, though not quite as much as the focal unevenness. The film isn't dizzyingly inconsistent, but it does have a tendency to break up direct, if a tad aimless sections in its narrative as an adventure film with some shifts into typically ultimately necessary, but hardly organically incorporated happenings that could have perhaps fit more comfortably in the midst of this film's focal structure if storytelling actually took the time that it should, or rather, any time to meditate upon fleshing its story out. Again, this is a harmless adventure flick, and one revolved around a highly recognizable legend, so it's not like I'm asking for much by any means when it comes to development, but the film feels very undercooked, featuring lapses in exposition that dilute both the full effectiveness of the characters' motivations and the firm distinguishing of the members of this conceptually dynamic character roster, while leaving certain events to feel hurried in and repetitious, and further detrimental to your engagement value. Something of a core problem that sparks the aforementioned unevenness, underdevelopment is arguably the final product's biggest consequential problem, and yet, with that said, the underdevelopment isn't too disconcerting, which means that there's even less to the cheesiness and unevenness, thus leaving the final product with only so many errors in storytelling, but primarily because, quite frankly, there's not a whole lot to this story to begin with. When I called this film a fluff piece, I really did mean that it was harmless fare for its time, with a topic that could be built into a strong story, but is instead the basis for a barely consequential popcorn storyline, which may ultimately be presented in a fashion that is entertaining enough for the final product to succeed just fine as a fun popcorn flick, but is just too thin to be all that memorable. Consequential flaws are made a bit more glaring by this story that isn't as rich as it perhaps could have been, slowing down momentum that was never to have too much kick, until you end up with a fluff piece that it plenty of fun, but a fluff piece, nevertheless, complete with not enough kick to be especially memorable. Still, while the final product isn't necessarily a deeply rewarding ride, it is a ride that's reasonably worth taking, having shortcomings within its story's concept and telling, but enough in the way of fun factor to liven up your mood a bit, just like how sharp musical aspects liven up the film itself.\r\n\r\nThis film's score, composed by Erich Wolfgang Korngold (Great name), is by no means especially unique, but it's hardly as trite as plenty of other film scores of the classic era of Hollywood, and that allows you to have a bit more appreciation for this score's strength, which is indeed mighty, combining soulful elegance with thrilling boastful through thorough liveliness that helps greatly in bringing this film's high entertainment value to life, while also helping to sell you on this film's tone. What sells you on the actual look of this film is, of course, the efforts of art director Carl Jules Weyl and costume designer Milo Anderson, who do a decent and rather stylish job of restoring the Middle Ages through nifty designs that go complimented by Tony Gaudio's and Sol Polito's lushly colorful and comfortably scoped Technicolor cinematography. Gaudio and Polito add the film's good looks with then-fine photography that is still fairly pretty to this day, while also putting tight framing to good use during the action sequences, which are few and far between, and held back by sensibilities of the time, but still well-shot, well-choreographed and all round well-staged enough to thrill just fine, not necessarily as a reinforcement of what sense of consequence there is to this fluffy storyline, but certainly as a compliment to the swashbuckling adventurousness of this popcorn piece. Some of the liveliness touch-ups just discussed are about as strong as I make them sound, with some being even stronger, because even though the film has dated as a popcorn entertainer, enough color within its musicality, look and action has stood the test of time for the film to get off a pretty good start when it comes to standing as a fun flick. Of course, what really secures the final product's entertainment value is the sketching out and telling of this story, which is, as I've gone on and on about, hardly all that rich, to where you get all that much of a sense of weighty meat, but still colorful, with a harmless adventurousness that gives this film the potential of being, if nothing else, the fun fare that it ultimately is, largely thanks to both a script by Norman Reilly Raine and Seton I. Miller that delivers on plenty of sharp wit, as well directorial performances by Michael Curtiz and William Keighley that hit one lively beat after another. Curtiz and Keighley keep pacing brisk and spirited, gracing this film with a charm that goes fed by the charisma found throughout this cast, from which leading man Errol Flynn stands out by making sure that his being well-cast does not go to waste, nailing the heart of the legendary Robin Hood with such assurance that he becomes the role and, by extension, both one of the most memorable portrayers of a highly recognizable character, as well as a driving force in the film. This flick is what it is, and what it is is merely popcorn fare that was never to be all that compelling or memorable, so all it can be is entertaining, and sure enough, if this effort is nothing else, it is plenty of harmless fun, with style and charm that remain sharp enough to this day to entertain thoroughly, even if such entertainment comes at the expense of kick to substance.\r\n\r\nWhen the adventure is done, cheesy spots and some focal unevenness prove to be offputting, though not as much as the underdevelopment and structural hurrying that are still not too worthy of complaints, as this film's story concept is a shoestring-thin one with limited consequence and memorability, thus making for an underwhelming final product, but one still reasonably worth checking out, as lively score work, appealing production designs, handsome cinematography, thrilling action and an adventurous narrative, brought to life by witty writing, well-paced directorial storytelling and charismatic acting - especially by the well-cast and immersed Errol Flynn - go into making 1938's \"The Adventures of Robin Hood\" a fun popcorn piece that won't stick with you for very long, but proves to be enjoyable while it occupies your reasonably well-spent time.\r\n\r\n2.5/5 - Fair",
            "review_date": "2013-06-13",
            "source": "rt"
        },
        {
            "content": "Antiquated but effervescent nonetheless for its time",
            "review_date": "2013-06-10",
            "source": "rt"
        },
        {
            "content": "Probably the best Robin Hood film I've seen with a great performance by Errol Flynn as the charismatic Robin Of Locksley. There is a great use of plot and characters, of swashbuckling action, epic sets, three strip Technicolor photography, and most of all the romance. I really enjoyed the romance between Robin and Mariam (Olivia de Havilland) real actors giving of a natural chemistry which made me believe. Surprisingly I enjoyed this marvel picture all throughout.",
            "review_date": "2013-06-03",
            "source": "rt"
        },
        {
            "content": "the Robin Hood saga suitable for all ages to watch  -  Erol Flynn is magnificent and a perfect match for deHavilland. The costumes? a feast for the eyes....",
            "review_date": "2013-05-10",
            "source": "rt"
        },
        {
            "content": "As much as I love Mel Brooks' \"Robin Hood: Men in Tights\" it dawned on me that it might be in my interest to see one of the great versions parodied by it. Not only was Errol Flynn's Sir Robin of Locksley enjoyable to watch, it increased my appreciation of Men in Tights even more. It's absolutely ridiculous, even campy at times, but it's some of the most fun I've had watching an older film.",
            "review_date": "2013-04-10",
            "source": "rt"
        },
        {
            "content": "A classic...Cheesy, but a classic.",
            "review_date": "2013-04-06",
            "source": "rt"
        },
        {
            "content": "On paper, this Robin Hood could easily be read as the most pompous, insufferable jerk imaginable, constantly belittling others and laughing at their misfortune. On screen, Errol Flynn brings a charming playfulness to the role that is an absolute miracle. I love his performance, and I love this film. It's chock full of delightful characters, hilarious moments, and incredible action sequences. The sword fight choreography is seriously breathtaking (as fast and impressive as anything in the \"Star Wars\" prequels, but with a far greater sense of peril and excitement), and the vivid colors of the sets and costumes are just gorgeous. There are times when the bad-guy killing feels excessive (Remember that guy on the ladder? Did they really need to shoot him in the back?), but the bloodless stylization of it all makes it much easier to accept (Personally, I like to believe he was just injured). What a marvelous movie.",
            "review_date": "2013-03-28",
            "source": "rt"
        },
        {
            "content": "Great fun if you ike those areas",
            "review_date": "2013-03-17",
            "source": "rt"
        },
        {
            "content": "I really wish I saw this as a kid.",
            "review_date": "2013-03-12",
            "source": "rt"
        }
    ]
}