{
    "rating": 8.6,
    "release_date": "1939-03-02",
    "num_reviews": 110,
    "genres": [
        "English"
    ],
    "summary": "John Ford's landmark Western revolves around an assorted group of colorful passengers aboard the Overland stagecoach bound for Lordsburg, New Mexico, in the 1880s. An alcoholic philosophizer (Thomas Mitchell), a lady of ill repute (Claire Trevor) and a timid liquor salesman (Donald Meek) are among the motley crew of travelers who must contend with an escaped outlaw, the Ringo Kid (John Wayne), and the ever-present threat of an Apache attack as they make their way across the Wild West.",
    "reviews": [
        {
            "content": "I think this movie is excellent (hence the four stars) but I did find that there were a number of characterizations and relationships that didn't get enough space to breathe. Wayne just immediately falls for Trevor. Carradine has some connection to the cavalryman's wife but it never gets explored. In one sense that's just a way of saying the world is bigger than what we get in the film, but those relationships seemed to be meaningful for the characters themselves, speaking directly to their motivations, we just don't really get to know what those motivations are. \n\nIn that way, this movie is almost like a snapshot of the lives of its characters, kind of like if Crash didn't suck. \n\nWayne is great in this. Almost boyish.",
            "review_date": "2023-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": ")\nI dislike westerns but this was a blast. You can see Ford's brilliance despite the film's age and technical limitations. There are some beautiful shots here as well as great action sequences. Also the film's ensemble cast delivers great performances that really flesh out the characters so that you care about them. There's humor, action, pathos, and a good story. What more can you ask for?",
            "review_date": "2023-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic western. Great story, characters, and an arc that builds to a fun and climactic ending.",
            "review_date": "2022-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of My Favorite Westerns Of All Time. While it is a very simply plot the movie layers it extremely well with 9 simple likeable characters who all give excellent performances. Dallas, Doc & Ringo are the standouts. The musical score is excellent, breathtaking cinematography and fantastic pacing keeping the adventure brisk. The action pieces are phenomenal and are some of the best action sequences I have ever seen not feeling dated at all. This movie while not having complex characters or a deep message makes up for it with loving craft, charming performances, and an amazing white knuckle action battle. With that zoom in shot on Ringo, A Star Was Born as well.",
            "review_date": "2022-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Stagecoach\" is a brilliantly masterful film, it evokes the awe-inspiring feeling that one has witnessed the birth of a genre which has somehow sprung fully formed from the womb. Yes, the history of the Western precedes the making of \"Stagecoach,\" yet the film nonetheless strikes the viewer as incredibly complete, given the relatively rudimentary nature of sound-era Westerns at the time. It's technical mastery, observable in stunts which are just as breathtaking and impressive today, is matched only by its conscientious commitment to story development. Its characters, as many as there are, are invested with the kind of flawed humanity that transcends simple story construction. A perfect balance is thus achieved between straightforward thrills and equally engaging character dynamics, imbuing \"Stagecoach\" with the kind of towering greatness only observed in the best of all films.",
            "review_date": "2022-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When I hear the term \" classic western flick\" this is the first thing that comes to mind The plot revolves around a stagecoach traveling to lordsburg NM while Geronimo is rampaging across the American South west once again John Wayne proves how perfect he is for old school cowboy roles ( he looks so young in this movie you'll have a hard time recognizing him) If you like vintage black and white westerns this one should deliver",
            "review_date": "2022-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "John Wayne is \"The Ringo Kid\" in this John Ford-directed parable of outcasts traveling towards various kinds of figurative and literal redemption/salvation. On a surface level, the basic plot is disarmingly simple--a motley crew of eight takes a stagecoach from Tonto to Lordsburg, trying to avoid Geronimo and his Apaches on the way. They are having their own problems with the U.S. government and are thus likely to attack. The stagecoach bounces from outpost to outpost while the relationships of its passengers evolve, helping each other to \"find themselves\" and (usually) providing hope of some kind of new life.\n\nThe Ringo Kid has been wrongly accused of a crime and is on his way to Lordsburg to avenge both the false accusations and more importantly, the murder of his father and brother. Dallas (Claire Trevor) is implied to be a prostitute, and so is ostracized from Tonto (which means \"stupid\", \"foolish\" or \"daft\" in Spanish) by a self-stylized matronly moral majority. Doc Boone (Thomas Mitchell) is far more concerned with getting drunk than being a doctor, and is partially ostracizing himself from Tonto. Hatfield (John Carradine) is a \"gambler gentleman\" with a shady reputation and a false identity. Lucy Mallory (Louise Platt) is trying to get to her husband, who is in the military; she's in a surprisingly \"secret\" physical state. Samuel Peacock, whom everyone keeps mistaking for a reverend, is in the alcohol business and just wants to get back east to get back to his business. Henry Gatewood is a crooked banker trying to flee before his questionable dealings are discovered. And the stagecoach drivers consist of a lovable buffoon, Buck (Andy Devine) and the most forthright, straight arrow of the bunch, Marshal Curly Wilcox (George Bancroft).\n\nEven though Stagecoach remains tightly focused on its wilderness road trip, that might seem like a large stable of characters to shape into a taut plot. Ford, working from script by Dudley Nichols and Ben Hecht, based on a short story, \"Stage to Lordsburg\", by Ernest Haycox (which itself bears a relation to Guy de Maupassant's \"Boule de Suif\", 1880), keeps the proceedings in check by only giving us the information we need to explore the evolving relationships, and only focusing on each character when they're important to the plot. This results in a few of the characters being functionally absent for extended lengths of time, but Ford can so easily establish a \"deep\" character with a minimum of screen time that the absences are not a detriment.\n\nThe principal focus, of course, is between Ringo and Dallas, as on a significant level, Stagecoach becomes a romance. They're initially brought together via their mutual ostracization, even among the ostracized, which gives them an immediate bond beyond their physical attraction towards one another. Wayne and Trevor are both fantastic in their roles, avoiding the occasional overacting by some other performers. But this is a film where it's difficult to count the slight overacting as a flaw, as it was more of a stylistic tendency of the genre during this period and it provides a nice counterbalance to Wayne and Trevor.\n\nStagecoach is also famous for its setting. Much of the film was shot in Utah's Monument Valley, along authentic stagecoach \"roads\". The (beautiful) starkness of the desert is often taken as a symbolic trip through a kind of purgatory for the characters, where they're left alone with their souls, their only connection being their small group, to contemplate their pasts and futures. Whether we choose to read something along those lines into the film or not, Monument Valley is at least a captivating presence in the film, although for me, the cinematography could have been better technically, especially considering that Stagecoach was made at the same time as The Wizard of Oz (1939). Ford's famous tendency to do only one take results in a couple minor gaffes, such as the initial shot of John Wayne--a zoom into a close-up--that is out of focus for most of the zoom.\n\nAs one could guess, eventually our passengers run into a band of Apaches, who are often interpreted as representing more of a \"natural force\" that our heroes must surmount. The climax features a fabulous extended chase/fight sequence with a number of amazing stunts by both humans and animals. The most impressive human stunts are performed by the legendary Yakima Canutt, including one that involved being dragged through the dirt by the horse-pulled stagecoach, which was moving along at about 40 miles per hour and supposedly missed running over Canutt by only 12 inches (30.5 cm). This scene was an inspiration for a similar stunt in Steven Spielberg's Raiders of the Lost Ark (1981).\n\nAlthough it's not a \"perfect\" film to me, and it's not even my favorite western (I'm more partial to the classic spaghetti westerns, for example), Stagecoach is a very good film and was very influential, despite being made at a time when Ford was told that he was committing professional suicide by even contemplating a western. As the plethora of critical literature attests, it works on many levels, including as an allegorical microcosm of U.S. Depression-era society, and should be seen at least once by anyone serious about film literacy.",
            "review_date": "2021-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "40% rating. Had to watch this for a film history class during the Western movie section, so I understand the significance of the film, but its just not my type of film.",
            "review_date": "2021-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5 Stars.  Cuz a CLASSIC.  & a MUST SEE.   \nt 'Fresh'?  C'mon...do you even know how many years ago was 1939?\nSaw 1st 5.2023 tv GRIT channel.  \nCast with lotsa stars.  Thot it wd be more about stagecoach being attacked.  But lots of stops along the way.",
            "review_date": "2021-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An undisputed classic! Duke! John Ford!",
            "review_date": "2021-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a great western. Very humorous too. Thomas Mitchell's performance as the drunken but honourable Doc Boone is brilliant. It's not heavy on action, but some of the physical stunts are still bonkers.",
            "review_date": "2021-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's a reason this is considered one of the most classic Western films. Great characters, great music and action. This will definitely satisfy anyone!",
            "review_date": "2021-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A clear eyed Western with John Ford's auteur vision!\n\nJohn Ford's genre defining Western picture Stagecoach (1939) is so refined, that I'm honestly astonished by how concise and engaging it remains. Writers Ben Hecht, Dudley Nichols, and Ernest Haycox provide a sterling script with 9 memorable leads, ample action sequences, and finely tuned character development. The wicked are punished, the just rewarded, and the innocent are saved with a brutally realistic approach to storytelling. John Ford's direction is the real star as his focused vision of the American West demonstrates how wild and deadly these times were and how random civilians had to band together during desperate times to stay safe.\n\nBert Glennon's cinematography has creative framing with John Wayne gazing at a woman he loves straight down a dark hall or a stunning quick zoom in to introduce Wayne's character The Ringo Kid. John Wayne himself is charismatic, likable, kind, and skilled as a gunslinger in one of his most remarkable screen performances. I never cared for John Wayne for his normally stilted acting and conservative politics; however, Wayne captivates you in Stagecoach as only a deft Western actor could. John Wayne was in rare form here and certainly elevated by director John Ford's astounding mastery of expressive filmmaking.\n\nClaire Trevor plays the assumed prostitute Dallas with a charming warmth and sincere worry over how others cruelly ignore or chastise her. She has wonderful natural chemistry with The Duke himself. Andy Devine is hilarious as the eternally screaming and always dumb Buck. A young John Carradine gets a fantastic supporting role as the mysterious Southern gentleman and secretive gambler Hatfield. His paternal chemistry alongside the ethereal beauty of Louise Platt's lady Lucy Mallory is a real highlight of Stagecoach for me. You really start to like them after you get to know their characters.\n\nThomas Mitchell is excellent and entertaining as the ever drunken Doctor Josiah Boone. George Bancroft is gripping as Marshall Curly Wilcox with his strict sense of justice and dedication to the job. Donald Meek is pretty funny as the mild mannered alcohol man Samuel Peacock. Berton Churchill is really annoying as the self righteous banker Ellswood H. Gatewood. Elvira Rios, the Mexican singer and actress, cameos to sing a lovely old folk song on a captivating night as our heroes must wait out until morning.\n\nNotably, composers Gerard Carbonara, John Leipold, Leo Shuken, as well as Louis Gruenberg reinvigorated old folk songs with a modern flair. Their epic reworkings of Americana turn pieces of music into folk classics. Walter Plunkett's costumes look dazzling with intricately woven dresses for both lead actresses that define their social status as a real lady or a lady of the night. Norbert A. Myles' make-up does up Louise Platt into a delicate and refined lady, while giving Claire Trevor a beautiful natural look. Otho Lovering and Dorothy Spencer edit Stagecoach into a no frills Western, clocking in at a precise 96 minutes.\n\nIn short, Stagecoach is a Western worth seeking out for an old classic that dares to make you care about people from all walks of life.",
            "review_date": "2021-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though Stagecoach was made in 1939, and it became the template for many westerns that followed it, it still managed to surprise me a few times. The story is simple, but the characters are interesting, and the stunt work & cinematography are quite impressive. John Wayne makes an impression from the moment he enters the picture. I don't know why it took me so long to watch this classic film. I'm glad I finally did.",
            "review_date": "2021-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4.5/5.  The portrayal of Native Americans has aged poorly, but the rest of the characters are an interesting bunch and give us a fantastic western.",
            "review_date": "2021-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stagecoach is a 1939 American Western film directed by John Ford 🌵 \n\nMeh, it passed the time. \nJust. 😐\n\nA POWERFUL STORY OF NINE STRANGE PEOPLE",
            "review_date": "2020-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting is good but the story is just ok.",
            "review_date": "2020-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great Western. Not only that, this is a major achievement in the history of cinema. Finding this movie boring equals to not having a sense of art.",
            "review_date": "2020-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is so classic that seemingly all other movies featuring stagecoaches pulled from it, even modern films like The Hateful Eight and The Ballad of Buster Scruggs. It's one of the great John Ford westerns, and even after all this time still holds up to modern viewing. There are plenty of great character moments slathered on top of the rich western setting and the solid underlying story, and it's the characters that carry the film and make it so memorable even today.\n\nClosest comparison: It's like the final vignette in The Ballad of Buster Scruggs by way of The Man Who Shot Liberty Valance.\n\nSetting: Western\nPlot: Confined Strangers\nTone: Adventure",
            "review_date": "2020-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original Western that started it all. Fantastic and well defined characters and brisk pacing. Worth it for the Noir-esque night shots of Lordsburg. Establishing the aesthetics that would define the genre!",
            "review_date": "2020-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it's important to note Stagecoach's important place in cinema history, one can't  view this 80 year old movie without noticing its wrinkles. Sure, John Ford is a legend, and all his mastery as an auteur is on display here, bringing to life a metaphoric journey of castaways toward redemption like no other director can. However, with a less than dazzling restoration/preservation, the breakthrough cinematography is marred with the snap, crackle, and pop of an aging film reel, and jumpy edits that leave you wondering if this is how this film was intended to be seen. The sound is so challenging at times, I found myself not only rewinding scenes, but using the films Wikipedia page to understand key plot points. One jarring example is the important reveal of Dallas's true identity to Ringo, provided with limited dialogue, presented through the image of what we're supposed to understand is a brothel. We know from later Ford films how effective this can be, but here, it's challenging to comprehend given the poor quality of the visuals. The cast is hit or miss — with John Wayne as his capable cowboy at the helm. The female performances from the leads are way too packed with ingenue to be effective in a 21st century watch, and Andy Devines comic relief character \"Buck\" is downright annoying. The films racist depiction of Native Americans and Latinos is typical for the era..which is to say blatant and disgusting, so be warned. Thomas Mitchell's Academy Award winning performance is beyond deserving, serving as the casts deepest character, and lighting up the screen with every line. All in all, it's a film that's important to watch for its place in cinema history,  establishing Wayne, Ford, and the Western, as a American cinema mainstays, but 80 years has added some blemishes to the classic, making it not as digestible as it once was.",
            "review_date": "2020-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stagecoach successfully kickstart the Western genre boom of its time, boasting with great action, cast of intriguing characters, and last, but not least, the true American himself, John Wayne in his breakout role.",
            "review_date": "2020-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Character-driven without a standout lead that overpowers the others, Stagecoach remains one of the best of the entire Western genre. Drawn together by the simple need to get to a particular place, Ford draws together a host of interesting and unique personas and then provides the means for each of those characters to voice their goals, motivations, and prejudices as the pressure mounts. A major influence on the industry and the Western genre in particular, you can't miss this one. (4.5/5)",
            "review_date": "2020-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok yeah classic. Great Thomas Mitchell. The start of John Wayne’s 3 possible performances. But you mean to say those 25 ‘Indians’ surrounding the stagecoach on horseback, nailing arrows, could not nail the two guys up top, driving the thing? Clare Trevor sees arrows land right outside the window, and she does what? turns and exposes her back to incoming arrows. And yes i just cannot swallow these dated ‘fighting the bad Indian’ movies. I always cheer for the Indians. And I do love some westerns...Red River for one.",
            "review_date": "2020-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great action and intriguing dialog. I understood the characters clearly in a relatively short amount of time.",
            "review_date": "2020-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Being John Wayne's first big start into Hollywood Western Film genre, Stagecoach was a film that lead the way for almost all western films to follow. In large part, this was due to it's beautiful cinematography of the scenery which John Ford and others would eventually use in future western films. This, along with the implementation of interesting characters essentially being put together in a box created what most people would say is a masterpiece for John Ford.\n\nBeing a product of it's time, it's no wonder that some well choreographed action scenes coupled with some interesting characters gained such a high revere in the western film world. Though it's safe to say that pretty much all westerns have this film to thank for the tropes that were almost over used in their films. \n\nThis film follows a stoic hero as he meets some unlikely travel companions on his journey to right the wrongs of his past. The hero also meets a woman on this journey who conveniently falls in love with the hero. Just this description alone seems like the cliché of clichés, yet, this film is regarded as a masterpiece because of its intricate implementation of characters with different motivations and personalities. \n\nOne of my main critiques of this film though, is not with the character development, but the use of a love interest to move the story forward. The fact that two characters who just met, in this case Ringo Kid and Lucy Mallory, are already enthralled with each other after a very short period is something that lacks motivation and makes me wonder why it couldn't have been implemented more realistically into the story.\n\nFor it's time, Stagecoach is a masterpiece as far as cinematography and the implementation of western style action scenes. Some of the characters were interesting and made me want to watch more, while others left me unconcerned for their well-being in the story. What should stand out the most about this film though, is it's use attempts to try something that hadn't been done on the same scale, which was to create one of the first classic westerns that millions have grown to love.",
            "review_date": "2019-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stagecoach (1939)\nDirector John Ford\nStagecoach is a phenomenal movie that still stands on its own 80 years later. Stagecoach is a tried and true western. It has the damsel needing help by the hero cowboy who rides in to save the sheriff and the townsfolk from their enemies. It just goes about that story in a unique and interesting way. \nStagecoach has a damsel in distress, Dallas played by Claire Trevor. But instead of her being in danger of bad guys in danger of being an outcast in the world with no one to turn to. She is saved by the Hero, Ringo played by John Wayne, but the Hero is a cowboy on the run from the law, who interestingly enough saves the sheriff out to get him from a gang of natives. This new style of story makes the film more interesting and grabs the audience's attention better. Now we are not sure how the story will be told since we've never seen something like this before. The slight difference in the western narrative that Stagecoach goes for, also makes it all the more relatable. Now we have characters with flaws, characters that we the audience can relate to. Characters like Ringo, who is an honorable cowboy but on the run from the law, shows us that we are still good people even if we were dealt the short end of the stick. Or how Dallas is a girl working in a brothel, But we still empathize for her being shunned by communities and being an outcast because we know that people deserve being treated as equals no matter their situations. We see how these characters can relate very well back during the days of the depression. But even today these characters can still makes us relate to their struggles and actions. Stagecoach has the understanding that good people being dealt in hard circumstances still deserves to be loved and cared for. It's this theme that makes the film so relatable because it something we all go through. We all want to be loved and accepted even with all our own flaws. \nStagecoach shows us how we feel and what we want. Then it shows us how we can achieve what we want. Stagecoach shows us these characters that we relate to and then unites them. The characters through the ride of the stagecoach don't seem to get along very well. There is fighting and insults thrown at one another and divide happening between the upper class and the lower class passengers. But what in the end they all unite to fight the greater evil. Now the one bad part of the film is the racist portrayal of natives and Mexicans, but we're going to power through that since the film was made in a time where those things were a little more acceptable. The bad guys being savage natives. The unifying of the group shows the context of this film and tells the story of its time. Since Stagecoach took place in 1939 it happened right before WWII. The unifying tale of these everyday men show us how they must unite to take on a greater evil even if they all don't get along. It's for survival. The greater evil in Stagecoach was natives, in real life it is Nazi's. We can see how a theme of unifying together to take on a greater evil still relates in today's age as well. Whether it's our current politics or even just a sports game the theme is powerful and will also last throughout time.\nNow with the themes stated the way Stagecoach showcases these themes is incredible. The use of Music, setting and cinematography all go hand in hand to tell us this. Whether it's the main theme of Stagecoach and how it creates three separate moods. One mood that tells us it's a western with its upbeat unifying rhythm. The other mood being romantic gesture that our two main characters show for each other. Finally a mood that puts us on edge, always feeling like danger is around the corner. The setting really drives home our western mathsphere. Bringing home how vast and great our homeland is. Finally the cinematography, which helped developed a whole new shot known as the cowboy shot. Brings home the vastness of our setting and how great and strong our characters feel traveling around it's dangerous corners.\nStagecoach is a beautiful movie that uses all aspects of filmmaking to tell a story that is so strong that it not only was relatable to audiences when it came out but it still relates to audiences now. I would highly recommend this movie to anyone. Just be careful with the some of the racist showcasing of native americans and mexicans in the film. For all its wonder it does have some faults and those are pretty strong. But it still holds up and even with those faults it is a remarkable movie that is charming and powerful.",
            "review_date": "2019-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A superb introduction to classic westerns. ",
            "review_date": "2019-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful movie! It has it all: action, adventure, comedy and romance! Plus, John Wayne! Who doesn't love John Wayne!?",
            "review_date": "2019-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You know this movie is old bc John Wayne is young in it. I found it to be more enjoyable than I thought it would be, esp the beginning which seemed to be pretty detailed of the time period. By the end it becomes pretty hokey, but the beginning was interesting and not predictable. I liked the slew of different interesting characters all coming together for a dangerous adventure out west. Many of the artistic details were well done such as cinematography (the black n white landscape worked well here), the song by the Indian, and the action scenes (for its time and special effects then). John Wayne plays his typical role of outcast who is both honorable and a badass. One of the great western classics. ",
            "review_date": "2019-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very strong start to one of the first modern Westerns!",
            "review_date": "2019-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great western that started a industry of greats wonderful film and ultimate classic",
            "review_date": "2019-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best westerns out there still ",
            "review_date": "2018-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although John Wayne looks amazing in his skin tight 1939 wrangler jeans... Surfs up is an ultimate recommended movie to view to forget this one.",
            "review_date": "2018-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "AFI 100 Greatest Movies - #63:  It is not hard to understand why this film gained such acclaim and is said to have changed the way movies were made.  Stagecoach combines drama, suspense, action and even comedy to propel its story from stop to stop.  The colorful cast of riders on the stagecoach is what ultimately makes this film work for me as we learn more and more about the character's motivations, and how these motivations dictate their interactions with each other.  The wide angle shots of the journey were beautiful, while the action scenes were eye-popping and must have been a modern marvel in 1939.",
            "review_date": "2018-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love stagecoach. It is one of the greatest westerns of all time. It is one of John Wayne's best films. Everybody knows about stagecoach. Most of John Wayne's movies has lived on for generations after generation. Stagecoach has a good unique story. And it was of course shot in monument valley. A few of John Wayne's westerns was filmed in monument valley. Most people are a fan of John Wayne and some aren't.",
            "review_date": "2018-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a film made in the 1930s, based in the 1880s, the class and political polarization still rings entirely true. Mostly a road-trip dramedy, it's filled with a top-rate collection of colorful characters, and it's such a pleasure getting to know them over 90 minutes. Once the classic and inventively shot western-action kicks in at the end, it adds excitement and volatility to the already stellar drama and humor. Worthy to be considered among the best of the genre and the era.",
            "review_date": "2018-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A few days ago I was bumbling around on the internet looking at random articles and lists about movies, because hey it's not like I have got anything better to do.  But anyways, I noticed this list that was titled \"The Best Movie in Every State\", so out of my natural curiosity as a frequent movie viewer, I looked at the entire list.  And then wouldn't you know it, I saw that Stagecoach held the title of \" best\" movie ever filmed in Utah.  Therefore sparking enough of my already growing interest in watching this movie, that I actually sat down and almost watched it completely through.  And let me be the 14,467th person to tell you, that I was not disappointed for one bit of the film's entirety.  I mean like sure, the action set-pieces and fist fights may be few and far between, (there actually weren't any fist fights).  However, as I was saying, there weren't that many action set-pieces.  But nonetheless, the two of them delivered in the best possible ways.  And who knows, the Stagecoach battle scene with the Apache's, might very well have been \"the\" contributing factor and inspiration behind the chariot race scene in William Wyler's legendary, biblical epic, Ben-Hur.  \nUltimately though, while the Stagecoach battle was the undisputed highlight of the John Ford masterpiece, it is effortlessly outweighed in equal measure by the ever present story and it's appealing characters. The best part being, the multiple character moments, and John Wayne's terrific role as \"The Ringo Kid\".  By the way, the rest of the cast weren't any slouches, of course you already know why John Wayne is mentioned in his own sentence.  \nHowever anyways I guess it is time to conclude my review, so at an rate, \"Sionara\", I hope to be writing another review really soon.\n\nMy grade for the film: A",
            "review_date": "2018-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "JohnFord revolutionized the western genre with this great film that's still holds up as both a good drama, and a great action film.",
            "review_date": "2018-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Movie That Made John Wayne A Star",
            "review_date": "2018-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its a classic so what can I say, Stagecoach is five stars.",
            "review_date": "2017-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Adapted from a short story by  Ernest Haycox with a stagecoach just arriving to Tonto, Arizona Territory picking up 3 additional passengers of  Doc Josiah Boone (Thomas Mitchell), and  Dallas \nClaire Trevor, banker, Gatewood (Berton Churchill)  heading toward  Lordsburg, New Mexico Territory while along the way picking up Ringo Kid (John Wayne) who must drive through  the violent Geromino territory.  This is the first of 12 movies John Wayne did with John Ford.  The first of 9 Westerns films he had done with John Wayne.  \nWinner of 2 Oscars out of 7 nominations including \"Best Supporting actor\" for Thomas Mitchell and best musical score.",
            "review_date": "2017-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A cinematic masterpiece full of delight and magic, a must-see film for true cinephiles, the one which influence and inspire many great movies of its genre  and not only.It almost passed 80 years since the film's release but  it hasn't lost its fascination and freshness. Orson Welles said he watched \"Stagecoach\" 40 times before he made \"Citizen Kane\".",
            "review_date": "2017-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic for a reason. Also includes one of the craziest stunts I've ever seen,",
            "review_date": "2017-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stagecoach is the western that started all westerns and it's with no doubt that I can say that I can see why. This movie was phenomenal beyond belief. I love going into a movie and not knowing anything about it and then being completely and utterly surprised by how great it was. This is exactly what happened with Stagecoach. \n\nThis is not only a western, but also a glimpse into the human psyche and society. This movie has soul and personality at the center of it. Not to mention all the action at the end and all the stupendous choreographed stunts. This movie has it all! \n\nI honestly have to say that I went into this movie not thinking much about it and ended up leaving the movie completely and utterly entertained and enthralled. \n\nWill definitely definitely be watching it again!",
            "review_date": "2017-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An exceptional western - lost a half a star to some awkward editing in places.",
            "review_date": "2017-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The American West, late-1800s. A stagecoach sets off across the untamed wilderness carrying a mixed assortment of characters: an infamous outlaw, a drunk doctor, a prostitute, a whiskey salesman, the wife of an Army officer, a gambler, a bank manager, the local Marshall and the driver. Animosities and petty differences, and unexpected friendships, surface. Their fortunes take a turn for the worse when they learn that an Apache raiding party, lead by Geronimo, is in their vicinity.\n\nA masterpiece that is the most important Western ever made. Great plot, well directed by the legendary John Ford. Not just a conventional cowboys-vs-Indians / gunfight sort of Western (though there a large element of that) but a character drama too. There is great character depth and development on display and this is used well in developing the story.\n\nSome great themes running through the movie too, especially one of anti-prejudice.\n\nGood performances all round. John Wayne is great as the Ringo Kid and shows a softer side that wasn't always apparent in his later films. Thomas Mitchell deservedly won a Best Supporting Actor Oscar for his performance as Doctor Boone.\n\nMore than just a brilliant movie, a movie that created the blueprint for Westerns, and pretty much defined the genre.\n\nIt also made John Wayne a star. He had acted in plenty of movies before this without much impact but Stagecoach is what truly launched his career as we know it.\n\nJohn Ford had already won a directing Oscar before directing Stagecoach, so this movie wasn't as career-enhancing to him as it was to John Wayne. However, it did set him up as the foremost director of Westerns. Moreover, it was to be the first of many collaborations with John Wayne, a series of collaborations that would see them make movies like The Searchers, Rio Grande, The Quiet Man, They Were Expendable, Fort Apache and The Man Who Shot Liberty Valance.\n\nA brilliant and historic movie.",
            "review_date": "2017-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A benchmark in the genre that spawned the Western talkies, bolstered by complex character development and stunning stunt sequences, providing a worthy milestone to usher both John Ford and John Wayne to the world.\n\nThe prostitute, the outlaw, the alcoholic doctor, the slow-witted driver, the gambler, the marshal, the whiskey drummer, the egotistical banker and the pregnant lady, these are the characters that make up 'Stagecoach', the film that kickstarted the Western talkies that made John Ford the auteur he is regarded as today.\n\nThe plot, while simple and at times humdrum, creates an intriguing situation that unfolds between the film's central characters, and it is from there that the refined character development ensues. Each character is briefly introduced and given a backstory, and their stories are further expanded upon while confined within the stagecoach. It is this alone that makes 'Stagecoach' the classic it is, so simple, yet so well-executed, and it proved a benchmark for the films to follow.\n\nMinor statements and prop-related reveals also add to the sophisticated development the story has to offer, some of which I missed first time around, thus giving us new material with each further viewing. From the \"just got a telegram\" that Gatewood utters (unleashing a flurry of distrust among the group) to the foreshadowing of death in the form of the dead man's hand in a poker game.\n\nHowever what really boasts this film as the technical marvel it is, is the films craft, sure the sound mix might be a little blown-out, but with stunning cinematography, beautiful vistas of Monument Valley (that Ford's films would later utilise time and time again), a score of epic proportions and stunt-work that outshines modern day action sequences (with the horse jumping during the chase scene leaving me in awe). Finally, we have the actors, who, despite some forced dialogue, all provide high calibre performances, Thomas Mitchell in particular who gives the film its comic element but also delivers some more heartfelt and caring drama at times of soberness, and of course, who can forget John Wayne's introductory zoom shot.\n\n'Stagecoach' might not live up to its later counterparts, but for a nearly-80-year-old picture, it does its damndest to provide sheer entertainment through its straightforward narrative and dazzling action sequences.",
            "review_date": "2017-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An intelligent indictment of contemporary society and a surprisingly adept action picture, Stagecoach is a great example of classic cinema that holds up to a modern lens.",
            "review_date": "2017-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An odd assortment of characters on a stagecoach try to stay ahead of Geronimo and his Apache warriors. John Wayne announces himself a star from the moment he flags down the stage with a rifle. The movie might be from the 1930s and endlessly imitated, but no effort is needed to become captivated.",
            "review_date": "2017-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "John Wayne never looked young, but here he looks youngish. A classic, stereotypical Cowboys v. Indians flick, set in a stagecoach (obviously) with an outlaw, a drunk, a salesman, an Army wife, and a prostitute.",
            "review_date": "2017-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good to watch, but not as brilliant today as it perhaps once was.",
            "review_date": "2016-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stagecoach is a remarkable film with clearly defined characters, an intense yet simple plot, and engaging, practical effects.",
            "review_date": "2016-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "John Wayne and John Ford. What more could you want?",
            "review_date": "2016-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Time capsule worthy for the visuals alone. Ford's genius was seeing the potential in an actual stagecoach setting, forcing a rich variety of characters together and playing with cultural stereotypes in a way that is remarkably timeless. And John Wayne's introduction here is one of the greatest establishing shots ever put on film",
            "review_date": "2016-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true American film classic. John Wayne was little more than a B-western film star at the time and the studio didn't want him on this picture, but director John Ford insisted, which led to a collaboration between the two that would last for decades to come and would produce some of the best pictures in film history (\"The Searchers,\" \"The Man Who Shot Liberty Valance\" \"The Quiet Man\" etc.). The story involves a disparate group of characters on a stagecoach trip across dangerous \"indian territory.\" What did film did better than most westerns of the time, beside simple production values, is that it took time to develop characters and also offered some brilliant film direction from director Ford. Orson Welles credited this film with greatly helping him prepare for the making of \"Citizen Kane.\" He's reported to have privately watched this film about 40 times while he was making Kane. The western was pretty much a disreputable genre when this film was made, but Ford wanted to elevate it with this picture and he succeeds on all account. This film still ranks among the greatest films ever made whenever there is an international poll of film critics, and it absolutely deserves to be there.",
            "review_date": "2016-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Couldn't get through it. The characters are mad annoying, excerpt for the drunk, and even he ain't that great. It's like being stuck with a bunch of lame people. Some of the shots are nice but that's about it.",
            "review_date": "2016-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie worked much better for me on a second viewing. At the very least, it is absolutely worth seeing to see just how much it influenced not only the western genre, but also cinema in general.",
            "review_date": "2016-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stagecoach is a simple film about a group of people trying to travel through potentially dangerous Native American territory on a stagecoach. The cast of characters on board are from all different walks of life and have lots of disputes. Naturally, by the end they must learn to set aside their differences and work together to make it through alive. I have to admit, I was never interested in this story. There are a number of story points that I know were explained, but I couldn't possibly tell you what happened because I was bored and distracted almost from the beginning of the film. There are brief moments that grabbed my attention, but it was never held for long. John Wayne was the big star, and I was interested to finally watch a movie starring him, but I didn't particularly like anything he did in this film. His love interest had a more intriguing story, and her relationship with the other riders was the most extreme. But my favorite character on the Stagecoach was the comic relief provided by Thomas Mitchell as the doctor. His constant imbibing was played well for laughs, and yet he was able to straighten up for a more serious scene too. The movie probably could have held my interest more if they met more obstacles along the way. Most of the film, though, was traveling in surprising safety until they had to stop. Then they hear about all the military protection that had left that location. Then they decide to move on again with a renewed dread. There was no mounting to the tension for me as a viewer because the threat of Geronimo seems just as imminent at the beginning as it was in the end. Plus the big confrontation doesn't take place until the very end, and by then I was completely checked out. Stagecoach is definitely not a film for me.",
            "review_date": "2016-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my absolute favorite movies.",
            "review_date": "2015-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great western.  Well done in all ways.",
            "review_date": "2015-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "John Ford's \"Stagecoach\" boasts dynamic characters with satisfying arcs, classic thrills, a breakthrough performance by John Wayne, charismatic set pieces, as well as a charismatic director--it is rightfully deemed one of the most influential Westerns. Wayne's performance is restrained and charming, and among his other stagecoach colleagues are an empathetic prostitute driven out of town, suitably named Dallas (Claire Trevor), the vulnerable stagecoach driver Buck (Andy Devine), an alcoholic and shameless doctor Boone (Thomas Mitchell), a cowardly whiskey salesman Samuel Peacock (Donald Meek), a rigorous marshal Curly (George Bancroft), the mysterious gambler Hatfield (John Carradine), an unlikable banker Henry Gatewood (Berton Churchill), and a stressed wife Lucy Mallory (Louise Platt). With these characters--empathetic, sympathetic, mysterious, charming, likable, unlikable--all crammed in a claustrophobic stagecoach, we ultimately get a character study with Western thrills thrown in there that fill us with anxiety in losing one of them, may it be the unlikable banker, we still fear for him.",
            "review_date": "2015-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With an inspired set of characters played to joyful heights, as well as serious drama and one heck of a chase scene, John Ford made the quintessential western.",
            "review_date": "2015-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wonder film - well worth watching!",
            "review_date": "2015-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Revolutionary for its time and definitely a movie worth seeing.",
            "review_date": "2015-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Damn good western movie! Why haven't you watched it yet! Your missing out!",
            "review_date": "2015-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Serviceable western/road movie hybrid, but no better than that when it's abstracted from the time a prestige western was a novelty.",
            "review_date": "2015-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie for a Western. Had a genuine sense of real authenticity for time & place, character & mood.",
            "review_date": "2015-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully shot and tremendously influential, John Ford's landmark film laid the very foundations of the American Western genre back in 1939. Orson Welles reportedly watched it over 40 times before shooting Citizen Kane, but to the modern viewer, Ford's grey film holds little charm until its final 30 mins.\nFord's chase scene is a masterclass in editing and cinematography, but in order to to see it, we're first forced to endure over an hour of saccharine, washed-up characters, sitting around whining about how they're just waiting to be ambushed. \nThrown together by interesting circumstances, Ford's characters all have backgrounds, wants and opinions; we know this because they won't shut up telling us about them. \nWhether they're are actually interesting or not (spoiler alert: they're not.) is a whole other matter. By the time the dreaded enemy shows up, we're so sick of their soppy faces, we're left hoping they'll all just die soon so John Wayne can ride off into the sunset.\nA classic film template, replicated, improved and de-dulled a thousand times since.",
            "review_date": "2015-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easy to see how this elevated the Western genre from B movie schlock to dramatic fare. Excellent storytelling.",
            "review_date": "2015-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's difficult to count the number of ways in which Stagecoach directly influenced American cinema. It revitalised a flailing genre and established it's most famous conventions. It made a star of the ruggedly handsome John Wayne and it was the first important milestone in a directorial career that would have John Ford recognised as one of America's most important film makers. Stagecoach is a landmark Western with one of Wayne's finest roles, a three dimensional ensemble cast and virtues that hold up today.",
            "review_date": "2015-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A group of strangers: a prostitute, an alcoholic medical doctor (both driven out of town by the teetotaling Women's League), a flamboyant homosexual whiskey-maker, a very wooden (think Kristen Stewart) preggo wife of a military officer, a prostitute-with-a-heart-of-gold, a banker who absconded with all the bank's money, and Confederate gambler (John Carradine) head out in Arizona Injun country on a stagecoach. Along they way the find the outlaw john Wayne. On the journey there's romance (which actually dominates the final act), childbirth, fights, etc, but the big pay off is when Geronimo and his band of redskins attempt to slaughter the motley crew. Great action and stunts! As one would expect, there are a lot of funny parts with all the different character-types.",
            "review_date": "2015-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Through emotionally-complex characters and confident direction, Ford's \"Stagecoach\" essentially cements several of the archetypes definitive of the classic Western (honorable convicts, prostitutes with hearts of gold, crooked bankers, lovable drunks, etc.), certainly making it one of the best and most influential films of all time.",
            "review_date": "2015-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Stagecoach\" is a thrilling adventure and an early brilliantly-filmed classic western featuring a young John Wayne.",
            "review_date": "2014-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Western for the fan of the modern 'disaster movie'. Trevor and Wayne express their love through subtle glances throughout the film and it honesty in the honesty of the film.",
            "review_date": "2014-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never saw this Western classic.  Not bad.",
            "review_date": "2014-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Besides the vicious jabs made toward non-whites, this film is nothing more than excellent. The actors make their roles their own, especially Thomas Mitchell (who deserved his Oscar) and Claire Trevor. The score is atmospheric and uplifting. The climax was one of the biggest thrills I have ever come across. A true Hollywood classic!",
            "review_date": "2014-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic Western with a varied and interesting cast of characters riding a stagecoach through a territory plagued by Indian attacks and devoid of cavalry, this film creates atmosphere, suspense, and psychology in the iconic landscape of Monument Valley.",
            "review_date": "2014-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At last, people of 1939, John Ford makes his big comeback to the western genre he pioneered after a relatively sprawling hiatus of, like, four months or something. Ford made a lot of films, and arguably too many of them were westerns, but people were still excited when Ford got back into them after 13 years, especially when it turned out to also be his first western with sound. Oh yeah, because you just can't take John Wayne seriously unless you hear his voice... is what I'm saying \"in a sarcastic tone\" now that Wayne is tragically dead. Yeah, Wayne may have had that silly Iowa accent, but I still wouldn't have wanted to mess with him, especially when he was young and... well, about as fresh-faced as that thick forehead was going to allow him to be. I hope the people of the '30s were getting used to him, because this wouldn't be his last rodeo with John Ford, although Ford, not quite realizing that at the time, took a little while to get Wayne in this film's plot. Everyone rambles on about Wayne's presence, but remember, people, that, as the poster tagline will tell you, this is about \"9 strange people\", even though it's not exactly a \"powerful story\". You better believe that the film is decent, but don't entirely believe the praise they put into the poster, for a number of reasons.\r\n\r\nThis is something of a fluffy affair, with a light heart and humor that has, since 1939, grown dated and cheesy, with even the conflicts and plot being histrionic, maybe even out-and-out thin. If the narrative isn't superficial with its subtlety, it's simply superficial, with depth limitations that were all too common in fluffy flicks such as this one at the time, yet could be compensated for if it wasn't for developmental shortcomings. I reckon exposition is adequate, but there's little real attention to characterization which is already lacking in range altogether, partly because there is a little too much to flesh out in merely 96 minutes. This runtime isn't aggressively brief, but it's still a little too short for John Ford to have time to establish a firm sense of adventure, which is a crying shame, seeing as how the film doesn't have much going for it outside of the adventure. With all of my rambling about how thin storytelling is, superficiality is all but fitting, as the story concept, no matter how lively, is lacking in true meta and tension, of which there is still enough for the other shortcomings to kind of aggravate. With all my talk about how there's only so much to talk about in regards to this film, maybe storytelling could have been inspired enough to mold a rewarding western, as there are highlights in inspiration which reflect full potential, but in the end, whether it be because of the shortcomings of the time or simple missteps, the final product slips as an underwhelming, maybe even kind of forgettable classic. With that said, the effort holds enough of your attention to entertain plenty, perhaps even immerse with its visuals.\r\n\r\nThis is the first of John Ford's westerns to be shot in Monument Valley, which sees quite the breakout as a hot spot for western film art direction, being sweeping enough by its own right, and decorated well enough with timely production designs, to adventurously draw you into the time portrayed in and scope of this film. No matter how superficial the storytelling gets, production value at least succeeds in reinforcing a sense of adventure that this narrative ought to thrive on, seeing as how the plot concept is dynamic and subtly layered enough to potentially compensate for a lack of dramatic meat. That compensation is lost, but not entirely, for even Dudley Nichols's and Ben Hecht's script's tastes in colorful humor and set pieces have endured through all of the cheesy dating to entertain, even on paper. As for the execution, there is also something a little lacking about John Ford's direction, and yet, there is also enough color to the storytelling to hold your attention just fine, with style that is sometimes focused enough to hold some tension. Mind you, the tension only comes into play when the conflict stands, and make no mistake, conflict is limited, but it is there, and until it shows up, the film still proves to be an entertainingly well-told adventure, with its share of memorable plot points and characters. Of course, the characters might only be so relatively memorable because of their portrayals, which don't have much material to work with, and may even be a little dated, yet have stood the test of time well enough for just about everyone to charm with his or her own distinct charisma and, for that matter, chemistry, which drives comradery. Comradery is important in a film this adventurous, yet still so intimate, and no matter how thin characterization is, the performers draw you into the heart of this flick, but not alone, as there is also enough heart to dated storytelling to thoroughly entertain in a classic, if thin fashion.\r\n\r\nIn conclusion, there is some cheesily fluffy humor and plotting, which join developmental shortcomings in reinforcing a certain superficiality to the telling of an already borderline inconsequential story, thus, the final product falls as underwhelming, but through grand production value, reasonably colorful scripting and direction, and charismatic performances, a sense of adventure is done enough justice to make John Ford's \"Stagecoach\" a pretty fun western classic, despite its many shortcomings.\r\n\r\n2.5/5 - Fair",
            "review_date": "2014-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good western. It's not as good as everybody makes it out to be. (Although it is John Wayne's first hit). Directed by John Ford is notable.",
            "review_date": "2014-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a great western, road trip movie, John Wayne vehicle, with a message of tolerance that brought the concept of an ensemble cast without one clear bad guy",
            "review_date": "2014-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stagecoach is quite impressive in its cinematic and sprawling qualities. The cinematography is particularly superb here. John Wayne and Claire Trevor both delivered and stole the show from the other vastly less memorable players. The movie is fun at times, but overly concerned with spectacle and not enough with plot. It was hugely influential for sure, but it's one of those overly simplistic westerns that aren't that appealing in comparison to the genre's more heady affairs. As a result, this is a solid, but highly overrated picture.",
            "review_date": "2014-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was ok. Wayne had a nice tight tush.",
            "review_date": "2014-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is often viewed as a film that set a template for other westerns. It may have been a ground breaker at the time but it seems boring now as the genre has moved on and improved itself. A path blazer for sure however.",
            "review_date": "2014-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyed this one. Really like John Wayne, good storyline. Solid film.",
            "review_date": "2014-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What makes this a western masterpiece is the focus on the characters developments, leading up to a masterful finale after a thrilling climax. (A-)\n\n(Full review coming soon)",
            "review_date": "2014-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How riveting it is to be immersed in this classic influential Western that is not only entertaining and exciting but is above all a sincere story that always rings true with its unforgettable gallery of three-dimensional characters who grow on us and make us care so much about them.",
            "review_date": "2014-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "IN PROGRESS\n\nMonument Valley wsa used by director Jon Ford, the real star of the film.\n\nThe movie that made John Wayne a star.  All star cast.",
            "review_date": "2014-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The template for Westerns. Holds up very well.",
            "review_date": "2014-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite the rumours of a possible Apache attack, a group of travellers ride a stagecoach from a small town in New Mexico to Lordsburg, picking up an outlaw escaped from prison who calls himself Kid Ringo on the way. A landmark western and certainly one of the first to have a more modern, intimate and adult feel to it. The final chase sequence is deeply influential to American cinema in general, and filled with breathtaking stunts that just don't age. This first of many John Wayne and John Ford productions, Stagecoach automatically elevated Wayne to stardom and updated an already ageing and restrictive genre.",
            "review_date": "2013-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never thought I'd be saying this about a John Wayne movie, but just don't see the appeal...or why all Western buffs consider this a classic.",
            "review_date": "2013-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely made Westerns what they became, but the end felt tedious, continuing unnecessarily past the focus of the film.",
            "review_date": "2013-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stagecoach (1939)\n\nI'm afraid that I'm not normally a big fan of John Wayne, but I do have my favorite movies of his, and this is one of them.  John Ford directed an ensemble cast to give us the ultimate western in his favorite location of Monument Valley, Arizona.\n\nStagecoach driver, Buck Rickabaugh (Andy Devine) travels reluctantly through Apache Territory with a coach-full of differing characters with the sheriff, Curly Wilcox (George Bancroft) riding shotgun.  They come across the Ringo Kid (Wayne) along the trail, who just broke out of prison, and is headed for Lordsburg to take revenge on the Plummer brothers who framed him.\n\nInside the tiny confines of the coach, he meets hooker with the heart of gold, Dallas (Claire Trevor), the mild-mannered alcohol salesman, SamualPeacock (Donald Meek), followed closely by the alcoholic, Doc Boone (Thomas Mitchell), the pregnant southern bell, Lucy Mallory (Louse Platt) looking for her soldier husband, along with her protector, gambler, Hatfield (John Carradine) and a gruff banker with a secret bag of money Henry Gatewood (Berton Churchill).\n\nThe film also features some great stunt riding by Yakima Cannutt.  If you've never seen this film before, you owe it to yourself to watch it.",
            "review_date": "2013-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Three Johns define the legend of \"The American West\".",
            "review_date": "2013-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot is very contrived. Some of the characters are shallow caricatures. And most egregious of all, the Native Americans are depicted as violent , ruthless savages attacking for no reason, the noble and adventurous white people, when 90 % of the time, the opposite was true. So WHY am i giving it 5 stars? Four words: John Ford/John Wayne. The manner Wayne is introduced is legendary, and the climactic attack scene is impeccable, perfectly done.",
            "review_date": "2013-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "John Ford's trailblazing western is beautifully made. In 1939, a young, tall, lanky John Wayne was still likable as the world had yet to found out what a hypocritical piece of #### he really was.",
            "review_date": "2013-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn't particularly enjoy this film; then again it's 75 years old, so audiences today aren't accustomed to theater-like dialogue and production codes. Everyone's a critic.",
            "review_date": "2013-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliantly engrossing.",
            "review_date": "2013-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best performance by John Wayne that I've seen and I'm not his biggest fan. This was more action packed, funny, and interesting that a lot of westerns I've seen but it's easy to switch off when it gets a bit slow near the end.",
            "review_date": "2013-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "watched this years ago",
            "review_date": "2013-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ah... Stagecoach. The film that basically defined the Western genre, made director John Ford a household name, and was the film that made John Wayne one of the most successful Hollywood actors of all-time. But unlike many, including my uncle, who's a massive Wayne fan, I'm not the biggest fan of Wayne's films. In my perspective, there have been some that have been worth the hype (such as The Searchers and Rio Bravo), while other \"acclaimed classics\" I found were overrated (I'm looking at you, The Quiet Man!). When I finally managed to watch the first major film of \"The Duke\", I finally began to realize why John Wayne is an excellent actor and why he has many fans, including my uncle.\r\n\r\nStagecoach is about a group of people who people who travel together to a certain town on a stagecoach. The problem with the travel is that they are going through Indian territory and they have to watch out for possible attacks. Those on the stagecoach include a former prostitute (Claire Trevor), a pregnant wife (Louise Platt) who's husband is in the cavalry, a suspicious gambler (John Carradine), a drunken doctor (Thomas Mitchell), a nervous whiskey salesman (Donald Meek), a crooked banker (Berton Churchill), an always optimistic driver (Andy Devine), a protective sheriff (George Bancroft), and last but not least, the polite but tough criminal \"The Ringo Kid\" (John Wayne).\r\n\r\nThe thing about Stagecoach is that before Stagecoach was released, westerns were referred to as B-movies (kind of like the horror films at the time), and many weren't taken very seriously. But with Stagecoach, the addition of action, drama, comedy, and the mysteries of the characters made Stagecoach film that first changed the game of the western genre. While the story sounds like a simple cliché, in actuality, the reason why the film works so well is that while watching, you have to solve the mysteries of the characters' intentions to fully feel satisfied of the film.\r\n\r\nAnd speaking of the characters, the actors playing the characters all do fine jobs in their roles. I won't go into full detail on everyone involved in the stagecoach, there's just so many to name, but before I fully go into John Wayne, the performances I really have to give a special shout-out to are Clair Trevor as the fallen prostitute, Louise Platt as the pregnant wife, and Thomas Mitchell, who won an Oscar for his role as the drunken doctor. Now, before Stagecoach, John Wayne had been involved in dozens of films, but wasn't going nowhere when it comes to recognition in Hollywood. When John Ford called Wayne in for the lead actor in Stagecoach, the producers hated the idea, instead wanting Gary Cooper to do the role of \"The Ringo Kid\". (Nope, I can't picture Sergeant York as The Ringo Kid). But Ford got his way and Wayne got the role, and it was a smart decision. Wayne truly nailed the role. He's tough, he's honest, he's polite to the ladies, and he knows how to solve problems. While I might not be the biggest Wayne fan, I do admit that Wayne can act remarkably well, and I honestly rank this as one of his best roles that I've seen (though arguably his greatest performance that I've seen still remains The Searchers).\r\n\r\nStagecoach was the first of many westerns where John Ford shot the film in Monument Valley, which is the borders of Arizona and Utah, and with each film, the locations are indeed excellent, with Stagecoach truly a standout. The scene that really gets me in an action sequence where the crew gets attacked by Indians. The stunts are unbelievable, and the camera angles are very unique for the time. Even the drama between the characters gets you, and when the film hits the comedic route, courtesy of Andy Devine as the driver, it's pretty funny. The score, which consists of American folk tunes, is excellent in terms of awe and excitement. \r\n\r\nWhile I admit that Wayne's shootout at the end was very anticlimactic, Stagecoach is truly an excellent western, with excellent performances, particularly Wayne in his first major role, Ford's fantastic direction, and a brilliant storyline. Now this is how you do a western!",
            "review_date": "2013-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I couldn't finish watching this movie. My modern sensibilities expects better acting, scripting, dialogue, and settings.",
            "review_date": "2013-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Couldn't finish watching this movie.  Too old and kitschy.",
            "review_date": "2013-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1939 remains to this day a pivotal year in the history of American film. Among the year's benchmark movies : Gone With the Wind, Goodbye Mr. Chips, Of Mice and Men, Dark Victory, Mr. Smith Goes to Washington, Ninotchka, Wuthering Heights, The Wizard of Oz, and of course John Ford's western masterpiece, Stagecoach.",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most influential movies of all time!!! Orson Welles said that he watched it more than 40 times during the making of Citizen Kane.  Character development may seem like ever other movie other made, but thats because Stagecoach was basically the blueprint for modern movies.",
            "review_date": "2013-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great flick for its time..",
            "review_date": "2013-07-06",
            "source": "rt",
            "lang": "en"
        }
    ]
}