{
    "rating": 8.9,
    "release_date": "1939-07-08",
    "num_reviews": 150,
    "genres": [
        "French(France)"
    ],
    "summary": "André is having an affair with Christine, whose husband Robert is himself hiding a mistress. Christine's married maid is romantically entangled with the local poacher. At a hunting party, the passions of servants and aristocrats dangerously collide.",
    "reviews": [
        {
            "content": "This is a great film. Brilliant social satire that is lively, funny and all around entertaining, but with a message about class and the interaction between haves and have nots. Noone is spared from the satire though, and thats what is so interesting.",
            "review_date": "2023-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On a surface level, \"Rules of the Game\" seems deceptively trivial; even the comedy feels sporadic and inconsistent. The passive fashion in which the film regards sudden moments of tragedy and callousness is jarring, and we're left with a sense of a film that is figuring itself out in the process of unfolding. Yet looming in the background is our knowledge of the wartime carnage that was to come, and the uneven nature of the work produces a wholly unique impact when one accounts for Renoir's likely premonitions of the darkness facing the nation and indeed the world at large. Dialogue is generally casual and yet slyly revealing and insightful, and the playfully unorthodox choreography of the film hits right at the center of Renoir's mockery of superficial elegance. We laugh, we are shocked, we squirm, and we reflect. If ever there were a film stubbornly resistant to being pigeonholed in every technical, thematic, and aesthetic aspect, \"Rules of the Game\" surely fits the bill. Transcending such limitations, the film acquires an ability to increasingly dazzle us with repeated viewings, and is second to none in its capability of yielding up new revelations and insights every time.",
            "review_date": "2022-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Set in the days before the start of World War II, Jean Renoir's The Rules of the Game is a scathing satire of French aristocracy. Over the course of a weekend at an opulent country estate, the wealthy gather to indulge in infidelity, boorish behavior, hunting and, ultimately, murder, all under the watchful eyes of a plentitude of servants.  On a technical level, it is masterful.  The blocking of the shots is amazing, the editing is remarkable, and Renoir's subtle but effective camera movement is effective in capturing the antics of the characters.  If there is a fault with The Rules of the Game (is that cinematic sacrilege?), it is the size of the cast.  There are so many characters, many of whom seem to serve no purpose, that it is often difficult to determine the nature of the relationships.  On the bright side, things make more sense with a second viewing, which isn't always a bad thing.",
            "review_date": "2022-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good… it's real, funny, biting with good acting and postmodern humour. \n5 stars for quality work. 0 stars for the fact this could be a reality tv show",
            "review_date": "2022-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Regarded as an all time classic but clearly not by me. The characters were bawdy but uninspiring. Interesting to see an early Gallic exposition of open monogamy and philandering. These black comedy affairs of the era in Hollywood had more character than this film in my opinion.",
            "review_date": "2021-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful work by Renoir despite enormous and almost contemporary difficulties, plus an approaching war. The DVD supplements on the other hand are out of the ordinary. Excellent.",
            "review_date": "2021-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Among wine lovers it is well-known that certain wines need to be decanted ahead of time, some for many hours, if all of their aromas and flavors are to emerge; if merely \"popped and poured\" these wines don't seem special at all.  So it is with The Rules of the Game.  At a simple level it is an elaborate farce, similar but much inferior to its contemporaries such as Bringing Up Baby or His Girl Friday.  To decant The Rules of the Game means to put it in the context of pre-war France and to understand how scandalous, uncomfortable and innovative it was at that moment, and how it is,  unlike those two pure comedies, only superficially a farce, but really a challenge, an indictment, a deep critique of France's ruling class.  After several viewings the full weight of this film, all its aromas and flavors, begin to emerge.  Then, after absorbing the complexity of the story and the complexity of the shots, the full force of the film comes through.  There are many fine performances, with an outstanding and nuanced Dalio holding the center stage along with Renoir himself, but it is decidedly the director's unique creation.",
            "review_date": "2020-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just started watching \"The Rules of the Game\" by chance on TCM and I was totally entranced. Throughout the film is engaging, charming and with moments of revulsion and, most of all, utterly fascinating. Lest one forget, oh so French - and I mean that in a good way. Renoir's master work stands on its own as an exceptional film. Yet you can't just help catching so many film tropes - screwball comedies, women's flicks, a sense of film noir. These are all seamlessly blended in to a a combination of \"Gosford Park\" and Downton Abbey\" with humor, desire, pathos, tragedy and ultimately a commentary on the human condition. Spectacular!",
            "review_date": "2020-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I find it a confusing and very fast film, I was unable to appreciate anything of this work",
            "review_date": "2020-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If the film's exploration of the indifference of the wealthy and inherent ludicrousness of their own priorities when the undistinguished face potentially deadly repercussions was poorly received in France on the eve of the Second World War, it was only because the commentary was too on-the-nose for its audience. A beautifully composed, scathing, and profound exploration of class divides and human nature that bridges farcical satire and sincere drama. (5/5)",
            "review_date": "2020-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic or not, I might not have understood the rules of the film.",
            "review_date": "2020-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i wasn't entertained...",
            "review_date": "2019-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Rules of the Game has the feeling of a stage play. A great deal of the film takes place in one house over the course of a couple days. There were a few scenes where it was clear they were leaning towards making this a comedy, because some of the characters are funny, but it never was humorous to the point of making me laugh. It’s a shame because the rhythm of the film would have worked great as a rapid-fire comedy of manners, with all the characters walking in and out of assorted rooms having their own little conversations. Instead the film is much more invested in exploring the dramatic elements, with only a few brief exceptions. Sadly, the drama is straight out of a soap opera. I have no interest in any of these storylines. The cheating spouses, the scorned lovers, and all the bickering arguments are mind-numbing for me. If there was one protagonist who was above it all then perhaps I could connect with that person and endure the frustration of The Rules of the Game, but every character seems to be mired in a love triangle of some type. I know this kind of upstairs-downstairs drama is fascinating for some people, but I simply don’t care. It’s even more infuriating in this film because most of the characters put themselves into these situations. Everyone seems to actively work towards gathering all the lovelorn people under the same roof, as if they have no idea that this will be a disaster. It seems that everyone in The Rules of the Game behaves entirely on impulse. We have to sit through two hours of people who never think through a single thing they do. It’s maddening at times, and I constantly found myself wishing someone would act with a little logic. Also, and I’m sure this is a horrible thing for me to say, I struggled to see why every man in the film was falling head over heels for an unattractive and uninteresting woman. They treat Nora Gregor’s character like some kind of goddess, which baffled me. All of that being said, I must admit that The Rules of the Game has a cohesive story with some twists and turns, so it wasn’t all bad. The final scenes were almost Shakespearean, so at least it ended on a high note. But overall this clearly isn’t a movie for me.",
            "review_date": "2018-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A mostly average film, with average acting and plot (3 stars), plus half a star for its social satire (3.5 stars), minus half a star for its extended bunny/pheasant massacre (3 stars, and good lord, I don't care if this is commentary on man's cruelty, it's awful).  \n\nAt its best, director Jean Renoir gives us brilliant criticism of just how vapid and morally bereft the bourgeoisie of his day were, putting the mirror up so close to French society that audiences were outraged and booing in the cinema.  While his characters are jovial enough in various social gatherings, they have no scruples, sincerity, or intellectual depth, and spouses cheat on one another not so much out of real passion or love for someone else, but out of ennui.  \"Sincere people are such bores,\" one says, reflecting a lack of values.  They calmly slaughter bunnies that have been driven towards them, considering it a \"hunt\", one laughs as he relates the story of a man who died in a self-inflicted gun accident, and later there is a remarkable lack of real concern or empathy when someone else is hurt (being vague on purpose).  They goof around sophomorically in front of servants, who clearly don't respect them, but the servants themselves also have their own infidelities.  In 'The Rules of the Game', there are very few real rules, just the entitlement to make up the rules that comes with wealth.  The characters are maddeningly unlikeable, and of course, that's the point.  \n\nRenoir does some interesting work with the camera in the film, putting it in motion almost as if it's a character or we're voyeurs into these scenes as the audience, but I think more is made of this than it should be.  Similarly, I don't put much in the fact that the film was made in 1939 and released less than a year before Germany invaded France; to me that seems more coincidence than Renoir's statement that it is a \"war film and yet there is no reference to the war.\"  As the action picks up in the second half, with guests scurrying around the chateau either to arrange for or break up trysts, it feels very much like a Hollywood screwball comedy from the period, with farcical elements and attempts at humor which aren't all that funny (e.g. the bear suit).  There's enough here to make the film watchable, but it's hard to understand how it ended up so highly regarded.",
            "review_date": "2018-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Rules of the Game is a critics' darling, but I wonder how it fares with general audiences. It is a skewering of upper-crust French mores (and those of the working classes who try to emulate them). One could probably make comparisons to today's \"liberated\"/lost society. This film's troubled history shows as much as the French mock/look down their noses at other societies, they are unable to laugh at themselves. Critics recommend multiple viewings of this movie, and they're probably right. There's a lot going on, and a lot to take in. After my first viewing, I found myself slowly immersed in the drama, but also a bit overwhelmed by the size of the cast and all the romantic intrigue. Like Citizen Kane, it is a great film, remarkable for its vision and influence, but might leave some wondering what was the big deal.",
            "review_date": "2017-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "People keep saying this movie got savage reception when it opened, but I felt the movie is the total opposite of savage. People float around a country estate, fox-hunting and talking ribaldly (is that a word?) while I struggle to relate to the characters, because usually I can totally relate to French aristocrats from the thirties. Then it ends. What really shows that Renoir was just going through the motions is that though there aren't any special effects (I know, they didn't have those back then) there aren't even any places where you can tell he would put some if they had the technology. I found that disappointing.",
            "review_date": "2017-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a masterpiece - elaborately demonstrating how to block a scene and edit in accordance with style, and effortlessly explaining the rules and manufacturing of the cinematic medium.",
            "review_date": "2017-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like the cheeky classical music selection for the opening credits. I guess it kind of sets the tone for what's to come. Poor Andre, he did the whole plane journey over the Atlantic Ocean for a women he loves and she's not even there to welcome him. I'm glad he admitted how he really felt exclaiming,  \"She's disloyal!\" He seems like a pretty modest and humble dude as well. Mad respect. \n\nI admire dearly the restoration they achieved for this movie both visually and auditory, but it definitely shows it's age lol. you can tell it's an old movie form the 30's-40's. I like how charming and charismatic Lisette, their house maid, is. She seems like a pretty sharp cookie. Oh to be a rich high society cheating asshole. That's basically what Christine and her husband are. She tells him that she trusts him completely and immediately after he goes into the room to phone his mistress. The shame. The disloyalty. It's repugnant. And what a disgusting and haunting display of hunting for sport. That's high class society for you - taking pleasure in massacring animals. And boy did they kill a lot of rabbits and pheasants. \n\nAnother thing that annoys me of French cinema, and I guess something that is part of French culture, is how hopelessly romantic and over the top they can be, to the point where it's annoying. Like when the characters say, \"If I don't see my love again, I'll die. I'll parish into a million pieces and fade away into the universe.\" It's like dude, get over it. It's just a girl. There's plenty more out there. Like do you have to be so over the top? Lol. That's just my opinion.\n\nThe movie actually makes an interesting turnaround once the stage play with the ghosts and the skeleton suit guy start. The whole mansion begins to explode when husbands start to cheat with mistresses and wife's start to cheat with lovers. Fights break out and for those couple of minutes, the movie makes a turn around. But it barely makes up for the rest of the uneventful movie. \n\nI found it very hard to like any of these characters, or even remotely relate to any of them. It became a difficult watch for me. I felt like the pacing was chaotically fast at times. Dialogue felt like it was rushed. Watching this movie was a chore, it felt like a task and a half. I didn't really enjoy or care for most of it. I found the movie pretty boring and uninteresting. It was honestly really lame. A lot of the moments that I guess were supposed to be funny just ended up being either cringe or really lame. I actually started fast forwarding to get through it quicker around the middle mark of the movie. Overall, I wouldn't watch this movie again. Next.",
            "review_date": "2017-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jean Renoir is doing all sorts of madness here and the film is a combination of absurdity and powerful thematic material on the French Upper Class especially in a critical period of history.",
            "review_date": "2016-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a script that has some suspense, but no way of connecting with context or any of the characters on a respectable level, Jean Renoir's affair comedy is, in my opinion, overvalued.",
            "review_date": "2016-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An ensemble film about some very very sophisticated French people retreating to their country estate for some hunting and some flirting.",
            "review_date": "2016-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Discreet French bedroom farce (of its time), for those who don't parle la lingua, that barrier will probably be a bridge too far on top of the confusing number of characters and the not-great film transfer.",
            "review_date": "2016-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best part of this film is the story: it's simple. At the same time, it's also incredibly complex. Not too many films achieve this and make it look effortless. This film does. What's more is that the story is deep. Not just in terms of the plot or storyline. Rather, in terms of the message the film gets across to its audience. What we have is a message about the upper class, the lower class, and society. Where do we fit in? Where do we want to fit in? And what will we do to fit in where we want to fit in? Much of the film is focused on the upper class; however, what time is spent focused on the lower class is what really makes an impact. Primarily because the film is made for the lower class. Renoir creates a masterpiece. It's arguably more of a masterpiece than what Welles did with Citizen Kane. Bu that would be a review in its own entirety.",
            "review_date": "2016-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jean Renoir's film is a magnificent piece, and while it may not be a film that sticks close to one's heart as some of the other masterpieces of cinema do (since the film is about a society, and not about any particular characters), the film is still an astonishing achievement technically and thematically.",
            "review_date": "2016-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot balance is amazing. All-around very well made movie with deep meaning.",
            "review_date": "2016-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just wasn't really able to follow this. Maybe because I'm sleep deprived. But I also found it hard to care about these characters. Is the point that they're all hypocrites or tritely immoral? Okay.... plenty of people are. Why should I care?",
            "review_date": "2016-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My research into this movie lead me to a NY times review which described the film as a comedy. I have since stopped reading NY times materials. Since most of the reviews in the NY times are written by wealthy persons writing under a psuedonym, it's understandable that they could find the plight of the poor to be amusing. The film is incredibly depressing. It's about how wealthy idiots use the poor like toilet paper to clean up after themselves in the bathroom after doing their 1 or 2, or whatever it is that they command the general population to call it, in the toilet. It's about how the wealthy create laws and compel the poor to break them, completely ignore and flaunt the laws they created, and are never punished or prevented for their unforgiveable behavior.",
            "review_date": "2015-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible film. Everything was superb!",
            "review_date": "2015-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Released to a rather savage reception back in 1939, even being banned in its homeland for its potentially ill effects on the contemporary youth. Over time it has grown into a classic, with seemingly every modern critic showering it with praise. Well, call me a stick in the mud, but it didn't work for me at all. I mean it REALLY didn't work. I understand its message: The upper class are amoral and contemptuous of those lower than them, and will do whatever they want with a devil-may-care attitude and to Hell with the consequences. I can see why it was so vilified by those it was taking a swipe at, because sometimes its peoples inability to understand a films themes that make it so hated. But what I really couldn't stand was the movies delivery. It has the non-stop, rambling dialogue often associated with 'classic' movies, and is completely unrelenting in throwing it at the audience. There's almost no moments of quiet when the film can breathe, it's all fast-paced, often benign chattering or loud music assaulting our ears at all times. None of the dialogue is very funny or even particularly insightful, and instead of scenes which subtly reveal the flaws and hypocrisies of the characters, we get loud, annoying, never-ending sequences of farce. Watching the majority of this film is like being forced to endure a Laurel & Hardy episode with the volume turned up full and the speakers positioned directly beside your head. All I felt by the end of this movie was tiredness and frustration. I'd learned nothing, got to know none of the characters, and was in almost total agreement with the critics who slammed it over 50 years ago. Near the end of the movie one of the characters turns to a friend and mentions 'putting an end to this farce', and I couldn't prevent myself from yelling 'PLEASE!'",
            "review_date": "2015-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Rules of the Game is regarded as a classic by many and it is for good reasons, but it fails to reach its potential in my opinion. The last act is very good and powerful, there are some great dramatic moments, the theme is of course terrific and the direction is superb as well as the cinematography which is stunning, but the character development is so-so owing to the large ensemble cast leaving little room for it, there aren't enough dramatic or funny sequences and it has way too much gossip and annoying yelling in it. It is solid, but unfortunately not as great as it could have been.",
            "review_date": "2015-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lot gets lost in translation, but this is coming from an American here. I didn't quite understand it, but what I saw, captivated me. It's a madcap comedy, with a biting satirical edge on the extremely wealthy. Think \"Gosford Park\" meets \"What's New, Pussycat?\". It's classic surrealist comedy. It's cinematography was extraordinary, creating for the first time in cinema, the deep-focus. Not much else I can say, words simply can't describe it.",
            "review_date": "2015-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought it was good but it was hard to identify with any of the selfish immature characters. They all seemed very much self-involved and into rendezvousing with whoever they pleased at other people's expense. There was maybe only one deep conversation the whole film, otherwise most of the film was a cat and mouse game involving love trysts. It was dramatic and in the end even with the last scene I didn't leave you with much, just how careless they all were. Apparently the point of the movie was to ridicule upper-class people, as you can see with that ghastly hunting scene. Nevertheless its hard to like a movie with such fake  characters, intended or not. Some of this also might be hard for me to relate to at least (like having mistresses) since it was set so long ago and I've never really been around people like this who have way too much money and time on their hands. I prefer other classics that are more relatable. Shame the one actress killed herself, you could tell she had a lot of talent and could connect well with camera.",
            "review_date": "2014-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The brilliance of the film apparently eluded audiences at its release, but seen nowadays, it ranks among the supreme masterpieces of moviemaking.",
            "review_date": "2014-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While I don't subscribe to the general opinion that this is one of the greatest films of all-time, this upstairs/downstairs look at the lives of the rich was good fun.",
            "review_date": "2014-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very Shakespearian in its tragic elements. We see this tale unravel in complete and utter chaos. It's breathtaking.",
            "review_date": "2014-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When I watch an Antonioni film, for example, I wouldn't feel like he was making a comment on class, because the existential element is so strong that it seems to absorb the whole thing. But when I see this, I can immediately say \"Ah, Renoir is mocking these spoiled characters\". It's proof that with a lighter heart, you can see everything more clearly. Robert Altman clearly learned a great deal from him.",
            "review_date": "2014-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Renoir's almost-lost pre-WWII demoralising comedy is the introductory piece invites me for a first glance into his everlasting cinematic legacy. After numerous reconstruction, the extant version of THE RULES OF THE GAME is nearly intact, the narrative circles around a bourgeois couple Robert de la Cheyniest (Dalio) and Christine (Gregor), who invite their friends and kins to the countryside chateau for a leisurely sojourn, yet it is an acrid send-up of the callousness and duplicity of French society at that time, an exceptional chamber drama which anticipates the likes of Altman's GOSFORD PARK (2001, 9/10) and Woody Allen-esque moral satires. \nread rest of the review on my blog: http://lasttimeisawdotcom.wordpress.com/2014/05/19/therulesofthegame1939/",
            "review_date": "2014-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i respect the film...but i did not necessarily enjoy it.",
            "review_date": "2014-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's often said that \"life is a tragedy for those who feel, and a comedy for those who think\". It's fitting then that 'The Rules of the Game'; a rather melancholic story about unrequited love, loyalty, and a self-obsessed French aristocracy, is staged as a comedy-of-errors. The fluid \"dancing of the camera\", the use of deep spaces to de-centre and complicate the action, and the rhythmic cuts from scene to scene, combine to create a cinematic experience that is not simply watched; rather absorbed. The film is often cited as one of the greatest in the history of cinema, and it absolutely lives up to the hype. A timeless masterpiece of writing, acting, directing and everything really.",
            "review_date": "2014-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's overwhelming tragedy makes you crush your heart yet it grows into you oh so fondly.",
            "review_date": "2014-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jean Renoir's masterpiece of human caricature. Under the acclaimed overwhelming long takes and the party guests of different backgrounds lie the irreparable hypocritical human nature. What can the wise men do even if they are aware of that besides conformity, under the precedence of survival? Are we really courageous enough to tear the mask worn by everybody off?",
            "review_date": "2014-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What can be said about this exquisite gem of a movie?  Infinitely more sophisticated than its Hollywood contemporaries (I adore old Hollywood but the 1930s wasn't their decade with a few notable exceptions).  This is life at its messiest, unfolding at its most beautiful.  Sublime comedy balletically choreographed.  This movie improves on repeat viewings.  Every time I see it, it opens up new wellsprings of character and empathy.  This is probably in my top ten of all time.",
            "review_date": "2014-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pre world war two aristocracy at a weekend party as seen in this highly satirised and delightful film by Jean Renoir, regarded as one of the best films ever made. Uses of long tracking shots, wonderful cinematography and frame composition as well as a well timed choreography of the on screen action make this delightfully perfect for the eyes, whereas the wit and overall intelligence of the script make this delightful to the ears, particularly considering the abilities of the wonderful cast. Renoir is almost merciless at dismantling the ways and hypocrisy of the upper class with this genuinely funny and unpredictable comedy ahead of its time and deeply influential.",
            "review_date": "2013-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It seems like a farce, with super-rich Frenchies at a country house.  Everyone is cheating on everyone else, even the help, and doors slam and people romp.  But there's a layer of tragedy, and that French world-weary sensibility, and you watch knowing it all ends once the Nazis come marching along.  Brilliant.",
            "review_date": "2013-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie. \"Downton Abbey\" definitely \"borrowed\" from this. But be prepared for a lot of talk. A lot.",
            "review_date": "2013-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A moral narrative on amorality. Enjoyed longer takes in contrast to annoying editting.",
            "review_date": "2013-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it wasn't until one of the very last scenes that I recalled I had seen this before. What a sign of getting old! for an \"old\" movie, its actually quite watchable. its like the French version of Downtown Abbey, really.",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is what I would have imagined a french noir carry-on film would be like. It's entertaining enough but a bit all over the place, bordering on slapstick. I've been in a few pubs where stories like this have been played out in my time.",
            "review_date": "2013-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perplexing & sometimes farcical look at infidelity & decorum of pre-war bourgeois. When a couple has a party & each invite their lovers, all bets are off behind closed doors. Yet in the public arenas, rules must be followed or deadly circumstances can & do occur.",
            "review_date": "2013-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Director Jean Renoir occasionally struggles to give form to his intense dissatisfaction wilh the upper classes and the effects their lives of entitlement have had on a decaying and directionless mainstream French culture.  1939 audiences were not amused with his efforts; the French public, unwilling to view themselves in Renoir's mirror, eventually bullied and forced him to flee to America. However, the film (and Renoir himself) persevered to see a marvelous restoration and realize the adoration it (and he) deserved.\n\nThe graphic hunting sequence brutally delivers Renoir's message. La Règle du Jeu has become an integral part of the evolution of film-making.",
            "review_date": "2013-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest efforts by a director I have ever seen.",
            "review_date": "2013-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A strong satire, which was reviled and banned by the French Government in 1950...However, the obsession with naming 'La Regle du Jeu' as one of the greatest pictures of all time is baffling...",
            "review_date": "2013-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hope I managed to see the restored director's cut but even if it was not, I still appreciated the camera work in this film. The humour only serves to punctuate the tragedy.",
            "review_date": "2013-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3rd greatest movie of all time? I don't think so. Maybe i\"m just missing something, but I don't understand whats so amazing about this movie. I think it's a very good film, but I expected more.",
            "review_date": "2013-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though it does not come close to the masterpiece Grand Illusion was two years before, The Rules of the Game does convey its messages well and with a familiar calmness and satirical irony that Renoir portrays so well.",
            "review_date": "2013-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I could do without all the music... the story is a recognized one, well acted out... but not a \"must see\" for me...",
            "review_date": "2013-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This cast of upper-class nincompoops is charming in their self-centered obliviousness, but by the end of this expertly shot tragicomedy of manners, you kind of just want everyone off your screen, even the ostensibly compassionate Octave.  It's the ultimate give-and-take of creating a biting satire.  When everyone is castigated by the narrative, who's left to care about?",
            "review_date": "2013-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't see how, in any way, this can even be considered as one of the greatest films of all time.",
            "review_date": "2013-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Often times, with age, films tend to become appreciated far better than what they deserve and praise often exceeds the quality of the production. It is with Renoir's La Regle du Jeu, that this is not the case, and if anything, is deserving of further praise. I was completely enthralled from the opening frame of this film. A sumptuous, delightful masterpiece which can only be seen (as many have called it) one of the most remarkable achievements in film. The number of films to be inspired by this film since are too numerous to mention, and this only adds to the honour of the artwork.\n\nA masterclass in cinema.",
            "review_date": "2013-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jean Renoir's 1939 film The Rules of the Game is frequently named one of the greatest films of all time, along with Citizen Kane; and like Citizen Kane, much of what makes it great has to do with narrative and technical ingenuity  that might not be as apparent to today's viewers. Even if you missed those elements of the film, though, you would still have a very entertaining and clever satire of high society. \n\nThe plot weaves together plot lines that are quite simple in and of themselves - almost every story is about someone's affair with someone else - into a complicated and funny series of escalating intrigues. In his introduction (made many years later), Renoir cites a couple of French authors I didn't know as influences, but one name of his I did recognize was Moliere, and indeed I can see the general resemblance. At first the movie might seem a bit tame, but as the characters become more and more uninhibited, the film becomes pretty wild indeed.\n\nI won't describe the performances much, since they were by a bunch of 1930s French actors you've never heard of anyway, but they are all good. The characters are all fairly simple, being as they are the targets of the film's satire. Renoir's visual style is great in subtle ways that contribute to the narrative. He does a lot of camera movements that were not usual at the time, and does some amazing things with deep-focus photography to rival Welles's work in Citizen Kane. The house where the film is set is very large, and we often see different plotlines advancing clearly in the fore-, middle-, and back-grounds. Renoir was in many ways light-years ahead of his time.\n\nApparently, the film's satire was so offensive at the time that it was widely banned, and Renoir mentions in his introduction a man who was so outraged that he attempted to burn the theater down at a screening. It's pretty amazing for any film to elicit such a response, especially one as light and playful on the surface as this one. I guess Renoir must have made his point pretty effectively without being heavy-handed. I definitely have the feeling I'll be rewatching and studying this one several times in the future.",
            "review_date": "2013-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not sure I fully understood what game these people were playing (they seemed pretty petty to me), but while this film was somewhat amusing, I think a lot of it was lost on me (perhaps in translation, era, or both).",
            "review_date": "2012-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The awful thing about life is this, Everyone has their reasons\"",
            "review_date": "2012-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest movies ever made, yo. It's like YEEEAAAAHHH MY MAN, JEAN, MAN. HE'S MY BOY. MAH BOY.",
            "review_date": "2012-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This French film directed by Jean Renoir is a light comedy that turns into a critique of the Upper classes. The film involves the superficial events and racy love affairs as only the French can have. It opens as a famous aviator lands his plane only to be disappointed that his married lover did not come to see him. Soon we learn that her husband has a mistress of his own. Put these four together, Renoir in his jolly role of Octave, all the other guests, then the many servants, and soon you have a major spectacle. They dine, hunt, gossip, put on a show, quarrel, and above all fall in love. It is all fun and games however until someone gets hurt. Although this film is not what we may be accustomed to in our present generation, it is easy to appreciate the satire, cinematography, and ensemble cast. Kudos to Renoir for making a very intriguing film.",
            "review_date": "2012-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A deeply emotional film in which the complexity of the characters is only surpassed at the absurdity of the norms of society. It is a very telling snapshot into the life of the upper crust of French and European society at that time in which Renoir proves them all to be utterly ridiculous while his own character, Octave, remains cool and logical almost the whole way through. \nThe cinematography and spectacular mise-en-scene involved strengthen this movie and transform it from being a film and into a work of art and genius!",
            "review_date": "2012-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A message of substantial proportions, a class of souring sensibilities, La RÃ¨gle du Jeu is powerful, potent and smart.",
            "review_date": "2012-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Concealing a lot of complexity in its apparently simple plot, this fabulous tragicomedy (which almost got lost in History) is a witty and clever commentary on the rules of bourgeoisie and social relations - a classic of French Cinema to be seen and re-seen many times.",
            "review_date": "2012-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boy, you've got to hate the rich and the privileged. Once again the pure-hearted bites it. Satire has rarely been this devastating.",
            "review_date": "2012-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jean Renoir is the director who best explains on screen that most people are neither good or bad; but sometimes do good things and sometimes do bad things. He finds humanity in every character.",
            "review_date": "2012-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If a little overhyped as one of the best films ever made, Rules of the Game is still worth viewing, particularly the intense second half.",
            "review_date": "2012-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely stunning to behold. Renoir's definitive work. Manages to celebrate, condemn, and mourn pre-war french decadence.",
            "review_date": "2012-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Where films like City Lights and Sunrise celebrate the joy of romantics, its boundless and endless reach, Rules of the Game denotes it as blissful tragedy. Romance is glorified more as a desire with a set system, complimented by Renoir's use of mirrors in his shots. The artistry behind its execution is quite impressive.",
            "review_date": "2012-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest movies ever made, yo. It's like YEEEAAAAHHH MY MAN, JEAN, MAN. HE'S MY BOY. MAH BOY.",
            "review_date": "2012-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jean renoir's masterpiece The rules of the game is the most authentic and original film of the classic cinema. his vision of the low class with the high class is superb, even when the two classes collide is fantastic, the connection between the poor and the rich and their desires and misadventures.",
            "review_date": "2012-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's just okay for me. I had high expectations but disappointing. Highly overrated. I didn't love it.",
            "review_date": "2012-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is it a soundly made film, as well as an important film of its time, yes but none of it seems worth retaining in the mind",
            "review_date": "2012-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everyone who really loves film has a favourite Renoir, and this is it for many people. While I see the brilliance in his satire, and also appreciate the visual power of his painstakingly choreographed characters, I think Renoir's real power is in natural imagery, which this film lacks. The Rules of the Game is definitely a great film, but it just doesn't have the haunting grace and beauty of Renoir's other works.",
            "review_date": "2012-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Rules of the Game goes down as an instant classic, much like the effect Citizen Kane or The Godfather had on me. Although the first bit of the movie is quite confusing, once you learn the faces and names of the characters, The Rules of the Game is a masterpiece. The characters are magnificently built and overall, this is one of the most well made films I have ever seen.\n\nFavorite Scene: The hunting scene",
            "review_date": "2012-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not only works as a clever satire of upper class society, but as a precursor to modern affair based films. This may very well be one of the greatest of the silent films I have seen as of yet (though city lights is still my favourite). Excellent!",
            "review_date": "2012-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At this point, we've run out of ways to say that this is a great movie.",
            "review_date": "2012-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overrated. But brilliant. I just think Jean Renoir put out some better material that doesn't get the credit this one does.",
            "review_date": "2012-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrific. Of course.",
            "review_date": "2012-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Other than Grand Illusion and The 400 Blows, the greatest French film ever. There is so much detail to be paid attention to, that it is impossible to be bored. The Rules of the Game shows that Renoir has mastered everything about script writing, camera work, and precision directing and scene analysis. The hunting scene has to be one of the most powerful scenes , not only of the film, but of all time. Also, this film was 1939, not 1950 (it was restored in 56, so I'm not sure where 1950 comes from).",
            "review_date": "2012-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jean Renoir's scathingly cynical depiction of French bourgeois society on the ides of the second World War is darkly funny in its sly \"Upstairs/Downstairs\" interplay between a clueless aristocracy and their oafish servant class. Clever as Renoir's message is about the folly of society punishing those who do not conform to its own ludicrous conventions (breaking the rules of the game, as it were), the lunacy of some of the comedy is a tad misdirecting from the fact that there is in fact a message to be gleaned. More notable (to my mind) is Renoir's use of camera movement and well-timed editing. In terms of visual flow, it leaves most of its contemporaries in the dust. The storied history of the film surpasses the actual film itself for memorability; Critically trashed upon release, censored by France's government for fear of disheartening citizens of a Nazi-occupied country, released internationally eleven years later in a mindlessly truncated form, and at last being restored to  near-completion in 1961.",
            "review_date": "2012-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow! Erm, well something appears to have gone over my head. There's something about this film that just didn't affect me at all. I found it to be interesting in spells but then I found myself drifting away from it. Admittedly my experience was marred by the terrible transfer on the version that is currently streaming on Lovefilm. Not only was the picture jumpy and particularly un-remastered (okay that's probably not a real word) but the subtitles were faint and at times indistinguishable, particularly due to them bleeding into any kind white background on screen meaning at some points they actually were not visible to the human eye. Still I came away feeling underwhelmed, far from the transcendent experience so many others seem to have taken from this film.",
            "review_date": "2012-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This world renowned, critically glorified, and historically controversial French film, The Rules of the Game, is one of the biggest disappointments I've come across in a long time. Don't get me wrong, I love the satirization of the upper class and the engaging love circle surrounding Christine, but the film's climax is dull, its major side plot is so-so, and the film's first half seems to drag on and on.",
            "review_date": "2012-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not well recieved in that golden year 1939, but worth a look now as it holds up well",
            "review_date": "2012-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "another winner from renoir and that golden year 1939",
            "review_date": "2012-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably my favorite foreign-language film of 1939 (it's a toss-up between this and \"Daybreak\").",
            "review_date": "2012-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Renoir's tragicomedy set in pre-WWII France is an absolute delight. The director's use of deep focus combined with long takes allows the film to progress in a remarkably lifelike manner.",
            "review_date": "2012-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1001 movies to see before you die.  A well made and interesting French film.",
            "review_date": "2012-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't wrap my head around why this is considered one of the hreatest films ever made.",
            "review_date": "2012-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A rule-breaking, jaw-dropping fabulous comedy; a whirling, seething, absolutely scathing look at the French upper class, running pell-mell like lemmings into the sea. One of the greatest, darkest comedies ever made.",
            "review_date": "2012-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you are a fan of Robert Altman ensamble pictures, you need to see this film",
            "review_date": "2012-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best cinematic example of using lies to tell the truth. Simply marvelous entertainment.",
            "review_date": "2012-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"La Regle De Jeu\"s portrayal of a despicable society composed of morally inept, promiscuous, hedonistic, libertine men and women so brainwashed by their own elitist spoilage is perhaps even more relevant today than it was in 1950. It seems that the film, like \"La Dolce Vita,\" also touches upon a common pattern, most notably vices, in human behavior that always goes unnoticed. This feat makes works like \"La Regle De Jeu\" not only timelessly entertaining but also essential for every generation to watch and to absorb. \r\n\r\nSadly, time has made the silent, meticulous pace of the film to be somewhat outdated. Some of its humorous commentary on the insensitive, ignorant behavior of higher French society (which I more than joyfully found parallels in my own society,) that ranged from childish, impulsive jealousy, to meaningless barrages of decontextualized flirting, to straight up fucking murder, may also seem subtle and toned-down by today's standards. The film could be slow at points.  After sucking you into the lives of its subjects and creating a perpetually innocent environment of a trivial house party, it was quite difficult to sense a noticeable escalation in the film's plot as it delicately builds itself through the gossip and bickering of the characters. In spite of these few arbitrary faults, \"La Regle De Jeu\" is still, holistically, a substantially enriching experience.",
            "review_date": "2012-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the few French films I like.",
            "review_date": "2012-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "too complex by several fathoms, at least; the script features five characters too many and reeks of that old-style comic timing that makes every situation absurd, every character a mockery - but, that aside, aspects of it are the best I've ever seen, and the ending is beyond brilliant",
            "review_date": "2012-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "yes, we all have our reasons.",
            "review_date": "2012-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outdated but one can imagine the reaction with which it was met back in 1939. Worth viewing but not buying.",
            "review_date": "2012-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The Rules of the Game\" is one of those movies that would be easy to be disappointed by, because it's constantly lauded as one of the greatest movies ever made, and anyone who's spent any time studying film knows that at some point you have to see this movie if you're going to consider yourself a film connoisseur. For film historians and especially for students of French cinema, \"The Rules Of The Game\" is a must-see. But for a general audience, the film can seem dull and tedious, and its thematic message is too subtle and convoluted to be easily appreciated. The reason why it is so good is hilarious, poetic, beautiful, disturbing, and frustrating. It breezes by like Shakespeare mixed with slapstick comedy with some French farce thrown in for good measure. Make of that what you will.",
            "review_date": "2012-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good at showing a bunch of stuff happening at the same time.",
            "review_date": "2012-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Devastating. Part comedy of manners, part slamming door farce, all wrapped up in a shell of class warfare and their similarities. I am in pure awe of this perfect film.",
            "review_date": "2011-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have a feeling i missed something here. I just came off a double shift so my mind wasn't 100% into the movie. The story is very entertaining. Renoir changes tones between comedy, satire and drama with ease. The performances are great, had no clue Renoir could act, him running around in the bear costume was brilliant. The film didn't move me like it has with others but a second viewing could change that.",
            "review_date": "2011-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unofficially ranked  #3 on the top 1000 films of all-time around the world, this social commentary highlights the amorality and sexual perversion of the characters in a disturbing, yet somewhat comical way. Self destruction and hostility arise in a society where love and loyalty become viewed as boring and are exchanged for artificial fun and the company of others. The hunting scene is unsettling (I love animals...) and demonstrates the hidden cruelty of the characters in a very direct and visual manner. Ultimately, uncertainty and lack of commitment result in loss, dissatisfaction, and even death.",
            "review_date": "2011-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's no insult to call the film an uncompromising, fascinatingly sophisticated echo of Hemmingway's 'The Sun Also Rises'.",
            "review_date": "2011-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "- Just watched again on Blu-Ray, I can never get sick of this movie...it's considered one of the all-time greatest films for a reason.  A MUST watch!\n\n- I have now seen this movie several times, and it is often cited as one of the all-time greats, I must say I do enjoy it.  A satire on the bourgeois as it follows the interaction between the rich and their servants as each go through love entanglements.  The film has a fantastic style to it and is often amusing, while at the same time enlightening.  \n\n- It was initial a failure when released in 1939, the director Jean Renoir made several cuts and then the original was destroyed in bombings during WWII.  In 1959, it was reconstructed and ever since has inspired many directors and has frequently been in the All-Time Top 10 greatest Films lists.  This one is a must see!",
            "review_date": "2011-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolutely sublime film. My 2nd favorite film of all time - following only Les Enfants du Paradis.",
            "review_date": "2011-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Film. There Are Several Scenes That Just Spiral Into Chaos In The Greatest Way Possible.",
            "review_date": "2011-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jean Renoir`s satire of human manners is easily one of the most profound and multifaceted films I`ve ever seen!",
            "review_date": "2011-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My introduction to Renoir.....a how good was it...spectacular.....a tragic comedy is a perfect description of this one...the pace in the movie..almost a very fast theatrical performance succeeds in a major part due to the director as the story from the beginning to the end is a simple one involving loads of characters...a must watch for all those who appreciate quality movies..timeless !",
            "review_date": "2011-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Let's go hunting! Then later we will get drunk and things will get kinda...weird. People may die. We'll see how the night goes!  Strange but kind of entertaining film.  I recommend it to cinema fans.",
            "review_date": "2011-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Legendary French director Jean Renoir crafts an intricate web of relationships in this interesting and complex film. Friends, rivals and lovers battle throughout the whole film like barbarians, yet they are holding a high society get-together and so they have no choice but to remain civil and keep it all behind closed doors. André Jurieux, a famous aviator has just landed his plane and is welcomed by hoards of reporters and fans, congratulating him on his successful voyage. However, out of the range of the microphones, he is told that the woman he did this all for has struck up a relationship with another man, and has not even come to greet him at the airfield. This marks the beginning of the film's journey. After several interactions between mutual friends' mutual friends, it finally comes about that André Jurieux must spend several days in a large country house, staying with the lover who jilted him, her new man, a young poacher, the already-married maid whom he falls in love with and a great deal more people. We nevertheless start to focus less on André, and more on everyone else, as we begin to understand what Renoir himself's character exclaimed: \"The awful thing about life, is that everybody has their reasons.\" Towards the end, on the final night, is when a larger than life party is being held. This is when the conflicts themselves become larger than life, the chaos even stretching to a guest chasing another around the house with a rifle. By the end you are completely wrapped up in it all, and it's as if you are one of the countless guests. It's a truly wonderful movie, and while complicated, on repeated viewings it comes even more clear that it's a true masterpiece.",
            "review_date": "2011-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "some dose of comedy which you later find out to be very bitter. it didn't speak to me as a modern viewer more than other acclaimed classics, but it was worth watching. so many modern ideas must have been inspired by this flick",
            "review_date": "2011-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is a masterpiece of characterization.  Renoir visually, and most especially written-wise, makes a bold statement of human nature through a series of haphazard human relationships and subsequent incidents.  (It reminds me a great great deal of A Midsummer Night's Dream.)  It manages to pull out something so universal, so regular, and yet so important from its simple story and setting that even as you watch it unfold it's hard to imagine it getting to the point where it makes the leap to the classic and important film it is remembered for being.  But that's just it, that's exactly why it is so respected within the canon of film.\r\nLanguidly it builds.  For a while I wondered where exactly the film was going and struggled with it so, but once this main group got together and I could see the way Renoir had maneuevered all of this to happen, the scenes really started to crackle for me.  Directorially, so many scenes stand out with their pacing and composition; they compliment his written word so well that it's like watching a magic trick unfold that you can't quite place why it holds you in awe and makes your jaw drop at the same time.  The film's strength is its subtlety (even with its stand-out humor); which made a patsy out of even a film lover/aesthete like me for a while, watching it for the first time.  While I'm not itching to watch it again, out of respect I will give it a second watch because I think to fully absorb both the subtle and labrynthine qualities of it, I need to do so.",
            "review_date": "2011-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That's a handsome movie.",
            "review_date": "2011-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So perfectly done in every possible way. The Rules of the Game shows how much Jean Renoir was ahead of his time. It reminded me of the way Gen-X films create their characters and their interactions, and it also reminded me of The Discreet Charm of the Bourgeoisie.  It starts out with a Andre Jurieux who just flew the furthest distance across the Atlantic since Charles Lindbergh. It should be an amazing moment for him. People are there to cheer him on and everyone is happy for him, but the woman he did it for doesn't show up, which makes him the most disappointed man in the world. All these people around, but none of them really matter. What a selfish little brat. This sets us up for the rest of the characters. We know we're not getting into a comedy of people we would want to be friends with. These are the people that we like to make fun of. Christine is married to Cheyniest, but has had an affair with Andre. When she finds out he has had an affair with Genevieve she is upset and says her last three years have been based on a lie. It seems like all of these people react in such a strange way. Cheyniest is upset that Christine has fooled around with Andre, but he was ok to be fooling around with Genevieve. I liked at first Christine is ok with Genevieve and tells her to stay, but that's when she has the possibility of loving Andre and moving along with him. Octave, played by Renoir, was my favorite character. He seems to be in the middle of these confrontations, but he doesn't want the love for himself. Throughout the film we can see that Octave loves Christine more than just a sister, but doesn't do anything because he is the one who truly loves her. And I loved when Andre explains to Christine that he will have to explain to Cheyniest about them leaving because those are the rules of the game. He is a true hero, as Octave points out. Then Cheyniest meets a man poaching on his property whom he then hires for odd jobs at the chateau. This man falls in love with Christine's maid who is married to the guard of the property. They don't get along from the start. It's funny, neither of these men are rich, but they defend their honor more than anyone else in the film (other than Andre).\n\n**SPOILERS**\n\nI was so scared that Octave was going to get shot by the guard. He is so funny and lovable in the beginning, then so pathetic and sad in the end. He is the best character in the film, so killing him would have been devastating. It's still devastating that he decides to send Andre instead of himself to Christine even though they declared their love for each other. This saves his life, but Andre dies, and Octave still leaves for Christine to be happy. Her servant tells him that she wouldn't be happy with him because he doesn't have the money or success. This is all told bluntly after he is already vulnerable and telling Christine that he was never successful. The Rules of the Game is comedic, heartfelt, and pokes fun with a purpose. Jean Renoir was decades ahead of his time and makes it better than they do today.",
            "review_date": "2011-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Considering the amount of praise this film receives from critics, I feel slightly embarrassed to admit that I found it boring.  Sure, it was extremely well constructed, and its social critique is pretty biting.  But I just felt like it didn't give me anything to care about.",
            "review_date": "2011-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thoroughly enjoyable. I am grading on a curve here - this would probably be a four-star movie, but it's so much better than anything else I've seen pre-1960 that I had to give it a boost. The cinemaphile praise is true: inventive and dynamic camerawork, great ensemble acting, good pacing and an interesting slice of history to boot.",
            "review_date": "2011-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jean Renoir's masterpiece is easily one of the first great films of the 20th Century.",
            "review_date": "2011-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite now being considered by historians to be one of the best films ever made, the picture almost became a lost art. Claiming that it was bad for the morale of the country (due to impending war), the French government banned the film about a month after its original release. When Germany took over France the following year, it was banned by the Nazi party as well, who also burnt many of the prints. Allied planes then accidentally destroyed the original negatives. It was thought to be a lost picture. In 1956, some followers of director Jean Renoir found enough pieces of the film scattered throughout France to reconstitute it with Renoir's help. Renoir claimed only one minor scene from the original cut was missing.",
            "review_date": "2011-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very energetic madcap comedy. I had a little trouble keeping track of everything that was going on, so that lessened it a little bit for me.",
            "review_date": "2011-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Genius. This is what I want to create, but with wider themes on a global scale. No pressure.",
            "review_date": "2011-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "16.5.2011\nIn my opinion, Robert Altman, who said that he learnt the rules of the game from this film, topped it. Since his claim is evidently true, his films wouldn't be the achievements they are without this: so let's give the credit to where it's due. The satire, the multiple, simultaneously crossing storylines, the abundance of characters with ensemble acting, action on several planes at the same time, the moving camera. The bite of the vision. An essential landmark of cinema and an historically important portrait of the French upper-class on the brink of the World War II.",
            "review_date": "2011-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To be perfectly honest, I have absolutely no idea what was going at times during a big bulk of the film. However, this is in ways like Howard Hawks' \"The Big Sleep\" since that film is beyond confusing, but it is incredible entertaining. \"The Rules of the Game\" falls into the same category. There are at least two or three love affairs, is what I can for certain tell you, within this film, and most of these affairs disintegrate by the end or even, by the middle. To me, the plot doesn't matter. What matters is how well filmed, acted, and fresh this movie is. There are some great scenes. First, the beginning in which the plane arrives after, apparently, a 22 hour flight across the Atlantic Ocean flown by a single person. It is a small, army plane. Second, the second hunting scene (there are two) in which all the characters come together to chase and kill rabbits and pheasants. Third, the stage performance and party scenes in which there are some stunning set pieces, plus the chaos involving the deranged guard with the gun. Finally, the tragic conclusion (which I will not describe for spoiler related reasons). This is a fascinating early French film and perhaps, one of the best films from the 1930's.",
            "review_date": "2011-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is apparently one of the highest praised \"greatest films\" ever made.\r\nExcept it aint ya see. It just aint.",
            "review_date": "2011-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Renoir manages to capture the last great age of france righgt before the second world war - basically a film about fighting between upper class friends and affairs galore, this manages to show a creativity and parallel unmatched at the time and maybe not again - really good film",
            "review_date": "2011-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest films of all time.",
            "review_date": "2011-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have noticed that my reviews have been getting less readers lately. Does it upset me? No not really, since I think it is because so many of the reviews I do are of films that aren't made for mass comsumption(and btw, I do like a movie that is just entertaining, so I don't consider myself one of those film snobs). I enjoy all kinds of movies, but I have the feeling that many of the people who are my \"friends\" on RT are stuck inside a genre or just like present day Hollywood films. That's OK. I would rather have one friend who likes and likes to discuss all types of films than 10 friends who only are interested in the typical Hollywood fare. And I don't want to offend anyone, but I will be deleting friends who don't respond to my reviews soon. I respond to everyone who sends me something, and if you don't respond at all, then I don't feel if I want to waste my time. Not a judgement, but I really want to concentrate on a smaller number of people who I can relate to. \r\n\r\nNow, this brings me to the point and the review. Many reviewers and friends who think that Jean Renoir's film \"The Rules of the Game\" is one of the greatest films ever made are people who I want to be friends with. Even people who are intrigued, try it and don't necessarily love it are still people I want to be friends with. I love a good disagreement with another person who I respect as a lover of the art of filmmaking. What really bugs me are \"the haters\". People who are so out and out hostile toward a film that they make it a personal attack on the artist, the film and anyone who loves it(using words like film snob or moron directed to anyone who likes it). I have the feeling that there was a great deal of this happening in 1939 during its original release. In fact, people were so hostile toward this film that the studio cut the film up, destroyed the footage taken out and re-released it later(Renoir was smart though and saved all the negatives and years later restored it to the original version). Today, I can see that most people will still be quite hateful toward this movie. Too bad. This is so much more than your typical Hollywood film, which usually follows a hero who will sacrifice all to protect and serve. The Hollywood structure is well used and very successful because it increases the involvement with the audience because they can relate to it. That is fine, but any hostility toward something different sometimes leaves me stunned.\r\n\r\nOk, back to the film. I love this movie because it is a study of manners and mores of pre-WWII France. The film is about a house party given by a French aristocrat and his Viennese wife and deals with the wives and husbands, lovers and adulterers, masters and servents who roam through rooms, hallways and the magnificient groudns of the estate. All of the movement and sneaking around in others bedrooms and the arms of lovers other than the one they are \"with\" is still seen as respectable and OK by many of the characters. What fun! No? Oh?\r\n\r\nWell, many will find this slow, episodic and aimless, but someone who has an eye for a true masterpiece will find it all quite fascinating. Renoir moves the characters in ways that, even today, will be rarely seen(I think of Altman when watching this). The actors are always acting, moving and continously in the foreground and background while the main action takes place up front. Everything seems to move so gracefully throughout the house and this was years before the \"steadicam\" came into existence.\r\n\r\nAll of it is so full of \"goodies\" that it will certainly be difficult for the less trained film lover, but the flawless choreographed moments of the characters will give a small number of viewers a trascendental experience. Those are the lucky ones. I love this movie and will watch it again. The only question is, \"how many RT will I lose after this review\"? Popularity contests don't belong in art. lol.",
            "review_date": "2011-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good decent film that, on first viewing, I do not see what makes it such a great and highly regarded. The acting was alright but the story was very normal and never seemed to be pushing the limits of the time. I still prefer the director's The Grand Illusion as that picture was much more daring in tackling the differences between society's classes.",
            "review_date": "2011-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film - The camera seemed to be a character.",
            "review_date": "2011-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My filmic education somewhat more complete for finally having seen this. Five stars?  Well, who am I to dicker over a half a star or so.",
            "review_date": "2011-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ITs all about rules. A love and an ending that leaves you stunned with your mouth open.",
            "review_date": "2011-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lovely. If there's a masquerade ball and couples sleeping around, I will watch it.",
            "review_date": "2011-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an interesting commentary on relationships wonderfully crafted and skillfully navigated. The film is set up like a chess game and like a master player, Renoir manoeuvres the camera and his actors to play off of each other and enhance the relationships. An in depth and fascinating character study, the mise-en-scene and cinematography are a tad bland, but the rich characters and performances make up for the short comings.",
            "review_date": "2011-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Borrrrrrrring.  I had trouble following the story line.  It's the sort of movie that's mostly a bunch of people talking.",
            "review_date": "2011-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "masterpiece about the rules of love, life, and friendship",
            "review_date": "2010-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is a lot of material being communicated in a language that we don't easily understand anymore, but it has a good plot and the acting and production was really good for its time.",
            "review_date": "2010-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jean Renoir's classic from 1939 deplicts people from slightly different classes during a weekend at a country estate. \n\nThe majority of the main characters are all from the upperclass enviorenment and the rest are their servants. Before I had seen this movie, I thought it was a critic of the bourgeoisie, but I found it more to be a sceptical view on human-beings in general. The overall attitude towards class differences in \"The Rules of the Game\" is that 'You should stick to your own social class', which Renoir sarcasticly deplicts with a great sense of humour and idioteque.\n\nI love how the camera finds it way through the different floors of the estate and how equally grotesque and bizar the whole house of people seem.",
            "review_date": "2010-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "undeniably masterfully made, however like Citizen Kane the characters are a little too unsympathetic and loathesome- part of the point I know",
            "review_date": "2010-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite remarkable, the more that I think about it. Renoir's own unique brand of... tragicomedy? Comes to the fore here in surprising and amazing ways. Some of the writing is quite extraordinary in terms of logistics, keeping track of all the characters, how they relate to each other, and where they physically are. It's pre-Altman, and yet it's firing on more synapses than he ever did. I don't know that I love it, but I know that I'll revisit it.",
            "review_date": "2010-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Considered one of the greatest films of all time.  Overrated in my opinion, although Nora Gregor was wonderful.",
            "review_date": "2010-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Often cited as the second greatest movie of all time next to Citizen Kane, second greatest foreign film of all time next to Seven Samurai, and second greatest European film next to Battleship Potemkin. And does it fulfill all these expectations? Yes. \r\n\r\nIt's like a very serious \"The Importance of Being Earnest\" in that it's a door-slamming farce without laughs that satirizes the upper class by showing how their actions (in this case various love triangles) have no consequences. \r\n\r\nDirector Jean Renoir, just like his other masterpiece The Grand Illusion, doesn't show any visual talent that would rank him among the greatest directors ever (though there is a fantastically photographed rabbit/fowl hunting scene), but instead creates a perfect drama and romance that works as a cinematic play. It's this drama and romance that holds your interest and draws you in throughout the film's somewhat lengthy running time. His style is both realistic, intelligent, and overall hard hitting.\r\n\r\nAlso, just like The Grand Illusion, all of the performances are exceptional, which makes it difficult to single out one performance in particular. If I were to do that though, my choice would actually be Jean Renoir himself, who plays corpulent and eccentric \"Octave\", who is stuck in the middle of all the drama and acts as an advisor to everyone.\r\n\r\nThe Rules of the Game is the definite cinematic drama and manages, more than many other films, to remain as emotionally resonate as it was when it was made. 101/100",
            "review_date": "2010-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fact The Rules of the Game was almost lost forever is a scary thought, especially considering the impact it had on film and many directors. Robert Altman even said he \"learned the rules of the game from The Rules of the Game.\" And it's hard to argue its significance. You know you're seeing something special when the cinematography of a 1939 film seems fresh and inventive by today's standards; when there isn't any overacting during a time when movies were plagued by it; when, although it was hated and criticized and nearly destroyed after its initial release, it still managed to be restored and became to be considered one of the greatest films ever made.\n\nNo joke: on a critic's poll conducted by \"Sight & Sound\" magazine in 2002, it was ranked only behind Citizen Kane and Vertigo. Not bad if you ask me. But one can sit around all day and say it's an all-time great film. Why is it? Praising its strengths shows it is a great movie, but considering the time it was made, it makes everything seem that much more astonishing.\n\nFirst of all, the boldness of the film is unmatchable. Director Jean Renoir took a huge risk with his darkly comic look into French society and relationships. As funny as the film can be, it owns a rather depressing and pessimistic tone that left French audiences and critics in outrage. The film follows close to nine different characters who cannot seem to decide who they would like to court with. AndrÃ©, a pilot with his \"head in the clouds,\" loves Christine, but Christine is married to Robert, the wealthy and confident collector who seems to understand the \"rules of the game.\" GeneviÃ¨ve, Robert's mistress, is almost suicidal in her head-over-heels love for Robert. Then there's Marceau, the low-class outsider who chases after Lisette. Lisette welcomes his on-comings, despite her marriage to her dangerously envious husband Edouard. In the middle of it all is Octave, who never seems to be chasing anybody and manages to stay irreversibly happy (almost) the whole time.\n\nAny aspiring filmmaker should study the movie's climax, the scene where all the characters gather for a night that is reminiscent of \"A Midsummer Night's Dream.\" Characters change partners and squabble with each other increasingly throughout the night. The most impressive part of this scene is its flow. The writing is part of the reason. Ranging from laugh-out-loud funny to darkly disturbing, the characters engage in conversations that really bring their situations into light.\n\nThe characters' approach marriage and fidelity with nonchalance. Or, more accurately, they appear nonchalant. But there are hints of their true feelings throughout the film before everything erupts in the end. Take the scene where GeneviÃ¨ve speaks with Robert on the phone. She tries to make plans, but Robert denies her because of plans he owns with Christine. GeneviÃ¨ve appears to not care, but as soon as she places the phone back in its cradle the hurt sets in on her face. Christine pulls a similar maneuver. Speaking with Robert in his study, she refers to divorce as being \"melodramatic.\" However, when she learns of Robert's relationship with GeneviÃ¨ve, she starts to entertain thoughts of leaving him for AndrÃ©.\n\nThe true reason to relish in the climax is the camerawork. The flow of this scene is determined by how gracefully Renoir moves from room to room and connects all the conflicts so fluidly. We see Eduardo chasing Marceau, which leads right to Christine speaking with Robert, which leads to Octave desperately searching for someone to help get his bear costume off, which leads to AndrÃ© finding Christine and Robert together. Everything transitions so well that you never lose track of each story and the struggles of each character.\n\nOne other scene will undoubtedly capture the viewer's attention for years to come, in which the party goes out on a hunting expedition and shoot down dozens of rabbits and birds. Renoir does not hold back and shows rabbits running along and suddenly flipping over or falling limp to the ground. In particular, one rabbit lingers onto its life for a brief five seconds, in which we see its paws shaking and finally unfolding into nothingness. As shocking and impressive as the scene is, it refers to a grander statement about French society and how they selfishly cut down each other for the thrill of the hunt. The hunting scene also hints at the events that will unfold at the party, where Renoir's message will hit viewer's right in the heart.\n\nAnd I think that's the point: Renoir wasn't looking to outrage French audiences, but instead expose those deep feelings burning underneath with compassion. Obviously, they didn't take it too kindly. Nevertheless, the movie exists today and even has its own Criterion Collection edition. Perhaps the most impressive thing about The Rules of the Game is it has just as much impact as it did in 1939, not only in its film making style, but also in its ability to remind us of those feelings we sometimes try to hide. \n\nRead more reviews at http://cinemabeans.blogspot.com/",
            "review_date": "2010-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can understand why this film is the Bernardo Bertolucci's favorite above all.",
            "review_date": "2010-10-07",
            "source": "rt",
            "lang": "en"
        }
    ]
}