{
    "rating": 0.0,
    "release_date": "1956-06-05",
    "num_reviews": 147,
    "genres": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "A Magnificent Fim-Noir",
            "content": "After five years in prison, Tony le Stéphanois (Jean Servais) meets his dearest friends Jo (Carl Möhner) and the Italian Mario Ferrati (Robert Manuel) and they invite Tony to steal a couple of jewels from the show-window of the famous jewelry Mappin & Webb Ltd, but he declines. Tony finds his former girlfriend Mado (Marie Sabouret), who became the lover of the gangster owner of the night-club L' Âge d' Or Louis Grutter (Pierre Grasset), and he humiliates her, beating on her back and taking her jewels. Then he calls Jo and Mario and proposes a burglary of the safe of the jewelry. They invite the Italian specialist in safes and elegant wolf Cesar (Perlo Vita) to join their team and they plot a perfect heist. They are successful in their plan, but the D. Juan Cesar makes things go wrong when he gives a valuable ring to his mistress.\"Du Rififi Chez les Hommes\" is a magnificent film-noir, certainly among the best I have seen. The screenplay has credibility, supported by an awesome direction of Jules Dassin, stunning performances of the cast and great cinematography. Jean Servais has outstanding performance in the role of a criminal with principles guided by the underworld rules. The famous long silent sequence of the heist is amazing and extremely tense and certainly among the best ones of the cinema history. I am listing this great movie in my list of favorite movies ever. My vote is ten.Title (Brazil): \"Rififi\"",
            "review_date": "2007-07-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great heist film",
            "content": "Tony le Stéphanois gets out early after 5 years in prison. He has a plan to rob the jewelry store Mappin & Webb with his friends Jo and the Italian Mario Ferrati. He finds his old girlfriend Mado who abandoned him for the gangster Louis Grutter. He viciously beats her. For the job, he wants to hit the safe and gets Cesar the Milanese. The heist goes off perfectly but that's not the end of it.It's a French heist film with more realism. It is well done with good intense acting. The most interesting thing is how modern the movie is. The formula is well set now, but it was probably more groundbreaking back then. These are the modern anti-hero protagonists.",
            "review_date": "2014-03-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Influenced Numerous Filmmakers",
            "content": "Du Rififi Chez Les Hommes/Rififi(1955) can on the surface be described as a French variation on John Huston's seminal heist film, Asphalt Jungle(1950). The difference between the two films is Rififi(1955) pays a little more attention in detail to the robbery sequence.  Also, the police aren't involved in the aftermath of the robbery in Rififi as much as in Asphalt Jungle.  In the end Rififi(1955) is in my opinion a slightly better film than Asphalt Jungle(1950).  Remarkable Noir picture that defines 1950s French Cinema.\nSpartacus(1960) may have been the one which broke down the infamous blacklist, but in my opinion Rififi(1955) was the film that began to break apart the unbreakable Hollywood blacklist.  First film in five years for Jules Dassin who was victimized by the McCarthy communist hunt of the late 40s to early 50s.  He got some sort of retribution when Rififi(1955) became a success around France and Europe.  Thus defying the poisonious Hollywood blacklist in a major way that probably inspired others to do the same. Rififi(1955) is the most important film of Dassin's career because it not only restored his name, but also gave him a second chance at making films.\nJules Dassin gave the filmworld and its ever growing audiences a masterpiece of influential proportions.  His handling of the material is exceptional and direction of the actors is flawless.  Builds up tense situations with precise craftsmanship.  Dassin came full circle in the Film Noir genre by directing his best and last Noir, Rififi(1955).  Marked the end of Dassin's period in filmmaking when he was involved in doing Noir pictures.\nRififi(1955) is the number one film in an arsenal of thirty plus films for director, Jules Dassin.  A masterpiece in acting, cinematography, directing, editing, and writing.  Not a film to leave your seat for one minute because there is always something memorable going on.  As brilliant as anything by Jean Pierre Melville who was a master of this type of film.  Masterpieces such as Rififi(1955) are relatively small compared to the probably billions of films made in motion picture history.\nThe one fascinating aspect of Rififi is the precise planning and careful execution of a robbery that takes up a bulk of the 118 minute duration. The main characters plan and execute the jewel heist in the same way a film director prepares for the pre-productions, production, and post-production of a film.  Shows how difficult a Jewel heist like in Rififi(1955) is in committing and why very few would do something like it.  The fact that the scene hardly contains a mess up like in other heist films turns this scene into something even greater.  Close as one can get to having a perfect sequence in a motion picture.\nLack of unnatural sound in the landmark thrity minute heist sequence puts it in a realm of absolute realism.  Any dialogue or/and music would ruin any suspense and tension the director is trying to create.  The use of natural sound makes the heist sequence a rewarding film viewing experience.  Now Filmmakers and producers would use dialogue and music in a scene like this because of a lack of confidence of a mainstream filmgoer's patience. Sustains a level of consistency that never once lets down.\nMaintaining a high level of suspense is what makes the heist sequence tick to perfection.  The director achieves suspense in the heist sequence that's rarely equaled in most robbery scenes from heist films.  Jean Servais and the rest of the main actors contribute to the suspense with some low key acting.  Getting suspense put in a scene is a task few are capable of doing. The robbery sequence of Rififi(1955) reaches a Hitchcockian level of suspense and tension.\nMany filmmakers from the years following Du Rififi Chez Les Hommes(1955) have been influenced if not inspired by it.  One filmmaker influenced was Jean Pierre Melville(original choice for director of Rififi)who used variations of the heist sequence in Le Doulos(1961), and Le Cercle Rouge(1970).  Another filmmaker influenced was Stanley Kubrick who made a similarly themed film in The Killing(1956).  Also, Quentin Tarantino whose debut feature Reservoir Dogs(1992) was inspired by this film.  Other film directors influenced are John Woo, Michael Mann, Paul Schrader, Ringo Lam, etc...\nDu Rififi Chez Les Hommes(1955) is comparable to Bob le Flambeur(1955) in many ways.  One, Jules Dassin and Jean Pierre Melville directed groundbreaking films in Rififi(1955) and Bob le Flambeur(1955).  Two, each film involves an aging criminal who plans and carries out a daring heist. Three, Bob le Flambeur and Rififi finishes in fatalistic fashion.  Four, each film shares many motifs and situations that classify the two as film greats.\nPart of Rififi's charm are the colorful characters that surround the story such as Tony le Stephanois, Jo le Suedois, Mario Farrati, and Cesar le Milanais.  Most of the violence is implicit yet effectively brutal.  The main characters led by Tony le Stephanois abide by a strong outdated code of honor that is remindful of Sam Peckinpah and John Woo.  Jean Servais becomes the role of Tony le Stephanois with his cynical outlook and tired looks. Du Rififi Chez Les Hommes/Rififi(1955) became a favorite of mine the moment I saw it on the big screen from beginning to end.",
            "review_date": "2001-10-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "You're not the only one that had an unhappy childhood, there are millions like you, and, in my eyes, *they* are the tough ones, not you!",
            "content": "I heard they were going to remake this French classic in 2007, and I see it is in development for 2011. This will be a shame, as Hollywood kicked writer/director Jules Dassin out because of the infamous blacklist. They should not have the right to remake any of his films.I love \"caper\" films and \"film noir,\" and this combines the best of both.Tony (Jean Servais) gets out after doing a nickle, and after he beats up his old girlfriend (Marie Sabouret), he plans a big score with his friends Mario (Robert Manuel) and Jo (Carl Möhner), What makes this a great caper flick is the attention to detail in planning the robbery. You see that reflected in the George Clooney Vegas capers. Nothing is left to chance.The caper goes off great but Grutter (Marcel Lupovici) sends his sons, Robert Hossein and Pierre Grasset after Tony and the gang. After blowing it with Mario, they kidnap Jo's son. Lots of bullets fly before it is over.A great film by a great director. The standard by which other caper films are measured.",
            "review_date": "2009-04-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great heist film",
            "content": "This smart and gritty French film about a heist does not disappoint. Jean Servais plays a tough guy who has just gotten out of prison and gets an offer to knock off a high-end jewelry store. The opening scenes that establish the four thieves are memorable – Tony (Servais) running out of money while playing cards, Jo (Carl Möhner) and his young family, who will figure prominently in the film, Mario (Robert Manuel) getting bathed by his buxom wife (Claude Sylvain), and Cesar (director Jules Dassin), the expert safecracker who falls for Viviane (Magali Noel) as she sings the playful title song in a nightclub. The club is owned by Grutter, the leader of a gang, and rival for Tony's old girlfriend Mado (Marie Sabouret), and it's these two guys, Grutter and Tony, who will ultimately have to square off. I have to say the early scene in which Tony tracks Mado down and then forces her to completely strip before beating her with a belt (off-screen) is very disturbing, particularly as we're going to find ourselves rooting for him later in the film. It does establish him as a heavy though, loyal to the gang but if betrayed, merciless, which is consistent how he acts later. I can't recall Servais cracking a smile in the entire film, and he plays the role beautifully.The robbery itself is shown masterfully by Dassin. In the planning stages, only a couple of the ways in which the thieves will pull it off are shown, an example of which is figuring out how to use a fire extinguisher to muffle the then state-of-the-art alarm system. The execution of the crime is highly realistic, and I love how he used minimal dialog and music, so that the actions and facial expressions of the actors tell the story. If only there were more films today that took a lesson from him! We also see a flaw that will lead to problems for them, and the film is far from over after the crime – further drama and real tension await, but I won't spoil it.If you're looking for a caper film that among a few others set the blueprint for the genre, this is it. I found out later Dassin had been blacklisted by Hollywood, and was even happier for the triumph of his fantastic direction here. The script is taut, there are no wasted scenes, and on top of it all there are great shots outdoors in Paris. Don't be frightened by the subtitles or by the fact it's black and white and was made in 1955 – it all holds up very well, and is superior to most of the action films of today.",
            "review_date": "2016-04-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Film noir meets New Wave",
            "content": "(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon.)Or vice-versa.This is a French film noir directed by an American film maker (Jules Dassin) who had to leave the country because of being blacklisted by Hollywood thanks to HUAC. The premise of the story is rather familiar--one last jewel heist for Tony le Stephanois and his buds--and so is the ending with everybody getting... Well, no spoilers here, for sure, since this is the sort of film in which tension toward the ending is important.Dassin filmed in realistic lighting in black and white on the streets of Paris using actors and actresses who are not glamorous. The engaging--sometimes intruding--score by Georges Auric nicely enhances the movie and will remind viewers of many a similar score from American film noirs from the forties and early fifties. Jean Servais plays the hardcore, consumptive lead in a fedora much as Humphrey Bogart might have played him. Tony's recently out of prison, past his prime, but still tough and decisive when he has to be, his mind still sharp when focused, the kind of anti-hero whose eyes water even though the tears will never fall.Dassin plays the Italian safecracker and would-be ladies man who knows the rules but gets careless.In film noir we are forced by the logic and focus of the film to identify with the bad guys. Often there are levels of bad guys, the \"good\" bad guys we are identifying with and the \"bad\" bad guys who are out to do in our good bad guys, and then maybe there's a really bad, bad bad guy or two. (Here we have Remi Grutter, played by Robert Hossein, a slightly sadistic druggie.) Then there are the cops who are irrelevant or nearly so. In more modern film noir the bad guys are not even \"good\" bad guys, and they get away with it or something close to that. In the old film noir, which evolved from the gangster films of the thirties, the usual motto, following the old Hollywood \"code,\" was \"Crime Doesn't Pay,\" with every criminal having to pay for his or her crime before the end of the movie.Probably the most impressive feature of Rififi is how nicely the film moves along. The plot unfolds quickly and seamlessly much the way the great film directors always did it, directors like Stanley Kubrick, Louis Malle, and the best of Hitchcock. Some have actually compared this to Kubrick's The Killing (1956) and suggest that Kubrick stole a little. Well, directors always steal if need be, and there are some perhaps telling similarities, such as it being \"one last heist\" for the protagonist, and having the girl gum up the works. The similarities may go deeper because as this film was nearing its end I suddenly thought, oh, no! the suitcase in the back seat is going to fly out of the convertible, hit the ground, burst open, and all the money is going to fly into the air! Those of you who have seen The Killing may recall what happened to the money near the end of the film! Which reminds me of another film with something bad happening to the money: Oliver Stone's U Turn (1997) starring Sean Penn. There the money in his backpack gets blown to smithereens by a shotgun blast. Ha, ha, ha! Getting the dubbed version of this film would be an act of sacrilege since the dialogue (when there is some: the heist itself is done entirely without dialogue, about 30 minutes worth) is terse and easy to follow requiring only an occasional glance at the subtitles, which, by the way, are quite utilitarian and guiding as opposed to having every word spelled out.One other thing: all the brutality is done as sex used to be done in film, that is off camera. A guy gets his throat slit. We don't see it. I kind of like this approach. We don't have to see the gore. You could almost let your kids see Rififi--almost.Catch this one now and be on the lookout for a Hollywood reprise starring Al Pacino and directed by Harold Becker coming out next year in which you can be sure that the violent scenes will be played out in full.",
            "review_date": "2006-12-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Classic",
            "content": "The minutiae of what's involved in carrying out a robbery is what makes this one of the best of all heist movies. Then there's the robbery itself, a wordless, thirty minute nail-biter that has never been surpassed, followed by what is probably the cinema's most pronounced example of dishonor among thieves as things begin to spectacularly unravel, and we have what is unquestionably the greatest of all heist movies.This was a tough and unsentimental film when it first appeared in 1955 and it is just as tough and unsentimental today. (It displays some of the edgy brutality of Dassin's earlier \"Brute Force\"). There isn't a flabby moment or duff performance in the entire film and Dassin captures the milieu of seedy clubs and Parisian back streets like no-one else and the final drive through Paris by a dying man is one of the most iconic closing sequences of any movie. A classic.",
            "review_date": "2006-08-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Breathtakingly brilliant! Still one of the greatest crime movies ever made.",
            "content": "'Rififi' is so damn good it takes your breath away! Director Jules Dassin, blacklisted from Hollywood, was living almost hand to mouth in Europe and taking any job he could get, when he made this movie, a project he was initially not at all excited by. Happily he turned around an awful situation and ended up making a classic thriller which is still one of the greatest crime movies ever made. One of the most influential too, having an impact on movies like 'The Killing', 'The Anderson Tapes', 'Thief', 'Reservoir Dogs', 'The Score' and many, many others. 'Rififi' is a classic heist movie but it is much more than that, it is a superbly written and acted character study. The robbery sequence itself is regarded as one of the most impressive in film history, but it is by no means the only thing worth watching this movie for. In fact I'd go so far as to call it perfect. Every time you watch it you discover something more of interest. Jean Servais, who later appeared in the entertaining horror sexploitation movie 'The Devil's Nightmare', is absolutely wonderful as Tony, a veteran criminal talked into joining his young friend Jo (Carl Mohner) in a daring robbery.  His performance is first rate, but Mohner and the rest of the cast are equally good, including Drassin himself as Cesar, an Italian safe-cracker who inadvertently causes the gangs ultimate downfall.  There's a brilliant scene between Servais and Drassin towards the end of the movie which is short but unforgettable. Look out for it. Truffaut raved about this movie calling it the best Noir he'd ever seen. I don't think he was exaggerating, it really IS that good, and personally I think it's a much better movie than Truffaut's more celebrated 'Breathless'. If you enjoy crime thrillers it doesn't get much better than this! Highly recommended!",
            "review_date": "2003-03-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Effective Crime Thriller.",
            "content": "Jules Dassin, kicked out of the industry in America for advocating the gentle treatment of pet animals or something, went to Europe and directed some genuine thrillers like this as well as one or two examples of overreach such as \"He Who Must Die.\" He did some successful comedies as well and died in Greece. James Joyce remarked that Ireland's greatest export was talent and, in some ways, the same could be said of Hollywood during the blacklisting period of the early 50s.A gang of professional thieves is assembled in Paris to pull off the difficult burglary of a jewelry shop. The gang is the usual diverse group with problems at home, jealousies and intrigues in their love lives, and so forth, more or less out of \"Asphalt Jungle\", though without Huston's exquisite attention to personal details.The rather low-tech but very suspenseful robbery sequence takes about twenty minutes and was wordless, which was revolutionary at the time. The gang's leader is Jean Servais, who must have the most haggard face on the screen. He looks as if somebody had just taken his lollipop away. He's not a Big Hero. He smiles only once (I counted) and he beats the woman who deserted him for another gangster while Servais was in the slams.That other gangster, Robert Hossein, isn't in on the burglary but he finds out that Servais' band WAS involved when one of the group, played as an Italian womanizer by Dassin, hides a piece of the jewelry for his own use and gives it to a nightclub singer. Cherchez la femme. Hossein's gang finds out about the gift, recognizes it for the stolen loot it is, and beats a confession out of Dassin. Servais kills him for his betrayal. Shades of \"Goodfellas.\" Once Hossein is onto the Servais gang everything goes to pot. There's a big reward offered for the return of the stolen jewels but Hossein is motivated by a jealous rage over Servais' woman. Other murders follow, some pretty gruesome but not shown on camera.The climax has a dying Servais driving a convertible crazily through the city streets with an unwitting and happy child in the back seat. There's very little directorial razzle dazzle but Dassin's shots of the bare, stark overhead branches etched in black against a flat sky are almost surreal in their suggestiveness.Very nicely done job by all concerned. Dassin would outdo himself in silent burglaries with the color-drenched gigantism of \"Topkapi\" a few years later. \"Topkapi\", though, was a thriller with an element of comedy. This story is simply tragic.",
            "review_date": "2012-05-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Quite An Accomplishment",
            "content": "Four professional crooks attempt to steal a fortune in jewels from a heavily guarded jewelry store. This is quite a good film. And it's probably the best heist film I have seen. Tension and suspense are maximized during a 28-minute segment in the middle when there is no dialogue of any kind ... what an accomplishment.The opening third of the film is almost as good, as we meet the four crooks, led by Tony (Jean Servais), a man just out of prison, but one who cares about his friends and is especially fond of kids. One by one, the other three crooks are introduced, and each contributes his expertise in the planning and preparation, leading up to the actual heist. At a chic nightclub called \"The Age Of Gold\", we meet Viviane (Magali Noel), a tall, stylish singer with big lips whose stage show includes the song \"Rififi\", a word used to describe the danger of streetwise tough guys and their risky, outlaw pursuits; how appropriate.But Viviane's sexiness leads to a situation that causes problems for the four guys, and this plot turn occupies the final third of the film. At nearly two hours the film is a bit long. And this final section, somewhat tedious, might have benefited by a few scenes being shortened. The ending neatly wraps everything up with what is probably the only conclusion that would have been acceptable to an audience in 1955.The B&W lighting is terrific. With lots of wet streets and no sunshine, outdoor visuals convey a grayish tone throughout, consistent with the film's theme. Side lighting contributes a noir atmosphere in some indoor scenes. The score, especially at the beginning, suggests an element of danger and a noir atmosphere of chic sophistication. Casting and acting are fine.\"Rififi\" is an example of a top-notch film made on a low budget. It's got an interesting premise, a well-written script, great visuals, and a Director that knows how to put them all together to entertain audiences; no expensive gimmicks or high-priced actors needed.",
            "review_date": "2014-06-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "RIFIFI means trouble- But \"No trouble\" with script, screenplay or direction",
            "content": "Directed by an black-listed American, served as an inspiration to movies like The Killing, Reservoir dogs, Score etc. The characterization was dealt perfectly for this Noir movie with splendid photography too. Many violent scenes are executed with no/minimum gore. Over 50 years since its release and IMO one of the best heist movies. A small issue could be the predictability in the story as many of the later movies had stolen this idea . Favorite scenes in the movie includes 1) the silent robbery scene that happens in the middle of the film which is a nail-bitter. 2) The climax scene. The bottom line is that the movie team had no trouble with script, screenplay or direction and watching this was such a treat.",
            "review_date": "2013-08-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fabulous film noir...",
            "content": "You can take the crook out of the joint, but it seems exceedingly more difficult to take the joint out of the crook. We've seen this kind of character in this kind of situation before (and since): in movies like BOB LE FLAMBEUR, ELEVATOR TO THE GALLOWS, TOUCHEZ PAS AU GRISBI, THE ANDERSON TAPES, etc. Too many times to mention. What helps make this one one of the more notable is (of course) the heist itself, which plays out wordlessly in real time, and the demeanor of the lead. Bogart would think twice before crossing this guy. The ironic ending is perfectly suited to this story (it almost demands it). All around, one of the better films noir.",
            "review_date": "2007-12-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Classy French gangster film",
            "content": "American expatriate Jules Dassin makes an award-winning French gangster film. The plot involves Tony the Stephanois, a hoodlum just out of prison, who takes his band of thieves on a $240 million jewel heist. Unfortunately, his ex-wife's relationship with a notorious gangster named Grutter, an Italian safe-cracker named Cesar with a weakness for women, and the missteps of his own friend Jo cause the successful heist to turn into a bloody race against time as Grutter holds Jo's son hostage for the cash in typical \"crime never pays\" tragedy fashion.The \"rififi\" in the title is explained in a song to mean slang for basically violence and sex, and the full title, \"Du rififi chez les hommes\" means roughly \"Some naughty in the house of men\", which is pretty much where the fatal flaw of the characters take place. Leave it to a gangster film to place most of the emphasis on the missteps on the women, but this time Jo's wife gets the last laugh (if you could call it a laugh) when she predicts \"All of you are just going to kill each other.\" The characters aren't the most sympathetic and the women are mostly weak, but Dassin still builds an extremely well-crafted suspense film out of them as they pull off a heist that requires the utmost quiet, hide the goods, and then attempt to survive what basically becomes a cross-country cat and mouse game. In the mix are some very amazing photography and a fine attention to detail in editing, leading to a pacing and visual experience that well overstates the otherwise generic plot. It's not only easy to see why this is held as a classic, it's also easy to see why it's among the top 250 on the IMDb: it's suspenseful, visually magnificent, full of sex and violence, and maintains that classy gangster attitude we film buffs like so much.",
            "review_date": "2007-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Caper Film About More Than The Job",
            "content": "According to the song \"Rififi\" that one character sings in the film, the title means \"rough and tumble\". That is a good description of the underworld characters that inhabit this film. The action starts when Tony, who recently was released after five years in prison, re-establishes contact with family and friends, who quickly lure him into a jewel caper. These guys are pros and, with Tony's guidance, they meticulously plan the heist.The execution of their plan takes place without dialogue or background music, accentuating the silence so necessary for their plan.In most heist films, the job itself is the final, climactic part of the story. In Rififi, the real story takes place after the job. Without revealing too much, I will say that this is a film about human nature. It reminds us that individuals almost never change their natures.Furthermore, almost all the characters in this film have their vices or weaknesses. The film talks about \"the rules\", the unwritten principles that guide the actions of gangsters and conmen alike (for example, not ratting on associates). Due to their weaknesses, many of the characters violate the rules and fall prey to others.One scene to look for is when Cesar visits the jewelry store to case the security. He asks to use the phone, leaving his cash splayed over the countertop--a strategy of distraction that also is a basic con (confidence game).This film is blessed with topflight direction, great photography, good acting and a lean, well-written script.",
            "review_date": "2013-09-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Loyalty is bought. Betrayal is a way of life",
            "content": "A group of professionals with their own unique skill sets assemble in Paris to pull of a big heist only for the plan to fall apart when one of them betrays the team for their own selfish desires. Sound familiar? It should, it is a LOT like Ronin. I have no doubt that Frankenheimer and Mamet took a lot of inspiration from this movie 43 years down the line. I think I even recognized some of the locations.62 years is a life time in Metropolitan terms, and the Paris you see in Rififi is far, far removed from the litter-strewn, graffiti covered, overcrowded dump of a city that exists today. For this alone it is worth a watch but the slow burn of the group coming together, meticulously planning their heist, and the 32-minute silence of the heist itself is extremely suspenseful stuff. It loses a little in the final act though, which I do believe could have been about 8 minutes tighter.Jules Dassin made Rififi after being exiled from the US and blacklisted as a Communist (they were not ALL \"good old days\") and the movie is as masterfully executed as the heist it portrays, which is kind of odd as Dassin's own character in the movie is the reason why it goes sour. The moody black and white photography, real world streets, noir atmosphere make the film a classic in its own right. It's just a shame that not many people would give a chance due to being subtitled.",
            "review_date": "2017-01-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Heist!",
            "content": "Tony Stephanois, just out of prison and angry at his girl Mado's infidelity, decides to join his pals Jo and Mario in an ambitious crime. With Italian safe expert Cesar, they meticulously plan the burglary of a large jewelry establishment.This film is probably best known for two things: one, the half hour heist sequence that has absolutely no dialogue and no music, just the sounds of the men at work. Which is, by the way, wonderfully brilliant. And two, the fact the director was American but was working in France because he was targeted as part of the Hollywood blacklist.This is a great film. Obviously not the first film noir, not by a long shot, but clearly influential on future crime movies. Was \"Ocean's 11\" inspired by this film? Maybe, maybe not, but it seems like the two could be brothers.",
            "review_date": "2015-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Probably the best of French Film Noir...and that's saying a lot!",
            "content": "The 1950s and 60s brought the Film Noir style to France. Up until then, the darkly lit and grim crime stories were the domain of American directors--such as Jules Dassin--the man who actually directed \"Rififi\". In the late 1940s and very early 50s, he made four of the best films Noir had to offer--\"Night and the City\", \"The Naked City\", \"Brute Force\" and \"Thieves Highway\". So, it seems that he was THE link between the two cinemas--bringing the best of American Noir and fusing it with French sensibilities and actors. In a sad way, it was a GOOD thing (at least for cinephiles) that the Black Lists forced Dassin to relocate to Europe to make films (for more on this, by the way, watch the interview with him that's included as an extra on the DVD).I was surprised when I saw one reviewer referring to this film as an early example of \"French New Wave\". I didn't get this at all--it clearly was like Dassin's American films in most every way--except, perhaps, it tended to possibly glorify criminals in a way his earlier films had not done and the budget was lower. This film just doesn't look like that of famous New Wave directors like Truffaut or Godard--and I am happy about this, as New Wave did NOT work well with Noir (a great example is the failure of Godard's \"Alphaville\" as Noir--it just didn't seem at all like any Noir film unless you are taking LSD while viewing!). Perhaps it IS a lot like the French director Melville's films in many ways--and I am sure Melville was influenced strongly by Dassin.I would say that \"Rififi\" is among the best Noir films ever--and probably the best Noir France has to offer--and that's saying a lot, as I often prefer the French Noir films--they are THAT good. That's because even more so than the American versions, the criminals are incredibly cold and scary. Because of this, there was a wonderful realism. Instead of the often bigger than life criminals in the American versions, the French ones were more restrained--and as a result more believable.So what is so wonderful about this film? First, there are so many wonderful caper films (such as \"Bob le Flambeur\" and \"Grand Slam\")--yet this is THE best of them. Second, the caper itself was brilliantly handled. Having thirty minutes of dialog-free action without music really, really heightened the tension and was riveting. My deaf daughter usually hates this sort of film, but she sat transfixed as well. Third, the ending was wonderful. It was very dark and free of sentimentality and it also was tense and well-made--and it's hard to imagine anything better. Fourth, the film is just perfect--there is NOTHING I can thing of that I would change! About the only Noir films I might like better (and this is hard to say for sure) might be \"The Killers\"....maybe. It's also a film that cinephiles must see...period.By the way, look closely at the Italian thief in the gang--that's Dassin himself. He did act in a few movies here and there in addition to directing--and his most famous acting role was probably in \"Never on a Sunday\" (in which he co-starred with his wife).If you liked this film, some other wonderful French crime films would include \"Bob le Flambeur\" (which, in many ways, is a re-tooling of \"Rififi\"), \"Le Samourai\", \"Un Flic\" and \"Le Circle Rouge\" (all by Jean-Pierre Melville), \"Le Balance\" (sort of an early 80s reinvention of Noir) and even \"Diva\" (yes, it's NOT Noir but has many Noir qualities). There are many other films, but frankly my review is getting a bit long-winded and I have other things I must do!",
            "review_date": "2010-09-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Stunning heist film is France's answer to \"The Asphalt Jungle\"...",
            "content": "The highlight of RIFIFI is the meticulously planned heist scene where four Frenchmen manage to use power tools to perform a jewel heist in the middle of the night. The entire heist is photographed in silence as the men go about their work, each assigned to a special task. The suspense is riveting and leads to what happens after they almost get away with it.The post heist sequences are a film noir lesson in crime doesn't pay. Each of the individuals meet their untimely fate and it's morbidly fascinating to watch how the script dispenses with them.The acting is uniformly splendid, with director Jules Dassin himself appearing as one of the safe crackers. JEAN SERVAIS and CARL MOHNER are especially strong as leaders of the heist. Dassin's direction keeps the tale moving forward with the emphasis on vivid B&W photography and a pace that quickens once the crime has been committed.Undoubtedly one of the best heist films you'll ever see, comparable to John Huston's THE ASPHALT JUNGLE in the manner in which it hold the viewer in its grip.",
            "review_date": "2011-03-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hollywood, come up with your own ideas!",
            "content": "RIFIFI (Jules Dassin - France 1955)To me, it seems a very risky idea to attempt a Hollywood-remake of Jules Dassin's 1955 classic RIFIFI. Planned for release in 2007, Al Pacino apparently is gonna play the lead, taking on the role of Tony le Stephanois. Risky business... How they're gonna pull this off?Ironically, Dassin was blacklisted in Hollywood and went on to try his luck in France and made this little masterpiece, aptly called by some \"The Grandddady of all caper- and heist movies\". In my opinion, it remains a one-of-a-kind classic, beautifully filmed with one of the most memorable endings ever to be put on film. Whatever one's opinion of the film.In the last couple of years RIFIFI has become dangerously overpraised. Nevertheless, this French noir-classic shouldn't be forgotten. Go see it, before the remake is out there, in order to have some ammunition for comparing the two.Camera Obscura --- 9/10",
            "review_date": "2006-06-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Perfect Heist Film",
            "content": "There are not many films which I would describe as perfect, but Rififi definitely fits the bill. No other heist film has come close to it, before or after. The plot is simple, but engrosses you. It never ceases to amaze me how absolutely gripping the film is every time you view it. You care for all the characters, even though they are bank robbers, because they are presented as human beings with all their problems and flaws. It's hard to imagine any other actor besides Jean Servais in the role of Tony le Stéphanois. When the members of the crew are each talking about what they are going to do with their money and finally get to Tony, his answer and the expression on his face says it all. While the 30 minute heist sequence is the most famous part of the movie(and rightfully so)the film actually gets better afterward.The director Jules Dassin knew what he was doing when he decided to not have any music during the heist scene or the final shootout, but instead inserted a great climactic score during Tony's final ride towards his destiny. To think that if Dassin, an American Director, had not been blacklisted in Hollywood and forced to work in France, this masterpiece of cinema would never have been made the way it was. It certainly wouldn't have been as good if it was made as an American film during that time. It was absolutely horrible what Dassin had to go through, but he did achieve his greatest work because of it, to the benefit of all of us. I'm just cringing at the thought of the upcoming Al Pacino remake. Most heist films since Rififi have already borrowed from it in some way or another. There's no reason to remake this masterpiece other than money. Leave the classics alone!",
            "review_date": "2007-11-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pure gold standard...",
            "content": "This film is a work of pure class from start to finish, for a moment forget the famous 28 minute no dialog heist, forget that it's set in Paris and forget it's Noir. The film itself, the premise and the execution make this a pure gold experience.. it's sharp intelligent and thought through in great detail, just like the heist itself. It portrays real characters that are not only believable but whom you empathize with. It's a film that doesn't glamorize the notion of a robbery but shows it for what it is.. theft. It shows that a heist is hard work and ultimately not worth doing. Now all things considered put on top of that a daring 28 minute sequence with not a word spoken and set in gorgeous Paris with truly great attention to detail and fantastic cinematography and that last scene ...when you look up and see those trees... wonderful use of raw and basic filming techniques... it is a master piece in my view and I'm glad to have seen it.",
            "review_date": "2007-07-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Simply stunning.",
            "content": "I see alot of movies at the cinema (103 so far this year) and I have to say that this is by far and away the best film I have seen this year, even though it was released back in 1954!I sat in awe and watched this work of genius and felt quite ashamed that I had never even heard of it before my local art house cinema decided to show it for a week on what looked like a new print. The best part of the whole movie has to be the 28 minute break in where there is no speech and no music, merely the sound of the men carrying out the heist. Pure quality. Although really dark in places it is lightened with the dry humour.\nNot many films score 10 out of 10 but this does and also gets a gold star for effort!! If you ever get a chance to see this movie, please do not hesitate, it's a classic.",
            "review_date": "2002-11-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "French toast",
            "content": "When my dad recommends a film, he's usually right. \"Rififi\" was one he'd gone on about for years, so finally I bought it, first for him, then me to watch after him. It's fair to say the old man got it right again and when I say right, I mean dead right.This, quite simply, is one of the most compelling and exhilarating films I've ever seen, everything you could want in a gangster movie. I say gangster movie, but you could throw other epithets at it too, like revenge thriller, heist movie, film noir and more, it defies button-holing and is all the more remarkable when you consider when it was actually made. It's very adult in its themes and still seems remarkably up-to-date today with perhaps only its treatment of women dragging it back to its source decade.Otherwise it's violent, sexy and realistic with the ensemble acting as good as anything I've seen in a movie. Dominating proceedings is Jean Servais as Tony, the jailbird scheming supremo in a performance of sustained determination, his hangdog expression rarely changing as the movie progresses. His three confederates give able backing while the female actresses also shine, with Tony's ex-girl and girlfriend candidly shown in states of undress five years before Hitchcock shocked America when filming Janet Leigh in her brassiere.Filmed in a brooding black and white, often in the Parisian rain, it literally drips atmosphere and features many memorable shots (the death of Cesar at Tony's hand, the kidnapped child's mother running to the camera in her anguish and more), while the centrepiece is of course the celebrated 30 minute dialogue-free scene of the robbery itself, where you forget you're watching actors and instead feel like you're witnessing closed circuit TV before its time. The camera-work is fluid throughout, the pacing of the narrative just right and the downbeat conclusion wholly apt.I recommend admirers of crime movies to find a way to watch and get absorbed in this remarkable film. I certainly did.",
            "review_date": "2012-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "the absolute best",
            "content": "If any film approaches perfection, this is the one. Pound for pound and scene for scene it is the best. The only others even close are the Maltese Falcon and Asphalt Jungle, but this is the baby that beats even them. For sheer black and white beauty it is the equal of Asphalt, and just never lets up. Its ending is one of the best of all time, easily the equal of Citizen Kane. And making it even more amazing it that it was cobbled together in desperation: and made for practically nothing. In short, a bloody miracle.It builds beautifully. Everything in it works, even down to the great music of George Auric. Shot in early winter or late spring, it is authentic down to the white gangster breaths on the air. Paris never looked more dangerously beautiful.Of all the films I have ever seen, it is the only one I would give a nine and a half to. And since most of it works very well without comment, probably it is best to just say, watch it and behold.",
            "review_date": "2004-12-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's not just the heist scene",
            "content": "Rififi deservedly gets a lot of mention for the famous heist scene, and, indeed, that scene deserves all the credit it gets. It's a masterful piece of suspense, character interaction and photography. But Rififi isn't just this one scene - every scene in the film is as masterfully put together, and as a whole, the film is not only taught with suspense, plot and character, but an adroitly told moral tale that set the scene for film noire for years to come.Cinematically and technically, the heist sequence may be the most impressive scene of the film, but for me, it's the final scene that holds the most power - Tony le Stéphanois's hallucinogenic drive towards redemption.",
            "review_date": "2003-01-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Stylish and Thrilling",
            "content": "\"Rififi\" is a terrific heist movie, and one from which subsequent heist films have drawn ever since. Jules Dassin had a feel for the seedy underworld in which these thieves live---you will not find here the Hollywood glamour of \"Ocean's Eleven.\" The robbers in \"Rififi\" don't rob for the thrill, and they're not playing a game. They rob to survive, to pay for their children's upbringing, to prove to themselves and others that they still have something to offer the world. The much-lauded heist scene is a nail biter, filmed in virtual silence. I did have the feeling that the plot went on a bit longer than it needed to, but the high-speed race to deliver the child to his mother that ends the film is classic.Be warned---this movie is very bleak. But it's also very good.Grade: A-",
            "review_date": "2005-04-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "WOW! WOW! WOW!",
            "content": "RIFIFIThis was a fantastic film by Jules Dassin. Great characters, heist, villains and photography. This was the complete opposite of Kubrick's The Killing. With very little expository dialogue in the script, so much of the movie was told through actions and glances and was left up to the viewer to decipher, whereas The Killing had a narrator helping the audience feel stupid. What I really liked was the main character---he was such a bad-ass that he had a `The' before his name...Le Stephanois.The passage of time has been very good to Rififi and I think today's audiences will be surprised at how many of today's directors have borrowed form Rififi. Paul Thomas Anderson's HARD EIGHT comes to mind, as the character Sydney is very similar to Le Stephanois. Also recently, Steven Soderbergh's THE LIMEY comes to mind as being influenced by the characters in Dassin's masterpiece. The story is classic film noir: Bad guys pull off heist, get duped at the end. I think today's audiences will like the story. The only thing that doesn't quite hold up is the scene with the woman singing Rififi in the nightclub. It's quaint to watch, but there aren't many(if any) clubs left like this today. Other than that, it holds up excellently.It was easy to root for Le Stephanois because he was such a decisive man of action. He knew what to do, how to do it, and you know he would get it done. The villain was cast perfectly. He and his junkie brother were wholly contemptible and you REALLY didn't want him to get the money from such an exhilarating heist.The scene in the film with Le Stephanois trying desperately to make it to Joe's home is brilliantly juxtapaosed with the boy gleefully riding in the covertible as if it was a carnival ride. It was truly a creepy film moment and one of the only times where there was no sound effects and just soundtrack music playing.Wow, this is the coolest film noir ever. The infamous hush-hush(20 min.) heist scene, and the fact that a blacklisted American makes the ULTIMATE film noir while in Paris, FRANCE...if you haven't seen it...what the HECK are you waitin' for!?!?!? HURRY!!! HIGHEST RECOMMENDATIONS!",
            "review_date": "2003-05-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brilliant & Totally Engrossing",
            "content": "One of the most striking features of this classic heist movie is just how successfully it imparts so much information about its characters, the robbery and all that happens afterwards, in the limited time available. This is done with great skill and without ever appearing to be rushed. Time is taken to introduce the various characters and to show their relationships to each other before the meticulous planning process is carried out and every stage of the robbery is then shown in great detail and every aspect of the numerous events that follow is depicted briskly and commendably, without any loss of clarity.The robbery itself is shown in a remarkably tense 28 minute sequence during which there is no dialogue and every action seems vital to the success of the operation. The suspense then increases further when it becomes clear that the time available to the gang is very close to running out.Tony le Stephanois (Jean Servais), an ageing criminal who's just been released from prison, meets up with his protégé Jo le Suedois (Carl Mohner) who suggests that they carry out a jewellery robbery together with Mario Ferrati (Robert Manuel). After considering Jo's proposal, Tony decides not to take part and instead tracks down his ex-girlfriend Mado (Marie Sabouret) who, in his absence, has taken up with Pierre Grutter (Marcel Lupovici) a rival gangster and nightclub owner. Tony takes Mado back to his apartment where he becomes angry about her relationship with Grutter and brutally beats her with a belt. Afterwards, he reconsiders Jo's offer and decides to take part in the heist subject to various changes being made to the original plan.The three men take on expert safe-cracker Cesar le Milanais (Jules Dassin credited as Perlo Vita) of whom it's said that \"there's no safe that can resist Cesar and no woman that Cesar can resist\". On arrival in Paris, Cesar soon starts a relationship with Viviane (Magali Noel) who's a singer at Grutter's nightclub.The four men successfully carry out the robbery and arrangements are in hand for the hot jewels to be fenced. During the robbery, without anyone else noticing, Cesar took a diamond ring which he kept and later gave to Viviane. When Grutter sees Viviane's ring he quickly deduces who's carried out the high profile heist and after getting information out of Cesar, goes after the other gang members so that he can pocket the proceeds of the heist for himself. The action that Grutter subsequently takes (including the kidnapping of Jo's son) ultimately leads to none of the gang profiting from the success of the heist.\"Rififi\" was the second film that Jules Dassin had made in Europe after having been blacklisted in Hollywood during the McCarthy era and interestingly his character betrays his fellow gang members just as he himself had been betrayed by others who gave evidence about him to the House Committee on Un-American Activities.Tony is man who looks drained, disillusioned and haggard and who doesn't even look forward to enjoying the rewards that he can reasonably expect to gain from the heist. Jean Servais is magnificent in this role as his appearance and manner so perfectly reflect Tony's state of mind. He also conveys powerfully the innate sadness of a man who's compelled to live by his own code of principles even when doing the right thing brings him profound regret (as happens when he has to deal with Cesar's betrayal). He is though, also capable of kindness and selflessness as he had protected Jo from having to serve a prison sentence and also had a warm relationship with his Godson (Jo's son).Gang member Mario provides the movie with its most humorous moments and Viviane supplies the musical entertainment with a great rendition of the title song which explains the meaning of \"Rififi\".The moody Paris locations provide an ideal backdrop for this story of greed, cruelty, betrayal and revenge and it's incredible just how engrossing this low budget movie remains so many years after it was first released. It really is a marvellous achievement and a wonderful example of top class filmmaking.",
            "review_date": "2011-05-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent French noir",
            "content": "Perhaps, it is one of the greatest films I've ever laid my eyes on. Maybe I'm fooling myself but I know what I see because it is one of the terrific films. You guys probably want to know what the hell I am talking about. I'm talking about Rififi, a brilliant French heist film.Rififi means 'trouble' in French, so it has very interesting meaning to the film. To me, no other film (except for precious few) had executed 3 acts so well like Rififi. It's just absolutely well done film. I think it's one of the amazing heist films because it has famous 30 minutes silence heist sequence with no dialogues or music. My heart kept pounding fast every time I see that sequence because it get my blood rush and you feel really afraid for those guys.As I mentioned, it executed 3 acts very well. First act focused on preparation of heist. We see the characters established themselves and how they interacted with each other. Also, they rehearsed for the heist sequence so they can be ensuring that it will be successful. Second act focused on heist itself. No words are spoken nor is the music playing in this sequence because it would distract and that would be wrong. It is the center of the attention of whole film, no doubt about it. Third act focused on the results of the heist, which isn't pretty sight but that's expected since its film noir. You know what happen to people in film noir, right? Jules Dassin, whose had fled from USA due to blackmail and red scare bullshit and someone had named him as a communist, had made this masterpiece because it's his last chance to redeemed himself after being denied numerous projects due to intervene from USA embassy in Europe. Rififi was based on novel but Dassin despises that book because it had contained numerous references to racism and necrophilia. In fact, the heist sequence only take about 10 pages of whole book so Dassin work his way around that part to create a masterpiece, which is very neat. You can see Dassin in Rififi, he played safe cracker. Very cool character.When it was first release, it caused uproar among governments because several people used similar methods from Rififi to committed burglary. Imagine what happen if director tried to pull same thing today. I would be laughing too hard, that's for sure.I think it's one of the greatest heist films of all time, period. But someone had brought up good point that The Asphalt Jungle, which is finest film noir that center around heist sequence but nowhere that level similar to Rififi, had appear 5 years earlier. I will admit that I enjoy The Asphalt Jungle a lot but it's more of character driven, whereas Rififi is primary heist driven film, if that makes sense. But the heist sequences in those films are very different from each other. Rififi makes The Asphalt Jungle looks like grandfather in motor scooter, make no mistake about it.The interview with Jules Dassin in special features on DVD is amazing because he discussed how he struggled when bad things happen to him and he wept when blackmail thing happen and he had to fled to Europe. It just moved me because he's very passionate man.I find it bit strange that Rififi only cost two hundred thousand dollars to make because it seem cost a lot more since it is fantastic motion picture. The cinematography is just absolutely top notch and it makes several beautiful shot of Paris. Makes me want to visit Paris really badly because of that movie.I don't think that this film should be missed because it's really amazing. 30 minutes heist sequence will live up to the hype, make no mistake about it.",
            "review_date": "2006-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Film Noir: Paris-Style",
            "content": "As far as I am concerned, this film noir had two totally different things going for it as opposed to the film noirs I am used to viewing: 1 - the setting is Paris, France; 2 - there is 28-minute scene with no dialog.Both make this movie a bit unique, at least to English-speaking film noir fans. Actually, an American, Jules Dussain, shot the film, so it's not entirely a European film. Initially, I was disappointed in this after I had watched the first 40 minutes. It's an expensive DVD and I was bored. However, once that silent segment started - the actual heist (you already know what's it about), the film picked up considerably and just got better and better.In fact, I thought the best part of the story was what happened after the heist. The best aspect of the entire film was the cinematography. This is what makes the disc worth owning. It's excellent film noir photography and a real travelogue for those of us who have never seen Paris...and this is Paris in the mid 1950s. There are lots of bleak-but-interesting rain-soaked Paris streets and buildings I found fascinating to view. In fact, there were many more of those great shots than of London in the much better known film, The Third Man.The lead actor in here, Jean Servais, I think his name is, also is interesting to view. Someone described his face as a cross between Humphrey Bogart and Harry Dean Stanton, and that sums it up perfectly. A warning for those not expecting profanity or nudity in a classic film. This is France, not the United States, so there is a little bit of both in here. I appreciate the DVD offering the choice of subtitles or a dubbed version, too.",
            "review_date": "2005-12-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pulling for the Bad Guys",
            "content": "As I ignored all those victimized by the jewel thieves, I found myself wanting them to get away with it. It's a kind of viewer's Stockholm syndrome. The incredible effort and creativity needed to pull off the heist is overshadowed by the simple greed and anger of another faction. There is justice ultimately but at a great cost. Performances are quite striking and believable. The world these people live in is so dark. What are they going to do with their wealth after they get it? A remarkable noire film that has really withstood the test of time. A side note. If it had been me, I would have thrown that kid in the river when I had the chance.",
            "review_date": "2021-02-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tough, direct, atmospheric and stylish",
            "content": "I recently watched the 1950 film Night and the City and was so taken by it that I looked up more of the director Jules Dassin. Although I tend to watch quite a lot of films, I am not that well read in cinema and so had not seen several of his other films but it was clear that I was missing out. I decided to watch Du rififi chez les hommes (1955) simply on the basis that on IMDb it shows up first in his \"known for\" section. This turned out to be a good choice and what I found was a simple but very effective crime thriller with tough edges, Gallic coolness and stylish delivery.The plot is straightforward enough in terms of a group of criminals try to pull off a robbery from a jewelry store; but there are edges to all the characters and ultimately it works well by building this up in the first half before then delivering a stylish (and silent) robbery section and then raising the stakes in the final third. I found the tough noir- esque tone to be very satisfying and I liked that the film doesn't even have to pretend that Tony is someone that we should like or respect – he is driven by bitterness and anger and I liked this. This tough edge is complimented by a stylish mix of American noir standards, with sufficient French style to make it feel different but yet familiar. The film does this visually but also in the feel of everything – it has an effortless cool toughness that is consistent and never superficial.This is most memorable in the heist scene itself, which is part of a long sequence where not a word is spoken but yet tension is high and well maintained. This sounds like a very simple thing to do but it is pulled off very well and is impressive for how well it does this just from expressions and atmosphere. It will be no surprise to anyone familiar with heist films to say that ultimately things do not totally work out and this aspect is also done in a satisfying and engaging manner. I'll be checking out more from Dassin soon.",
            "review_date": "2013-12-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Rififi.....Still a Great Movie",
            "content": "Rififi is like a French Brandy...It gets better with age. This French movie, made in 1955 remains the definitive French noir. It is great for many reasons, and todays directors could learn a lot from it. Directed by Jules Dasson (an American,who had a hard time in America during the obscene McCarthy witch--hunts), the movie was made for a small amount of money. It is essentially the first real heist movie, and still the best.The central character played by Jean Servais does a great job. Jules Dasson said he \"got lucky\" because of the industrious crew who worked tirelessly on the project, but to make this...you needed more than luck. Its strange how some of the old, classic black and white films films don't get dated. This is one of those.",
            "review_date": "2012-07-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The French caper",
            "content": "If the caper genre owes a lot to Walter Huston, it also has a debt of gratitude to Jules Dassin, a man that was ahead of his times and who suffered a lot because of his blacklisting when Edward Dmytryk accused him of being a Communist. The end of his American career would have meant the end of Mr. Dassin, but moving to Europe proved he was bigger than the same people that had contributed to his Hollywood demise.\"Rififi\" is an elegant film in which all the right elements come together thanks to Mr. Dassin's vision. He decided to adapt Auguste Le Breton's novel because he saw the possibilities for turning it into a caper film that became an instant classic. Jules Dassin was penniless in Paris when he discovered the city that were going to serve as the background to his film. The bad weather paid off for Mr. Dassin as the streets were always wet and not much had to be done to show them that way.When we first meet Tony, he is playing cards. Tony appears to be in bad health; he coughs all the time and sweats profusely. After losing all his money, he goes to see Jo, the Swede, who tells him about a possibility for a robbery at Maupin & Webb, the fancy jewelry store at a tony section of Paris. They pass the idea through Mario, who suggests Cesar, the Milanese, an expert safe cracker.Tony, who has come out of prison recently, learns that Mado, his former lover is now with Grutter, a creep that owns a night club. Upon confronting Mado, instead of love, all he feels is contempt, and the meeting ends badly and he throws her out of his place. Grutter has no love for Tony, who is his natural enemy because of his connection with Mado.When the day arrives, the gang is able to get to the apartment building where on the second floor, right above the jewelry store, the owner lives, but he is away. Everything goes well and the gang gets away with the jewels. Cesar, the Milanese, a typical ladies' man, takes a ring as a souvenir, which in turn he gives the chanteuse at the Grutter's night club. This tactical mistake is the spark which unravels the well thought plan.Jean Servais made an excellent Tony. He showed a tired man who was possibly doing his last robbery. Carl Mohner, Robert Manuel and the director, Jules Dassin, are seen as Jo, Mario and Cesar, the quartet jewelry thieves. Marie Sabouret plays Mado. Marcel Lupovici plays Grutter with a subdued intensity. Robert Hussein, who would go to direct movies later on, makes an impression with his Remi, one of Grutter's men.The film best asset is the great camera work by Philippe Agostini, who captured the atmosphere of Paris and the locales where all these criminals operate from. Georges Auric's music plays well with the action in the film. Jules Dassin was peculiar in his choice of films that he directed, and unfortunately, that is our loss because this man was a genius as proved mainly with \"The Naked City\", \"Night and the City\" and \"Rififi\".",
            "review_date": "2006-11-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Jules Dassin Classic",
            "content": "On the street, \"rififi\" means \"likes it rough\" or \"plays rough.\" There is sure some playing rough in this brilliant Jules Dassin film, which went a long way toward taking him off the blacklist and breaking it all together.\"Rififi\" concerns a 240-million franc jewel robbery in Paris, meticulously planned and carried out by Tony le Stephanois, Jo le Suedois, Mario Farrati, and Cesar le Milanais (Jean Servais, Carl Mohner, Robert Manuel, Jules Dassin), le Stephanois being the master criminal. It's perfect, but there's a 10 million franc reward for info leading to the criminals. And because we're dealing with human beings, there's an inadvertent slip-up that gives a clue as to who they are.Filmed in black and white in Paris, \"Rififi\" is gritty, dark, violent, and very unglamorous. It is also filled with incredible tension, particularly at the end of the film, which is heart-stopping. The cinematography is dizzying, with some amazing shots.The most interesting part of this film is the spare dialogue and an entire, long sequence which shows every move of the robbery as it is carried out, with absolutely no speaking. Fantastic.The script, pace, and acting are fabulous. This is a no-miss. Jules Dassin was a master of noir, as this and \"Night and the City,\" \"The Naked City,\" etc. prove. A very powerful and influential film.",
            "review_date": "2011-05-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Rough and Tumble",
            "content": "Greetings again from the darkness. This classic French film is often referred to as the birth of the heist film. Former blacklisted US director Jules Dassin delivers a tense and unique film with terrific atmosphere, blending Film Noir with the French New Wave.One of the more unusual aspects of the film is that the actual heist is Act II, not Act III - which actually involves a kidnapping and a quest for vengeance. It's easy to view the two Ocean's Eleven films as remakes of this one, and its influence on Stanley Kubrick's The Killing, as well as Tarantino's Reservoir Dogs (the table scene), are fun to analyze.Almost 60 years later, most film classes still discuss the nearly 30 minute heist sequence that involves no dialogue or music (not counting an inadvertent piano key). The teamwork and stress of this sequence is enthralling and worth watching a few times. We somehow find ourselves pulling for these bad guys (criminals, thugs, gangsters, hoods, crooks). I call this the good-bad guy vs bad-bad guy approach.The good-bad guys are played by Jean Servais (Tony), Carl Michner (Jo), Robert Manuel (Mario), and the director Jules Dussin (Caeser, the Italian safecracker). The bad-bad guys (worthy of hissing) are led by Marcel Lupovici (Grutter) who is simply mean to everyone.Paris streets play a huge role, as does the jewelry store set and the simple sound effects that accompany the heist. Also enjoyable is the \"casing the place\" sequence as the crew plans their process. So many pieces come together to keep this one as a well-deserved entry to the classic film canon.",
            "review_date": "2014-09-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Gangster with human feelings",
            "content": "Rififi is just a name given for the title of this material, it does not have any importance in the plot of the film. However, this is another good cinema picture directed by Jules Dassin in France. One may value it as another mafia one. Yes, it is, but it has something different compared to others of this type. Personally Jean Servais (Le Stephanois presumably Sicilian) is a man pushed to be gangster but with a lot of human feelings. Somebody said that the conscious matter is a product of the environment where he or it develops, and it looks as if Le Stephanois did not have other choice in his life to become another gangster due to the conditions of the environment where he was born and raised. However, inside the person had human feelings who enable him to discriminate between bad and innocent people. Dassin used several plots which are not difficult to guess when you start looking the movie, but he was able to produce another impression with the behavior of Le Stephanois and all those associated with him. The morale of the film could be here \"Money is nothing when family and a child are at risk\". It is again another Dassin 's low-budget material filmed in France probably the mother land of his predecessors.",
            "review_date": "2011-05-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"We're not out of the woods yet.\"",
            "content": "Immediately following this film, I watched one of the trailers on the DVD, and in it, The New York Mirror proclaimed that this picture had \"enough raw sex to elevate every eyebrow\"! Really? Where was that? If that was used as a hook for the movie back in the day, then a great disservice was done to the movie going public.As far as heist films go, I thought the caper was pulled off rather easily, maybe even too easily with not a hitch during the process. However I never even realized that the thirty minute or so sequence during the robbery was done without anyone speaking. I guess that's the mark of a competent director, to get the viewer so absorbed in an extended scene that time becomes a non-factor. Very well done.So basically, after the heist was pulled off, you had two rival gangs going at it to secure the gems involved in the safe-crack. With major mistakes committed by the Stephanois' bunch (Cesar giving his gal a ring, then ratting on Mario), I began rooting for Tony as soon as coke-head Remi (Robert Hossein) grabbed the kid. The back and forth tension between the thug groups added a different dimension to the film than it would have had if it was just a caper movie.Aside from no one benefiting from the jewel heist, I was baffled by the close of the story when Tony collapsed and crashed the car he was driving with the rescued kid in it. With the local gendarme on the scene, Tony's ex, Mado (Marie Sabouret) comes along and just takes the child away from the scene. What? And then it ends. What? It could be I'm missing something, but the accolades accorded the film seem out-sized to the resulting effort. I'd still recommend it, but watching the film with a critical eye reveals enough flaws to temper the acclaim.",
            "review_date": "2017-04-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "homage to Dassin",
            "content": "What a gas of a movie! \"Film Noir\" has always been one of my favorite genres, but this one stands apart from the rest. Only \"The Big Sleep\", \"Out of the Past\", \"Murder My Sweet\", and \"The Killers\" can come close to this caper classic. I know these four American films I mentioned are not caper movies per se, but rather detective stories with complicated story lines, which still exude a \"noirean\", gritty quality about them, similar to \"Rififi\".What is different here is the way Jules Dassin sets into motion the total ambiance of the film, not only in the gritty realism of the principals, but also in the usage of the streets of Paris as a subliminal character and co-conspirator unto itself! The movie centers around \"le Stephanois\", a dark, moody and complicated ex-con getting pulled into one last shot at the hefty payoff. Even though he is an unsmiling and hard-nosed tough guy, one still senses in him a yearning for some kind of redemption by extricating himself from the demons of his past (hey, he saved little Toni!). Dassin picked the right guy (Jean Servais) for that role.That aside, the rest of the story development kind of falls into place as we journey through the famous \"silent\" caper scene to the the eventual demise of the principal \"perps\". Only their women survive, except for Ida, Mario's honey. They seemed to best understand the underlying futility of it all!",
            "review_date": "2005-06-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good crooks are domesticated",
            "content": "The novelty message of this film is that there is nothing really wrong, or in any way seriously deviant, in organizing a professionally planned and carefully executed burglary. Let us be reasonable. Men with obligations are required to earn their living, and to look after their loved ones. Who could want to meet a more everyday family man than Jo the Swede, with his regular wife and little cowboy ? Then there are the bad guys. Mafia-type crazy drug addicts, who'll do anything for a fix, slit throats, and don't hesitate to rub out little children. I've seldom seen a more evil-looking cinematic presence than Marcel Lupovici, who plays the owner of the Golden Age or Cage, Pierre Grutter. He's right up there with Al Lettieri. Those types have no ethics. They stick at nothing. Kidnap, extortion, murder, you name it. They are not decent, like the happy-go-lucky but skilled, clean-living fraternity of straightforward thieves.Then there are the two high spots. The first is the thirty minute heist; a song with no words and no music. Second is the rescue and heroic drive by Jean Servais against all odds, ensuring the little boy's safe return to his mum. Chokes you up. At one point I thought the kid was going to chuck the suitcase with the money out of the car, into the street. But no, it was finally collared by the cops. It should have gone to Jo's widow.Another memorable scene was where Servais shoots Dassin, strictly for ethical reasons. It's possibly the way this scene is shot that makes this shooting so memorable. A lesson in how to shoot a shooting. There's no doubt this film is influential. I kept thinking of Tarantino. Some elusive, nagging reservation prevents me from giving it more than 8 stars.",
            "review_date": "2016-09-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the first caper films--and one of the best",
            "content": "Four men plan a daring robbery in France.  Everything goes well until one of the robbers does something real stupid and things fall apart quickly and violently.  A film noir caper film shot on a shoe string budget in France. It's very well-done and acted and (for its time) extremely violent.  My only complaint is that it goes on too long (a little over 2 hours) and the plot seems so familar--but that's because many later, inferior films stole from this.  Nonetheless, this is a must see.",
            "review_date": "2000-11-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A classic for its silent robbery sequence, and a classic French \"polar noir\"",
            "content": "A recent re-issue of the French crime film (original title 'Du Rififi Chez les Hommes'), with its famous 20-minute silent jewel heist sequence, now comes in the US in a gorgeous new print from The Criterion Collection with improved subtitles and some extras. Jules Dassin was an American (born Julius Dassin in Middletown Connecticut) who was forced to make films in Europe because he was Blacklisted. Rififi was well publicized in the US and did well in art houses. Later Dassin became a lot more famous in the US for 'Never on Sunday' (1960) starring his wife, the Greek actress and political activist Melina Mercouri. (Greece was again glamorized and popularized for Americans and others with Anthony Quinn in Mihalis Kakogiannis' 1964 'Zorba the Greek', which was even a big hit in Cairo.) The new Rififi DVD includes a recent interview with Dassin. I did not previously realize that one of the main robbers, Cesar the Milanese, was played by Dassin, who stepped in when the original actor became unavailable. He's one of the most memorable characters, a dandified Italian safe cracker who speaks no French.Although this classic has all the trappings of French film noir--the black and white twilight world of well lit apartments, shiny black cars, men in suits, the nightclub scenes, including a dramatically filmed and lit title song performed at the club, the stony faces and the Gauloises in hand or mouth--I don't think it's as atmospheric or has quite as distinctive a style as Melville's films do. But there's the mesmerizing robbery, which still holds up today as a tour de force. It goes like clockwork, with a fine sense of craft and teamwork among the robbers. Some nosy cops are efficiently dealt with. Things quickly go wrong after they go home and distribute the loot when one of the players gets sloppy and gives a dame a ring with a million-dollar bangle in it. Has there ever been a heist film whose perps lived happily ever after? It's the wordless heist sequence that guarantees this a special place, and Dassin, an American director who had an unusually varied and exotic career, deserves full credit for that. He took a novel so conventional he was going to reject it, and added some key elements that make it special. In the event, he couldn't pass on doing the adaptation: he needed the money too much. Jean Servais, who plays the lead character Tony le Stephanois, was an actor rather down on his luck. His grim face is perfect for the role. He was later to play the lead in Dassin's He Who Must Die (1957), which used French actors in Greece for a political tale. 'Topkapi' is a somewhat disappointing 1964 caper film (it pales compared to 'Rififi') that also got US distribution. It does have a good setting, but it's wasted, gone all bland and bright and prettified. Of Dassin's post-Hollywood oeuvre, 'Never on Sunday,' with its catchy theme song and charismatic heroine, is the popular choice (and won Best Film at Cannes 1960); 'He Who Must Die' the political choice; 'Rififi' the genre choice. An odd piece is his 'Phaedra' with Mercouri and Tony Perkins (1962). Purists of tough-guy Hollywood genre work would eschew these and favor Dassin's early films, which include a prison drama, 'Brute Force' (1947);a cop flick, 'The Naked City' (1948); and two hard core noirs, 'Thieves' Highway' (1949), and 'Night and the City' (1950). Personally I tend to like French noir and American neo-noir spinoffs better than the original American noir source material--hence my enduring fascination with 'Rififi'. But Dassin is rather unique in having not only made Hollywood noir but then going over to Paris and producing a memorable example of its Fifties French derivative.",
            "review_date": "2007-07-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"We just need to see how things look by night.\"",
            "content": "Despite hearing about the movie for years,I have for some reason have never got round to seeing US director Jules Dassin's visit to French Film Noir.Shortly after finding the title on Netflix UK,I found out that superb film maker Robert Hossein had a co-starring role,which led to me deciding that it was finally time to riff on Rififi.The plot:Coming out of jail after 5 years, Tony le Stéphanois meets fellow gangster Jo le Suedois, (who Tony took the jail time for) who gives Tony the offer of joining him on a heist.Originally turning the offer down,Tony soon discovers that his girlfriend Mado has left him for their mutual friend Pierre Grutter.Beating Mado up for \"betraying\" him,Tony changes his mind and accepts Jo's offer,on condition that they don't do a smash & grab,but go for the prime cuts in a jeweler's high-security safe. View on the film:Leaving the US over refusing to testify to the House of Un-American Activities Committee,co-writer/(along with René Wheeler & Auguste Le Breton) co-star/director Jules Dassin crosses the pond with a magnetic confidence. Sketching out the robbery in the first half, Dassin and cinematographer Philippe Agostini rub a rich Film Noir coating over Jo's plans,as blares of traffic and gazes from people walking by inject the movie with an \"on the spot\" rawness,which is joined by Dassin undressing the gangs hard life backgrounds with night clubs filled with shady lights and shady girls.Trimming any possible sides of needless dialogue, Dassin delivers a magnificently pure cinematic experience,where a stylish tracking shots collect the beads of sweat falling from the nail-biting Film Noir atmosphere,that makes every stage of the operation one which cranks up the tension to breaking point.Covering them all in long Film Noir shadows and fading coats,Dassin follows the fall-out in tense side-shots and rapid-fire whip-pans capturing the crumbled state that the locations and Grutter/Tony's teamwork has fallen into.Stepping out of the big house with Tony \"le Stéphanois\",Dassin, Wheeler and Breton's adaptation of Breton's own book superbly carves in the mistrust between each gang member,via darting from Tony and Jo's on again/off again team work,to Pierre Grutter going behind everyone's back to show them all who really is in charge.Sitting back as the heist takes place,the writers brilliantly use the aftermath to fully display the Film Noir veins packed with unmasking the true faces of the robbers from the heist,which includes a kid kidnapping! Drilling into events with a supporting role,Robert Hossein gives a very good performance as Remi Grutter,whose craving for heroin stops Remi from seeing the full picture.Taking the role when the actor did not turn up, Dassin gives a surprisingly strong performance as César \"le Milanais\",due to the focus Dassin casts across César's face flipping the high stakes game that the gang are playing.Being at odds from their first meeting, Jean Servais and Carl Möhner give amazing performances as Tony and Jo,thanks to Servais giving Tony a bruised Film Noir grit,which is neatly counted by the rugged, devilish wit Möhner soaks Jo in,as they discover the Film Noir darkness in the safe with the diamonds.",
            "review_date": "2016-05-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Masterpiece",
            "content": "It is odd that it took me so long to see Jules Dassin's \"Rififi\" given how much I loved several of his American films and how high this film's reputation is. I am almost glad, however, that I came to this film at a later point as comparing it to other films of its sort (of which there are certainly many, many excellent ones) simply proves that this is a perfect film if there ever was one. \"Rififi\" is dazzling and engaging from start to finish, simultaneously a masterful thriller and captivating drama, and quite possibly the most plausible, realistic, and involving heist film of all time, and among the most perfectly engineered Noir films ever made.\"Rififi\" runs for just over two hours but moves at a faster pace than just about any other film I've seen, consequently feeling less than an hour long. The sheer intensity of the film is relentless with even the opening scenes dedicated to developing the characters and setting up the premise of the film are absolutely beautiful and integral to the film as a whole. Enough has been said about the heist sequence already but it really is one of the tensest and most entertaining sequences in cinema and quite possibly the single greatest heist sequence ever filmed, not to mention the most plausible.\"Rififi\" is far from a simple crime thriller, providing a thorough examination of human behavior and psychology which is worked into the main plot excellently in the screenplay written by Dassin, René Wheeler, and Auguste Le Breton (who also wrote the novel the film is based on). It is always interesting to see a crime or specifically a heist film where the heist itself doesn't even come close to failing but by the simple inclusion of the human element the consequences are tragic.Beyond just featuring a perfect screenplay, \"Rififi\" is nothing short of a visual masterpiece. I cannot think of a single scene where Dassin isn't at the top of his game, Georges Auric (\"The Wages of Fear\", \"The Innocents) provides one of the greatest and most suitable musical scores of all time. Finally, Philippe Agostini's stunning black and white photography helps the film maintain its terrific atmosphere and sense of style.\"Rififi\", outside of my personal favorite film \"Vertigo\", is quite possibly the most involving, intense, and purely entertaining film ever made. It is also a film of substance and immense technical precision. I have nothing but praise for this flawless masterpiece.10/10",
            "review_date": "2008-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One has to live...",
            "content": "\"One has to live\" is the reason the aging criminal Tony le Stéphanois (Jean Servais) gives when he finally agrees to join his fellow gangsters to go ahead with a burglary. At the same time he ups the ante, determined to go for the real thing, that which makes him tick - the big coup. \"One has to live\" pretty much was also what filmmaker Jules Dassin had in mind when he accepted to do a low budgeted film in Paris where he didn't even understand the novel in the first place, as all the dialog was written in French argot. Dassin wasn't even French, but more an exile, ratted out for collaborating with communists, blacklisted in the US, stranded in Europe, broke and with little hope to get back to real business. Pretty much like the anti-hero Stéphanois. But Dassin's decision had its merits - it helped the rebirth of the original French \"invention\" that once got exported to the US, went through several changes there, and now returned home through the hands of a cast out American: film noir.The screenplay Dassin wrote varies considerably from the source, first getting in depth into the authentic characters, then focusing especially on a beautifully choreographed, realistically played heist scene lasting nearly 30 minutes without any dialog or music, with the film's aftermath concluding in a spine-tingling denouement. The elimination of the music at the picture's climax in favor of sound effects carrying the suspense is a surprising highlight, even composer Georges Auric agreed to scrap the already written music himself after having seen a comparison. By the way: In this impressive French-Amercian gangster mix is also Dassin himself as a member of the cast playing the safe-cracker Cesar, as the originally intended actor couldn't make it in time - and the viewer wouldn't regret it. Especially not when it comes to the juicy ratting out scene, an echo as well to Dassin's real life experience. To sum it up: Quite a lot of coincidences were responsible to get a curiosity like \"Rififi\" on its feet. Glad it did, so that we can hear Stéphanois say that line, which bears so many connotations: \"One has to live...\"",
            "review_date": "2012-10-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "More than just the classic heist scene",
            "content": "I have been wanting to see this since my French teacher recommend it to me over forty years ago. Perhaps the long wait was worth it, since the Criterion Collection DVD restoration is impressive.In its outline this movie follows the time-worn script: a quartet of men diligently plot a difficult heist of a bank vault, the heist takes place, a small seemingly insignificant event leads to the ultimate demise of all. Even though the heist footage is transfixing, it occurs rather early and is ultimately not at the core of the film. This film separates itself from the typical heist movie by giving us insights into the personalities of the characters and their motivations - its plays as much as a drama as it does a thriller. Relationships play a big role and a kidnapping is tacked on, giving us two movies for the price of one.John Servais plays the idea man Tony le Stéphanois (always referred to as \"le Stéphanois\") with such world-weariness that he could have just stepped out of a Camus novel. Tony has just recently gotten out of jail and resists re-entering the life of crime until he has a highly unpleasant interaction with his ex-lover (who has taken up with another man) where, as punishment, he physically whips her with a belt. Thankfully that scene occurs off camera, but you are not likely to forget it. After that sobering event, since there seems little hope of reviving that relationship, Tony meets with two of his old partners in crime, Jo and Mario, and decides to join them in one last big heist. They enlist the services of Cesar, an Italian safe cracker - played by director Dassin himself - and we are off to the heist.The heist goes off without a hitch. But Cesar's womanizing bent is a personality trait that turns out to be fatal for all concerned. However, we can understand his attraction to the nightclub singer he has fallen for, since there is a brilliant set piece where she performs a sexy and cinematically inspired nightclub act - it has to be one of the most memorable scenes from any noir film.It is established early on that Tony has a close relationship with Jo and his family; in fact Jo's son refers to him as uncle. I think it is partly to help Jo's family that Tony agrees to the heist. The ending scenes, where Tony saves the life of Jo's kidnapped son, partially redeems his more brutal and amoral actions. But only partially.",
            "review_date": "2008-03-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's good overall, and exceptional in the middle",
            "content": "I've watched many film noirs in my day, but this would be one of the few French noirs that I've seen. In some senses, it's like most other film noirs: you have tough guys (\"rififi\" meaning tough guy), capers, and things going bad. There are no femme fatals in this one though.So why does this film stand out? Why in the world would I watch this over any other of the hundreds of film noirs that were made in the world? Well, for the first half hour of the film, I couldn't figure it out either. In fact, it was kind of mundane. And then came the jewel heist. This is a stunner--for almost half an hour, there is not a word of dialogue and minimal sound effects. What's more, the tension gets thicker and thicker despite the silence.The rest of the movie goes forward in a more typical fashion, but the caper itself is pretty impressive. The rest of the story is fine, a far as film noirs go. It doesn't help to elevate the film a lot, but the middle section makes the film worth watching.It's good overall, and exceptional in the middle. 7/10.",
            "review_date": "2006-10-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "There are several types of criminals, but only some of them finish the job.",
            "content": "RIFIFI is an intelligent and brutal thriller. The main protagonist is an old gangster who, after leaving the prison, at the urging of friends, decided to rob a jewelry store. Robbery is quite complicated, but a team of four men is ready. The robbery was carried out successfully. But his team, after the fatal error of one member, becomes the target of a rival gang ...This is one of the few films in which the script, scenery, dialogues, music, characterization and acting are almost perfectly aligned. It's an amazing blend of a cold-blooded crime and human sincerity. I must admit that some scenes, despite the undeniable quality, are too brutal. In this sense, this thriller has overshadowed some of Hollywood thrillers of fifties, which openly emphasized the brutality and explicitness. The story is somewhat predictable, but the human factor is secretive and mysterious. The mere robbery is brilliantly designed. Mr. Dassin created the poetry of motion without human speech. The robbery takes a long time and was carried out in a great atmosphere in which the tension can be cut with a knife. Of course, the knife sometimes \"wanders\", so any sudden movement or movement of an object is reminiscent of a human scream. I've enjoyed.The main protagonists are sincere and sympathetic (in a strange way). A rival gang is the embodiment of a crime which involves prostitution and drugs. Their performance is menacing and brutal, which is positively affected on the atmosphere of the film.Jean Servais as Tony \"le Stéphanois\" is the brains of the gang, a stubborn and an experienced criminal, who apparently can edit everything except his own life. Carl Möhner as Jo \"le Suédois\" is Tony's younger disciple. A handsome strongman who has a wife and a son. He is the protagonist who will have to choose between so desired prey and his own blood. Robert Manuel as Mario Ferrati is amiable Italian who carelessly enjoys with his beauty. The protagonist, who brings serenity in a thriller atmosphere. Jules Dassin as César \"le Milanais\", is the \u0084director\". There is no safe that he could not open. He is a little rascal whose weakness is women.I claim that this movie is one of the best French thrillers of all time.",
            "review_date": "2016-12-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "a truly methodical, cool hybrid of old-school classy heist films with some extra element...",
            "content": "Rififi, directed by Jules Dassin, is in line with the Melville crime pictures (particularly Bob le Flameur and to a point Le Cercle Rouge) of being totally focused on story and character and making sure not a word is spoken that doesn't need, and was ahead of its time. Ionically, it still has a kind of professionalism among its characters, a kind of respect (if not for selves than for others, a kind of duty) that rings well in post-WW2 France. Its actors carry faces for these characters that say 'we know what these guys are about', and from there the story takes off. Maybe it's because I have a weak spot for heist pictures, particularly where we see just the nuts and bolts (err, actual physical side) of how a heist is pulled off.One of the problems with how the actual heist is filmed in today's movies is that it's all very fast (i.e. Snatch), or done in ways we've seen too many times before. Dassin, like Melville years later, decided to create practically a silent film of a heist, sound effects included. The tension that builds up in this scene may not top what Melville had in 'Rouge', but on its own level it achieves its own greatness and momentum, and just as crucial originality to what's been done before. There are some kept close-ups, for example, as the safe is being cracked, that mark some of the best I've seen from France at that time. An added plus for the film, aside from the larval-stage new-wave touch to the film, which in the end makes it a little more modern, is that the story works so well and differently. It becomes completely about character at points, and then keeps up the thrills. The last ten to fifteen minutes are down-right miraculous; like with another classic heist picture the Asphalt Jungle, it's not even the last stop that matters, but all about how much one will go past the call of duty, putting humanism over greed.You almost wonder in all the exhilaration of the camera flying by the trees at a high speed with the car that he might just make it. Dassin has here a very entertaining and intuitive film of its genre, with a nifty little musical number as well.",
            "review_date": "2005-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Same as the robbery itself, almost perfect in its execution",
            "content": "This is the classic examination of the Perfect Robbery by and starring Jules Dassin, influenced by The Asphalt Jungle and the French-type connection between The Lavender Hill Mob and Dassin's later own Topkapi, albeit a little more earthy. Dassin gets to glorify the gangsters a little, but the end moral remained the same.A rather craggy looking guy gets out of jail and is immediately embroiled in a new bank heist, as part of a gang of four well-oiled thugs and hoods and their molls, all of them all too human. The robbery is meticulously planned and executed in almost complete silence and is totally absorbing in its ballet-like intensity. Cesar made only one error but it sure let down Tony, Jo and Mario along with the real baddies in the long run, however he didn't let us the viewers down because it makes for another absorbing last half hour, if a little savage at times. 45 year old Jean Sevais who played Tony was the only true hard boiled individual in here, the rest were either soft boiled or punks – at one point Jo's wife goes moralistic speculating out that poverty stricken youths who stay honest were the real tough guys. There's some marvellous character acting by all of the main protagonists, amidst the gloomy atmospheric splendour of a rainy and damp Paris.It's as simple as it gets, and as beautiful – sure, it's certainly of its time as is everything but it's wearing very well and is still supreme entertainment.",
            "review_date": "2014-08-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Rififi... Means Trouble!",
            "content": "A great film noir/caper movie. Great story, great shots of Paris that seem a little gritty. Great moments, too, including the 35 minute sequence of the actual heist which had no dialogue and no music, but was still involving; Dassin's own \"Forgive me\" scene; and the car ride at the end of the movie. The Stephanois (wonderfully played by Jean Servais) ranks up there with Bogie's Sam Spade and Welles's Hank Quinlan as one of the best film noir characters.",
            "review_date": "2000-12-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "an overlooked french film that is almost perfect",
            "content": "Rififi is a great film that is overlooked. It's a crime drama where a man gets out of jail and plans another job. It's an over used story but this one is different from the others. They round up the usual suspects for the job. This film takes a look at how the family gets torn apart as time goes on. The actual heist scene is one of the best I have ever seen. Instead of a suspenseful soundtrack the director decided to go with silence, around thirty minutes of silence. This fits the mood perfectly and is often copied these days. Of course things get out of hand and people die and it ends in a great ending that builds up in suspense.So if you're looking for a great film noir that not a lot of people talk about this is a great pick up.",
            "review_date": "2005-04-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Blacklisted American director serves up distinctive noir on French soil",
            "content": "The director of 'Rififi', Jules Dassin, was down on his luck at the time he was asked to get involved with this gritty film noir. Dassin was a successful American director of film noirs up until the end of the 1940s when he was suddenly blacklisted during the days of the Senator Joe McCarthy witch hunts and barred from working in the United States. Speaking during a 2000 interview featured as part of the Criterion Collection's DVD extras, Dassin remarked that he was paid very little to direct 'Rififi' as the cast and crew also worked under an extremely low budget.'Rififi' is a very atmospheric film noir, shot intentionally under low light conditions. The plot revolves around a gang of jewel thieves led by Tony \"le Stéphanois\" (played by Jean Servais, a successful French actor in the 30s, whose career was in in decline at the time, due to alcoholism). Tony, just out of prison on a five year bid for a prior jewel heist, is approached by former pal, Jo, who proposes that they accept mutual friend Mario's plan to steal some jewels from a window display case of a prominent Parisian jewelry store. The plan is initially rejected by Tony who is preoccupied with his former girlfriend, Mado, who has taken up with a tough guy nightclub owner, Pierre Grutter. In the first of a number of scenes, craftily infused with a palpable, violent edge, Tony beats Mado up for going with this other guy.With Mado now out of his life, Tony decides to accept Mario's plan but instead of a simply 'smash-and-grab' of the jeweler's store window, he proposes knocking off a safe in the apartment above the jewelry store. Mario's friend, the Italian-speaking Cesar (played by director Dassin himself) is brought in to complete the team. The gang goes through a rehearsal before committing the crime itself. This mainly involves de-arming the sophisticated alarm system. I'm not sure if we needed all the pre-heist rehearsals, particularly because much of it is repeated during the actual heist itself (I'm thinking particularly of the spraying of the fire retardant foam into the alarm box, which appears to be rather redundant and anti-climactic).Nonetheless the bulk of the heist scene is particularly noteworthy due to its having been shot without any dialogue. Also quite remarkable is the way in which an umbrella is utilized to prevent the alarm from going off, during the burglary. To my surprise, this was actually based on a crime involving a travel agency break-in, dating back to 1899!After the heist is committed, the plot takes a few other clever twists and turns. The gang is undone by the simple greed of Cesar, who pilfers a small diamond ring for his girlfriend. Grutter and company get wind of this, and end up murdering Mario and his girlfriend (another shocking scene of violence in the film), in an attempt to extort information from Jo, as to the whereabouts of the very expensive jewels, taken from the jewel company's safe. I wonder why, however, Grutter's gang failed to ransack Mario's apartment, before giving up on trying to find the jewels.After Tony finds a tied-up Cesar (captured by Grutter), he reluctantly murders him in revenge for violating the 'code of silence' between thieves. It's said that this represented Dassin's feelings toward colleagues who betrayed other colleagues during the blacklist era.The plot races toward its inevitable conclusion after Grutter kidnaps Jo's son and holds him as ransom for the jewels. Tony tells Jo to sit tight while he tracks down the kid. But Jo can't wait and meets Grutter with the cash they got from a fence for the jewels. Inevitably Grutter kills Jo and is about to make off with the jewels when Tony shows up (somehow Mado had heard that Grutter had swiped Jo's son and knew where he was). With information provided by Mado, Tony indeed tracks Grutter down and after being seriously wounded, shoots and kills Grutter (why Grutter doesn't make sure Tony is dead, before attempting to make his get away), seems a bit far-fetched. Despite his crimes, Tony performs the great sacrifice by driving Jo's son all the way back home, before he expires, with a suitcase stuffed with millions, in the backseat.'Rififi' has all the ingredients of an engaging, taut, film noir. Particularly notable is the great on-location cinematography, sure-fire editing, very believable performances by some lesser-known actors as well as director Dassin's determination not to tone down the violent scenes in order to mollify a few prurient filmgoers. 'Rififi' suffers from a few flat notes including the long-winded 'heist rehearsal' as well as a number of (aformentioned) questionable plot contrivances, that don't always add up.Overall, 'Rififi' is a pretty, solid noir. Jules Dassin was said to have regretted only the use of the song that bore the film's title. Dassin didn't want to use any music at all but was somehow talked into using the out of place song 'Rififi'. The title translates as 'rough and tumble'—a rather trite allusion to the overall atmosphere the film engenders.",
            "review_date": "2014-08-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "you won't believe your eyes",
            "content": "After watching Jules Dassin's \"Du rififi chez les hommes\" (\"Rififi\" in English), all that I can say is that it blew my mind. I don't think that there's ever been a heist movie like this one. Following his blacklist in Hollywood, Dassin went on to direct one of the all-time masterpieces.Without a doubt the best scene is the heist itself. The protagonists carry out the heist without a word. Their silence and the sweat dripping off their faces creates a level of tension like you can't imagine. Of course it's what happens after the heist that provides a major part of the story.Basically, this movie is one of the best. The acting, directing, cinematography, and Magali Noël's belting out the theme song combine to make a perfect cinematic experience. On a scale of one to ten it's a twenty. Dassin later directed another great heist movie with \"Topkapi\" starring his wife Melina Mercouri.",
            "review_date": "2013-06-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Le Grand Pere of Heist Movies",
            "content": "Rififi is a slang term meaning something akin to \"trouble,\" only it's more like \"street trouble involving fisticuffs or some other form of violence and probably a little bit of sadness.\" That's a loose translation, of course. The movie Rififi is about that particular kind of trouble that follows criminals around.I first read about Rififi in Mental Floss (thanks Mental Floss!) in an article about how the director, Jules Dassin, was blackballed during the height of McCarthyism for his socialist leanings. Drummed out of Hollywood because he dared to think workers might be getting a raw deal, he bounced around a bit and ended up in France where things looked pretty rough for him. Not rififi tough. He got the chance to direct a crime film and on a shoe string budget and managed to create a classic that still vibrates with a sense of urgency, seedy despair, unspoken rules of the underground and shocking violence.The plot is simple – le Stephanois is a tough, street smart and aging criminal who gets out of jail after taking a fall for his fellow thugs. To make it up to him and give them all one more big pay day, they convince him to pull one more job knocking off a jewelry store. And they got it all planned out, of course, down to the very last detail. His pals for the caper include a strapping young tough with a lovely wife and kid, a hedonistic playboy type with his fun-loving moll and an imported safe cracker on the prowl for a good time.Plus there's a whole back story going on though that involves le Stephanois and his former lover, now associated with a crime boss. He's none too happy about her new pal and so beats her severely enough to leave a mark and send a warning.Pretty soon, the cops and the criminals are after the le boys and thins soon spiral out of control.The whole movie is razor sharp and layered with a sense of urgency and foreboding. The infamous heist scene, shot in near silence with no dialog, is almost unbearable This really is the grand daddy of all heist movies with a central character who is as tough, haunted, and blasted by rififi as anyone to slouch through a crime film. Check it out.-- www.cowboyandvampire.com --",
            "review_date": "2012-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Jewel of the Heist genre films.",
            "content": "The story itself is not about a heist, as OCEAN ELEVEN crap, but of course the heist scene is the highlight of the movie, one anthology sequence which lead to dozens of more or less close rip-offs, more sucessful ones than others. This story is a man's tale, rough, tough, brutal, gritty, unfortunately soften from the novel. In the book, the final fight between Tony - only survivor of the gang - and the only survivor of their enemies, is absolutely terrific; it would have been outstanding on screen, instead of what we finally got. I personnaly knew Auguste Le Breton, just before he died, and he told me that he wrote this novel only to eat, he considered this a a kind of crap, unlike LES HAUTS MURS, which told his own childhood in the awful orphanages between two WW. Irony made that this was RIFIFI that made him famous, before LE CLAN DES SICILIENS and many other films, and also a rich man and permited him to buy a beautiful house in Le Vesinet, near Paris. RIFIFI is ten times tougher than TOUCHEZ PAS AU GRISBI, from the same period, also adapted from an Albert Simonin's novel written in slang, also a hoodlums tale, but smoother. This one RIFIFI is more powerful and memorable. In the book, the heist preparation and the caper itself in not that much emphasized on; that's the only good thing for the film compared to the book. A film a masterpiece though !!!!",
            "review_date": "2021-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Daddy of All Heist Movies",
            "content": "This is the toughest, most spellbinding and, finally, enervating film I have ever seen. The protagonist, Toni Le Stephanois, as played by Jean Servais is out for a big score - the safe - as his time as a mastermind and tough guy is running out. The meticulous planning and the flawless - almost - execution of the heist had me and I am sure most of the audience wanting the crims to get away with it. And notice that the thieves plan to use their cut to make life better for those they love or care for. Only the rootless Toni cannot give an answer to the question of what he will do with his share. Should the thieves have merely sought to live it up on their ill-gotten gains, we might have wanted them caught. As with all tragedies, we often want the doomed protagonists to somehow be spared. However, it cannot be.Once the real bad guys realize who has done the heist, things can only become more and more brutal. And all that is left is for Toni to repair some of the damage done.Toni's final drive through the streets of Paris as he bleeds to death from a gunshot wound leaves me drained. The subjective camera swirls and jump cuts and the soundtrack oscillates as Toni's visual and aural perceptions move in and out of focus as he struggles onward to redemption.The film is a masterpiece. See it at least once in your life and you will never forget it.Rififi - it certainly is rough and tumble.",
            "review_date": "2015-04-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "After The Fact",
            "content": "We are confronted again with the question of whether a classic film can live up to its reputation after it has been endlessly copied over the years by flashier and more expensive ripoffs.  It begs the question, of course, to use the word \"classic\" at all.In this instance, as some of us have noted time and again, the historical context of the film is paramount.  (Please excuse the pun.) A \"classic\" film is a combination made up of disparate elements, like being the first of its kind or containing some unique and timeless characters or plot lines -- or even having the good fortune to outclass all its imitators over the years.  There are after all good antiques and bad antiques sold at Sotheby's, or original Shakespearean orations to be matched up against lame copies in modern dress.  But to try to compare \"Taming of the Shrew\" with \"Kiss Me Kate\" is to do a disservice to both.With the single exception of how Dassin develops a somewhat rapid and questionable unraveling of the perpetrators' plan, this precursor of the director's later \"Topkapi\" combines a Hitchcockian cast with other film noir elements to hold the viewer's attention from beginning to end.  It is in a word timeless, holding Paris in 1955 in the mind's eye together with superb cinematic devices and first-rate acting.",
            "review_date": "2004-06-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Still rates as an absolute must-see movie!",
            "content": "Regarded by many critics as the finest film noir ever made, the 1955 Rififi directed by Jules Dassin is available on a 7/10 Criterion DVD. (Why only 7/10? Two image break-ups, including an extended impasse at the beginning of the robbery which undermines this sequence).My personal opinion is that the movie runs far too long and tends to out-stay its welcome, thus allowing the viewer to focus on holes in the plot. For example, I feel trims should have been made to Magali Noel's rendition of the title song, as well as the ailing Jean Servais' climactic drive to Tonio's home, both of which seem to go on forever. The famous, no-dialogue robbery sequence, on the other hand, is commendably taut. Aside from Jules Dassin himself, who, despite his curiosity value, makes an unconvincing Italian romantic, the cast rates as uniformly fine. Servais is especially impressive. Great lighting photography by Agostini and moody sets by Trauner (as well as the inspired use of real Parisian locations) help secure Rififi a place on anyone's must-see list.",
            "review_date": "2017-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Heisty",
            "content": "It's difficult to appreciate this today as virtually every scene is now intolerably clichéd. We are supposed to marvel at the ingenious preparations for the jewellery store heist, but find ourselves simply musing instead on how rough and quaint things were then. The best parts have nothing to do with the robbery: the nightclub scenes which has a woman laid out on the floor like a snake, in stunning contrast to the humourless heavies around her (though Tony is so downbeat he is sometimes funny); the final astonishingly-shot drive through the streets in which a kid playing in the back of the car holds a gun to Tony's head. Also notable were some risqué moments that must have stirred them up in the fifties: peek-a-boo nipples, and the invitation to a nightclub floozy: \"sit your money-maker down here\". Bogey would never have been allowed to say that, though I'm sure he would have loved to.",
            "review_date": "2008-12-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Rififi - just another viewpoint",
            "content": "I find myself continually perplexed by people who come to watch a film from decades ago and cannot make any allowance for the age of the film, atmosphere that comes from it and all the little signs of the culture and society of the time. I am happy to allow that when this was made all the world was black and white and we didn't have the modern technology. Acceptable morals were different, everything was different. It is indeed a keyhole into a view of life in the early fifties. I like the way that film makers of that age left different things to our imagination, so different to nowadays! We have so much spelt out! The characters in Rififi express so much with their eyes, the editing is sharp and the story pure melodrama. Yes, you can plonk me down on my settee to watch Rififi any time you like. It's like an old friend.",
            "review_date": "2005-12-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Superb",
            "content": "Fresh out of jail, Tony le Stephanois plans a massive jewel heist. He puts together a team and sets the wheels in motion. He discovers that his girlfriend at the time of his arrest has a new boyfriend, a big-time gangster. Little does he know it but this fact will interfere with the heist.Superb movie. Written and directed by Jules Dassin, Rififi is classic film noir. Clever, solid plot and excellent direction by Dassin. The heist itself is incredible, with some clever innovations by the thieves and is filmed in absolute silence, just like it would have gone down if it was real life. No music to up the tension, no fake atmosphere, just realism.The way it all unravels towards the end is wonderfully Shakespearean. Incredibly intriguing, enthralling and original plot development.Incredibly influential film too. You can see it in the works of Quentin Tarantino, Martin Scorsese and the Coen Brothers, to name but a few.An absolute classic.",
            "review_date": "2019-06-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Another second tier noir",
            "content": "Rififi is one of the three films which gave birth to the heist genre, and it's stark portrayal of violence and sexuality proved hugely influential in both French and American cinema.But the film itself is nothing special. A group of thieves get together and rob a jewellery store, they succeed but are then hunted down by a gang of thugs. There's the usual bitter romance thrown in and a couple minor scenes of violence, but it's all nothing you haven't seen before.The film does, however, have some moments of greatness. One early scene has Tony (an ex con) ordering his girlfriend to undress. He commands her to take off her clothes and then gazes at her naked body. All this happens off screen, of course, but it's raw and brutal nevertheless.These scenes of harsh sexuality are contrasted with scenes between another criminal and his wife. Director Jules Dassin shoots her playfully, insisting that her big breasted chest is always scantily clad. Dassin will contrast Tony's loneliness with the happiness of his fellow thieves throughout the picture.The second memorable scene is the heist itself. It's a wordless procedural and is justifiably famed. But 50 years have come and gone since it was filmed, and it now looks pretty tame. There's a lack of drama, a lack of excitement, a lack of challenges, and the audience never gets a sense of danger. We don't feel that anything is at stake.The film's final act consists of some moments of raw violence and of course the usual bleak noir ending. Characters die clumsily and realistically, but once again, times have changed. It's been over a half century since Rififi was released, and everything novel the film once had to offer has now been thoroughly absorbed and digested by countless other films. Some films are so great they manage to thoroughly conquer their future imitators, but Rififi merely equals them at best.In terms of dialogue, the film lacks wit. There are no memorable lines, no brilliant moments of dialogue. It's neither hardboiled nor naturalistic. Perhaps this is due to poor subtitle work.7/10- A confidently and well told picture, but it simply lacks that extra magic. Aside from some beautiful French architecture and some memorable shots of empty, early morning streets, this film failed to wow me. Still, for the film buff, it's essential viewing.",
            "review_date": "2007-10-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Project",
            "content": "This film is historically interesting, but (except for the kid) not particularly good moviewatching.Its historical import is usually considered as an example \u0097 probably the first \u0097 of the heist genre: the standard format is: 1) the collection of the crew 2) the performance of the heist, usually as a matter of spectacular competence and 3) the unravelling, but only if it is a European heist movie.The genre is a particular type of folding, a meticulously planned project that we watch within a larger project (the film) that we watch. The perfection of the first is carried to the second, giving us the impression of deeper engagement. An effective trick.This happens to also be a good example of where that effect works well because this isn't a very good film, but it _seems_ expert because the centerpiece event was perfect. The only flaw was passion.As it happens, during this time there was a huge battle for the cinematic between French and Italian styles of storytelling. The French approach was (and still is) cerebral while the Italian is based on personal contact and engagement in spite of reason. Just like the characters here. Because this is a French film, the careful plan is unravelled by the impetuous Italian. Both types screw around, but the Frenchie has his woman situation managed.It is photographed well.Ted's Evaluation -- 2 of 3: Has some interesting elements.",
            "review_date": "2005-04-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfect mix of material and director's sensibilities",
            "content": "Jules Dassin is a director who always manages to surprise me. The descriptions of his films never sound appealing but once I start watching them they always quickly suck me in. The reason for this is that Dassin is unusually good at pacing his narratives so that suspense is built while the story economically moves forward and the characters' personalities are revealed through action. This is complemented by his technical prowess: his directing style never draws attention to itself, yet Dassin isn't afraid to innovate with unusual techniques. An excellent example of Dassin's innovation is the heist sequence in Rififi, which is completely free of dialogue and music. Such a long period of silence is hardly common for films from this period yet no one who has seen the film can doubt its effectiveness. In fact, this may be the most famous scene of Dassin's distinguished career. A similar level of experimentation is apparent in a later scene in which an injured criminal drives his convertible at breakneck speed through a park and the camera careens wildly around him, conveying his disorientation to the viewer. Though every film I've seen by Dassin has exceeded my expectations, none has had quite as much to offer as Rififi. Its plot unfolds with the tragic inevitability for which noir is known yet at the same time Dassin explores the causes of his characters' downfall with a keen eye. This is a film which understands its characters' virtues and flaws equally and isn't afraid to show both. Rififi is a film in which the material and the director's sensibilities mesh perfectly and the result is extraordinary.",
            "review_date": "2011-08-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This is a perfect film",
            "content": "Although the film runs for two hours, it does not seem it. The direction is tight, the dialogue to the point and the editing ruthless. This is a perfect film. The premise is simple, the actors up to the task, Dassin has a keen eye and although it was possibly driven by budget restraints, the location shooting around Paris is wonderful and helps to ensure that this is based in reality and is completely believable. The heist, of course, is exemplary with its little Heath Robinson touches, a bit of wire here an umbrella there but best of all and so different to similar robberies in other films, we do not know what is going to happen. Usually there is a protracted sequence of set-up scenes as the heist is seen to be meticulously planned and when it comes to the real thing we are simply in suspense over whether something might go wrong. Here we are fascinated throughout to see just what and how these dedicated craftsmen are going to achieve their aim. Marvellous. The domestic scenes are well done, the nightclub scenes, including a full length song explaining (well almost) the meaning of the film's title. There is a very fine shoot out and then the wonderful drive through Paris with wounded driver and oblivious young boy gleefully pointing his toy gun. Marvellous!",
            "review_date": "2020-12-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A bad but wonderful dream",
            "content": "It's been about three years since I saw \"Rififi,\" on the big screen at a local art house that sometimes graciously brings back past greats for today's audience.  I haven't forgotten, and probably never will, that spellbinding almost totally silent heist scene.  What a marvel!  But equally impressive, and memorable, was the sweaty, disturbing psychological tone of the entire film--and particularly its nerve-wracking ending.  It was like a bad dream that you want to wake up from, and yet you want to see through to its end.  Grim, relentless, foreboding: sorry, that's life.  That's \"Rififi.\"  A masterpiece in its own way.",
            "review_date": "2004-01-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Gripping film after a slow start with an amazing robbery",
            "content": "This crime melodrama features one of the greatest robbery scenes in film history. It's what it's best remembered for. It's about a recently released ex-convict who meets up with some old friends who plan to rob a jewelry store. He decides to break into the safe and steal the whole cache. The robbery is meticulously planned, and when it happens, it's edge-of-your seat stuff. But even the best-laid plans can have unexpected repercussions, and that's exactly what happens here. There certainly is the message that crime doesn't pay and few films have done it more effectively. While the anti-crime message is clear, it's not done in a moralistic or heavy-handed way. Also, the film has a gritty visual style that's both realistic and expressionist, further enhancing the film noir atmosphere. The only faults with the film are that the build-up to the robbery is slow and talky and there are no characters to cheer on. All of the major characters are criminal lowlifes, though some are more repulsive than others.",
            "review_date": "2011-06-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Diamond Geezers",
            "content": "For some reason this eluded me until now - I found the DVD in a Charity Shop - and it was more than worth the wait. It's right up there with Bob, Le Flambeur - ironically Bob, Le Flambeur was made by a Frenchman who wanted to be an American whilst Rififi was made by an American forced by the blacklist to become French. Both films involve heists, both were shot on the streets of Paris in black and white and only months apart and neither film boasted any 'name' actors. I kept looking for weak links but in vain, there aren't any. Auguste Le Breton who wrote the novel on which Dassin based his screenplay, did so in a patois that even French people outside Paris struggle to understand so Dassin took one small incident, a jewel robbery, and constructed his screenplay around that instead; when the two men met - Le Breton was hired to write dialog - the novelist asked Dassin in all seriousness 'where is my book?' Wherever it is Le Breton's loss is our gain for we are treated to a masterpiece of the genre with even the minor roles being played to perfection. One to savor.",
            "review_date": "2012-09-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Method Robbers...",
            "content": "I can't believe I waited almost ten years after \"The Asphalt Jungle\" and \"Bob le Flambeur\" to watch \"Rififi\", it might be the third in the chronological frame but it's certainly the one that consolidated the genre, elevating robbery to a level of artful craftsmanship and making thieves not much honorable human beings but people who stood by a tacit code of honor that could only fascinate viewers who stayed in the safer side of the law. \"Rififi\" set all the archetypes that shaped the plots of caper classics, Kubrick would make \"The Killing\" one year later adding a level of originality with the clever editing and precise timing.But even with these movies in mind, even with my expectations all set-up, reading that it was a story of the perfect crime being ruined by the human factor and adapted from a novel from Auguste Le Breton, I just followed every minute of Jules Dassin's film with my eyes glued to the screen from start to finish. Not a single scene was wasted or felt unnecessary and certainly not the long-sequence of the jewel-robbery which is like a documentary that might have inspired a few wannabe burglars. To give you an idea of how hooked I was, when Jean Servais aka Tony le Stéphanois deactivates the alarm system by spraying extinguisher foam in it and tries to hold an ill-timed cough (the slightest vibration can ruin everything) I could hardly swallow so I choked on my own saliva and started coughing as well. I lived the burglary like a father-to-be his wife's pregnancy, that's how gripping it was.The robbery is the centerpiece of this incredibly precise and meticulously made film, it's the culmination of a whole week of preparations where every member of the team has done his homework, checking the schedules of the nearby groceries, which includes police patrols and mail deliveries. It's a work that requires such painstaking dedication that I was reminded of the French masterpiece \"The Hole\" but like in \"The Hole\", you know it would be foolish to expect a happy ending and you'd feel satisfied enough with one scene of happy celebration. The format of the film-noir is implacable but oddly comforting: it's because we know crime doesn't pay that we expect other pay-offs.And there's the atmosphere, the manly friendship, the code of honor and the whole Melvillian thing. Sevrais plays his Tony with the right touch, he's not a tough guy but a weary sad-eyed man as you'd be after five years in jail, his mistress left him for a club owner, he's got lung problems and not much luck in game. Yes, it's the man past his prime and what he does surely doesn't help to make him sympathetic and so what's left is his competence, his leadership and his ambition. We admire the man in him even if he didn't chose the right job, he's good at the one he picked. If you want to admire a competent cop, watch \"Maigret\".Not to make things gloomy, he's surrounded by more colorful personalities: there's Carl Mogner as Jo the Swede who's a handsome and robust father of one son, Mario (Robert Ferrati) who's a jovial and easy-going Italian who prevents the film from being too dark and his other friend played by Jules Dassin, an Italian safe cracker who seems to have only own weakness: women and who has eyes on the singer played by Magali Noel and who provides the film's song \"Rififi\", a word that means \"rumble between men\". There aren't many familiar faces in the film but that's the edge over films starring Gabin or Ventura, you enjoy watching these actors, in \"Rififi\", you enjoy feeling what emanates from them: toughness, solidarity, understanding and sticking one to another.The film has the atmosphere of the noir 50s, with its jazz clubs, its kept women or gangster moves, its rival gangs, and plans that goes wrong. It's set in the most remote places of Paris Montmartre, during the dawn where honest citizens aren't here. The atmosphere is magnificently rendered by Larry Adler's harmonica sound which carries the same melancholic and fatalistic weight than John Barry's \"Midnight Cowboy\". Jules Dassin makes the grayish urban landscape of Paris the tragic canvas for a picture that is more than just a robbery that goes wrong, but something about the ways of the trade, the corde of honor and a certain weight of fatality inherited from the Post-War period, these gangsters are strangers in their own lives, true contemporaries of Camus.And for all the brilliance they demonstrated during the burglary, men will be men. When I expected the human factor to play its ugly part, I thought it would be Tony's visit to his former girlfriend Mado (Marie Sabouret) where he indulges to a practice you'd never find in today's films. I thought there would be a payback, there is not, the rival gang played by the intimidating Karloff-lookalike Marcel Lupovici wants no trouble and ultimately Mado plays the most important role near the end. Did Dassin expect to mislead us? Possible, I think his approach to directing was as methodic and rigorous as the burglary. Notice the little details: the way they put ballet slippers not to make any noise, the way the safe-cracking passed as a rich man in a jewelry leaves his wallet wide open on the desk, notice his fate that echoes Dassin's own somber history with the HUAC commission. Notice how the drug problem of the rival's brother (a young Robert Hossein) ends up playing a role. Every element ties up wonderfully till its riveting climax.\"Rififi\" is a milestone on the gangster genre, when it found itself home in the Parisian post-war nights populated with marginal people and their lost dreams. That's the secret of gangster pictures, they lure you with dreams that turn into nightmares but we enjoy the dreams for they hide a certain truth about our own personal impulses.",
            "review_date": "2021-03-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "the granddaddy of all heist movies",
            "content": "I hate heist movies - generally speaking, that is.  Character development often goes out the window in favor of lengthy scenes detailing how a gang of seedy crooks is going to break into a particular vault.  Excuse me while I stifle an enormous yawn.The beginning of \"Rififi\" doesn't promise much, since once again it is more preoccupied with the robbery itself than the people committing it.  The few character scenes that do appear early on are intense and well done, but they only serve to make our protagonists sleazier and less sympathetic; am I supposed to root for a guy who beats his old girlfriend with a belt?I started to get on board with the robbery itself, a wonderful piece of almost silent film-making (no music, no dialog).  Very tense, and it's easy to see that directors have been ripping it off for generations, generally in much weaker movies such as \"Mission: Impossible\" and the godawful remake of \"Ocean's Eleven.\"  But even then, I wasn't convinced that \"Rififi\" deserves its classic reputation.Thankfully, the film takes a twist about 2/3 of the way through, and the final act is rich in both characterization and suspense.  And the last scene gives an urgent new meaning to that standard car-ride catchphrase, \"are we there yet?\"  \"Rififi\" just gets better as it goes along, so make sure you stick with it - even if heist movies aren't your bag.",
            "review_date": "2004-06-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "All criminals follow a strict code of honor.",
            "content": "Du rififi chez les hommes is a brilliant film which studies criminal minds and allows viewers to have a better understanding of criminals who are fundamentally not different from ordinary folks like us.What director Jules Dassin shows is that criminal do have families and they care a lot for them.That is why they adhere to a strict code of honor. For them a family is not only made up of wives,mistresses and children but also include casual acquaintances and close friends.Contrary to what many might find it hard to believe,Jules Dassin has not tried to glorify crime in his film as rififi makes it clear that crime never pays.It shows that all kinds of bad activities result in some kind of human loss.Apart from its philosophical stance Rifif is worth watching for its technical finesse.While watching one of the film's most brilliant sequences about breaking of a safe,one would find it hard to believe meticulous precision with which criminal minds execute their plans.This is a scene which nobody has dared to copy in Hollywood.",
            "review_date": "2008-02-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The granddaddy of heist films when it comes to the details n the ingenious method of the umbrella.",
            "content": "I saw this for the first time recently.\nFour fellas come together to rob a jewellery shop. They come up with an ingenious method to disarm the shop's alarm system n aft detailed planning n intricate methods, they succeed but things go awry aft one of em...\nThe film has sufficient tension n suspense. The camaraderie between the four is displayed well. The entire robbery is in detail minus the conversation n the total silence makes this a very engaging n suspenseful film.\nGood acting, terrific screenplay n the sudden change in the last half hour makes this film an even more entertaining one.",
            "review_date": "2020-06-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worth Viewing For Its Central Heist Alone",
            "content": "An interesting premise catapulted to higher heights by the meticulously planned, ingeniously filmed & technically perfect heist sequence that unfolds at its centre, Rififi hinges almost entirely on its caper piece which in itself is such a masterclass in breaking n entering that it has inspired similar crimes in real-life ever since but the rich character drama around the conceit does make the ride more captivating.Directed by Jules Dassin, the film takes its time to bring together the crew for the impossible job and acquaints us with their personalities before they start plotting the heist. The entire preparation & rehearsal before the main robbery is engaging but the main event is even more breathtaking. It isn't just the precise & calculated implementation of the plan but also how it is filmed & presented that adds to the effectiveness.Dassin employs silent camerawork, sharp contrasts, accurate lighting & no music or dialogues for the particular set piece, and the actors' profusely sweating faces deftly articulate the worry, caution, patience, anticipation & exhilaration they are feeling in the given moment. The acting is sincere from the entire cast. And while the inevitable downfall that follows is predictable, the story nonetheless ends on a fitting & appropriate note.Overall, Rififi is a smartly scripted & skilfully directed crime caper that makes the most of the genre elements and talented actors at its disposal to deliver a clever, gripping & consistently entertaining cinematic experience. Even if the viewers are not invested in the shady characters, the careful plotting & immaculately detailed execution of the burglary will manage to garner their complete attention. Having aged well over the years, this French noir is totally worth a view.",
            "review_date": "2020-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Steak Tartare of gangster films",
            "content": "This is a very European especially very French movie. France is home of the elegant romantic movie, of fluffy comedies and needless to say fine food. There is sensuality in all these. France, in the 19th and 20th centuries was home to sex tourism - fine dining was coupled with expert sensuality and frank sexuality. A mixture of passion and rawness. French magazines too would show more gore than their British or American equivalents. French postcards would show more explicit sex than the rest.Riffi combines this frank rawness with a kind of sensuality - the intimate details of a meticulous robbery watched silently in close up. The frank interested stare at the action as it proceeds. The pure rawness is represented by the horrible exploitation of a drug addict, and the work he's called on to perform. It was real adult cinema then and still is now.",
            "review_date": "2007-05-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An Iconic Heist Film and One of Most Perfect Crime Noir from French Cinema.",
            "content": "RIFIFI (1955) :\nBrief Review -An Iconic Heist Film and One of Most Perfect Crime Noir from French Cinema. Jules Dassin was blacklisted from Hollywood after Night And The City (1950) then after 5 years he made Rififi to prove what a Master Director he is. Among all those heist film I have seen, Rififi should stand out as the Most Perfect one for bringing Crime Noir touch affirmatively. It is hard to find any contradictions in Rififi, even if you look deeper and find one or two, it is still okay because that's the least you find in any film of this genre. I liked Dassin's Night And The City but i wasn't much impressed by the characters of the film and typical climax but here in Rififi he took care of everything and i am very appy, fully satisfied. It's a story of 4 thieves who committ an impossible robbery but then human element intervenes and film turns into a Solid noir thing. The Robbery scene in the film is Iconic and certainly the Best Naturally driven heist act i have seen. I have seen a lot of robberies gimmicks but none if them looked so natural and detailed like Rififi. And if i am not wrong, the time space provided to that particular scene is Longest in Cinema history. All the characters are written gloriously and all the actors performed it exceptionally well. Screenplay is gripping and split in two parts, one includes the planning and theft and the second half follows the dramatic noir portion. The overall pace of the film is too fast in terms of comparison to other films of the same time. By the end film gets little predictable but you don't see anything happening wrong there. Jules Dasain delivers a cracking heist film as well as a Fine Crime Noir and putting these 2 things together is tough job, you know. Overall, an Iconic Heist Film which left influences for many films and to the robberies in Real Life as well.RATING - 8/10*By - #samthebestest",
            "review_date": "2020-07-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Jules Dassin at his Best",
            "content": "Rififi is a classic heist film that is right up there with the best of its peers - The Asphalt Jungle and The Killing. Yet in many ways it feels like it is overlooked. This is a great film worthy of inclusion not only with the best heist films but with the best noir films. The film is directed by Jules Dassin. Dassin brought us other classic noir films including Brute Force, The Naked City, Thieves Highway and the brilliant Night and the City. Dassin was also blacklisted and went to Europe where he successfully revived his career. Of his later caper films Topkapi stands out. The actual heist done in complete silence, not even any music, is classic. Subtitles.",
            "review_date": "2018-06-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "seminal French caper film is as jazzy, dark and fatalistic as any American noir",
            "content": "It's a mystery to me as to why I haven't caught up to this masterful 50s caper film \u0096 turned brooding noir until now, but I'm certainly glad to report that it didn't disappoint. I haven't seen any of Jules Dassin's American films for several years but based on this I'll probably be going back and re-watching \"Brute Force\" and \"Night and the City\" quite soon.Jean Servais, a name unknown to me but a face rather familiar in its world-weariness and coldness, has recently completed a lengthy stay in prison and as is the way in these films (hey, there wouldn't be a story otherwise) isn't coping well with the straight life. An opportunity presents itself: an easy multi-million-dollar jewel heist that can be done at night with no fear of discovery by a few men. The taut filming of the robbery, half an hour of total silence, is what people most remember about the film of course, and indeed it's pretty remarkable; but I liked the half-completed location of the final shootout, once the robbery has gone sour thanks to the big mouth of one of the thieves; the excellent portrayal gritty sides of Paris in stark black and white; and Servais' channeling of both Eddie Constantine and Humphrey Bogart in his spare but brutal performance.Perhaps it's a bit too sentimental in the end, but this is one of those classics that really does live up to its reputation just as pure entertainment even if what it has to say about the human condition isn't exactly deep or thought-provoking; George Auric's at turns modernist, romantic, and jazzy score is another highlight.",
            "review_date": "2008-03-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Vidiot Reviews...",
            "content": "RififiFor career criminals prison is like a retirement home that family actually visits.However, the felon in this heist picture has just been released from those safe confines.Freed after a 5-year prison stint, ex-thief Tony (Jean Servais) is approached by his old pal Jo (Carl Möhner) about a repeat performance on a Parisian gem store. Hoping to remain a free man, Tony insists on doing the job like a professional. Hiring a safecracker to reach the real riches, Tony's crew is eventually successful. However, everything unravels when a gangster comes after their loot.Remembered for its white-knuckle - and completely soundless - burglary scene that has been mimicked by real-life bank robbers since the film's 1955 release, this pioneer of French New Wave cinema remains one of the best examples of the genre's criminal underbelly.Incidentally, the best time for a smash-and-grab in Paris is during a Yellow Vest protest. Green Lightvidiotreviews.blogspot.ca",
            "review_date": "2019-01-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "depressing",
            "content": "I'm not sure it makes sense to review a film over a hundred others have already reviewed, but I'm doing it anyway, mainly because I really disliked it and evidently that puts me in small company. I'm not anti-French films. One of my favorite films is Jacques Tati's \"Mon Oncle,\" which I can enjoy over and over. I really like several of Francis Veber's movies. But I intensely disliked \"Rififi,\" for several reasons. It's supposed to be a \"heist\" film, but except for the admittedly remarkable actual heist sequence, most of the film is about extremely obnoxious gangsters, hatred, revenge, and cruelty. Also, SPOILER ALERT HERE, I just really hate it when movies resort to \"a kid in jeopardy\" to drum up suspense, danger, etc. I didn't like it in \"The Man Who Knew Too Much,\" and I didn't like it here. To me it's just a cheap shot. Finally, and I guess this is another SPOILER ALERT, the movie's ending was just way too much of a downer for a so-called heist movie, I'd even call it infinitely depressing. Having the kid wave his toy gun around in the final sequence, was that supposed to be somehow symbolic? Give me a break. So, with apologies to all those who loved this, I really hated it.",
            "review_date": "2017-06-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A tension riddled crime thriller",
            "content": "Rififi is the grandfather of the modern heist movie, a tense, taut and well-constructed French crime caper directed by Jules Dassin that became the new benchmark for what a heist film should be and one of those rare golden age of cinema films that stands the test of times these many years on from initial release.It's a flawed classic, one that suffers from a lack of character development and sometimes gets side-tracked by some rather outrageous plot occurrences but at the end of the day, the key component that made Rififi the revered cinematic entry now is seen as remains perfectly intact and utterly gripping.Taking the bold step of including its defining set-piece around the half way point of proceedings, Dassin and his team of willing performers pull-off what could arguably be the greatest cinematic heist of all time (certainly the most well-constructed) in the form of an extended near 30 minute sequence in which four criminals lead by Jean Servais's recently released from prison Tony attempt to rob a jewelry store in the heart of Paris, silently.It's a sweat inducing and tension riddled exercise that perfectly captures the atmosphere that must be present in such a daring escapade and one that could never be bettered even by today's increasingly boundary pushing film-making techniques.There's little doubt that this particular sequence is one of the most assured and confident sequences of the cinematic period and even cinema history thanks to Dassin's wonderfully handling of the situation and the actors on-song turns during it, making it the type of extended scenario where you won't be able to turn away from what's happening on screen and will barely be able to take a breath, as our collection of criminals flirt the line of danger as time ticks by on their heist.The rest of Dassin's film pales in comparison to this defining segment but there's still nicely defined constructions within the film such as its willingness to not allow the heist to be the conclusion, more so the jumping off point for further troubles and trials, while for a film of this era, Dassin isn't afraid to push the boundaries dealing with such issues as drug abuse and cold-blooded murder that would've no doubt had the film classification board up in arms at the time.Its unquestionable that without Rififi films such as Ocean's 11 or even other crime outings such as Reservoir Dogs or Mission Impossible wouldn't have been the films they ended up being, marking this genre-defining noir crime caper a cornerstone of cinema history.Final Say -A fine film with a particularly stunning segment that makes it a must watch for cinema die-hards and genre fans, Rififi is an oft-referenced and oft-copied classic that holds up incredibly well to this day.4 socks out of 5",
            "review_date": "2019-08-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A classic Movie with many small mistakes in the story.",
            "content": "After seeing NAKED CITY and NIGHT AND THE CITY (which is still my favorite Dassin) I was more than excited to watch his \"Masterpiece\" (O-Word Criterion) RIFIFI.Now i am a little bit disappointed about the story.So I have at least these five questions in my mind:1. In the final Countdown Louis Grutter shot from the inside a house the main Character Tony le Stéphanois. He couldn't know if he is still alive or not, but he didn't care about it and ran directly after it outside the house (with the money) to reach his car. So of course Tony wasn't dead and shot him. BIG QUESTIONMARK.2. In another important scene the specialist in safes Cesar gave directly after the robbery as a present a diamond ring (which was a part of the robbery) a Woman which was working for Louis Grutter in a night bar. Stupid, because before this character wasn't THAT stupid. And of course Louis knew directly that Tony planned the jewel robbery. SMALL QUESTIONMARK.3.After the Gangsters behind Louis Grutter murder Mario Ferrati and his wife,Tony and his best friend Joe planned a revenge against Louis gang. At the same time they don't care for the security of Joe's wife and his five years old child. Of course Louis gang kidnapped the son. CHEAP and SIMPLE.4. The perfect heist: Of course this is the best 30min. long scene in the whole Plot, without any word spoken in the whole time, but was this a perfect heist?? Comparing with other movies which handle with this theme i could only smile when for example Tony was taken a fire-extinguisher to banned the alarm. Also too SIMPLE.5. The Grutter gang went to the house of Mario, because they knew (however....) the jewels will be there. Then they murder Mario and his Wife. And then? They are not searching for it! NO. They ran directly out of the apartment. And more. They not observing the apartment after it so Tony can go after a while (which was the same day) inside to take the jewels. BIG QUESTIONMARK.Over all: it's a good movie. Because of the brilliant 30min silent heist scene. Because of the very good cut (The end scene in the car through Paris is stunning) . Because of a very good actor called Jean Servais. Because of this Black/White fever you will get while watching it. Because of some other reasons too other user wrote about, but please don't tell me this is a stunning story.",
            "review_date": "2007-11-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "High Quality Noir",
            "content": "(Flash Review)This well-paced jewelry heist film has many unique scenes and stellar cinematography. Tony, just released from a five year stint in prison is ready to return to his old ways with his old pals as they have a solid caper strategized. Like many heist and gangster films, there are a few different groups of thieves attempting to outsmart the other to be the last ones standing at the end or with jewels. Beyond those aspects, the most famous part of this film is the brilliant heist scene. The director puts a lot of time into how the main thieves plan and practice, through trial and error, how to beat the alarm system. Just like with the planning, during the heist there is minimal dialog and no music so the viewer is affixed to the scenes eagerly awaiting how things will play out. There are many gritty scenes and interesting characters and this all takes place in classic Paris. A standout film in the Noir era.",
            "review_date": "2017-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Political Plot Wrinkle",
            "content": "The final sequence--A dying French guy in a big American Cadillac careening through the streets of Paris accompanied by an eight year old in a cowboy suit having the time of his young life. This couldn't be a metaphor for the post-war political situation in Europe, could it?Rififi is more than a classic, it's an archetype for every caper film that came after it. A fabulous movie!I really don't have more to say, but IMDb insists that I stretch this comment to 10 lines or more. Reminds me of why I like films noir. They usually don't run more than 100 minutes and there is no pressure to pad them out so viewers will think they are getting full value for their thrill ride money.",
            "review_date": "2005-02-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Single greatest ever!",
            "content": "I watched on the recommendation of Christopher McQuarrie, and this film has one of the single greatest heists, ever! 20 minutes of the heist, silent and brilliant. It blew my mind!",
            "review_date": "2020-02-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Breathless, gripping, influential, unforgettable...",
            "content": "As evidenced by the recent success of 'Ocean's 11 (2001)' and its sequels, 'The Italian Job (2003)' and 'Inside Man (2006),' the heist movie is still as popular as ever. For decades, audiences have flocked to the cinema to enjoy the latest crime caper, a veritable goldmine for intrigue, suspense, betrayal and adrenaline-charged action sequences. However, it's always beneficial to consider the origins of a film movement, and, though it may not be the first example, Jules Dassin's 'Rififi (1955)' would undoubtedly influence ever cinematic heist flick that followed it. Employing, and perhaps pioneering, the three-act narrative format that proves commonplace for films of its sort \u0096 the preparation, the heist, the aftermath \u0096 'Rififi' slowly and thoughtfully allows its plot to unfold, striving for realism over embellishment, and delicately laying down the cards for a tense and volatile climax. Interestingly, the authorities perform almost no function in the story at all, and so the manner in which the thieves' scheme unravels concerns only themselves and other desirous criminals, cementing the typical film-noir belief that the darker side of humanity \u0096 greed, lies, selfishness \u0096 will prove its own undoing.By 1950, director Jules Dassin had already released a string of well-received American thrillers, before falling victim to the Hollywood blacklist. Considered un-backable by most European studios, Dassin languished in poverty for a period of five years, before he was offered the opportunity to direct a low-budget French thriller based on Auguste Le Breton's novel. 'Du rififi chez les hommes (1955)' {which loosely translates to \"of brawling among men,\" a suitable description for the destructive male behaviour that devastates their well-laid plans} proved Dassin's redemption of sorts, becoming an incredible critical and commercial success and winning Best Director at the 1955 Cannes Film Festival. Then-critic François Truffaut famously referred to Dassin's film as \"the the best film noir I have ever seen,\" a lofty word of praise if there ever was one. Though the film differs from classic film noir in that the story unfolds in Paris, it contains sufficient elements of the movement to easily qualify. Indeed, Jean Servais' character, Tony le Stéphanois, might conceivably have been played by Humphrey Bogart \u0096 he may be a man past his prime, but he's proud, shrewd and decisive, and it'd be a mistake to get in his way.'Rififi' takes a few minutes to fully swing into motion, and, though our introduction to the fellow team members is quite interesting, I found little importance in Tony's relationship with former girlfriend Mado (Marie Sabouret). It was possibly included to further flesh out his character, and to define the role of women in this particularly story, but I felt that Mado simply distracted from the caper that we were all here to see. However, the undisputed centrepiece of the film is undoubtedly the breathless 33-minute heist sequence, which is entirely devoid of all music and dialogue. The crime unfolds in almost complete silence, the thieves' quiet movements barely audible in the hushed atmosphere of the empty jewellry store. Every unexpected sound leaps out at the audience like a dagger, the single resonating note of a piano acting as the men's mortal enemy. Their ingenious heist unfolds like a meticulously-staged ballet {somewhat reminiscent of the extended pickpocketing sequence in Robert Bresson's 'Pickpocket (1959)'}, every man completely and silently aware of his role in the operation. Following the successful jewel theft, composer Georges Auric is finally allowed to spread his musical wings, and Dassin begins to toy sadistically with the fates of his characters.",
            "review_date": "2008-02-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An unforgettable heist",
            "content": "\"Rififi\" is often considered the landmark film that modernized heist movies, and it shines brilliantly as a suave, sexy crime noir (that happens to be French). There are flashes of expressionism throughout - the tantalizing 'Rififi' nightclub song sequence and the shadowy night shots, but the classic quick-slung dialogue and refined criminal setting really give the movie its stride.Of course, it would be impossible to review this movie without mentioning the heist - a complex suspense sequence that takes up a full 28 minutes of running time and has no audio other than the slightest tap of a hammer or patter of a footstep. You can hear your own heartbeat race as each new step of their setup is revealed, bringing a new fear that it won't work or they may be discovered. Even though they carry the stride of first-class cons (they break into the jewelry store wearing complete suits), the characters express both confidence and doubt in their maneuvers, making every second of the continuity exhilarating. When it is finally over, you breathe a sigh of relief for these guys.Even though the heist is the pinnacle of the film, it only takes place halfway through. The second half is a moralist plug that chronicles the downfall of the cons after their perfect crime. Though it has some great scenes and completes the circle of development of each of the characters, it feels like the movie blew off most of its steam by the end. Even though the tension has all but left, there is a strange sense of loss seeing all the characters you cheered for in the first half take their inevitable fall. It's a classic tale, but told with complexity and craft that was completely new for its time, and served as a basis for every other heist-crime movie, from \"Reservoir Dogs\" to \"Ocean's Eleven.\"",
            "review_date": "2010-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Riffifi is a must see",
            "content": "Excellent foreign film of a robbery and all that goes with it too. You are in the movie courtesy of the way it is filmed. No sound, or dialog is used during the heist giving one a sense of everyone knows what to do and when so why talk? Do what we are supposed to be doing here and then, let's get out as quickly as we can. That's where we join them. We get to the thrill of the caper first hand, imagine ourselves in the money, and it is a matter of time until we all get our shares. If it was that simple we can only hope. The wild card? Human nature and the unforeseen. Nicely filmed, paced and the movie manages to hook us using more than the heist or the money too. The characters pull you in and we hope for a good ending but then, the word \"good\" is subjective. Suspense, glued to the screen type movie watching, have some popcorn to diffuse the tension, definitely a tasty drink and at least two snacks. Good job all involved and thank you for this gem",
            "review_date": "2016-04-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Rififi's heist is brilliant, the rest of it a little less so",
            "content": "Midway through Rififi is its famous heist, a scene - like the robbery it depicts - so terrifically staged and executed that it has been credited with the invention of an entire genre. But, as with many film genres and their original inspirations, the prototypes see so many changes to their form and technique as new creators shift the genre's boundaries that given enough time, very little, excluding broad plot elements, remains of the original. Such is the case with Rififi.Take the Ocean's Eleven reboot: a solid film that prioritizes style and light entertainment in all from its storytelling to the outlandish heist itself - an almost direct contrast to Rififi's heavy narrative and emphasis on the technical details of thievery. Sure, the overarching plots of the films' respective heists are similar: guy recently released from prison plans a heist with his partner-in-crime, eccentric crew is assembled, obstacles are met and overcome, and heist goes off smoothly save a couple bumps tossed in for the sake of tension. But though plenty is shared, Soderbergh's and Dassin's approaches are ultimately better characterized by what they do differently, their tone and style rendering the two films almost entirely separate experiences.As far as I can tell, Rififi finds its clearest descendant not in today's heist films, but thirty years ago in Michael Mann's Thief. Both films take their time getting to the heist and though both have it as a high point, the heist itself comprises only the story's middle. There's a beginning which consists of finding the job and establishing the characters and their personal stakes, and there is an ending which consists of the consequences of the robbery - the former being typical of the genre and the latter being singularly unusual. Mann arguably perfected this structure in Heat and yet, I believe the comparison between Thief and Rififi is far more appropriate because unlike Heat, both Rififi and Thief have an exceptional preoccupation with how things are stolen. The heists aren't the centerpieces of their respective films because they culminate in a shootout; rather, they're notable for how they immerse the viewer in their authenticity. We've seen the thieves in their personal lives. Now we get to see them in their element, approaching the task at hand with the professional detachment of skilled surgeons.Even now, six decades later, it's no mystery why Rififi's heist was so influential. It's a perfect scene, from the actors who put in appropriately restrained and focused performances to the meticulousness with which Dassin details the heist, making it feel almost like an instruction manual. Where Mann doesn't much care if he loses you on the minutiae, Dassin holds your hand throughout, directing your attention to anything required to understand the proceedings. Any context, necessary or complementary, was provided earlier. Not a word is spoken between the thieves, and yet their willful cooperation throughout the heist makes evident both their thorough preparation and reliance upon one another.The scene is so good, in fact, that the rest of the film suffers as a result.What Rififi lacks and what ultimately results in it missing the intended emotional mark of its third act is what Thief has in spades: characterization. Dassin begins with a brief introduction to the main characters: young Jo and his older, grimmer partner-in-crime, Tony. At first it seems as though Jo is to be the film's focus - he's far more charismatic than his sullen counterpart. But after some time it becomes clear that the true main character is Tony, played by a particularly sour Jean Servais. And yet, despite him taking center stage, he remains a relative unknown for the remainder of the film. We're given small insights into his character - the most being a terrifically unsettling encounter with his ex-girlfriend - but Servais plays the character with such frozen-faced detachment that despite seeing what he does, the why of it remains frustratingly vague. Doing so makes his character seem authentic (because of course a hardened criminal isn't going to just sit down and provide an audience with a detailed account of his feelings), but having an emotionless creature at the center of your deeply emotional third act is tough to pull off, and I'd argue that despite a solid finish, Dassin doesn't quite reach the narrative heights he was aiming for. After the heist, his characters stumble about through a series of seemingly random narrative contrivances until they arrive at the film's bitter ending. Truly, the most emotional scene in the film concerns the fate of a side character.I'd recommend Rififi for its moments of brilliance, because it has many. But after its most brilliant moment, its awkward spiral into tragedy feels more like an extended denouement than a proper third act, in part a credit to its tremendous heist scene and in part an unfortunate indication of the weakness of its characters.",
            "review_date": "2020-01-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very cool movie",
            "content": "Firstly, I really love this poster, it's minimalistic but that makes it even better, especially the colored guns. Just had to point my love for this poster haha now let's get to the actual movie. There is a lot to love about it, especially the heist sequence. The heist sequence is the highlight of the movie and everything else feels just ok. I lost my attention a few times due to slow pacing but I did enjoy this very much at the end.",
            "review_date": "2020-04-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An intelligent robbery movie",
            "content": "The fact that after 50 years, it is still a highly watchable movie, says a lot about it. It is more intelligent and interesting than almost all recent movies of the same genre you can find, and has a certain endearing feeling of innocence to it. I am not a big fan of this type of movies, but I could watch the whole thing without being bored, which makes it a good movie to watch with someone who does not necessarily share your taste in films. I liked the black and white palette, the excellent casting, the clever heist scene that keeps you guessing about what trick they will pull next, and the ending like everyone else. Watching the heist sequence makes one realize the power of silence, which is unfortunately so underused in today's cinema.",
            "review_date": "2008-12-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Memorably good French film noir",
            "content": "To satisfy the 10 lines minimum, the plot of the film is of an ex-convict who is recruited to participate in a jewel robbery. He revises the plan, and his team participate in an imaginative and daring heist. The robbery is, unfortunately, merely the precursor to the remainder of the film. In my opinion, the film qualifies as a film noir because of the plot twists after the robbery scene is portrayed. I'd never heard of any of the actors who played the major roles - which is a pity, as they all appeared to play well together. The film as a whole is a delight to watch, although knowing all the time that 'crime will not allowed to pay' (as in ?all? heist films prior to 'The Hot Rock'). 50s Paris was a definite bonus, as were the semi-flattened Citroens that everybody seemed to drive.9 out of 10. At least.",
            "review_date": "2011-01-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What a bore",
            "content": "This is no Ocean's Eleven. What should be an exciting movie on paper turns out to be a rather tedious affair with unremarkable characters, planning around a primitive alarm box and a half-hour heist scene that only shows how antiquated the methods were in those days. Parts of these scenes were slightly interesting but the simplicity of the heist and the indistinguishable characters drag it down. The aftermath of the heist raises the stakes but it all ends the same way for everyone. The technical elements of the film are also nothing to get excited about, as the cinematography is awfully softened and indistinct.",
            "review_date": "2021-08-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "10/10",
            "content": "After five years in prison, Tony le Stéphanois meets his dearest friends Jo and Italian Mario Ferrati, and they invite Tony to steal a pair of gems from the exhibition window of the famous jewelery Mappin & Webb Ltd, but he refuses. Tony finds his former girlfriend Mado, who became a lover of Louis Grutter, the owner of the gangster at L'Âge d'Or nightclub, and he humiliates him by hitting him on the back for infidelity. He then calls Joe and Mario and suggests hacking into the jewelry safe. They invite an Italian safe expert and the stylish Wolf Cesar to join their team and they plan a complete robbery. They succeed in their plans, but Don Juan Cesar makes things go wrong when he gives a precious ring to his lover. 50s are My Favorite Decade Since I Was Little.",
            "review_date": "2021-08-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An ingenious film!",
            "content": "Bearing in mind the year this masterpiece came out, 1955, it must rank as one of the all time greats of cinema history. I was perpetually on the edge of my seat when first seeing this a decade ago. If it is ever re-released this film deserves to be viewed as first class entertainment. The film merits its place in the movie Hall of Fame for what was an innovation in film making back in the 1950s. During the most intense part of the story, the brilliantly conceived daring raid on the bank - not a word is spoken by any bank robber, or indeed any actor - for around twenty minutes. The action takes place in near silence. This is so gripping that it makes the unique method of conducting bank robbery last enduringly in one's memory, and is the key cinematic feature that made the film famous.",
            "review_date": "2001-05-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Noirtastic brilliance",
            "content": "Jules Dassin's 1950s Noir thriller is set in Paris and right from the outset, we are transported into this dark world of \"hoods\" where lovable rogues and femme fatales dance, drink smoke and plot cunning plans to rob jewelers and banks. The film centres around Tony, Jo and Mario who plot to commit the perfect crime. The first and third acts are the human, emotional elements where we see families, lost lovers, loneliness and regret. This, in turn, explains why the characters act like they do. But what is remarkable about this film is the second act that features the heist scene. During this scene, we hear creaks, screwdrivers, drills, sighs, coughs, knocks, footsteps; but there is not a word spoken, nor a hint of music for around half an hour (a quarter of the film's running time). This scene where we see the characters carry out their cunning plan is surely one of the most tense, daring and captivating scenes in noir cinema. It's a huge compliment to Dassin's craft that an audience can remain so hypnotized and charmed by this eerily gratifying sequence, the likes of which are few and far between in today's cinema.The amount of films that seem to have directly benefited from Rififi are endless. It reminded me of Reservoir Dogs, The Killing, The Sting, Ocean's Eleven and perhaps even HEAT and Mission Impossible. That should be enough to note how inspirational and influential this movie is.The main message may be an often repeated one, which seems to be that crime doesn't pay, but the way in which it is told (not least from Jo's wife who claims that Jo's poverty stricken friends who didn't turn to crime are the real tough guys) sets it apart from others. The fact that it doesn't follow the glorification of crime that other heist / noir movies can sometimes do is also a huge bonus.There are flaws. It may have borrowed certain aspects from 'The Asphalt Jungle', and the editing in some scenes is far from perfect, with some scenes cutting rather abruptly, but surely we can forgive that for a film that is over 60 years old.Rififi is a must see.",
            "review_date": "2017-02-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Ultimate Heist Movie",
            "content": "Nobody does noir like the French. They invented it, and although American and Japanese directors have made exceptional entries in the genre, the French still do it best. For evidence, I present exhibit A, Rififi, one of the greatest gangster/heist movies ever made. Aging gangster Tony, just out of prison, gathers his friends for one last job; cracking the safe at Paris's finest jeweler. It will be the most ambitious job of their careers, with an incredible payoff. And it doesn't end with the heist either. When rival gangster Pierre realizes what they've done and decides he wants in, everything they've accomplished is put in jeopardy.Rififi doesn't waste much time establishing the characters or the setup. Back-story isn't a major concern here. Each man has his own life and personality, but the important thing is that when it comes to business, Tony, Jo, Mario and Caesar are dead serious. They know the rules, and the stakes, and are the absolute best at what they do. Their preparations are complex and painstaking. Casing the joint, memorizing the opening times of the surrounding businesses, finding a way to defeat the alarm system, all are done with the utmost care.All of this leads up to one of the tensest scenes in all cinema; the heist itself. Over half an hour, with no music or dialogue, only the (very quiet) sounds of the men at work. And what work it is. Watching these four men chisel their way through the roof, disable the alarm, and crack the safe is like watching Michelangelo sculpt or Arnold Palmer play a round of golf. It is pure precision, with no margin for even the slightest error. And what creativity they bring to their trade! I have never seen such ingenious uses for a tube of caulk or an umbrella.Most films would have difficulty going this long without sound, but here the silence is an asset. The lack of sound underscores the fact that their work relies on near-total silence. Because there is no music or other background noise, we are keenly aware of every clink of the hammer, every rattle of loose concrete, and the fall of every footstep. The silence creates tension more effectively than any ominous music could. And all the while the clock is, quite literally, ticking. Time itself is their enemy. If Rififi ended with the successful conclusion of their daring burglary, it would be a very good movie. But it does not satisfy itself with a simple happy ending. As in so many of the best noirs, the second half tells how the best plans go awry, and everything begins to fall apart. A minor act of carelessness makes them targets of the most ruthless crime boss in Paris. The body count rises alarmingly, and the bad guys soon gain what is arguably the ultimate leverage.The last act is a masterwork or growing tension, sudden reversals, and hard decisions. And the final scene, which I will not give away, is probably the best of all. The pounding, ominous music, the rapid series of cuts, and the gravity of the situation contrast with the innocence of a young child in a way that is simply incredible. Rififi is fully equal- and perhaps superior to- Chinatown, The Big Heat, or Le Samourai. If you are a fan of classic noir, I highly urge to see this film.",
            "review_date": "2015-01-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The proto-heist movie hundreds of imitators.",
            "content": "A lousy title hides the prototype heist noir peopled by dames (though not many), bad guys and worse guys killing and kidnapping in pursuit of a fortune in jewels. Little known deceased actor Jean Servais plays the anti-hero who dying of tuberculosis after a five year prison stretch decides to get the gang back together for the jewelry haul of a lifetime. The movie is widely imitated in using a prolonged, intricate, robbery sequence which I find to be the dullest part of these types of films (e.g., the \"Mission: Impossible\" or \"Ocean's Eleven\" series). I'm willing to spot the director the conclusion that the robberies are a miracle of planning without the do-it-yourself step by step instructions. Servais' gang winds up shooting it out with the \"Grutter\" gang with \"Untouchables\"-level brutality who prove to be the worse set of bad guys because of their willingness to kidnap the child of one of the gang. The double-crosses elevate the level of suspense and Servais' dour, nothing-to-lose demeanor makes for some very dark passages that never rise above the charcoal grays which dominate the cinematography. The movie is definitely foreign (the gang comes into the apartment of one of the plotters and watches him being bathed by his wife(?)) but gunplay translates easily in any language. If you are a fan of modern noir heist remakes like \"The Italian Job\" or \"The Thomas Crown Affair\" or their originals incarnations, this is the predecessor of them all.",
            "review_date": "2011-12-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "They really don't make them this anymore.",
            "content": "Tony (Jean Servais) has been in jail for robbery for 5 years. Back out on the street of 50s Paris, he's not looking too good. He probably should go take it easy someplace, but instead is drawn into a jewel heist. He's what might've been called a lovable rogue, but through todays lens he's really just a scumbag. Beating his ex and upping the ante from a jewel smash and grab to an intricate vault robbery. Along with his mates Jo (Carl Möhner) looking a bit like James Dean, Mario (Robert Manuel) and debonair safe cracker Cesar (Jules Dassin) they plan to rob a jeweller and pocket a lot of ice (that's diamonds to us). A simple enough plot, complicated by Tony's ex hooking up with Louis, a local gangster with the kind of haircut that screams dangerous Italian dude. The details of the planning are lovely and the streets of old Paris are a joy, but it's the cast that make this tick. Although Tony is a generally dislikable sort, the rest of the crew are all charismatic and I'm instantly invested. There's no idiot proofing either, it's not Oceans Eleven. Everything we need to know is deftly revealed simply by the actions on screen and the pacing is pitch perfect. As is much of the cinematography. There's some gorgeously classic stuff and a score to match too. When we get to the break in, it's close to a silent movie choreographed with utter beauty. It's perhaps this middle act that gives Rififi such a glowing reputation, but it's the final act when the carefully laid plans come unstuck that the tension really ramps up. A classy crime thriller. Right up to the gripping emotional finale.",
            "review_date": "2021-11-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent film noir",
            "content": "I found this film to hold up by todays standards.  The robbery scene is exceptionally genius.  But I don't want to reveal anything.  Just see it if you like crime movies.  It's up there with the best crime films of all time. 10/10",
            "review_date": "2002-02-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolute Must-see",
            "content": "I recently saw a new 35mm print of this masterpiece.  Everything about it was superb--the planning stage, which had a tension of its own; the execution of the burglary, silent, tense beyond words; the aftermath with its own terror and suspense.  The B&W photography is superb.  The streets of Paris, perpetually wet, are almost another character.  The acting is generally excellent (some reservations about Carl Mohner as Jo), with Jean Servais outstanding.  If you can only get to see this on DVD or video, fine, you really must see this classic if you haven't already, but if you can get to see it in a theatre, run, don't walk.",
            "review_date": "2001-08-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Still works...",
            "content": "Many of the elements in \"Rififi\" have become familiar parts of the heist picture tradition, but it still plays damn well, for a few big reasons:1) Noir, baby, noir! The mood is just great, with its dark, well-composed photography and tough, spare dialogue and performances.2) That silent half-hour heist sequence is legendary for a reason, capturing minute details and tensions through a visual style that is easy to follow and absolutely gripping.3) The ending, which shows the final death in a manner that is dizzying, dogged and powerful.This remains a terrific movie.",
            "review_date": "2002-10-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This is a must-see.",
            "content": "Run, don't walk, to rent this movie. It is re-released on an excellent DVD version. It is primo acting/directing/cinematography in the world of suspense/film noir. Tribute this to the blacklisted American director Jules Dassin, who also plays the Italian safe-cracker. See it!",
            "review_date": "2001-06-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The 30-Minute Silent Heist Scene, OMG that was Brilliant",
            "content": "Du Rififi Chez Les Hommes (1955), is Definitely one of the Best Heist Films ever Made, i was literally on the edge of my seat the whole movie, An Absolute Must-see.",
            "review_date": "2019-03-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great mood movie",
            "content": "My husband picked up Rififi at the library last week.  I had never heard of it and wasn't interested.  But what a great movie!  That Jules Dassin is quite a guy...even playing the Italian!  What a talent.No set design could ever compete with those Parisian streets.  This is definately a mood movie, and the mood is wet, smoky, Fifties Paris. Wonderful.  Everyone so stylish.  I really liked the \"modern-ness\" of the characters too.  Can you imagine an American movie from 1955 with such lusty and violent characters?  No way.The best scene was the heist.  Brilliant to leave out all music.  How I wish modern movies would do that more often.",
            "review_date": "2004-04-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Still the best heist film ever.",
            "content": "This film has held up remarkably well, much better than the countless heist films it inspired. It all works - the taut direction and editing, the performances, the gritty black-and-white photography, the music. The celebrated 30-minute wordless heist sequence is filled with suspense. The whole plot keeps moving along at great pace, but doesn't skimp on character development. The testosterone-loaded action is relieved by a handful of beautiful women and a very cool nightclub number. Jules Dassin must be singled out not only for his sure-handed direction, but also for a complex, charismatic performance as Cesar. Not a dull moment. Artfully entertaining.",
            "review_date": "2010-01-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Simply Great!",
            "content": "Fantastic movie! One of the best film noir movies ever made.  Bad guys, bad girls, a jewel heist, a twisted morality, a kidnapping, everything is here. Jean Servais has a face that would make Bogart proud and the rest of the cast is is full of character actors who seem to to know they're onto something good.  Get some popcorn and have a great time.",
            "review_date": "2000-09-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Well worth a look.",
            "content": "This noir thriller is as bleak as anything you'd get in the US, but the French really run with the ball on this one and give us a great caper with a recently paroled con trying to pull that one last heist that will allow him to retire, and all the various complications that come along to derail this idea. Great stuff, well worth a look.",
            "review_date": "2020-06-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just an average crime film.",
            "content": "It's not bad by any means, even quite entertaining, but nothing amazing.",
            "review_date": "2021-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Rough and Tumble Is For Sure",
            "content": "According to the title song of this movie, the lead character's nickname Rififi means \"rough and tumble.\" That is definitely a designation Jacques Besnard takes seriously as he slaps and punches and bullies his way through women, police and cohorts in blacklisted Hollywood director Jules Dassin's Parisian masterpiece \"du Rififi Chez Les Hommes.\" Dassin co-authored the script, as well as taking on the role of the happy-go- lucky Italian safecracker in the film. \"Rififi\" is about a recently released convict who is too deeply entrenched in the ways of crime to lead any other kind of life. He gets involved in, and eventually leads a troupe of felons through a well-scripted burglary that takes the group of thieves through the ceiling of a business to crack open a safe and steal jewels. The planning stage of the burglary is extremely precise and exacting, and the tension is felt by the viewer as well. By the time the burglary is happening, the movie has shifted into dead silence. For an interminable period, there is nothing but breathing, sweating, a hand drill boring a hole into a ceiling, a police officer's footsteps.....The intensity offered up by the actors, and enhanced by the cinematography and directing during this sequence with no dialogue is unparalleled in film making. Janine Darcey, Jacques David, and Alice Garan also co-star. The film was released in 1955 and is in French, with English subtitles. While subtitles can be difficult for some, I heartily recommend watching this film, and with the sequence without dialogue, you will be able to give your eyes a rest and enjoy a truly remarkable piece of film making. This film has influenced many other directors, including Stanley Kubrick and Quentin Tarantino. The movie \"3000 Miles To Graceland\" was loosely based on this film, with the storyline of criminals gathering together for a heist, and the double-crosses that follow taking especially violent turns in a Kevin Costner/Kurt Russell shoot fest. Hang in past the title theme song, which is sung in a nightclub in a song and dance type of style. Unfortunately, the musical number does absolutely nothing to move the plot forward or to prepare the viewer for the intense movie that immediately follows.",
            "review_date": "2013-12-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The heist itself is what matters",
            "content": "Evan Williams (of The Australian), in a review written for the recent re-release, said that `Rififi' is less striking for its silent half-hour heist, which has been done in one form or another many times since and is now too much a part of the genre to command our attention in any one instance, than for\u0085I forget what he said was striking about `Rififi'; whatever it was, I probably also forget its very occurrence in the film at all. To tell the truth, I pretty much forget everything except for the wordless heist, and the careful planning that led up to it. (The planning stage is perfectly realised. The thieves don't seem unduly worried by the fact that they can't work out how to circumvent the state-of-the-art alarm system, nor are they unduly jubilant when they DO work it out; it was simply a problem which they knew they'd solve sooner or later.) So I'd have to say Williams is completely wrong. The heist itself \u0096 its logic, its mechanics, its planning and execution \u0096 THAT'S what's interesting, not the characters who perform it, not the story it gives rise to, not the world of which it's part. The latter parts of the movie may well be interesting, and they may even be just as perfectly done (in their way) as the scenes of plotting and robbing, but they can't possibly be at the heart of the film. Note that this is NOT merely a necessary truth of films of this kind. In Kubrick's `The Killing', the aftershocks of the robbery are as interesting as the robbery itself, more interesting than the planning of it; and the final scene is at least as memorable as any other. Here, everything following the theft is so much filling. It may very well be GOOD filling, and it's probably at least necessary filling; but as I say, I don't remember.I'm not usually so inattentive. I watched `Rififi' while suffering from a toothache so bad I could scarcely move any part of my body without suffering some fresh agony. And yet, I remember the mechanics of the robbery quite clearly, and I was able to enjoy the crime even as I watched it, despite the terrible pain. The fact that I don't remember the later backstabbing or the particular characterisations with which the thieves happened to be clothed, ought not count against them, and why I'm utterly unqualified to even hazard a guess as to what the film as a whole is about. But I will guess this much: WHATEVER it's about, that aspect of it is of less importance than the clever jewel robbery. The extent to which the crime itself is seared on my mind surely says something.",
            "review_date": "2002-11-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Meet A Stiffy Named \"Rififi\"",
            "content": "The word \"rififi\" is a French, military term meaning \"combat zone\". Following its frequent use during WW2 it soon became used as slang, referring to a \"rumble or conflict amongst men\". And, yes, in this here 1955 movie there is certainly plenty of conflict going on. Indeed.Filmed in b&w - This 63-year-old, low-budget, French crime-drama had its good moments, as well as its not-so-good moments. Personally, I think that there were some really bad choices made in the casting of Rififi's six main characters.Set in Paris, France - This film's significance in movie-making history marks it as director, Jules Dassin's first foreign film following his blacklisting (and the ruin of his career) in Hollywood.",
            "review_date": "2018-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "four men star in this amazing film noir film to plan the perfect robbery, but others intervene....",
            "content": "To start with, I have done some further research on the film. Firslty, Jules Dassin directed and acted in this extremely imaginative and different film noir crime film. Secondly, This was a very low budget film, created in the Rennaissance of the prime moment of film noir. Thirdly, the jewelers where the robbery was attempted is an actual jewelers. The producers of Rififi asked them to film their, surprisingly, (I quote Jules Dassin in a recent interview on the subject, \"surprisingly, for some not very obvious reason, they were delighted at the idea of a crime film being set in their shop). It's impeccable characters and plot fit in so beautifully with their surroundings. To add on to my praise I will say this; some might say that this was a typical Hollywood film, on the contrary, this set the base for the regular plot of a Hollywood crime film. Laslty, I would like to say that I support this fresh idea of a film where not only one side wins, and that side doesn't always have to be the good one. For once, I can say that a film is not predictable! Ten stars!",
            "review_date": "2006-07-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "blueprint",
            "content": "The ultimate gritty heist film. Elements of Bogie, Welles & Sinatra will leave you  sweating & satisfied. In comparison, it really upsets the proverbial apple cart to  see recent films, such as \"Oceans Eleven (remake)\", reviewed in such high regard-especially in Europe. Films like Rififi must be shown, spoke about, and  kept alive to remind younger (pathetic) critics what true classic Noir is.Criterion  should be commended in their flawless and classy transfer.",
            "review_date": "2003-04-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great hold-up scene but not worth watching",
            "content": "Let's be realistic: this isn't as good as 'The maltese falcon' or 'Touch of Evil' (the films that meant an opening and an ending to the film noir genre according to critics, even though we all know film noirs started long before that and have never been abandoned). Rififi (slang word for a street fight) deals with a hold-up in the beginning but turns into a revenge story while approaching to its end. The 30 minutes silence sequence in which the robbery takes place is certainly a masterpiece, as a matter of fact I didn't even realise it was so long and not even that it was completely noiseless! (so absorbed was I). But it is the only really worth thing within the movie.Some of the actors are good, especially Jean Servais (who had become a top star in the 30's but was in his low days at the time Rififi was being made) and the director, Jules Dassin, who plays César, the Italian specialist in safes. This movie tries to poorly imitate her American contemporaries but then again, fails. It is sooo folkloric the club shown in the movie is called L'âge d'or (paying homage to Luis Buñuel), a woman sings a local song which gives the movie its title (this reminds me of Jean Vigo's 'L'atalante' which the producers released under the title 'La chaland qui passe', name of a very popular song at the time). It, to sum up, is plain french fries without the main course.The film has influenced popular culture so much that a lot of films released in Europe in the following years would be called: Rififi whatever... Even the word riffraff is said to be originated from this term. It was the film that showed that Europe could do good film noirs too, only that I can't agree. Even Truffaut said about it: the best film noir I've ever seen. Well, his words are never to be believed since he is sooo french he preferred the french dubbed version of 'Fahrenheit 451' rather than the original (no comment on that).The female character was one of the worst I ever saw in film history, being treated like an ornament, but the main problem is the pace, most french films have always been so slow it almost makes someone doze off on the chair; besides, the plot twist (which should be one of the pros and quickly becomes a con) turns the movie into a stupid vengeance thriller in which Servais struggles to change his character into some sort of tough cowboy in lust for revenge. Pathetic. Near the end, we see an abandoned place which reminds very much of the one shown in 'The french connection', only in the latter it wasn't so pathetic. A fight of egos takes place and everyone loses, above all the movie. So don't waste your time on this, if you wanna see a hold-up you should see Kubrick's 'The Killing'. Only if the hold-up scene could be taken away from the movie, it would get a 10 rating, otherwise the entire movie is an entire mess.",
            "review_date": "2011-05-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A brilliant combination of details with a familiar breathless protagonist",
            "content": "Tony is the one, the typical noire protagonist always trying to find a window of light with little success. He is on the verge of absolute breakdown, a deserted gangster in an asphalt jungle with an uncontrollable urge to regain his leading role. the plot brings 3 other people around Tony with apparent different motivations. Jo, soon to become the muscle of the group-Mario, the connector who knows people and Cesar, the womanizer who's delicate hands know no boundaries. The tension reaches it's peak when Tony finds out his girlfriend, the only last asset left for him has been already snatched by his arch enemy Grutter. His manhood must be testified. the heist might be his last chance. A warehouse is where the plot is planned. All details seem to be heeded, however we instinctively know there is danger wherever women are involved. Rifif has no usual femme fatale like a typical noir must, instead there is a singer in Grutters club who performs a musical about a gangster who sounds quite similar with Tony. Ironically her relationship with Cesar becomes a key point later when Cesar gives her an extra jewel stolen from the webb's. The heist is a masterpiece when it comes to details in addition to little dialogue and dynamic flow. Everything makes sense: from the fire foam used to make the siren silent to the umbrella. Every step has been well-foreseen. the suspense reaches its heights as the drill penetrates through the chest. With a camera moving rapidly between the 4 faces and with almost no dialogue exchanged, we read through their faces all the hope and fear. the scene is so complete that makes the scene of sharing future plans total unnecessary. The battle must now be fought in another arena. We have been waiting for the final showdown between Tony and grutters. The extra stolen jewel starts a row of events. The movie is quite successful in fueling the set of events leading to the final showdown: Torture, Murder, reconciliation with mado, child in threat, showdown and finally death for all those involved. In the final scene, Tony the wounded wolf gives an infant whom he just saved a ride home, a ride through Paris with all of its monuments, buildings and people is a ride of redemption for Tony towards death.",
            "review_date": "2016-08-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The heist is supurb..the rest not as much",
            "content": "The silent scenes of the crooks pulling off the heist are so great, the rest of the film can't help but seem less then thrilling in comparison. That's not to say this isn't a great noir film, cause it is (and directed by a commie, no less), just that without the aforementioned scenes, this movie would be a footnote in history at best.my Grade: B-",
            "review_date": "2003-12-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "No thanks to the gangstah",
            "content": "For whatever reason, rarely do gangster films appeal to me...and despite other insightful reviews here, this one leaves me as cold as the many bodies that inevitably litter the landscape. I put this out there as a disclaimer as I know many folks really do enjoy them so those folks can and surely will ignore me, but if like me you are almost prejudiced against them, I'd consider skipping this film.I did find myself wondering...What gets these movies made? Is there appeal in the oxymoron of the perfect crime. Or that idea of trying to plan something so well-orchestrated, like we might kid ourselves in our less flashy daily life, only to see the notion of control laughed at whim and misfortune?It cannot be the simple harsh truth of there are no short cuts, or karmic justice in crime never paying (we spend too much sympathetic time with the criminals). Again, I just don't get it. And they never get away with it, or almost never....yet we tune in again and again. Do I really have to watch Scorcese's \"Irishman\" or can I beat the rap on that for 65 years like I did for this film?The suspense of the crime in this film may have been ground-breaking in its day, feels almost quaint now. For me as a kid the Pink Panther films had that sort of roller-coaster ride thieving scene, but the opening credits were the real scene stealers. Well and those mercifully were comedies.I will say the final act was somewhat riveting, the heist itself almost a decoy for the film's big pay-off. I'm guessing the heist was a true crime creme de la verite for its day, in an Anarchist's Cookbook kind of way. Again, not my cup of crime, but...As for Tony, sure we are introduced to him as a good bad guy....and there is a sort of code for his conduct, will we see him as bad good guy? Is that the crux of the film.The line, which I see LastLiberal included as the title to their review here, was one thing that really stuck out in the film. A message from Jo's wife to Jo during the karmic calamity as the \"perfect\" film and crime unravel.That was something that stuck with me after the film ended, that and the humorous half-notion that this was the Prequel to the Red Balloon (released the year after I believe).",
            "review_date": "2020-06-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Hold Up",
            "content": "Rififi holds up extremely well for over 50 years. I just need to get something off my chest. If Jules Dassin didn't acknowledge the influence of John Huston's Asphalt Jungle, shame on him. Many film viewers consider Rififi the mother of the heist film, but that's giving Mr. Dassin more credit than he deserves. He does of course deserve credit for a wonderfully made movie, and especially for detailing the plan and action of the caper, using about 30 minutes of film time. Hollywood film makers might not have allowed that, but as a French film audiences are more patient. See the wonderful films of Robert Bresson. I do think, however, that the Dassin picture is a landmark in humanizing the criminal enterprise. Whether that's good or bad is arguable. It certainly reached out to influence the broad tolerance that we have for projects like The Sopranos. It was also a powerful enough film to change public attitude about the unfair treatment given Mr. Dassin and others black listed by the Hollywood establishment.",
            "review_date": "2015-11-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Superlative French film noir directed by an American on the run from HUAC",
            "content": "Director Jules Dassin granted an interview in which he explained the difficulties he faced after Senator McCarthy and HUAC placed him on the communist connections blacklist, forcing him to flee the USA so as not to identify others facing similar charges. He agreed to direct DU RIFIFI CHEZ LES HOMMES in 1954 because he was completely broke, had a family to feed, and, although offered a slave's salary, it would earn him more than the scripts he was churning out and selling cheaply at the time.Dassin had already shown considerable talent in directing THE NIGHT AND THE CITY, but RIFIFI is an infinitely superior film, all the more laudable for having been made within extremely difficult and tight budget limitations.In it, Dassin not only directs with the greatest composure and vision of his entire career, he also plays the part of a famous Italian safe cracker, César (no safe resists him, just as he resists no woman, which proves to be a fatal error). In fact, for an English-speaking American of French roots, Dassin plays the part in fluent Italian and very well at that.That has to go down as yet another kudo for Dassin - he extracts sublime performances from the entire cast, and in particular from the lead, Jean Servais, who was beginning to age and also had to accept a pittance for a salary.Photography is exquisite, always shot in overcast or rainy conditions, with stark chiaroscuro contrasts, providing the visual structure for a well told story that treats sex and violence with seldom observed frankness, even in 21st Century films.The code of honor among criminals also sets RIFIFI apart from just about any film I have ever watched.RIFIFI is especially famous for a 25-minute heist sequence filmed in complete silence, no dialogue at all, only the deadened sounds of the tools the team uses to break into a famous jewellery house. It is an injustice, however, to reduce it to that as it brims with intelligent and brilliantly edited sequences, notably the final one, after Le Stephanois (Servais) has retrieved the child abducted by his enemies, now trying to get their hands on the proceeds of the robbery.As much as I love THE THIRD MAN (UK 1949), and have always regarded it as the greatest film noir of all, I have to concede that RIFIFI comes very close, and its mixture of ruthlessness and grace remains unmatched, and the finale in which Le Stephanois, a callous thief and killer, does his utmost to assure the safe return of the boy to his mother, is uplifting beyond words.DU RIFIFI CHEZ LES HOMMES is a masterpiece. Do not miss it. 10/10.",
            "review_date": "2019-11-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Landmark Heist Movie",
            "content": "Rififi ranks alongside The Asphalt Jungle and The Red Circle as one of the greatest heist movies ever made. These are usually the three celebrated titles in this subgenre, and for my part Rififi is the best. Jean-Pierre Melville's is technically impressive but, like in all his movies, the narrative feels clumsy. And as much as I love John Huston's movie for its cool characters and witty dialogues, the proper heist sequence leaves me disappointed.But Jules Dassin manages to create combine a great story, complex characters and arguably the greatest heist sequence ever filmed in cinema history.Tony (Jean Servais) has just come out of jail. His friend Jo (Carl Möhner) immediately puts up him to a jewellery store robbery with fellow criminal Mario (Robert Manuel). It should be just stealing some jewels from the shop window in broad daylight, a quick but clumsy and risky job.But Tony has better plans: they'll infiltrate the bank, study the alarm system, study the movement outside the shop at different hours of the day, learn all the routine involving their target, and get in and out without anyone watching them. This sequence is the best in the movie, not just because of its length but because it's wordless. Dassin really puts the viewer in the middle of a heist and revels in all the minute details of the plan. Because the safe is the main target, they get a fourth member, Cesar (comically played by Dassin himself), a master safe-cracker.The crime is technically perfect, but then the human factor gets in the way: people start making mistakes, and the movie goes from mere exercise in criminal cleverness and becomes a complex study about human stupidity, loyalty, friendship and greed.Jean Servais, whom I had never seen in a movie prior to Rififi, plays one of the most fascinating criminals I've ever seen: smart, patient, loyal, ruthless. He effortlessly exudes that badass aura that so many actors fail to capture in modern crime movies.The cinematography is beautiful. Philippe Agostini captures a mysterious Paris full of dark byways, narrow stairs and rainy, melancholy streets. His games of shadows and light put him on the level of masters like Gunnar Fischer.Smart, sexy, fast-paced but never superficial, this human tale of crime should become the criterion by which modern crime movies are judged; it should remain what they aspire to become. And must never be forgotten.",
            "review_date": "2009-10-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "the godfather of heist movies and of many others",
            "content": "Francois Truffaut called 'Du rififi chez les hommes' (or simply 'Rififi') the best French film noir, hastening to add that it is based on the worst French noir novel (written by August Le Breton). The film is adapted and directed by Jules Dassin, a very interesting figure in world cinema. Born in 1911 in the United States, the son of Jewish emigrants from Odessa, he was the father of singer Joe Dassin and the husband of Melina Mercouri (in his second marriage). Dassin was living in France in the year of the making of this film - 1955 - at the beginning of an exile that lasted until the end of his life (he lived until 2008) due to the fact that he was blacklisted as a communist sympathizer during the witch hunt led by Senator McCarthy. 'Rififi' was thus somewhat a 'job' imposed by circumstances, a film made by Dassin to earn a living in exile, on a fairly modest budget. The result of these constraints was very happy: he filmed with little-known but well-chosen actors and many of the scenes are filmed in exterior, especially on the streets of Paris, because filming in studios was expensive. 'Du rififi chez les hommes' won him the directorial award at the Cannes Film Festival that year and, moreover, a place in the posterity of the film's history. It is not only one of the best heist films, but it is also a predecessor of many films in various genres.The story. Tony, also known as Le Stephanois, is an aging gangster who has just been released after five years in prison. His girlfriend left him for the owner of a nightclub, and he spends his time and money at poker games. His younger friend, also known as Le Suedois, proposes to participate in the robbery of the display window of a jewelry store in the center of Paris. After a violent quarrel with his ex-girlfriend, Tony decides to change his plans and rob the jewelry safe, in a well-planned action, during the night. Theft goes according to the plan, the international team of four thieves gets away with a rich booty. However, the mistake of one of them puts the rival gangster gang on their trail. The violent conflict that follows will not spare any of them.The scenes of the robbery preparation and the heist itself are models of the genre and have since been imitated and processed in dozens of variations in other films. It is said that the Paris police tried to block the distribution of the film, as these scenes could inspire real-world burglars and provide them with a 'manual' of the trade. But this is not the only aspect in which 'Du rififi chez les hommes' is pioneering. The relationships between the gangsters, the 'code of honor' and the macabre scene of the funeral are a prelude to what we will see in 'The Godfather'. It is also one of the most beautiful films set in the streets of Paris, and the directors of the New Wave a few years later applied in their films the lesson learned here. Having no financial means to hire a French team of celebrities, Jules Dassin, himself a 'foreigner', hired a few foreign actors, with little known faces but with remarkable artistic talents. The Belgian Jean Servais is perfect in the kind of roles that Jean Gabin and later Lino Ventura usually played in French films. The Austrian Carl Möhner and the Romanian Marcel Lupovici are also part of the cast. Among the French, I noticed Robert Hossein, an actor I really like, who was then at the beginning of his career. The cinematography belongs to Philippe Agostini, a very active operator between the '30s and' 50s, who abandoned this profession a few years after this film, trying, without much chance, his powers as a director. The frames are often spectacular, the still images have a real architectural appeal. The soundtrack is also excellent, including the music of Georges Auric but also the lack of music in the robbery scene. As it is often the case, the cabaret scenes in French films have their charm, and we find here a musical number whose staging seems to have inspired the generic of James Bond films. 'Du rififi chez les hommes' is a treasure trove of cinematic, visual and sound elements that inspired the filmmakers who came later, but it is also an extremely satisfying film to watch, well written and well made, which even today can be an excellent entertainment. Highly recommended.",
            "review_date": "2022-02-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nearing its fiftieth but still the best heist movie",
            "content": "I've just watched the DVD and find it recaptured my delight with seeing it in New York in 1956 (at a small art house in the 80's and on a double bill with Diabolique)The print is excellent, sound good and at a rewatching, the dubbing into English even reasonably good.Commentaries by Jules Dassin on both his life after blacklisting and making Rififi  are illuminating, but the French version remains the most remakable heist movie ever -- and many have been almost as good.I had not re-seen Rififi since the 60s on a dreadful print over late night TV interrupted by commercials and welcomed this opportunity but did not realize how great would be my delight at how beautifully this film would stand up to 21st century standards.This is Dassin's masterpiece, with a splendid cast dominated by the presence of Jean Servais as le Stefanois.For being able to rent this film, I pay tribute to Queen Video with only two branches in Toronto, but worth its weight in gold to cineastes both or its helpful, knowledgeable staff and reasonable borrowing rates.Ben Viccari",
            "review_date": "2003-05-08",
            "lang": "en",
            "source": "imdb"
        }
    ]
}