{
  "title": "Apocalypse Now",
  "rating": 8.7,
  "release_date": "1979-08-15",
  "summary": "During the Vietnam War, Captain Willard is sent on a dangerous mission into Cambodia to assassinate a renegade colonel who has set himself up as a god among a local tribe.",
  "critic_reviews": [
    "Remember the weird beauty of the massed helicopters lifting over the trees in the long shot, and the insane power of Wagner's music, played loudly during the attack, and you feel what Coppola was getting at: Those moments as common in life as art, when the whole huge grand mystery of the world, so terrible, so beautiful, seems to hang in the balance.",
    "As powerful as the movie remains and as much as I enjoyed this new cut, I have to say that the additional footage -- material that Coppola felt he had to excise 20 years ago to reach a commercial length -- has turned out to be something of a mixed blessing.",
    "Coppola and Murch have balanced their new edit with grace notes of sweetness, elegance and eroticism, and the payoff is grand, providing both a reprieve from the multiple blitzkriegs and a break in the monotony of the cruise up the Nung.",
    "As befits both its tortuous hand-to-mouth genesis and the devastating conflict it reflects, this is a film of pure sensation, dazzling audiences with light and noise, laying bare the stark horror – and unimaginable thrill – of combat. And therein lies the true heart of darkness: if war is hell and heaven intertwined, where does morality fit in? And, in the final apocalyptic analysis, will any of it matter?",
    "Francis Ford Coppola went into the jungle to make his surreal ’Nam epic and almost lost his mind during one of the most protracted and accident-prone shoots in history. Thankfully the hallucinogenic results justified the means.",
    "A film that needs to be seen on the big screen.",
    "Flawed but staggering cinema, the unforgettable Apocalypse Now setpieces are extraordinary.",
    "It is mystical, daring, poetic, thrilling, appalling and never less than utterly mesmerising.",
    "Apocalypse Now was worth the wait. Alternately a brilliant and bizarre film, Francis Coppola’s four year ‘work in progress’ offers the definitive validation to the old saw, “war is hell.”",
    "Coppola, with his bravura style of direction, has created a movie of harrowing intensity and staggering power. But if you accept the belief that art should enlighten and illuminate as well as arouse the emotions, I’m afraid that Apocalypse Now does not qualify as great art.",
    "Francis Coppola's Apocalypse Now lives up to its grand title, disclosing not only the various faces of war but also the contradictions between excitement and boredom, terror and pity, brutality and beauty. Its epiphanies would do credit to Federico Fellini, who is indirectly quoted at one point.",
    "The finished film remains a mess of tangled, turgid continuity and florid, mock-operatic style -- at best a collection of production numbers and set pieces waiting in rain for a story capable of accumulating suspense and meaning."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "What is left to say ? Nothing, I think. It's the best war movie ever, so that it belongs to the 10 best pictures of all time. Everybody who has never seen this one has missed a piece of culture !!!",
      "review_date": "2007-10-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Well, my favorite movie of all time is Apocalypse Now. But I mean the original theatrical cut, this Redux version is okay, but all the added scenes is really pointless and they can really do without.",
      "review_date": "2011-06-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best film ever... Wonderful depiction of human psyche transmitted by making you feel the message.",
      "review_date": "2011-10-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Never saw it until it popped up on Netflix and I am glad that I did. It's such a fantastic movie, I really have no complaints about it and that's pretty rare. Glad I watched the extended cut too because it really does help tie the film together.",
      "review_date": "2015-09-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie can show what a movie can be. It is dark, violent andamazing. I will reccomend it to everyone tht is thinking of watching it. It is absolutely amazing.",
      "review_date": "2015-05-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "To what extent should you go to tell your story or finish your work? Francis says, hands down forty years to just begin with.Apocalypse Now\n\nFrancis Ford Coppola might possibly the only director whose multiple films come under hot debatesTo what extent should you go to tell your story or finish your work? Francis says, hands down forty years to just begin with.Apocalypse NowFrancis Ford Coppola might possibly the only director whose multiple films come under hot debates like, \"Which film should be considered the best among the entire cinematic history?\" It goes without saying that Apocalypse Now is a top contender. And not for the amount of work that went just in production and post production- the editing factor is still the most changingly controversial aspect of the film, there have been three versions where actually none of them matches the huge length of the original shot. Leaving all those post success debates behind, the film in its entirety is a battle for sure; mind you, I am taking all the versions into account and also no matter what I say, some of this or all of this has already been said about this classic over the years and even generations.The film communicates the threat of the battle by challenging its audience first and foremost. And you'd think that it is not fair, since the film is the one with the voice and the stage. Francis even describes this unfair advantage in the narration by changing the perspective of the viewers about war. And the horror strikes you then, when you realize how easy the war was.How Francis has crafted the most sinister deeds easily accessible. The chilling sound effects of the helicopter is your secondary concern, the primary is its ability to mask itself as God and snatch the basic rights of a civilization. Another thing to note here is how the terror of war is not only expressed as a form of an attack but a defence mechanism too. The most natural instinct is burned to an infernal excuse to breathe. Easily, the film is not for everyone. It makes you think how completely different certificate should be allowed to such classics.",
      "review_date": "2019-09-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Francis Ford Coppola played the sorcerer's apprentice in this movie but, contrary to what happened with the legendary apprentice, the magic went very well. But this film is not about reality or the real Vietnam War. We may regard it as aFrancis Ford Coppola played the sorcerer's apprentice in this movie but, contrary to what happened with the legendary apprentice, the magic went very well. But this film is not about reality or the real Vietnam War. We may regard it as a parody or a joke, but I think its deeper than that, its a statement of the director's opinion regarding the war, in particular Vietnam. And Coppola's statement is crystal clear: war was a total disaster where thousands of Americans died in vain and any war is always the apocalypse. Coppola wanted to give the public a view of this through this movies and we can prove this not only by the shocking graphic violence that punctuates it but also by the dystopic form as the conflict is portrayed and narrated. This way of facing the war is also evident in some of the dialogues. Its as if the war transformed the human being into the worst and raw of the animals, according to Coppola's mind. At first, the film was largely softened with various cuts but, recently, a DVD with an extended version appeared on the market. I understand the reasons: at the time, Vietnam was a hot topic, Coppola wanted to raise awareness and show what he thought about it but he might not want to hurt social morality. But today things are different. The scenes with the Playboy bunnies, however, seem to be left in the film, though they look as animalistic as the soldiers, as if they were objects and not real women.The film features an extraordinary Marlon Brando (for me, it is his best film after \"The Godfather\") and a good Martin Sheen, alongside Robert Duvall (who would specialize in action films and hard characters), Laurence Fishburne , Harrison Ford (still far from stardom), Dennis Hopper and Scott Glenn. All the actors have been quite well. The film has a constantly very heavy environment and the combat scenes were filmed quite realistically. I know some older people who have been at war (not in Vietnam but in Portuguese Africa) and cannot stand it because they feel again at war and awakens traumatic memories. So I'll leave the warning: if you cannot handle violent movies, if you're sensitive, suggestible or underage, do not watch this movie. Giving good advice never hurts, does it?",
      "review_date": "2018-06-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Francis Coppola's haunting war movie \"Apocalypse Now\" presents (obviously) powerful performance from Marlon Brando and a lasting appeal. Easily one of the greatest, and possibly the darkest, war movie I have ever encountered. -REDUX VERSION-Francis Coppola's haunting war movie \"Apocalypse Now\" presents (obviously) powerful performance from Marlon Brando and a lasting appeal. Easily one of the greatest, and possibly the darkest, war movie I have ever encountered. -REDUX VERSION-The movie once again throws us off the hook with chilling cinematography and realism. However, most of the added parts are trivial and have no depth in scene compared to the original scenes of \"Apocalypse Now\".",
      "review_date": "2011-09-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best film ever made. Simple as that. The effect it has on your emotions, one minute you're smiling and laughing along, then it will suddenly skip to silence, and death, and horror... The horror. You can't miss this one.",
      "review_date": "2009-02-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The BEST movie ever.",
      "review_date": "2005-10-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Apocalypse Now is one of the most awe-inspiring films of all time. It truly is, in every sense of the word, a masterpiece.",
      "review_date": "2012-11-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "THE Vietnam movie, yet it's below Inside Out? I struggle to see the logic in that, given the scope and magnitude of this movie. War/military movies aren't for everyone nor is this, but it's jarring at the very least. I prefer the ReduxTHE Vietnam movie, yet it's below Inside Out? I struggle to see the logic in that, given the scope and magnitude of this movie. War/military movies aren't for everyone nor is this, but it's jarring at the very least. I prefer the Redux version, because it includes the French colonist bit that is important when we're talking about Vietnam, but even the documentary about the film is better than a good dozen films above this on the list. If you haven't seen it, you simply must, if only for Brando's Kurtz. I suggest you read Heart of Darkness first, but it's not a necessity.",
      "review_date": "2019-03-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My personal favorite film of all time. It changed the way I view film, art, and even life. The acting is flawless, it has the most beautiful cinematography in the history of film, the messages are powerful and haunting. It stays with you theMy personal favorite film of all time. It changed the way I view film, art, and even life. The acting is flawless, it has the most beautiful cinematography in the history of film, the messages are powerful and haunting. It stays with you the rest of your life. Which is something not many films can claim.",
      "review_date": "2011-01-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Apocalypse Now was bizarre, and I didn't understand it or enjoy it. I got the feeling that it was supposed to be the skewed memories of a mentally ill soldier's experiences in the Vietnam War, and it was somewhat interesting in that light,Apocalypse Now was bizarre, and I didn't understand it or enjoy it. I got the feeling that it was supposed to be the skewed memories of a mentally ill soldier's experiences in the Vietnam War, and it was somewhat interesting in that light, but that aspect didn't keep me interested for the entire two-and-a-half-hour running time. It was slow, weird, and boring at parts, and at others it was too fast and saturated with ridiculous action shots. The entire thing, though, was confusing to me. Every character seemed to act so strangely with no given explanation as to why, and while this would make sense if the movie was indeed shown through the eyes of a madman (or if everyone was a madman), it was still be frustrating to watch. There were also lots of fireworks posing as rockets and gunfire, and there was a good deal of cheesy synthesizer music that didn't help the movie. I couldn't find much to actually enjoy or appreciate in Apocalypse Now. I seem to be a small minority in my opinion of this film, I do realize, but I just want to make my voice heard so new viewers don't think that this movie's supposed \"universal acclaim\" is actually universal.",
      "review_date": "2012-12-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The original was a classic. Flawed, but still a classic. This new version adds 49 minutes that's virtually worthless, not to mention tedious - a French plantation sequence seems to go on forever while adding little to the picture. Rent The original was a classic. Flawed, but still a classic. This new version adds 49 minutes that's virtually worthless, not to mention tedious - a French plantation sequence seems to go on forever while adding little to the picture. Rent it and watch it ONCE, but don't count on loving this version more than the original.",
      "review_date": "2006-02-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There are really good things in this film. It is really original, and I love the way it reaches such an spiritual atmosphere without ever losing the sense of reality. Nevertheless, this long version of the film is terribly slow and boring. I There are really good things in this film. It is really original, and I love the way it reaches such an spiritual atmosphere without ever losing the sense of reality. Nevertheless, this long version of the film is terribly slow and boring. I kind of lose interest very early.",
      "review_date": "2008-04-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'd love to say this movie is great. I really would. The message that is trying to be delivered is valient, and I applaude Coppola for his efforts. And the explosions. Oh the explosions. The action is AMAZING. I loved it. But there is a I'd love to say this movie is great. I really would. The message that is trying to be delivered is valient, and I applaude Coppola for his efforts. And the explosions. Oh the explosions. The action is AMAZING. I loved it. But there is a reason this movie doesnt get a 9, or even a 10. The sheer weird factor. I know thats part of the whole Apocalypse Now vibe, but this movie is surreal to the point of annoyence. A rent. Just watch it, and be disturbed.",
      "review_date": "2006-05-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's never quite the film it wants to be. It's more than just the river in this film that is full of meanders and the final 40 minutes of the film is no help what so ever. Still, there are some mesmerising sequences, not least of It's never quite the film it wants to be. It's more than just the river in this film that is full of meanders and the final 40 minutes of the film is no help what so ever. Still, there are some mesmerising sequences, not least of those being the air attack to the soundtrack of \"Ride of the Valkyries\". The photography is also gorgeous.",
      "review_date": "2005-09-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The original balanced all the elements out nicely to make a terrifying, disturbing and utterly brilliant film. The redux version messes up this fragile balance by adding too much uninteresting new material that ruins the pace of the movie The original balanced all the elements out nicely to make a terrifying, disturbing and utterly brilliant film. The redux version messes up this fragile balance by adding too much uninteresting new material that ruins the pace of the movie completly. I was particularly disappointed with the playboy bunny reprise- sheen and co are supposed to be in hell..there are no obliging playboy bunnies in hell. And the French colonists scene was so boring- it served no purpose. I fear this version has almost ruined the original for me!",
      "review_date": "2006-05-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Sent on a mission to assassinate a rouge officer, Captain Willard (Sheen), must head deep into enemy territory, coming face to face with the horrors of war.\r A superb central performance from Martin Sheen helps Apocalypse Now through aSent on a mission to assassinate a rouge officer, Captain Willard (Sheen), must head deep into enemy territory, coming face to face with the horrors of war.\r A superb central performance from Martin Sheen helps Apocalypse Now through a sometimes uneven script and lack of pacing meaning the film largely still stands up today.",
      "review_date": "2015-10-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is really boring and made me sleep in 10 seconds. Its just a bunch of poor Japanese getting nuked by Americans. Really, no point of watching it.",
      "review_date": "2013-01-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "this movies was unbelievably slow and long i got sleepy half of the movie marlon brando was just money grabbing **** ,of course this get so much praise because it's the godfather film's director ,the title of movie should have been \"drunkthis movies was unbelievably slow and long i got sleepy half of the movie marlon brando was just money grabbing **** ,of course this get so much praise because it's the godfather film's director ,the title of movie should have been \"drunk american got crazy\"",
      "review_date": "2017-12-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie, with or without the redux, is brilliant. It starts off with a very real perception of PTSD and progresses into showing the madness of war and what it does to the mind. Martin Sheen along with the rest of the crew do an outstandingThe movie, with or without the redux, is brilliant. It starts off with a very real perception of PTSD and progresses into showing the madness of war and what it does to the mind. Martin Sheen along with the rest of the crew do an outstanding job of portraying these characters. I believe the best part is towards the end with Marlon Brando. He does a great job of showing the mind of a man who is otherwise broken but can see some truths to our society. I thought the part with the hollow men and the books that they reference were a nice touch and conveys the point well. The only problem with this movie is that it feels a bit dragged out at some parts especially with the french dinner scene. With that said it's still a fantastic movie and definitely worth watching!",
      "review_date": "2015-11-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A pretentious load of nonsense, badly acted and full of ham-acting performances. It is hard to say whether it is meant to be a satire , or is just a third-rate puerile comedy. Of course tosh like this, masquerading as \"Art\" is beloved byA pretentious load of nonsense, badly acted and full of ham-acting performances. It is hard to say whether it is meant to be a satire , or is just a third-rate puerile comedy. Of course tosh like this, masquerading as \"Art\" is beloved by critics who wouldn't know a good film if it slapped them round the face with a wet kipper. Josef Konrad must be turning in his grave.",
      "review_date": "2019-01-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Dr. Ryan Stone (Sandra Bullock) is a brilliant medical engineer on her first shuttle mission, with veteran astronaut Matt Kowalsky (George Clooney) in command of his last flight before retiring. But on a seemingly routine spacewalk, disasterDr. Ryan Stone (Sandra Bullock) is a brilliant medical engineer on her first shuttle mission, with veteran astronaut Matt Kowalsky (George Clooney) in command of his last flight before retiring. But on a seemingly routine spacewalk, disaster strikes. The shuttle is destroyed, leaving Stone and Kowalsky completely alone - tethered to nothing",
      "review_date": "2022-09-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Apocalypse Now rushes at you like a bolt of lightning. By the beginning your confused and by the end let's just say your even more distraught. This classic by Francis Ford Coppola is genuine and brilliant in many ways. The movie Apocalypse Now rushes at you like a bolt of lightning. By the beginning your confused and by the end let's just say your even more distraught. This classic by Francis Ford Coppola is genuine and brilliant in many ways. The movie obviously based on the novel Heart of Darkness by Joseph Conrad is very violent in a disturbing way but shows the reality and pain war causes. The movie has an all star cast including Marlon Brando, Martin Sheen, Robert Duvall and Dennis Hopper who all do fabulous but don't forget about Little Laurence Fishburne who does a great job himself. The movie is a portrayal of mental objectives in a way. The themes that leave you awestruck in the movie are the themes that at times are the most brutal. One is war is total .... . [***SPOILERS***] By all the deaths that took place in this movie and the controversy of Marlon Brando's character Colonel Kurtz. The other theme that left me stunned that was really brought out through the whole movie but you only understood near the end when Kurtz is talking to Willard ( Sheen ). Death can only be your friends by the way you take actions towards people but if not the correct way death is your enemy. Which is definitely a very thought provoking and extremely disturbing idea. Still the movie suceeds in every aspect.",
      "review_date": "2006-04-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I loved this movie and recommend it to many from young-adult to adult. I enjoy Apocalypse now and it is one of my all time favorite movies",
      "review_date": "2004-01-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I find this film stunning. I also recall seeing the original version in high school and thinking it was terrible and disjointed (compared to a film I loved at the time and still do, Full Metal Jacket). I said as much to my high school I find this film stunning. I also recall seeing the original version in high school and thinking it was terrible and disjointed (compared to a film I loved at the time and still do, Full Metal Jacket). I said as much to my high school English teacher, who told me I didn't know what I was talking about. He was right. This isn't a movie that most teenagers can appreciate. Now at age 32, I think it's one of the best-realized meditations on war and insanity ever made. I strongly disagree with the handful of critics who pan Brandon's performance and dismiss the final 40 minutes of the film. I found the added material in \"Redux\" to be enriching, not excessive. Martin Sheen is amazing throughout. This is one of those great movies that is also addictively watchable, because of its stunning visuals, genuine excitement, and serious consideration of how human beings can be tempted to play God.",
      "review_date": "2005-09-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A perfect ten. One of the greatest movies of all time is now longer and even more surreal. I can see why many people would find the original to be better, but I think this gives us more of what was already great.",
      "review_date": "2006-09-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Reminds us that cinema can truly be literary. A masterwork made much better!",
      "review_date": "2007-01-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was only disappointed that the movie ended. I could have watched hours more. The added scenes were all outstanding especially the additional Kilgore material. Even more than Platoon, it sums up my own Vietnam experience. Now where's I was only disappointed that the movie ended. I could have watched hours more. The added scenes were all outstanding especially the additional Kilgore material. Even more than Platoon, it sums up my own Vietnam experience. Now where's Hearts of Darkness?",
      "review_date": "2007-06-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It is the best Vietnam movie. But no war movie which presents only war facts and no morality apart of the 'who won is the best' has nothing worth to see.",
      "review_date": "2011-01-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is filled with so many visual metaphors that it will make your head spin. There is so much depth, and meticulous craft that overwhelms and intoxicates you as you watch. In some ways, this film isn't about the Vietnam War at all andThis film is filled with so many visual metaphors that it will make your head spin. There is so much depth, and meticulous craft that overwhelms and intoxicates you as you watch. In some ways, this film isn't about the Vietnam War at all and is really just about how deep in the bowls of one's one subconscious one must dig to really figure out if they're insane or not. And even then, it's left answered ambiguously strengthening your feeling of unresolve.",
      "review_date": "2017-07-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A cinematic triumph in every way, excellent writing, superb cast and wonderfully acted (Sheen, Brando and Duvall and all excellent) I've only recently watched this for the first time as I purchased the collector's edition blu ray and haven'tA cinematic triumph in every way, excellent writing, superb cast and wonderfully acted (Sheen, Brando and Duvall and all excellent) I've only recently watched this for the first time as I purchased the collector's edition blu ray and haven't yet watched Redux, but the original is the best war film I have ever seen, and it has firmly put itself in my top 10 all time favourite movies",
      "review_date": "2011-11-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Richly dark and beautifully hallucinatory, Apocalypse Now like the greatest war movies picks no side, but rightfully informs us of the horrors of war on an primordially human level.",
      "review_date": "2013-12-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of my favorite movies of all-time. It is absolutely unrelenting in maintaining a constant disorientation and incredibly disturbing tone throughout.",
      "review_date": "2012-08-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The time comes for everyone. Never at the same time or under the same circumstances. But it does arrive. Loss is unavoidable. Whether it's our sanity. Our dreams. Our hopes. The very identity of who we once were. Definitely friends andThe time comes for everyone. Never at the same time or under the same circumstances. But it does arrive. Loss is unavoidable. Whether it's our sanity. Our dreams. Our hopes. The very identity of who we once were. Definitely friends and family. Those usually go or rearrange themselves into a new unexpected landscape. Loss. One way or another. Whether we admit it or choose to live in denial. Loss is there to stay.Milius and Coppola made it clear. Their message of loss and madness stays with you in a haunting way. You just can't wash it off. \"The horrors,\" Brando insists. The things we see. We experience. We find ourselves doing. Who are these new men we've become along the way. Where is that guy I left behind when I started? Is there ever a true way back? And if so, to where?There is no doubt the content of the film carries a truly emotional and psychological impact. Yes. The context is war. The most extreme of violent acts. A perfect metaphor for the loss of innocence and the discovery of life's real intent. It turns out life doesn't always have your back. No matter how good you are. No matter how good a side you fight for. Sometimes life just doesn't have your back. All characters are great studies of humanity's journey. But some of the more obvious ones can't be avoided. Like those Playboy models. So glossy and hopeful in their early arrival. Fireworks was the theme. The object of everyone's dreams. Dreams finally buried in mud and despair inside that rain soaked tent. Innocent beauties confessing their sacrifices while handing over their honor as if it was a buffet. Tall price to pay for one's dreams. \"They made me do all kinds of horrible things,\" she says. \"I just want a simple boy to like me... Are you a simple boy?\" And then the next guy interrupts, \"I'm next madam.\" The things we sold along the way. And to make the irony colder let's not forget that those girls traveled to the front lines to 'help' the soldiers. They just didn't know how deep a sale this was going to be.Remember the French? Holding on to their family land next to the river? There for generations? But they do say they came from France, brought the supplies from Brazil, and taught the locals to work with them. To save them, as they say. Was this education in exchange for slavery? I didn't see any Vietnamese workers at that lavish dinner table. Are the once ignorant locals glad to be enslaved? Whose land is it then? Perhaps the French will die in this land after all. Perhaps someone will educate them on a new form of slavery. The slavery to your land that was never yours.The final discovery of Marlon Brando was epic. You can feel that man's energy jumping out of the screen. Each and every one of his words perfectly calculated. Telling us of the propaganda of war. The perpetuity and necessity of the lies. The machine that moves all of us. Influences us. Tricks us to participate willingly. Is this war just a backdrop for life's journey. Who do we lie to? Others? Ourselves? One day this war will end. And then what? There is always room for fresh new lies to believe.Martin Sheen was amazingly handsome in this movie. Great shape. A man's man. I always forget Martin was once a great good looking stud. He seems to have aged fast into his more mature roles of late. Regardless, the acting was on point at all times. As if made of steel. Where do you take your acting career from that? Perhaps that's why his role seemed to mature so quickly after Apocalypse.Marlon Brando can't truly be congratulated in words. The man's talents are pure art in motion. You simply surrender to the beast and let him take you whole. He's barely in the movie, yet there were times when I though he was going to reach out of the screen and grab me. Amazing.The rest of the cast was rounded to perfection. Who could forget Robert Duvall? Genius! The part reads as if written expressly for him. I would have given him back the surf board. Don't wanna mess with that guy.The film made me a bit nostalgic of older movies. We have to keep in mind this production took place before digital imagery was the soup of the day at fifty cents a pop. Those explosions are real. The groups of helicopters are real. The airplanes doing fly overs and blowing up crap, well, they are real. That's film making with balls. Coppola had the privilege of directing the real thing. No green screen in sight. It must have been an amazing experience. Although, if we put the time of production in perspective, that is, the seventies, Francis was probably doing business as it should be done. \"OK. We need a dozen helicopters over there!\" Awesome. What balls.",
      "review_date": "2012-05-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A masterfully done movie. A nearly flawless modern adaptation of Heart of Darkness. Great writing, great acting and great directing. The only notable problem is that Brando is packing on just a few too many pounds to be a perfect Kurtz.",
      "review_date": "2013-07-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The original film is engrossing, riveting, brilliantly directed, and superbly acted. Easily the best films I have ever seenandalso one of the weirdest films I have seen in general.",
      "review_date": "2013-10-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Being unique is not always a positive attribute for a film, but with Apocalypse Now, Francis Ford Coppola’s devastating portrayal of the Vietnam War, it most certainly is. At least in my opinion however, the two-and-a-half-hour-long depictionBeing unique is not always a positive attribute for a film, but with Apocalypse Now, Francis Ford Coppola’s devastating portrayal of the Vietnam War, it most certainly is. At least in my opinion however, the two-and-a-half-hour-long depiction of war’s atrocities is not that great when regarded simply as a film; it’s much more a work of art, drastically showcasing the futility of this notorious bloodshed, resulting in millions of casualties over its duration of almost 20 years. Apocalypse Now fuels hatred and incomprehension for these happenings in the audience and makes a major pacifistic statement through the metaphorical journey of one man. But apart from the stunning cinematography, the 1979 epic lacks some cinematic traits to make it a thoroughly thrilling and rewatchable experience and can thus not get a top rating from me when regarded as a film.",
      "review_date": "2014-02-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Part inspired successor to Joseph Conrad's classic novella \"Heart Of Darkness,\" part pulse-pounding portrait of an era/place all too rife with chaos, and part expressionist fever dream of all the worst, yet still somehow beautiful lookingPart inspired successor to Joseph Conrad's classic novella \"Heart Of Darkness,\" part pulse-pounding portrait of an era/place all too rife with chaos, and part expressionist fever dream of all the worst, yet still somehow beautiful looking imagery you could possibly imagine baring witness to, Francis Ford Coppola's \"Apocalypse Now\" really needs no academic, film fan, or Joe Shmoe to confirm its resonance as a cinematic classic. But, if I were to try my hand at doing so, I'd say that it really, truly is all of the aforementioned. It's nightmarish, eerie, undeniably well-performed, incredibly well-staged, and featuring some supremely keen set piece design. There's almost nothing about this movie that doesn't feel like it could have been made yesterday. Except for the music. Yes, I'm going to be that guy. And, no, I'm not talking about the brilliant, temporally evocative usage of The Doors' classic hit, \"The End.\" I'm mostly just talking about the synth-heavy score, which -- although ahead of its time as per the film's release -- simply isn't as timeless as everything else on display. Still though, the overall experience is nothing short of revelatory. If you've been busy being a fool like I've been for the past two decades and haven't seen this; get to work. You won't soon forget any of it.",
      "review_date": "2019-08-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The moment we are introduced to the main character, it's clear what the war has done to his mind. He is in a haze. Part of special operations, his tasks often involve assassinating people deemed hazardous to the war effort. He is not expectedThe moment we are introduced to the main character, it's clear what the war has done to his mind. He is in a haze. Part of special operations, his tasks often involve assassinating people deemed hazardous to the war effort. He is not expected to think for himself. Actually the dossier he is given over his next target he only opens to read once he has set off for the mission, and it's instantly clear that even if he could find sympathy for his target, he must at all costs finish the mission.\r The focus here is of course on the Vietnam War. A colonel has gone renegade and needs to be killed. A captain is sent to do the job. On his way he comes across various units, one of whom treats war as a picnic outing. Human nature, it would seem, would politicize almost anything. Video cameras roll as soldiers pretend to be caught in an ambush. Officers having their pictures taken for publicity stunts. This would have been disturbing in itself, this total disregard for human suffering, of the people of the land they have invaded and their own wounded and killed. But it is apparent that these men only do these things to feel normal, or whatever passes for normal during a bloody war.\r As the captain travels up the river, the banks are littered with unattended dead. No one has the time and the interest to bury them. The whole pointlessness of war is shown with poignant imagery. One would think two wars that caused the deaths of tens of millions would have been enough to teach mankind the lesson of a lifetime. Still about one and a half million Vietnamese had to perish, not to count the dead of several other wars. And the lesson is still not learnt.\r It becomes more disturbing as Captain Willard goes deeper and closer to the source of the conflict. Command structures have completely vanished. A mass hysteria seems to have gripped these men. They joke and laugh like maniacs and kill with complete apathy. This before Willard has even reached his destination. But nothing prepares you for what awaits him at the end of his journey. The colonel has gathered himself a cult following of native Cambodians and Vietnamese among some Americans too. That place gave me the creeps.\r The film explored how the violence and cruelty of war alters the nature of men fighting it, especially wars of an imperial nature. How the soldiers become desensitized and dehumanize everyone, suspect everyone, kill with impunity. They may not be aware of this at the moment, but killing a human being, even one you will always consider somewhere between your pets and an insect, will have an effect on you. Coppola succeeds in showing this message loud and clear.\r Martin Sheen tackles his character with a relaxed laid-back approach. He is in no rush to reach his destination. The journey is the real part of the story. But when he does reach the colonel, even after everything he has seen on the way, including his own slip of character, he still is surprised at the colonel's doings. Marlon Brando plays a lunatic with extreme precision.\r This being a war movie, the scale of the human involvement and military machinery was captured effectively. The costumes and make up department did a wondrous job. The equatorial climate has everyone perspiring constantly. You know that they hate the weather, the country, the jungles, and most disturbingly of all, the people. Their dead count for nothing and they lie and rot.\r I must admit that this movie made me very uncomfortable and unsettled at times. The way some of the characters seem to lose their minds is palpable and frightening, like losing it is itself chosen as a way to remain sane in the face of such devastation of human lives.",
      "review_date": "2013-12-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is my favorite Martin Sheen movie! I think I saw him on TV recently as I channel-surfed. I think the show was called Breakthroughs with Martin Sheen.",
      "review_date": "2013-03-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A philosophical movie about the Vietnam War/American War. A good, strong cast of characters  but there are far too many and most are only on screen for 10 minutes meaning that development amongst characters is minimal if present at all  andA philosophical movie about the Vietnam War/American War. A good, strong cast of characters  but there are far too many and most are only on screen for 10 minutes meaning that development amongst characters is minimal if present at all  and the third act is much weaker than the rest of the film  and is also quite horrific. Unpleasant at times, but offers a realistic insight into a historic moment. Generally over-hyped, but overall a decent effort.",
      "review_date": "2013-04-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the greatest war movies of all-time with many of the most iconic moments and quotes in cinema. This film took so many hardships to make and Francis Ford Coppola definitely made history.",
      "review_date": "2013-04-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A Phenomenal triumph! Haunting, powerful and an outstanding piece of cinema. A very dark and psychological war film, with a great, powerful and memorable performance from Marlon Brando, as well as the rest of the cast who are all terrific.A Phenomenal triumph! Haunting, powerful and an outstanding piece of cinema. A very dark and psychological war film, with a great, powerful and memorable performance from Marlon Brando, as well as the rest of the cast who are all terrific. The action, destruction and every little detail is tremendously captured on camera. Rarely in movies can the film makers make such tension between characters, using superb lighting and soundtrack. The air assault on the village never gets old, love it! Classic masterpiece!",
      "review_date": "2014-04-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Anyone reading this now is reading my full honest review of this legendary picture, and while the original is classic the Redux is Legend...\r Obviously any film enthusiast can agree that \"Apocalypse Now\" is essentially a War film like noAnyone reading this now is reading my full honest review of this legendary picture, and while the original is classic the Redux is Legend...\r Obviously any film enthusiast can agree that \"Apocalypse Now\" is essentially a War film like no other.\r A tense hullucinogenic, physically exhausting movie which can be only be described as part War, part something that doesn't really have a Genre, Apocalypse Now is something indescribable unless you see it and even then it's hard to put into words, as Roger Ebert said in a statement too true: \"Longer or shorter, redux or not, Apocalypse Now is one of the central events of my life as a filmgoer\".\r Again one thing i love about this movie is the success it had after going against all odds in Pre-Production, for those who don't know Brando showed up way too overweight and was reportedly very hard to work with and would require a body double, Martin Sheen had a Heart Attack at the age of 36 and returned to work a month later, What would be a 16-week shooting took over 239 days of torture, Typhoon Olga destroyed many expensive sets, extras and crew all got malaria and disease, Sam Bottoms (The actor who plays Lance) was constantly on drugs while shooting, Martin Sheen's brother did half of the Voice-Over Narrative due to his Brother's Sickness, the killing of the water buffalo attracted obvious animal protection laws, the ending was re-written countless times, Coppola had to make a film out of 2300 hours of recorded footage and of course for obvious reasons Francis Ford Coppola threatened suicide countless times.\r That's just a handful of problems and stuff that happened (if you're interested in learning more go watch his wife's Documentary about the movie, \"Hearts of Darkness: A Filmaker's Apocalypse\").\r Finally beginning the movie Hellicopters fly across a burning jungle all while \"The End  The Doors\" plays out, Captain Benjamin Willard (Martin Sheen) is Drunk, Drugged out and wasting away in a room in Saigon (Anyone anctious to know this was shot on Martin's 36th Birthday who actually WAS drunk and drugged out, he told Copolla to film what was happening and leave him to it, what happened as you saw he actually broke the mirror, bled out then reportedly attacked Francis, who's crew were so frightened they wanted to stop yet Coppola ordered to continue.)\r Being called upon by Generals (most notably a cameo by Harrison Ford under the name General. Lucas \"wink\") he is ordered to exterminate \"with extreme prejudice\" General Walter Kurtz (Marlon Brando), A Green Barret who's literally gone off the deep end.\r What follows is Willard's mission up the Vietnamese river on the boat narrating his views on the war and Kurtz in the Dossier given to him questioning his respect for Kurtz as well as his mission.\r With his crew (among them Laurence Fishburne's first role), there all of them witness the horrors of the war and a vital lesson: Never get off the boat.\r On their journey they encounter kind,yet nutcase Seargent. Kilgore (a manic performance by Robert Duvall) who utters my favourite quote \"I love the smell of napalm in the morning, A Tiger, Playboy Bunnies (including real-life playmate of the Year Cynthia Wood) A Sanpan, abandoned troops, the French (In a mansion scene which should have stayed out the redux) and finally at the \"Heart of Darkness\" (arriving at Kurtz's location)\r Arriving at the location where Kurtz is, is like jumping into a whole new movie, the natives see Kurtz as a God-like figure who constantly offer his views on life, war and everything in general one person who takes it too literally is an american photographer known only as \"the photojournalist\" (an expertly casted Dennis Hopper), Seeing Kurtz for the first time is probably one of the most chilling, tense, surreal moments in Motion Picture History.\r The ending reflects the beginning with \"The End\" blaring out again as well as luckily being able to hear Kurtz's view like we did Willard's.\r Not giving away the ending it is, in the sickest sense beautiful, unexplainable, and left me as physically exhausted as the soldiers (It should be noted that many people who have seen it have declared it so very accurate to how it was like experiencing Vietnam.\r Martin Sheen and Marlon Brando are unforgetable characters, Sheen to me represents the every day soldier, ultimately he decides to just go with the flow and do what is neccesary to survive no matter how truly horrible it is. Brando on the other hand playing such a high ranking officer has seen more and therefore lost all hope for humanity and above all himself, making me wonder at the end will Willard be destined to follow in Kurtz's footsteps?...\r Aside from that everything is just incredible, the supporting actors, the destroyed jungle, villages, vehicles \"The Attack of the Valkyries\" helicopter Scene is something i don't think i'll ever forget and though the Redux is in a sense too extended for it's own good, it will forever be a question to me what my opinion would be had i seen the original version first.\r Final Verdict: Francis Ford Coppola Thank you, Thank you Sir for one of the greatest experiences me as a film fan and movie goer could possibly have. there's really no way to end this review due to it's magnitude, but please do see this movie as soon as, it's so incredibly hard to find on DVD in the UK and that's wierd considering it just had a sudden re-release in theatres last April.",
      "review_date": "2013-06-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Classic anti war movie, that focus on the destroyed psychos of the soldiers. Sometimes the scenes are too long, but some are legendary. There are many top and famous actors also (did you recognize Laurence Fishborne?).",
      "review_date": "2022-03-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie's ryme is quite slow and the social social criticism attempt is strained. The higests points are the scenes of action (very well produced, by the way) and the cast's playing (Martin Sheen and Marlon Brando can tell). Good, but overrated.",
      "review_date": "2018-07-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A visually stunning and superbly directed piece of work about the horrors of war, Francis Ford Coppola's Vietnam War epic is what I consider one of the best depictions of the war in Vietnam next to Stanley Kubrick's equally superior \"FullA visually stunning and superbly directed piece of work about the horrors of war, Francis Ford Coppola's Vietnam War epic is what I consider one of the best depictions of the war in Vietnam next to Stanley Kubrick's equally superior \"Full Metal Jacket\". Everything about this movie is perfect: the characters, the setting, the music, and the cinematography. \"Apocalypse Now\" is definitely listed on my list of favorite movies of all time.",
      "review_date": "2013-11-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The french dinner sequence is my favorite scene from any movie ever. It's a shame it wasn't in the original cut, otherwise these blowhards who saw the older version wouldn't try to reject such a meaningful scene.",
      "review_date": "2013-12-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not to mention story, performance or direction, this movie is already my favorite even when i hadn't seen it because i fancy all war flicks, especially those concerning the haunting epic Vietnam War. This movie delivers a straightforward lookNot to mention story, performance or direction, this movie is already my favorite even when i hadn't seen it because i fancy all war flicks, especially those concerning the haunting epic Vietnam War. This movie delivers a straightforward look at the cause of shameful failure of the US Army in Vietnam so clearly that everyone can understand it. \"I love the smell of Napalm in the morning\" - the surely most memorable quote of all times outstandingly depicts despair as well as ruthlessness of virtually all American soldiers fighting the war.",
      "review_date": "2014-06-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Possibly the greatest war movie of all time, and definitely the greatest Vietnam movie. The performances are great. Even Marlon Brando, considering he was a drunken baffoon while filming this among other **** The story was fantastic. ThisPossibly the greatest war movie of all time, and definitely the greatest Vietnam movie. The performances are great. Even Marlon Brando, considering he was a drunken baffoon while filming this among other **** The story was fantastic. This should have won over Kramer vs. Kramer. **** Kramer vs. Kramer. It's slow as hell. This movie is paced extraordinarily.",
      "review_date": "2015-12-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very few of the movies I watch get nine stars, but this one top it well. This gritty war epic is packed with gritty action scenes and great dialogue. The acting is stunning and dramatic and well done. The best Martin Sheen performance hands down.",
      "review_date": "2014-08-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nnever saw the redux version but Francis Ford Coppola's Vietnam epic still haunts us with a visionary insight within the agonies and horrors of war through the eyes of a determined captain Willard (Martin Sheen) anxious to get into war, only to witness the hellish atmosphere when he is sent into lower Cambodia to terminate Colonel Kurtz (Marlon Brando) who has gone rogue.\r Lots of violent war action sequences, including the infamous Ride of the Valkyries sequence and the brutal psychotic dark side of the jungle war zone and the motivations to Kurtz's insanity points out at the darkness and senseless war in one of the darkest anti war film ever made, its a film that cants be remembered without seeing the horror it presents to the viewer, that is so violent and disturbing its like a trip to hell and back",
      "review_date": "2015-04-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Since its 1979 release, Apocalypse Now has been widely regarded as one of the most powerful and influential films about the Vietnam War. Were it not for the final thirty minutes, I might agree. There's little doubt that the bulk of the movie,Since its 1979 release, Apocalypse Now has been widely regarded as one of the most powerful and influential films about the Vietnam War. Were it not for the final thirty minutes, I might agree. There's little doubt that the bulk of the movie, which features actor Martin Sheen's trek from the normality of Saigon to the backwaters of Cambodia, is compelling material. But Apocalypse Now falls apart with the arrival of Marlon Brando. Putting aside the simple fact that the ending is anticlimactic and disappointing, the picture's final half-hour is borderline-incoherent, badly written, and highlights a pair of poorly realized performances (Brando and Dennis Hopper).\r In 2001, director Francis Ford Coppola returned to the footage of Apocalypse Now and assembled a new cut, which he christened with the lugubrious title of Apocalypse Now Redux. Approximately 50 minutes of additional footage was inserted, 90% of which added little to or actually detracted from the plot. There are a couple of new scenes that are important, but they are overwhelmed by two lengthy exhibitions of bad acting, bare breasts, and verbal diarrhea. The original Apocalypse Now clocked in at about 2 1/2 hours - long, but not unreasonably so (although I would argue that the length of Brando's appearance should have been cut to resemble his extended cameo in Superman, which arrived in theaters a year earlier). Apocalypse Now Redux drags on for more than 3 1/3 hours; the bloated size of the director's cut is matched only by the ego of the man who assembled it and the girth of the best-known actor.\r The essential story, which is loosely based on Joseph Conrad's Heart of Darkness, is straightforward. Coppola's goal with Apocalypse Now is twofold: to display something of the absurdity or war and to provide evidence of what it turns human beings into. In the process, the director provides a vivid understanding of why the United States lost the war. Unlike other Vietnam films, such as Platoon and Full Metal Jacket, Apocalypse Now is neither highly politicized nor especially controversial. With a notable exception (the sampan massacre), it does not dwell on American atrocities perpetrated upon the indigenous population. In fact, the Vietnamese are at best supporting characters. They show up occasionally, but the movie isn't really about them. In fact, few changes would be necessary to re-locate the story to almost any other setting with a long river surrounded by a hostile jungle. That, after all, was the premise of Conrad's book.\r The troubles encountered by Coppola during filming have been exhaustively documented. The shoot, originally scheduled to last about 4 1/2 months, stretched to 16 months. A typhoon temporarily halted filming and devastated the area. Martin Sheen suffered nearly-fatal health problems. Marlon Brando arrived substantially overweight and insisted that he only be filmed in shadow, where his waistline could be hidden from the camera. Drug use and adultery were rampant. Coppola nearly lost his mind. One could argue that the behind-the-scenes story is more compelling that what ended up in the movie. George Hickenlooper's 1991 film, Hearts of Darkness: A Filmmaker's Apocalypse, documents the shoot, using cast and crew interviews and footage shot by Coppola's wife, Eleanor, to offer a starting look inside the madness of the production. Considering the chaos of the shoot, it's no surprise that the ending of Apocalypse Now is so incoherent and fuzzily focused.\r The trip up the Nung River is powerful and haunting, and captures the essential insanity of war in a way that other films, including remarkable efforts like The Bridge on the River Kwai and Platoon, have been unable to do. This war isn't about winning or losing, or even surviving. It's about remaining sane.  It's about entering a world that is almost prehistoric and not losing oneself. When it comes to presenting the movie's theme, the Kurtz scenes are redundant. They merely reiterate what Coppola delineates during the boat trip.\r While I recommend the original theatrical cut of Apocalypse Now as it is in my top 10 films of all time, I cannot be as positive about Apocalypse Now Redux. The longer, re-edited version is a dud compared to its older sibling, killing momentum with badly-acted, wordy, dull sequences. The primary value of having Redux available is to illustrate how more can be less. Despite having 20 years of down-time for tinkering, Coppola has not been able to improve upon the product of instinct and necessity that reached screens in 1979. Apocalypse Now is one of those flawed films that contains enough masterful sequences to compel a viewer. Redux is merely a curiosity, and of interest only to those die-hards who believe this movie to be one of the greatest pictures ever to be projected in a theater.",
      "review_date": "2015-04-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I am not completely sure whether to say this is Francis Ford Coppola's best work or not but it is up there with his best. It is a truly harrowing masterwork with nothing to criticise.Apocalypse Now is filled with memorable, mystical images,I am not completely sure whether to say this is Francis Ford Coppola's best work or not but it is up there with his best. It is a truly harrowing masterwork with nothing to criticise.Apocalypse Now is filled with memorable, mystical images, helped by the wonderful cinematography, splendid effects and authentic sceneries. The music is superb, the script is wonderful, I especially loved Robert Duvall's \"I love the smell of napalm first thing in the morning\", the story is always compelling and the film is brilliantly directed by Coppola. Apocalypse Now is long, but it is never boring.The acting is excellent, Marlon Brando especially is unforgettable, and Martin Sheen, Robert Duvall and Dennis Hopper adeptly support him. Overall, this is harrowing I warn you but it is a brilliant film regardless. 10/10 Bethany Cox",
      "review_date": "2022-03-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "‘Apocalypse Now’ is a haunting film that stays with you long after you have seen the movie. It is a movie that keeps playing in your head reminding you about its eerie characters, haunting and almost hypnotic tone. The movie, is however,‘Apocalypse Now’ is a haunting film that stays with you long after you have seen the movie. It is a movie that keeps playing in your head reminding you about its eerie characters, haunting and almost hypnotic tone. The movie, is however, definitely not perfect. I actually ended up watching the Redux version of the movie which is 3hr 16min long and definitely found it to be too long. I felt that there were some aspects that could have been skipped and played less importance to the overall effect of the movie but later also felt that maybe these aspects were essential in order to completely understand the Vietnam War. However, the movie definitely dragged considerably in its middle portions and became a bit repetitive. Apart from its lengthy pace, however, ‘Apocalypse Now’ is nearly perfect as a film. The moments of action are amazing, the narration pitch perfect, the cinematography top - notch and the characters striking. The first and last hour of the movie actually is exceptionally engaging due credit to its characters and dialogue also. ‘Coppola’ impressively integrates different characters and adds humor to the movie in the first hour in particular. ‘Duvail’s’ performance as ‘Colonel Bill Kilgore’ in  particular is terrific in the first hour and adds the right measure of cockiness and humor in the story. The segment of story involving his platoons attack on a Vietnamese village is terrifically staged, shot and executed. A sequence in particular involving the helicopter attacks with music playing in the background is stylishly shot and extremely memorable. The supporting characters in the movie also make a considerable mark especially ‘Forrest’s’ ‘Chef’ and ‘Bottoms’ ‘Lance’. The supporting characters add humor in good measure to the heavy story and keep the movie amusing towards the movie’s weak second hour. The performances and scenes are well complemented by some exceptional cinematography and great direction. The last hour of the movie is what remained with me the most after the movie got over. The last segment of the story involving ‘Sheen’ and ‘Brando’ is emotionally haunting and psychotically moving. The set up for ‘Brando’s’ ‘Kurtz’ is so effective that once his character shows up in the movie, I was instantly intrigued by him. His haunting character is complemented by a terrific performance by ‘Brando’ who literally scared me with every word he uttered. Lastly, ‘Sheen’ as the protagonist ‘Willard’ is also pretty terrific and lends immense credibility to a character which is difficult to sympathize with. ‘Sheen’ makes the character believable and brings out the angst and frustration of war very well.\rOverall, ‘Apocalypse Now’ is a very true and harrowing display of the Americans experience in the Vietnamese war. The movie has some terrific performances, terrific direction, unpredictability  and an overall haunting tone to it which stayed with me after I had watched the movie. The reason the movie falls from being a true great for me is because of its weak middle portion which dragged considerably and diluted the movies overall effect.",
      "review_date": "2015-08-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My first time seeing the movie was the remake. The famous valkyrie helicopter scene felt pointless, dragged out and without suspense. Just endless death, didn't make me cheer for anyone. It gets better in the middle as you get to know theMy first time seeing the movie was the remake. The famous valkyrie helicopter scene felt pointless, dragged out and without suspense. Just endless death, didn't make me cheer for anyone. It gets better in the middle as you get to know the supporting cast better. The ending is ridicilous, unbelievable. Everyone knows war is **** but this movie is taking it too far by creating ridiculous scenarios. It's got something going for it though. The acting is good and there is a feeling of mystery as they venture further and further into the jungle. Sadly apocalypse now feels like a dokudrama on drugs and fails to provoke anything but boredom, intrigue and despise. Maybe that was what it wanted to do, but I surely didn't enjoy it.",
      "review_date": "2015-08-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This remake proves that remakes just don't screw up just as far as the original! Ok, there are a few exceptions, but any who, Apocalypse Now Redux is enjoyable for 153 minutes of your faithful time!",
      "review_date": "2016-02-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "“Apocalypse Now” was worth the wait. Alternately a brilliant and bizarre film, Francis Coppola’s four year ‘work in progress’ offers the definitive validation to the old saw, “war is hell.” Coppola’s vision of Hell-on-Earth hews closely to“Apocalypse Now” was worth the wait. Alternately a brilliant and bizarre film, Francis Coppola’s four year ‘work in progress’ offers the definitive validation to the old saw, “war is hell.” Coppola’s vision of Hell-on-Earth hews closely to Joseph Conrad’s novella “Heart of Darkness,” and therein lies the film’s principal commercial defect. An exhilarating action-adventure exercise for two-thirds of its 139 minutes, “Apocalypse” abruptly shifts to surrealistic symbolism for its denouement. Result will be many spectators left in the lurch, a factor that won’t help in recouping the $50,000,000 or more necessary for break-even by distrib United Artists, Coppola and the worldwide territorial distribs involved.\r “Apocalypse Now” will also have trouble avoiding political pigeonholing, since it’s the first film to directly excoriate US involvement in the Indochina war. To be sure, inhumane attitudes surfaced on both sides as inevitable consequences of a misunderstood conflict, but Coppola wields a wide tabrush in painting Americans as either “conspiratorial” or “homicidal,” with no one in between.\r Thus it seems ironic that the most widely heralded production of the last 10 years may find its niche co-opted by a pic dealing with a common subject, the effect of the Vietnam conflict on its participants, “The Deer Hunter” and “Apocalypse Now” are widely differing treatments in tone and viewpoint, but in the eyes of the film-going public, if you’ve seen one Vietnam war pic, you might have seen them all.\r Which possible reaction would be a shame, because Coppola here reaffirms his stature as a top filmmaker. “Apocalypse Now” takes realistic cinema to a new extreme – Coppola virtually creates World War III on screen.\r There are no models or miniatures, no tank work, nor process screens for the airborne sequences. The resulting footage outclasses any war pic made to date. Coppola’s wisest decision was to narrow the focus on the members of the patrol boat crew entrusted with taking Intelligence assassin Martin Sheen on a hazardous mission upriver into Cambodia. There Sheen hopes to track down and ‘terminate with extreme prejudice’ Marlon Brando, a megalomaniac officer whose methods and motives have become, in Pentagonese, ‘unsound,’ as he leads an army of Montagnard tribesmen on random genocide missions.\r Interaction of Sheen and the two black (Albert Hall, Larry Fishburne) and two white (Fred Forrest and Sam Bottoms) seamen gives “Apocalypse” a narrative flow when, in fact, there’s very little narrative (Sheen has a sporadic voice-over commentary done in groggy sotto-voce that does little to explicate the action).\r Robert Duvall appears mid-way as an expansive screen character, an air cavalry helicopter commander who’s a surfing nut, and has his boys riding the waves in the midst of flak attacks. These and some other-worldly, nighttime river excursions seem the principal contributions of original scenarist John Milius (who now shares screenwriting credit with Coppola), and they contain a wacky, manic energy that serves “Apocalypse” well.\r It’s when the ghost of novelist Joseph Conrad enters the picture, and when Milius and Coppola in effect take a back seat to a literary homage, that “Apocalypse Now” runs aground. Despite Vittorio Storaro’s haunting imagery, Barry Malkin’s explosive editing, and Dean Tavoularis’ eerie production design, final third of the pic fails to jell.\r Experience is almost a psychedelic one–unfortunately, it’s someone else’s psyche, and without a copy of crib notes for the Conrad novel, today’s mass audience may be hard put to understand just what is going on, or intended.\r Marlon Brando’s intimidating but inscrutable performance as the bald-headed Colonel Kurtz (named after Conrad’s character in “Heart of Darkness”) doesn’t clarify anything.\r Rest of the cast is extraordinary, with Sheen extremely effective in a laconic style, and Forrest Hall, Fishburne and Bottoms superb in their respective delineations.\r “Apocalypse Now” is emblazoned with firsts: a 70mm presentation without credits, a director putting himself personally on the hook for the film’s $18 million cost overrun, and then obtaining rights to the pic in perpetuity, and a revolutionary sound system that adds immeasurably to the film’s impact.\r Even if Coppola isn’t haunted by the spectre of financial fiascos like “Cleopatra,” there’s no assured future for “Apocalypse.” It’s a complex, demanding, highly intelligent piece of work, coming into a marketplace that does not always embrace those qualities.",
      "review_date": "2016-03-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In one of the scenes that have been added to Francis Ford Coppola's \"Apocalypse Now,\" Captain Willard (Martin Sheen) smokes opium with a French widow (Aurore Clément) who lives in the crumbling imperial grandeur of her family's remote jungleIn one of the scenes that have been added to Francis Ford Coppola's \"Apocalypse Now,\" Captain Willard (Martin Sheen) smokes opium with a French widow (Aurore Clément) who lives in the crumbling imperial grandeur of her family's remote jungle rubber plantation. As Willard falls into a glassy-eyed stupor, and she slowly disrobes, the woman talks about her husband, a lost soldier in France's doomed colonial adventure, and about the essential dualism of human nature. \"There are two of you,\" she says, \"one that loves and one that kills.\"\r Variations on this theme surface from time to time over the three hours that make up \"Apocalypse Now Redux,\" the expanded version of Mr. Coppola's 1979 film that opens today. The United States Army general who sends Willard upriver into Cambodia to find the mysterious Colonel Kurtz muses on the \"conflict in every human heart between rational and irrational, good and evil.\"\r When Willard arrives at the tribal encampment that Kurtz rules like a mad deity incarnate, he encounters a manic American photographer, played by Dennis Hopper, who instructs him in the basics of \"dialectic logic\": \"You either love someone or you hate them.\"\r The movie itself — shot over 16 months in the Philippines in circumstances by now as myth-shrouded as the story it tells — is similarly bifurcated, split between its immediate historical subject, the Vietnam War, and a grand, murky ambition to plumb the metaphysical heart of darkness. Whether it succeeds on either level has been a subject of debate at least since the film was unveiled at the Cannes Film Festival 22 years ago. Is \"Apocalypse Now\" a great Vietnam movie? Is it a worthy adaptation of \"Heart of Darkness,\" the Joseph Conrad novella that is its putative source? Does its attempt to fuse 19th-century literature and 20th- century history hold together or fly apart at the seams?\r Curiously, the passage of time has rendered these questions moot. Or to put it another way, \"Apocalypse Now,\" in spite of its limited perspective on Vietnam, its churning, term- paperish exploration of Conrad and the near incoherence of its ending, is a great movie. It grows richer and stranger with each viewing, and the restoration of scenes left in the cutting room two decades ago has only added to its sublimity.\r \"Apocalypse Now Redux\" arrives in this slack season to remind us of a lost era of visionary cinema, a time of creative self-confidence that frequently flirted with hubris, but also a time of risk taking and high seriousness. The artistic vision on display in \"Apocalypse Now\" — the divine madness that inspired Mr. Coppola to risk his health, his sanity, his fortune and the well-being of his cast, crew and family — is ultimately less impressive, and less important to the film's durable power, than the art itself.\r And while the film may have been the apotheosis (and also the catastrophe) of American auteurism — the notion that a movie is above all the personal statement of its director — the achievement is not Mr. Coppola's alone. The script, which he wrote with John Milius, is a succession of vivid Dantesque vignettes that organize the absurdity, the cruelty and the hallucinatory randomness of jungle combat into a compact, episodic nightmare epic. With the exception of Michael Herr's uneven, self-consciously literary voice-over narration, the story is embedded, and embodied, in sounds and images: in Dean Tavoularis's production design, Vittorio Storaro's cinematography, Walter Murch's sound, and the voices and faces of its cast.\r The current vogue for digitally enhanced, computer-generated special effects in live-action movies, and for jumpy, gestural editing, has lulled us into a pixelated, hyperactive slumber. \"Apocalypse Now Redux\" jolts us awake. The sequence in which Willard and his crew encounter a surfing-obsessed, Wagner-drunk air cavalry commander named Kilgore (Robert Duvall) could stand by itself as one of the best war movies ever, a rigorously choreographed spectacle of chaos and mayhem in which every line of dialogue is audible amid the gunfire and chopper blades.\r To see the real helicopters swooping through actual space and exploding on the ground, to watch the villagers scrambling to avoid death from above is, in the summer of \"Pearl Harbor,\" to feel a rush of nostalgia mixed in with terror and exhilaration. The old, cumbersome analog machinery, the handicraft of cutting and splicing what the camera has captured, impart a clarity and precision that the new technology has yet to match.",
      "review_date": "2016-04-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Vietnam War, now seen from a psychological perspective. In the middle of the overwhelming battlefield, a captain must find and assassinate a colonel who has gone mad and has proclaimed himself king of a tribe. Coppola knew how to personalThe Vietnam War, now seen from a psychological perspective. In the middle of the overwhelming battlefield, a captain must find and assassinate a colonel who has gone mad and has proclaimed himself king of a tribe. Coppola knew how to personal touch him and make this one of the best of the genre.",
      "review_date": "2020-12-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not a movie but a journey that takes you to the true Heart of Darkness every time you watch it. In my opinion one of the best pictures of all times.",
      "review_date": "2019-08-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Coppola represented the harrowing experience of Vietnam War through the story or rather the movie's theme itself. The classy yet intense editing, the beautiful yet upsetting cinematography, and the fluid yet disturbing camera movements andCoppola represented the harrowing experience of Vietnam War through the story or rather the movie's theme itself. The classy yet intense editing, the beautiful yet upsetting cinematography, and the fluid yet disturbing camera movements and shots, all have a major role in conveying the message of the movie. The violence could have been more powerful and gritty, but that's not what Coppola wanted, he wanted to show the horror of war by depicting it as an annoying and irritating experience. Unfortunately, the movie could have been way better. There are many sub-plots that could have been used in a way that adds to the main plot by emphasizes on the moral dilemma of the movie. That's exactly what made the ending falls flat, at least for me. Instead of being one of the greatest endings ever, I found it kinda cheesy!(8/10)",
      "review_date": "2018-05-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An amazing example of tension-building, sound mixing, improvisation, and editing.",
      "review_date": "2019-07-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Cursed with bad luck which just adds to the haunting and hallucinating atmosphere it leaves you with a tangeable feeling of what this war was actually like for the human being.",
      "review_date": "2019-08-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is such a slow paced film I don't think I ever seen it all the way through in one viewing without falling sleep. In retrospect I wish I hadn't bothered,this is the film equivalent of the emporer's new clothes. You'll try and convinceThis is such a slow paced film I don't think I ever seen it all the way through in one viewing without falling sleep. In retrospect I wish I hadn't bothered,this is the film equivalent of the emporer's new clothes. You'll try and convince yourself that you've just watched a masterpiece with a profound message about the darkness that resides in all of us because that's what the film critics tell you, but in reality this is a shallow film and it's exploration of the theme is laughbly superficial. The film chooses to concentrate on visual imagery rather than a detailed exploration of the characters.",
      "review_date": "2019-10-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Francis Ford Coppola's 1979 Classic - Apocalypse Now, is a dark, ambiguous reflection on the insanity inflicted by the Vietnam War. Having been fortunate enough to have watched the final cut in cinemas, I have to say Apocalypse Now is trulyFrancis Ford Coppola's 1979 Classic - Apocalypse Now, is a dark, ambiguous reflection on the insanity inflicted by the Vietnam War. Having been fortunate enough to have watched the final cut in cinemas, I have to say Apocalypse Now is truly an experience like none other. Its hard to pin down what makes the movie so extraordinary; whether its the impressively put together sets (particularly during the flight of the Valkyries), the breathtaking shots of silhouetted figures in the dark of the jungle, or even the phenomenal use of 'The End' by The Doors at both the beginning and the end of the film. Roughly six months after initial viewing I decided to watch 'Hearts of Darkness', a documentary on the infamous shooting of the movie shot by Coppola's wife Eleanor. It gave me some insight into the chaos that occurred during filming, and the madness that ensued. Martin Sheen, who played Captain Willard, badly wounded his hand upon accidentally breaking the mirror upon shooting the first scene. Drunk and drenched his blood, he then continued to act out the scene in a much more convincing manner that brought out the insanity and misery the of actor and character alike. This is one of the many examples of how each of the members of the cast gradually completely lost their minds, and as a result, were absolutely phenomenal. Even Marlon Brando and Dennis Hopper, who are only introduced in the final act of the film, really give it their all. The dialogue in the film (and also the monologues from Sheen), is also fantastic and really gives you a solid understanding of each of the characters. For example; Lt. Colonel Kilgore (played by Robert Duvall), is an insane, reckless warmongering leader who amongst the screams of dying Vietnamese innocents, can only think about whether or not the waves are suitable for surfing. His heartless insensitive attitude is summed up really well by the line \"I love the smell of Napalm in the morning\", although to my understanding Duvall came up with that line himself. Unfortunately there are a few issues I find with film. The most recent cuts of the movie have added a notable amount of new footage, most of which is great, but I find issue with the whole French family sequence. The idea was to show that despite the fact the war is going on, some people still refuse to accept it, and due to their stubborn nature, dismiss the idea of leaving the country. I understand the sentiment, and that Coppola put a lot of effort into creating these scenes (which is probably why he added it back), but the fact is that they aren't that interesting and completely break up the pacing. However I won't let that detract from the overall score, as this issue isn't present in the theatrical release.Apocalypse Now, is in my opinion nothing short of a masterpiece. Thanks to its haunting narrative, exceptional acting, impressive sets, extraordinary pacing, fantastic use of music and beautiful cinematography, it has become one of if not my favorite move of all time.",
      "review_date": "2020-05-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wow. Apocalypse Now is the only movie, that evoked such a wide specter of emotions. I would say it is rather long, not slow, as it fells like a completely holistic picture without unnecessary elements. Consider watching the 3:15 hour longWow. Apocalypse Now is the only movie, that evoked such a wide specter of emotions. I would say it is rather long, not slow, as it fells like a completely holistic picture without unnecessary elements. Consider watching the 3:15 hour long \"redux\" version not to miss a sing.",
      "review_date": "2020-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best movie about war, most atmospheric and 3rd best movie of all time overall (in my opinion)",
      "review_date": "2019-11-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very unique movie about war, about how war affects the minds of it's participants",
      "review_date": "2020-03-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "No other film I have seen shows the madness and stupidity of war like Apocalypse Now. This one crawls in your mind. Steady in my Top 10 Best Films Ever.",
      "review_date": "2020-06-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Apocalypse Now is a masterpiece. This movie isn't an adaptation of the novella Heart of Darkness by Joseph Conrad. but the film takes inspiration from the novella.",
      "review_date": "2020-09-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Brilliantly acted and smartly directed. This film is a must watch for film lovers.",
      "review_date": "2020-08-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the great war movies.This mysterious, dark take on the Vietnam war will stay with you long after you see it.",
      "review_date": "2021-01-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The photography is simply unbeatable and I love that scene on the helicopters with the Ride of the Valkyries. Also Bill Kilgore is freaking hilarious. On the other hand I didn't like at all the ending, that Marlon Brando part messed it up for me.",
      "review_date": "2021-01-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Possibly the greatest looking movie ever? First hour felt like a masterpiece, Duvall was really cooking there for 30 minutes or so.Watched the directors cut and the extra scenes definitely made it drag very badly in the middle. So I'mPossibly the greatest looking movie ever? First hour felt like a masterpiece, Duvall was really cooking there for 30 minutes or so.Watched the directors cut and the extra scenes definitely made it drag very badly in the middle. So I'm rating it without those in mind.",
      "review_date": "2023-02-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not only the best anti war movie, but also one of the greatest movies off all time.",
      "review_date": "2022-03-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Everybody who has never seen this one has missed a piece of culture !!!Well, my favorite movie of all time is Apocalypse Now.$1 to buy a Netflix account, Google search: vtvshare",
      "review_date": "2022-08-10",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 97,
  "genres": [
    "Action",
    "Drama",
    "War"
  ]
}