{
    "rating": 9.4,
    "release_date": "2001-02-26",
    "num_reviews": 70,
    "genres": [
        "Romance",
        "Drama"
    ],
    "summary": "In 1962, journalist Chow Mo-wan (Tony Leung Chiu Wai) and his wife move into a Hong Kong apartment, but Chow's spouse is often away on business. Before long, the lonely Chow makes the acquaintance of the alluring Su Li-zhen (Maggie Cheung Man-yuk), whose own significant other also seems preoccupied with work. As the two friends realize their respective partners are cheating on them, they begin to fall for one another; however, neither wants to stoop to the level of the unfaithful spouses.",
    "reviews": [
        {
            "content": "A visual master piece with simple and effective story telling. The shot composition is incredible, the performances stiff but effective and more suggestive than expressive. \nGreat film a must watch for any film student.",
            "review_date": "2023-03-22",
            "source": "rt"
        },
        {
            "content": "it's a very unique and slow building you cannot help and be fascinated by it",
            "review_date": "2023-02-14",
            "source": "rt"
        },
        {
            "content": "its good, i just cant concentrate",
            "review_date": "2023-02-04",
            "source": "rt"
        },
        {
            "content": "Obra maestra. Cien estrellas",
            "review_date": "2023-02-04",
            "source": "rt"
        },
        {
            "content": "\"| Ratings Categories |\n{Characters (8.5/10) ; Cinematography (10/10) ; Plot (9/10) ; Acting (9/10) ; Pacing (8.5/10) = 90%}\"",
            "review_date": "2023-02-03",
            "source": "rt"
        },
        {
            "content": "An absolute masterpiece. A sumptuous feast for the eyes, and a turbulent, searing voyage for the heart. The premise is interesting, the setting is palpable, the characters are masterfully presented (or not presented as the case may be), the pace is precisely the right speed. The score is excellent and the main original song is catchy and well-matched to the drama, as well as a couple of other songs noticeably matched perfectly to the scene. You will find yourself immediately in the hands of a master, and you'll wonder how all cinema is not like this. Wong Kar-Wai uses a color pallete and close, intimate shots to do much of the work of setting the tone and feel of the film, which is a profound longing amid a kind of despair at being betrayed. \n\n*Spoilers*: In a masterful coda before a final ruminatory scene at Angkor Wat Temple, we see the subsequent visits to the apartment building in Hong Kong years later.  Mrs. Chan is shown \nas a single mother with a son, suggesting at least to this viewer that the love affair and offstage final night spent together between her and Mr. Chow was a sexual encounter that resulted in a pregnancy. Later when Mr. Chow shows up to check on the apartment and discovers that \"a woman\" who he suspects is Mrs. Chan is living alone with their child (we have seen her seeming happier--though still longing--wearing her hair down and wearing a less formal dress than we have seen before in the film), which he never knew existed. He smiles and pauses at her door on the way out as if thinking about knocking, but decides to leave them alone. Their friendship and strange secret--but pure--romance created life. Likewise in the final scenes at the Angkor Wat Temple in Cambodia, we see that Mr. Chow's secrets are being whispered into a gouge of rock and covers it with mud to keep it safe forever, per the old folktale of the region. A few frames later we see that a snarl of grass is growing where he covered his secret with mud, alive against all odds. This is partly a reflection of how a secret, like the secret friendship with Mrs. Chan and their secret rehearsals and conversations, can be healing and life-giving.",
            "review_date": "2023-01-17",
            "source": "rt"
        },
        {
            "content": "Very well-directed, full of symbols, gorgeous camera angles",
            "review_date": "2023-01-01",
            "source": "rt"
        },
        {
            "content": "\"In the Mood for Love\" is a movie that is technically very beautiful. Every frame of this movie is astoundingly impressive to look at and the use of color and angles is worth noting. I think the romance story it tries to tell is subtle but ultimately memorable. I was more impressed by the camera work than the story itself since I didn't find the story particularly exciting. The performances and other technical aspects make it clear that this is a movie film lovers will appreciate, but as far as romance movies go, this one might be very real, but I wouldn't go as far as calling it one of my favorites. Overall, it is a well-made movie with a decent story and gorgeous camerawork.",
            "review_date": "2022-12-26",
            "source": "rt"
        },
        {
            "content": "Wong Kar Wai's romantic artpiece \"In The Mood For Love\", proves that romantic dramedies can be more than the love it presents, but a gem of self discovery",
            "review_date": "2022-12-19",
            "source": "rt"
        },
        {
            "content": "This movie illustrates sadness about getting cheated on on a new level. It focusses on the characters and shows how people can grow together just because they are in the same boat. \nAll the shots are perfect, you could use all the frames as a cool wallpaper and thats what i expect from a Wong Kar-Wai movie.",
            "review_date": "2022-12-07",
            "source": "rt"
        },
        {
            "content": "Absolutely cinematic. Legendary film making exhibited here.",
            "review_date": "2022-11-29",
            "source": "rt"
        },
        {
            "content": "I always heard a lot about this movie but never got around to watching it. It is a slow and complex tale of human relationships which leaves you with so many amazing flavors after one is done tasting it that I cant stop thinking about it. Another great watch.",
            "review_date": "2022-11-14",
            "source": "rt"
        },
        {
            "content": "Emotionally powerful film about a tale of unfulfilled desires. The style, aesthetics, music, impactful.",
            "review_date": "2022-08-26",
            "source": "rt"
        },
        {
            "content": "Well made as far as cinematography goes, but does not live up to the hype of a 'classic' due to pathetic story, acting etc.",
            "review_date": "2022-08-25",
            "source": "rt"
        },
        {
            "content": "Incredibly beautiful and strange in a good way melodrama! Be sure to familiarize yourself!",
            "review_date": "2022-08-01",
            "source": "rt"
        },
        {
            "content": "Read about how critically acclaimed this film was, and I've recently been wanting to try a Chinese film and I feel this was a good place to start.\n\nThe movie is in some sense a love story, but takes time to build up into what the movie intends to achieve. I liked the performances of the two lead actors, and and dialogues are crisp and don't really bore you. The soundtrack feels redundant at times but is still decent enough.\n\nThe premise is interesting but for some viewers, it could leave you wanting more at the end. It's a movie where less is more, and while the ending is a nice diversion from a standard ending, something else could've been done at the end. All in all a good experience!",
            "review_date": "2022-06-09",
            "source": "rt"
        },
        {
            "content": "It's the mood for love not the \"love\", so watch out. 4/10",
            "review_date": "2022-06-05",
            "source": "rt"
        },
        {
            "content": "Wong reinvents Romanticism.\nThe delicacy with which he depicts the subdued emotions of the two protagonists gives life to a poetic romance that sublimates the idea of love.\n\"In the Mood for Love\", despite the long gestation period of almost two years, is less dynamic and confused than Wong's previous works, but has a more solid narrative and a more disciplined mise-en-scène.\nWith epiphanic enthusiasm, the camera slides slowly through the corridors, peers voyeuristically by the mirrors, moves sensual between the curtains; contemplating the inexorable passage of time.\nIt is precisely in the circularity of time that Wong's seventh effort finds its balance. Time that reveals itself repeatedly throughout the film: literally with the continuous insert shots of clocks and cigarettes, abstractly with the weightless slow motions and the evanescent motion blur of Doyle's cinematography.\nChow and Su's tormented melò collapses when they realize what they feel about each other. So, they flee, perhaps because basically it is always the ideal of love that the two protagonists are in love with. The metaphysical vision of love, uncontaminated and intimist, which in the incompleteness of their desires remains forever suspended in time, ethereal and immortal.\n\"In the Mood for Love\" is made up of hesitant glances and suppressed caresses, in a turbid whirl of regret and passion.\nIt is a love story that never blossoms, but basks in its indecision, forced to remain a secret buried for millenniums in the prison of one's heart.\nWithout a doubt, Wong's highest aesthetic and narrative achievement and one of the best films of the 21st century.",
            "review_date": "2022-05-22",
            "source": "rt"
        },
        {
            "content": "A sad, intimate, and beautifully shot love story.",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "wong kar wai is that guy",
            "review_date": "2022-04-17",
            "source": "rt"
        },
        {
            "content": "Nevertheless, I demand different endings!!!!! argghh **criess**",
            "review_date": "2022-04-09",
            "source": "rt"
        },
        {
            "content": "Snore. If you have falling asleep, this is for you! Dark, dark, moody, and very very slow. Choppy editing. We couldn’t finish it. We love movies, but not this one. ",
            "review_date": "2022-04-05",
            "source": "rt"
        },
        {
            "content": "Inject doomed lover stories right into my veins!\n\nBut seriously, some of most breathtakingly mesmerizing fusions of cinematography and music. An absolutely perfect sense of longing and loneliness is captured by the slow-motion traversal of a noodle shop staircase with those strings from the main score playing over it. And that coda for Tony Leung's character? Shockingly beautiful and devastating.",
            "review_date": "2022-03-16",
            "source": "rt"
        },
        {
            "content": "A breathtakingly beautiful film. Watched on Feb 8, 2022.",
            "review_date": "2022-02-08",
            "source": "rt"
        },
        {
            "content": "This is a delicate film, as if \"love\" itself was a brittle piece of Venetian glass. Su Li-zhen (Maggie Cheung) and Chow Mo-wan (Tony Leung) have a couple of things in common: they live adjacent to each other in the same apartment (kind of like a rooming house?) building and their spouses are cheating on them with each other. The plot follows Su and Chow as they grow from a platonic friendship — which feels more out of necessity, to ward off loneliness — to something more. The surroundings are tight — cramped hallways, small bedrooms, alleyways filled with customers and workers, it is Hong Kong, after all. Our protags are subdued, polite, and you want them to get nice and good and mad. Other than a couple of moments of unrestricted painful emotion, Su and Chow take their spouses' infidelity on the chin. The timing isn't right for them because it can't be right for them, it wouldn't make as touching a movie. Their style is defined by early 1960s glory. The recurring slow-motion shots — including the notable \"Corridor Glance\" — set to \"Yumeji's Theme\" highlight the runtime, which is shot on film and it shows. I'd known about the sentimental final sequence, as it's rightfully lauded, and wasn't disappointed as it appeared before me. Simply, it's gorgeous. Wong Kar-wai's In the Mood for Love is a must-see for cinephiles, and while it may be too slow or not exciting enough for a general audience, I'd recommend anyone give it a try.",
            "review_date": "2022-02-02",
            "source": "rt"
        },
        {
            "content": "One of the most if not most overrated films of all time. Visually striking and I enjoyed the musical soundtrack, (although overdone). I really enjoyed her costumes as well and main actress is beautiful. I also liked when there was dialogue and some of the symbolism-at the end with the tree. The acting was ok, if a bit stoic like many Asian films. The problem is the dialogue didn't compensate, so it was hard to know wth was going on. Movie moves extremely slow n tedious as well, and I wasn't sure about main themes before looking them up. For instance, where they sleeping together-i guess not. Also, somehow we are supposed to know the women and son next door are the main actress n her son? A movie for the critics-the worst kind.",
            "review_date": "2022-01-17",
            "source": "rt"
        },
        {
            "content": "A thoroughly captivating and complicated doomed love affair beautifully shot.",
            "review_date": "2021-12-31",
            "source": "rt"
        },
        {
            "content": "Every shot is sheer poetry.",
            "review_date": "2021-12-28",
            "source": "rt"
        },
        {
            "content": "I loved the dreamy and mysterious atmosphere. I enjoyed the colors (red & green), music and the whole visual aspect of the movie. But again what really bothers me with these visually beautiful movies is the plot.  The plot of this movie was quite predictable and a bit boring, but it had its good moments also.",
            "review_date": "2021-12-18",
            "source": "rt"
        },
        {
            "content": "When Chow Mo-wan realizes that his wife is having an affair with the next-door neighbor, he develops a tightly knit relationship with the neighbor's wife, Su Li-zhen.  Despite the fact that romance begins to blossom between the two, they manage to repress their feelings in an effort to not lower themselves to the level of their unfaithful spouses.  In the Mood for Love is a story of a mutually agreed upon unrequited love, beautifully shot with a rich color palette, beautifully written and subtly acted, where the actors express more through stolen glances and gentle touches than they do through dialogue.  The emotions explored are heart-breaking and the feelings evoked are unforgettable.",
            "review_date": "2021-11-17",
            "source": "rt"
        },
        {
            "content": "A bitter-sweet romance.  It's quiet, understated, but ultimately powerful.  Beautiful photography and visuals.  Brilliant acting.  Caveats: not fast paced, and you've got to pay close attention at first to figure out the characters (it does cohere after a bit). I want to watch more from this director.",
            "review_date": "2021-11-15",
            "source": "rt"
        },
        {
            "content": "Ésta es una de las películas más hermosas, originales, entretenidas e inteligentes que podrás ver.",
            "review_date": "2021-11-12",
            "source": "rt"
        },
        {
            "content": "The characters set against the drabness and claustrophobia of 60s Hong Kong positively shine, the women in their snazzy figure-hugging floral outfits. There is clearly sex in the air, but it is all off-screen.\nThe Director even makes us feel like pepping-Toms catching the characters through the windows, framed in the tiny rooms that act as cages, helpless as they are as life and other impulses mark their fate.\nNot only visually arresting, but a wonderful use of music, make sure you watch this film in a theatre with a good sound-system or invest in a top-notch home cinema, or you won't get to enjoy the aural atmospherics of Nat King Cole serenading you and setting the tone for what is unfolding so seductively.\nA magnificent performance from the twin protagonists, understated, elegant and using the simplest of gestures to convey the deepest of feelings in the repressed times and society they inhabit.",
            "review_date": "2021-10-18",
            "source": "rt"
        },
        {
            "content": "It's pretty deflating when you see a film with so many accolades, plaudits and gushing reviews, only to feel completely let down by it. In The Mood For Love was ranked, in 1 poll, as the 2nd greatest film of the 21st century, an assessment which, I have to say, I'm dumbfounded by. The film goes for a minimalistic quality, especially in regard to the dialogue. This isn't necessarily a bad thing, in fact it's quiet refreshing. Most of the emotions are conveyed through camerawork and facial expressions, with no need for lengthy explanations. The faces of the unfaithful spouses are never shown, because the film is not about them. The focus is on the bond which develops between their partners, and its resulting consequences. I enjoyed the movie at first, but soon the real lack of any substance starts to wear thin, and before the 3rd act had begun, I'd already mentally checked out. The film has so much dead air, so much wasted time where nothing happens, but feels the need to linger, because that's what audiences want to see apparently. The slow, quiet moments didn't feel like they were there to let emotions register or feelings develop, it felt like the film just didn't have anything interesting to say. It's sensitively acted by it's leads, which is to say they look mildly annoyed and cry occasionally. It starts with promises but falls flat by the last frame. I wouldn't see it again, and unless somebody had absolutely nothing else to do for an hour and a half, I wouldn't recommend it to anyone either.",
            "review_date": "2021-09-26",
            "source": "rt"
        },
        {
            "content": "Although visually beautiful and emotionally sensitive, the plot moves so slowly and so little that the viewer's mind wanders, making it difficult to keep track of what little plot there is. Although I can certainly see why this director is a critics' favorite, I'll skip the rest of his movies.",
            "review_date": "2021-09-11",
            "source": "rt"
        },
        {
            "content": "A visual stunner. But you definitely need to be in the mood for In the Mood for Love. My first time around I hated it.",
            "review_date": "2021-08-03",
            "source": "rt"
        },
        {
            "content": "A masterpiece of aesthetics. Wong Kar-Wai's style is quite unique.",
            "review_date": "2021-07-24",
            "source": "rt"
        },
        {
            "content": "Well, how could you transfer the emotion of \"love\" without using words? How could you create a moving painting? How could you use metaphors to process a mountain of things in a duration of a movie? This movie was the answer for all these questions for me. You will not be entertained much because it is a slow movie. However, you will be much more satisfied since it will touch the deepest parts of your soul.",
            "review_date": "2021-07-17",
            "source": "rt"
        },
        {
            "content": "It is a beautiful film.",
            "review_date": "2021-06-30",
            "source": "rt"
        },
        {
            "content": "Fabulous! This is a film for cinephiles. It was absolutely beautiful and moving. The only thing that I do not love about it is actually the title. In the Mood For Love could have had a much more sophistocated name. Regardless, I recommend watching this 100%.",
            "review_date": "2021-06-06",
            "source": "rt"
        },
        {
            "content": "I had been told before this was a great film. But this is a miracle.\nEvery single part of this film is a piece of art itself, the acting, the camera movements -or the positions in which it says satic-, the dresses, but specially the powerful (not) love story of two people who never find each other, where the most important is what is not said and why. Wong Kar-wai has created a masterpiece, a marvelous trip from wonderland and the land of the drams that never were.",
            "review_date": "2021-05-20",
            "source": "rt"
        },
        {
            "content": "Very disappointing for what came from Wong Kar-wai. It's very very boring and slow movie.",
            "review_date": "2021-05-15",
            "source": "rt"
        },
        {
            "content": "A beautifully wrought film about that most powerful of all emotions - love lost, particularly unconsummated and unspoken love that's been lost. The resonance of the message about being drawn back to your past to desperately want to touch and feel that feeling again is stunningly captured. One of the great foreign language films of this century.",
            "review_date": "2021-05-09",
            "source": "rt"
        },
        {
            "content": "I usually don't think watch foreign films but this one was beautiful",
            "review_date": "2021-05-05",
            "source": "rt"
        },
        {
            "content": "Despite being a bit slow for my taste, I still liked the movie, mainly because of the performances of the two leads. They're never overly dramatic but not lethargic, making their performances feel real. I also found the themes thought-provoking, and Wong Kar-Wai's direction is very skilled and the cinematography is immaculate.",
            "review_date": "2021-05-05",
            "source": "rt"
        },
        {
            "content": "It's a true life changer, summing up so many burdensome emotions and useless moments and details with such perfect coordination of the cinematic language that it's ridiculous I'm here trying to describe it with words.",
            "review_date": "2021-05-04",
            "source": "rt"
        },
        {
            "content": "I don't have a keen enough eye for artistry to have appreciated this as much as everyone else appears to have. I did notice the excellent color palette and set/costume designs as they made a very visually pleasing experience for me, Bulbazard, the enemy of desaturation. The main impression I got from this was that Wong heard someone say that it's impossible/very difficult to shoot a movie in a location as cramped as a real-life apartment complex with its narrow hallways and no room for good camera placement and opted to make this movie to show like 35 different ways to do it, shooting from angles like underneath the clothes in a closet or through a peephole or from an open doorway in the hall or from on top of the fridge in the kitchen. I didn't find the story itself particularly believable as it would be nonsensical for either main character to assume they would carry on a years-long close relationship without either catching feelings for the other. The notion that either would have really stayed with their spouses for years during/after their respective affairs, particularly with an obviously superior choice of life partner sitting right next to them didn't seem logical to me whatsoever and I don't think cultural differences fully explain that. The actors were excellent, but the dialogue wasn't creative/interesting enough to make this a superior movie to 2001's Amelie.",
            "review_date": "2021-04-07",
            "source": "rt"
        },
        {
            "content": "One of the most beautiful looking films I've ever seen. So much to explore here that I think it's impossible to write a good review after one viewing. Just a strikingly vivid and fully realized film that is going to draw me back very soon the more I think about it.",
            "review_date": "2021-04-04",
            "source": "rt"
        },
        {
            "content": "this made me in the mood for sleep.",
            "review_date": "2021-03-25",
            "source": "rt"
        },
        {
            "content": "An involving romantic affair period piece with some anchoring performances and Kar-Wai's usually sublime cinematography.",
            "review_date": "2021-03-22",
            "source": "rt"
        },
        {
            "content": "This film is a climactic, sensual must-see. The cinematography's camera angles, the romantic/confrontational role plays, and the climax that never comes keeps you at the edge of your seat.",
            "review_date": "2021-03-07",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies. Gorgeous touching heartbreaking.  Dreamlike but with intimate details. Never maudlin, a restrained masterpiece",
            "review_date": "2021-02-15",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies. Gorgeous touching heartbreaking. Dreamlike but with intimate details. Never maudlin, a restrained masterpiece ",
            "review_date": "2021-02-15",
            "source": "rt"
        },
        {
            "content": "I just can't get on the bandwagon for this one. Director Wong's pretentious style detracts from what could have been an interesting story.",
            "review_date": "2021-02-08",
            "source": "rt"
        },
        {
            "content": "First I will tell you my perspective such that you can decide how well you relate to it and can rely on it in determining how much you might like the film.  I watch virtually every film that becomes available to me, including mainstream and at the local art house.  When it comes to foreign films and art movies, I wouldn't say they are uniquely my jam, but I don't shy away from them either, and like them at about the same rate that I would like anything that comes out at the mainstream theater.\n\nI certainly recognized the technical virtuosity and artistic sensibilities brought to bear on this film.  It was haunting, and at times in grossing, and I don't think anyone could ever claim that the acting was anything less than excellent.  \n\nThat said, it can be slow, obscure, and abrupt in a variety of ways, and for that reason, it demands a lot of the viewer over the course of its runtime.  I was on board for that journey throughout, but did expect more pay off than ended up being there.  \n\n(vague semi-spoilers follow)\n\nI suppose it is possible that this ended up being revealed in a way that was subtle enough that I missed it, but so far as I can tell, it was not really explained how either of the two marriages involved proceeded from the events of the core of the film. That is to say, the ending was fairly vague, and I'm not afraid to admit that I found the last handful of scenes collectively rather confusing.  not that I don't get the general gist of how the romance at the core of the movie ended up, but I guess I'm not sure in much detail how the lives of those characters proceeded, nor even why they made the decisions they made or how they felt about those decisions- especially Mrs. Chan.  And again, it's possible I just missed it, but I also happen to have absolutely no clue what happened to Mrs. Chow or the Chow marriage.  I was also confused as to what Cambodia in particular had to do with anything or why Chow went there, aside from providing some nice scenery for the closing sequence, and was especially unclear as to why it was so important to the story that the location deserved its own introductory archival footage right at the end of the film.\n\nI just genuinely found the overall effect to be pretty frustrating and a bit confusing, and you'll have to take my word for it that I'm no dunce in film interpretation generally-speaking, even if it turns out that I botched this one.",
            "review_date": "2021-01-25",
            "source": "rt"
        },
        {
            "content": "This is everything that 2046 was not. A beautifully told, lavish yet restrained, story of unrequited (or just unconsummated?) love, with enough time given to the characters for you to actually care about them. Tons of great directorial moves, too (never showing the spouses faces etc.). Beautifully filmed with a beautiful score, too. I found this film touching and satisfying, despite the heartache.",
            "review_date": "2021-01-23",
            "source": "rt"
        },
        {
            "content": "A fresh take on the classic \"boy meets girl\" love story. In the Mood for Love stands out for its striking costumes, moving score, and crisp cinematography. Every frame in this movie looks like it could be a portrait. It's also incredibly understated. There are no sweeping romantic gestures or \"holding boomboxes outside your house\" moments. Perhaps, that's why it didn't resonate as thoroughly emotionally as I wanted.",
            "review_date": "2020-12-26",
            "source": "rt"
        },
        {
            "content": "This is an elegant, subtly intense, economical meditation on fidelity and the price that sacrifice can mean. More specifically, it's about fidelity in the face of great loneliness and likely infidelity, with the very real presence of another person there who could give you respite from such sadness and uncertainty. We all have the need to feel wanted, loved, appreciated. When we have that, we feel so close to complete, with the security and assurance it brings. But for that to suddenly be gone, or for it to slowly degrade, as is the case for 𝘐𝘯 𝘵𝘩𝘦 𝘔𝘰𝘰𝘥 𝘍𝘰𝘳 𝘓𝘰𝘷𝘦, can leave us lost and searching for ways to regain order in our lives. \nThe film is gorgeous to look at. The colors and the look of the characters, from hair styles to wardrobe choices, gives a real sense of 60's films. There's even a touch or two of new-wave Euro movies of that era. Great choices were made throughout by Kar-Wai Wong. The subtleties of glances, quiet but telling body language, saying so much in silence, and those tight shots of Su Li-zhen exuding femininity as she walks up those stairs show the signs of a mature director who knows the power of the visual image and how it can say as much as a shot/scene filled with dialogue. \nExcellent work also by leads Tony Leung Chiu Wai and Maggie Cheung Man-yuk. \nI think of the scene where Chow and Su are first sitting in his apt./room, with the camera set as if under a table or through a keyhole, with us as voyeurs into their new secret friendship, which hints at being more. And then the crushing reminder of history at the very end, along with a secret whispered into a stone wall that makes up part of the halls of a structure constructed for mankind to ponder the mysteries of life, to help resolve our questions and searching, and to reach the peace of mind, security and happiness with our place in the world that the love of a faithful other can bring us. 3.7 stars",
            "review_date": "2020-09-21",
            "source": "rt"
        },
        {
            "content": "Every bit of Wong Kar Wai's artistic touch can be seen from this movie.",
            "review_date": "2020-09-05",
            "source": "rt"
        },
        {
            "content": "This is a beautiful film in several ways: its style, its pacing, its score, and of course the performances from the two equally beautiful leads.",
            "review_date": "2020-07-27",
            "source": "rt"
        },
        {
            "content": "Wong Kar-Wai's exceptional direction creates a subtle and beautiful atmosphere in which the two leads dive deep to culminate in an astonishing impact",
            "review_date": "2020-07-09",
            "source": "rt"
        },
        {
            "content": "I think this was almost too understated for me, bordering on being inert.  But the music and style are peerless.",
            "review_date": "2020-05-24",
            "source": "rt"
        },
        {
            "content": "In The Mood For Love Pros: Phenomenal Acting Fantastic Directing Amazing Screenplay Outstanding Cinematography Magnificent Editing Stunning Set and Costume Design Brilliant Pacing Fascinating Storyline Beautiful Musical Score Explores its themes surrounding marriage and infidelity in a fully fleshed-out manner Cons: None Overall Grade: A+ (10/10)",
            "review_date": "2020-04-19",
            "source": "rt"
        },
        {
            "content": "A well-made, compelling, and thoroughly engrossing romance that effectively combines a subdued tone with emotional power. Bonus points for great costumes and sets, full of vivid color, and note-perfect performances from the two leads. (4.5/5)",
            "review_date": "2020-04-04",
            "source": "rt"
        },
        {
            "content": "Perfectly stylised 'poem' about the 60's Hong Kong. The movie is shot on Kodak film, which gives it this vivid, saturated image.\nThough the editing is a bit crazy sometimes (some shots change too rapidly), you get used to it and find it a new, curious cinema language.\nThe performances of the actors are just great.",
            "review_date": "2020-03-15",
            "source": "rt"
        },
        {
            "content": "Although a bit slow all the way through, a solid representation of the power of love as well as its universal and unpredictable nature. This 1960's story is an important piece as it stamps Wong Kar-Wai's style into film history. Every element of his storytelling is refined and applied in a way that brings it all together and offers a most complete experience of the infamous mood he tries to convey in his work.",
            "review_date": "2020-02-01",
            "source": "rt"
        },
        {
            "content": "Possibly the saddest, most beautiful and romantic movie I've even seen.  Haunting cinematography and soundtrack. Just a perfect movie.",
            "review_date": "2020-01-19",
            "source": "rt"
        },
        {
            "content": "Style and subtlety; if there is one movie that fusion both with perfect harmony, that movie is this one.",
            "review_date": "2020-01-02",
            "source": "rt"
        },
        {
            "content": "Pure art and beauty! \n\nThe top-ten movie ever made.",
            "review_date": "2019-12-18",
            "source": "rt"
        },
        {
            "content": "Very beautiful, aesthetics. And great music",
            "review_date": "2019-12-13",
            "source": "rt"
        }
    ]
}