{
    "rating": 9.0,
    "release_date": "2001-05-18",
    "num_reviews": 150,
    "genres": [
        "Kids&family",
        "Comedy",
        "Fantasy",
        "Animation"
    ],
    "summary": "Once upon a time, in a far away swamp, there lived an ogre named Shrek (Mike Myers) whose precious solitude is suddenly shattered by an invasion of annoying fairy tale characters. They were all banished from their kingdom by the evil Lord Farquaad (John Lithgow). Determined to save their home -- not to mention his -- Shrek cuts a deal with Farquaad and sets out to rescue Princess Fiona (Cameron Diaz) to be Farquaad's bride. Rescuing the Princess may be small compared to her deep, dark secret.",
    "reviews": [
        {
            "content": "You can just watch and watch this movie and it's still great every time 10/10",
            "review_date": "2023-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shrek is a delightful animated movie that has captured the hearts of audiences of all ages. The movie's unique blend of humor, heart, and adventure is a true testament to the power of storytelling. The film's characters are lovable and memorable, with Shrek himself being an endearing and relatable protagonist. The animation is top-notch, with vibrant colors and attention to detail that truly bring the fairy tale world to life. Overall, Shrek is a classic movie that will continue to entertain and inspire audiences for years to come.",
            "review_date": "2023-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's Shrek, and im pretty sure that says enough.",
            "review_date": "2023-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Voice acting peaks here",
            "review_date": "2023-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an amazing, classic, funny and entertaining film with heart and humour. This is one of many of Dreamwork's wonderful movies. I love this movie and its main character, Shrek. Four stars from me.",
            "review_date": "2023-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's Shrek, what do you want me to say that hasn't been said already?",
            "review_date": "2023-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ONIONS HAVE LAYERS!! To this day, this movie is still such a classic!",
            "review_date": "2023-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Somebody once told me that this would become a smash but they ain't the smartest dude on the planet.",
            "review_date": "2023-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I LOVE SHREK SHREK IS MY EVERYTHING HE IS SUPER COOL",
            "review_date": "2023-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "they tried to make a satire to disney fairytales and accidently made the best one.",
            "review_date": "2023-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best animated movie ever!!",
            "review_date": "2023-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the best movie of all time!!!! nothing else could compare. This movie got my family out the projects, and it raised my mom from the dead because of how good it was. If you do not watch this at least 5 times a day thany you are mentally unstable.",
            "review_date": "2023-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie I have nothing bad to say",
            "review_date": "2023-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For me this will just never live up to that top tier of animated classics. It comes very close, and I understand why some people will put it there, but for me it just fall slightly short. The voice acting and animation are great. The story is pretty good. But the overall package just doesn't come together and present that magic reaction you would hope for when adding all those elements together. Don't get me wrong, I love this movie. It's far from being bad, I've seen it tons of times, and I'll probably watch it a few more as well. But it's just not one that I want to watch over and over. 7.75/10",
            "review_date": "2023-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "literally the best movie ever i don know why everyone hasn seen this we should drop copies of shrek on every continent so that everyone ever can see it because it is a good movie and i like it a lot and its funnny",
            "review_date": "2023-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shrek is not only an excellent family comedy, it's an excellent comedy. Which is a rare feat that animation movies rarely accomplish. This film is still an easy recommendation 20 years later.",
            "review_date": "2023-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest animated movies ever! It's hilarious and has a unique story, memorable characters, a great message, and great music! Truly a one-of-a-kind film!",
            "review_date": "2023-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "C'mon,how are you not gonna watch this masterpiece of a film?",
            "review_date": "2023-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The start of a beautiful franchise. This is probably one of the movies that carry a boatload of nostalgia for me. I might have seen this hundreds of times but never have I judged it from a cinematic perspective. So let's do it.\n\nFrom great music choices to great story to the absolutely bonkers parody for Disney movies (a smart move by DreamWorks), this film rocks.\n\nThe flaw that drags this film down is the generic villian. Don't get me wrong he totally works for this film, but he's so generic and is evil just for the sake of being evil which makes him not so great.",
            "review_date": "2023-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't expected to be a parody fairy tale.",
            "review_date": "2023-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shrek is love, Shrek is life. Amazing characters,  great music,  hilarious, as an 11 year old, I would definitely recommend this! I just wish it got more at the box office. I thinl how \"dark\" and \"sexual\" it was was a great idea, the jokes were made perfect because of this. One draw back is... that the movie wasn't long enough! My favorite movie out quadrology, so watch this right now!",
            "review_date": "2023-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A absolute classic for all ages.",
            "review_date": "2023-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first Shrek film in the franchise was a good entertaining film but it's not the best. Being this my third film I say it's a good average animation film.",
            "review_date": "2023-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Genuinely a five star movie for me. Funny and dramatic. Donkey and Shrek becoming friends is very relatable. Fiona being afraid of her true self is very relatable. We all have something to relate to in Shrek. Thank you DreamWorks for making this masterpiece.",
            "review_date": "2023-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shrek is such the amazing movie to watch.",
            "review_date": "2023-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the begining of a golden era 10/10",
            "review_date": "2023-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Animation, funny and wonderful great film that holds up well.",
            "review_date": "2023-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was the beginning of DreamWorks and their mega star animation studio that could finally compete with Walt Disney. They had other films in the past, but this movie really set it apart, I think that Shrek is a wonderful film to watch with your children. It has dry humor though. But at the end of the day, it is a fun and exciting story of an ogre, that I actually enjoyed watching, and I have watched multiple times ever since.",
            "review_date": "2023-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movies is about adventura and comedy of a green ogre named Shrek. He lives in a swamp pacifically but is invaded by other characters of stories of fairies.\nThis movie is about a Sherk and Donkey who rescue the Princess Fiona of the Tower and a Dragon.\n\nShrek 1 is as good as Shrek 2. \nShrek 1 is as funny as his other movies.\nShrek is as good as Ice Age\n\n\nShrek is a very funny movie and romantic.  \nIt teaches respect and not judge other persons before meeting them.",
            "review_date": "2023-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "SHREK.\n\nSinopsis: this movie is about adventure and comedy of a green ogre named shrek.\nHe lives in a swamp pacifically but is invaded by other caracter of stories of fairies.\n\nthis movie is about an shrek ogre and donkey who rescue the princess Fiona of the tower and a Dragon.\n\nShrek 1 is as good as Shrek 2.\n\nShrek 1 is as funny as his other movies.\n\nShrek is as good as ice age.\n\nShrek is a very funny movie and romantic.\nit teaches respect and not judge other persons before meeting them.",
            "review_date": "2023-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "AHEAD OF ITS TIME. SHREK BREAK MY BACK. Bajen a la vieja muerta de la mesa. Donkey kinda annoying though but he pulled a dragon. Respect.",
            "review_date": "2023-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is about\nand ogre and a princess\nWho during the day is one\nand at night she transforms.\n\nThis movie is as Wonderful\nas chicken run,\nFiona is as pretty as snow white,\nThe donkey is a funny as pigs in the movie.\nCat in boots is a serious as Shrek.\n\nThis movie is Wonderful\nsuitable for all ages,\nEveryone has to have laugh with\nfamily and friends highly recommended.",
            "review_date": "2023-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shrek is the perfect movie for kids all around the world filled with jokes that will get the whole crowd laughing. Poop. Love it",
            "review_date": "2023-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The busses depart at work for you",
            "review_date": "2023-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm severely concerned that this movie does not have a solid 100% on both accounts?! Shrek is an all time classic, a funny movie with serious undertones of lessons that can benefit audiences of all ages. Forever to thee.",
            "review_date": "2023-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Meh. Not the worst movie ever but it definitely isn't good.",
            "review_date": "2023-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is funny classic movie ever I wanna see next shrek movie in future",
            "review_date": "2023-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Did you hear about the person who watched too much Shrek? He ogre-dosed.\nAnd, It was me who was ogre-dosed.",
            "review_date": "2023-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good becuse its Shrek.",
            "review_date": "2023-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A- also 8.8/10 Shrek is a iconic classic introduction us to fan favorite  characters like donkey this movie has a solid story and heart and a iconic score so this movie is a solid film that you have to watch.",
            "review_date": "2023-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the second one is better",
            "review_date": "2023-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A timeless classic. Nothing can beat how funny it is.",
            "review_date": "2023-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has Shrek",
            "review_date": "2023-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've watched a ton of horror movies throughout my life and I honestly don't understand why this one has gotten such terrible reviews...There were a few moments that were a little laughable and the character development could have been fleshed out a bit more, but overall I think it was one of the better horror flicks I've seen to date. This movie is WAY underrated in my opinion. In fact, when you actually dig a little further into all the symbolism, lore and subtleties behind it, I think it's kind of brilliant! Especially if you're familiar with Dante's Inferno. Definitely recommend you ignore the Critics score on this one - if you're looking for something that combines mystery and adventure with creepy suspense and a fear of small spaces, this one's a gem!",
            "review_date": "2023-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dang, Shrek hella thicc.",
            "review_date": "2023-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie of all time!",
            "review_date": "2023-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the best movie i have ever seen because of donkey and the music used for but mostly donkey",
            "review_date": "2022-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I fucking love this movie",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The gags are funny and Mike Myers and Eddie Murphy are geniuses.",
            "review_date": "2022-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watch this movie in .12.2022",
            "review_date": "2022-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest movies made by Dreamworks animation. The story is exciting, the characters are funny, and the amount of quotable lines said by the titular character and Donkey. Mike meyers really gives it his all in this role. Overall, 10/10 movie, Would recommend.",
            "review_date": "2022-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best non Disney animated movies of all time. Funny and a joy to watch. Great voice work and great story. ",
            "review_date": "2022-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a really nice and funny adventure",
            "review_date": "2022-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is such a good movie, The movie is 10/10 the full time it is such beautiful thing it is the best thing since sliced bread I think the animations are insanely good the games story is good it is about a angry Scottish guy that wants his swamp (His home) back so he goes and saves a princes from a tower then with the princes he goes to lord farquaad but the princes is actually a ogre as well. This movie is such a masterpiece it fits everything you want in a child friendly movie. \nThanks for reading my review",
            "review_date": "2022-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "shrek activated my hormones",
            "review_date": "2022-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie ever animated!",
            "review_date": "2022-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even if this is a good 7,5/10 standalone movie, I think that it's a little bit overrated and overall WAY inferior to the phenomenalness that is it's sequel",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A cult classic! What else can I say. Shrek Is an incredible movie whatsoever. Watching it over and over never gets boring and that is not just because of the memes. All i can say is 10/10. 'that'll do donkey, that'll do.'",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's just a classic by now",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, firstly, the soundtrack is literally awesome. This movie is epic as well and uh yeah it slays!",
            "review_date": "2022-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is so good and Shrek is so hot",
            "review_date": "2022-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shrek was the first film I EVER WATCHED, and I got to say, IT STILL REMAINS A CLASSIC IN MY MIND. I would watch it as a toddler over and over again multiple times a day, causing severe annoyance to the rest of my family, but I didn't/don't care that much and kept watching (Shrek=Must See)",
            "review_date": "2022-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great introduction to the character of shrek. this movie is absolutely beautiful. my favorite charcter by far is donkey. the way he speaks, moves, and looks is so enticing. i can literally smell his beautiful scent through the screen. anyways shrek is cool too. ughhh dadddyyyyy shrekkk",
            "review_date": "2022-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even after all the years that have passed, this is still one of the all time greats from this company.",
            "review_date": "2022-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Somebody once told me the world is gonna roll me\nI ain't the sharpest tool in the shed\nShe was looking kind of dumb with her finger and her thumb\nIn the shape of an \"L\" on her forehead\nWell the years start coming and they don't stop coming\nFed to the rules and I hit the ground running\nDidn't make sense not to live for fun\nYour brain gets smart but your head gets dumb\nSo much to do, so much to see\nSo what's wrong with taking the back streets?\nYou'll never know if you don't go\nYou'll never shine if you don't glow\nHey now, you're an all-star, get your game on, go play\nHey now, you're a rock star, get the show on, get paid\nAnd all that glitters is gold\nOnly shooting stars break the mold\nIt's a cool place and they say it gets colder\nYou're bundled up now, wait 'til you get older\nBut the meteor men beg to differ\nJudging by the hole in the satellite picture\nThe ice we skate is getting pretty thin\nThe water's getting warm so you might as well swim\nMy world's on fire, how about yours?\nThat's the way I like it and I'll never get bored\nHey now, you're an all-star, get your game on, go play\nHey now, you're a rock star, get the show on, get paid\nAll that glitters is gold\nOnly shooting stars break the mold\nHey now, you're an all-star, get your game on, go play\nHey now, you're a rock star, get the show, on get paid\nAnd all that glitters is gold\nOnly shooting stars\nSomebody once asked could I spare some change for gas?\nI need to get myself away from this place\nI said, \"Yup\" what a concept\nI could use a little fuel myself\nAnd we could all use a little change\nWell, the years start coming and they don't stop coming\nFed to the rules and I hit the ground running\nDidn't make sense not to live for fun\nYour brain gets smart but your head gets dumb\nSo much to do, so much to see\nSo what's wrong with taking the back streets?\nYou'll never know if you don't go (go!)\nYou'll never shine if you don't glow\nHey now, you're an all-star, get your game on, go play\nHey now, you're a rock star, get the show on, get paid\nAnd all that glitters is gold\nOnly shooting stars break the mold\nAnd all that glitters is gold\nOnly shooting stars break the mold",
            "review_date": "2022-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Somebody once told me that this movie is an instant classic.",
            "review_date": "2022-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Somebody Once Told Me, Shrek's An All-Time Classic.",
            "review_date": "2022-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After 20 years, still the funniest Hollywood animation ever",
            "review_date": "2022-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. It's shocking how much they got away with in this movie.",
            "review_date": "2022-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film! The animation is still great 20 years later!!!",
            "review_date": "2022-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "shrek 2001, it´s top, he helps the princess our of the tower, the bad part is that he goes through many challenges and people who judge him.",
            "review_date": "2022-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shrek is a very good movie, because the main caracter is a big green monster, it is funny.\n           An evil knight exiles the creatures of a fairy tale to the stitamp of a grumpy ogre who him his eagerness to reclaim his territory makes a pact to get a beautiful princess to agree to be the gentlemans girlfriend.",
            "review_date": "2022-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked this as a kid but love it as an adult and I'm glad that I rewatched it. The satirical and humor and sarcasm, the voice acting, the originality, the choice of music, the simplicity, the message it sends, it's all fantastic! It's a love story, a comedy, and skilled animation all put into one masterful film! This is one of the all time masterpieces from Dreamworks and I say that very confidently! And to top it all off, it's only an hour and a half long, however you wish it was longer! This is one of the most likable movies that there can be!",
            "review_date": "2022-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't decide ir this le the second movie is better, both are so incredible",
            "review_date": "2022-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shrek is love. Shrek is life.\nWith love, Anej.",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shrek\n⭐7.9/10▪︎🟦84%▪︎763.564▪︎6+▪︎2001▪︎Animation / Adventure / Fantasy / Comedy / Family\n⭐9.2/10▪︎🟦94%▪︎OBLIT▪︎6+▪︎2001▪︎Animation / Adventure / Fantasy / Comedy / Family",
            "review_date": "2022-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked the incidental music very much, especially in the escape from the Dragon scene. I wasn't hugely fond of the pop music featured, but putting that minor quibble aside, this was still an original and funny animated film, that will please any animation lover. The animation is faultless, never stiff, and lovely backgrounds. The script is laugh-out-loud funny with the fairytale characters, Gingerbread Man especially, and Robin Hood. The characters are definitely memorable, and the terrific voice cast brings the film to life. Mike Myers voices the ogre with feeling, but it is Eddie Murphy who steals the film. Though Cameron Diaz is lovely as Fiona, and John Lithgow is delightfully villainous as Lord Farquad, though his villain isn't the most memorable villain ever in an animation. The film sparkles with heart and humour, it is impossible not to like it. In conclusion, look out for it, you'll be glad you did! 9/10 Bethany Cox.",
            "review_date": "2022-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I honestly don't get why people pretend like this movie is a cinematic masterpiece. The story had potential, but it's completely ruined by the movie trying desperately to be funny. I didn't laugh once at any of the jokes the movie tried to make, and the fact that the movie was trying desperately to be funny didn't help either. The humor, as far as you can even call it that, is about as witty as Rick and Morty - a show that, despite the copypasta about needing a high IQ to fully understand it, relies mostly on shock humor - but fails entirely to make even a single one of the jokes land.",
            "review_date": "2022-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An instant classic, this one.",
            "review_date": "2022-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie changed my life thoroughly, for the better. It taught me the layers of people living their lives, in a way comparable to an onion. It made me want to wake up to make waffles, instead of staying in my bed. This is the best movie I have ever seen, and I highly recommend it if you need some changing of your life to be done as well.",
            "review_date": "2022-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What else can be said shrek is love shrek is life",
            "review_date": "2022-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Man, this movie is my childhood, I love it so much. By far one of the best DreamWorks movies, I will always have fun watching it, so much nostalgia.",
            "review_date": "2022-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolute masterpiece. For me, it's the best animation of all time.",
            "review_date": "2022-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow what a Charming, Witty, and Refreshing Film. The Voice Acting, Animation and Soundtrack are full of life and have a charming adult edge to them. The jokes are so well done and there is so much originality to one of the oldest plots there is in storytelling. The Message of the movie is timeless as well. In a time when Hollywood was pumping more bad quality films than good ones this one stands out as a true all time classic animated film and in General one of the best as well.",
            "review_date": "2022-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shrek is not only well animated, but with its strong performances from its cast and a fun story and narrative that is bound to keep everyone entertained for everyone to watch.",
            "review_date": "2022-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Greatest movie I have ever seen 10/10. The comedy and the animation is down to a tee. This might just me the greatest movie in cinematic history!!!",
            "review_date": "2022-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The start of a beautiful franchise. This is probably one of the movies that carry a boatload of nostalgia for me. I might have seen this hundreds of times but never have I judged it from a cinematic perspective. So let's do it.\n\nFrom great music choices to great story to the absolutely bonkers parody for Disney movies (a smart move by DreamWorks), this film rocks.\n\nThe flaw that drags this film down is the generic villian. Don't get me wrong he totally works for this film, but he's so generic and is evil just for the sake of being evil which makes him not so great.",
            "review_date": "2022-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie because it's funny and great stuff too",
            "review_date": "2022-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All things considered it's held up pretty well.",
            "review_date": "2022-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shrek is amazing. Rewatchable, fun, entertaining and a great choice of voices.",
            "review_date": "2022-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Somebody once told me the world is gonna roll me\nI ain't the sharpest tool in the shed\nShe was looking kind of dumb with her finger and her thumb\nIn the shape of an \"L\" on her forehead\nWell the years start coming and they don't stop coming\nFed to the rules and I hit the ground running\nDidn't make sense not to live for fun\nYour brain gets smart but your head gets dumb\nSo much to do, so much to see\nSo what's wrong with taking the back streets?\nYou'll never know if you don't go\nYou'll never shine if you don't glow\nHey now, you're an all-star, get your game on, go play\nHey now, you're a rock star, get the show on, get paid\nAnd all that glitters is gold\nOnly shooting stars break the mold\nIt's a cool place and they say it gets colder\nYou're bundled up now, wait 'til you get older\nBut the meteor men beg to differ\nJudging by the hole in the satellite picture\nThe ice we skate is getting pretty thin\nThe water's getting warm so you might as well swim\nMy world's on fire, how about yours?\nThat's the way I like it and I'll never get bored\nHey now, you're an all-star, get your game on, go play\nHey now, you're a rock star, get the show on, get paid\nAll that glitters is gold\nOnly shooting stars break the mold\nHey now, you're an all-star, get your game on, go play\nHey now, you're a rock star, get the show, on get paid\nAnd all that glitters is gold\nOnly shooting stars\nSomebody once asked could I spare some change for gas?\nI need to get myself away from this place\nI said, \"Yup\" what a concept\nI could use a little fuel myself\nAnd we could all use a little change\nWell, the years start coming and they don't stop coming\nFed to the rules and I hit the ground running\nDidn't make sense not to live for fun\nYour brain gets smart but your head gets dumb\nSo much to do, so much to see\nSo what's wrong with taking the back streets?\nYou'll never know if you don't go (go!)\nYou'll never shine if you don't glow\nHey now, you're an all-star, get your game on, go play\nHey now, you're a rock star, get the show on, get paid\nAnd all that glitters is gold\nOnly shooting stars break the mold\nAnd all that glitters is gold\nOnly shooting stars break the mold",
            "review_date": "2022-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A childhood classic!",
            "review_date": "2022-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best movies ever made. the pride and joy of america.  yes throughout the years shrek has become a joke, but theres a reason why shrek got so popular and that all started with this great movie. the animation was so ahead of its time back when it released, and the heart felt story of acceptance and not to judge appearances. truly a masterpiece",
            "review_date": "2022-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked the incidental music very much, especially in the escape from the Dragon scene. I wasn't hugely fond of the pop music featured, but putting that minor quibble aside, this was still an original and funny animated film, that will please any animation lover. The animation is faultless, never stiff, and lovely backgrounds. The script is laugh-out-loud funny with the fairytale characters, Gingerbread Man especially, and Robin Hood. The characters are definitely memorable, and the terrific voice cast brings the film to life. Mike Myers voices the ogre with feeling, but it is Eddie Murphy who steals the film. Though Cameron Diaz is lovely as Fiona, and John Lithgow is delightfully villainous as Lord Farquad, though his villain isn't the most memorable villain ever in an animation. The film sparkles with heart and humour, it is impossible not to like it. In conclusion, look out for it, you'll be glad you did! 9/10 Bethany Cox.",
            "review_date": "2022-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mike Myers as Shrek, Cameron Diaz as Fiona, Eddie Murphy as Donkey, and John Lithgow as Lord Farquaad!!!!!!!!!!!!!!!! LOL, the funniest 1.5 hours ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shrek is part Disney fairy tale and part fun comedy, but it still lacks some of the fun you'd expect from real-world fairytales.",
            "review_date": "2022-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although subverting fairy tales is just downright weird, its original characters and charming humor didn't just prove that Shrek is a force to be reckoned with but Dreamworks as well.",
            "review_date": "2022-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was an enjoyable movie. Not that much great for me but a nice entertainer. The character of Shrek was enjoyable but the character of donkey was not unbearable. Overall, it was a good watch which you can give a try.",
            "review_date": "2022-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is so, so, so f****** bad, I cannot even begin. It's not funny, it's vanishingly endearing. It's BAD.",
            "review_date": "2022-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mike Myers did a great job with costar Eddie murphy. The storyline was great. I loved the twist on all the fairytales combined into one movie. The jokes are very funny but younger children may not get them all.",
            "review_date": "2022-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie that defined Generation Z",
            "review_date": "2022-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is a classic i saw it when i was in the 5th grade i remember when it came out baskin robins had free ice cream with the perches of the VHS i had my copy and i watched it so many times the box wore out",
            "review_date": "2022-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was once Shrek is Love Shrek is Life on the film's release in 2001, and then years latter not as popular anymore to some out there and including myself. It's an okay film overall but the stuffs like the Disney Parody jokes and the gross out humors is just not my thing.",
            "review_date": "2022-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LOL, so ****ing funny and romantic!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! ****!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is timeless, its award is well deserved, the performances are stellar, also hillarious, but thats a given.",
            "review_date": "2022-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Film, not as good as Shrek 2 though. Animation, soundtrack, and story are good.",
            "review_date": "2022-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good movie to enjoy with the family, good animation and story.",
            "review_date": "2022-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shrek is a DreamWorks animated feature film directed by Andrew Adamson and Vicki Jenson, released on 18 May 2001, about an unsociable ogre named Shrek. The cartoon is based on William Steig's work \"Shrek!\".\n\nThe plot is both gripping and touching. An ogre named Shrek lives in a house in a swamp. Because of a conflict with Lord Farquaad, his house is taken away. At the same time Shrek rescues a talking donkey, which was about to be sold at the market of magical animals. Shrek and Donkey have to go to the dragon's tower to rescue the beautiful princess Farquaad secretly hopes to marry.  Normally when it comes to fairy-tale stories, like a prince rescuing a princess, in this version, Shrek the ogre  rescues a princess.\n\nShrek is great, his sarcasm makes you laugh to death.Donkey is an incredibly hilarious character, for which you could rewatch this film hundreds of times. Princess Fiona is powerful and independent, and she breaks every princess canon.\n\nAt the end, I'd like to say that the script is original, and the catchy soundtrack is also worth noting. You can' t beat unwinding while watching Shrek and having a good laugh.",
            "review_date": "2022-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is so amazing. The cast of characters in the movie is so great and talented. I defiantly recommended this to everyone, especially kids.",
            "review_date": "2022-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When I was a kid, I usually watching movie about the green and terrible ogre Shrek. At the age of 4, I laughed at his jokes, although I didn't understand them, his lifestyle, and especially at his not very smart friend Donkey. Besides, I don't know why, but Shrek always reminded me of my dad. He has the same charisma, similar jokes, offensive, but at the same time funny.\nAnd just recently, at the age of 18, I reviewed all the parts of Shrek, and realized that this isn't a simple children's cartoon with jokes that only adults understand, but also a cartoon with a deep subtext. For all 4 parts, you can see how the evil green giant turned into a kind, cheerful friend, husband and father. Having met his love, Fiona, he changed. In each following part, he did everything to make Fiona happy.\nThis is a wonderful cartoon to watch with the whole family.",
            "review_date": "2022-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the first animated films that I watched, I was very impressed after watching it. If you haven't watched it, then the main character of the cartoon is a big and scary ogre, who was forced to perform a feat. He has to rescue the princess from the tower under the dragon guard. Shrek is a comedy for the whole family, adults will be able to laugh with secret jokes, and children with everyone else. Storyline is fast and dynamic. There are also a lot of cool songs in the cartoon, from rock to pop. Shrek still looks very modern and relevant, I recommend everyone to watch this cartoon",
            "review_date": "2022-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies of all time. Has something for everyone and very very quotable. I loved it as a kid and enjoy it still as much as an adult.",
            "review_date": "2022-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shrek really was one of the greatest and worst things to ever happen for animated kids' movies. While about eight thousand films tried to replicate it in the years to come of the early aughts which may have created cynicism and reactionary fatigue directed toward the Shrek franchise as a whole, it cannot be overstated how revolutionary of a product the original Shrek movie was. Revisiting it some 20 years later, the first two thirds are a hilarious and scathing parody of the Disney animated films of the '90s. I applaud Dreamworks for creating such a well-crafted parody that I understood perfectly as an adult (how did anyone hear the name \"Lord Farquaad\" and think this was a film for kids?).\n\nThat being said-even if you don't understand the historical context it was released in and have intimate knowledge of the films it parodies-Shrek is a compelling narrative in its own right. While I do think in the last third of the film it sort of becomes the kind of film it seeks to parody, there is no denying the movie created a compelling set of characters and emotional beats able to stand toe-to-toe with the best of Disney. I don't really love gross out humor all that much (never loved it as a kid, either), but Shrek is a fun movie. Solid 7/10 for me.",
            "review_date": "2022-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "enjoyable good plot weird villian amazing animation funny 10/10",
            "review_date": "2022-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like seeing this movie brought back as a flashback. This is the second time I saw this movie at a theater.",
            "review_date": "2022-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A world phenomenon. One of the best animated movies of the century; where they show us the most satirical and darkest side of fairy tales. With charismatic and funny characters, good animation and a simple but spectacular plot. In conclusion, a film that will go down in history.",
            "review_date": "2022-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's Shrek, what do i say? it's references to disney and other stuff is amazing and i love it",
            "review_date": "2022-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The humour in this movie never gets old",
            "review_date": "2022-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Paul Rudd was not in this movie.",
            "review_date": "2022-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shrek is one of the most rewatchable films to come out of the early 2000's, with its cynical humor and great characters.",
            "review_date": "2022-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie with memorable phrases.",
            "review_date": "2022-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest animated film ever made. Forever a classic.",
            "review_date": "2022-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shrek is Love. Shrek is Life.",
            "review_date": "2022-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based on a character by William Steig, Shrek is an ogre living in isolation in the middle of his forest. Suddenly a bunch of characters from various fairy tales enter and displease him. It turns out a king has ejected them from his realm, and Shrek goes to confront the king, whose daughter has gone missing. Shrek and the king made a deal to find the daughter and send the exiled beings somewhere else.\n\nThis original version, unlike the sequels, features vulgar and scatological humor, and probably was not necessarily meant for small children. Nor is it emotionally involving like the better animated movies are. Passable, but not necessarily suited for family viewing.",
            "review_date": "2022-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You get the right amount of humor language and heart to create a comedy with big stars to back it up.  Shrek knows how to keep kids entertained and adults laughing their socks off with jokes that kids won't understand.",
            "review_date": "2022-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I personally loved it. It was a nice entertaining movie and all the actors did their part. I also loved the relatable friendship between Shreck and the donkey.\n\nOne of my favorite animated movies ever. Five stars!",
            "review_date": "2021-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its shrek, what do you expect",
            "review_date": "2021-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the funniest animated movies that I have seen in my entire life if not the funniest, can't think of any other that's been funnier and entertaining. I loved it.",
            "review_date": "2021-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shrek is just... Perfect for me. It has everything I could need for a movie. But... Shrek 2 still better",
            "review_date": "2021-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite non-Disney animated features ever, Shrek remains a funny fantasy classic after 20 years of its release.",
            "review_date": "2021-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a marvelous fairly tale with a thrilling quest and a happily ever after ending.  Shrek has the great themes of enduring myths, about believing in yourself, being loved for who you are, and good triumphing over evil.  It's also great satire, tweaking assumptions about ogres, princesses, rescues, and even fire breathing dragons.  Mike Myers, Eddie Murphy, Cameron Diaz, and John Lithgow are all perfect in their roles.\n\nThe computer animation is breathtaking for its time, like nothing seen before it.  The textures are stunning.  The glass, fire, clouds, and water seem 3-D.  The animation has wonderful warmth an depth but it also has great character and wit.  The facial expressions and body language are are a real treat.",
            "review_date": "2021-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "so this it legit the best move ever",
            "review_date": "2021-11-29",
            "source": "rt",
            "lang": "en"
        }
    ]
}