{
    "rating": 9.4,
    "release_date": "1986-09-07",
    "num_reviews": 90,
    "genres": [
        "Comedy"
    ],
    "summary": "A disc jockey (Tom Waits), a pimp (John Lurie) and an Italian tourist (Roberto Benigni) escape from jail in New Orleans.",
    "reviews": [
        {
            "content": "A classic of the crime genre that provides an intimate view of city life and raw human emotion.",
            "review_date": "2023-03-12",
            "source": "rt"
        },
        {
            "content": "Great film\n\nAltogether I think that the film, \"Down By Law\" (1986) by Jim Jarmusch featuring Tom Waits, is one of cinema's finest noir pieces, an obvious montage through the arts of it's time period, but held together at it's essence, which is the perceived voyeur's agreements with the sometimes awkwardly staggered and dragging exaggerations made by the true minds of the film. This context within context is somewhat familiar to the actors and writers whose hand at the work is seen like a stark author's stencil's dark shading on the texture of the characters at work in the movie. The exemplary effort given by the both the entire teams of the production and writing seem to fit seamlessly as though the stages were set and the actions seemed to flow out of the actors through the piece in the easiest, while at the same time, most mind-blowing orchestration through which the music plays on the rhythm of the story, and viewer. Great early attempt by Jim Jarmusch in film-making, and a true classic. Special recognition, definitely, for Roberto Benigni who was truly fun.",
            "review_date": "2022-12-31",
            "source": "rt"
        },
        {
            "content": "Off-beat, laid-back mood as of Jim Jarmusch. I'm sure that this was innovative for prison brake genre, but I find this need some thrills at least. It's a cozy friendship story.",
            "review_date": "2022-11-28",
            "source": "rt"
        },
        {
            "content": "Jarmusch's style of storytelling is probably more mood-dependent than any other director. Elevating the banal in a meandering slice of life about people with seemingly no ambitions and no desire to have them is not something you'd probably recommend for anyone to write. But he effortlessly pulls it off again and again. And so, this fairy tale can seem very boring if you are not willing to immerse yourself and just accept that Jarmusch loves the open-endedness of his stories. The main problem, I see, starting from prison, is that both Tom Waits and John Lurie get completely sidelined by Benigni, and I love that little bugger. How can you not? He immediately becomes the driving force while they are just observers who react to him and his obtuse and contrasting worldview. Of course, it doesn't ruin the finale, where their new life begins. Maybe that's what Roberto was, the guide that led them from their old ruined lives. The movies look great visually; it's one of those cases where black and white is clearly chasing the picture and color would not improve any of the visuals but would drastically detract from many scenes. And of course, the soundtrack is top-notch too.",
            "review_date": "2022-08-02",
            "source": "rt"
        },
        {
            "content": "Sonic lord lord king king lord lord king evil evil king lord king evil evil",
            "review_date": "2022-04-29",
            "source": "rt"
        },
        {
            "content": "Down By Law is Jim Jarmusch at his best, shot in black and white, with a perfect cast, brilliant cinematography, a fantastic music score, an absurd and subtle but basically kind of dark humor, amplified by the unexpected and with a special sense of timing in performance and editing. You never what comes next.",
            "review_date": "2022-04-06",
            "source": "rt"
        },
        {
            "content": "Jim Jarmusch handles a very simple premise \nThree men, previously unknown to each other, are arrested in New Orleans and placed in the same cell; Zack, Jack, and Bob \nThe trio eventually try to escape prison together\nUnlike other prison movies this centers on the arrest, incarceration, and escape from jail of three men\nIt discards jailbreak film conventions by focusing on the interaction between the convicts rather than on the mechanics of the escape\nThe entire journey though is a slog; it takes way too long to get to the actual imprisonment and the actual escape is less than exciting \nThis will be a huge bore for a lot of viewers mind you",
            "review_date": "2021-09-20",
            "source": "rt"
        },
        {
            "content": "1001 movies to see before you die.  This was tedious.  It was like they had no plot and thought that hiring the famous Italian would make up for the mediocrity of the film.  It was on amazon.",
            "review_date": "2021-09-11",
            "source": "rt"
        },
        {
            "content": "Tell me that young Tom Waits doesn't have the exact same face as Ron Perlman. And damn can that man croon. Lurie is a strange creative genius in multiple mediums that has flirted with really mainstream success; his great sense of humor doesn't really come through with this film, but it's just nice to see the guy. Benigni as Bob, a first-generation immigrant who is kept at arm's length by the language barrier but who also has a greater knowledge of American classics than the two native sons, is a treat. What a perfect cast for a Jarmusch film: each very talented, sort of well-known, but none a household name, just like him. The film is absolutely wonderfully shot, incredibly sharp, and features plenty of the director's traditional long takes, great on-location shooting, and inspired shot choice, particularly the intimacy with which the trio is portrayed. Some funny comedy and unique takes on the American experience (parodies on Twain and Bob's disillusionment with the actual America vs. the literary version, for instance) combine together to make a languid, beautiful film that can be called one of the director's best. (4.5/5)",
            "review_date": "2021-02-20",
            "source": "rt"
        },
        {
            "content": "This film is about American exceptionalism, with the 2 losers pursuing their selfish American dreams, totally ignorant of the world around them. Enter Bob, the angel trying to show them the light, time and again, but they never really get it. Genius.",
            "review_date": "2020-06-16",
            "source": "rt"
        },
        {
            "content": "A rumination on friendship and destiny.\n\nJim Jarmusch's indie comedy-drama Down By Law (1986) is a delightful time as three unlikely allies must band together to escape from prison. Down By Law takes a comedic tone with heavy character drama. Jarmusch's direction is a beautiful slow burn of human emotional experience. He makes you care about three men wrongly convicted so that you root for them to hold a jailbreak. Jarmusch's writing is pithy with heartfelt relationship dialogue and fun witty humor. Jarmusch directs Down By Law with a sharp eye striking realism.\n\nDown By Law paints a stark picture of Louisiana's poverty, desperation, and dejection. Robby Muller's stunning black and white cinematography is a visceral dreamscape. The South looks like a dirty, gritty swamp. The long held still shots are so revealing as actors just get to act in full without odd angles distracting from their performances. The landscape is established beautifully with long panning wide shots. I love the look of Down By Law.\n\nJohn Lurie composed haunting score to Down By Law. Ambient sounds and loud noises are bashed against gritty folk music for a chilling effect during Down By Law's serious scenes. Tom Waits himself sang the mournful folk songs throughout Down By Law. Jim Jarmusch has great taste in music that's for sure.\n\nTom Waits is phenomenal as the short tempered DJ Zack who is down on his luck. Waits delivers a subtle performance full of pained nuance. His character is already sad after a lost job and a recent breakup. Once in prison, Waits is fully dejected with an astonishing realism. Likewise, John Lurie plays a hardened pimp named Jack. His stern acting leaves you shook by his moving portrayal of a man rattled and broken in prison. Down By Law really makes you experience the boredom of prison. Lastly, Roberto Benigni is perfectly likable and endearing as the hilariously named Roberto. He is an earnest Italian tourist, who ends up accidentally killing a man in a laughable way.\n\nI must mention Ellen Barkin delivers a fantastic monologue Laurette as she dumps Tom Waits. On the other hand, Nicoletta Braschi plays a sweet Italian lady named Nicoletta opposite her real life husband Roberto Benigni. She is so entertaining seeing her flirt with Benigni, especially after having already watched Life Is Beautiful that they played in so brilliantly together.\n\nLastly, Rockets Redglare is sublime as the sleazy Gig character.\n\nIn all, Jim Jarmusch gave us another amazing art film with Down By Law among the likes of Night on Earth and Dead Man.",
            "review_date": "2019-11-14",
            "source": "rt"
        },
        {
            "content": "The most brilliant idea here was to put this three actors together: amazing vibe between them (I bet they are still friends in real life). I also want to point out that without the great Roberto the whole would have been a bit of a drag , The story is basic, but the cinematic style is more than enough to make up for it! ",
            "review_date": "2019-07-08",
            "source": "rt"
        },
        {
            "content": "I won't pull any spoilers, but what a story, cinematography,  and music. I only wish there was more Waits music.",
            "review_date": "2019-05-06",
            "source": "rt"
        },
        {
            "content": "I would believe it if someone told me that this 30-year-old movie came out last year. And Roberto Benigni is the best foreigner character of all times!",
            "review_date": "2017-12-03",
            "source": "rt"
        },
        {
            "content": "Funny, old-fashioned film. Underrated? Possibly. Must-see? Perhaps.",
            "review_date": "2017-09-19",
            "source": "rt"
        },
        {
            "content": "Great movie. Really funny at times but also very real.",
            "review_date": "2017-06-22",
            "source": "rt"
        },
        {
            "content": "Swings between an awkward theater piece and surprisingly engaging comedy. Something about the film was hard to engage with, so those really on-point moments were hard to trust. I felt like I'd been on a journey by the end, but I had to fight to stay with it.",
            "review_date": "2017-04-10",
            "source": "rt"
        },
        {
            "content": "Jim Jarmusch's second feature is still one of his best, and it's also possibly the most idiosyncratic prison-break movie ever made. That said, to call Down by Law a \"prison-break\" movie is a bit of a misnomer, as customary for Jarmusch he has little drive to give us exciting set pieces (we don't even see how they escape), but like a Jack Kerouac novel the point isn't the destination but the trek getting there. As with all of Jarmusch's films, Down by Law is carried by character and dialogue, but they're the two cards that no other American director can really get by with (asides from Tarantino). The film's trio of lovable low-lives all have great chemistry, and Tom Waits fans can rest assured that this is his single best on-screen performance. Always jovial, and featuring a cracking soundtrack supplied by Waits himself, Down by Law feels timeless and essential more than ever.",
            "review_date": "2016-12-08",
            "source": "rt"
        },
        {
            "content": "Jim Jarmusch's work can be either intimidating or off-putting, and in equal measure, to cinephiles because it feels so relaxed--almost as if it was a spur-of-the-moment, off-the-cuff precursor of reality-TV, an inside-joke with everyone involved slipping a nod and a wink, as if on a drunken dare, a mickey of JD passed back and forth along with a pack of Marlboros. This brought to mind many good memories of one of the oddest residents of The Criterion Collection: 'Fishing with John' (an exemplary and hilarious six-part mini-series in which John Lurie goes on fishing expeditions with five American cinematic greats, his partners-in-crime here, Jarmusch and Tom Waits amongst them; one that I'd love to see both get a blu upgrade as well as more episodes, now 25 years later). Also, clearly Jarmusch had a fine rapport with his actors, for this is by far the best and most restrained work I have ever seen from Roberto Benigni.\n\nOne of Jarmusch's more atypical films, 'Ghost Dog: The Way of the Samurai', is still my personal favourite, but this is right up there alongside. It would also make an intriguing double-bill with Jeff Nichols' stellar, though more serious in tone, recent film, 'Mud'.",
            "review_date": "2016-09-22",
            "source": "rt"
        },
        {
            "content": "Entertaining character study. May need to watch 3-4 more times to give it a higher rating.",
            "review_date": "2016-08-01",
            "source": "rt"
        },
        {
            "content": "A flat out good film, perfect for any film lover.",
            "review_date": "2016-04-11",
            "source": "rt"
        },
        {
            "content": "America's introduction to the maniacally brilliant Roberto Benigni! A wonderful cast , great soundtrack and beautifully captured in B & W. Another great film set in the Big Easy.",
            "review_date": "2015-12-21",
            "source": "rt"
        },
        {
            "content": "Jarmusch's film about the incarceration and unlikely friendship of three men is a disarmingly funny tale about loneliness and the lies we tell ourselves. The title itself is false, something these three convince themselves of so they don't have to take responsibility for their actions. Lynch-ian surrealism and striking humanity all rolled into one.",
            "review_date": "2015-12-18",
            "source": "rt"
        },
        {
            "content": "Jim Jarmusch's characters are always small and trivial, but what they do and encounter could touch your soul deeply. Great opening song performed by Tom Waits.",
            "review_date": "2015-12-15",
            "source": "rt"
        },
        {
            "content": "Coming across, as many Jarmusch films do, as a lengthy series of character sketches rather than a traditionally narrative film, Down By Law doesn't work quite as well as some of his other works, but there is plenty here for the Jarmusch fan and the more general film buff to enjoy, even if that enjoyment is somewhat lightweight.",
            "review_date": "2015-12-11",
            "source": "rt"
        },
        {
            "content": "quietly observed and beautifully photographed\nthere's no silence like a jarmusch silence",
            "review_date": "2015-10-09",
            "source": "rt"
        },
        {
            "content": "Down By Law is another great Jim Jarmusch film. Like the others, you are either going to feel the vibe or you won't. I find myself agreeing with many of the negative reviews -- sometimes the acting feels ad-libbed, sometimes it does feel like it has a student film quality to it, sometimes it does not end up so cool as it wants to be. But then again, so what? The film has an authenticity to it and many great little moments that would probably not be in it if the cast and crew were not going for it. Down By Law is an all-time great comedy adventure.",
            "review_date": "2015-09-30",
            "source": "rt"
        },
        {
            "content": "This dry, deadpan comedy plays like a noir fairytale, filmed with tremendous finesse. Jarmusch's unique model of the stylish slow-burner delivers an honesty I haven't seen before. His films have mystique, charisma and a breezy pathos that's more powerful than it seems.",
            "review_date": "2015-08-20",
            "source": "rt"
        },
        {
            "content": "Jim Jarmusch's great movie has taken on a new level of importance in the past decade. Not that it wasn't important upon it's initial release. It was. I skipped a day of school and drove my beat-up old Buick to Houston to see an afternoon screening. It felt so vital and new. This was my first Jamusch movie. And what a movie it was. \n\nThere is a great difference in seeing this movie through the eyes of an 18 year old and the eyes of a thirty-something --- and an even greater difference viewing it thru the eyes of a fourth-something. Each viewing is rewarding, but age and the passing of time bring this simple, low-budget movie a far deeper level of meaning. Add in the aftermath of Katrina, this is an important portrait of a New Orleans long gone. \n\nJohn Lurie, Tom Waits and Roberto Benigni (before I found him annoying) are perfectly cast as fictional versions of themselves. Ellen Barkin shows up as well. This is a young Barkin who is already far more talented than her age would suggest. \n\nI remember thinking it funny as she tossed our poor Zack's possessions out the window of their grubby and yet impossibly cool apartment. In my thirties I was in pain for Tom Wait's character. He only has a few things and what she tosses out that window are priceless. \n\nThe New Orleans we see was all too familiar to me in 1986. I was bored of South-east Texas and of Louisiana. I wanted out. Back then, New Orleans seemed dangerous and dirty. \n\nI knew Tom Waits as a cool singer/songwriter who had long been creating experimental twists on the blues and jazz. He had dumped Rickie Lee Jones and inspired her to create an entire iconic album. I didn't know who John Lurie was, but he seemed tough and cool. Benigni was a harmless clown. \n\nAs these three \"true\" characters find themselves stuck in a jail cell the naturalistic charm and humor comes to full bloom. We follow them on a simple escape. Now fugitives, we see them argue, bond and joined together as outsiders. \n\nThe film rambles it's way to an ending that is as satisfying as it is kind of sad and unsure. Jim Jarmusch is an essential filmmaker. Over the years his eccentricities sometimes veer far deeply into his \"hipster cool\" -- this, for me, remains his best cinematic moment. \n\nSomewhere in my mind, these three men are still sulking, joking and sliding through their lives. Lives that are far more meaningful that surface view allows.",
            "review_date": "2015-07-29",
            "source": "rt"
        },
        {
            "content": "The chemistry between the three main characters carries the movie, with plenty of slapstick moments throughout. Great cinematography as well.",
            "review_date": "2015-03-15",
            "source": "rt"
        },
        {
            "content": "Good director's vision.",
            "review_date": "2015-01-13",
            "source": "rt"
        },
        {
            "content": "This is a Jim Jarmusch classic!.If you havent seen a Jarmusch film this is a perfect one to start with.It delivers us a unique and impressive story about three men who simply were never cut out for prison.This is possibly Jarmusch's most straightforward piece of work as theres no odd philosophy behind it.We can experience joy,laughter and entertainment while watching this film.Every Jarmusch fan should see it!",
            "review_date": "2014-08-30",
            "source": "rt"
        },
        {
            "content": "Down by Law [1986] a film shot in black and white, yet is more vibrant than many other films in colour. 7/10",
            "review_date": "2014-06-14",
            "source": "rt"
        },
        {
            "content": "A pimp, a dj, & a card cheat walk into a prison, all apparently innocent of their crimes. Then this prison break film transforms into a strange buddy film thru the louisiana swampland, only to have our trio splinter in the end.",
            "review_date": "2014-05-19",
            "source": "rt"
        },
        {
            "content": "Jim Jarmusch's work can be either intimidating or off-putting, and in equal measure, to cinephiles because it feels so relaxed--almost as if it was a spur-of-the-moment, off-the-cuff precursor of reality-TV, an inside-joke with everyone involved slipping a nod and a wink, as if on a drunken dare, a mickey of JD passed back and forth along with a pack of Marlboros. This brought to mind many good memories of one of the oddest residents of The Criterion Collection: 'Fishing with John' (an exemplary and hilarious six-part mini-series in which John Lurie goes on fishing expeditions with five American cinematic greats, his partners-in-crime here, Jarmusch and Tom Waits amongst them; one that I'd love to see both get a blu upgrade as well as more episodes, now 25 years later). Also, clearly Jarmusch had a fine rapport with his actors, for this is by far the best and most restrained work I have ever seen from Roberto Benigni.\n\nOne of Jarmusch's more atypical films, 'Ghost Dog: The Way of the Samurai', is still my personal favourite, but this is right up there alongside. It would also make an intriguing double-bill with Jeff Nichols' stellar, though more serious in tone, recent film, 'Mud'.",
            "review_date": "2014-05-09",
            "source": "rt"
        },
        {
            "content": "Three convicts together in a very unlikely scape. A special sense of humor.",
            "review_date": "2014-05-05",
            "source": "rt"
        },
        {
            "content": "Jim Jarmusch is a master at independent cinema.",
            "review_date": "2014-04-22",
            "source": "rt"
        },
        {
            "content": "The film mainly relies on the actors' performances which are really good. Nice photography too.",
            "review_date": "2014-04-21",
            "source": "rt"
        },
        {
            "content": "Any Jim Jarmusch film that boasts the talents of excellent actor Roberto Benigni is a film that I can't miss.\n\nLike with many Jim Jarmusch films, Down by Law is an example of a film that takes place in a very small setting and has the importance of the story rest on the complicated characters involved with each other. Yet surprisingly after taking the time to make the characters interesting and establish the complicated relationship between them, he moves them from prison on a journey for escape. The film is a large step up from Jim Jarmusch's previous effort Stranger than Paradise because the journey the characters take is a significantly more interesting one.\nWhile the slow pacing in Down by Law and lack of big dramatic events may disappoint some viewers, the gentle movement of the story in Down by Law is iconic of Jim Jarmusch's film style. It is a film about characters, and not about events. And while admittedly I felt that the effect of this was occasionally dull as well, I had an appreciation for Jim Jarmusch's film style and could sit back and relax while the events unfolded around the characters in Down by Law.\nAlthough the characters are the most important aspect in Down by Law, the scenery of the film is great because it produces an interesting setting for the story to wade through, shifting from prison into an escape and the locations the characters progress through. And all against the black and white colour palette of the film which in its own way symbolizes the way that the characters in the film view the world in a very simple black and white manner. Down by Law's simplicity and gentle atmosphere combined with its visual style of black and white and still cinematography reminds audiences of the older films that chronicled similar themes using the now dated form of technical storytelling that can be looked back on. Down by Law's simplistic style reveals Jim Jarmusch's passion for the older film style which he brings out through his means of independent filmmaking, and it is a bold and ambitious move which is a very admirable one.\nDown by Law also boasts a strong script. By capturing the real humanistic language of its characters as they are stripped down to the bare nature of them as men, we are given a look into their souls and establish their differences which gradually become the source of how they take different approaches to complicated situations and develop conflict. Essentially, there is a lot of complex humanism that comes from the relationships between the three protagonists in Down by Law, and Jim Jarmusch's intelligent and thought provoking writing style establishes strong figures for the cast to work with.\nTom Waits' lead performance is great. Most of the time in Down by Law, Tom Waits is a very stoic figure who doesn't say too much and allows the majority of the emotion to simply come from his facial gestures. He doesn't talk his way out of things, he silently sits them out which causes audiences to really wonder just what is going on in his head. It is a question that nobody can answer because the characters is very complicated, and Tom Waits' strong performance suggests that he spends the film trying to figure it out. His mere presence in the film alone is very appealing, but his performance manages to do a strong job and give Down by Law the appropriate lead character to explore the themes and dynamics as he comes to terms with them. Tom Waits gives a great performance in Down by Law.\nJohn Lurie's supporting performance is an effective one as well. Engaging with the surrounding cast in Down by Law very well, John Lurie manages to give a strong effort that reminds us how well he works with Jim Jarmusch again after their previous pairing. And while his performance doesn't stand out as much as the other cast members, his chemistry with Tom Waits is effective because it is easy to really see the dramatic tension going on between them which makes the rough edge of the film even more intense and effective. John Lurie handles his material well as one of the leads in Down by Law, and the result is a meaningful and effective performance.\nRoberto Benigni's presence in Down by Law is the source of most of the comedy. As his natural comedic charisma is excellently energetic in most films he stars in, it is no surprise that in Down by Law he is the main thing leaving audiences laughing. Roberto Bengini quickly and sharply says his lines with a natural charisma and his charm makes him embody the role perfectly. His interactions with both Tom Waits and John Lurie prove to lighten the mood and prevent it from descending into dull melodramatic territory which makes the atmosphere of Down by Law more enjoyable and enlightening. Roberto Benigini is an excellent cast member in Down by Law, and the scenes involving his chemistry with Nicoletta Braschi are always a nice touch.\nEllen Barkin's opening tirade in Down by Law is one of the best things she has ever done as an actress. She has a big name but hasn't done too much high profile stuff in the recent years, so it is good to see her working in small scale material such as Down by Law and putting her actual acting passion into the part even for only a brief amount of time is just terrific. She gives the drama of the story a good start with her brief performance, and she make a memorable presence in Down by Law.\n\nSo while Down by Law may have difficulties appealing to audiences who are not already familiar with Jim Jarmusch's iconic film style, its intelligently written screenplay, strong cast and simple story mostly make up for that and render it a fair step up for Jim Jarmusch's career as a writer and director of independent cinema.",
            "review_date": "2014-04-15",
            "source": "rt"
        },
        {
            "content": "Down By Law (1986) - 7\n\nA \"neo-Beat noir comedy\" by Jarmusch own words, I think it's an accurate description of this movie blessed with fabulous cinematography. In \"Down By Law\", Jarmusch shifts away from the minimalistic method employed in \"Stranger Than Paradise\" seeking to explore new ground of cinematic expression. Despite some common aspects between both works, \"Down By Law\" has a different imprint to its nature, the plot is given more emphasis, it's a bigger melting pot of ideas with high potential for a conceptually sophisticated and gratifying experience and it has more technical workmanship, especially in the editing department. The cinematography dressed by German Expressionism is very polished and beautiful, numerous deliciously comical and admirable moments abound, the camera work is, at times, brilliant and even evocative of other films, but in general \"Down By Law\" didn't seem a technically coherent work, it seemed just an outline of what it could actually come to be in my opinion. The cinematic heritage of \"Stranger Than Paradise\" is obvious: the deliberate choice of Black and White picture, the lame acting, the highlight of the comical side in human relations, the way music is employed. But while some technical aspects made a coherent qualitative shift (I say qualitative not in the sense of \"better\" but rather \"more appropriate\"), other aspects didn't follow suit and this distracted me quite a bit.\n\nFor example, the lame acting of the main characters which made so much sense in \"Stranger Than Paradise\" contrasts sharply with the relatively high-level of workmanship of other technical aspects in \"Down By Law\", I feel like it takes away from the potential of this movie. It basically comes down to the cinematography, editing and camera work, this aspects are so worked out that they sort of enhance the lame nature of the acting in a bad and distracting way, it makes it all look very artificial and inorganic, precisely the opposite of what the low-fi cinematography and minimalistic approach of the previous film did. It's as if \"Down By Law\"'s mise en scéne is too good for its own good, but I'd rather say it's the acting that doesn't fit well with the rest, it gives this movie an almost amateurish quality in my eyes. Roberto Benigni did pretty well in this movie, I'd say perfect, but Tom Waits and John Lurie seemed so dead and out of context in comparison... pretty bad because they're the other two main characters in a character-driven narrative. Seems like Jarmusch didn't care for this or even wanted it, well it didn't work for me, Lurie and specially Waits distracted too much and impoverished the experience. \"Stranger Than Paradise\" works much better because it's simpler and more consistent, it's closer to what I'd call a finished work, it provides a more authentic and immersive experience to me, even though nothing happens... because it makes sense as a whole. Bottom line being \"Down By Law\" is limited by its own (not that big) complexity which Jim Jarmusch didn't manage as well as the marvelous simplicity of \"Stranger Than Paradise\". So even though both movies have different premisses, I think it's case to say less is more.\n\nNotwithstanding I want to say that I like \"Down By Law\" very much, it's a beautiful and very funny movie capable of engaging and entertaining me despite all its technical inconsistencies/awkwardness... then again this might contribute to the charm of the work for other viewers, I guess it depends on perspective. I have somewhat ambiguous feelings towards this work which can either slide for the better or the worst. Despite all my qualms, I like this film and recommend it!",
            "review_date": "2014-04-06",
            "source": "rt"
        },
        {
            "content": "Definitely worth watching again!",
            "review_date": "2014-04-02",
            "source": "rt"
        },
        {
            "content": "This fantastic black and white independent comedy film by Jim Jarmusch is the story of three men who meet in a New Orleans prison and escape together.  Easily one of Jarmusch's best films, particularly of his earlier period, it benefits from having a stronger cast than either of his previous two efforts...John Lurie is a little better than he was in \"Stranger than Paradise\", and having Tom Waits and Roberto Benigni elevates things.  It is hilarious, particularly Benigni, and it has some good character interactions as well.  I can honestly say I enjoyed everything about this feature.",
            "review_date": "2014-03-25",
            "source": "rt"
        },
        {
            "content": "A funny, quirky and heavily stylized journey. Benigni is hilarious and the characters are so inviting that you would be dumb not to relate to them. One of Jarmusch's best films and one that had me fall in love with his work",
            "review_date": "2014-03-18",
            "source": "rt"
        },
        {
            "content": "It has style but not much entertaining.",
            "review_date": "2014-02-22",
            "source": "rt"
        },
        {
            "content": "Me quedé dormido cuatro veces, las conté. En \"Bajo el Peso de la Ley\"; Jarmusch exagera en su clásico ritmo lento pero seguro; pero tiene muchas cosas buenas. La historia, aunque no lleva a ningún lado (clásico de Jarmusch), es interesante, el personaje interpretado por Roberto Benigni es maravilloso, y muy acertado. Resumen: Es una película algo olvidable, un muy buen paso para Jarmusch pero tiene otras muchísimo mejores.",
            "review_date": "2013-12-06",
            "source": "rt"
        },
        {
            "content": "This is a movie about nothing and I loved every moment of it.",
            "review_date": "2013-10-07",
            "source": "rt"
        },
        {
            "content": "A true original that kind of grows on you.",
            "review_date": "2013-05-26",
            "source": "rt"
        },
        {
            "content": "The pacing of this film flows but makes jumps and in between everything we have amazing characterization. By the end of the film you want to see more of the characters. You dont want to see them go.",
            "review_date": "2013-04-17",
            "source": "rt"
        },
        {
            "content": "Down by Law is an impeccably crafted character study one three unique individuals, and the result will leave you rewarded and satisfied.",
            "review_date": "2013-04-01",
            "source": "rt"
        },
        {
            "content": "Pretty much perfect.",
            "review_date": "2013-03-24",
            "source": "rt"
        },
        {
            "content": "Begnigni saves this completely.",
            "review_date": "2013-02-20",
            "source": "rt"
        },
        {
            "content": "Down by Law is simplistic, but very engaging and emotionally rewarding.",
            "review_date": "2013-02-13",
            "source": "rt"
        },
        {
            "content": "Jim Jarmusch's filmography consists largely of peculiar characters, a slice of comedy and a little unconventional style, sometimes it works well but this was a shade too off beat.",
            "review_date": "2013-02-04",
            "source": "rt"
        },
        {
            "content": "This is the first Jarmusch directed movie I have watched, and what a way to be introduces to a very talented director. A simple story involving three men sent to a New Orleans prison, and eventually escaping into the swamps of the bayou.\r\n Almost everything works in this film. The small moments detailing the human relationship that can form between three men stuck in a tiny prison cell give rise to moments of laughter and heartache. Tom Waits and John Lurie are fantastic as Zack and Jack,and the film hits it peak with the introduction of Roberto (Roberto Benigni). The three actors form a chemisty that puts you right in the jail cell, and swamp, with them. \r\n The film also benefits from a great soundtrack performed by none other than Tom Waits.",
            "review_date": "2013-01-27",
            "source": "rt"
        },
        {
            "content": "It's a sad and beautiful world.",
            "review_date": "2013-01-20",
            "source": "rt"
        },
        {
            "content": "This and Mystery Train are my favorite Jarmusch movies. Structured very well and Waits, Lurie, and Benigni are awesome in this.",
            "review_date": "2013-01-11",
            "source": "rt"
        },
        {
            "content": "This is a very minimalist film, and it works so well because of it. The choice to film in black and white and slow camerawork makes for interesting shots of New Orleans and the Bayou, and the movie's often use of small, somewhat secluded venues for the characters increases feelings of comradery -- not that it needed any help; the three leads work off of each other wonderfully. The movie is also aided by the slow pace and fitting soundtrack as well.",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "Down by Law (1986) is a different approach to the Genre of \"escape-esque\" films. The beautifully developed characters that are created by Jarmusch can be seen as the main pilars on which this story coherently stands. Of course some parts of the movie seem a hard to believe, but it seems like this film is not about that as much as it emphasizes on the life enjoying attitude of Roberto who guides the other inmates to their freedom, physically and mentally. At the end everyone seems back on the right track in contrast to where everyone was at the beginning. \nThis picture is worth watching, just for the amazing performance by Roberto Benigni. Cinematography is partly very beautiful but gets quite tiring because it is so static throughout the scenes and rarely involves movement. \nAll in all this film can be recommended due to its message and performance by the lead but other than that it might not be the friday night movie to watch if you seek excitement or a deep motivational boost like usually escape movies give.",
            "review_date": "2012-11-14",
            "source": "rt"
        },
        {
            "content": "\"Down By Law\" is a lot slower and more distant than \"Stranger than Paradise\". Something is lacking in the characters that makes them pop with the usual angst that Jarmusch portrays in them. However there is a lot of good to take away from this one, it is artistically stunning and there are quite a few genuine moments where you get to know the characters well.",
            "review_date": "2012-11-12",
            "source": "rt"
        },
        {
            "content": "Tom Waits. Nothing more to be said",
            "review_date": "2012-11-01",
            "source": "rt"
        },
        {
            "content": "all the characters are very well written and all three actors truly justified their character",
            "review_date": "2012-10-20",
            "source": "rt"
        },
        {
            "content": "It's very slow pacing is definitely a choice by the Director and Editor, but it sometimes bogs down it's terrific ensemble cast.",
            "review_date": "2012-10-12",
            "source": "rt"
        },
        {
            "content": "Peculiar and engaging.  Tom Waits is a joy to watch",
            "review_date": "2012-10-04",
            "source": "rt"
        },
        {
            "content": "Droll, deliberate, slow paced, dreary and amazing. I love this film so much. Great writing, acting, cinematography, and music abounds. It features a very early performance from Roberto Benigi that is both heartbreaking and hilarious. Don't miss it but be patient. It's not exactly an action adventure film but a great a snail paced character study.",
            "review_date": "2012-09-11",
            "source": "rt"
        },
        {
            "content": "The fun never stops.\n\n-In 1986, Tom Waits was one of the sexiest men alive.",
            "review_date": "2012-09-10",
            "source": "rt"
        },
        {
            "content": "Easily in my top five favorites. Jarmusch proves is brilliance with this film. Must see for any fan of well written scripts and perfected cinematography.",
            "review_date": "2012-09-09",
            "source": "rt"
        },
        {
            "content": "Great movie , Roberto Benigni was amazing .",
            "review_date": "2012-09-03",
            "source": "rt"
        },
        {
            "content": "Odd tale with gorgeous cinematography. Benigni steals the show.",
            "review_date": "2012-08-31",
            "source": "rt"
        },
        {
            "content": "Pretty good! Though, it should go with out saying the \"I scream for ice scream\" scene is the pinnacle of the whole movie.",
            "review_date": "2012-08-27",
            "source": "rt"
        },
        {
            "content": "Waits, Lurie & Benigni...How could you possibly go wrong?",
            "review_date": "2012-08-27",
            "source": "rt"
        },
        {
            "content": "and i called it as NOIR!",
            "review_date": "2012-08-14",
            "source": "rt"
        },
        {
            "content": "Be careful porca madosca!",
            "review_date": "2012-08-05",
            "source": "rt"
        },
        {
            "content": "Such a fun film about three inmates that have an unusal bond.",
            "review_date": "2012-08-05",
            "source": "rt"
        },
        {
            "content": "Having seen only one other Jarmusch film (\"Dead Man\"), this was definitely in-family for what he creates in terms of style. Of course, Roberto Benigni really made the film for me, adding lots of entertainment to what would otherwise have been an extremely simplistic plot.",
            "review_date": "2012-08-03",
            "source": "rt"
        },
        {
            "content": "Very cool Indie film with twisted humor.",
            "review_date": "2012-07-23",
            "source": "rt"
        },
        {
            "content": "i scream,u scream,we all scream,for ice cream..!!dream cast..!!lov all 3..!!tom waits especially..!!",
            "review_date": "2012-07-23",
            "source": "rt"
        },
        {
            "content": "Beautiful cinematography narrarates this visual poem.\n\nIn contrast to the creative selection of focal points and movie magic employed to, say, transform Pittsburgh into Gotham City for \"The Dark Knight Rises\", \"Down by Law\" makes extensive use of long, panning sequences that makes no effort to conceal flaws inherent to the setting.  Pleasing visual symmetry is irregularly punctuated by signs of depravity, dilapidation and chaos; order and disorder, civilization and wilderness coexist without apparent contradiction.  \n\nThe unhurried pace of these shots might border on supercilious bluster, were they not so hypnotically captivating.   That the virgin beauty of the Louisiana bayou lends itself to such treatment is perhaps unsurprising.  Striking, however, is how seamlessly the same meandering cadence translates to backdrops of urban squalor.  \n\nLike a silent accomplice to Roberto Benigni's live-in-the moment character, these sequences eschew any quixotic concept of perfection, embracing instead the moment, the here and now; perceived flaws are inherently integral to beauty, not a diminishing element.  Valuing reality over introverted conceit is, not coincidently, the very lesson bequeathed to foward-looking Jack and backward-looking Zack by lighthearted, vivacious Roberto.  \"Bob Frost\", to say nothing of Walt Whitman, would approve wholeheartedly.",
            "review_date": "2012-07-19",
            "source": "rt"
        },
        {
            "content": "Bittersweet, nostalgic, discreetly funny.",
            "review_date": "2012-07-16",
            "source": "rt"
        },
        {
            "content": "An Americana punk-pulp classic.",
            "review_date": "2012-07-02",
            "source": "rt"
        },
        {
            "content": "9.5/10. One of my favorite prison films. Probably the most artistic. There is so much to complement with the cinematography. Anyway, I love how each scene is taken with long shots and the camera is just put in a place to observe everything that will happen during that scene, like a lot of great Jarmusch films. The film is more bold than Jarmusch's bleak style, but it's story is so enjoyable, that most audiences wouldn't notice. He tells the story with gliding past things that other writers would take time to think of something original. But, he just says \"These things don't matter in this film, so why try\". A prime example would be the prison escape. The reason that these things don't matter is because the film runs entire on the characters. Really, it completely does. That is the thing that people somewhat don't realize, is that the characters are what they are enjoying so much about this film. It's concept and way of it wanting to be told does limit the film to achieve the title of a masterpiece. But, it is a great as it could ever be. It is perfect for what it is.The best thing about this film is the way it builds up just for that one beautiful and meaningful shot.",
            "review_date": "2012-05-17",
            "source": "rt"
        },
        {
            "content": "One of the best movies I ever saw. The writing is REAL and great as in all of the Jim Jarmusch films I saw so far. The acting is great (especially Tom Waits). The black-and-white is perfect for the movie. Tom Waits' songs which was in the soundtrack was great (The opening scene with \"Jockey Full of Bourbon\" was great). I think that the dark humor in the movie concludes in the scene when Tom Waits' character is in a huge fight with his girlfriend and the only think that he cares about is his shoes.",
            "review_date": "2012-04-28",
            "source": "rt"
        },
        {
            "content": "\"Down by Law,\" a film by Jim Jarmusch probably would have been great if it weren't for the lackluster ending; in a way I am somewhat content with the last image of the movie, yet it still was unsatisfying. The opening of the film is extraordinary, with some of the most sweeping tracking shots you'll ever see juxtaposed with wonderful music by Tom Waits (\"Coffee and Cigarettes\"), who also stars in it, along with John Lurie (\"Stranger than Paradise\"), and Roberto Benigni. The mesmerizing black and white cinematography of the Louisiana Bayou, may be the best aspect about \"Down by Law.\"  The story centers on the three entirely different men, who meet in prison and decide to escape together.  Jarmusch isn't interested in the act of escaping itself, but more on what happens before and after. I actually have a difficult time knowing the motives behind his characters, if there are any. To sum it up, it obviously isn't his best work; it had little mishaps before the escape, but all in all a good picture with fine performances, plenty of laughs, great music, and it leaves you in wonder afterwards.\n\nMy ranking of the films I've seen of Jarmusch:\n1.\tDead Man (Great)\n2.\tGhost Dog: The Way of the Samurai (Great)\n3.\tBroken Flowers\n4.\tMystery Train\n5.    Stranger than Paradise\n5.\tDown by Law\n7.\tCoffee and Cigarettes (Only film I don't love)",
            "review_date": "2012-04-27",
            "source": "rt"
        },
        {
            "content": "Jim Jarmusch's second road movie featuring singer Tom Waits and Italian Roberto Benigni in his international debut was arguably even stronger than Paradise.",
            "review_date": "2012-04-24",
            "source": "rt"
        },
        {
            "content": "One of the best looking and also best films of all time. (Streaming on Hulu.)",
            "review_date": "2012-04-21",
            "source": "rt"
        },
        {
            "content": "If you went the whole movie without seeing the name of the director in the credits, you would still know this was a Jarmusch film. Great use of black & white, but Roberto Benigni - even with third billing - is the star. He makes this movie.",
            "review_date": "2012-04-16",
            "source": "rt"
        },
        {
            "content": "an amazingly good film by one mr. jarmusch. tom waits (one of my most favorite performers of all time) does a great job as well",
            "review_date": "2012-04-10",
            "source": "rt"
        },
        {
            "content": "probably jim jarmusch's finest film (dead man will always be a personal favourite). The cast is perfect, tom waits does his gravely dead-beat persona with true believability and Robert  Benigni is funny as hell. But the real star is jarmusch. His ability to make feel like the fourth member of the party makes this an intimate and emotional affair.",
            "review_date": "2012-04-04",
            "source": "rt"
        },
        {
            "content": "Tom Waits is my BIG favorite, as an actor and musician. Roberto Beningni is good as always in this one.",
            "review_date": "2012-03-01",
            "source": "rt"
        },
        {
            "content": "Vet egentligen inte om jag tyckte den var bra eller dÃ¥lig.",
            "review_date": "2012-01-29",
            "source": "rt"
        },
        {
            "content": "Possibly my favorite of Jarmusch's early works, though I know Mystery Train and Night On Earth will always give it a run for its money.\n\nThree very different men find themselves in jail in Louisiana together, build an amusing friendship despite their various quirks and foibles, then make an escape together, leading to more oddball adventures.\n\nWonderful film, crisp black and white photography, great characters, what more can you ask for?\n\nRecommended.",
            "review_date": "2012-01-10",
            "source": "rt"
        }
    ]
}