{
    "rating": 9.0,
    "release_date": "1986-05-09",
    "num_reviews": 30,
    "genres": [
        "Drama"
    ],
    "summary": "Alexander (Erland Josephson) is celebrating his birthday with family and friends when they receive some stunning news from the radio. World War III has erupted, and the end of the world is near. In order to avert the apocalypse, Alexander makes a bargain with God: He'll give up everything he values in life, including his beautiful home and beloved son (Tommy Kjellqvist). So, when Alexander awakens from this episode, as if from a dream, he sets about doing just that.",
    "reviews": [
        {
            "content": "Shot by cinematographer Sven Nykvist, an Ingmar Bergman mainstay, starring Erland Josephson, another Bergman regular, and shot in a remote area of Sweden, it's no wonder Andrei Tarkovsky's The Sacrifice looks and feels like a Bergman film.  Despite being one of Tarkovsky's lesser-known films, it is filled with complex themes and stark images, including the haunting climax, reminiscent of the burning house scene from Tarkovsky's earlier film, The Mirror.  The plot?  A small group of friends and family gather for a birthday celebration, only to discover via a radio announcement that WW3 has commenced and nuclear annihilation is imminent, forcing them to come to terms with their own mortality.  For those not familiar with Tarkovsky's work, be prepared for some lengthy but wildly effective shots, meticulous composition and plenty of philosophical musings.  Like all of Tarkovsky's work, it is brilliant throughout.",
            "review_date": "2022-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two outs, bottom of the ninth, and The Sacrifice scores: this was the last Tarkovsky feature film I had not seen, but it was the first to put me to sleep. I was worried it would never happen. \n\nI had to do a double-take initially because about half an hour in, The Sacrifice looked superficially like an Ingmar Bergman film, with a mildly dysfunctional family of bourgeoisie falling apart due to deep emotional problems, but a deeper look reveals classic Tarkovsky material - concerns with a world out of balance, the inherent weakness of human nature, and surreal imagery that calls to mind deeper questions about philosophy and the human psyche. With characters forced to reflect on their existences now that they are all in mortal danger from a threat that they cannot stop, Tarkovsky examines personal ambition and purpose set against the framework of a larger world that threatens to leave any one member behind (themes that may very well have been on the director's mind with his untimely cancer diagnosis); exasperated, regretful, and filled with new and strange purpose, our protagonists begin exhibiting unusual behavior in an attempt to refocus their perspectives that have quickly become painfully outdated. There are musings on Christianity (or more likely, any deity of choice), as one of perhaps many potentially valid spiritual constants that may each be true; the unknowability of it is key and terrifying. \n\nOne of the less immediately idiosyncratic films from the director from a thematic perspective, but visually much of Tarkovsky's talent remains on display, even without the need for a diverse range of distinctive setpieces. (4/5)",
            "review_date": "2022-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its slow and grueling pace, ominous and surreal atmosphere, and an ambiguous and minimalist narrative will not be suitable for some. However, its excellent performances, stunning cinematography, well-crafted production, religious and mystical allegories, stylish filmmaking, impressive visuals and complex themes make it a powerful and rewarding watch, and a fitting farewell for the legendary Andrei Tarkovsky.",
            "review_date": "2021-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful film.  Visually poetic.",
            "review_date": "2021-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful, although long and slow.",
            "review_date": "2020-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The cinematography of the film is sublime, as is usual with Tarkovsky.  The film's message was hot garbage though.  The film entirely enraptured my attention; I even enjoyed the philosophic banter.  That is, until the scene where Alexander's friend Otto, comes up with a plan to avert the consequences of WWIII and save the entire world.  Simply, he must fuck his witchy servant girl named Maria (the virgin Mary lol).  Apparently, the way to escape death, for old men, is to get their dick wet in much younger women and also destroy their connection to their family in the process.  I'm sure it was a huge sacrifice for the protagonist to sneak out and fuck his servant; way to take one for the team.  I do find it amusing that they had to shoot that burning house scene twice, rebuilding the entire thing, because Tarkovsky wouldn't listen to his cinematographer about having two cameras working at once.",
            "review_date": "2020-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On Of The Great Film In The World",
            "review_date": "2020-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as  Tarkovsky's Soviet films, but a must see nevertheless.",
            "review_date": "2018-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Admittedly, I have a limited experience with Andrei Tarkovsky, but both of his films that I’ve seen have been frustrating to watch. I had some hope for The Sacrifice because I was told it actually has a plot with some progression. Yet it takes forever to get that plot in motion, and once you’re there it moves at a snail’s pace. Tarkovsky relishes slow-moving shots, tons of philosophical speeches, and setting the camera approximately 3 miles away from the characters so we can just sit and stare at a lot of dead space while the actors roam through it. The tedium of watching a film that is captured in this way is hard to describe. Even when there is a semblance of plot it doesn’t make any sense. I don’t understand the actions of the characters, and I couldn’t care less about what happens to them because no one has a personality. Perhaps that is the biggest failing for me in The Sacrifice, that we are kept at such a distance from the characters (literally and figuratively) that their story becomes boring by default. I can deal with some slower paced movies because I’m invested in strong characters, and enjoying good performances, but Tarkovsky denies me those things and forces me to just sit and wait for something to happen despite the fact that he hasn’t made me care about who is affected by what happens. There were moments where The Sacrifice almost broke through and got me interested, but then it would make the oddest choices and I’d find myself annoyed again. I think I’ll do my best to avoid all other Tarkovsky films, and I’d probably suggest most other people do likewise.",
            "review_date": "2017-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The final sublime philosophical tale from Andrey Tarkovsky, riveting and brilliant. Themes of all films of Tarkovsky are metaphysical not excluding this one. You can ponder over these themes for a very long time after you have watched this film, for they are timeless.",
            "review_date": "2017-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love how Tarkovsky's movies are like these meditative pieces of art. He was always so patient and graceful with his camera movements. Wherever that seaside town is, it's beautiful. Very calm. Andrei was a very introspective and philosophical guy and here in this movie you can see it clear as day. His movies are always deeper than what's really on the surface. Always talking about life, death, the meaning of life, being born again, love. \n\nQuite the monologue that old man gives. Talking about how civilization and progress has been built on acts of doing evil instead of good. This almost seems like it's a movie about ghosts living in the present world. That one girl, Maria, looks like she's a Holocaust survivor. She almost looks like she could be a ghost. There's moments that are very unsettling whether it's the mood and atmosphere that's being created or the subject material that being presented. And sometimes both at the same time. Like with the little boy sleeping in his bed. \n\nThe use of greyscale in the movie makes it very haunting to watch at times. Gives the impression that these people are ghosts roaming on land but have no idea that they are in fact ghosts and are dead. The pacing of the movie can be off-putting. And more so are the characters movements and pace. It's almost like they're detached or aren't human. It's a very gloomy and somber movie. That bitch started acting all hysterical and crazy. I'd knock that bitch right out, make her calm down. \n\nThis movie is a trip. Tarkovsky's use of sound is brilliant. The use of water and dripping. So is Maria like the virgin Mary from the bible? \n\nI've always found fire so fascinating and captivating. Like being something burn and how quickly it does it and how it ca spread so easily. It's a very uncontrollable element. Both dangerous but beautiful all at the same time. I think thought the same thing the way he's always filming fire in a poetic way. \n\nDeeeeeeeeefinitely an art film. I couldn't help but feel like it was a film made by Bergman. Especially with all the Swedish dialogue and actors. Overall, it was a very interesting movie to watch even with it's slow pace.",
            "review_date": "2017-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you love art films you will certainly like Tarkovsky's work and this is as good as it gets.",
            "review_date": "2017-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Sacrifice is a majestic spiritual achievement that relies on its fluid rhythm to transcend rationality and climax of its rather ambiguous story.",
            "review_date": "2016-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best enjoyed on a rainy morning",
            "review_date": "2016-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Masterpiece.  A deeply perturbing and unfulfilled extrapolation of te illogicalities of our modern world in which we never see the contradictions of our existence, because we never have to face up to them  But what if we did?  What would WE do?",
            "review_date": "2016-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have to confess that I am nowhere close to understanding it. It is long, slow, and thoughtful. The main character is no hero, though we sympathize with him. Tarkovsky's vision is brave enough to be interpreted through the lense of failed and confused characters. What is this film about? The consequence of taking one's happiness for granted, the power of ritual, the fantasy of art's importance? We are given no clear answers. The blu ray I watched was not well mastered and the sound was especially compromised. It is a shame, as sound is an area that Tarkovsky films rely on heavily. I far preferred Nostalghia and Solaris which I feel are similar, both captured the surrealism of the dream state in a more convincing manner.",
            "review_date": "2016-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I appreciated it. But I just found it dull and hard to watch.",
            "review_date": "2015-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Sacrifice is the most beautiful Tarkovsky film from the opening image to it close. Sven Nykvist, the cinematographer, should be very familiar to fans of Swedish cinema as he was one of Bergman's go to directors of photography. You will not be disappointed if you are looking for a visually perfect film. You will be disappointed if you want a film that spoon feeds you its themes. I highly recommend this film if only for the visuals at the climax of the film.",
            "review_date": "2015-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's hard to decide whether it's good or not. For one thing, the cinematography, the philosophy and the performance are perfect. For the other, it's so unbearably boring...",
            "review_date": "2015-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good the first time I watched it. But the second time it totally tore me up. A masterpiece.",
            "review_date": "2015-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harrowing, gorgeous, and nearly impenetrable, \"The Sacrifice\" may be a film that requires multiple viewings for complete comprehension but the artistry on display is discernible immediately.",
            "review_date": "2015-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Man, that Andrei Tarkovsky. He was something else, wasn't he? This is the third film I've seen of his, and he's definitely hard to mistake for anyone else. This film really takes the whole arty-European-long-take thing about as far as it can possibly go. It was meant as a sort of farewell film for Tarkovsky, who died shortly after completing it. There's definitely a mournful air to the entire film. The story is about a few people living on an island off the coast of Sweden who gather for a birthday party, and then are told that nuclear armageddon will end all life on earth within the next few hours. I don't want to spoil the ending, but it definitely leaves a lot of room for interesting interpretation. This film isn't quite as striking or memorable as Solaris or Stalker, but its hard-nosed aesthetic and philosophical dignity is unassailable.",
            "review_date": "2015-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good film. very strange. difficult to interpret. i found myself getting lost between thinking about what something might mean and then getting involved with a scene. the cinematography is beautiful, reminding me of Bergman (it's in Swedish). perhaps it's a parable. themes of death and fear of death, faith, and courage.",
            "review_date": "2015-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The final film of Andrei Tarkovsky is an austere film of both great beauty and great terror, and a formidable swan song for the reputed director. Despite's it's backdrop to nuclear holocaust, Tarkovsky strays his story away from the then still-ongoing cold war, and instead uses this plot device to explore the mind-set of it's protagonist. It's appropriately a film about aging and accepting death, which is communicated through Tarkovsky's haunting nuances and prolonged tracking shots. It's also one of the few films in the director's catalog that really uses dialogue to add to the tapestry as well, as the characters musings on philosophy, religion and humanity make the theme of The Sacrifice more lucid, without directly spoon-feeding the audience either. Perhaps not Tarkovsky's most notable masterpiece, but it was the ideal film for him to go out on.",
            "review_date": "2014-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thought the narrative is littered with confusion and the film can be interpreted a few different ways, the imagery and prescient themes make Tarkovsky's last film glorious. I was also surprised just how tense the film got when the news of WWIII broke out. It is also at this point that the film becomes very dreamlike. A beautiful, haunting parable that could only come from the master Tarkovsky.",
            "review_date": "2014-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully shot and intimate vision of spiritual-awakening, it is also so slowly paced one could claim it is \"hypnotic\" or \"boring\" and it would be hard to disagree with either perspective. Most likely for hardcore Tarkovsky fans only. But, the artistry should never be questioned.",
            "review_date": "2014-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The definition of the Sublime. Unbelievabel masterpiece.",
            "review_date": "2014-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At a birthday celebration so dour it makes Abigail's Party look like an episode of My Family, a group of friends and their postman amble around in big spaces and philosophise on the nature of truth and reality; then a bucket of milk falls off a shelf, nuclear war is announced on the telly, someone takes off her clothes and stands behind some wood, and God makes the world not end because He can do that, but only if tortured retired actors pray in a request and burn down the family house.",
            "review_date": "2014-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Andrei Tarkovsky's final film before his death and also one of his most beautiful, the principal flaw, with most Tarkovsky films, is the outlandish offbeat script. The first half of this film is almost impeccable, offering interesting plot points and beautiful beautiful shots. And yet the second half goes way off the rails, devoiding itself of the serious tone established by the first half. It's saving grace is the expertly crafted direction and excellent acting. Not his best, but a sizable strength to Tarkovsky's resume. 4/5",
            "review_date": "2014-07-16",
            "source": "rt",
            "lang": "en"
        }
    ]
}