{
  "title": "The Last Picture Show",
  "rating": 8.3,
  "release_date": "1971-10-22",
  "genre": [
    "Drama"
  ],
  "summary": "In 1951, a group of high schoolers come of age in a bleak, isolated, atrophied West Texas town that is slowly dying, both culturally and economically.",
  "critic_reviews": [
    "Director Bogdanovich has achieved a tactile sense of time and place. More, he has performed that most difficult of all cinematic feats: he has made ennui fascinating. Together, that is enough to herald him as possibly the most exciting new director in America today.",
    "It's meant to make you feel sad for what's lost, but a vitality throbs through it.",
    "A worthy tribute to Bogdanovich's idols, Orson Welles and John Ford.",
    "Using period songs and decor to create nostalgia is familiar enough, but to tunnel down to the visual level and get that right, too, and in a way that will affect audiences even if they aren't aware how, is one hell of a directing accomplishment.",
    "Peter Bogdanovich's 1971 ode to a Texan small town is still a masterpiece whichever way you look at it.",
    "Delineates the quiet, desperate lives of the citizens of Anarene, Texas over the course of one year in the early 1950s.",
    "Ben Johnson and Cloris Leachman won Oscars, but the work of Eileen Brennan and Timothy Bottoms is even more cherishable.",
    "The scene  where Sam imparts his wisdom to young buck Bottoms may be the saddest, loveliest moment in 1970s American cinema. And that’s saying something.",
    "Bogdanovich's finest effort; bleak and beguiling.",
    "Peter Bogdanovich's fine second film, The Last Picture Show, adapted from Larry McMurtry's novel by McMurtry and Bogdanovich, has the effect of a lovely, leisurely, horizontal pan-shot across the life of Anarene, Tex., a small, shabby town on a plain so flat that to raise the eye even 10 degrees would be to see only an endless sky.",
    "Notre Dame professor Edward Fischer has said that the best films, like the best books, tell how it is to be human under certain circumstances. Larry McMurtry did a beautiful job of this in his small novel (which he transferred to the screen), The Last Picture Show.",
    "It's a snapshot of a small Texas town in the 1950s that's ostensibly filled with bighearted, god-fearing real Americans. But this exceedingly sad film spits in the eye of such homespun niceties: This is an Eisenhower-era world riddled with directionless teens, bored housewives and disenfranchised citizens who can't escape the futility around them.",
    "Bogdanovichs perfect recreation of the sense of time and place, and his ability to mix wit with poignancy that make this such a charming, timeless film.",
    "It's an intimate psychological story laced with references to Hollywood movies.",
    "It’s plain and uncondescending in its re-creation of what it means to be a high-school athlete, of what a country dance hall is like, of the necking in cars and movie houses, and of the desolation that follows high-school graduation."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "An unflinchingly honest, raw and saddening tale of adolescent existentialism, generational relations and the pitfalls of the American small town, \"The Last Picture Show\" is a thematically resonant tentpole of the New Hollywood movement, yetAn unflinchingly honest, raw and saddening tale of adolescent existentialism, generational relations and the pitfalls of the American small town, \"The Last Picture Show\" is a thematically resonant tentpole of the New Hollywood movement, yet one I still regard as a fitting testament to the notion that a movie can't succeed on thematic resonance alone. Granted, there's more at work here beyond that, it's still impossible to deny that all other elements take a back seat to the overall subtext at work. With this in mind, no single component takes more of a hit than the pacing. Combined with the fact that this is already a relatively quiet and subtle experience for most of its running time anyway, \"The Last Picture Show's\" deliberate cadence will be sure to try the patience of at least some viewers. When all is said and done, though, I'm also sure there'll be some sort of ethical/psychological/sociological kernel of knowledge that everyone will take away from the experience.",
      "review_date": "2020-04-23"
    },
    {
      "review_title": null,
      "content": "This slow paced drama uses its superb ensemble cast well focusing primarily on the story of a young man navigating his small town life as he begins a sexual relationship with a middle aged married woman. There are some great plot points butThis slow paced drama uses its superb ensemble cast well focusing primarily on the story of a young man navigating his small town life as he begins a sexual relationship with a middle aged married woman. There are some great plot points but the slow paced dry direction and black and white photography did little to draw me into the world. Worth a watch just for the cast.",
      "review_date": "2023-02-19"
    },
    {
      "review_title": null,
      "content": "It really worked out for me until it's last third, when the pace starts to drag and you lose interest as Duane and Jacy hardly appear on screen. Some great performances and writing. Cybill Shepherd is a goddess.",
      "review_date": "2022-07-31"
    },
    {
      "review_title": null,
      "content": "A fabulous example of taking a two hour film and making it feel like we are visitors who have been transported to another place and time; a time which encompasses the span of several months without any dull character developments.  TheA fabulous example of taking a two hour film and making it feel like we are visitors who have been transported to another place and time; a time which encompasses the span of several months without any dull character developments.  The cinematography is spot-on gorgeous.",
      "review_date": "2021-08-21"
    }
  ],
  "num_reviews": 19
}