{
  "title": "Bats",
  "rating": 7.4,
  "release_date": "1999-10-22",
  "genre": [
    "Thriller",
    "Horror"
  ],
  "summary": "Swarms of genetically altered bats blaze a path of terror through a sleepy Texas town. The only hope to stop the growing tide of devastation is a zoologist who studies bats (Meyer), her assistant (Leon), and the local sheriff (Phillips).  (Destination Films)",
  "critic_reviews": [
    "Smoothly maneuvering within the limitations of genre conventions, Bats emerges as a vigorously paced and surprisingly satisfying piece of work.",
    "Perfect late-summer drive-in fare.",
    "The kind of rote schlocker that rarely makes it to big screens anymore.",
    "Overlong, hard look at the perils of tampering with Creation.",
    "A straight-faced throwback to the glory days of mutant wildlife on the rampage.",
    "Unfortunately, it isn't until the final scene -- a spoof of the horror genre's false-ending cliché -- that Bats really takes wing.",
    "So uninvolving it scarcely matters what it looks like.",
    "Pours on some of the most ridiculous dialogue heard in a feature film in a long time.",
    "So campy...may be good for a few laughs.",
    "Falls apart immediately, then limps on for 45 minutes more.",
    "A reassuring little cheeseball of a movie.",
    "Violent and vapid, but the visual jolts may please horror buffs.",
    "Cause for fright in only one respect: the possibility that it could spawn sequels.",
    "A work of hilarious, nearly Ed Wood-worthy ineptitude.",
    "Hopeless rip-off of Hitchcock's \"The Birds.\"",
    "An amazing compendium of dumb behavior, bad dialogue, and incoherent direction.",
    "All I saw were unimpressive digital effects; artless, quick-cut abstracted gore; and a last-ditch attempt to evoke a visceral response by heaping the climactic scene with bat shit.",
    "It's relentlessly bad in a way that just makes those theatre seats plain uncomfortable."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nSome actors in the film, such as Dina Meyer, Ironically suffer from chiroptophobia or fear of bats. They were repulsed by the puppets and animatronics.",
      "review_date": "2021-04-07"
    },
    {
      "review_title": null,
      "content": "At the beginning of 1999, Destination Films opened its doors and was looking for a picture for a Halloween release. Bats was the company's first feature film.",
      "review_date": "2021-04-14"
    },
    {
      "review_title": null,
      "content": "The production of the film had been planned to film the film in Mexico, where it would be much cheaper and cheaper to give a good profit to the budget but finally it was decided to film the film in the United States.",
      "review_date": "2021-04-16"
    },
    {
      "review_title": null,
      "content": "asdfhhkhlmnbvcxzqwteruyiotmzosmdkcmokplgkjsowmdkdookkwerkkfoucmmvmfjhssjwjwkmkkoollkkkkf",
      "review_date": "2021-04-18"
    },
    {
      "review_title": null,
      "content": "《》《》《》《》《》《》《》《《《《《》《》《》《》《》《》《》《》《▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪",
      "review_date": "2021-04-25"
    },
    {
      "review_title": null,
      "content": "This movie is a real gem...no I take that back it is a (Lou) Diamond (Phillips)! As always The Diamond brings his \"A\" game to the role and owns it. He puts on that oversized sherriffs hat and you think WOW did he quit acting and take on a a This movie is a real gem...no I take that back it is a (Lou) Diamond (Phillips)! As always The Diamond brings his \"A\" game to the role and owns it. He puts on that oversized sherriffs hat and you think WOW did he quit acting and take on a a life of crime fighting. This is a must watch for anybody who wants to see a bunch of bats get handed some Texas justice Diamond style!",
      "review_date": "2008-01-27"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nAudio/visual unsynchronised Laser and inkjet printers do not make the noise of a noisy dot matrix printer.",
      "review_date": "2021-04-27"
    },
    {
      "review_title": null,
      "content": "looggugjgjhihihihihihihihu,.,.,.,?!,,.,,,,:;:^:;:;;:;;;\"@#$$%^&$$^&*()()€£/=÷÷×+×÷=☆⊙°¤¤《¡¿¿¤••°°♡◇♧♧♡♤♤■●▪○□■♤{}[]~°°",
      "review_date": "2021-05-04"
    },
    {
      "review_title": null,
      "content": "{}{}{}{}{}{}{}{}{}{}{}{}{}{}[][][][][][][][][][][][][][]》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》",
      "review_date": "2021-05-16"
    },
    {
      "review_title": null,
      "content": "$$$$$$$$$$$$$$$$$$$$$$$$$•••••••••••••••••••••••••••••••☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆",
      "review_date": "2021-05-17"
    },
    {
      "review_title": null,
      "content": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$",
      "review_date": "2021-05-18"
    },
    {
      "review_title": null,
      "content": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■",
      "review_date": "2021-06-07"
    }
  ],
  "num_reviews": 30
}