{
  "title": "Run Lola Run",
  "rating": 8.5,
  "release_date": "1999-06-18",
  "genre": [
    "Thriller",
    "Crime"
  ],
  "summary": "In a breathtaking race against the clock, a young woman has 20 minutes to find 100,000 marks or her boyfriend will be killed.",
  "critic_reviews": [
    "Fabulously kinetic.",
    "Tykwer's style gives the movie an explosive energy that never quits, marking him as the most ingenious new talent to hail from Germany in ages.",
    "As essential in its own way as Anton Karas' celebrated zither work was to \"The Third Man,\" Lola's music is perfectly suited to the film's aims and just about addictive in its throbbing, insinuating rhythms.",
    "An existential chain reaction, yet as remarkable as his cinematic gamesmanship is the way that he traces the anatomy of feeling in Lola.",
    "I can't rave about this film enough -- this is passionate filmmaking at its best. One of the best foreign films, heck, one of the best films I have seen this year -- go see it!",
    "The formula has rarely been done as well as it is in this goofy, audacious, visually stylized omnibus of what-ifs that operates on its own peculiar logic, and powers along with the force of a truck on the Autobahn.",
    "A highly accomplished, compact feature, which, while it may be light on depth, is rich in humor, rhythm, energy and inventiveness.",
    "A movie that really zips along; it offers some of the same pleasures as the silent slapstick comedies, particularly the Keaton films, with their sense of how sheer velocity carries its own wit.",
    "With her Doc Martens and her spiky, fire-engine hair, Franka Potente makes a perfect Lola. Like the film itself, her tough, flashy exterior cloaks a warm emotional center.",
    "A knock-down, haywire ballad of the adrenalinization of love and despair.",
    "Has as much depth as it has energy and action.",
    "The film's extra-special trick, the one that kicks in under your radar because it's so busy with all the flash, is that it makes you care deeply for Lola and Manni.",
    "Tykwer deliberately blows away all traces of the mundane and the familiar, so that not even the closing credit crawl moves in the expected way.",
    "Wisely, Run Lola Run lasts something under 80 minutes; any longer, and it would have been as exhausting and boring as a half-hour Donna Summer track.",
    "It's both fractured and fluid, with a helter-skelter syntax and a ceaselessly infectious backbeat. Beyond that, it's a blast.",
    "It doesn’t add up to much, which is part of the point as well as the fun, but what makes the film noteworthy is its pure pop adrenaline.",
    "The rush subsides, however, the minute the movie ends, and leaves the viewer with the faint aftertaste of a processed sugar high.",
    "The action is so fast that the viewer almost breaks out in a sweat...Ultimately vapid. Lola never does develop as a character, and the fuss seems ultimately pointless.",
    "I would not want to see a sequel to the film, and at 81 minutes it isn't a second too short, but what it does, it does cheerfully, with great energy, and very well.",
    "Fun, fun, fun. Take the title at its word, because this movie is nothing less than a flat-out, lung-pumping, 76-minute sprint.",
    "Potente pumps strong and true from the first frame to the last.",
    "An enjoyably glib and refreshingly terse exercise in big beat and constant motion.",
    "Invigorating and annoying, Lola could use a dose of Ritalin. Best to take this 76-minute riff on alternate destinies as an antidote to Europe's minimalist art-house cinema and to enjoy Potente's sweaty radiance.",
    "May be all Eurotrash flash, but it's not often that a film packs this much visceral punch.",
    "About as entertaining as a no-brainer can be--a lot more fun, for my money, than a cornball theme-park ride like \"Speed,\" and every bit as fast moving. But don't expect much of an aftertaste.",
    "Kind of like watching a John Waters film on fast forward with all the good parts cut out. It's empty of charm and meaning, but it certainly kills time, for those who wish it dead."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "How not to love this movie? It is one of my favourite movie's ever! It is vibrant, the energy is contagious, and you cannot stop watching because every minute is precious. I totally adored the mix between real people and cartoon. This is aHow not to love this movie? It is one of my favourite movie's ever! It is vibrant, the energy is contagious, and you cannot stop watching because every minute is precious. I totally adored the mix between real people and cartoon. This is a movie with style and soul! The story is different...engaging, and unpredictable! The ending is superb...! I couldn't ask for more. A movie that I could watch many times. In fact, the first time I watched it  I was at my friends's house we were so caught by it that between laughs and drinks we ended up watching it twice!",
      "review_date": "2012-01-19"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nqeeqweeretdsdtghokljkncgsretuguiohhojjookjoojkighojguihjodyrsweeqrwstcgjbohojyfdtghkkoteeh",
      "review_date": "2021-04-15"
    },
    {
      "review_title": null,
      "content": "How to solve a borderline situation in 20 minutes or less. The idea that intelligently combines video images, cartoons and electronic music went around the world in a style difficult to duplicate and that would surprise even the mostHow to solve a borderline situation in 20 minutes or less. The idea that intelligently combines video images, cartoons and electronic music went around the world in a style difficult to duplicate and that would surprise even the most skeptical. In its own right a classic from the 90s.",
      "review_date": "2021-04-29"
    },
    {
      "review_title": null,
      "content": "This is a pioneer movie in many aspect and it has a very emotional soundtrack",
      "review_date": "2019-08-01"
    },
    {
      "review_title": null,
      "content": "Run Lola Run contains about 1,581 transitions (edits, dissolves, fades, wipes, etc) in 71 minutes of action (i.e. excluding the credits, and pre-credits sequence). This equates to an Average Shot Length of about 2.7 seconds. Interestingly,Run Lola Run contains about 1,581 transitions (edits, dissolves, fades, wipes, etc) in 71 minutes of action (i.e. excluding the credits, and pre-credits sequence). This equates to an Average Shot Length of about 2.7 seconds. Interestingly, the editing is relatively slower towards the end of the film. For most contemporary films, the opposite is the norm.",
      "review_date": "2020-01-19"
    },
    {
      "review_title": null,
      "content": "Run Lola Run is a fascinating, non-linear crime thriller with brilliant editing styles, surprises and a flawless performance from Franka Potente before she starred in The Bourne Identity & Blow.",
      "review_date": "2020-01-28"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nMany spirals appear in the film--such as staircases, the sign for a bar behind a phone booth. This is because director Tom Tykwer was a fan of Alfred Hitchcock's movie \"Vertigo (1958),\" which featured spiral motifs.",
      "review_date": "2021-04-09"
    },
    {
      "review_title": null,
      "content": "A thriller chock full of originality and impressive styles. ....................",
      "review_date": "2021-04-05"
    },
    {
      "review_title": null,
      "content": ",,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷",
      "review_date": "2021-04-23"
    },
    {
      "review_title": null,
      "content": "Run Lola Run is a kinetic, rare movie experience. The movie has unique, flashy editing styles and a brilliant gimmick never seen before. This is a must see thriller, one of the best of its ilk.",
      "review_date": "2021-03-22"
    },
    {
      "review_title": null,
      "content": ":;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;;:;:;:;:,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,",
      "review_date": "2021-04-24"
    },
    {
      "review_title": null,
      "content": "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧",
      "review_date": "2021-04-25"
    },
    {
      "review_title": null,
      "content": "°•¤⊙°•¤⊙°•¤⊙°•¤⊙°•¤⊙°•¤⊙°•¤⊙°•¤⊙°•¤⊙°•¤⊙°•¤⊙°•¤⊙°•¤⊙°•¤°•¤⊙°¤•°°•¤⊙☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆***********",
      "review_date": "2021-04-29"
    },
    {
      "review_title": null,
      "content": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$",
      "review_date": "2021-05-18"
    },
    {
      "review_title": null,
      "content": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$",
      "review_date": "2021-05-21"
    },
    {
      "review_title": null,
      "content": "$.$.$.$.$.$.$,$,$,$,$,$,$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》》■》■》■》",
      "review_date": "2021-06-07"
    },
    {
      "review_title": null,
      "content": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".",
      "review_date": "2021-06-21"
    },
    {
      "review_title": null,
      "content": "+++++++++++××××××++++÷÷÷÷÷÷++÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■",
      "review_date": "2021-06-23"
    },
    {
      "review_title": null,
      "content": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■■●●■●■●■●☆☆☆☆☆☆$$$$$$$$$$$$$$$$$$$+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+",
      "review_date": "2021-07-17"
    },
    {
      "review_title": null,
      "content": "This film is ok... It has a good and a bad plot at the same time. The whole thing is smart about the 20 minutes before he stoles the bank, but that thing that happens that they return to the beginning I can't understand how it happened and itThis film is ok... It has a good and a bad plot at the same time. The whole thing is smart about the 20 minutes before he stoles the bank, but that thing that happens that they return to the beginning I can't understand how it happened and it is quite stupid. However, it has some suspense and action and it is interesting.. If you want to watch it fine, but if you don't want to you have nothing to lose at all...",
      "review_date": "2013-08-21"
    },
    {
      "review_title": null,
      "content": "This was a surprisingly underwhelming film. It had a great premise, but it went nowhere with it. Not much really even happens, with much of it being filler.",
      "review_date": "2016-05-11"
    },
    {
      "review_title": null,
      "content": "An unforgettably stylish film with a hefty amount of mesmerizing twists and turns.",
      "review_date": "2012-11-28"
    },
    {
      "review_title": null,
      "content": "This is an entertaining little film (German with English subtitles) which deliberately breaks a rule or two to good effect.  It is by turns funny, droll, ironic, tragic, suspenseful, and mildly horrifying.  It might also be said to have beenThis is an entertaining little film (German with English subtitles) which deliberately breaks a rule or two to good effect.  It is by turns funny, droll, ironic, tragic, suspenseful, and mildly horrifying.  It might also be said to have been touched by the madcap sense of \"reality\" common to many sketches of the Monty Python troupe.  All in all I do recommend it, except for people who speak English only and have a serious problem with subtitles.",
      "review_date": "2017-10-09"
    },
    {
      "review_title": null,
      "content": "Just keep running, Lola. No one will ever take deep experience and note from the excellent work you've done for us. Don't stop running, Lola. No one will love your movie if you just stop running for at least an hour or two. Just. Keep. Running.",
      "review_date": "2016-04-04"
    },
    {
      "review_title": null,
      "content": "=:=:=:=:=:=:=:=:=:=:=:÷;=;=:==:=:=:=:=:=:==:=:=:=:=:=:=:_______________________________♡♡♡♡♡♡♡♡♡",
      "review_date": "2021-07-31"
    },
    {
      "review_title": null,
      "content": "Incredible rush that will keep you on the edge of your seat the whole time!",
      "review_date": "2006-01-21"
    },
    {
      "review_title": null,
      "content": "Excellent story, Crazy Camera work and a Fast Techno beat give you a german arthouse movie called Run Lola Run. The movie shines because of it's original and yet extremely unusual idea's. The movie was great in many ways because of Excellent story, Crazy Camera work and a Fast Techno beat give you a german arthouse movie called Run Lola Run. The movie shines because of it's original and yet extremely unusual idea's. The movie was great in many ways because of the reincarnation values and also the different speeds she would run because of those values. The movie was fabulous and interesting but left me wanting more and a little dissapointed when the end hit. It still was a pleaser and was a fabulous and interesting arthouse movie.",
      "review_date": "2006-04-29"
    },
    {
      "review_title": null,
      "content": "There are some funny ideas in the movie, especially how they show the story.But Franka Potente is so unsympathetic and cold. Also the story is unrealistic and there are too many repeats in the story.",
      "review_date": "2021-04-10"
    },
    {
      "review_title": null,
      "content": "Run Lola Run is an excellent representative of European cinema of the beautiful era of the 90s. Even in German cinema they were able to make an excellent film. There are few films with such a structure. Great acting and playing a screenwriterRun Lola Run is an excellent representative of European cinema of the beautiful era of the 90s. Even in German cinema they were able to make an excellent film. There are few films with such a structure. Great acting and playing a screenwriter with seemingly unsung circumstances. Great acting Moritz Bleibtreu",
      "review_date": "2021-07-18"
    }
  ],
  "num_reviews": 55
}