{
    "rating": 8.8,
    "release_date": "1999-02-19",
    "num_reviews": 470,
    "genres": [
        "Drama"
    ],
    "summary": "John Hickam (Chris Cooper) is a West Virginia coal miner who loves his job and expects his sons, Jim (Scott Miles) and Homer (Jake Gyllenhaal), to follow in his footsteps. But Jim gets a football scholarship, and Homer becomes interested in rocket science after seeing Sputnik 1 crossing the sky. John disapproves of his son's new mania, but Homer begins building rockets with the help of friends and a sympathetic teacher (Laura Dern). Rocketry, he hopes, will prove his ticket to a better life.",
    "reviews": [
        {
            "content": "Following a dream and making it come true has been seen enough times to count them with an abacus. What this cliché has in its favor here is a correctly written script that does not appeal to opportunistic and simple sentimentality, and an interesting cast.",
            "review_date": "2023-04-23",
            "source": "rt"
        },
        {
            "content": "This movie was good and a lot of fun",
            "review_date": "2023-04-12",
            "source": "rt"
        },
        {
            "content": "October Sky is a heartwarming and inspiring movie that captures the essence of determination, passion, and perseverance. The film, directed by Joe Johnston, tells the true story of Homer Hickam, a young boy from a small coal-mining town in West Virginia who dreams of building rockets and launching them into space.\n\nOne of the reasons why October Sky is such a great movie is its ability to draw the audience into the story and make them feel invested in the characters. The film portrays the struggles and challenges faced by Homer and his friends as they pursue their dream of building rockets, while also dealing with the expectations and limitations imposed by their families and community.\n\nThe performances of the cast are another standout feature of October Sky. Jake Gyllenhaal, who plays the lead role of Homer, delivers a nuanced and emotional performance that captures the character's determination and passion. The supporting cast, including Chris Cooper as Homer's father and Laura Dern as his teacher, also deliver memorable performances that bring depth and complexity to the story.\n\nThe movie also touches on several themes that resonate with audiences, such as the importance of following one's dreams and the power of education to change lives. These themes are woven into the fabric of the story and provide a sense of depth and meaning that elevates the film beyond a simple coming-of-age tale.\n\nOverall, October Sky is a heartwarming and inspiring movie that captures the essence of the American Dream. It is a powerful reminder of the importance of pursuing one's dreams and the impact that determination, passion, and perseverance can have in our lives. It is a movie that will leave you feeling uplifted, inspired, and grateful for the human spirit.",
            "review_date": "2023-04-02",
            "source": "rt"
        },
        {
            "content": "A real feel good film, telling a dramatised true story. It's one I've seen a few times over the years, and enjoyed each time I watch it",
            "review_date": "2023-02-22",
            "source": "rt"
        },
        {
            "content": "An exceptionally motivating film that brought me a passionate feeling. The message of \"If you first don't succeed, try try again\" is firmly presented and that it provides a great reflection. The reflection of teenagers' innocence, curiosity, and ambition are good traits that make the older times better than the current technology age. Jake Gyllenhaal is a good actor that I admired from certain films, but so far, this one is my favorite of them all. He was able to portray Homer's character with tenacity and the blend between him and other fellow actors is worthwhile to acknowledge. A great film that I can see myself watching in the future.",
            "review_date": "2023-01-17",
            "source": "rt"
        },
        {
            "content": "I'd say I enjoyed it",
            "review_date": "2023-01-15",
            "source": "rt"
        },
        {
            "content": "This is really good. About one of the first people to make U.S. rockets fly properly. High school kids..",
            "review_date": "2022-09-23",
            "source": "rt"
        },
        {
            "content": "This is good movie to inspire your life.",
            "review_date": "2022-09-22",
            "source": "rt"
        },
        {
            "content": "Phenomenal movie in every way!!!",
            "review_date": "2022-09-21",
            "source": "rt"
        },
        {
            "content": "Really great history and drama movie, one of the best drama movies ever!  And the music is just so gorgeous and unforgettable.  Very inspiring toward accomplishing massive goals, especially for college students, and has some nice shots of Southern 4501(albeit decked out as a Norfolk and Western locomotive) in it as well.",
            "review_date": "2022-07-17",
            "source": "rt"
        },
        {
            "content": "Great movie about a kid who want's to join NASA and does whatever it takes to get his Rocket's off the ground, and yes he finally get's his wish, which is why I give this movie a *4* star rating!!!!",
            "review_date": "2022-06-21",
            "source": "rt"
        },
        {
            "content": "October Sky is a satisfying movie about determination and family. It does a good job depicting the 1950s (as I imagine the era), juxtaposing the nastiness of labor relations, the sub-rosa pathologies, the harshness of life, with the simple, optimistic soundtrack of Buddy Holly and Fats Domino tunes.",
            "review_date": "2022-04-01",
            "source": "rt"
        },
        {
            "content": "October Sky is so inspiring and touching that it even truly speaks to today. It is a powerful true story of someone who would love rocket launching with his friends in the midst of bullying and family issues and yet he got to NASA. It is a beautiful film with a gorgeous score and truly speaks powerful volumes in the past, present, and future. Please see it. Thank you.",
            "review_date": "2021-12-09",
            "source": "rt"
        },
        {
            "content": "October Sky is an amazing film. I love everything about this movie: the screenplay, Jake Gyllenhaal and Lauren Dern's performances, the setting and the visuals. This movie is so great that it puts West Virginia and Homer Hickam on the map. Overall, October Sky has everything to make a historical movie into life.",
            "review_date": "2021-11-07",
            "source": "rt"
        },
        {
            "content": "Linear but feel good and well done. Chris C and Jake G is hard to beat.",
            "review_date": "2021-09-24",
            "source": "rt"
        },
        {
            "content": "Heartwarming and inspiring true story that'll have you seeing rockets!\n\nJoe Johnston's historical coming of age drama October Sky (1999) is a picture burning with passion for science, discovery, education, family, and fellowship among men. Joe Johnston's direction is as peerless and enjoyable as any iconic director's grounded style. October Sky is as much a coming of age drama story like Stand by Me or Lady Bird as it is a film about coal miners, unions, and small town mindsets like Matewan or Coal Miner's Daughter. \n\nI always find director Joe Johnston's films to be kind hearted and focused on inspiring kids to remember themselves, to seek higher education in life, understand their parents, and for parents to empathize with their children. Lewis Colick's writing understands how teenagers talk among each other, wanting their desires to be in life, while sympathizing with the perspective and struggles of both children and their parents. October Sky may just help you pick your path in life.\n\nI believe October Sky creates a passion for rocket science and mathematics, while also making you want to go out and make friends, find a hobby, pursue a career you love, find love, and rekindle the love in your family. October Sky is made with love and care like all great Joe Johnston films like The Rocketeer, Jumanji, Honey I Shrunk the Kids, Captain America The First Avenger, or Hidalgo. October Sky is worth seeing for the rocket launches alone, let alone the life affirming true story about a boy wanting to leave his town to build rockets and gain his father's respect.\n\nJake Gyllenhaal is so sensitive and compelling as Homer Hickam, who figures his chance out of town is in building rockets. His frustrations and fears are apparent on Gyllenhaal's face. He was a fine actor before Donnie Darko, Brokeback Mountain, or Nightcrawler even. Laura Dern is so sweet and supportive as Homer's kind teacher Miss Riley. I don't know of a nicer performance in film from a lovelier actress than Laura Dern. \n\nChris Cooper is one mean, jaded, and reactionary father figure as Homer's tough father and mining boss John Hickam. It's cool to see Cooper do a mining picture after John Sayles' iconic Matewan with Cooper as the union creating leader, now an older man desperate to keep the livelihoods of his town in operation in a failing coal industry. Natalie Canerday is great as Homer's mother Elsie Hickam. Chris Owen is wonderful as the brainiac nerd Quentin Wilson alongside the other boys William Lee Scott and Chad Lindberg portray. I liked the nice girl Valentine Carmina as portrayed by Kaili Hollister. \n\nRobert Dalva's editing cuts quickly in montages of rocket building, launching, and exploding for a delightful series of training montages in rocket science. His sharp cuts make October Sky's 108 fly by like a rocket in the sky. Fred Murphy's cinematography uses natural scenery of forests in lush wide shots to deep and dark close-ups in the depths of the mines for a harsher effect. Jim Mitchell and Mark S. Miller's visual effects for the rocket launches are second to none and highly realistic. Mark Isham's score is lovely and definitely gets me emotional hearing his tender melodies. Betsy Cox' costumes look like the early 1950's and 1960's for sure.\n\nIn conclusion, October Sky delights me now as it did for me as a child. Any family should find a light of compassion and inspiration in watching it today.",
            "review_date": "2021-08-24",
            "source": "rt"
        },
        {
            "content": "\"October Sky\" is a pretty good movie with pretty good performances. Maybe even great, but I don't believe that it's one of the greatest family masterpieces it's often made out to be. The story was relatively interesting, starring a young Jake Gyllenhaal as real-life NASA engineer Homer Hickam. After the Soviet satellite Sputnik was sent into space, it instantly caught Hickam's interests and he knew that this was what he was going to do. His family doesn't believe in him, his town doesn't believe in him but one teacher does and it changes his life. I'm sorry, I know this is a true story and all but this movie is very predictable, around the half-way mark you know exactly what's going to happen almost in the order that it ends up doing. That makes the movie feel much longer than it is, probably didn't help that I was also watching it with my family very late at night. They frequently asked me \"how much longer?\" It's by no means a bad movie, not at all. It's average-length but just seems drawn out as the entire story could've easily been told in the span of 10 minutes. Ah, well. Still pretty good family movie, one of the better ones I think I've actually seen and I'd recommend it actually. I liked it, even though a lot of my sleepy siblings didn't. It's quite an inspiring tale of believing in yourself when no one else would but it just falls a little short for my personal tastes. It's still an excellent family movie though.",
            "review_date": "2021-08-09",
            "source": "rt"
        },
        {
            "content": "It's pretty formulaic. Most of the usual cliches are here. The story is kind of interesting but nothing extraordinary.",
            "review_date": "2021-07-29",
            "source": "rt"
        },
        {
            "content": "What it did best is that it launched Jake Gyllenhaal's career, who doesn't seem to be a rocket intentioned to explode at his maximum heat, or land anytime soon.",
            "review_date": "2021-06-14",
            "source": "rt"
        },
        {
            "content": "Can we just appreaciate how talented Jake was since the very start of his career?",
            "review_date": "2021-05-24",
            "source": "rt"
        },
        {
            "content": "One of the all-time great inspirational true story movies. Jake Gyllenhaal's first great performance as Homer Hickam, a high school kid who dreams of going to space when he sees Sputnik streak across the sky. Laure Dern is phenomenal as the teacher who helps the kids achieve greatness, against all odds. A touching, feel-good story that is fantastically told. An absolute must-see!",
            "review_date": "2021-05-20",
            "source": "rt"
        },
        {
            "content": "Love this movie.  One of my favorite movies to motivate and inspire.",
            "review_date": "2021-03-04",
            "source": "rt"
        },
        {
            "content": "Love this movie.  An inspiration!",
            "review_date": "2021-02-02",
            "source": "rt"
        },
        {
            "content": "Although filled with some great moments and visually beautiful scenes, the film falls flat. \n\nAverage in all departments with perhaps the only standout element being the well-staged sets or Gyllenhaal's performance. \n\nA nice feel-good family movie that goes to the back of the shelf when finished.",
            "review_date": "2020-11-02",
            "source": "rt"
        },
        {
            "content": "Great movie! A very unique film on a rarely used topic. Not to mention Great actors, pacing, storytelling, and more. I have a few nitpicks about this movie, but besides the occasional thing here and there, This film is worth your time seeing. 82/100",
            "review_date": "2020-10-05",
            "source": "rt"
        },
        {
            "content": "Clumsy,the usual stereotypes.",
            "review_date": "2020-08-31",
            "source": "rt"
        },
        {
            "content": "Only decent if you haven't read the book. But if you have read the book, and loved \"Rocket Boys,\" this movie is the pits. They basically changed 85% of the plot, removed 50% of all the characters, (even some of the rocket boys!) and all of this made it un-enjoyable as you spend 90% of it complaining how \"That wasn't in the book!\"",
            "review_date": "2020-07-20",
            "source": "rt"
        },
        {
            "content": "Often told, and often told better.",
            "review_date": "2020-07-04",
            "source": "rt"
        },
        {
            "content": "Great cast, wonderful story...one that lasts throughout the years! Wonderful movie based on the Rocket Boys book.",
            "review_date": "2020-06-11",
            "source": "rt"
        },
        {
            "content": "Forgotten in a box full of VHS tapes in a school closet somewhere, October Sky is one of those films you forgot you loved during your school days. Revisiting this film shows that it still has its magic.\n\nOctober Sky is a coming-of-age film with a heart of gold. The film follows Homer Hickman Jr., a kid from West Virginia follows what he loves doing -- making rockets.\n\nThe film shows the rewards of chasing your dreams, no matter how ambitious. Something that I find quintessentially fundamental to the American dream.\n\nThe film keeps its magic of innocent youth. You will laugh and shed tears of sadness & joy throughout. Acting is solid and convincing. Surprised no one won an Emmy for this. It's that good.\n\n4.5/5. A heart-warming film that still keeps its magic after all the years.",
            "review_date": "2020-03-22",
            "source": "rt"
        },
        {
            "content": "October Sky is an inspirational and uplifting movie",
            "review_date": "2019-12-18",
            "source": "rt"
        },
        {
            "content": "A wonderful movie that can be viewed (though not necessarily be appreciated) by all ages.",
            "review_date": "2019-11-25",
            "source": "rt"
        },
        {
            "content": "This is one of those rare movies that I just cant find anything wrong with!",
            "review_date": "2019-08-15",
            "source": "rt"
        },
        {
            "content": "Movie is so bad. Haven't seen a worse movie. Will never watch again. Absolutely zero plot. Completely irrelevant to society as a whole. No one should have ever wasted money on making this movie.",
            "review_date": "2019-08-03",
            "source": "rt"
        },
        {
            "content": "Fantastic family movie!",
            "review_date": "2019-08-03",
            "source": "rt"
        },
        {
            "content": "This movie is one of my absolute favorites of all time. I don't think any other movie does such a good job of telling an inspirational story about a kid from a small town with a really big dream. This is the ultimate \"feel good\" movie, but it also does a great job of capturing the relationship between Homer and everyone around him, particularly the relationship between him and his dad. The movie does such a mature job of capturing the conflict between their perspectives, as well as developing Homer's character and making us all root for him to land his big shot of winning the national science fair and being able to pursue greater goals. While I may be biased towards this movie, as I often feel like Homer myself, it is still undoubtedly a great film.",
            "review_date": "2019-07-03",
            "source": "rt"
        },
        {
            "content": "To those who say this is a merely a conventional \"feel good\" movie, I say the acting sets this apart from those typical films.  Jake Gyllenhaal and Chris Cooper are amazing.",
            "review_date": "2019-04-08",
            "source": "rt"
        },
        {
            "content": "The best inspiring movie ever made!",
            "review_date": "2019-02-02",
            "source": "rt"
        },
        {
            "content": "Tasteful produced and well-cast movie with a touch of nostalgia; entertaining, but once again an American success story of an individual making his way against social obstacles.",
            "review_date": "2019-02-02",
            "source": "rt"
        },
        {
            "content": "This movie is incredibly inspiring and fun.",
            "review_date": "2018-11-01",
            "source": "rt"
        },
        {
            "content": "An all time great historical drama. The time period and setting are fascinating, the story is engaging and the actors are solid. This is one of those essential movies to watch when growing up. It shows that if you want to do something you may have to push hard but you can achieve your dreams.",
            "review_date": "2018-07-19",
            "source": "rt"
        },
        {
            "content": "Pretty interesting to watch",
            "review_date": "2018-06-05",
            "source": "rt"
        },
        {
            "content": "Can we all agree that any movie set in the 1950s should be directed by Joe Johnston? He has a magical way of capturing the nostalgic feel of that era. The way we are introduced to Coalwood, West Virginia makes you feel like this place has been around for generations. It’s a quaint small town where everyone knows everyone else, and there’s closeness throughout the entire community. The cast nailed the accents across the board (even if sometimes they look like they are doing a little extra work with their mouths to make it sound right.) The costume and set designers made everything look perfect. It all comes together to give October Sky an amazing sense of place and time that is authentic. You never get the sense that just off camera there is a studio or something, because the film takes you to Coalwood. I love the story of this rag-tag group of kids who work together to do something that seems improbable so that they can move on to bigger and better things. The scenes of them experimenting and figuring out all the little details they need to make a successful rocket were great. It helps that the cast of actors was excellent. However, I often have trouble with movies that include a character like the one Chris Cooper plays. He appears so unfeeling and insensitive throughout the film, that I find myself getting mad. It’s even more tragic because it is a father-son relationship, and I want him to show his love by supporting his son instead of cutting him down. I’m aware that the conflict is necessary to add drama to the story, and I imagine some of it was based in real events, but it’s hard for me to watch. That being said, the lows that the film reaches makes the highs seem more thrilling and exciting. Speaking of lows and highs, that’s one of the things I love about October Sky, the blatant symbolism of Homer Hickam’s life is astounding. If it wasn’t based on a true story, you’d want to chastise the author for making the story too good to be true. The idea that Homer doesn’t want to go down and be buried in the mine, but longs to soar into the heavens is delightful. Joe Johnston used that idea to full effect in this film, and there are a few shots that show the contrast of the two worlds so well I’ll never forget them. While there were certain elements of October Sky that didn’t click for me, I still enjoyed the story a lot, and it is one film I expect to revisit and fall in love with more in the future. ",
            "review_date": "2018-05-18",
            "source": "rt"
        },
        {
            "content": "The book was almost even better.",
            "review_date": "2018-04-26",
            "source": "rt"
        },
        {
            "content": "\"October Sky\" is a masterpiece. Beautiful and heartwarming, Joe Johnston's instant classic is worth the watch.",
            "review_date": "2018-04-07",
            "source": "rt"
        },
        {
            "content": "Pretty Interesting movie that I enjoyed",
            "review_date": "2018-01-27",
            "source": "rt"
        },
        {
            "content": "Nonfiction always makes for an excellent movie, but Hollywood never awards them the credit they deserve.",
            "review_date": "2017-11-11",
            "source": "rt"
        },
        {
            "content": "This was a pretty good movie I thought when I saw it",
            "review_date": "2017-09-19",
            "source": "rt"
        },
        {
            "content": "October Sky give us a hopeful movie wit so much spirit and very good moral value without judge us",
            "review_date": "2017-09-16",
            "source": "rt"
        },
        {
            "content": "Pretty interesting, based on true story. Worth a watch.",
            "review_date": "2017-05-07",
            "source": "rt"
        },
        {
            "content": "7,9 Some cheesy moments, particularly at the end",
            "review_date": "2017-05-01",
            "source": "rt"
        },
        {
            "content": "Great story, very wholesome, highly recommended.",
            "review_date": "2017-03-23",
            "source": "rt"
        },
        {
            "content": "The film is nice, but the extras shows that the film is significantly different from the true story. The town and the mine really helped the kids all along. As a kid, I tried myself to make rockets and they were not flying high at all. I did not make a good batch of black powder, after my good batch went in flame... The footages they have of their rockets are quite impressive. The film added some drama to keep interest, otherwise, it would have been the documentary in extras. The documentary is great and depicts a lot of things in the film happened as shown. The film is a pass if you watch the extra documentary.",
            "review_date": "2017-02-27",
            "source": "rt"
        },
        {
            "content": "The film is nice, but the extras shows that the film is significantly different from the true story. The town and the mine really helped the kids all along. As a kid, I tried myself to make rockets and they were not flying high at all. I did not make a good batch of black powder, after my good batch went in flame... The footages they have of their rockets are quite impressive. The film added some drama to keep interest, otherwise, it would have been the documentary in extras. The documentary is great and depicts a lot of things in the film happened as shown. The film is a pass if you watch the extra documentary.",
            "review_date": "2017-02-27",
            "source": "rt"
        },
        {
            "content": "October Sky is a sweet film with a great soundtrack and excellent performances.",
            "review_date": "2016-12-08",
            "source": "rt"
        },
        {
            "content": "A resonant, heart-warming and beautifully scored film.\nGreat performances from Gyllennhaal and Cooper. \nA film for the ages and our youngsters.",
            "review_date": "2016-12-08",
            "source": "rt"
        },
        {
            "content": "October Sky is one of those cinematic gems that embraces the setting of a coal mine town and breathes a simple true story into it. It satisfies the thinker with good science yet fills the star gazer with wonder and hope for a brighter future. Not to mention the theme that pulls the entire story together.",
            "review_date": "2016-12-03",
            "source": "rt"
        },
        {
            "content": ".Great story of ambition and determination, exactly the film that any person should see. This is one of those films I put off for way too long and couldn't tell you why. Perfect filmmaking and one that pulls all the correct strings",
            "review_date": "2016-09-13",
            "source": "rt"
        },
        {
            "content": "The concepts and subject matter of the film are fresh and interesting, but the actual plot is just a retread of the things we see in pretty every movie.\nGrade:B",
            "review_date": "2016-08-06",
            "source": "rt"
        },
        {
            "content": "oh for pete sake you can't help yourself from getting sucked into the wonderful story and heart felt setiment of perseverance and total ambition from adversity to see that october sky is the ultimate in uplifting drama.",
            "review_date": "2016-07-30",
            "source": "rt"
        },
        {
            "content": "This is one of my top 10 favorite movies! :)",
            "review_date": "2016-07-10",
            "source": "rt"
        },
        {
            "content": "Lots of memories from the dollar movies, including dancing during the credits.",
            "review_date": "2016-07-06",
            "source": "rt"
        },
        {
            "content": "Boring wanted to fall asleep",
            "review_date": "2016-06-14",
            "source": "rt"
        },
        {
            "content": "One of my absolute favorite movies. The best part for me about this movie is the fact that the soundtrack has music from the time period instead of using modern music for a story from the 60's. Has the best soundtrack and score. Love, love, love it!",
            "review_date": "2016-06-12",
            "source": "rt"
        },
        {
            "content": "One of the best \"based on true events\" movie I've ever seen!",
            "review_date": "2016-04-09",
            "source": "rt"
        },
        {
            "content": "A deeply moving film with fine performances and a true story worth watching with company or family",
            "review_date": "2016-03-17",
            "source": "rt"
        },
        {
            "content": "This is a true inspiring story about a teenager wanting to make a rocket for the first time in his life but his father is not supportive but the teenager goes with what he thinks. Teenager has friends that are helping him make the rocket. I have this movie can teach you how to support others yelp and getting along",
            "review_date": "2016-02-05",
            "source": "rt"
        },
        {
            "content": "10 out of 10:\n\nSweet, well acted, and inspiring, October Sky makes a fantastic family film.",
            "review_date": "2016-01-31",
            "source": "rt"
        },
        {
            "content": "I really enjoyed the movie because I know the place is represents.  It was filmed in Tennessee because there were no places for the actors and crew  to stay and the area is much rougher than depicted so there would not be enough space to make the movie.  I would have done anything to get away from there.",
            "review_date": "2016-01-24",
            "source": "rt"
        },
        {
            "content": "Excellent biopic with a strong cast, follows a well worn path but with enough intelligence not to be too saccharin. Whilst the main story of a young mans battle to break the chains is great, the back story of working in the coal mine and its hardness is also gripping.",
            "review_date": "2015-12-05",
            "source": "rt"
        },
        {
            "content": "Emotional drama of self discovery and nonconformity with great performances and a truly heartwarming moral to the story.",
            "review_date": "2015-11-13",
            "source": "rt"
        },
        {
            "content": "A moving and inspiring film. The music gets me every time",
            "review_date": "2015-08-15",
            "source": "rt"
        },
        {
            "content": "That one movie that's plot is decent, the acting is decent, but the movie is great.",
            "review_date": "2015-06-22",
            "source": "rt"
        },
        {
            "content": "Inspirational and deeply moving.",
            "review_date": "2015-06-03",
            "source": "rt"
        },
        {
            "content": "Coming of age dreamers dream type movie that uplifts the spirits.",
            "review_date": "2015-05-26",
            "source": "rt"
        },
        {
            "content": "Awesome jack is lovely",
            "review_date": "2015-05-16",
            "source": "rt"
        },
        {
            "content": "great movie! takes you back to the 50's",
            "review_date": "2015-05-05",
            "source": "rt"
        },
        {
            "content": "A great success story, one of Gyllenhaal's greats",
            "review_date": "2015-04-29",
            "source": "rt"
        },
        {
            "content": "88%\nWatched this on 22/4/15\nOctober Sky is an emotional drama that is fast paced and full of realistic characters and situations. It's story feels relevant even now. As much as the science and rockets are inspiring to watch, the brawl between Gyllenhaal and his father character is equally engaging.",
            "review_date": "2015-04-22",
            "source": "rt"
        },
        {
            "content": "Nice uplifting, small-town flick. Cooper is great.",
            "review_date": "2015-02-28",
            "source": "rt"
        },
        {
            "content": "A great story to tell with such power at a small standard and an uplifting, inspirational spirit into the heart, powered by the performances that are considered really good. (A-)\n\n(Full review coming soon)",
            "review_date": "2015-02-20",
            "source": "rt"
        },
        {
            "content": "One can never forget about this movie once one has seen it. After all these years, the score still resonates in one's head along with the most inspiring story.",
            "review_date": "2015-02-12",
            "source": "rt"
        },
        {
            "content": "October Sky is a movie in which a small teenager, son of the mine superintendent, works with a group of friends and an amazing teacher to create a homemade rocket in hopes of winning the National Science Fair and escaping a life of mining.",
            "review_date": "2015-02-02",
            "source": "rt"
        },
        {
            "content": "Very funny with a great story. A must see!",
            "review_date": "2015-01-27",
            "source": "rt"
        },
        {
            "content": "The film really stands for something. From the early stage Gyllenhaal proves he will become Hollywood next legend.",
            "review_date": "2015-01-17",
            "source": "rt"
        },
        {
            "content": "One of the best inspirational movies, very touching.",
            "review_date": "2015-01-14",
            "source": "rt"
        },
        {
            "content": "A great inspirational movie that has a good story, good acting, and plenty of emotion. This movie is a great true story adaption and is Jake Gyllenhaal is really good as Homer Hickem Jr. It's a must see for fans of true stories and inspirational movies.",
            "review_date": "2015-01-12",
            "source": "rt"
        },
        {
            "content": "Fascinating movie, be sure to share this to your family as soon as possible.",
            "review_date": "2015-01-11",
            "source": "rt"
        },
        {
            "content": "I love this movie â?¤ï¸?â?¤ï¸?â?¤ï¸?ð'-ð'-",
            "review_date": "2014-12-18",
            "source": "rt"
        },
        {
            "content": "I have watched this movie at least a dozen times and it still makes me cry. Favorite movie ever, hands down.",
            "review_date": "2014-08-30",
            "source": "rt"
        },
        {
            "content": "A wonderful, inspiring, & heartwarming film. It's nolstagic, well directed/written, & has an unforgettable and important story. What a film, and a criminally underrated coming of age film at that.",
            "review_date": "2014-06-28",
            "source": "rt"
        },
        {
            "content": "October Sky is a good flick. I didn't realize it was autobiographical until the end.",
            "review_date": "2014-06-15",
            "source": "rt"
        },
        {
            "content": "One of the best movie I ever seen",
            "review_date": "2014-06-04",
            "source": "rt"
        },
        {
            "content": "I love astronomy and I loved this movie as well. Great acting and truly an inspiring movie.",
            "review_date": "2014-05-26",
            "source": "rt"
        },
        {
            "content": "Living in a poor life, now a wealthy life brings an epic to Jake Gyllenhaal's performance! Well done! Perfect Score!",
            "review_date": "2014-05-22",
            "source": "rt"
        },
        {
            "content": "I can't believe it took me this long to see this movie, especially since I like Jake Gyllenhaal and Chris Cooper. Cooper is a miner in a mining town in West Virginia and Gyllenhaal, who plays his son doesn't want to go into the family business. He wants to be a rocket scientist. It's based on a true story. It's no academy award winning movie, but it's very charming and so is Jake Gyllinhall. He's very young in it. The acting by everyone in it is adequate. Everything about it technically is adequate.  There's a fun little montage of them shooting, or trying to shoot of their rockets and failing over and over. The sound track was all 60's music which was enjoyable. Although a little predictable and a little derivative it was still pretty entertaining and enjoyable. Maybe because it's just so disgustingly feel good. I cried despite myself at the end. It's also just one of the most family oriented movies ever. If you have the whole family over and don't want to offend anyone, this is the perfect movie for that occasion. There's footage of the real people at the end of the movie. It's pretty fascinating.",
            "review_date": "2014-05-17",
            "source": "rt"
        },
        {
            "content": "Very good film about 4 boys stuck in a coal mining town who discover rocketry, and their fight to follow their dreams rather than face a fate of being stuck in the mines. Not really the most original plot in the world (It's a sort of How Green Was My Valley meets Stand By Me) but some great performances, especially by Gyllenhaal save it.",
            "review_date": "2014-03-04",
            "source": "rt"
        },
        {
            "content": "It's an uplifting story with good actors and is overall a great movie. The science enthusiasm and the coal storyline drove the plot well, and the performances rounded it all out.",
            "review_date": "2014-01-12",
            "source": "rt"
        },
        {
            "content": "Three words: A great movie!!!",
            "review_date": "2014-01-01",
            "source": "rt"
        },
        {
            "content": "Excellent.  Inspiring story, heartfelt and engaging.",
            "review_date": "2013-12-29",
            "source": "rt"
        },
        {
            "content": "Great acting, touching, humorous, thought-provoking, and inspiring.  Jake is a natural in this, and his movie friends are perfectly casted as well.  The drive with which he was propelled by to create rockets inspires me to go after my dreams.  Amazing movie, and it shows how one spark could cause a raging fire in one's heart to go after their dreams and never stop.",
            "review_date": "2013-12-25",
            "source": "rt"
        },
        {
            "content": "Not for the average action moviegoer, but they should all die anyway.",
            "review_date": "2013-12-17",
            "source": "rt"
        },
        {
            "content": "I surprisingly really liked it.",
            "review_date": "2013-12-05",
            "source": "rt"
        },
        {
            "content": "Very good in pretty much every way, it's simple, smart and heartfelt. In some areas though I felt it needed a bit more fleshing out or emphasis. Overall good though and not a whole lot of bad to say about it.",
            "review_date": "2013-12-03",
            "source": "rt"
        },
        {
            "content": "This movie is one of the best I have ever seen so far in my life. It is an inspirational classic that depicts four underdogs reaching the road to success. The script was well written and the cast was excellently picked. The plot line in correlation to real life was spot on and the story kept the viewers attention at all times. Joe Johnston and lewis Colick did an excellent job with creating this masterpiece, October Sky deserves all five stars.",
            "review_date": "2013-11-13",
            "source": "rt"
        },
        {
            "content": "A truly inspiring real story.",
            "review_date": "2013-11-12",
            "source": "rt"
        },
        {
            "content": "It was a amazing movie I would watch it over and over again",
            "review_date": "2013-10-31",
            "source": "rt"
        },
        {
            "content": "Easily one of my top ten favorite movies of all time",
            "review_date": "2013-10-23",
            "source": "rt"
        },
        {
            "content": "It plays familiar chords, but it plays them well and its main character is easy to admire.",
            "review_date": "2013-10-23",
            "source": "rt"
        },
        {
            "content": "I can't help but love this story.",
            "review_date": "2013-10-23",
            "source": "rt"
        },
        {
            "content": "The story is powerful enough to stand on its own, and the script, direction, and acting are smart enough to stay out of the way",
            "review_date": "2013-10-09",
            "source": "rt"
        },
        {
            "content": "A wonderful movie! Touched my heart.",
            "review_date": "2013-10-07",
            "source": "rt"
        },
        {
            "content": "A truly awesome and inspiring film that is powerful enough to overcome the frequent cliches and often predictability that accompany them, thanks to unforgettable performances from Gyllenhaal and Dern. This is one of those rare films that I could watch more than once without hesitation.",
            "review_date": "2013-09-25",
            "source": "rt"
        },
        {
            "content": "The rare JG movie I enjoyed.",
            "review_date": "2013-08-31",
            "source": "rt"
        },
        {
            "content": "Very motivational movie",
            "review_date": "2013-08-29",
            "source": "rt"
        },
        {
            "content": "Touching family drama which plays out a little like a sports film but substituted by rocketry. Chris Cooper is excellent in a picture which is about the father and son relationship as much as it is anything else.",
            "review_date": "2013-08-11",
            "source": "rt"
        },
        {
            "content": "Period biopic encompassing company towns vs scientific curiosity and the various types of heroism.",
            "review_date": "2013-08-05",
            "source": "rt"
        },
        {
            "content": "Great movie, very inspirational",
            "review_date": "2013-08-05",
            "source": "rt"
        },
        {
            "content": "My original love for this movie was diminished by the much more amazing book compared to the simplistic style of Hollywood.",
            "review_date": "2013-08-04",
            "source": "rt"
        },
        {
            "content": "One of the better films they make you watch in school.",
            "review_date": "2013-08-03",
            "source": "rt"
        },
        {
            "content": "October Sky is the best inspirational drama ever made, and it's one of my favorite movies of all time. This is one of those movies you can't pass up and overlook. It provides good life lessons on following your own footsteps and be ambitious of what you enjoy doing. Even if it makes you hardheaded, this movie shows how taking your own advice is never a bad thing. \n\nJake Gyllenhaal delivered a memorable performance, and he stood true to his role as the NASA Engineer, Homer Hickam, Chris Cooper delivered a solid performance as John Hickam who has a lot of pride of himself. Laura Dern is an underrated actress, and she gave a good performance since Jurassic Park. The rest of the cast played their part pretty well.\n\nThe storyline was fantastic, providing emotion, joyness, and sadness to appeal everyone, no matter how old you are. What made it better is that it's based on a true story, focusing solely on Homer Hickam's life as a teenager. \n\nHere's the website where you can read my full review for this movie: http://geodude91.blogspot.com/2013/07/october-sky-review.html#!/2013/07/october-sky-review.html",
            "review_date": "2013-07-27",
            "source": "rt"
        },
        {
            "content": "I highly recommend this movie.\nI absolutely love this movie. I love stories about people coming together and building things and accomplishing their dreams. This movie is that magic moment when you feel that spark of discovery and creativity of a dream. This movie is also about a father's relationship with his son. The performances in this movie are first rate and there are brief moments of comedy as well as loss. Every time I re watch this movie I get the urge to go out and do something more. I feel this movie is entertaining, inspiring and just all around great.\nThis is on the Green Embers' Recommended List!",
            "review_date": "2013-07-25",
            "source": "rt"
        },
        {
            "content": "One of my favorite films since I saw it when I was nine years old. October Sky is a film that captures the excitement and the imagination of four teenage boys who believed they could do anything. Director Joe Johnston perfectly recreates mid-century West Virginia in a way that only he could do, and allows his cast to do most of the leg work. Jake Gyllenhaal leads the amazing cast, which features Laura Dern, Chris Cooper, and Natalie Canerday, all of whom give powerful performances. A film that could have simply been about a journey to the stars actually becomes about a strained father-son relationship. If the conclusion of the film doesn't have you in tears, you don't have a soul.\n\nFor more movie reviews visit: www.reelfive.com",
            "review_date": "2013-07-23",
            "source": "rt"
        },
        {
            "content": "Seriously one of my favorite movies of all time!!! If you've ever had a dream, a mentor,  someone who believed in you... This movie will encourage you.  Watch it!",
            "review_date": "2013-07-17",
            "source": "rt"
        },
        {
            "content": "One of my favorite films of all time. Brings back precious childhood memories.",
            "review_date": "2013-07-16",
            "source": "rt"
        },
        {
            "content": "How silly dreams can become real with enough determination. Good movie.",
            "review_date": "2013-07-16",
            "source": "rt"
        },
        {
            "content": "A heartfelt drama that has plenty to offer. It starts really slow but it picks up fast and gives us much to like. The performances seem bad at first, but get better as the story get's more serious. It shows that anyone can achieve something greater if they believe and continue along with it. Doesn't matter what it is; just how hard you're willing to try to achieve it and that is a strong theme through the movie. Definitely one I would recommend.",
            "review_date": "2013-07-14",
            "source": "rt"
        },
        {
            "content": "This is a very good movie and its based on a true story. Amazing Sets and Accents,really takes you back in time to 1950's america. Worth Watching.",
            "review_date": "2013-07-08",
            "source": "rt"
        },
        {
            "content": "Loved it. I plan to watch it again soon.",
            "review_date": "2013-06-20",
            "source": "rt"
        },
        {
            "content": "October Sky is a very intelligent piece of work..its movie for all ages, Great performances from our four main teenage characters and other supporting characters, This movie makes me believe never to give up on your dreams",
            "review_date": "2013-06-05",
            "source": "rt"
        },
        {
            "content": "It can be a rather simple inspirational, follow your dreams type of movie at times, but it leaves you with an almost undeniably fulfilling ending that brings everything together beautifully, and It does quite often give you some originality.",
            "review_date": "2013-05-31",
            "source": "rt"
        },
        {
            "content": "Smart, sometimes funny, and had a great story from the start, October Sky is not only a lesson to father's and son's but also inspirational and well acted.",
            "review_date": "2013-05-31",
            "source": "rt"
        },
        {
            "content": "A nice coming of age story with the interesting feature of rocketry.",
            "review_date": "2013-05-28",
            "source": "rt"
        },
        {
            "content": "This is a really good movie!",
            "review_date": "2013-05-07",
            "source": "rt"
        },
        {
            "content": "I typically give 5 stars to movies that from beginning to end was fantastic with no major flaws or loss of motivation. This was definitely the case.",
            "review_date": "2013-04-20",
            "source": "rt"
        },
        {
            "content": "Has lots of emotion, and determination, along with good acting and a good story.",
            "review_date": "2013-04-20",
            "source": "rt"
        },
        {
            "content": "A movie about ordinary people doing extraordinary things :)",
            "review_date": "2013-04-15",
            "source": "rt"
        },
        {
            "content": "A wonderful family movie. It has laughs, tears, & inspiration. It's the true story of Homer Hickam Jr & based on the book \"RocketBoys\" & the strained relationship between a father & son. I love this movie.",
            "review_date": "2013-04-06",
            "source": "rt"
        },
        {
            "content": "inspiring and uncompromising and jjust so wonderful to watch every time",
            "review_date": "2013-04-01",
            "source": "rt"
        },
        {
            "content": "A touching story. I liked it a lot.",
            "review_date": "2013-03-19",
            "source": "rt"
        },
        {
            "content": "This is a film that can make you feel like anything is possible. It makes you want to chase your dreams, no matter what others may say or think. It's a wonderful story about dedication and rebellion.",
            "review_date": "2013-03-11",
            "source": "rt"
        },
        {
            "content": "?????????????? I only hope I can be as good a man as you.",
            "review_date": "2013-03-01",
            "source": "rt"
        },
        {
            "content": "A wonderful, inspiring film, even more so for being based on a true story. Jake Gyllenhaal and Chris Cooper are outstanding. As a teacher myself, I loved that their teacher played such a big part encouraging her students to fulfill their potential and their dreams. October Sky also points out that our school system doesn't give enough opportunities for academically gifted students to win scholarships to college, certainly not as many scholarships as there are for students who play sports. There should be more true stories like this one.",
            "review_date": "2013-02-28",
            "source": "rt"
        },
        {
            "content": "This movie is a treat to the soul. An inspiration to dare to dream and about living it!",
            "review_date": "2013-02-23",
            "source": "rt"
        },
        {
            "content": "It will remain in my memory forever. A beautiful watch!",
            "review_date": "2013-02-23",
            "source": "rt"
        },
        {
            "content": "psh!!! exelente pelicula!!",
            "review_date": "2013-02-16",
            "source": "rt"
        },
        {
            "content": "Its really Inspiring..............",
            "review_date": "2013-02-16",
            "source": "rt"
        },
        {
            "content": "Beautiful movie. Very inspiring",
            "review_date": "2013-02-08",
            "source": "rt"
        },
        {
            "content": "This movie was pretty good. The story was interesting, the characters were well developed and the acting was great. There were a few slow parts, but overall, a good movie. Grade: B+",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "An inspirational and heartwarming movie that lets you believe anything is possible with jst a little bit of support.",
            "review_date": "2013-02-02",
            "source": "rt"
        },
        {
            "content": "Amazing movie. There was some crude language, but the good themes of the movie overshadowed them. Homer grew up in a run-down mining town where the only way out was through football scholarship--but he overcame all obstacles, including the cynicism of his own father--and persevered, winning the national science fair and achieving his dreams. Powerful true story about perseverance, academics, and the American Dream.",
            "review_date": "2013-02-02",
            "source": "rt"
        },
        {
            "content": "This is one of the best movie ever made. Hands down.",
            "review_date": "2013-01-30",
            "source": "rt"
        },
        {
            "content": "Anyone who thinks this is a bad movie has no idea what they're talking about.",
            "review_date": "2013-01-29",
            "source": "rt"
        },
        {
            "content": "very inspirational!!",
            "review_date": "2013-01-29",
            "source": "rt"
        },
        {
            "content": "such a touching film.. one of my fond memories from middle school. :-)",
            "review_date": "2013-01-29",
            "source": "rt"
        },
        {
            "content": "Quite the feel good film.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "really cute movie.. i do not understand the obsession with rockets, love the based ona  true story thing.. and the ending is beautiful, the father is a great guy",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "Though lacking in subtlety, October Sky is a movie rich with comedy, drama and a good old fashioned feel good narrative.",
            "review_date": "2013-01-21",
            "source": "rt"
        },
        {
            "content": "Wonderfully crafted and infused with the kind of old-fashined, non-cynical inspiration that makes you want to reach for the stars, October Sky is one of the best films of its kind the 90's has to offer. Often-overlooked director Joe Johnston does some of the best work of his diverse career- the pacing is perfect and the emotion is always true. Featuring Jake Gyllenhaal in one of his most memorable roles and a terrific soundtrack, this movie teaches us that no dream is unattainable or worth giving up on- and reinforces it after each and every viewing",
            "review_date": "2013-01-17",
            "source": "rt"
        },
        {
            "content": "I liked it even though the dad was the stereotypical antagonist until he is realized to be misunderstood.",
            "review_date": "2013-01-15",
            "source": "rt"
        },
        {
            "content": "makes me regret not following my dreams.  just great.",
            "review_date": "2013-01-13",
            "source": "rt"
        },
        {
            "content": "\"October Sky\" stars Jake Gyllenhaal and Chris Cooper, is a great and memorable family film. Perhaps its greatest accomplishment is resisting to feel over sentimental, this' a feel good picture, and is compelling to the very end.",
            "review_date": "2013-01-09",
            "source": "rt"
        },
        {
            "content": "This movie works surprisingly well.  My only knowledge of Joe Johnston's work was for his F/X summer popcorn movies (Jurassic Park 3, Jumanji) and if this was one of those it was sure to be terrible, and if it wasn't - did he have the ability to tell a story like this?  The answer is most definitely yes. The performances are solid, but some of the accents are a bit dodgy.  Chris Cooper plays much the same role he always plays. Gyllenhaal and the other young actors all manage to create unique characters (thanks in part to good writing).  The movie manages to tap into memories of looking to the skies and marveling at the stars with a skill that rarely is seen.  It evokes similar feelings to space as Field of Dreams or The Sandlot do for baseball, and the effect is powerful, moving, and well worth the time.",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "I cried about 20 times during this film. Honestly, one of my new favorites.",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "loved it the first time i watched it  watched it more than 25 times",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "Homer H. Hickam Jr plays a young man growing up in a small town of Coalwood in WV. in the 1950's. After a night of residents coming together to watch the first man made satellite launched, Homer glances at the shooting star with amazement, it ultimately inspires him to start building rockets and learning more about science, and his least successful subject math, with the help of his friends, anything becomes possible, and the town is delighted by their high flying rockets. This is a heartwarming film with a great acting performance by Jake Gyllenhaal. There comes a time when a movie based on a true story is a winner, and this is one of them. The best and the most unforgetful scene would be when the father shows up with the town's people to show support for his son, though he wanted him to walk in his footsteps as a coal miner.",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "This is more than a great movie, it's a classic. Jake Gyllehaal is one of those actors that you can't quit watching, and you don't want to. A true story that warms the heart and inspires you to search for more, what your passionate about. A young boy growing up in Coalwood WV living with his firm father, sweet mother and athletic jock brother, Homer is expected to become a coal miner, but when he witness the first man made satellite in the nightly sky, he becomes interested in science and space, he decides to start building rockets with his friends, starting out as failure and turning it into a success when he enters a Science fair and gets to travel outside of his home town, the only place he's known. The ending is a perfect fix to what was missing throughout the movie, a son and his father sharing that bond that was truly heartwarming.",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "A lovable and true story which will live on forever.",
            "review_date": "2012-12-30",
            "source": "rt"
        },
        {
            "content": "My dad dragged me to this movie, I thought it looked horrible.  But I was  wrong.  it was very inspiring",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "Fine coming-of-age tale based on a true story. Jake Gyllenhaal, Chris Cooper and Laura Dern are all excellent!",
            "review_date": "2012-12-12",
            "source": "rt"
        },
        {
            "content": "We watch this movie all the time in school. It just gets better!",
            "review_date": "2012-12-09",
            "source": "rt"
        },
        {
            "content": "That cover stinks. Birds unite and plop on them! A standard film, nothing special here.",
            "review_date": "2012-12-07",
            "source": "rt"
        },
        {
            "content": "It's a very touching movie, everyone sould see it.",
            "review_date": "2012-11-30",
            "source": "rt"
        },
        {
            "content": "October Sky was a wonderful film. But every time I watch it and see Miss. Riley, I think of Ellie Saddler ( I love Jurassic Park). Also, I never knew Joe Johnston made this, and I could not believe it was him because he made Jurassic Park 3 (Ugggh) but he shows me now that he has potential. :)",
            "review_date": "2012-11-15",
            "source": "rt"
        },
        {
            "content": "\"October Sky\" is one of those movies that sneaks up on you. It doesn't seem very interesting, but the movie holds your attention with great performances and a fair amount of humor.",
            "review_date": "2012-11-10",
            "source": "rt"
        },
        {
            "content": "One of those childhood movies for me that has and will stand the test of time.",
            "review_date": "2012-11-07",
            "source": "rt"
        },
        {
            "content": "I absolutely LOVED this movie!!! Ju st saw it on AMC.  My son is an engineer also at NASA.  He recommended it and I'm glad he did.  THOROUGHLY ENJOYABLE MOVIE....and Chris Cooper was, AS USUAL, great in  his role, as were the other actors!!  Sonni Olsen.",
            "review_date": "2012-11-02",
            "source": "rt"
        },
        {
            "content": "This was the first PG-13 movie i ever saw and it has been my favorite movie ever since then!",
            "review_date": "2012-10-29",
            "source": "rt"
        },
        {
            "content": "It's an exceptional and poignant account of Homar Hickam's rise to success. Anyone in quest for inspiration should watch this film.",
            "review_date": "2012-10-23",
            "source": "rt"
        },
        {
            "content": "The Tragedy of Being Smarter Than Your Parents  \r\n\r\nIt can be hard to explain sometimes.  I am told that my father was incredibly intelligent, though I was too young at the time he died to have known.  My mother is not a stupid woman by any stretch of the imagination, but let us say that this is one of the many areas where I take after my father.  Mom was never anything but supportive, which may well have been in part because she had known my dad.  However, I never really felt that she understood.  How much worse would it have been if my mother had never had reason to understand or respect intelligence?  If she had seen my interest as betraying everything she stood for?  I don't know how many generations of this family worked in the mines, but it is true that the very idea of going to college meant Our Hero's turning his back on what his family stood for, what his father had done with his life.  It was intimidating to his father, and that's the great sorrow of the movie.\r\n\r\nOur Hero is Homer Hickham (Jake Gyllenhaal).  In October of 1957, he and his friends watched [i]Sputnik 1[/i] make its way across the sky, and they heard its beeping on the radio.  And Homer thought, \"That's my future.\"  He enlisted local nerd Quentin Wilson (Chris Owen) and Homer's friends Roy Lee Cooke (William Lee Scott) and Sherman O'Dell (Chad Lindberg), and together, they start building rockets.  The first ones aren't very good, but they get better and better.  However, Homer's father, John (Chris Cooper), isn't interested.  Homer's brother, Jim (Scott Miles), is a local football hero, and John respects that, but he doesn't respect the physics and trigonometry Homer is learning.  It only gets worse when the boys are accused of starting a forest fire with one of their rockets.  Homer has the support of the entire town, including teacher Freida J. Riley (Laura Dern), but not his father, despite the efforts of his mother, Elsie (Natalie Canerday).\r\n\r\nIt's sad, really.  The town was dying; there is no Coalwood, West Virginia anymore.  Traditionally, football was what let boys escape, when they could escape--football players got college scholarships.  Part of the conflict is that Homer is shown to know that, while his father did not.  His father is a coal miner, and that's all he knows.  He wants his boys to come and work in the coal mine, too; by turning his back on the mine, Homer is turning his back on his father.  (Though I can't help wondering what happened to girls who wanted to escape; they must have had even fewer options.)  The real-life Homer Hickham (who is a junior; his father's name is changed in this to avoid confusion) got out, but how many of his classmates went down into the mines when the mines closed?  How many died either in the mines or from mining-related causes?  It's still one of the most dangerous jobs in the US.  This country runs on coal still, and we need coal miners.  But coal mining is a hard life, and most of the boys in this movie never had any other choice.\r\n\r\nThe movie is sentimental almost to the point of syrup in places, but you know, it's good to see American ingenuity the focus of a family film.  For once, it isn't about the jocks, though the disc does come with a trailer for the movie of [i]Friday Night Lights[/i].  For once, it's the science fair that's what the town is cheering for.  And in many ways, that's how it should be; it's a lot easier to get out of a small town from being smart than being athletic.  There aren't enough spots on college football teams to take all the stars of the high school football teams, and there aren't enough spots in the pros to take all the stars of the college football teams.  If you can get an academic scholarship--and need-based grants--you've got a shot at a career that athletics can't necessarily provide.  We seem to spend too much screen time idolizing the careers that are hardest to get into, and while not everyone can be a rocket scientist, we do as a nation need to be training more engineers.\r\n\r\nI don't think everyone will understand the aspect of the movie which spoke most to me.  After all, the movie still does include Quentin to be mocked.  Even when the boys are the talk of the town, Homer assures Quentin that the girls still think he's weird.  Homer is expressly acknowledged to have difficulty with math.  However, if he's even of slightly above average intelligence, Homer is still smarter than most of the people around him, and his drive further sets him apart.  Heck, without him, Roy Lee and O'Dell would have gone down into the mines just like everyone else in town.  Leon Bolden (Randy Stripling) had been a Tuskegee Airman; while he works as an engineer, he still works for the mine.  Half the reason Homer goes down into the mine when he does is that the company owns their house and most of their furniture.  It doesn't seem to occur to his father that the kind of job Homer could get with an education would more than pay for their own house and furniture.",
            "review_date": "2012-10-05",
            "source": "rt"
        },
        {
            "content": "fantastic film............",
            "review_date": "2012-09-28",
            "source": "rt"
        },
        {
            "content": "A great inspirational movie to watch with your family. A true story.",
            "review_date": "2012-09-26",
            "source": "rt"
        },
        {
            "content": "pretty good movie, even if ur not crazy about space flight like me",
            "review_date": "2012-09-23",
            "source": "rt"
        },
        {
            "content": "This is one of my favorite movie's. It is an inspirational, feel-good drama. Well done!",
            "review_date": "2012-09-16",
            "source": "rt"
        },
        {
            "content": "A fantastic movie that tells a very good story. Excellent actors.",
            "review_date": "2012-09-14",
            "source": "rt"
        },
        {
            "content": "October Sky is a beautiful movie, with a younger Gyllenhaal and Cooper. I'd like to point out the fact that maybe genetics isn't the cause of Maggie's incapability.",
            "review_date": "2012-09-14",
            "source": "rt"
        },
        {
            "content": "This is great coming-of-age movie anyone can enjoy.",
            "review_date": "2012-09-08",
            "source": "rt"
        },
        {
            "content": "This movie is good because of how it relates to people on so many levels. We see a common father-son dynamic that Gyllenhaal and Cooper play brilliantly; that of a good man trying to be a good example instead of a good father, and that of a boy trying to balance making his father proud and following his own dreams. The added bonus of the friendships and mentoring teacher, make the film seem so genuine.",
            "review_date": "2012-09-02",
            "source": "rt"
        },
        {
            "content": "Solid, fun movie. Jake Gyllenhall's great, and Laura Dern is wonderful as always. The 50s music montages are a little too frequent, but who cares, it's fun and entertaining.",
            "review_date": "2012-08-31",
            "source": "rt"
        },
        {
            "content": "Inspiring and laced with old fashioned melodrama, this is one of those movies that tugs right at the heart.",
            "review_date": "2012-08-31",
            "source": "rt"
        },
        {
            "content": "An inspirational story of coal miner becoming one of NASA greatest scientist. This is has an uplifting message.",
            "review_date": "2012-08-27",
            "source": "rt"
        },
        {
            "content": "can't remember this movie terribly well but from what i recall it's another inspirational story. Gosh i hate that genre. I guess if you are in to that sort of thing this movie was pretty good but since i'm not my rating reflects that.",
            "review_date": "2012-08-26",
            "source": "rt"
        },
        {
            "content": "It genuinely inspires you, a feat few movies have accomplished.",
            "review_date": "2012-08-15",
            "source": "rt"
        },
        {
            "content": "\"October sky\" is a very good and inspirational movie and a touching representation of the south of the united state during the fifties The story deals with inspiration dreams and achievement and mostly the way to chase his dreams and to support and understand the people who want to realize  them.The realization and especially the acting serve very well this great  feel good story that succeed by touching and inspiring all of us .It is truly one of this story that gives you the desire  to achieve great things in life and for those adepts of feel good story and movies  A very good and a  well made one.Therefore without saying it is movie not to miss it should be fair saying that it is recommended to everyone .",
            "review_date": "2012-08-08",
            "source": "rt"
        },
        {
            "content": "I ALMOST CRIED...SAD BUT TRUE...",
            "review_date": "2012-08-08",
            "source": "rt"
        },
        {
            "content": "my fav jake gyllenhaal movie its such a great story about a kid trying to get out of town and make a name for himself emotional fantastic story",
            "review_date": "2012-08-04",
            "source": "rt"
        },
        {
            "content": "my 2nd most fav movie..",
            "review_date": "2012-07-30",
            "source": "rt"
        },
        {
            "content": "I remember watching this movie when I was younger,great movie",
            "review_date": "2012-07-28",
            "source": "rt"
        },
        {
            "content": "what do you think im going to school to do",
            "review_date": "2012-07-24",
            "source": "rt"
        },
        {
            "content": "Look's like there's 2 famous homer's after all",
            "review_date": "2012-07-23",
            "source": "rt"
        },
        {
            "content": "this is the best movie ever!",
            "review_date": "2012-07-18",
            "source": "rt"
        },
        {
            "content": "October Sky is a sincere, superb coming-of-age film that will uplift everybody's spirits. A truly work of art just like other inspirational drama films like Stand By Me,  American Graffiti, Rebel Without a Cause and many others.",
            "review_date": "2012-07-07",
            "source": "rt"
        },
        {
            "content": "A great family film.  Even better because it's based on a true story.  I guess it shows how good Gyllenhaal is that a few years later, he makes Donnie Darko.  Quite a role change.  Chris Cooper, as usual, is fantastic as a hard nosed, coal mining father.  There are a few holes, but overall, the payoff is worth it.",
            "review_date": "2012-07-06",
            "source": "rt"
        },
        {
            "content": "This movie is one that everyone needs to see. The simple story of a boy who wants to become a rocket scientist, despite the incredible odds and pressure brought up by his hometown, and especially his own father. For a film that has comedic moments, lovable and relatable characters, complex father-son relationship, and happy achievements, this movie has something special for everyone, and it's journey to everyone's hearts is \"going to go for miles.\"",
            "review_date": "2012-07-03",
            "source": "rt"
        },
        {
            "content": "\"October Sky\" is a wonderful drama with splendid acting and the young characters are so ambitious and enthusiastic about rockets that you're just warmed to the heart and can't help but smile. It's a sentimental movie, but it's almost never schmaltzy. My rating: 3.5 stars out of 4 stars.",
            "review_date": "2012-06-29",
            "source": "rt"
        },
        {
            "content": "Really a great movie. Laura Dern was fantastic",
            "review_date": "2012-06-22",
            "source": "rt"
        },
        {
            "content": "very well made. a good story for sure.i thought the actors were good too.",
            "review_date": "2012-06-18",
            "source": "rt"
        },
        {
            "content": "GREATEST bio ever +  Music",
            "review_date": "2012-06-11",
            "source": "rt"
        },
        {
            "content": "Deeply moving with a whole lot of heart. It inspires you to defy the odds and follow your passion, your heart and your dreams.",
            "review_date": "2012-05-31",
            "source": "rt"
        },
        {
            "content": "The acting is great it's just fairly mundane.",
            "review_date": "2012-05-31",
            "source": "rt"
        },
        {
            "content": "this movie lives in my memory. Very motivational. A great family film",
            "review_date": "2012-05-28",
            "source": "rt"
        },
        {
            "content": "A very underrated movie.",
            "review_date": "2012-05-26",
            "source": "rt"
        },
        {
            "content": "Proto-Estes rockets with a slice of history, plus a strong advocacy of public education and the potential good it can do in the right hands?  Yes please.",
            "review_date": "2012-05-20",
            "source": "rt"
        },
        {
            "content": "A league of enthusiastic small town kids try to make better of themselves through the trials and tribulations of rocket construction...it's innocent, inspiring and a metaphor for moving forward.",
            "review_date": "2012-05-17",
            "source": "rt"
        },
        {
            "content": "There couldn't be a better movie to make me revise my 2nd year in college! It's so nostalgic and inspiring!",
            "review_date": "2012-05-14",
            "source": "rt"
        },
        {
            "content": "great movie! has cussing but it was one I let the family watch.  WONDERFUL!",
            "review_date": "2012-05-12",
            "source": "rt"
        },
        {
            "content": "\"October Sky\", from a plot standpoint, may not be the most original film of its decade.  It comes from the same warm, character-driven formula that made films like \"Hoosiers\" and \"Rudy\" so successful, but it is oddly this same charming quality that makes \"October Sky\" such a gem.  What \"Hoosiers\" and \"Rudy\" did for sports, \"October Sky\" does for science and education; it celebrates a human accomplishment against all odds.  It is this rare quality, in addition to a witty screenplay, an array of fine performances, sharp direction by Joe Johnston, and a heartbreaking score by Mark Isham that make \"October Sky\" one of the finest \"Hollywood\" dramas of the 90s.  That this film is actually based on a true story by NASA engineer Homer Hickam makes it even more valuable--you wouldn't trade it for a pot of gold.",
            "review_date": "2012-05-11",
            "source": "rt"
        },
        {
            "content": "This was movie that was shown every year in my middle school. This is a very well acted and well written movie about the Homer Hickam's dream and passion of making rockets and some day becoming a rocket engineer and designer like his hero.",
            "review_date": "2012-05-08",
            "source": "rt"
        },
        {
            "content": "This is one of my all time favorites. It's inspiring, funny, and even sad. The story consists of Homer Hickam Jr., who lives in  the mining town of Coalwood where you either go to college on a football scholarship, or work in the coal mine. Homer baffles everyone by trying to build rockets. He enlists the help of his friends and an unpopular nerd genius to try and show the town that they can win the science fair against all odds. It's got lovable characters and a great storyline. I love it.",
            "review_date": "2012-05-07",
            "source": "rt"
        },
        {
            "content": "I love historic films.  Especially films that are so compelling that the narrative can focus on the story aspect instead of working hard to sell the audience that they're in another time.  October Sky is a simple, but heartfelt tale about Homer H. Hickman, a man who I never knew existed prior to this film's release.  Homer grew up in a small town, but dreams to live a life better than what his stomping grounds can offer.  A tale many of us can relate to.  But this is also a story about winning the love of your father, and never giving up on your dreams no matter how impossible they seem.  Speaking to us with these universal themes, director Joe Johnston delivers a powerful drama that will move you to tears.  Highly recommended.  This film is just a delight.",
            "review_date": "2012-05-05",
            "source": "rt"
        },
        {
            "content": "boyfriend's breakout movie and I used to watch it at the video store all the time",
            "review_date": "2012-05-05",
            "source": "rt"
        },
        {
            "content": "Awesome movie, ( recommended )",
            "review_date": "2012-05-04",
            "source": "rt"
        },
        {
            "content": "It looks awesome so want to see it",
            "review_date": "2012-05-03",
            "source": "rt"
        },
        {
            "content": "October Sky is a solid film; which I haven't seen this remarkable film since high school, and the first time viewing it, I fell in love with it.\n\nGreat performance by all our cast especially from Jake Gyllenhaall. The story was moving, inspirational, and coherent since it was based on a true story. \n\nOverall if you want to see a touching heart-warming film, then October Sky is a film you don't want to miss.",
            "review_date": "2012-05-03",
            "source": "rt"
        },
        {
            "content": "This movie was great! I was made to watch but, it did stroke your imagination. And, no I don't like because Chad's in it but, he was pretty young which was strange...but anywho...\r\nI highly recommend you see this. It's just a great movie, great story (which is real by the way) and it had family rivaly. But, life ended up being good for everyone.",
            "review_date": "2012-04-22",
            "source": "rt"
        },
        {
            "content": "Pretty good.Its a good movie.",
            "review_date": "2012-04-19",
            "source": "rt"
        },
        {
            "content": "this was a good movie. i enjoyed it and thought that gylenhall was pretty good in it",
            "review_date": "2012-04-17",
            "source": "rt"
        },
        {
            "content": "i liked the book and the movie was good, even on the 32nd time, thanx mom, lol",
            "review_date": "2012-04-16",
            "source": "rt"
        },
        {
            "content": "I love the movie. I read the book and i love the book too. ITS a GREAT MOVIE",
            "review_date": "2012-04-16",
            "source": "rt"
        },
        {
            "content": "possibly a half star better? it's been a long time since i've seen it. based on a true story. inspiring.",
            "review_date": "2012-04-13",
            "source": "rt"
        },
        {
            "content": "pretty good to be a true story.",
            "review_date": "2012-04-13",
            "source": "rt"
        },
        {
            "content": "Great and very moving movie. A story that kept my interest and ultimately was very touching.",
            "review_date": "2012-04-05",
            "source": "rt"
        },
        {
            "content": "yeah, dat was a good movie.",
            "review_date": "2012-04-04",
            "source": "rt"
        },
        {
            "content": "i LOVE this movie, and Jake is amazing",
            "review_date": "2012-04-04",
            "source": "rt"
        },
        {
            "content": "Wonderful story, which was accentuated because they didn't try to tack on a love interest, and force it into the focus of the movie",
            "review_date": "2012-04-01",
            "source": "rt"
        },
        {
            "content": "Fell In Love With Jake from watching this movie.",
            "review_date": "2012-03-31",
            "source": "rt"
        },
        {
            "content": "ohh i love it!!! its so way cute, it did make me cry though",
            "review_date": "2012-03-31",
            "source": "rt"
        },
        {
            "content": "I love Math, but it wasn't always like that, and this movies is one of the reasons, the part when the main character lears while working is quite inspirational",
            "review_date": "2012-03-30",
            "source": "rt"
        },
        {
            "content": "Very touching and real. Great screenplay, superb acting, amazing cinematography! What else could you ask for?",
            "review_date": "2012-03-22",
            "source": "rt"
        },
        {
            "content": "Truly inspirational movie with a simple cast. It starts slow but all is portrayed so well as the movie goes on. All actors did so good with their characters. Showing real rocket boys at the end was so great.",
            "review_date": "2012-03-22",
            "source": "rt"
        },
        {
            "content": "Really nice movie. Great to watch with your kiddo if you have one who can follow a plot and doesn't mind a slower pace. G loved it!",
            "review_date": "2012-03-08",
            "source": "rt"
        },
        {
            "content": "Very cute, \"feel good\" movie that few people know about.  It hits home with drama, cries, laughs and everything else a movie should have.",
            "review_date": "2012-03-07",
            "source": "rt"
        },
        {
            "content": "cute inspirational movie. it was a great movie.",
            "review_date": "2012-03-06",
            "source": "rt"
        },
        {
            "content": "A dull movie, dull characters, dull atmoshphere. The determination the main character has is pretty inspiring, but other than the last 15 minutes or so, you're not missing much if you havent seen this film. Plus, Homer's teacher ending up in the hospital made me audibly groan, because of course after the main character get's everything he desires, something HAS to go wrong, and it was insanely unsatisfying. The fact that you don't even find out what becomes of that subplot just makes it pointless...",
            "review_date": "2012-03-01",
            "source": "rt"
        },
        {
            "content": "October Sky was a phenomenally predictable snorefest that must have been going down a cliche checklist.  The formula used was so tired and faithfully followed that I can see its skeleton.  It has nothing creative to offer and no inspiration to give.  I don't see anyone taking anymore inspiration to follow their dreams from October Sky than they would from a bumper sticker.",
            "review_date": "2012-02-28",
            "source": "rt"
        },
        {
            "content": "I can relate to this one...",
            "review_date": "2012-02-18",
            "source": "rt"
        },
        {
            "content": "One of my favorite films.",
            "review_date": "2012-02-15",
            "source": "rt"
        },
        {
            "content": "A fantastic look at what was happening in small town America during the Cold War era. Great performances by Jake Gyllenhaal, Chris Cooper and Laura Dern, this uplifting and dark look at the late 50's offers the inspiration we all need in our lives.",
            "review_date": "2012-02-10",
            "source": "rt"
        },
        {
            "content": "good movie, good story, good acting and great music.",
            "review_date": "2012-02-08",
            "source": "rt"
        },
        {
            "content": "'October Sky' is a good retelling of actual events of how a team of boys who want to escape life underground in Coalwood, West Virginia, where coal mining is king. But by October 4, 1957, when the Soviet satellite Sputnik flies overhead in the night sky, Homer Hickam Jr.'s life is changed forever. So with the help of his teacher, he and his three buddies start an amateur rocket program way out of the town limits. Even with his father's disapproval, a limited education, and a series of misfires that threaten his dreams and the town, Homer overcomes seemingly impossible odds to achieve his vision of earning his college scholarship and working in rocket science later in his lifetime. And he brought us this inspiring drama of his life, all immortalized on the screen.\n\nBased on the real Homer Hickam Jr.'s book 'Rocket Boys' and directed by Joe Johnston, 'October Sky' has good acting performances. I liked Jake Gyllenhaal's young Hickam character as well as his sense of individuality. Supporting Gyllenhaal includes Laura Dern (Ms. Riley) and Chris Cooper (John Hickam), both of which were very interesting characters. The film soundtrack is so inspiring for the 1950s setting; Buddy Holly's \"That'll Be The Day\" and sometimes the background instrumentals really sets me in a good mood.\n\nWhat can I say about 'October Sky'? It's a great historical drama for all audiences to enjoy, including the 1950s-era fans and the rocket scientists of the world.",
            "review_date": "2012-01-25",
            "source": "rt"
        },
        {
            "content": "This is the true story of Homer Hickam, Jr.- a bright teenager obsessed with rockets and science who, much to the befuddlement of his family and neighbors of his small, working class coal mining town, defied the odds to follow his dreams during the space race years of the 50s. \n\nIt's a very inspiring story that is filled with heart, warmth, humor, and does a good job at dealing with issues of family, working class life, and following one's dreams. That, and it's got a notable cast including a young Jake Gyllenhaal, Chris Cooper, and Laura Dern.\n\nHickam did eventually become a NASA engineer, but the film primarily focuses on the earliest leg of that journey, and the scenes of him and his friends trying to get into the rocket game for themselves are both funny and charming. \n\nThis is Joe Johnston making a nice drama and pulling it off pretty well. He's got a spotty record, but this is one of his better efforts, and one I find my self enjoying quite a bit each time I see it. Sure, there are shades of typical tropes like the father wanting the son to follow in his footsteps, and people interested in a subject that doesn't fit in with what everyone else in their locale appreciates, but it's handled decently, and the performances are nice, too.",
            "review_date": "2012-01-11",
            "source": "rt"
        },
        {
            "content": "The writing is not always spectacular, but October sky is a fully inspirational story that is never afraid to show its emotions.",
            "review_date": "2012-01-08",
            "source": "rt"
        },
        {
            "content": "not as good as the book. still, the things they changed made for a better movie. it is funny and the acting is top notch.",
            "review_date": "2012-01-03",
            "source": "rt"
        },
        {
            "content": "BEST MOVIE EVER...i cried...many times",
            "review_date": "2011-12-29",
            "source": "rt"
        },
        {
            "content": "It's a very touching movie, everyone sould see it.",
            "review_date": "2011-12-27",
            "source": "rt"
        },
        {
            "content": "One of my top 100 movies for sure - this movie combines heart, heroics, humor, and just a dash of history into a journey through the eyes of a teenage boy with a big dream. \r\n\r\nFrom start to finish, I was captivated by all aspects of the film. So much, in fact, that it makes me want to go out and start building rockets myself. \r\n\r\nIf you've not seen this film yet, it is well worth a rental on a quiet afternoon.",
            "review_date": "2011-12-27",
            "source": "rt"
        },
        {
            "content": "This is a great story of determination. This goes up against any sports motivation movie... It just features geeks. Homer and his Dad choked me up at the end.",
            "review_date": "2011-12-24",
            "source": "rt"
        },
        {
            "content": "Really nice show. Really heart warming story and great acting. Love the powerful message behind it. Thoroughly enjoyable.",
            "review_date": "2011-12-20",
            "source": "rt"
        },
        {
            "content": "Just a really nice movie. One of those movies that if you were to have kids you'd sit them down to watch this because it tells a good story about hard work and loyalty. Good performances all around, Chris Cooper could play the tough dad blind folded.",
            "review_date": "2011-12-17",
            "source": "rt"
        },
        {
            "content": "this is an excellent movie",
            "review_date": "2011-12-04",
            "source": "rt"
        },
        {
            "content": "not bad.  not great but not bad.",
            "review_date": "2011-11-17",
            "source": "rt"
        },
        {
            "content": "I almost finished watching this movie, and I found it really appealing.",
            "review_date": "2011-11-11",
            "source": "rt"
        },
        {
            "content": "à¹?à¸à¹à¸-à¸²à¸ coming-of-age à¸­à¸µà¸?à¹?à¸¥à¹à¸§",
            "review_date": "2011-11-06",
            "source": "rt"
        },
        {
            "content": "Deeply moving with a whole lot of heart. It's something you'll want to believe in because it is something to believe for.",
            "review_date": "2011-11-05",
            "source": "rt"
        },
        {
            "content": "Inspirational and perfectly set in the Cold War",
            "review_date": "2011-11-03",
            "source": "rt"
        },
        {
            "content": "Very inspirational!!! Worth watching, always follow your dreams :-)",
            "review_date": "2011-11-03",
            "source": "rt"
        },
        {
            "content": "This movie definitely had a lot of passion. The story kept me interested, and I thought it did a great job at evolving. I liked the characters and the ending was good.",
            "review_date": "2011-10-29",
            "source": "rt"
        },
        {
            "content": "amazing, inspirational",
            "review_date": "2011-10-29",
            "source": "rt"
        },
        {
            "content": "watched it!  loved it!",
            "review_date": "2011-10-24",
            "source": "rt"
        },
        {
            "content": "One of the most inspirational movies ever made, October Sky fuses its spirit with Hollywood elements to create a heartwarming, entertaining drama",
            "review_date": "2011-10-20",
            "source": "rt"
        },
        {
            "content": "very good storyline.  very well played.",
            "review_date": "2011-10-02",
            "source": "rt"
        },
        {
            "content": "This is a fine drama and a nice change of pace from today's more hectic and loud films. It is another solid based-on-a-true store, which still means much of it could be made up for dramatic purposes. Frankly, I don't know but I liked the story.",
            "review_date": "2011-10-02",
            "source": "rt"
        },
        {
            "content": "An inspiring story about growing up in the late 50's. The film has great values like the pursuit of dreams and perseverance. However, though this may seem typical or seen hundreds of times, the film still manages to be something special. This is so because it was beautifully filmed and even better acted. The film is also very sweet and absolutely enjoyable. It transmits perfectly the nature and essence of the time it was set, and along with the music, both were important elements in the film. Jake Gyllenhall gave an inspired, believable and inspiring performance, and the whole cast was excellent as well. The film is far from being a masterpiece, but it was a very well done and pretty feel-good movie from the late 90's.",
            "review_date": "2011-09-19",
            "source": "rt"
        },
        {
            "content": "An inspiring story about growing up in the late 50's. The film has great values like the pursuit of dreams and perseverance. However, though this may seem typical or seen hundreds of times, the film still manages to be something special. This is so because it was beautifully filmed and even better acted. The film is also very sweet and absolutely enjoyable. It transmits perfectly the nature and essence of the time it was set, and along with the music, both were important elements in the film. Jake Gyllenhall gave an inspired, believable and inspiring performance, and the whole cast was excellent as well. The film is far from being a masterpiece, but it was a very well done and pretty feel-good movie from the late 90's.",
            "review_date": "2011-09-19",
            "source": "rt"
        },
        {
            "content": "A nice film that is insipiring and entertaining at the same time. JG showed that he had some talents even in tender age. October Sky is a classic and a fun one.",
            "review_date": "2011-09-14",
            "source": "rt"
        },
        {
            "content": "Really solid drama about some kids trying to build model rockets. It is a really good film, well shot, with lots of good characters, funny and dramatic moments, and a good cast. I found the heart of this film to be quite strong, I mean it definitely a feelgood movie, but it has plenty of sad points as well.  Definitely a winner.",
            "review_date": "2011-09-14",
            "source": "rt"
        },
        {
            "content": "another one of my favorites of all time.",
            "review_date": "2011-09-07",
            "source": "rt"
        },
        {
            "content": "Classic inspirational movie, always follow your bliss. - A true story.\n\nVery strong character dept and development and strong performances.",
            "review_date": "2011-09-06",
            "source": "rt"
        },
        {
            "content": "I recall seeing this in theaters. I have seen it a few times since then. Based on what I remember, this was a very touching film. I will elaborate once I see it again.",
            "review_date": "2011-09-04",
            "source": "rt"
        },
        {
            "content": "Great movie, best performance of Jake Gyllenhaal I've seen.",
            "review_date": "2011-08-27",
            "source": "rt"
        },
        {
            "content": "Saw  this recently, yea,a  little  late, but, really  enjoyed  it . \r\nThe  fact  that  it's  based  on  a  true  story, is  even  better  .\r\nThere  are  those  of  us, who  not  obly  dare  to  dream, but  try  everything \r\nto  make  those  dreams  come  true .  This,  is ,  one  of  those  films . \r\nOne  of  those  true  storys .  You'll   be  glued  to  it,  because you  will\r\nreally  want  to  know  how  it's  going  to  end .  You'll  want  to  know \r\nif,  relationships  will   last,  or  come  together .  I  rate  this  as  a  must  see\r\nmovie .   You  might  need   a  few  tissues,  too .   It's  about  family, freindship,  and  doing   the  almost  impossible .",
            "review_date": "2011-08-25",
            "source": "rt"
        },
        {
            "content": "This is how you make an insperational movie without it coming off as a \"made-for-TV movie.\" Great acting, good production quality, all around amazing.",
            "review_date": "2011-08-11",
            "source": "rt"
        },
        {
            "content": "Lovely, simple and after watched it I got a great feeling of joy, I dunno... Maybe a young Jake its the reason LOL",
            "review_date": "2011-07-31",
            "source": "rt"
        },
        {
            "content": "a movie that full of emotions and inspirational..makes me wants to watch it over and over",
            "review_date": "2011-07-30",
            "source": "rt"
        },
        {
            "content": "inspirational & emotional --- watch it to feel it...",
            "review_date": "2011-07-26",
            "source": "rt"
        },
        {
            "content": "I saw this in math Class and loved it instantly, a real film of dreams and ambitions.",
            "review_date": "2011-07-25",
            "source": "rt"
        },
        {
            "content": "Older movie, but I watched it again today after a long time.  Still great!  Has a vibe similar to \"Stand By Me\".  I highly recommend this one.",
            "review_date": "2011-07-23",
            "source": "rt"
        },
        {
            "content": "\"One dream is enough to light up the entire sky.\"\n\n       A touching and emotionally charged triumph from Director Joe Johnston (Honey, I Shrunk The Kids, Jumanji).  October Sky is based on the truly inspirational childhood story of NASA Engineer Homer Hickham Jr. and his journey through a tough adolescence.  Overcoming tough family, social and educational issues, Homer was able to conquer the impossible, and in doing so, inspired an entire town.  Homer, along with his childhood friends (nicknamed \"The Rocket Boys\") are all examples of pure determination and integrity.  It's just a towering film that does everything right, it's not overly dramatic, it's littered with humor and it captivates you with it's very intense emotional concepts.  I'm a sucker for true stories, when they're done right, they can be a vessel to endlessly amazing stories and people.  October Sky is a stirring and engaging piece of expert craftmanship from acclaimed director Joe Johnston, it's tremendously powerful, spectacularly inspirational, amazingly intriguing, emotionally gripping and undeniably superb.  A film that should be shown to every student in every school, a perfect example of the timeless saying...you can do anything you put your mind to.  This one will sear itself into your memory and stay with you forever.  A small town American story that will forever have a place in your heart.  It's a slow-moving, but tensely told story that you won't be able to take your attention from.  A beautiful American story that's unlike anything you'll ever see. \n          The acting is excellent with brilliant performances from everyone involved.  Jake Gyllenhaal is excellent, Chris Cooper is brilliant, Laura Dern is great and Chris Owen does well too.  The talent shines in every scene.  The story was spectacular to begin with, but factor in the brilliant talents of the cast, it truly does click on all cylinders.",
            "review_date": "2011-07-16",
            "source": "rt"
        },
        {
            "content": "One of the best dramas of all time. It makes you feel smarter by the end. I once wanted to be an astronaut. The story line is fantastic.",
            "review_date": "2011-07-12",
            "source": "rt"
        },
        {
            "content": "A superior feel-good film, one that has intelligence to go along with its old-fashioned sensibilities...",
            "review_date": "2011-07-08",
            "source": "rt"
        },
        {
            "content": "Extremely inspirational movie with a great performance by Jake Gyllanhaal.(Don't know if I spelled that correctly) It had a great ending and that kind of ending seems to only come in fiction but this wasn't fiction.",
            "review_date": "2011-07-08",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies. An inspirational true story!",
            "review_date": "2011-07-05",
            "source": "rt"
        },
        {
            "content": "Great inspirational movie with outstanding performance by the cast.\nJust AWESOME..........................!",
            "review_date": "2011-07-02",
            "source": "rt"
        },
        {
            "content": "Que buena pelÃ­cula, no me canso de verla y el mensaje que te deja es Ãºnico",
            "review_date": "2011-06-29",
            "source": "rt"
        },
        {
            "content": "An absolutely oustanding film. October sky is an incredibly touching film that tells a wonderfull story about teens in a small forgotten town who want to do something more than just the expected. The movie really does an excellent job at recreating an old forgotten town and brings back the look and feel of the late 50s. This is essential as this helps set the tone and mood. But the anchor of the film is Jake Gyllenhaal. He gives a rich performance as the well meaning and somewhat spontaneous teenager who dreams of something more than what is expected of him. He is a very sympathetic character because he feels emotions and goes through things that many people can relate to. The other great performance is Chris Cooper as his strict and rahter unsupportive father. The drama between father and son is honest and touching and creates some very good tension. But above all October Sky is about chasing dreams and the determination to succeed despite what others may say or think and succeeds at being an authentic and honest tale of inspiration. Very highly recomended",
            "review_date": "2011-06-22",
            "source": "rt"
        },
        {
            "content": "A wonderful, uplifting, realistic film",
            "review_date": "2011-06-21",
            "source": "rt"
        },
        {
            "content": "Hmm. . .well that was refreshing. I can honestly say that after watching Joe Johnston's \"October Sky\" I feel a whole lot better about everything. Truly just an overwhelmingly inspiring and uplifting film. I mean you could take the most cynical, mysanthropic soul on this planet, have him watch \"October Sky\", and he'd have a healthier outlook on his life. I swear, during the last 10 minutes of this movie, I had the biggest shit-eating grin on my face - one of those endings you just can't help but get caught up in. The film features an abundant amount of fine performances. Namely, Jake Gyllenhaal's portrayal of Homer Hickam, and Chris Cooper's compelling turn as his father, John. Other great performances came from Laura Dern, Chris Owen, William Lee Scott, and Chad Lindberg. The movie is shot to a magnificent degree. For instance, Cinematographer Fred Murphy really uses dismal lighting to magnify the miserable atmosphere within Coalwood, West Virginia. The movie is also edited to a tee. \"October Sky\" also possesses a brilliantly written screenplay that effectively tells the story with emotion as well as convey the narratives heartwarming themes. Overall, I feel that \"October Sky\" is an awe-inspiring coming-of-age tale of perseverance, respect, and hope. It's a movie that everyone can learn something from. I know I did.",
            "review_date": "2011-06-17",
            "source": "rt"
        },
        {
            "content": "Such a hilarious movie, and I love the strong West Virginia accents",
            "review_date": "2011-06-17",
            "source": "rt"
        },
        {
            "content": "i can't believe chris cooper got the black lung",
            "review_date": "2011-06-13",
            "source": "rt"
        },
        {
            "content": "Hokie Hokie Hokie Hi!",
            "review_date": "2011-06-11",
            "source": "rt"
        },
        {
            "content": "I really liked this movie, it was very funny, and I love accents. The storyline was great.",
            "review_date": "2011-06-10",
            "source": "rt"
        },
        {
            "content": "One of the few movies I know that few people don't like....",
            "review_date": "2011-06-09",
            "source": "rt"
        },
        {
            "content": "A rare family film that succeeds with great power and acting",
            "review_date": "2011-05-31",
            "source": "rt"
        },
        {
            "content": "A great feel-good movie.\n4 stars",
            "review_date": "2011-05-31",
            "source": "rt"
        },
        {
            "content": "A enjoyable, feel-good film based on a true story, to probably quote a movie critic somewhere out there.  This film has Oscar written all over it...I'm honestly puzzled why it didn't even get nominated.  Anyway, this is a film definitely worth seeing...pretty much anyone would like October Sky.",
            "review_date": "2011-05-30",
            "source": "rt"
        },
        {
            "content": "I really love this movie. Its a little on the sentimental side but the performances and story are great. Be carful with this one, lots of tear jerking moments.",
            "review_date": "2011-05-30",
            "source": "rt"
        },
        {
            "content": "The Makings of a Rocket Scientist Here, Quite Good.",
            "review_date": "2011-05-29",
            "source": "rt"
        },
        {
            "content": "an entertainingly family blast with memorable and majestic moments that will satisfy greatly and deeply to familes and all ages! A+",
            "review_date": "2011-05-28",
            "source": "rt"
        },
        {
            "content": "A sickening adaptation of a beloved novel. The triumphs of the original novel were lost to the attempt at tugging at the heartstrings. Tragic, because I know many people loved the film yet, missed out on the true greatness of the story. Furthermore the story pacing played out as a mishmash of scenes. Even the talent couldn't save the film for me.",
            "review_date": "2011-05-26",
            "source": "rt"
        },
        {
            "content": "This is pretty much my love most film in High School. Especially the quote by homer \"Coal mining may be your life, but it's not mine. I'm never going down there again. I wanna go into space. \"  That very scene is absolutely the reason that I start to love Jake Gyllenhaal since then.",
            "review_date": "2011-05-24",
            "source": "rt"
        },
        {
            "content": "'October Sky' is a perfect example of how some movies can prove a lot by doing very little. \n\nThis is a simple film with a story that is deep and sincere. The young actors come through in every scene, and the periodic atmosphere of a small town community helps to magnify the issue",
            "review_date": "2011-05-22",
            "source": "rt"
        },
        {
            "content": "It's too prodigious to even criticize. October Sky is one of the best dramas in movie history and teaches a valuable lesson to students still in grade school.",
            "review_date": "2011-05-21",
            "source": "rt"
        },
        {
            "content": "This movie is amazing! Anyone should watch it! It's funny, sad, realistic, wistful, touching and unique.",
            "review_date": "2011-05-18",
            "source": "rt"
        },
        {
            "content": "I'm in middle school and my lazy teachers show a lot of movies (because they don't want to teach), and 90% of them are crap beyond belief, but October sky was an exception. It was quite predicitable, formuliac and a bit cheesy at times, but it was still well made, and man, was I surprised when I saw that it was directed by Joe Johnston. I was amazed that he could go from directing a movie as mature as this, to a complety immature film - Jurassic Park 3. The Acting was pretty decent, and I thought Laura Dern in particular was great, she kind of reminded me of Sandra Bullock's character from The Blind Side. The main thing in the film that I found annoying was Homer's (the main character) relationship with his dad. We've seen this \"Dad-wants-his-son-to-follow-in his-footsteps-and son-wants-to-be-independent\" relationship so many times, I got bored with the father-son scenes, instead of being entertained. But, all that being said, it was still a good movie, and if you haven't seen it and have got the time, I recommend checking it out.",
            "review_date": "2011-05-09",
            "source": "rt"
        },
        {
            "content": "Luckily, it's more touching than cheesy and overdone. Plus, it's fun to see Baby Southern Gyllenhaal.",
            "review_date": "2011-05-07",
            "source": "rt"
        },
        {
            "content": "I haven't seen this in forever.",
            "review_date": "2011-05-01",
            "source": "rt"
        },
        {
            "content": "very good \"time capsule\" movie capturing the american sentiment at the time the Russians were ahead of us in the space race, with a happy ending that doesn't become maudlin. Three cheers for the American Dream!",
            "review_date": "2011-04-26",
            "source": "rt"
        },
        {
            "content": "Cute movie. Does a great job capturing the feeling of the era. Man, Jake G looks young.",
            "review_date": "2011-04-24",
            "source": "rt"
        },
        {
            "content": "Only movie by this dude I've liked.",
            "review_date": "2011-04-24",
            "source": "rt"
        },
        {
            "content": "Great for inspiration.",
            "review_date": "2011-04-23",
            "source": "rt"
        },
        {
            "content": "This movie is all about a son and his father. Very good movie. I love ya dad!!!!",
            "review_date": "2011-04-21",
            "source": "rt"
        },
        {
            "content": "Favorite movie of all time!!!!!!!!!!",
            "review_date": "2011-04-19",
            "source": "rt"
        },
        {
            "content": "One of my Favourites!!! Highly Inspiring",
            "review_date": "2011-04-06",
            "source": "rt"
        },
        {
            "content": "Great movie where the hero who is looking to escape a coal mining town uses his mind rather than his athletic ability.  Great Father and son story...truly inspirational.",
            "review_date": "2011-04-05",
            "source": "rt"
        },
        {
            "content": "Talvez um dos melhores filmes que jÃ¡ vi em minha vida ...",
            "review_date": "2011-03-28",
            "source": "rt"
        },
        {
            "content": "A heartwarming movie with great actors and a great story. B+",
            "review_date": "2011-03-26",
            "source": "rt"
        },
        {
            "content": "Best thing in the world.",
            "review_date": "2011-03-26",
            "source": "rt"
        },
        {
            "content": "I hate this movie, maybe that means I'm unAmerican. It's boring, the characters are so stupid. I don't believe that people act like that in real life.",
            "review_date": "2011-03-25",
            "source": "rt"
        },
        {
            "content": "One of my all time favorites.",
            "review_date": "2011-03-24",
            "source": "rt"
        },
        {
            "content": "A very nice movie.......",
            "review_date": "2011-03-18",
            "source": "rt"
        },
        {
            "content": "For years,I wanted to watch this movie - many good things take years to happen !\r\n\r\nWell,a simple depiction often needs genius and this movie proves it - there are thousands of people in this world who succeeded in achieving their dreams but there are few inspiring and ingenuous tales around - most of them surrounded by hoopla and glamour.\r\n\r\nThe characters in the movie all make a mark,especially,Mr.John Hickam and Ms. Riley stand out (no offence to the hero Homer).I myself hail from a once-a-small-town and hence,could well appreciate the bonds that people share in small places.\r\n\r\nSome picks from the movie are quite appealing and touching :\r\n\r\n1: Homer is lower down the mine elevator and watching the Sputnik in the sky again.\r\n2: The boys running to stop the train they think coming on the track they dislodged.\r\n3: Quentin asking Homer not to tell where he lives and Homer soothing him humorously.\r\n4: Ms. Riley watching the final rocket from her hospital bed.\r\n\r\nThe movie's background score,though not a masterpiece,suits well the fabric of the movie.\r\n\r\nFor all those who feel being shackled by stupor,this movie can really give you the leap !",
            "review_date": "2011-03-15",
            "source": "rt"
        },
        {
            "content": "Boring and no uplifting scenes. Good story and concept, but no reason to love Gyllenhaal and the rest.",
            "review_date": "2011-03-10",
            "source": "rt"
        },
        {
            "content": "Great film.  Inspirational.",
            "review_date": "2011-03-05",
            "source": "rt"
        },
        {
            "content": "It's good, glowing and sentimental. But sometimes, like the rocket, the film soars to a height where my sense can't follow anymore.",
            "review_date": "2011-03-03",
            "source": "rt"
        },
        {
            "content": "Great movie! One of the best based in West Virginia.",
            "review_date": "2011-03-01",
            "source": "rt"
        },
        {
            "content": "Fantastic movie and Laura Dern was actually really hot. :)",
            "review_date": "2011-02-23",
            "source": "rt"
        },
        {
            "content": "Amazing performance of Jake Gyllenhaal, plus a great true story makes this movie a must-see.",
            "review_date": "2011-02-23",
            "source": "rt"
        },
        {
            "content": "An inspirational story of coal miner becoming one of NASA greatest scientist. This is has an uplifting message.",
            "review_date": "2011-02-14",
            "source": "rt"
        },
        {
            "content": "A truly great family movie with a powerful message!",
            "review_date": "2011-02-03",
            "source": "rt"
        },
        {
            "content": "Wonderfully etched out movie...a must see...and being a true story, it jus  makes u feel the 'wow'!",
            "review_date": "2011-01-27",
            "source": "rt"
        },
        {
            "content": "Once in a while, all the elements of a film blend together seamlessly to create a wonderous whole and this is one such movie! Guaranteed to have you on your feet and cheering Homer on! I will never tire of watching this!",
            "review_date": "2011-01-20",
            "source": "rt"
        },
        {
            "content": "feel good movie, with brilliant father son relationship.",
            "review_date": "2011-01-20",
            "source": "rt"
        },
        {
            "content": "A truly inspiring movie !!! some scenes were really unforgettable !!",
            "review_date": "2011-01-18",
            "source": "rt"
        },
        {
            "content": "One of my all time favorite movies. Inspiring and absolutely true.",
            "review_date": "2011-01-13",
            "source": "rt"
        },
        {
            "content": "i wasnt expecting much but it actually surprised me",
            "review_date": "2011-01-12",
            "source": "rt"
        },
        {
            "content": "if you need a little push to follow your dreams, this is the ticket...",
            "review_date": "2011-01-09",
            "source": "rt"
        },
        {
            "content": "Sometimes all the elements of a film blend together into a wondrous whole and this is one such movie! Guaranteed to have you on your feet and cheering Homer on! I will never tire of this!",
            "review_date": "2011-01-09",
            "source": "rt"
        },
        {
            "content": "Really, my only interest in seeing this movie was that Jake Gyllenhaal was in it. It's not something I would normally watch, so I didn't expect miracles. It's not bad, but it's also not something I could watch over and over, or something that I'll be likely to remember for years to come. It's solid enough- just not something I'm terribly intrigued by. If science is your thing, you'll probably find this more enjoyable than I did.",
            "review_date": "2011-01-06",
            "source": "rt"
        },
        {
            "content": "Good...I love the fact that is based on true events...It's the type of story that tells you to fight for your dream, and that studying will get you places",
            "review_date": "2011-01-06",
            "source": "rt"
        },
        {
            "content": "It was based on true story, and it was brilliant!",
            "review_date": "2011-01-03",
            "source": "rt"
        },
        {
            "content": "Very inspiring. Very well done.",
            "review_date": "2010-12-24",
            "source": "rt"
        },
        {
            "content": "one of my favorite movies of all time... reminds me of joshy boy, it gave me that kind of wonder feeling... like no matter what was expected of me... i made my future ... no one else",
            "review_date": "2010-12-19",
            "source": "rt"
        },
        {
            "content": "Despite the terrible setting I watched it in (Mr Warner's 4th form english class with a bunch of noisy as fuck kids) I still remember liking this movie. Unfortunately I can't really comment on the specifics of the film because I saw it 3 years ago. Easily understood, good storyline, might have cried, but can't remember. Probably not cos it was in class, but otherwise I might have, can't remember. seriously I don't know what I'm talking about, but I like this movie, go watch it.",
            "review_date": "2010-12-19",
            "source": "rt"
        },
        {
            "content": "Deep characters I'll admit,but the story wasn't that good.",
            "review_date": "2010-12-16",
            "source": "rt"
        },
        {
            "content": "Great story about the road to success.",
            "review_date": "2010-12-16",
            "source": "rt"
        },
        {
            "content": "Simply amazing. One of the best underdog stories of all time and it isn't even about sports. Truly shows how not giving up even when it's easiest gets you very far in life. Wonderfully acted. This is a movie that will stay with me throughout my life. Truly inspiring.",
            "review_date": "2010-12-16",
            "source": "rt"
        },
        {
            "content": "A masterpiece in every sense of the word ...",
            "review_date": "2010-12-14",
            "source": "rt"
        },
        {
            "content": "I forgot about this little gem until I caught it on AMC tonight. Simply put, and inspiring movie.",
            "review_date": "2010-12-07",
            "source": "rt"
        },
        {
            "content": "Love it, One of The Best I ever saw",
            "review_date": "2010-12-03",
            "source": "rt"
        },
        {
            "content": "Good movie and based on a true story. I really enjoyed this film. The parts with building and launching rockets were cool. This film also captured living in an isolated city in West Virginia well and the message is to follow your dreams. This persons dream was NASA and it came true.",
            "review_date": "2010-11-28",
            "source": "rt"
        },
        {
            "content": "This is definitley a movie that should inspire anyone who watches it. I kind of look at this movie like a continuation of Stand By Me. Homer would be an older version of Gordy, both of whom wanted something more out of life than just the usual. The great music bumped this up to 4.5 stars, which isn't something I give out frequently.",
            "review_date": "2010-11-28",
            "source": "rt"
        },
        {
            "content": "Read the book then saw the movie.  Loved them both!",
            "review_date": "2010-11-28",
            "source": "rt"
        },
        {
            "content": "One of the most inspiring movies I've seen and it's overall just an excellent movie. I love it and so does everybody else I know that's seen it. It's funny, exciting,and just great.",
            "review_date": "2010-11-28",
            "source": "rt"
        },
        {
            "content": "Once in a while, a special movie comes along where all the parts blend seamlessly together to make a wondrous whole and this is one of those movies! Guaranteed to have you on your feet and cheering Homer on. I, for one, will be cheering him on again tonight!",
            "review_date": "2010-11-25",
            "source": "rt"
        },
        {
            "content": "Book is so much better, but still good.",
            "review_date": "2010-11-23",
            "source": "rt"
        },
        {
            "content": "Really solid drama about some kids trying to build model rockets.  It is a really good film, well shot, with lots of good characters, funny and dramatic moments, and a good cast.  Definitely a winner.",
            "review_date": "2010-11-13",
            "source": "rt"
        },
        {
            "content": "what a touching movie this was....the fact that its based on true events make it even better....really builds well with great tension between Gyllenhaal and Cooper.....the ending brings it home well",
            "review_date": "2010-11-08",
            "source": "rt"
        },
        {
            "content": "October Sky is a film heavy on the stereotypes and the clichÃ (C)s of hard life in the south. It focuses on the life of a real person, Homer Hickham(played by Jake Gyllenhaal), and his struggle to fulfill his passion in a town where getting a scholarship is a million to one shot and mining coal is the only way of life. I had originally seen this movie when I was about 10, and it was always one of my favorites. I loved the violin music that complements the nice cinematography showcasing the grit of West Virginia in 1957. The acting was also very good, even though it may have been stereotyped a big, and the language slacked a little. Chris Cooper plays a convincing and frustrated father who works opposite Jake Gyllenhaal who is a bright young man with huge dreams. The story is something we've all seen before but just can't stop watching. Joe Johnston, the director, created a very well made movie that makes us feel good as others like \"Remember the Titans, \" or \"The Shawshank Redemption,\" did. But again, who can ever tire of that formula? So, looking back at it now, there are some spotty parts and the chances of the 4 \"Rocket-boys,\" actually winning the Science Fair is scarce, but what makes it all tie together is the fact that it was based on a true story. We can sympathize with the 4 boys because their life is so tough and realistic it's almost heart-breaking to imagine what would've happened if they hadn't won the Science Fair. The way the movie plays out is almost like a Stephen King type story, where there are 4 boys all in a hick town where nothing good ever happens. Well, this is what a Stephen King story would most likely look like if it had a happy ending. Which is common in a movie like this, and yeah, how often does your dad who hates you ever come to see you perform on your last show? In this movie it appears probable. For those who may not understand the film's intent, just get it cleared out of the way before you watch the movie, that it IS meant to be uplifting and some what inspirational. I know it was for me when I was 10, and I still look back on it fondly as a favorite.",
            "review_date": "2010-11-07",
            "source": "rt"
        },
        {
            "content": "There are not enough superlatives in the English language to adequately celebrate the qualities of this movie. Director Joe Johnston handles this poetic examination of a teenage boy's unquenchable desire to cut his own path in life with a tenderness and affection for his subject. Gyllenhaal is extraordinary as the younger son of a West Virginia coal miner, determined to escape the gravitational pull of the coal mine while desperately trying to earn his father's understanding and respect. Chris Cooper shows he's one of the best actors working today with his gritty, totally genuine portrayal of John Hickam, the father struggling to come to terms with his son's maverick aspirations of a life far from the coal seams of Appalachia. The supporting cast is universally outstanding, particularly Laura Dern as Homer's inspirational high school teacher. Mark Isham's score, rich in bluegrass-y fiddle solos, beautifully captures the spiritual essence of the film. One of my top ten favorite films of all time.",
            "review_date": "2010-11-05",
            "source": "rt"
        },
        {
            "content": "October Sky ins the best feel good movie ever made. One of the things thats great about the film is the film doesn't go over board in it's sentimentality. Never does it feel overly sentimental, corny or embarrassing. This is the type of film that you will definitely feel good right after watching it.  You really sympathize with the characters because they are brilliantly played by the cast. I can't recall the number of times I've seen this film, but it's at least over a dozen times. Unlike other family films that try to be overly sentimental just for the sake of being family friendly and to appeal to a bigger audience. October Sky has something that separates it from other feel good films, and thats a very good story, and I mean good. October Sky is the true story of Homer Hickam a teenager who spots the Sputnik satellite and who decides to built his own rocket and enter the science fair. His dad is highly against it, and wants him to work in the mine. Homer has other ideas. October Sky is really a story about accomplishing your dreams, and achieving the impossible. This is simply an incredible story about perseverance and determination and unlike other feel good films, this is a true story, and the way it's told on film is beautiful. The film is brilliantly directed by Joe Johnson, director of Jumanji, and he crafts yet another great film. October Sky is a well acted film, the actors here are incredible and this was one of Jake Gyllenhaal's first staring roles, and is just the right person for this role.  Also a performance that is equally great is Chjris Cooper as Homer's father who opposes Homer's dreams. Both actors electrifying as they butt heads on screen as we see their conflicting ideas unfold. Chris Cooper is fine and underrated actor, and this is the first film that I've seen that exposed me to his work. October Sky is a solid feel good film and like I said, this is one of the best too. A fine cast upholds this film, and Johnson has got a fine script at hand. and because of that, the film works very well. The beauty part about this film is that this is the type of film that will stay with you long after you've seen it, and everyone can take something positive away from it. A fine film that in one word can be summarized as beautiful.",
            "review_date": "2010-10-24",
            "source": "rt"
        },
        {
            "content": "inspirational story inspirational: how to live your dream...",
            "review_date": "2010-10-24",
            "source": "rt"
        },
        {
            "content": "God... I've actually watched like half o this movie... So long ago I don't even remember. It wasn't until I read the plot when I realised... @_@",
            "review_date": "2010-10-18",
            "source": "rt"
        },
        {
            "content": "Fun look at these boys who become great influences in the development of space travel.",
            "review_date": "2010-10-17",
            "source": "rt"
        },
        {
            "content": "An American Masterpiece! Your Soul will LIFT OFF!",
            "review_date": "2010-10-12",
            "source": "rt"
        },
        {
            "content": "Sin Duda una de mis pelÃ­culas Favoritas, muy inspiradora, Si uno cree y se dedica lograra lo que uno desee",
            "review_date": "2010-10-06",
            "source": "rt"
        },
        {
            "content": "One of the best movies Ive ever seen. Classic.",
            "review_date": "2010-09-30",
            "source": "rt"
        },
        {
            "content": "This movie was great! I was made to watch but, it did stroke your imagination. And, no I don't like because Chad's in it but, he was pretty young which was strange...but anywho...\r\nI highly recommend you see this. It's just a great movie, great story (which is real by the way) and it had family rivaly. But, life ended up being good for everyone.",
            "review_date": "2010-09-29",
            "source": "rt"
        },
        {
            "content": "Its very inspiring ,touching and motivating... Must watch for students,teachers and parents",
            "review_date": "2010-09-28",
            "source": "rt"
        },
        {
            "content": "Delicious feel good movie.",
            "review_date": "2010-09-24",
            "source": "rt"
        },
        {
            "content": "October Sky is a perfect example of great actors doing great, yet simple, things to entertain audiences.",
            "review_date": "2010-09-20",
            "source": "rt"
        },
        {
            "content": "wat to say abt dis movie...\r\nmust watch it....\r\ni dnt hve ny words to define d beauty of dis movie....",
            "review_date": "2010-09-20",
            "source": "rt"
        },
        {
            "content": "Based on real story & touching...",
            "review_date": "2010-09-19",
            "source": "rt"
        },
        {
            "content": "It's actually not a bad movie for what it's based on.  I recently bought it on dvd so I could have it in my collection.",
            "review_date": "2010-09-16",
            "source": "rt"
        },
        {
            "content": "Great movie, I found it surprizingly inspiring. Being from a small town like Coalwood myself, you can level with Homer.",
            "review_date": "2010-09-15",
            "source": "rt"
        },
        {
            "content": "WATCHED IN TECHNOLOGY CLASS WHEN I WAS IN SCHOOL GOOD MOVIE",
            "review_date": "2010-09-13",
            "source": "rt"
        },
        {
            "content": "this is an excellent movie",
            "review_date": "2010-09-13",
            "source": "rt"
        },
        {
            "content": "Great story about the road to succes",
            "review_date": "2010-09-02",
            "source": "rt"
        },
        {
            "content": "very good movie!! i needed to be reminded how it is to chase a dream ;)\nhad seen it before, but didnt remember a lot..",
            "review_date": "2010-08-31",
            "source": "rt"
        },
        {
            "content": "I can't get over how much I love this movie!",
            "review_date": "2010-08-29",
            "source": "rt"
        },
        {
            "content": "The film has a good story with dedicated acting, somewhat melodramatic, but overall is ok.",
            "review_date": "2010-08-25",
            "source": "rt"
        },
        {
            "content": "The most Inspiring movie ever made...Brilliant..",
            "review_date": "2010-08-14",
            "source": "rt"
        },
        {
            "content": "Much like Glory this is one of those rare films that aim to inspire and be a feel-good movie and actually reaches the highs it aims for. Although the screenplay doesn't have anything new to it. It's the actors that make it work. Jake Gyllenhaal in his first movie is terrifc and shows us the talent he would continue to show in Lovely and Amazing, Donnie Darko, Zodiac and Brokeback Mountain. The equally gifted Laura Dern has never been so heart warming in a role and Chris Cooper once again shines in his role. It's one of those films that you fall in love with because even with it's hollywood glam you can still see the human hands the movie was made with. Believable, subtle, and consistently intelligent! i loved this movie, awsome. inspiring.",
            "review_date": "2010-08-13",
            "source": "rt"
        },
        {
            "content": "October Sky benefits from a devoted cast, a well-developed script, and the never disappointing direction of Joe Johnston. Without a doubt, this is a true classic.",
            "review_date": "2010-08-07",
            "source": "rt"
        },
        {
            "content": "This movie is set in the 1960's and based on the true story told in the novel \"Rocket Boys.\"  The story follows the life of four boys from a small coal-mining town.  The main character, Homer Hickman, wants to be a rocket scientist, not a coal miner.  The movie is a great inspiration to anyone who has a dream to do more with their life than people expect of them.  The acting in this movie is excellent.  Jake Gyllenhaal and Laura Dern were particularly powerful in their roles.",
            "review_date": "2010-08-02",
            "source": "rt"
        },
        {
            "content": "Ever since this movie came out in 1999 my mother has been telling me to watch it. Being the movie lover I am, it's hard to believe I hadn't taken the time until today. Over the years, I've heard nothing but praise for October Sky - the characters, the story, \"it's just so good!\" - and my mother was right. \r\n \r\nBased on a true story, October Sky is one of the most heartwarming, uplifting films I've seen in a long time. It features incredible performances from Jake Gyllenhaal, Chris Cooper, Laura Dern and a host of other actors, whose characters add to the story's depth and charm. I laughed, I cried, I loved every moment, and I highly recommend seeing it. Don't wait 11 years like I did.",
            "review_date": "2010-07-31",
            "source": "rt"
        },
        {
            "content": "this movie is really inspiring",
            "review_date": "2010-07-31",
            "source": "rt"
        },
        {
            "content": "When I first saw this film I was completly suprised by how good it was and will probably go as far to say that this film is \"great\". First im going to give credit to the actors who all filled the roles of these historic characters perfectly. But most of all I would say it was a toss up between Chris Cooper and Jake Gyllenhaal for who did the best in the film. Cooper's character of Homer's father could be unlikeable at times but deep down you knew what kind of person he was and would do anything for his family. Gyllenhaal played Homer Hickman perfectly and is right next to his performance in Donnie Darko to be the best of his carrer which to some people isnt saying a lot but overall Gyllenhall is a pretty good actor. Also the other actors were good as well from Laura Dern, Chris Owen, William Lee Scott, and Chad Lindberg were all great in this film. Besides the acting I would say the directing is the best part. Joe Jhonston really let us know how important  this story and these characters really are and made the actors fill their roles perfectly. The writing is also good but I woulden't call it great I felt some words were rushed and easily used. Also the film can be a little overly dramatic and will try hard to make you tear up but it doesn't try \"that\" hard. This is also one of the most inspiring films i've seen and will always be in the right mood to watch it again. If you haven't seen it than you need to see it. A great film. 90%",
            "review_date": "2010-07-12",
            "source": "rt"
        },
        {
            "content": "a very inspiring story....a must see for everyone....\nit gives a great true  inspiration.....\nA must watch for every person who wants to aspire for something.....",
            "review_date": "2010-07-09",
            "source": "rt"
        },
        {
            "content": "It's an amazing true story and a classic that can be enjoyed any number of years into the future.",
            "review_date": "2010-07-06",
            "source": "rt"
        },
        {
            "content": "Earnest and inspiring, but lacking a significant punch and a strong lead. 75/100",
            "review_date": "2010-07-05",
            "source": "rt"
        },
        {
            "content": "Inspiring and unforgettable, this film is worth it.",
            "review_date": "2010-07-04",
            "source": "rt"
        },
        {
            "content": "It's hard not to like this movie-and the fact that it's based on a true story only makes it more inspiring.",
            "review_date": "2010-07-01",
            "source": "rt"
        },
        {
            "content": "It was okay, but the whole time I really felt like it was oversimplified. Like, there weren't really enough elements to the plot to actually make it engaging. Contradicting what most critics have said I certainly do not think it was well crafted.",
            "review_date": "2010-06-28",
            "source": "rt"
        },
        {
            "content": "This movie is absolutely wonderful. It one of my favorite movies that's based on a true story. Absolutely wonderful.",
            "review_date": "2010-06-27",
            "source": "rt"
        },
        {
            "content": "SPUTNIK, such an inspiration...Great Movie",
            "review_date": "2010-06-26",
            "source": "rt"
        },
        {
            "content": "a amazing movie that plays with human physiology the way a baby plays with his toys: naturally and in a way you would take for granted until you realize that its impossible to recreate something so simple.  the movie was amazing the the fact that it was based of a true thing makes it closer to your heart.  this movie should not be limited by only 100%",
            "review_date": "2010-06-21",
            "source": "rt"
        },
        {
            "content": "pretty good movie, even if ur not crazy about space flight like me",
            "review_date": "2010-06-18",
            "source": "rt"
        },
        {
            "content": "This movie is wonderful.  It is a very insperational film.  It is about a boy(Jake Gyllenhaal) in the 1960s, who sees Sputnick shoot across the sky and gets inspired.  So he and his friends start building rockets.  Also, this is based on a true story.  OCTOBER SKY gets a 10 out of 10.",
            "review_date": "2010-06-18",
            "source": "rt"
        },
        {
            "content": "You should watch it............",
            "review_date": "2010-06-16",
            "source": "rt"
        },
        {
            "content": "Very corny; but it is acceptable at least for making the supposed to be boring story more interesting.",
            "review_date": "2010-06-13",
            "source": "rt"
        },
        {
            "content": "iznenadio me neki dan na TV1000, i lagano uvukao. \n\nvideli ste nesto slicno, skoro sigurno, al to nikako ne umanjuje utisak.\n\na utisak kaze da je ovo jako dobar film.\n\ndobar scenario, sjajni glavni protagonisti, tema koje nikad nije suvise.\n\ni sve to lepo upakovano, sa pravom merom.",
            "review_date": "2010-06-09",
            "source": "rt"
        },
        {
            "content": "a very inspiring story.. do not let anything get into your way to pursue your dreams. Have to believe in yourself.",
            "review_date": "2010-06-06",
            "source": "rt"
        },
        {
            "content": "Muy linda historia sobre seguir tus suenios =D por gente que persigue sus suenios es como se engrandece la humanidad =)",
            "review_date": "2010-06-02",
            "source": "rt"
        },
        {
            "content": "Totally underrated movie. I don't know how this flopped. It's got the inspirational angle, a great soundtrack; it's just a great movie. And yeah, this is Jake Gyllenhaal as a kid. Chris Cooper does really well with his character; that was a tough role to play seeing as that he has to portray a man with rigid beliefs and a lot of pride but with an intent to do the right thing. And you'll root for Homer the whole way to achieve his dream of leaving his mine town in West Virginia. SEE THIS MOVIE.",
            "review_date": "2010-05-31",
            "source": "rt"
        },
        {
            "content": "A real heart warming and inspirational gem! Great movie to motivate any young adult/teen who is having trouble finding direction or inspiration or keen to embark on a career path different from what their parents want.",
            "review_date": "2010-05-31",
            "source": "rt"
        },
        {
            "content": "actually pretty interesting.",
            "review_date": "2010-05-29",
            "source": "rt"
        },
        {
            "content": "just watch it. there is no way you will not like this film",
            "review_date": "2010-05-27",
            "source": "rt"
        },
        {
            "content": "October Sky is by far one of the few most inspirational movie I have ever seen. It clearly shows that doing what everyone does might not be the best for you but doing what you really want to do will get you places or at least makes you feel good! This is a movie for everyone who didn't have a chance to follow their heart but knows what it is like to follow our heart. Amazing movie, must watch for everyone and definitely for many in India!!",
            "review_date": "2010-05-27",
            "source": "rt"
        },
        {
            "content": "untuk  ukuran film drama yang di angkat dari kisah nyata,,film ini benar2 memberi kesan dan sangat inspiratif bagi kita semua... makna yang terkandung dalam film memberi banyak pelajaran untuk pemuda2 zaman skrng...di kemas dgn sangat baik..film ini langsung nyantol di hati gw....",
            "review_date": "2010-05-21",
            "source": "rt"
        },
        {
            "content": "Laura Dern is hot, I'd watch Pleasantville with her instead of Joan Allen any day after Jurassic Park she could have taken the lead in any movie she got asked to do",
            "review_date": "2010-05-20",
            "source": "rt"
        },
        {
            "content": "It was a grate Movie!",
            "review_date": "2010-05-19",
            "source": "rt"
        },
        {
            "content": "Okay, I'll try to keep this review short and brief.  First off, I was sick with the chicken pox when I first watched this film.  So, I can't remember everything exactly, but what I really know is this:  I really liked the film.  I don't know a lot about the true story, but let's stick to the basics of the film.  \n     There was great acting, directing, and it was well written for the screen.  Everything seemed to flow smoothly from start to finish and the boys' in the film make you feel somewhat inspired.  I would also like to mention that there is a great score composed by Mark Isham accompanying the film.  \n     For the content, there is some language including a few profanities and vulgarities along with a briefly scene obscene hand gesture.  There are also a few mild swear words scattered throughout the film.  However, swearing is used infrequently.  Other than that, a few rockets blow up and almost injure some people, and we also see some injured coal miners and see the danger they face every day.\n     All that being said, \"October Sky\" is a great movie that I highly recommend!  4 1/2 stars.",
            "review_date": "2010-05-17",
            "source": "rt"
        },
        {
            "content": "It's fine. Couple of cringe-worthy lines and some hammy acting, but otherwise I can't flame it for anything major. Harmless entertainment.",
            "review_date": "2010-05-16",
            "source": "rt"
        },
        {
            "content": "Oh I just loved this movie!",
            "review_date": "2010-05-10",
            "source": "rt"
        },
        {
            "content": "October Sky inspires any individual to follow their dreams and you can succeed.",
            "review_date": "2010-05-08",
            "source": "rt"
        },
        {
            "content": "Its the biggest FILM of the summer.",
            "review_date": "2010-05-03",
            "source": "rt"
        },
        {
            "content": "A complete gem of a movie...will surely touch ur heart.",
            "review_date": "2010-05-01",
            "source": "rt"
        },
        {
            "content": "What an inspirational story!!!!! Should be seen by every youngster in the world!",
            "review_date": "2010-04-29",
            "source": "rt"
        },
        {
            "content": "An instant classic which will stand the test of time, a true story brought back to life on camera, an overall enjoyable and well-done film.",
            "review_date": "2010-04-18",
            "source": "rt"
        },
        {
            "content": "One of Joe Johnston's stand out films that really should have gotten more exposure.",
            "review_date": "2010-04-13",
            "source": "rt"
        },
        {
            "content": "Although a bit slow moving. The acting of Gylenhall and Cooper really carry this Film. It reveals power of ingenuity and determination scholastically, and what you can achieve through hard work.\r\nI did get wrapped up with the focus on science and the enthusiasm  shown for it by the four Geeky kids, when they tried to focus on what was important to them despite obstacles.\r\nIt does get shown on TV, so you can catch it, or rent it on the cheap.",
            "review_date": "2010-04-12",
            "source": "rt"
        },
        {
            "content": "True story or not, this is a joke. Hate to be hard on any film, but do we always have to have movies with actors speaking southern? As if that adds credibility?  \r\n\r\nThis film with its 50's soundtrack, reminded me of a lame attempt at American Graffiti.\r\n\r\nHomer launches rockets in the midst of the Russian Sputnik threat.  Is this a plot?\r\n\r\nThis bothers me as so weak and concocted.  Even if it's based on a true story.  \r\n\r\nWithout a half hour passing by I saw this film as a waste of my time.  Maybe not yours, but mine.  \r\n\r\nA very pretentious and silly film seeking a profound statement.  Perhaps we should fast forward to the end of the film to see the climax.",
            "review_date": "2010-04-12",
            "source": "rt"
        },
        {
            "content": "Funny and inspirational. I dont know if this was a normal reaction, but when I was watching this film I felt inspired to go out there and take control of my life. I felt like a lot of teenagers should be able to relate to this film and the way the main character has to fight to achieve his dream\r\n\r\nAlso worth mentioning is that Jake Gyllenhaal and the actor who plays his father are both fantastic in this film. Good cinematography as well",
            "review_date": "2010-04-11",
            "source": "rt"
        },
        {
            "content": "A Science lover's dream come true.! A very inspirational movie which is based on a true story or rather person! very under rated movie! One of my fav engineering flicks!",
            "review_date": "2010-04-09",
            "source": "rt"
        },
        {
            "content": "Set in the late 1950s, October Sky is about a group of young boys in a coal-mining town. Homer, the main character is obsessed with launching rockets and with the inspiration of a schoolteacher comes from building rockets in the basement against his fathers will to designing components and showing them off in a national science fare. The film is a classic about a group of friends achieving something that wouldnt be impossible without each other.  In the film Homer (Jake Gyllenhaal) struggles to avoid the dead end life of a coal minor, that his father wants him to come and take over the coal mining business, which is not what he wants to become. \r\n\r\nThe Director Joe Johnston wittedly conjures up the 1950s teenage social order.  Johnston also places the town  out  of the way of anything that survives off mining where everybody belives that mining is the only way to survive and feed their families. During one school year, Homer and the rocket boys blast off into futures their parents didn't decide for them. Corny? Sure, but it is a movie that almost everybody will love.\r\n\r\nTowards the end of the movie you see everybody that was once in his way step aside and help him to become a part of NASA, but that's another story. Personally I thought it was a great movie but I found the story very traditional, meaning that I found that it was about the same thing with nothing overly appealing. To me it was about love, friends, and reaching what appears to be the impossible that turns out to be not so impossible. Overall I loved it and would watch it again, as it was not painful to watch.\r\n\r\nHaving all this in mind, the film is a fine line between a classic story of friends and reaching your dreams. I found the movie a great movie for anyone looking for a movie that combines friends, love and fun.",
            "review_date": "2010-03-29",
            "source": "rt"
        },
        {
            "content": "truly inspiring.....",
            "review_date": "2010-03-26",
            "source": "rt"
        },
        {
            "content": "Very Good. The book is better.",
            "review_date": "2010-03-19",
            "source": "rt"
        },
        {
            "content": "Great movie with magnificent story and brilliant acting. Doing something extraordinary lies in the integrity of any man. Soundtrack is awesome.",
            "review_date": "2010-03-17",
            "source": "rt"
        },
        {
            "content": "When I first saw this movie in 8th grade Language Arts class, I thought \"Hmm, another boring movie\". But then as it got deeper into the film I thought \"Holy crap, this is a damn good movie!\" And then class ended. The performances were outstanding, and the story is truly inspiring to people to let them chase their dreams and let nothing stop them.",
            "review_date": "2010-03-11",
            "source": "rt"
        },
        {
            "content": "Of all the movies I've had to watch in a schoolroom in my life, October Sky is my favorite. Jake Gyllenhaal plays a wonderful role as Homer, an oppressed student who longs to break free of the gloomy mining town he lives in. He sees his chance when he witnesses the launch of Sputnik, and organizes a team of his classmates and friends that builds their own rockets. Homer learns through aeronautics about friendship, his future, and most importantly, pursuing your dreams no matter what the cost.",
            "review_date": "2010-03-04",
            "source": "rt"
        },
        {
            "content": "A good ture story about simple times and focused efforts.",
            "review_date": "2010-03-02",
            "source": "rt"
        },
        {
            "content": "A classic under dog story where the final success is as gratifying as it is inevitable.",
            "review_date": "2010-02-28",
            "source": "rt"
        },
        {
            "content": "There are many moments in October Sky that will induce that revealing lump in your throat.  It's an inspiring, feel-good story about a son pursuing his dreams all the while trying desperately to earn the respect of a doubting father.  The only unfortunate aspect of the film is two unfathomable characters, one whose presence is critical to the plot.\r\n\r\nWas Homer Hickman Sr. really that opposed to his son pursuing rocketry?  In the world I come from, that is unimaginable.  Realizing this all takes place in the infancy of space exploration, it is reasonable to suspect a coal mining superintendent would encourage his son to follow him into the mines.  But the level of obsession written in for this character reeks of exaggeration.  It heightens the conflict, but I couldn't help but roll my eyes through some of those scenes shared by father and son.\r\n\r\nEven more perplexing was the school principal.  I found him to be a completely unrealistic character.\r\n\r\nBut enough with the negativity.  Anyone and everyone will enjoy this film.  The four youths, the \"Rocket Boys\", all bring something unique to the screen.  I always enjoy Natalie Canerday (Mrs. Hickam), mainly because I love that wonderful Sling Blade accent of hers. There is also an ample dose of humor to go along with the math and the various conflicts that arise.  And once the town gets behind these boys, it becomes quite a rollicking fun ride indeed.",
            "review_date": "2010-02-27",
            "source": "rt"
        },
        {
            "content": "In the movie Homer say's \"You know, it, uh, won't fly unless somebody pushes the button.\" And the movie has truly flew past the whole sky. Truly Awesome!!!",
            "review_date": "2010-02-16",
            "source": "rt"
        },
        {
            "content": "Not a lot to say, it was a good movie with great performances.",
            "review_date": "2010-02-15",
            "source": "rt"
        },
        {
            "content": "A phenomenal film that anybody can enjoy. It's touching and inspiring. (First viewing - Spring 1999 in theaters)",
            "review_date": "2010-02-13",
            "source": "rt"
        },
        {
            "content": "Friday, February 12, 2010\r\n\r\n(1999) October Sky\r\n\r\n Well made DRAMA that has a satisfying superficial ending.  This film also consists some of the same music as The Corn is Green starring Bette Davis also about a coal mining town But instead of just being another film about any mining town, this film pursues other ideologies and in this case rockets!!\r\n\r\nBased on an actual novel called Rocket Boys on actual events and is extremely well made!\r\n\r\nThis film gets a\r\n4 out of 4",
            "review_date": "2010-02-12",
            "source": "rt"
        },
        {
            "content": "I love the inspiration you feel from watching this movie.",
            "review_date": "2010-02-09",
            "source": "rt"
        },
        {
            "content": "One of the most inspiring and moving films I have ever seen.\r\nAlso, it is in my top 3 favorite movies.",
            "review_date": "2010-02-09",
            "source": "rt"
        },
        {
            "content": "An inspirational, small town story about a kid who follows his dreams. With Jake Gyllenhaal as lead, there was no way this movie could have gone wrong.",
            "review_date": "2010-02-04",
            "source": "rt"
        },
        {
            "content": "Given the fact that I don't like rockets, coal mining, or boys with Southern accents...I still really liked this movie.  I felt like it had a lot of substance.  Jake Gyllenhaal was adorable.",
            "review_date": "2010-01-29",
            "source": "rt"
        },
        {
            "content": "Now, I'm not sure what to really think. I can tell you this right off the bat. Laura dern was awesome, and pitch perfect in her role. Now, saying that, the rest of the cast seems less then good, but don't get me wrong, they were good. Just not as good as Dern.\r\n\r\nMaybe it isn't all action and effects, so maybe you got a little upset, understandable.Yet, how can you give this filma 0%. It has such deep values, and unlike other 0% nominees(Bewitched,The Notebook,New Best Friend(Which I gave two middle fingers up!), but 'October Sky' really does aim high, and gets your heart all warm inside. \r\n\r\nThis film isn't a very long drama, but it is a period piece. It is an uplifting story that is only all to realilistic to life in that kind of town. It is also well captured in it's saddening, but loveable spirit with it's sensational score.\r\n\r\n\"'October Sky' benifets from a well performing, and devoted cast, mainly  'Laura Dern'. It also has a great direction, and uplifting screenplay adapted from the memoir 'Rocket Boys'. It is also well strung, and lead by it's amazing score, by the great Mark Isham.\"\r\n\r\nTrue Rating: HW For Heartwarming\r\n\r\nTop 25 Soundtracks #1",
            "review_date": "2010-01-13",
            "source": "rt"
        },
        {
            "content": "a powerful and inspiring true story that takes our hearts on a fantastic ride. this film really makes you feel like you if you really set your mind and really want something, you can accomplish it. jake gyllenhal is fantastic as the lead role and gives a commanding performance. the story is epic, charming, and most of entertaining.",
            "review_date": "2010-01-10",
            "source": "rt"
        },
        {
            "content": "This film is truly moving and inspiring. It features a brilliant combination of angst, drama, and even a little comedy. Gyllenhaal and Cooper deserve many kudos, but also Natalie Canerday as the mother and William Lee Scott as Roy Lee deserve recognition. October Sky is representative of the era, not only from the \"Sputnik\" angle, but also the coal mining-company town aspect. \r\n\r\nThe final scenes of the space shuttle's launch might never have come to fruition without the dedication of the Homer Hickams of this country. The post-Sputnik science-ed. sensation is certainly worthy of this fine treatment. I shared the pride that all of Coalwood felt when the \"rocket boys\" won the national science fair. The theme that hard work and dedication lead to success may seem old-fashioned, but here its done to perfection. It is not sugary nor schmaltzy, though it could have easily slipped into that trap. \r\n\r\nOne more thought: my wife mocked the Appalachian accents a little, but I thought they were good, not overdone as southern accents usually are in movies.",
            "review_date": "2010-01-06",
            "source": "rt"
        },
        {
            "content": "Great film; makes you feel like you can acomplish anything. The ending scene is fantastic.",
            "review_date": "2010-01-06",
            "source": "rt"
        },
        {
            "content": "A pretty decent film. Good performences by Jake Ghelyhall and Chris Cooper. The plot is pretty basic, nothing out of the ordinary. the film will appeal to fans of the science/rocket genere but overall a watchable film, but not something i will be watching anytime soon.",
            "review_date": "2010-01-05",
            "source": "rt"
        },
        {
            "content": "always loved movies based on true stories",
            "review_date": "2010-01-05",
            "source": "rt"
        },
        {
            "content": "This is a great, heartwarming film. You'll love it.",
            "review_date": "2010-01-03",
            "source": "rt"
        },
        {
            "content": "personally i dont like this movie but i can respect it.",
            "review_date": "2010-01-01",
            "source": "rt"
        },
        {
            "content": "this is one of the first real movies i saw, i remember seeing this movie distinctly, my dad came to kindergarten and pulled me out of school and we drove to park terrace theater and saw it, i have loved it ever since, it is the only movie i own multiple legal copies of, both VHS and DVD. anyhow, its  one of the best movies I have ever seen.",
            "review_date": "2009-12-18",
            "source": "rt"
        },
        {
            "content": "A movie that begs the question \"Where are all the awards?!\"\r\n\r\nTHE GOOD\r\nMost everything about the film. The story is brilliant and especially so since it's so close to the actual true story (couple of minor details missed but that's expected). Very good performances by the ensemble cast, particularly Gyllenhaal and Dern. The overall theme of the film was very inspiring, and historically relavent. Not much more to say, really.\r\n\r\nTHE BAD\r\nOnly a couple of cast members (Canerday in particular) that let this film down slightly.\r\n\r\nTHE BOTTOM LINE\r\nIn the opinion of a person who enjoys movies, it's up there with my all-time favorites. Close to perfect and NEEDS SOME AWARDS!!!!!!!",
            "review_date": "2009-12-17",
            "source": "rt"
        },
        {
            "content": "October sky is a unique and inspiring movie that shows how even kids from a poor mining town can achieve great accomplishments.",
            "review_date": "2009-12-15",
            "source": "rt"
        },
        {
            "content": "The movie was dull and boring and that's exactly why we had to watch it in science class.",
            "review_date": "2009-12-12",
            "source": "rt"
        },
        {
            "content": "Classic ~ One of my all time favorites!",
            "review_date": "2009-12-10",
            "source": "rt"
        },
        {
            "content": "Absolutely gripping.. Lovely movie.. True Story.. Highly Recommended",
            "review_date": "2009-12-10",
            "source": "rt"
        },
        {
            "content": "seems like i have a problem with this kind of movies....",
            "review_date": "2009-12-07",
            "source": "rt"
        },
        {
            "content": "If this wasn't based on a true story, it might be unwatchable. However, since most of the movie is verbatim from the true story, it's a fun little coming of age story about a boy who refuses to give up on his dream. Inspiring at all the right points and was made for all those who were bold enough to see an idea through no matter how many failures occurred. I'm still mad that they didn't use a line like \"come on kid it ain't rocket science\" \"well actually...\"",
            "review_date": "2009-12-07",
            "source": "rt"
        },
        {
            "content": "Not a bad movie, good inspirational film with solid performances.",
            "review_date": "2009-11-22",
            "source": "rt"
        },
        {
            "content": "Watched this movie again after a long time. Must see..",
            "review_date": "2009-11-15",
            "source": "rt"
        },
        {
            "content": "i remember watching this movie all the time in math class!",
            "review_date": "2009-11-14",
            "source": "rt"
        }
    ]
}