{
    "rating": 9.3,
    "release_date": "1999-02-19",
    "num_reviews": 330,
    "genres": [
        "Comedy"
    ],
    "summary": "Corporate drone Peter Gibbons (Ron Livingston) hates his soul-killing job at software company Initech. While undergoing hypnotherapy, Peter is left in a blissful state when his therapist dies in the middle of their session. He refuses to work overtime, plays games at his desk and unintentionally charms two consultants into putting him on the management fast-track. When Peter's friends learn they're about to be downsized, they hatch a revenge plot against the company inspired by \"Superman III.\"",
    "reviews": [
        {
            "content": "While many critics may reflexively argue that the ending to Office Space is a simplistic evasion to any consideration of universal, radical transformations in the social relations of production obtaining in advanced capitalism, this is nevertheless a profoundly Marxist film, despite itself.  The solution to the terminal alienation of the bourgeois life is to get back to working the land, the proletarian savoir faire.  The hero goes from empty, sterile mastery to active proletarian realization of the creative spirit and productive will, concretizing his humanity at the handle of a pickaxe, a shovel, a hammer or a sickle.  The studio executives in the media conglomerate dismissed this as a harmless fantasy, but it is really a subversive allegorical intimation secreted in the script as it would be within any repressive regime, to get by the sensors.",
            "review_date": "2023-04-25",
            "source": "rt"
        },
        {
            "content": "This movie was so good! It encapsulated my feelings - in 2023 - about the daily slog and the ridiculous inanities of white collar life. Makes total sense it's a cult classic. Well\nPaced, funny, would definitely recommend.",
            "review_date": "2023-03-18",
            "source": "rt"
        },
        {
            "content": "Hilarious! Mike judge directed a great film here and kept me laughing the whole time.",
            "review_date": "2023-03-07",
            "source": "rt"
        },
        {
            "content": "An extremely funny take on workplace drudgery, Office Space is a hilarious adaptation of Mike Judge's short films, with a classic performance by Stephen Root.",
            "review_date": "2023-03-02",
            "source": "rt"
        },
        {
            "content": "\"| Ratings Categories |\n{Characters (10/10) ; Cinematography (8.5/10) ; Plot (8/10) ; Acting (9/10) ; Pacing (9/10) = 89%}\"",
            "review_date": "2023-02-27",
            "source": "rt"
        },
        {
            "content": "Very funny. I always talk about my red stapler now.",
            "review_date": "2023-02-21",
            "source": "rt"
        },
        {
            "content": "\"Office Space\" is a classic workplace comedy that perfectly captures the absurdities and frustrations of working in a dull, soul-sucking office environment. The film tells the story of a group of coworkers who hatch a plan to steal money from their company, and the hilariously disastrous consequences that ensue.\n\nOne of the standout features of \"Office Space\" is its relatability. Anyone who has ever worked in an office can relate to the monotony and drudgery of day-to-day work, as well as the petty politics and power struggles that often take place. The film's characters, from the lovable slacker Peter Gibbons to the smarmy middle manager Bill Lumbergh, are all too familiar to anyone who has spent time in a corporate environment.\n\nAnother strength of the movie is its humor. The film is filled with witty one-liners, visual gags, and absurd situations that keep the audience laughing from start to finish. The comedic timing and delivery of the actors, including Ron Livingston, Jennifer Aniston, and Gary Cole, is spot-on and helps to make the movie a true comedy classic.\n\nFinally, the movie's message about the importance of finding fulfillment in one's work and personal life is both timeless and uplifting. The film's portrayal of characters who break free from the constraints of their mundane jobs and pursue their passions is inspiring and relatable, and the movie encourages viewers to do the same.\n\nOverall, \"Office Space\" is a hilarious and relatable workplace comedy that has stood the test of time. Its witty humor, memorable characters, and uplifting message make it a must-see for anyone who has ever felt stuck in a dead-end job.",
            "review_date": "2023-02-18",
            "source": "rt"
        },
        {
            "content": "A cathartic experience for anyone who works or has worked in a corporate environment. A 90s comedy that never resorts to cheap gags.",
            "review_date": "2023-01-19",
            "source": "rt"
        },
        {
            "content": "I generally really like what Mke Judge does, especially his animated shows. But I found that \"Office Space\" to be really dull, not particularly funny at all, despite some pretty decent casting and Judge behind it. Maybe I should've seen this in '99. My younger self may have appreciated the cubicle office satire thing more. Then again, I was never much of a Dilbert guy, either. The movie just hasn't aged well for however relatable it was originally.\nThe only character I found interesting was Stephen Root's Milton. Root's a great character actor. And Cole can certainly play the worst kind of self-absorbed, arrogant butthead boss who seems to have gotten his job through blatant nepotism or just cuz he fits that mold (emphasis on the 'mold'). And we get Anniston pre-nosejob. Bader is pretty awful. Livingston had some potential at one time. \n2.5 stars",
            "review_date": "2023-01-17",
            "source": "rt"
        },
        {
            "content": "I didn't get it one bit.",
            "review_date": "2023-01-05",
            "source": "rt"
        },
        {
            "content": "Warped and funny. Typical Mike Judge humor.",
            "review_date": "2022-12-20",
            "source": "rt"
        },
        {
            "content": "A brilliantly executed spoof of office cubicle life. The humor becomes personally painful if you've lived in the soulless hellscape yourself. That's how accurate it all is, and a good bit of why it succeeds.",
            "review_date": "2022-12-10",
            "source": "rt"
        },
        {
            "content": "Some very relatable and funny moments. Worth the watch. It can drag at times but all together a solid comedy about the workplace ",
            "review_date": "2022-12-09",
            "source": "rt"
        },
        {
            "content": "Funny and relatable plot but just plain dumb and stupid. (50%)",
            "review_date": "2022-11-25",
            "source": "rt"
        },
        {
            "content": "I just adore this utterly hilarious movie which is such a fine piece of film history now.  I have now seen Office Space 10 times in full as of tonight.  Each time it is just as funny as the last time.  One of my top 20 comedy movies of all time and I am pretty sure it will never leave the, (my), top 20!\n\nLove it!",
            "review_date": "2022-11-15",
            "source": "rt"
        },
        {
            "content": "Hilarious and thought-provoking",
            "review_date": "2022-10-31",
            "source": "rt"
        },
        {
            "content": "An excellent portrayal of the dullness of office life in America. Peter encapsulates how not only we all feel but also the unfairness of corporate life. While busting his ass everyone only criticizes him but as soon as he starts slacking off he's rewarded for being management material. An excellent and hilarious movie.",
            "review_date": "2022-10-04",
            "source": "rt"
        },
        {
            "content": "A very good film, of course if we take into account what it makes us understand. But the humor is so bad, the only good thing was when they break the printer.",
            "review_date": "2022-09-22",
            "source": "rt"
        },
        {
            "content": "When I first saw this movie back in 1999, I hadn't graduated HS yet.   I thought it was funny at the time but after a few short years of working in an office, then I re-watched the movie and I could stop LMAO.  Great Movie.",
            "review_date": "2022-08-19",
            "source": "rt"
        },
        {
            "content": "Featuring loads of classic scenes, the iconic character of Bill Lumbergh (seamlessly portrayed by Gary Cole) and very convincing acting including what might very well be Aniston's finest performance, \"Office Space\", despite its convenient, slightly hackneyed resolution and a premise that doesn't always stand up to scrutiny, is an uproarious and, surely, relatable satire of many pay-offs, not least the ample sharp jabs at corporations and the cathartic ultimate fantasy of not caring about work.",
            "review_date": "2022-08-15",
            "source": "rt"
        },
        {
            "content": "The focus of the story changes constantly, but if you're looking for a live action  adaptation of mike judge comedy, This is what you'll get.",
            "review_date": "2022-08-09",
            "source": "rt"
        },
        {
            "content": "A fantastic first half - which is prescient, sharp and laugh out loud funny - sets us up for . . . . a second half that completely falls apart. A huge  missed opportunity, where the writers seemed to run out of any ideas or lost confidence in the story they had set up in the beginning",
            "review_date": "2022-07-31",
            "source": "rt"
        },
        {
            "content": "I found the movie pretty boring and unfunny, especially for being branded as a comedy. I didn't laugh other than the occasional chuckle, and I was unentertained during the entire movie. I would not recommend watching unless you want background noise while you waste an hour and a half on your phone.",
            "review_date": "2022-07-08",
            "source": "rt"
        },
        {
            "content": "I'll give it a 7 for Judge.\nIt's a very light comedy with some very funny moments if you lived that era.",
            "review_date": "2022-07-04",
            "source": "rt"
        },
        {
            "content": "This movie got me at the perfect time, just starting working my first true \"office\" job and it is still very relatable to this day.",
            "review_date": "2022-06-03",
            "source": "rt"
        },
        {
            "content": "Phenomenal cult comedy classic from the 90s. It is maybe not LOL rolling funny, but it continuously delivers pokes at office life that ring true even today.  Livingston's deadpan delivery is hilarious as you can see what his soul sucking job has done to him.  The ending is a bit fantastical and weak, but this film remains the quintessential office comedy.",
            "review_date": "2022-05-29",
            "source": "rt"
        },
        {
            "content": "I don't know how many times I've seen this.  It just doesn't get old.  From the guy in the zimmer frame passing the frustrated commuters through to the neighbor who listens to everything going on through the wall, it is just one laugh built on top of another.  If it's been a while, I'd highly recommend watching it again.  You won't be disappointed.",
            "review_date": "2022-05-08",
            "source": "rt"
        },
        {
            "content": "At the beginning, I've been sighing in solidarity with the main characters by all the comically annoying office co-workers that they must suffer through. The dialogue was great, but the plot didn't go that far as it was resolved immediately.",
            "review_date": "2022-05-08",
            "source": "rt"
        },
        {
            "content": "In addition to being HILARIOUS, this movie truly showcases the mundane reality of corporate jobs. The quirky characters and excellent acting sucks you into the story, as the best movies should.",
            "review_date": "2022-05-08",
            "source": "rt"
        },
        {
            "content": "It was cute but like Mike Judge's other big film, Idiocracy, it's a better as an idea than as an executed film. Nine to Five, from a decade before, was probably a better and more realistic workplace comedy.",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "It had a few laughs here and there. But it's the type of film I just wouldn't want to watch again. Still, not a bad movie at all",
            "review_date": "2022-03-31",
            "source": "rt"
        },
        {
            "content": "This is a classic comedy.  It is good, but not great.   Ron Livingston is very watchable and her went on to do great work in Loudermilk.   Jennifer Aniston is gorgeous in this and very understated as his girlfriend.    Stephen Root is hysterical as a quirky employee laid off and still coming to work every day.   This was a trendsetter and many movies copied some of the very funny bits and characters.    Even movies like The 40 Year Old Virgin used the formula of this film as its construct.   Gary Cole is memorable as the somewhat obsessed and robotic boss.   If you ever worked in a Pre-Covid office this one probably has some scenes that are familiar to you, albeit exaggerated.",
            "review_date": "2022-03-30",
            "source": "rt"
        },
        {
            "content": "It's a great film but it has extra meaning for everyone who has worked in an office or hospitality , especially near the period it was released",
            "review_date": "2022-03-23",
            "source": "rt"
        },
        {
            "content": "An outstanding parody of work life in a cubicled, IT environmnent, and one employee's choice (after hypnosis gone wrong) to buck the trend and say 'screw it'.\nHilarious performances all round, in particular Stephen Root as the incomparable 'Milton Waddams'.\nEven after 20 years you can still find similar traits in your own workplace whilst watching this film, absolutely timeless. A Classic, must see comedy for anyone who has ever worked a day in their life.",
            "review_date": "2022-03-23",
            "source": "rt"
        },
        {
            "content": "I personally would have liked the film to have been a tad longer, however that said it is an excellent film. The cinematography and direction are both rock solid, the cast helped by great characters do wonderful jobs, alongside Friends and The Iron Giant Office Space is one of the better projects and roles Jennifer Aniston appeared in and the story is very interesting and well paced.\n\nBut it is the humour and writing where Office Space really soars. Consistently the writing and humour in Office Space is hilarious yet surrealistically truthful as well. Also this is a film that for me gets better and better every time I feel, I find something new to admire and to smile and laugh at each time.\n\nOverall, Office Space is a great comedy. 9/10 Bethany Cox",
            "review_date": "2022-03-18",
            "source": "rt"
        },
        {
            "content": "There were definitely moments of this film that made me laugh and I liked it up until the middle of the movie, when it went from office politics and interpersonal work issues through one guy's perspective to a movie about a financial heist and money laundering and I found it to be a disruption to what I had initially been enjoying about the movie and thinking what it was about. I'd still recommend it as an adult comedy though, pretty original film for its time!",
            "review_date": "2022-03-12",
            "source": "rt"
        },
        {
            "content": "Pure gem. Many times the film can surprise you and if it didn't, you're glad that it was going that way. Smell like good old days before 21th century. If \"The Office\" had a film to start the idea, sort of, it would be that film.",
            "review_date": "2022-03-10",
            "source": "rt"
        },
        {
            "content": "Absolutely hilarious!!",
            "review_date": "2022-03-09",
            "source": "rt"
        },
        {
            "content": "This movie was a solid OK. Some funny parts, but I was not a fan of Ron Livingston in this. I feel like this movie had potential but missed it. John McGinley was good though!!",
            "review_date": "2022-02-22",
            "source": "rt"
        },
        {
            "content": "It wasn't that scary it was told to be.",
            "review_date": "2022-02-20",
            "source": "rt"
        },
        {
            "content": "Yeah, I'm going to go ahead and ask you to watch this movie. If you can do that. That would be great m'kay? 10/10",
            "review_date": "2022-02-17",
            "source": "rt"
        },
        {
            "content": "The simple reality that this movie is about crypto and apricots trickling down wealth.. ai/love got these glass ceilings of music and gangsta music SAATILal",
            "review_date": "2022-02-11",
            "source": "rt"
        },
        {
            "content": "This almost seemed like it was designed to become a classic in the same vein as Ferris Bueller or Groundhog Day in that it was incredibly well-rounded. There are funnier movies out there, and there are better screenplays and better acting performances, but there are only a few that combine all those facets in a way that makes it greater than the sum of its parts. For any individual piece that I didn't much care for (like hypnosis as a major plot device or the tonal shift in the back half of the movie) there was something else that was so good it more than made up for it.",
            "review_date": "2022-02-09",
            "source": "rt"
        },
        {
            "content": "I worked in Hi Tech and this movie is spot on. I have watched it many times!! One of my favorites.",
            "review_date": "2022-02-05",
            "source": "rt"
        },
        {
            "content": "The nineties were a pretty terrible era for comedies, which is why Office Space is easily one of the genre standouts of the decade. Its ending is inferior, but otherwise the movie is consistently fun and funny, it has a plethora of memorable, hilarious characters and it features a phenomenal statement against corporate jobs. It's a timeless classic.",
            "review_date": "2022-01-13",
            "source": "rt"
        },
        {
            "content": "Marrant et décalé....",
            "review_date": "2021-12-08",
            "source": "rt"
        },
        {
            "content": "Timeless. It just a classic. I thought it be so old that it be boring but it's not.  It's too relatable to point of funny and sad.",
            "review_date": "2021-11-30",
            "source": "rt"
        },
        {
            "content": "So relatable, it hurts so bad to the point of being funny.",
            "review_date": "2021-11-10",
            "source": "rt"
        },
        {
            "content": "Great characters, plot, and incredibly funny",
            "review_date": "2021-10-16",
            "source": "rt"
        },
        {
            "content": "On the surface, Office Space appears to be a crude movie about how much work sucks, like a Studio Movie equivalent to Clerks, just in a Corporate setting rather than a store.  However, when looked at more deeply, this is almost a Call-To-Arms for the often neglected or poorly-treated workers, making this one of the two most subversively politically powerful films of the 90's (the other, in my opinion, being the South Park movie, which was literally an open declaration of war against bad parenting).  Now, many who watch this movie think that it's just a light-hearted affair, and if we're being honest, that's because the movie's overwhelmingly light-hearted tone does make it such a breezy film-viewing experience that most would not even notice.  But there is a message and it's one that is inherently a powerful one, and in many ways, this breezy tone fused with some crude verbal (always verbal) jokes, actually helps to keep one entertained more than riled up.  There's none of the ultra-lowbrow humor like farts or what not, and the characters are each written differently, and written well (as well as acted well).  The story has more than enough to keep it moving but luckily keeps things rather straightforward and easy to follow, and actually manages to keep a consistent comedic tone without getting bogged down during the dramatic moments, or ever trying to amp things up too far.  Oh, and it's infinitely quotable.  If there's any shortcoming, it's that it's not really a laugh-at-the-time movie - I recall watching it with my family in 1999 and us only laughing here and there, but during our conversation later, realizing how good the movie was; similarly, in 2001 my college suite-mates got together and watched it, and nobody laughed a single time, but when the movie ended, they all looked at each other, smiling, nodding in approval, saying things like: \"..Awesome movie!\"  In a sense, it's almost like a Slow-Burn movie, just in a Comedy sense, rather than a Horror, and the fact that it has a surprisingly potent undercurrent of messaging just makes it all the more wonderful.",
            "review_date": "2021-09-30",
            "source": "rt"
        },
        {
            "content": "Summary: Peter's desk job sucks the life out of him M-F (and even on Saturdays when his god-awful manager expects him to pull overtime). After therapy brings a grand realization that work stress doesn't really matter, Peter stops giving a crap. When the company downsizes, him and his colleagues plot their revenge.\n\nTakeaways: Quotable dry humor and hilariously quirky characters make this movie timeless. Worth a watch (or rewatch!).",
            "review_date": "2021-07-25",
            "source": "rt"
        },
        {
            "content": "I don't know if I will ever be at a place in life, where I will see a thing, that will bring me as much joy, as this movie did, at a certain time, in a certain place in life.",
            "review_date": "2021-07-16",
            "source": "rt"
        },
        {
            "content": "Classic film. I relate to the main character. But, I also had a manager who was dying of cancer and still came into our office job because she loved to work so much. I can't relate to that mentality, but, these people do exist.\n\nI met an open mic comic who had a bit about how he sold all his dreams, and I thought it was great, but everyone around me was TERRIBLE! The MC, though I'd never head him groan about any of the other mental cases rambling on about boxed cake mixes and needing bathroom sex RIGHT NOW, this MC seemed particularly unhappy with \"I sold my dreams\" Tiny Nerd Tim--who, none of us could ever remember his name, so we'd just call him Tim, and he'd \"That's not my name\" and you'd \"Tim old pal old friend!\".\n\nNo one liked Tim, get it? So terrible he wasn't even mildly entertaining terrible to watch. But, I really thought Tim was funny. I was incredulous no one liked him. I made sure to intimidate Tim and get in his face about it, \"Tim, that was so sad and wonderful and I loved it even though everyone hated it\" and he'd \"That's not my name\" and I'd \"You wanna play my show, Tim?\".\n\nTim-Not-His-Name played my show and I even introduced him with the wrong name. Tim got up there, reintroduced himself, and everyone thought he was the funniest. My friend who'd seen Terrible Tim was shocked, \"Tim...is funny?\". \n\nTim-Not-His-Name had a critique for me after I did my bit which was, \"I like my office job, even though you consider it hell on earth\" which is why Tim is now getting the last laugh in his seven-figure-per-year salary-tech-gig, and me who can't remember his real name? Not so much.",
            "review_date": "2021-07-11",
            "source": "rt"
        },
        {
            "content": "To be honest I find this to be a tad overrated. It's very watchable and occasionally amusing, but not as funny as everyone says it is. Printer scene is obviously iconic.",
            "review_date": "2021-06-27",
            "source": "rt"
        },
        {
            "content": "One of the funniest and one of the best comedies ever made. It's a MUST SEE for any comedian, a lover of comedic movies, and just any person. This is one that will go down as one of the comedic movies!",
            "review_date": "2021-06-10",
            "source": "rt"
        },
        {
            "content": "This movie was way ahead of its time! Its anti-work and anti-capitalist attitudes are ringing loud and clear and resonating now more than ever. It's also really freaking funny. The dialogue is great, but Ron Livingston's deadpan delivery makes it even better. The supporting characters, while little more than personality archetypes, interact in a hilarious way and lead to a surprisingly satisfying ending. Overall, Office Space is an extremely humorous film, especially for anyone who's worked in a white-collar setting, with a very real message buried underneath all the jokes.",
            "review_date": "2021-04-18",
            "source": "rt"
        },
        {
            "content": "Office Space is a funny movie, it has its moments of being funny. The dialogue in itself doesn't become stale during the whole movie, making it fluid to watch.\nAt the beginning of the movie, I thought this movie gave me the impression that would be about how mundane and dreadful some jobs can be and the strain it leaves on the day-to-day life with a couple of jokes to ease the topic, after about a quarter of the movie I saw what type of movie it was a comedy with some clever quips!\nThere is also a problem here in this movie, when Peter Gibbons goes to the hypnotherapist he becomes a person who is less worried about everything around him and shows this attitude during some time of the movie,  supposedly he should be like this since the therapist died without ever snapping its fingers. But when his friends are going to lose their job he becomes worried and even tries to do something to help them, which wasn't supposed to happen to this character he should have remained the same. This could easily be written off by saying that his friendship with his coworkers was very big but he worries about more things than his friends losing their job. To me, this is a loop hole in the screenplay that could be easily seen during production of the movie!",
            "review_date": "2021-04-14",
            "source": "rt"
        },
        {
            "content": "A comedic master piece! You'll definitely find it way funnier if you ever worked in an office.",
            "review_date": "2021-03-24",
            "source": "rt"
        },
        {
            "content": "Absolutely one of my all-time favorite movies.  The office grind is most definitely hysterical, and tedious at times.  It's a cult classic for a reason, you should like it.  Unless you have a case of the mondays on the daily... then I pity you.",
            "review_date": "2021-03-10",
            "source": "rt"
        },
        {
            "content": "The Office before The Office. The scenes of everyday office life were nicely judged, but it lost me when it got to the main embezzlement plot. It also suffers from being very male centric.",
            "review_date": "2021-03-05",
            "source": "rt"
        },
        {
            "content": "A short slice of feel good fun reminding us that jobs are usually pretty rubbish. Nice send up of office life and the funny characters you find there, a bit like that sitcom, you know the one.",
            "review_date": "2021-01-22",
            "source": "rt"
        },
        {
            "content": "This film is legendary. 9.95, A",
            "review_date": "2021-01-21",
            "source": "rt"
        },
        {
            "content": "This film is very mellow and yet delivers some of the strongest satirical criticisms I have ever heard. Insanely funny and a movie that only gets better with rewatching. The ending may seem anti-climactic but while thinking about the films message, it makes perfect sense.",
            "review_date": "2021-01-15",
            "source": "rt"
        },
        {
            "content": "Simple but effective. A great workplace comedy without any groundbreaking concepts, but executed cleanly and perfectly compact with its runtime.",
            "review_date": "2021-01-05",
            "source": "rt"
        },
        {
            "content": "Cult comedy classic that is still just as effective today and jam packed with endless quotable lines. This must be one of the first depictions of the mundanity of work, specifically office life.",
            "review_date": "2020-11-27",
            "source": "rt"
        },
        {
            "content": "Classic cult comedy that will be quoted forever.",
            "review_date": "2020-10-25",
            "source": "rt"
        },
        {
            "content": "20 years later this movie is still hilarious 🤣 😂 😆",
            "review_date": "2020-10-07",
            "source": "rt"
        },
        {
            "content": "A simple yet deep comedy about a person unhappy at his office job. It is silly but also promotes deep thinking about work.",
            "review_date": "2020-10-05",
            "source": "rt"
        },
        {
            "content": "It was an unoriginal, down right disgusting film. Two minutes in and we are smacked in the face with racist unimaginative stereotypes of not only African Americans but middle eastern people as well. It's clear why this horrible high school film project of a movie has stayed in the 2000's.",
            "review_date": "2020-08-12",
            "source": "rt"
        },
        {
            "content": "nice and funny, not life changing haha",
            "review_date": "2020-08-10",
            "source": "rt"
        },
        {
            "content": "This movie was about a guy who works in the office and has very bad days. He goes to the psychologist and somehow has a be day heir and the psychologist dies. He then jas a good day by not showing to work.",
            "review_date": "2020-07-15",
            "source": "rt"
        },
        {
            "content": "I've seen this numerous times in the twenty years it's been released, including in the movie theater, and I've never not enjoyed it.  It's a cult favorite that's becoming a modern classic as it ages that's extremely quotable... and now meme-able???  What else can be said - seven minutes in and I can't stop laughing.\n\n4 1/2 of 5",
            "review_date": "2020-07-08",
            "source": "rt"
        },
        {
            "content": "Office Space is a truly the best comedy cult classic of late 90's.",
            "review_date": "2020-06-20",
            "source": "rt"
        },
        {
            "content": "Just simply funny throughout and so many memorable characters. A really brilliant dark comedy! 😁",
            "review_date": "2020-06-12",
            "source": "rt"
        },
        {
            "content": "Comedy cult classic that absolutely holds up.",
            "review_date": "2020-06-10",
            "source": "rt"
        },
        {
            "content": "One of the Classics, and deserving to be in the discussion with the likes of CaddyShack, and the likes.",
            "review_date": "2020-05-28",
            "source": "rt"
        },
        {
            "content": "Probably one of my favorite movies of all time. Saw it multiple times in the theater, and have owned it since it came out on DVD.",
            "review_date": "2020-05-02",
            "source": "rt"
        },
        {
            "content": "This probably has to be one of the better comedy movies I've seen in a while, all the cast do a good job for what they're given and the dialogue which they give is always good and it doesn't feel poorly given out. Also, Peter (Ron Livingston) and Milton (Stephen Root) made me laugh from start to finish with how they act throughout this movie and they also do a really good job for what they're given, so does the rest of the cast in this brilliant movie. Overall, I'd honestly say its worth the watch if you're wanting to watch a really funny comedy movie this is the one for you to watch, I'd honestly recommend it.",
            "review_date": "2020-04-21",
            "source": "rt"
        },
        {
            "content": "Office space is a comedy about a man who's mane goal in life is to do nothing",
            "review_date": "2020-04-04",
            "source": "rt"
        },
        {
            "content": "It's OFFICE SPACE. WATCH IT.",
            "review_date": "2020-04-03",
            "source": "rt"
        },
        {
            "content": "Is it possible for a movie to be considered a cult classic and still be underrated?  Maybe my favorite straight-up comedy of all time, this movie is filled with laughs. Some are belly laughs and some are just little chuckles, but the laughs keep coming every few seconds or so.  BUT--and this is a big \"but\"--you probably need to have worked in an office environment at some point in your life in order to enjoy the movie as much as I do.  The comedy rings very true with us office workers, but I could see how others might not find it nearly as funny as we do.  Another plus for me is that I like rap music, and the movie has a very humorous (although some might find it odd) rap soundtrack.  Bottom line is, \"Office Space\" might not be for everyone.  But, oh man, does it crack me up!  (One more thing:  Jennifer Anniston is soooooo frickin' cute in this movie!!)",
            "review_date": "2020-03-20",
            "source": "rt"
        },
        {
            "content": "This is a classic! Anyone who has worked in a office knows this is the truth.",
            "review_date": "2020-03-16",
            "source": "rt"
        },
        {
            "content": "I feel this movie gave way of other comedies afterwards that had the theme around an office with a douchebag boss and trustworthy colleagues and feel like it launched the careers of a lot of these guys in a way. \n\nMemes to this day of Milton and Bill Lumbergh are so apt that the two, Gary Cole and Milton dude have gone on to b such memorable faces to this day. Milton in Barry and Gay  Cole in Mixed ish.",
            "review_date": "2020-03-09",
            "source": "rt"
        },
        {
            "content": "One of my favorites. We were not meant to spend our days doing mindless work for some corporate overlords, surrounded by annoying people we can't stand.",
            "review_date": "2020-03-08",
            "source": "rt"
        },
        {
            "content": "So very much like real life for any cubicle dweller.",
            "review_date": "2020-02-05",
            "source": "rt"
        },
        {
            "content": "It's a funny movie on its own but if you've ever worked in an office, it's hilarious!",
            "review_date": "2020-01-26",
            "source": "rt"
        },
        {
            "content": "out of the box movie smart way of thinking rebellion way to destroy the system",
            "review_date": "2020-01-25",
            "source": "rt"
        },
        {
            "content": "An absolute blast. Hits every comedy beat you can think of and still remains to be highly relevant 2 decades on.",
            "review_date": "2020-01-25",
            "source": "rt"
        },
        {
            "content": "A film the comedy genre needed.",
            "review_date": "2020-01-24",
            "source": "rt"
        },
        {
            "content": "The legendary \"Office Space\" runs the absurdity of cubicle life straight up the corporate flagpole. Few satires have proven as relatable to any subsection of society as this one has to the dehumanized workforce warrior, as it evokes the full futility of the daily grind with gleefully hilarious precision. This is now a highly influential comedy, too, having embedded itself in the DNA of films from \"Anchorman: The Legend of Ron Burgundy,\" to television descendent \"The Office,\" to raunchy record label spoof \"Stadium Anthems\" in their depictions of their own inane employment environments.\n\nInside the mundane Initech Corp., wage victims grind away. Peter Gibbons (Ron Livingston) hates his gig as much as he fears losing it, until an open-ended meeting with an \"occupational hypnotherapist\" frees his mind: Peter decides he isn't going to work much anymore. Yet after repeatedly coming in late (or not at all), two workforce consultants determine Peter is a \"straight shooter,\" and a guy who \"has upper management written all over him.\" Fantastic.\n\nSince its 1999 release, office cubicle environments have largely given way to open-space layouts. But while the furniture has been rearranged, so many truisms of \"Office Space\" remain in play. This is a sidesplitting comedy if there ever was one. \n-\nWATCHED IT? THEN WATCHLIST:\n\"Anchorman: The Legend of Ron Burgundy\"\n\"The Office\"\n\"Stadium Anthems\"",
            "review_date": "2020-01-22",
            "source": "rt"
        },
        {
            "content": "Although Office Space seems like a forgettable comedy movie that deteriorates in quality after several years, Office Space's story holds up and is still effortlessly funny and relate able.",
            "review_date": "2020-01-15",
            "source": "rt"
        },
        {
            "content": "I have seen this movie so many times, this is a 90's comedy and it was alight. It was kinda funny I'll watch if it is on passes the time a movie to quote and lines to repeat and remember.",
            "review_date": "2020-01-07",
            "source": "rt"
        },
        {
            "content": "Great movie every office working person will get. Great characters & satisfying plot developments. A cult classic!",
            "review_date": "2019-12-20",
            "source": "rt"
        },
        {
            "content": "No matter how often you have seen this movie, it is worth watching again, if for no other reason than the number of times the name \"Lundberg\" is uttered with vehement contempt and disdain!",
            "review_date": "2019-12-19",
            "source": "rt"
        },
        {
            "content": "Good plot well written decent acting and a lot of laughs.",
            "review_date": "2019-12-09",
            "source": "rt"
        },
        {
            "content": "Halarious movie, i absoulutley love it",
            "review_date": "2019-10-22",
            "source": "rt"
        },
        {
            "content": "I must have seen this a half dozen times and it's still hilarious!",
            "review_date": "2019-10-13",
            "source": "rt"
        },
        {
            "content": "Not nearly as funny as it's made out to be.  Just barely passes as mildly entertaining trash.  I might have chuckled a couple of times throughout the movie.  Jennifer Aniston is ugly and has no comedic talent.",
            "review_date": "2019-09-06",
            "source": "rt"
        },
        {
            "content": "best scene about a photocopying machine!",
            "review_date": "2019-08-26",
            "source": "rt"
        },
        {
            "content": "Most legendary & accurate portrayal of how Corporate America (i.e. anyone working a 9-5 in a building) is the greatest scheme of all time (for the various groups & families that simply took theirs via unscrupulous methods, like the Morgan's, Rockefeller's, Chase's, Carnegie's, Vanderbilt's, Schwab's, etc.)! \n\n              Get some type of job in the STEM (Science, Tech, Engineering & Math) field, a Professional Degree (Physician, Attorney, PHD) or start your own business....otherwise you'll never make enough to retire early enough that you can still enjoy a greater LIFE-work BALANCE...good luck!",
            "review_date": "2019-08-24",
            "source": "rt"
        },
        {
            "content": "Good movie entertaining",
            "review_date": "2019-08-15",
            "source": "rt"
        },
        {
            "content": "A movie that has no right of being this good. It all just works well together in a manner that is suppose to be serious but ends up being hilarious. Its a cult classic that is a must watch for anyone working any 9-5 job.",
            "review_date": "2019-07-30",
            "source": "rt"
        },
        {
            "content": "A Cult Classic – often reminds me of jobs that I have had in the past. It just proves that you don't have to spend a lot of money to make a good movie. ",
            "review_date": "2019-07-22",
            "source": "rt"
        },
        {
            "content": "I really like this movie.\nThere's a lot to relate to, the jokes are in steady supply and there are characters that will stick with you, to the extent that you can immediately start to apply then to people in your workplace.\nI only caught wind of it due to a Family Guy reference involving a printer destruction. \nThis film always makes me feel happy. ",
            "review_date": "2019-07-04",
            "source": "rt"
        },
        {
            "content": "Shot in 1999 and has not aged a bit! Everything still applies..., sadly\nEverybody brilliantly cast, script is one of the best ever, if you have ever worked in an office you have to see this movie!",
            "review_date": "2019-05-18",
            "source": "rt"
        },
        {
            "content": "Best reality film ever",
            "review_date": "2019-04-05",
            "source": "rt"
        },
        {
            "content": "We watched this in my English classï¿ 1/2Do not know why but it was a good time. The story is simple but smart and funny. Not only was this filled with wit and good one-liner, it also had decent characters that have meaning and add tone to the film. And the situations that came up were very relatable and that was a fun thing to watch. This was a down-to-earth comedy that has good moments and some memorable parts. That is it. It made some fair points and the conversations between characters were well-made. I enjoyed this movie, it was not bad nor was it amazing.",
            "review_date": "2019-03-05",
            "source": "rt"
        },
        {
            "content": "This movie changed my life..",
            "review_date": "2019-02-26",
            "source": "rt"
        },
        {
            "content": "Never got around to writing a review. So I'd call this the ultimate slacker movie, or at least the best executed one I've ever seen. Yes it's no coincidence that if you like Dilbert you'd like this movie, since both shine a spotlight on the absurdities of modern office behavior. Well written but perfectly cast, although the boss is a little overplayed at times, but Livingstone and his accomplices are believable. It's a nice fantasy that we can all have once in a while but don't take it too seriously.",
            "review_date": "2019-02-25",
            "source": "rt"
        },
        {
            "content": "One of the best films ever made",
            "review_date": "2019-02-25",
            "source": "rt"
        },
        {
            "content": "20 year old move yet it never gets old. Good watch on a cold day.",
            "review_date": "2019-01-27",
            "source": "rt"
        },
        {
            "content": "I wasn't the biggest fan of Mike Judge but after seeing Office Space I took a 180. Every character in this comedy is fleshed out to the point that every nuance it noticeable. Ron Livingston is a man who hates his life and work. So he does what every person should do...he goes to a hypnotist to numb his daily pain. When the hypnotist dies he remains in a numb state and ignores every problem in the world. He ignores his boss, his problems and his worries and from that he gets the girl of his dreams and a promotion. The hilarity ensues and explores the grind of having a nowhere job with a nowhere attitude. It's great fun and has little flaws. I doubt Judge can ever top this one but here's hoping some day he does.",
            "review_date": "2019-01-18",
            "source": "rt"
        },
        {
            "content": "My favourite film of all time. I work in an office and its literally the story of my life!",
            "review_date": "2018-12-22",
            "source": "rt"
        },
        {
            "content": "One of my favorite all time comedies.",
            "review_date": "2018-12-01",
            "source": "rt"
        },
        {
            "content": "Cult classic is funny and relatable.",
            "review_date": "2018-11-26",
            "source": "rt"
        },
        {
            "content": "tons of mutual things to connect with the audience..\n\nOffice Space\n\nJudge's mockery on the mundane life is frankly not that funny as he might think. It is loosely placed and poorly edited with awkward silences in mid sequences that just doesn't fit. The concept is something to ponder about but beyond that it barely moves forward on terms of storytelling. And as far as the irritation and the frustration that it has to communicate, it does that easily and smoothly and the primary reason to that is that there are tons of mutual things to connect with the audience. And since it practically depicts, your mundane life and mocks over it, there are tiny notions and typical sketchy gags that you can thoroughly enjoy.\n\nThe narration is sloppy and not at all gripping, it has a lot to say but it probably found itself obliged to draw a laugh out of each scene that resulted into a big misconceived misconception about corporate world. Livingston isn't hilarious, his eyes doesn't speak the laziness that its character demands and neither is Aniston in her A game on supporting him. The other cast holds on to their one-dimensional acts and draws out few chuckles every now and then. It doesn't take itself seriously in its initial stages and when it wants you to take things seriously in the final act, it gets kind of difficult to shift the tone.\n\nJudge has the heart in the right place and that enthusiasm is what fuels this somewhat dim witted script and makes it worth the while. The conversations are pragmatic but the execution of it could have been a lot better. Judge feels vulnerable behind the screen and you can practically see him sweat, there is no ease in storytelling, it makes you uncomfortable at times. Office Space has a good satirical message to convey to its audience, buy personally I prefer the meal perfectly cooked and not just contain mouthwatering ingredients.",
            "review_date": "2018-11-03",
            "source": "rt"
        },
        {
            "content": "A simple yet unforgettable comedy that captures the true agony of employment in a funny and lighthearted way.",
            "review_date": "2018-10-29",
            "source": "rt"
        },
        {
            "content": "Filled with lines, characters and scenes that are iconic for a reason, Office Space proves to be a fun ride through and through.",
            "review_date": "2018-10-03",
            "source": "rt"
        },
        {
            "content": "Absolutely fantastic film. Brilliant casting and perfectly timed humour throughout, Office space is a cult classic that everybody should see at least once.",
            "review_date": "2018-10-03",
            "source": "rt"
        },
        {
            "content": "One of the best movies ever made... really cool, funny, brilliant. A cult classic. Anyone who watches this and doesn't like it, I don't even want to know you. Great story, great characters, classic funny lines. It is perfect... I don't know how this could possibly be improved. Even Rachel from Friends is quite good in it. Is this the only good movie she has been in?",
            "review_date": "2018-09-26",
            "source": "rt"
        },
        {
            "content": "A movie that is great to watch over and over again! It's funny how anyone can relate to the office politics & personalities from the movie into our own lives! A big thanks to the cast & crew for giving us a memorable flick!!",
            "review_date": "2018-09-16",
            "source": "rt"
        },
        {
            "content": "Genius. Ahead of its time 😂",
            "review_date": "2018-09-06",
            "source": "rt"
        },
        {
            "content": "I literally have a tattoo of the logo of this movie :)",
            "review_date": "2018-07-25",
            "source": "rt"
        },
        {
            "content": "Very funny movie. Great style and pose in this 90’s flick. ",
            "review_date": "2018-07-22",
            "source": "rt"
        },
        {
            "content": "Beavis and Butt-Head. Silicon Valley. This. There are others but Mike Judge continues to share his genius with the world. One of the most quotable movies ever made, the Casablanca of comedies. Actually, that title belongs to The Big Lebowski but this is close. Anyone who has ever worked in a cubicle will feel right at home. ",
            "review_date": "2018-06-18",
            "source": "rt"
        },
        {
            "content": "Such A Funny Film Something That The Comedy Genre Needed.",
            "review_date": "2018-06-16",
            "source": "rt"
        },
        {
            "content": "An iconic comedy with a compelling plot and excellent acting on the part of all actors involved. Office Space is an iconic and original comedy and one that still holds up. As such I give it a 4.5/5",
            "review_date": "2018-06-10",
            "source": "rt"
        },
        {
            "content": "Doesn't try too hard",
            "review_date": "2018-05-21",
            "source": "rt"
        },
        {
            "content": "The beginning was fantastic, but it petered out from there. Really shows the drudgery of desk jobs perfectly, just wish the film had a satisfying ending.",
            "review_date": "2018-05-12",
            "source": "rt"
        },
        {
            "content": "No doubt a fan favorite, this cubical farm flick captures the essence of the office politics \"playscape\" nicely. I'm especially fond of Stephen Root's portrayal of Milton which is nothing short of a riot - love how he anxiously peers through those coke bottle glasses. Anybody with an office job will get a kick out of this movie.",
            "review_date": "2018-03-22",
            "source": "rt"
        },
        {
            "content": "Peter Gibbons (Ron Livingston) is a programmer at a company called Initech who is frustrated and unmotivated at his job. His co-workers include Samir Nagheenanajar (Ajay Naidu) and Michael Bolton (David Herman), also programmers, and Milton Waddams (Stephen Root), a meek collator who is mostly ignored by the rest of the office. The staff constantly suffer under callous management, especially Initech's smarmy vice president Bill Lumbergh (Gary Cole), whom Peter loathes. They are further agitated by the arrival of consultants Bob Slydell and Bob Porter, who are brought in to help the company downsize. Peter's girlfriend Anne persuades him to attend an occupational hypnotherapy session, but Dr. Swanson, the therapist, dies of a heart attack while hypnotizing Peter. Peter wakes up the next morning newly relaxed, and he ignores repeated phone calls from Lumbergh, who had been expecting him to work over the weekend. He also ignores calls from Anne, who responds by angrily breaking up with him and admitting that she has been cheating on him, confirming his friends' suspicions. The following workday, Peter decides to skip work and asks Joanna (Jennifer Aniston), a restaurant waitress, out for lunch. Joanna and Peter bond over their shared loathing of idiotic management and love of the television series Kung Fu. When Peter finally shows up at work, he casually disregards office protocol, including violating Initech's dress code, taking Lumbergh's reserved parking spot, refusing to follow Lumbergh's directions, and removing a cubicle wall that blocks his view out the window. The consultants, however, are impressed by his frank insights into the office problems, and they decide to promote him. They also confide that Michael and Samir's jobs will be eliminated; Peter relays this news to them, and the trio decide to get even by infecting Initech's accounting system with a computer virus designed to divert fractions of pennies into a bank account. They believe that such transactions are small enough to avoid detection but will result in a substantial amount of money over time. On Michael and Samir's last day at Initech, the pair along with Peter steal a frequently malfunctioning printer, which the three take to a field and smash to pieces to vent their frustration. At a barbecue, Peter learns that Joanna had previously slept with a colleague identified as \"Lumbergh\". He assumes it to be his boss and confronts Joanna in disgust. She questions the morality of his financial scheme, and the two split up. Peter then discovers that a bug in Michael's code has caused their virus to steal over $300,000 in only a few days, which is far more conspicuous...\n\n\"Office Space\" received positive reviews from critics. Rotten Tomatoes consensus reads, \"Mike Judge lampoons the office grind with its inspired mix of sharp dialogue and witty one-liners.\" Roger Ebert of the Chicago Sun-Times gave the film three out of four stars and wrote that Judge \"treats his characters a little like cartoon creatures. That works. Nuances of behavior are not necessary, because in the cubicle world every personality trait is magnified, and the captives stagger forth like grotesques\". In his review for the San Francisco Chronicle, Mick LaSalle writes, \"Livingston is nicely cast as Peter, a young guy whose imagination and capacity for happiness are the very things making him miserable.\" In USA Today, Susan Wloszczyna wrote, \"If you've ever had a job, you'll be amused by this paean to peons.\" Owen Gleiberman in Entertainment Weekly gave the film a \"C\" rating and criticized it for feeling \"cramped and underimagined\". In his review for the Globe and Mail, Rick Groen wrote, \"Perhaps his TV background makes him unaccustomed to the demands of a feature-length script (the ending seems almost panicky in its abruptness), or maybe he just succumbs to the lure of the easy yuk...what began as discomfiting satire soon devolves into silly farce.\" In his review in The New York Times, Stephen Holden wrote, \"It has the loose-jointed feel of a bunch of sketches packed together into a narrative that doesn't gather much momentum.\" In 2008, Entertainment Weekly named Office Space one of \"The 100 best films from 1983 to 2008\", ranking it at #73.\n\n\"Office Space\" is a comedy with a neat storyline within the genre. The satirical and yet realistic presentation of the American office life serves us as well a social political comment on the negative effects of the boring white collar work environment and the urge for escapism and freedom becomes the centre of the story. It also puts the finger on how many people are often treated within companies of today. I reckon anybody who has had an office job can relate to that. Ron Livingston is great as Peter and Jennifer Aniston is quite nice as Joanna. Gotta love Gary Cole as Bill Lumbergh and Stephen Root as Milton Waddams. Some scenes are truly classic and you will remember them forever. \n\nTrivia: - Milton was actually based on an old co-worker that Mike Judge worked with during his days as an engineer. One day, Judge went to the man and asked him how he was doing, and the worker began talking about how he was going to quit his job because he was forced to move his desk around too many times.\n\n- After poor box-office performance, the movie gained cult status on video. Mike Judge has said more people talk to him about this movie than any project he has ever worked on. Judge was offered a chance to make a sequel, \"Office Space 2: Still Renting\", but said that he had been through enough anguish over the first one, that he didn't want to put himself through the experience again.\n\n - One of the promotions for this film invited people in certain cities to watch and participate in the bashing of office equipment. There was also an Internet campaign that linked to a website where people could expose their bad bosses.\n\n- Office Space has become a cult classic, selling well on home video and DVD. As of 2003, it had sold 2.6 million copies on VHS and DVD. In the same year, it was in the top 20 best-selling Fox DVDs along with There's Something About Mary. As of 2006, it had sold over six million DVDs in the United States alone.",
            "review_date": "2018-02-19",
            "source": "rt"
        },
        {
            "content": "Peter works at Initech, a generic financial company, where he fixes financial dating bugs ready for the new millennium (it's 1999, remember, Y2K was a real concern). Like most people in dead-end office jobs he's severely unhappy with his life and everything he has to bear with in a given day, from passive-aggressive memos, to annoying co-workers, to being accused of having \"a case of the mondays\". That is until his controlling, adulterous girlfriend convinces him to see a hypnotherapist who collapses mid hypnosis, leaving Peter in a permanent state of apathy. He purposefully skips work for a few days, asks an attractive waitress out, and offers completely honest answers to the \"efficiency consultants\" at Initech that inadvertently land him a promotion.\n\nIf there's one thing Office Space has in spades, it's relatability. While I haven't, most people in the western world have or do work office jobs, and every office trope is here in full display. Oftentimes these tropes don't even need to be exaggerated to get their point across, such is the way in corporate environments. Everything is a mundane grey, creativity and individuality are stamped out at every opportunity, bosses focus on the most trivial details with an emotionless facade, printers stop working for stupid reasons causing endless frustrations, the threat of losing your job literally makes people go crazy, and communication is a bizarre ordeal for both parties. It's a tragedy as much as it's a comedy it's so relatable. I don't even work in an office and I find these practices out in the world causing me as much anguish as it does everyone else. It's less a movie of entertainment and more a look at the boring, mundane lives we all lead, and how weird and unintentionally hilarious it all is when looked at from an outside perspective.\n\nBut maybe that's just me looking a little too deeply into a Hollywood comedy. Thankfully Office Space still stands out from the rest thanks to it's quality of humour. There's a reason the \"...that'd be great\" meme is still out in full force on the internet today, eighteen years later. Jokes come out naturally and don't make a big fuss. They're the kind of jokes you'd encounter in everyday life. Much of the humour is pointed at the ridiculousness of the whole thing. And then of course there's Milton, who's equally hilarious and heartbreaking at the same time. Also the music used, almost exclusively gangster rap, is a fantastic juxtaposition that elicits laughs every time. Every. Time.\n\nOffice Space is one of the finest comedies made, because it's about as relatable as a movie can be. It takes everyday tropes and looks at them through humour, emphasising how silly and nonsensical it all is. It probably won't have you laughing out loud every five minutes, but it'll stick with you, from the quotes, to the characters, to the awkward situations. I mean it loses it's way in the second half as it shifts direction to more of a crime caper, but it's first half is so strong that it doesn't really matter all that much, and by that point you're fully invested anyway. I give Office Space a solid 8/10.\n\nhttp://qyrosmovies.blogspot.co.uk/",
            "review_date": "2017-12-22",
            "source": "rt"
        },
        {
            "content": "In my country, this movie is mandatory watch.",
            "review_date": "2017-12-18",
            "source": "rt"
        },
        {
            "content": "If you've ever worked at a monotonous and boring job, then this one's for you...",
            "review_date": "2017-10-28",
            "source": "rt"
        },
        {
            "content": "The greatest example of office workplace",
            "review_date": "2017-10-27",
            "source": "rt"
        },
        {
            "content": "Approximately 17 years ago I first saw Office Space and found it underwhelming. But at the time I was working at a place more like Chotchkies so the struggle of these office workers didnt totally resonate with me. Now that Ive been working for a long time at a place more like Initech, it seemed like the movie might be more impactful. While Initech is run in a way that is definitely exaggerated, you can feel the authenticity of it. Ive had conversations that sounded just like this in the past, and I think Ive even been the Gary Cole character occasionally. So, I was buying into this movie a lot better this time, and laughed more.\n\nIm not sure that Office Space is quite a laugh-out-loud comedy, though. It has some situational comedy that certainly made me chuckle, but there were few moments that went beyond that. The best parts are the scenes right after Ron Livingston is hypnotized. Thats where he starts doing things many other people only dream about. The interview where he is brutally honest was downright cathartic for me to experience vicariously through him. The other comedy treat is literally any line from Stephen Root as the mild-mannered Milton. His struggle with the stapler and his ever-moving desk is great.\n\nIm not sure all the minor characters were justified in Office Space. The nosy neighbor was only good for one joke, and frankly it wasnt all that funny. But even more questionable was the relationship with Jennifer Aniston. Was there any purpose to that subplot other than to point out people can hate their job no matter what it may be? They didnt have any chemistry, and being in a relationship didnt change anything for Livingstons character. As you can see, I wasnt totally enamored with Office Space, its not my favorite comedy. But I connected with the story, and that correlation to my day-to-day reality made it work much better this time.",
            "review_date": "2017-10-06",
            "source": "rt"
        },
        {
            "content": "Boring garbage not funny at all movie.",
            "review_date": "2017-08-01",
            "source": "rt"
        },
        {
            "content": "A good mix of sharp dialogue, witty lines, satirical characters and situations and a deadpan tone. I can see why Mike Judge's Office Space has become this sort of working class comedy classic.",
            "review_date": "2017-05-31",
            "source": "rt"
        },
        {
            "content": "What makes this relatable comedy work best is the solid cast and incredibly funny and witty script since the plot isn't the best and does all end a little conveniently but least it is enjoyable and I was laughing throughout.",
            "review_date": "2017-05-26",
            "source": "rt"
        },
        {
            "content": "A nice little comedy that pokes fun at the typical office happenings and characters. It has aged well and is still relevant.  Nice characters and sound bites.",
            "review_date": "2017-05-22",
            "source": "rt"
        },
        {
            "content": "Not perfect but I like it",
            "review_date": "2017-04-27",
            "source": "rt"
        },
        {
            "content": "One of the funniest movies I've ever seen!",
            "review_date": "2017-04-04",
            "source": "rt"
        },
        {
            "content": "A witty, snappy and above all hilarious satire on the grind of office work and labouring in a job you hate simply for the pay check and nothing else. Mike Judge makes an impressive live-action debut, utilises the strengths of his actors and picking apart the gripes of menial office workers who are constantly berated for the most trivial of errors and receive no thanks whatsoever for the things they achieve. The laughs are quite unevenly spread, with the first 30 minutes containing the funniest jokes and character moments. The rest of it isn't dull by any means, but it never matches its comedic quality. I really enjoyed the performances, the concept, the jokes and the fact that, while it may take a few strange turns, it stays relatively faithful to its core values. Definitely worth a watch.",
            "review_date": "2017-03-06",
            "source": "rt"
        },
        {
            "content": "Simultaneously funny and depressing.",
            "review_date": "2017-02-18",
            "source": "rt"
        },
        {
            "content": "Definitely a cult film. Parts of this film are very funny and now iconic. A couple of performances are good and the way it represents working in an office looks realistic. The biggest problem is the character Milton. He's supposed to be funny but he was one of the most annoying characters ever put to screen. Took a lot of my pleasure away from the movie.",
            "review_date": "2017-01-30",
            "source": "rt"
        },
        {
            "content": "A classic for anyone in the workforce.  Everyone has or will have a boss and coworkers like this group.  Great one liners.  Love it!",
            "review_date": "2017-01-19",
            "source": "rt"
        },
        {
            "content": "*Great Movie.  The advertising that says that Mike Judge the creator of B&B, is very misleading.  This is not a movie for the B&B crowd.",
            "review_date": "2017-01-14",
            "source": "rt"
        },
        {
            "content": "An entertaining salute to the daily grind of the office worker. Bitchin' soundtrack too.",
            "review_date": "2017-01-12",
            "source": "rt"
        },
        {
            "content": "A funny critique of corporate culture. Nothing life changing but surely a classic.",
            "review_date": "2016-12-19",
            "source": "rt"
        },
        {
            "content": "Ah the is alright. Some funny moments but it was an easy watch which everyone can relate to!",
            "review_date": "2016-12-15",
            "source": "rt"
        },
        {
            "content": "Film project from Mike Judge makes some stark (and funny) observations of cubicle office culture. Best parts are the firm's hired consultants and Judge's turn as Aniston's supervisor at the chain restaurant. Film did far better in the video market than the theater.",
            "review_date": "2016-11-07",
            "source": "rt"
        },
        {
            "content": "The ultimate bad work day movie. Hilarious and layered. Not all the jokes land but it's a solid flick",
            "review_date": "2016-10-17",
            "source": "rt"
        },
        {
            "content": "Entertaining movie about working in an office.",
            "review_date": "2016-09-01",
            "source": "rt"
        },
        {
            "content": "Great movie to quote. Bust see if you've ever worked in an office!",
            "review_date": "2016-08-05",
            "source": "rt"
        },
        {
            "content": "If you've ever worked in an office setting....YOU KNOW!  This movie couldn't be more perfect, there is someone exactly like every single one of these characters and it is miserable...unless you're Lumberg-then you're probably oblivious. I felt like I was living this movie every day for 14 years at my last job...I was a mix of Peter/Milton.",
            "review_date": "2016-07-06",
            "source": "rt"
        },
        {
            "content": "Funny moments and many relatable characters, but it is slow between comedic moments.",
            "review_date": "2016-06-28",
            "source": "rt"
        },
        {
            "content": "¿Están locos? Cierren este lugar ahora mismo. Inexplicable cómo este clásico puede tener tan baja calificación.",
            "review_date": "2016-06-16",
            "source": "rt"
        },
        {
            "content": "I wanna do nothing :v",
            "review_date": "2016-06-01",
            "source": "rt"
        },
        {
            "content": "Very quotable, especially from Gary Cole's performance as Lumbergh.",
            "review_date": "2016-05-03",
            "source": "rt"
        },
        {
            "content": "King of the Hill set in a soul numbing corporate environment.",
            "review_date": "2016-04-06",
            "source": "rt"
        },
        {
            "content": "Clever and loaded with wit, Office Space offers a warmly empathetic, surprisingly poignant understanding of the never-ending difficulties of work, and one that delivers with satisfying bite and some gut-busting belly laughs -- all of which are further bolstered by top-notch golden character work from Stephen Root and Gary Cole.",
            "review_date": "2016-04-06",
            "source": "rt"
        },
        {
            "content": "Great, genuine humour. One of my favourite feel good movies as well.",
            "review_date": "2016-04-02",
            "source": "rt"
        },
        {
            "content": "in the work place, the highs of the workplace, technology, softwares, profit, and then the slip, of downsizing, outdated machines, practices and realization of slim recovery. Whomever is leftover and get the benefits of more pay doing multiple jobs and others get let go. this primal and anger that dwells in the workplace of pressure, expectations and security and the deadlines that must made, is unsoulfully unfilling, that makes you dead inside. Worth destroying, worth not staying for this waste of time and energy that makes you depressed to have management that accept all this. For what the companies is worth to what it earns and the valuable asset you are that make it happen but you realize is it worth it longterm. Life is short to be doing something you hate your whole life.",
            "review_date": "2016-03-27",
            "source": "rt"
        },
        {
            "content": "Being a notorious cult classic directed by Mike Judge, Office Space sounded like an easygoing comedy.\nMike Judge's feature length films Idiocracy (2006) and Beavis and Butthead Do America (1996) are two of the funniest films I have ever seen in my life, and the former served as a key sign of his sense of both humour and political satire. In Office Space, he exercises a lot of social commentary. And though it may not be his funniest film, its satirical edge has no shortage of validity. Mike Judge's feature length films Idiocracy (2006) and Beavis and Butthead Do America (1996) are two of the funniest films I have ever seen in my life, and the former served as a key sign of his sense of both humour and political satire. In Office Space, he exercises a lot of social commentary. And though it may not be his funniest film, its satirical edge has no shortage of validity. Office Space is a film which isn't reliant on a story to carry the narrative. It's very much a simplistic film which depends on its general concept and themes to carry its plot. This means the feature is easy to watch, but it doesn't mean it is bereft of engaging the viewers in thought. Set in the context of an office and following the everyday occurrences of white-collar IT workers, Office Space is a film which audiences could easily sympathise with. The characters are everymen getting caught in up in common frustrating situations, starting in the film's intro credits where they struggle through a traffic jam and deal with the frustrations of lane congestion. This is but one of many of the issues viewers can sympathise with in Office Space as essentially the entire film is constructed out of everyday issues that nearly everybody should be familiar with. Since viewers can sympathise with the situations faced by the characters in a lighthearted comedy, the slow pace and simplistic premise do not prove too much of a problem. Admittedly there are moments that drag on and do not engage viewers, but with the work of an intelligent screenplay Mike Judge is able to achieve much with a small budget.\nPresenting viewers with a realistic depiction of the office workplace, Office Space uses a lifeless atmosphere and intentionally generic characters to provide a variety of perspectives on the setting which all lead to the same basic level of frustration. As the film goes on, the script grows more intelligent in dissecting why such a workplace is far from efficient. When protagonist Peter Gibbons is left to justify why he shouldn't be downsized, he speaks the truth about the entire workforce in general: work is something that frustrates everybody to the point of having their mind numbed, and a lack of motivation in the workplace effectively ensures that employees will perform the bare minimum to maintain job security. This one scene is the most intelligently thought stimulating moment of the film, the endeavour of discussion regarding the idiotic management of the workplace. This political edge loosens in the second act when the feature becomes more focused on a scheme concocted by the main characters, and this is where it declines in interest. The political commentary still runs parallel to the story, but there is greater reliance left on the characters to carry the film at these moments. Since the characters are designed to be generic, the resulting effect is limited while the romantic subplot of the film doesn't offer much that is compelling. So Office Space isn't as engaging in its second half, but the easygoing nature of the production remains clear enough for viewers to still enjoy things.\nOffice Space also promotes Mike Judge's sense of stylish filmmaking in the live-action medium, even though it is a minor element of the production. After the intro, protagonist Peter Gibbons walks into an office wearing his grey shirt which makes him blend in with the monochromatic cubicle walls and desk tools around him, showing that Mike Judge is aware of what he is capturing in terms of imagery. Yet the most dominant aspect of Office Space's technical aspects is the perfection of its soundtrack. By notorious contrast to the white collar men in suits employed at the office, Office Space's soundtrack is composed of a collection of Gangsta Rap songs which were in their heyday during the 1990's thanks largely to popularization by N.W.A. The greatest two pieces are by Geto Boys: \"Still\" which plays out during the film's most iconic moment in which the characters aggressively destroy a malfunctioning fax machine like they're executing a gang beating, and \"Damn It Feels Good to Be a Gangsta\" which is as perfect as it sounds. The former capitalizes on Mike Judge's eye for imagery by playing with different kinds of slow motion, Dutch angles and intense sound editing, making it the most stylish moment in the film.\nAnd the cast of Office Space deliver a dedicated collection of performances.\nRon Livingston captures the natural persona of reluctance and frustration inhabiting every white-collar office worker. As the story progresses, he develops to the point of no longer caring about the workplace enough to even maintain job security and ends up acting in a way everybody in the real-life workplace desires to. He speaks the truth of the screenplay with a strong understanding of its relevance and does it with such confident flair that he makes an easily likable protagonist for Office Space. Ron Livingston captures the intentionally dull spirit of Office Space while maintaining enough restrained energy to transcend it enough to stand out from the other cast members without straying too far from the themes.\nGary Cole's performance in Office Space is nothing short of iconic. The man has had a long career in films with his finest work proving to be consistently in comedy roles, but he has never played a character as distinctive as Bill Lumbergh. With not even the slightest flair of emotion in his role, Gary Cole perfectly embodies the lifeless and soulless product of corporate management in Office Space. Hitched up in a suit and suspenders while always carrying around a coffee mug, Gary Cole captures the stiff movements of a statue to match his tone of line delivery on a physical level. And every time he ends his speeches with the line \"That would be great\" with blunt monotony, his blunt monotony is nothing short of hilarious for its plain accuracy.\nStephen Root also provides a very sympathetic character for the story. In the role of Milton Waddams, Stephen Root perfectly captures the bumbling nature of a character who has suppressed his frustrations for too long. Stumbling over all his words with an obsessively quiet voice volume, Milton Waddams appears to be a character of greater social awkwardness than anyone else around him and can't seem to grasp the intentions of others which leads to them taking advantage of him. It's hard not to feel sorry for him while his rambling words provide a funny character for the narrative, so Stephen Root stirs up sympathy and laughter with Office Space.\nCatering to the stereotypes of the roles written for them, David Herman and Ajay Naidu manage to add strong supporting humour to Office Space. And even though Jennifer Aniston's role in the film is a subplot revolving around a rather dull romantic story, her natural persona fits the profile well while the fact that she played this role during her career heyday on the sitcom Friends (1994-2004) provides a contrast to her iconic character Rachel Green as she plays a far more intelligent character in Office Space.\n\nOffice Space may have minimal story and a slow pace, but the simplicity of its narrative is the cornerstone of its brilliance: it is packed with thought-provoking satire and social commentary, realistic characters and easygoing laughter.",
            "review_date": "2016-02-28",
            "source": "rt"
        },
        {
            "content": "Great corporate humor, laughed a lot on the work lives of cubicle people.",
            "review_date": "2016-02-17",
            "source": "rt"
        },
        {
            "content": "Office Space has a truly hilarious sting of jokes, and a wonderfully gut busting opening 10 minutes, but it's jokes are eventually spaced out farther and farther apart as the film progresses, and not all of them land. The lead character, while well acted, I found to be a tad bland, and instead I enjoyed other characters such as the IT guys, and his neighbor to be much funnier. The Milton character seemed to show promise for some really funny things, but he was so underused that I could not help but be disappointed. Jennifer Aniston shows up here, as a character for a live interest, which works well enough, but I though Gary Cole was marvelous as Initechs boss, and I really enjoyed his performance. Overall, Office Space is nothing that will make me clamor for another viewing immediately, but I can see myself watching this over again in the future, and I did get some genuinely good laughs out of this",
            "review_date": "2016-02-09",
            "source": "rt"
        },
        {
            "content": "loved it. Made me think about what i should have done a old bosses and colleagues.",
            "review_date": "2016-02-08",
            "source": "rt"
        },
        {
            "content": "Mild amusement with elements that many people who work in an office would relate too, jobsworths, useless managers, crap printers etc..  mumbling guy was boring and in it too much. could/should have been better given that the core story is good",
            "review_date": "2016-01-16",
            "source": "rt"
        },
        {
            "content": "Surprised I'd never seen this one until now, very humorous and enjoyable.",
            "review_date": "2015-12-23",
            "source": "rt"
        },
        {
            "content": "Depressing and incredibly cynical, Office Space is the opposite of suicide relief, which is really what comedy is supposed to be.  Boasting a few memorable scenes and characters, this film is ultimately unoriginal and derivative in its treatment of corporate America's effect on its workers.  Can there be any easier target for a comedy of cynicism than the boss that YOU hate?  Quite unique in its style and dryness, its also overly sympathetic in its treatment of its characters and its gift of the hot chick for the nice guy at the center of it all that is really much more hateable than any corporate stooge could ever be.",
            "review_date": "2015-12-22",
            "source": "rt"
        },
        {
            "content": "A comedy more likely to depress than entertain, in spite of a few near legendary spots.",
            "review_date": "2015-12-22",
            "source": "rt"
        },
        {
            "content": "Simply one of the 25 best comedies of the past 25 years ummmmmm yeaaaaaahhhjj",
            "review_date": "2015-12-05",
            "source": "rt"
        },
        {
            "content": "If your like me, you have probably worked a few jobs in your lifetime that you just simply hate. You dread waking up in the morning and sitting in traffic to get to a place you really don't want to arrive at. It has never really been co workers that have gotten on my nerves, but the actual job and a few bosses have annoyed me to no end. Maybe that is why I love Office Space so much. It is pretty much a movie about a group of guys who hate their job and they set out on a ridiculous plan to bring down the company and get rich in the process of doing it. Well, needless to say it doesn't work, but nonetheless its a hilarious movie. Office Space has some of the funniest characters I've seen in a while. And if you work in an office with a bunch of other people, maybe for a large corporation, you'll probably enjoy the satire in this movie as well.",
            "review_date": "2015-12-03",
            "source": "rt"
        },
        {
            "content": "If your like me, you have probably worked a few jobs in your lifetime that you just simply hate.  You dread waking up in the morning and sitting in traffic to get to a place you really don't want to arrive at.  It has never really been co workers that have gotten on my nerves, but the actual job and a few bosses have annoyed me to no end.  Maybe that is why I love Office Space so much.  It is pretty much a movie about a group of guys who hate their job and they set out on a ridiculous plan to bring down the company and get rich in the process of doing it.  Well, needless to say it doesn't work, but nonetheless its a hilarious movie.  Office Space has some of the funniest characters I've seen in a while.  And if you work in an office with a bunch of other people, maybe for a large corporation, you'll probably enjoy the satire in this movie as well.",
            "review_date": "2015-11-30",
            "source": "rt"
        },
        {
            "content": "Disjointed storyline.",
            "review_date": "2015-10-09",
            "source": "rt"
        },
        {
            "content": "Mike Judge's directorial debut Office Space is a surprisingly hilarious classic that would be remembered for a very long time. Ron Livingston is pretty good and funny in it, and so are the other actors. With one of the characters named Michael Bolton, it can obviously lead to being annoying and a gimmick, but the way they handled it, it was very well done and can get some laughs out of it. The characters are very memorable, especially Milton who seems all sweet and innocent until when someone messes with him, he starts getting dark thoughts which is pretty funny. The script is very witty, and it give some memorable lines. The jokes are very funny, and it shows about what's it like to work in a office with careless bosses and some annoying co-workers. The plot kind of feels like a bit of an excuse to show sketches, but it's effective to know that most of them work, and the movie succeed at making a very funny film out of it.",
            "review_date": "2015-10-01",
            "source": "rt"
        },
        {
            "content": "Witty 90's flick, probably Judge's cinematic best.",
            "review_date": "2015-09-30",
            "source": "rt"
        },
        {
            "content": "Hilarious, witty, and biting satire.  Anyone who has ever had a job will appreciate this one.",
            "review_date": "2015-09-22",
            "source": "rt"
        },
        {
            "content": "Peter Gibbons is computer programmer who at the ripe old age of 28 is having a mid-life crisis. Unable to endure another moment of the mind-numbing routine and petty annoyances that assault him day after day, Peter and some equally frustrated colleagues hatch a plot which could lead to a very lucrative and early retirement.",
            "review_date": "2015-09-22",
            "source": "rt"
        },
        {
            "content": "I vaguely remember hearing from time to time by family and friends that Office Space is a comedy you have to see, and that it is generally considered a great comedy. Of course I had seen Office Space before my most recent viewing (yesterday) and there were some memorable parts. Watching it again on the big screen a few years later, I realized yes, there are memorable parts to this comedy, but to tell you the truth, this is actually kind of a boring story.\n\nThis is the only film I have seen Ron Livingston in, as well as the actors who play his sort of friends at the office.  It's sad when you are told there is a great comedy out there, but then you realize the only person you know in the movie (and still had a career afterwards) is Jennifer Aniston. However, Stephen Root steals the show as the ever-mumbling Milton.  What a wacky awkward character that brings a grin to your face every time you see him.  He is like an adorable whimpering puppy that you can't help but feel sorry for since he is clearly not a great people person.  I'd imagine his character was what the movie was based on since the film was apparently derived from a comic titled \"Milton.\"\n\nThe famous printer-destroying scene: it really shouldn't be that famous at all. It's just three guys smashing a printer in slow motion.  It holds no merit, and while it has rap playing in the background to reflect the character Michael Bolton's taste in music as well as the fact that the three are \"more hood\" now that they have ripped off their company, it's barely memorable.\n\nAt least the film's protagonist, Peter, makes some progress in the film. He starts out by hating his job, and his life luckily gets easier after he visits a hypnotherapist who tells him to relax and then dies abruptly. After this, Peter lives life how he wants to, and despite his not going into work actually gets promoted due to his honesty and relaxed attitude.  He then gradually starts becoming concerned with work life again, and by the conclusion he has found a balance between work and leisure.\n\nThis so-called \"great comedy\" provides few laughs, but is really easy to follow which is probably why people like it.  For me, I'd rewatch this film just for the parts with Stephen Root as Milton, but that's about it. If you're looking for intelligent humor - let alone a good laugh at all - don't look here.  Barely a decent film.",
            "review_date": "2015-09-04",
            "source": "rt"
        },
        {
            "content": "Comedy classic. If you haven't watched this movie you have to watch it twice in a row!",
            "review_date": "2015-08-29",
            "source": "rt"
        },
        {
            "content": "My all time favorite movie!",
            "review_date": "2015-08-22",
            "source": "rt"
        },
        {
            "content": "Total feel good movie! Stick it to the boss, watched several times. Great casting, Mr Brady as the boss, Jennifer Aniston too!",
            "review_date": "2015-08-20",
            "source": "rt"
        },
        {
            "content": "This is one of the funniest, cult classic films of all time.",
            "review_date": "2015-08-11",
            "source": "rt"
        },
        {
            "content": "One of the funniest movies ever made if you've ever worked in an office. Love it.",
            "review_date": "2015-08-09",
            "source": "rt"
        },
        {
            "content": "A satirical (alarmingly accurate) view on office life. The chances are you will see some of your colleagues in the characters which makes the film funnier. Not as many laugh out loud moments as I was expecting but I definitely enjoyed the film and it's no wonder it was a hit and still referenced to this day.",
            "review_date": "2015-07-28",
            "source": "rt"
        },
        {
            "content": "1st act is great, but the movie doesn't really ever go anywhere, much like the protagonist.",
            "review_date": "2015-07-21",
            "source": "rt"
        },
        {
            "content": "I am not sure why I never saw this until now.  It has elements that any office worker can easily identify with.  A great cast with believable characters kind of makes this the Ferris Bueller of office movies.",
            "review_date": "2015-07-14",
            "source": "rt"
        },
        {
            "content": "Mike Judge's humor in this movie is more sly and less crude than in his usual works, a fine movie to be enjoyed by office workers everywhere.",
            "review_date": "2015-07-08",
            "source": "rt"
        },
        {
            "content": "Mike Judge did a great job portraying the white collar work environment, esp for IT",
            "review_date": "2015-06-17",
            "source": "rt"
        },
        {
            "content": "One of the most memorably funny comedies I've seen. It's makes quite the excellent satire of life as an office drone.",
            "review_date": "2015-06-16",
            "source": "rt"
        },
        {
            "content": "Yeah.....that be great",
            "review_date": "2015-06-13",
            "source": "rt"
        },
        {
            "content": "This movie is totally relatable and completely full of quotable lines!",
            "review_date": "2015-06-07",
            "source": "rt"
        },
        {
            "content": "As an IT guy, this movie speaks to me on a spiritual level.",
            "review_date": "2015-05-30",
            "source": "rt"
        },
        {
            "content": "The best office comedy ever.",
            "review_date": "2015-04-28",
            "source": "rt"
        },
        {
            "content": "Office Space! Office Space is definatley one of the best comedys i have ever seen in my life. It is an amazing comedic story, a guy hates his job, cant do anything about it, so depressed from work, and he goes to a hypnotist, and gets hypnotized and is stress free for the whole movir and there are just alot of things i can really relate to in this movie and its just such great writing and every bit of this movie worked for me and i am glad i watched it, and i genuinley laughed at it when i was watching it, and i was by myself. i usually dont laugh at comedys when i am by myself. alot of comedys arent hilarious whenever you arent just sitting around watching them with your friends, but this was actually really funny, and was casted perfectly and like i said just worked every way. Go watch office space, this movie was hilarious. so if you could go ahead and watch this, that'd be great.",
            "review_date": "2015-04-27",
            "source": "rt"
        },
        {
            "content": "One of my favourite films.",
            "review_date": "2015-04-25",
            "source": "rt"
        },
        {
            "content": "Now a classic must-see!",
            "review_date": "2015-04-18",
            "source": "rt"
        },
        {
            "content": "I set the building on fire",
            "review_date": "2015-04-09",
            "source": "rt"
        },
        {
            "content": "Dilbert and Drew Carey's bastard lovechild - An existential horror film?",
            "review_date": "2015-04-09",
            "source": "rt"
        },
        {
            "content": "One of the best movies of all time! Must see this movie before you die, put it on your list!",
            "review_date": "2015-04-07",
            "source": "rt"
        },
        {
            "content": "\"Office Space\" is a cult classic comedy that is highly underrated as far as the box office goes. The story is plain and simple, a guy who is fed up with his job, his girlfriend, and his life in general decides he's going to do what he wants, and life takes him many places from there.\n\nI must say that I am way late to the party when it comes to seeing this film, but am I glad that I finally took the time to sit down and watch this under the radar comedy. This film is very hilarious and quotable, which is everything you would want from any comedy. If you enjoy any of Mike Judge's work, or are just a big fan of comedies in general, definitely check out \"Office Space.\" You won't regret it. 7.9/10",
            "review_date": "2015-03-19",
            "source": "rt"
        },
        {
            "content": "Pretty accurate portrayal of office drone life with lots of sarcastic humor to boot!",
            "review_date": "2015-03-11",
            "source": "rt"
        },
        {
            "content": "The funniest movie I've ever seen HANDS DOWN!!",
            "review_date": "2015-03-08",
            "source": "rt"
        },
        {
            "content": "Looks like someone's got a case of the mondays\n____\n\nI was aware this film existed as a boy and giggled at Milton's quiet mumbling. As a teenager I grew to appreciate more and more of the writing. It wasn't until I found my collector's edition DVD in my vault of films on retainer, that I realized I had been working retail for a year and a half. Sure, I don't work at a cubicle and I'm not entirely sure what a TPS report is, but perhaps, since enough time had passed this movie would mean more to me as an adult. Boy, was I right.\n\nI remember trying to describe the plot to friends, that it was about three guys who stole the idea from Superman 3. That movie where Superman fought rich white people who weren't Lex Luthor. My brother told me, I was missing the point. So on a second attempt, I told them it was about a white collar worker who was trapped in a hypnotic sense of zen. Once again he told me I was missing the point. And for a while I wasn't sure what he meant, what the point of the movie was. It was satirizing the work place. The supervisor who never seems to do any work, not having enough flair on your suspenders, being reminded about the memo, having to come in on your day off. I though the movie was just ok as a teenager, but not it seems painfully obvious to me, this movie only really works for adults.\n\nI racked my brain trying to figure out the symbolism of the red stapler. I feel smart enough to know it's symbolic or  possibly a metaphor, yet I'm not smart enough to know what it stands for. Perhaps when I become a true cinema snob I  will learn, as this movie seems to change for me the older I get. I believe that is a symbol that a movie is truly  powerful. So, what would I do will a million dollars? (Besides the two chicks) I know I would go out of my way to  recommend this film to anywho who's ever felt unappreciated at work, or hell, just anyone who has a full time job at all. So grab your stapler, throw out your TPS Report and remind yourself \"Damn it feels good to be a gangster\"",
            "review_date": "2015-02-20",
            "source": "rt"
        },
        {
            "content": "Office Space may be the most relatable film ever made. Although quite a few jokes fall on their face. \nGrade: B+",
            "review_date": "2015-02-16",
            "source": "rt"
        },
        {
            "content": "Yeah....If you could go ahead and read this review, that'd be great.",
            "review_date": "2015-02-07",
            "source": "rt"
        },
        {
            "content": "one of those comedys like 'airplane' I can watch over & over",
            "review_date": "2015-02-01",
            "source": "rt"
        },
        {
            "content": "This is a classic case of a movie that starts off perfect and loses steam along the way. The beginning of Office Space had me laughing my ass off. All the jokes were landing and the characters were extremely likeable and the bosses were extremely dislikable. It was on pace to be a 5/5 picture. Unfortunately, as the movie goes on, the jokes stop landing and the plot just gets kinda boring. Overall, if you're looking for a movie on Netflix to cheer you up, it's worth a viewing",
            "review_date": "2015-01-25",
            "source": "rt"
        },
        {
            "content": "It's a classic comedy that so many Americans in the business world can relate. One of the things I loved most was the soundtrack. All around awesome!",
            "review_date": "2015-01-25",
            "source": "rt"
        },
        {
            "content": "Absolutely hilarious. When you get home from the office, watch it!",
            "review_date": "2015-01-22",
            "source": "rt"
        },
        {
            "content": "Cultklassieker van de maker van Beavis & Butthead. In deze satire op de uitzichtloze kantoorjob is de humor meer afhankelijk van herkenbaarheid dan van iets anders, maar zeker nog te genieten. Shoutout naar deze scene: http://vimeo.com/56886652.\nFuckin' A, man.",
            "review_date": "2015-01-15",
            "source": "rt"
        },
        {
            "content": "It doesn't have a lot of straight up humor, but it did and still does nail the pits of office life. Its simple but has a lot of humanity to it that just delivers as real and sometimes amusing.",
            "review_date": "2015-01-07",
            "source": "rt"
        },
        {
            "content": "Anyone who has ever worked in a cubicle can relate to this film.  Or anyone whose had idiot bosses riding them for no good reason.  Very simple story with great dialogue and fine performances.  Nothing fancy - just funny and intelligent.  I don't even remember this film coming out as it only gained notoriety long after its release.  If you haven't seen it, you definitely need to.\n\nGrade = 8.5/10",
            "review_date": "2015-01-06",
            "source": "rt"
        },
        {
            "content": "A hilarious satire that is as thought-provoking as it is eminently quotable with a priceless performance from Gary Cole.",
            "review_date": "2014-12-10",
            "source": "rt"
        },
        {
            "content": "Take this job and shove it.",
            "review_date": "2014-12-10",
            "source": "rt"
        },
        {
            "content": "Roteiro de quadrinho e edição interessante, além de um belo estudo da sociedade americana dos anos 90, com um ótimamente inexpressivo Ron Livingston.",
            "review_date": "2014-11-27",
            "source": "rt"
        },
        {
            "content": "With identifiable characters, quotable one-liners and to-the-extreme outcomes, \"Office Space\" manages to put a big smile on a hard-working persons face!",
            "review_date": "2014-11-20",
            "source": "rt"
        },
        {
            "content": "One of the best comedies ever made. Absolutely hilarious",
            "review_date": "2014-11-02",
            "source": "rt"
        },
        {
            "content": "One star down  because there's Jennifer Anniston in it , she gives me the creeps.",
            "review_date": "2014-11-01",
            "source": "rt"
        },
        {
            "content": "If for some reason you haven't seen this movie, do yourself a favor and watch it. A tribute to anyone that has one of \"those\" jobs, and we've all had them....ask yourself \"what would you do if you had a million dollars\"....",
            "review_date": "2014-10-21",
            "source": "rt"
        },
        {
            "content": "A very fun movie with nice laughs all along the way. My one complaint is of the ending, I was expecting a more memorable climax. However, the ending was very fitting with the rest of the film so I'll let it slide.",
            "review_date": "2014-10-21",
            "source": "rt"
        },
        {
            "content": "Definitely one of my favourites.  Office work is my idea of hell so the joy I experience when the guys decide to fuck up the system never diminishes, no matter how many times I watch it.  Also, I just love the late 90's feel and aesthetic.  1999 was a good year and I miss it.",
            "review_date": "2014-10-21",
            "source": "rt"
        },
        {
            "content": "Produces an accurate representation of a mundane office job, one which I'm sure captures the contemporary existence of the majority. Inconsiderate bosses, weekend shifts, job appraisals, 'Office Space' humorously comments on al these things which make the average employee hate their life. The story lacks depth and it takes a short while for the good comedy to kick in but it is funny and doesn't resort to sex jokes on a regularly basis. If you find time between your tedious 9 to 5 and sleeping then this is worth a watch.",
            "review_date": "2014-10-15",
            "source": "rt"
        },
        {
            "content": "A little bit similar to American Beauty, but very funny and clever writing with some unforgettable characters.",
            "review_date": "2014-10-03",
            "source": "rt"
        },
        {
            "content": "A very smart comedy with a plot that's not too over blown. The relatable characters can definitely stick with you and so do their jokes. Some sequences and quotes from the movie are comedy stand points that have been parodied and meme'd. Definitely one to deserve its praise and is a cult comedy. Very great leading role by Ron Livingston as Peter and one of the best supporting casts in a comedy ever. Definitely one re-watching for the printer gangster sequence alone! (8.5/10)",
            "review_date": "2014-09-20",
            "source": "rt"
        },
        {
            "content": "A very unique comedy film, It's absolutely Hilarious. A true cult classic.",
            "review_date": "2014-09-19",
            "source": "rt"
        },
        {
            "content": "little lower on content that i remember, rap soundtrack is still beyond dope",
            "review_date": "2014-09-15",
            "source": "rt"
        },
        {
            "content": "It isn't nearly as fiercely funny or incisively smart in it's second half concerned with a money laundering plot as it is in it's inspired first, but Office Space is still a witty and relatable lampooning of corporate culture with a great ensemble cast.",
            "review_date": "2014-09-14",
            "source": "rt"
        },
        {
            "content": "An impressively sarcastic, hilarious comedy that uses humour ahead of its time",
            "review_date": "2014-09-13",
            "source": "rt"
        },
        {
            "content": "85%\nOffice Space is one of the funniest comedies to be made about a man's boring life, saturated by tons of hilarious characters and wit.",
            "review_date": "2014-09-13",
            "source": "rt"
        },
        {
            "content": "Funny and entertaining although it's only half of the movie. At first Office Space offers funny characters and good joke about employee at one company. But it become silly when it entered the 45 minutes of the film. Office Space is kind of comedy that entertaining enough but easily forgotten.",
            "review_date": "2014-09-07",
            "source": "rt"
        },
        {
            "content": "Sátira sobre a cultura corporativa de grandes empresas de TI.",
            "review_date": "2014-08-17",
            "source": "rt"
        },
        {
            "content": "A movie unlike anything before seen at the time. It is a magnificent caricature of life in the office and the day dreams of those working there. It is a fast-paced sequence of hilarity.",
            "review_date": "2014-08-12",
            "source": "rt"
        },
        {
            "content": "Mike Judge at his best. The acting is great, the scenarios are real, the jokes are funny, and the atmosphere is excellent. Watch it if you haven't already",
            "review_date": "2014-08-11",
            "source": "rt"
        },
        {
            "content": "This movie was pretty funny, in its own weird way. It created a world that felt strange, but in reality is actually pretty normal for some people. Milton and Bill were great characters that were very funny. The scene with Milton and the radio and the printer scene were my favourite parts. I liked the beginning a little more then the end, but either way it delivered some good humour. Definitely worth watching at least once, since it's pretty funny.",
            "review_date": "2014-08-10",
            "source": "rt"
        },
        {
            "content": "Office Space ridicules the drudgery of office life with clever dialogue and memorable lines.",
            "review_date": "2014-08-02",
            "source": "rt"
        },
        {
            "content": "Full of quirky characters and quotable lines and hilarious scenarios make this moive non-stop entertaining. Enough said.",
            "review_date": "2014-07-31",
            "source": "rt"
        },
        {
            "content": "I think this movie is more accurate than people want to admit.  And after watching it, you'll have a better idea why we need to treat our computer gurus better, so they don't make computer viruses.  Lots of funny scenes but when the temperamental fax machine gets its due, I can't help busting a gut.",
            "review_date": "2014-07-30",
            "source": "rt"
        },
        {
            "content": "Funny movie!!! I can't stop laughing about the printer scene!!",
            "review_date": "2014-07-29",
            "source": "rt"
        },
        {
            "content": "a very charming, funny film by the genius of Mike judge. . not to be taken very serious. but very fun indeed. \n\nnot enough to blow you away, but more than you expect for a comedy.",
            "review_date": "2014-07-25",
            "source": "rt"
        },
        {
            "content": "This cult classic comedy pretty successfully poked a stick at dull office-life, and provides many pop culture landmarks, including \"going office space\" on hated appliances or wearing flair.\n\nHowever, never having actually worked in an office, it's hard to relate to everything. I can relate to not always loving my job, but I don't have to file TPS reports.\n\nThere are a few chuckles here and there, I appreciate John C. McGinley's small role, and Ron Livingston's carefree demeanor that we all wish we could assume some days, but in the end, it's just another aged 90's comedy. A few years later, Ricky Gervais would claim the crown for office-related humor, and the UK and USA versions of The Office are a much more fulfilling place to spend your time.\n\nIt's funny, but not as funny as it could have been.",
            "review_date": "2014-07-21",
            "source": "rt"
        },
        {
            "content": "Not as funny as \"King of the Hill\".",
            "review_date": "2014-07-16",
            "source": "rt"
        },
        {
            "content": "This movie is heralded as a cult classic but was honestly dull but refreshing to me",
            "review_date": "2014-07-13",
            "source": "rt"
        },
        {
            "content": "Probably the most honest view of Silicon Valley cubicle culture ever committed to film.  I worked for a severely dysfunctional tech firm and had to keep reminding myself this was NOT a documentary.  Classic and Essential.",
            "review_date": "2014-07-09",
            "source": "rt"
        },
        {
            "content": "Classic!  Mike Judge's best non-animated creation.",
            "review_date": "2014-06-26",
            "source": "rt"
        },
        {
            "content": "Poke fun at mundane 9-to-5 desk job, this movie is cult classic.",
            "review_date": "2014-06-23",
            "source": "rt"
        },
        {
            "content": "Office Space is hilarious.  It's similar to The Big Lebowski in the fact that, there is absolutely no point to the movie.  Still, the performances and the quirky humor make it an interesting view.  And of course Jennifer Aniston is in it, so that's a big plus.",
            "review_date": "2014-06-18",
            "source": "rt"
        },
        {
            "content": "One of the best comedies ever made. Nuff said",
            "review_date": "2014-06-16",
            "source": "rt"
        },
        {
            "content": "A hilarious look at something we all can understand and sympathize with: the apathy and hatred of a dull, dead-end job.",
            "review_date": "2014-06-13",
            "source": "rt"
        },
        {
            "content": "One of the funniest movies ever made if you know anything about/have any experience in the corporate world. The beating of the fax machine while \"Still\" by Geto Boys plays is one of the funniest scenes in any movie ever.",
            "review_date": "2014-06-13",
            "source": "rt"
        },
        {
            "content": "This movie was a short and pleasant watch. The premise revolving around a group of friends fed up off their stale lives at work is treated very well. The movie put forth some interesting scenario's with some very clever moments and hilarious lines. Clocking in at just 90 minutes, it never got boring and despite being predictable, was fun nevertheless. Worth checking out!",
            "review_date": "2014-06-08",
            "source": "rt"
        },
        {
            "content": "Hilarioussss !!!! Superrrr Good!!   A Classic that never gets old!",
            "review_date": "2014-06-06",
            "source": "rt"
        },
        {
            "content": "Had the opportunity to be a great office comedy.  Was funny and insightful until it got to the \"Superman III\" part.",
            "review_date": "2014-06-05",
            "source": "rt"
        },
        {
            "content": "Office Space introduces some memorable characters and provides smart and witty laughs, courtesy of the brilliant Mike Judge.",
            "review_date": "2014-06-04",
            "source": "rt"
        },
        {
            "content": "It's an entertaining, very amusing, and above all exceptionally clever satire of office work life. I didn't find myself laughing out loud too often but I smiled the whole way through. The story is fun and the characters are exaggerations of what some people might be like in real life. I think it is a good comedy that relies more on funny dialogue, characters, and situations more than anything else. That's something you don't see as much nowadays, and for that reason, I think it's a must see if you're a fan of clever and sharp comedy.",
            "review_date": "2014-06-03",
            "source": "rt"
        },
        {
            "content": "When the layoffs start to happen him and his coworkers decide to create a computer program that will rip off the company. This movie has funny characters and a funny and really smart writing. and let's not forget Stephen root character which he has not a lot of screen time but he still reminds as the best part of the film.",
            "review_date": "2014-05-31",
            "source": "rt"
        },
        {
            "content": "Love this movie. It's a jump to conclusions mat!",
            "review_date": "2014-05-21",
            "source": "rt"
        },
        {
            "content": "Even if you're not into watching it like I was, Office Space still offers great laughs, awesome characters, great writing from Mike Judge and a great message that tells us that, even though your boss is a BIG jerk, you just gotta handle it. Like Dilbert did (kind of). Oh and DILBERT! Man that character is HILLARIOUS!",
            "review_date": "2014-05-18",
            "source": "rt"
        },
        {
            "content": "Brilliant and dark, this film will have you cracking up the whole way through.",
            "review_date": "2014-05-18",
            "source": "rt"
        },
        {
            "content": "Classic. Anyone who has worked in a corporate can relate to the characters.",
            "review_date": "2014-05-14",
            "source": "rt"
        },
        {
            "content": "Endlessly quotable, especially if you have spent any amount of time as an office worker.",
            "review_date": "2014-05-10",
            "source": "rt"
        },
        {
            "content": "A perfect example of a comedy that is well ahead of its time. Office Space is hilarious and brutally honest about how many people feel about their jobs. This will be a very relatable film for a lot of people and it's filled with hilarious one-liners and memorable characters.",
            "review_date": "2014-05-05",
            "source": "rt"
        },
        {
            "content": "One of the better  comedies I've seen in years.",
            "review_date": "2014-05-03",
            "source": "rt"
        },
        {
            "content": "Umm...yeah.  Office Space is an outstanding workplace comedy that brilliantly satirizes office life.  After going to hypnotherapy, software engineer Peter Gibbons has a change in attitude and begins to rebel against the cubicle life that he feels trapped by.  Ron Livingston, Jennifer Aniston, Stephen Root, and Gary Cole lead the cast and give strong performances.  The writing is also especially good, particularly the dialog; which is quite clever and witty.  Overall the film does a great job at satirizing Corporate America, and at finding humor in the mundane.  A poignant and timely comedy, Office Space is incredibly smart and funny.  \"PC load letter!  What the f*** does that mean?\"",
            "review_date": "2014-04-30",
            "source": "rt"
        },
        {
            "content": "Want to know what it is like to work in a cubicle? Watch Office Space",
            "review_date": "2014-04-16",
            "source": "rt"
        },
        {
            "content": "It perfectly satirizes the doldrums of office life through incredibly over-the-top characters and a marvelously funny script, but fails by trying to be something more than it is.",
            "review_date": "2014-04-14",
            "source": "rt"
        },
        {
            "content": "After hearing about this movie for years I finally had the chance to see it, and it was as funny as people told me. Ron Livingston is the everyday working man, turned hero in the circumstance of not wanting to work and actually enjoy his life. This leads him into hilarious events that we all want to do at work, not show up, be late...yet get away with it all. This is a funny movie, and should be watched",
            "review_date": "2014-04-12",
            "source": "rt"
        },
        {
            "content": "Although the second half in undeniably weaker the movie is still magical",
            "review_date": "2014-04-11",
            "source": "rt"
        },
        {
            "content": "I thought the movie combined the right amount of sarcasm and work place environment to make the really good comedy. It also show how you should always be faithful to your friends.",
            "review_date": "2014-04-08",
            "source": "rt"
        },
        {
            "content": "Fun movie! It's cool seeing the guy stop giving a shit about petty things. He kind of reinvented himself.",
            "review_date": "2014-03-27",
            "source": "rt"
        },
        {
            "content": "After all these years it still makes me laugh.",
            "review_date": "2014-03-17",
            "source": "rt"
        },
        {
            "content": "Cubicle workers, unite!",
            "review_date": "2014-03-14",
            "source": "rt"
        },
        {
            "content": "Office Space is sometimes funny, and has an interesting storyline. But the best part of Office Space is its spot-on accuracy of portraying life inside the cubicle.",
            "review_date": "2014-03-09",
            "source": "rt"
        },
        {
            "content": "Office Space - the most relatably funny film.",
            "review_date": "2014-02-28",
            "source": "rt"
        },
        {
            "content": "almost love this movie completely. almost.",
            "review_date": "2014-02-22",
            "source": "rt"
        },
        {
            "content": "This is One of my favorite movies of all time.",
            "review_date": "2014-02-21",
            "source": "rt"
        },
        {
            "content": "I dont now why i love this movie so much is it the printer scene or just the humor. But so YEEEEEEAAAAAHHHHHH great movie",
            "review_date": "2014-02-11",
            "source": "rt"
        },
        {
            "content": "A well made and witty film that's a bit to short and doesn't quite have as many laughs as you would think, but still manages to be a funny, good time.",
            "review_date": "2014-02-08",
            "source": "rt"
        },
        {
            "content": "A few laughs. Pretty lackluster in every respect.",
            "review_date": "2014-02-06",
            "source": "rt"
        },
        {
            "content": "A promising and entertaining first half which satirises working in an office develops into a less rewarding second half narrative of romance and crime, albeit with a fulfilling ending.  A cult classic that is well worth watching for its quotability and characters, especially for anyone who frequents Reddit.",
            "review_date": "2014-02-05",
            "source": "rt"
        },
        {
            "content": "Almost a true masterpiece. Genius.",
            "review_date": "2014-02-04",
            "source": "rt"
        },
        {
            "content": "Goofy characters and funny dialogue make Office Space worth a watch.",
            "review_date": "2014-02-01",
            "source": "rt"
        },
        {
            "content": "It's a dumb movie. This stuff really happens at work.",
            "review_date": "2014-01-29",
            "source": "rt"
        },
        {
            "content": "Wow, Mike Judge can do live-action work of his own.  Based off the animated \"Milton\" shorts, the film satirizes the typical workday at a software company during the 1990s, and focuses on three employees who work a software company named Initech who are fed up with their jobs and decide to plant a virus the rob the company bankrupt, only to cause a massive mishap, thus satirizing white collar crime elements.  The cult classic also has subplots, including employee Peter Gibbons (who is one of three employees, who are Michael Bolton (employee not related to the singer of the same name), and Samir Nagheenanajar) being in a relationship with diner worker Joanna, and Milton going through lots of changes in his desk, supplies, and thinking about setting the building on fire.  The depiction of IT workers is perfect, and real life IT workers can agree by quoting the entire film.  Mike Judge writes a funny and smart script, and also brings the script to life thanks to his direction.  The film has different types of characters that are normal, bizarre, miserable, and plain mean, brought to life by great acting.  The film has tons of sharp dialogue, one-liners, and quotability that creates tons of worthwhile laughs.  One of the funniest films ever made, and one of the smartest satires created.",
            "review_date": "2014-01-25",
            "source": "rt"
        },
        {
            "content": "office space has some funny moments and good characters but ultimately seems disappointing.",
            "review_date": "2014-01-25",
            "source": "rt"
        },
        {
            "content": "My favorite movies about  work sucking",
            "review_date": "2014-01-22",
            "source": "rt"
        },
        {
            "content": "Serious twitch off Aniston. Livingston is great after his hypnosis and does what most of us only dream about when stuck in a dead end job. Good fun.",
            "review_date": "2014-01-19",
            "source": "rt"
        },
        {
            "content": "If you've ever had a job you hate, this is a must-see. It's good to know others have been stuck in the same place. Misery loves company, I guess.",
            "review_date": "2014-01-12",
            "source": "rt"
        },
        {
            "content": "A movie that brings out the rebel in me.",
            "review_date": "2014-01-12",
            "source": "rt"
        },
        {
            "content": "\"I could set this building on fire..\"",
            "review_date": "2014-01-08",
            "source": "rt"
        },
        {
            "content": "Just a funny movie that anyone with a job can relate to. The management of Initech are very obnoxious and by-the-book. the whole cast of characters have their moments. A must see.",
            "review_date": "2014-01-04",
            "source": "rt"
        },
        {
            "content": "Hilarious!  Reminds me a lot of the office at my job!",
            "review_date": "2014-01-03",
            "source": "rt"
        },
        {
            "content": "Brilliant. Classic. Undeniably accurate to the monotonous day in, day out corporate routine. A comedy that knows it's purpose and does not attempt to be anything more. This is good for the company.",
            "review_date": "2013-12-30",
            "source": "rt"
        },
        {
            "content": "No film has ever captured the absurdity of corporate \"loyalty\" and the rage flowing beneath the surface of corporate office culture. Brilliant and biting satire.",
            "review_date": "2013-12-21",
            "source": "rt"
        },
        {
            "content": "Pretty darn funny but a little dated. Its comedic value is high and I'm not sure what the budget was on this movie, but it seemed low. The dialogue and soundtrack was great. I really liked how it should real life situations, the one that started all work comedy shows!",
            "review_date": "2013-12-20",
            "source": "rt"
        },
        {
            "content": "Works because of the intelligent writing and the classic one liners, though it does drag a little at the end.",
            "review_date": "2013-12-16",
            "source": "rt"
        },
        {
            "content": "My favourite movie comedy of all time!",
            "review_date": "2013-12-10",
            "source": "rt"
        },
        {
            "content": "Are u an office gangsta? \nWell just another case of the Mondays.",
            "review_date": "2013-12-03",
            "source": "rt"
        },
        {
            "content": "I saw this for the first time, i won't get the joke and at a young age at like the 12 year old in me won't get it the jokes , But INow I found it Funny and Smart , Mike Judge did a Great  job on this, and do enjoy Beavis and Butt-head aswell, But this so much better than done The Office (Ricky Gervais UK TV series, \nSo I like this one.",
            "review_date": "2013-11-30",
            "source": "rt"
        },
        {
            "content": "best comedy of the last 30 years. nuff said.",
            "review_date": "2013-11-26",
            "source": "rt"
        },
        {
            "content": "Mike Judge is a misunderstood genius.",
            "review_date": "2013-11-23",
            "source": "rt"
        },
        {
            "content": "Cult classic. A movie about boring office work and our crazy imaginations",
            "review_date": "2013-11-20",
            "source": "rt"
        },
        {
            "content": "This is a master piece for the humor included in it,else the story fails to cope with the funny moments",
            "review_date": "2013-11-19",
            "source": "rt"
        },
        {
            "content": "Quite clever and hilarious. Lives up to its hype.",
            "review_date": "2013-11-16",
            "source": "rt"
        },
        {
            "content": "Some effective sarcasms are scattered in this office comedy, and the casts are impressive. How to make sure the office space is a nice and productive place is a real issue.",
            "review_date": "2013-11-08",
            "source": "rt"
        },
        {
            "content": "I cannot watch or think about this movie without quoting something from Milton. That's a bonus .5 a star there! :D",
            "review_date": "2013-11-07",
            "source": "rt"
        },
        {
            "content": "Damn it feels good to be a gangster",
            "review_date": "2013-10-30",
            "source": "rt"
        },
        {
            "content": "ummmm, yeahhhhh, this movie was....greaaaat! yeahhhhhhh...",
            "review_date": "2013-10-30",
            "source": "rt"
        },
        {
            "content": "This film is half-funny, at it's best moments.",
            "review_date": "2013-10-29",
            "source": "rt"
        },
        {
            "content": "Yeeeeeaaahhh Peter, it's Bill Lumberg here. Ah, I'm gonna have to get you to come in tomorrow and complete a TPS report on this movie. So if you could go ahead and do that, that'd be greeaaat. And did you get the memo about the cover sheet?\n\nOffice Space gets 37 pieces of flair above the minimum 15.",
            "review_date": "2013-10-28",
            "source": "rt"
        },
        {
            "content": "Though it doesn't start being immediately funny, it does go somewhere with its material, and sets itself up as a genuinely clever and unique jab at the drudgery and general awfulness of office life. The characters are really interesting, except Jennifer Aniston's character. To be honest, I think she has no real place in this movie other than to attract a wider mainstream audience. The story is put together really well, and it's told in a much cleverer fashion than Idiocracy, and the style of the movie seems to support the overall direction. Overall, though whatever message it has seems to have been ignored, I think it's still relevant today, because office work still sucks.",
            "review_date": "2013-10-20",
            "source": "rt"
        },
        {
            "content": "It's one of those workplace comedies that really speaks the truth.",
            "review_date": "2013-10-12",
            "source": "rt"
        },
        {
            "content": "Fun and satisfying movie and of course it's always nice to spend some time with Jennifer  Aniston.",
            "review_date": "2013-10-09",
            "source": "rt"
        },
        {
            "content": "If you've ever worked in an office this movie is going to resonate.  The only downsides are some mediocre acting, poor sets/camera work, and some dated sensibilities.  Definitely a cult film, but funny enough for general appeal.",
            "review_date": "2013-10-05",
            "source": "rt"
        },
        {
            "content": "If you could see this film, that'd be great.",
            "review_date": "2013-10-05",
            "source": "rt"
        },
        {
            "content": "You'll feel the feeling of its cult classic status and find it a little funny, but it's low on the entertainment value to enjoy. (B-)\n\n(Full review coming soon)",
            "review_date": "2013-10-03",
            "source": "rt"
        },
        {
            "content": "Classic comedy...must watch",
            "review_date": "2013-10-01",
            "source": "rt"
        },
        {
            "content": "More than a decade on I can appreciate this film all the more as it is now a close facsimile of my working life",
            "review_date": "2013-08-21",
            "source": "rt"
        },
        {
            "content": "Just what the common everyday cubical worker needs, a hilarious look at our jobs and how much they suck.",
            "review_date": "2013-08-10",
            "source": "rt"
        },
        {
            "content": "Mike Judge hits that comedy vein and, even though I have never actually shot anything intravenously so I cannot attest to the validity of this metaphor, the result is pure bliss. Defying most critics' expectations, this turned out to be a little comedy that got the credit it deserved from the universal 'audience' (most likely bc everyone can identify with the awesome-ness of burning your workplace down bc they took your stapler) that still remains one of the smartest, painfully funny comedies of our generation (you hear that Dumb & Dumber?) 5/5 When's Office Space 2 b*^$#es??",
            "review_date": "2013-08-08",
            "source": "rt"
        },
        {
            "content": "A very dull movie, with characters I couldn't care less about and a plot as thin as floss.",
            "review_date": "2013-08-04",
            "source": "rt"
        },
        {
            "content": "A smart humourous satire. Small little movie but quite enjoyable.",
            "review_date": "2013-08-01",
            "source": "rt"
        },
        {
            "content": "The first time I saw this movie, I thought that this was an OK movie with some big laughs. But, the second time I saw it, there are very funny jokes and very funny situations that are germain with ordinary work life in a cubicle. It is a sharp movie with funny lines and a memorable performance by Stephen Root. The only problem was that the \"planning\" or \"motive\" of taking the company down were not as interesting.",
            "review_date": "2013-07-30",
            "source": "rt"
        },
        {
            "content": "Cult films don't get better than this. Office Space is an underrated classic that will be remembered for eternity because of it's unforgettable characters, hilarious dialogue, and a preposterous performance from Gary Cole.",
            "review_date": "2013-07-29",
            "source": "rt"
        },
        {
            "content": "Very much a 90's movie but an enjoyable one to come back to.",
            "review_date": "2013-07-24",
            "source": "rt"
        },
        {
            "content": "Pete Gibbons and his co-workers have had enough of their office jobs and take steps that could bring about an early and positive retirement for them all when faced with redundancies and corporate downsizing.\n\nThis is a movie for anyone who has worked in a typical office cubicle environment. From the commute to work to dealing with complaining co-workers, difficult bosses, confusing procedures and equipment that just won't do what it's supposed to do.\n\nIf you've had a bad day in the office, or just having a case of the Monday's, definitely put this movie on!",
            "review_date": "2013-07-23",
            "source": "rt"
        },
        {
            "content": "One of the few comedies to be funny in the last 20 years",
            "review_date": "2013-07-22",
            "source": "rt"
        },
        {
            "content": "Ron Livingston depicts what must be one of the most liked and relatable characters in recent movie history. Office Space is one witty movie that doesn't make romance its prime concern but instead takes it along for the ride at enough of a pace to still call it a comedy.",
            "review_date": "2013-07-22",
            "source": "rt"
        },
        {
            "content": "Pretty great satire about people who are tired with their jobs.",
            "review_date": "2013-07-22",
            "source": "rt"
        }
    ]
}