{
    "rating": 4.6,
    "release_date": "1999-06-18",
    "num_reviews": 50,
    "genres": [
        "Mystery&thriller",
        "Drama"
    ],
    "summary": "When the body of Army Capt. Elizabeth Campbell (Leslie Stefanson) is found on a Georgia military base, two investigators, Warrant Officers Paul Brenner (John Travolta) and Sara Sunhill (Madeleine Stowe), are ordered to solve her murder. What they uncover is anything but clear-cut. Unseemly details emerge about Campbell's life, leading to allegations of a possible military coverup of her death and the involvement of her father, Lt. Gen. Joseph Campbell (James Cromwell).",
    "reviews": [
        {
            "content": "Watch it…. you'll enjoy it although if you're  not overly sensitive to some content….  Justice will prevail and remember it's not over until the credits roll.",
            "review_date": "2023-01-24",
            "source": "rt"
        },
        {
            "content": "The betrayal of the daughter by her father made me sick. I have a daughter. Had to turn the movie off.",
            "review_date": "2022-08-10",
            "source": "rt"
        },
        {
            "content": "The General's Daughter is a fast gripping thriller about military conspiracies.\nIts well-incorporated political elements never outweigh its entrainment and suspense unlike the pious, preachy and insufferably patronizing modern Hollywood movies. John Travolta's dramatic delivery makes quite a strong character with genuine aplomb and inalienable valor.",
            "review_date": "2022-04-24",
            "source": "rt"
        },
        {
            "content": "A solid military police thriller on par with NCIS.  One of Travolta's better performances and a solid supporting cast.  The juxtaposition between military culture for protecting their own and the search for truth is well balanced.  Not surprisingly, the criminality of the military covering up the rape of women soldiers is as prevalent today as when this movie was made.",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "A movie that doesn't waste any time to develop its story and its characters. Highly underrated film.",
            "review_date": "2022-04-04",
            "source": "rt"
        },
        {
            "content": "great movie, always would recommend.",
            "review_date": "2022-02-16",
            "source": "rt"
        },
        {
            "content": "Really great movie! I can't believe this was rated so low! Great performance by travelers and great story. Highly recommend.",
            "review_date": "2022-01-09",
            "source": "rt"
        },
        {
            "content": "The story is better than the execution - but Travolta and Stowe hold down the army murder mystery and the cover ups that are exposed.",
            "review_date": "2021-07-11",
            "source": "rt"
        },
        {
            "content": "unja historia interesante, John se gano una buena actuación, un misterio intrigante, y sobre todo emocionante.",
            "review_date": "2021-02-01",
            "source": "rt"
        },
        {
            "content": "This was no Con Air from West, but more indicative of the average type of action/suspense/thriller that I grew up on in the early to mid 90s. 5.5/10",
            "review_date": "2020-12-06",
            "source": "rt"
        },
        {
            "content": "Great acting from Travolta, great plot. Who done it? Lots of turns and twist will keep you guessing. Great movie all around. Has some difficult scenes to watch, so use discretion wisely.",
            "review_date": "2020-07-09",
            "source": "rt"
        },
        {
            "content": "The most interesting character dies at the beginning and most of the performances are weak.",
            "review_date": "2020-07-04",
            "source": "rt"
        },
        {
            "content": "Ridiculous plot and so full of errors that it was distracting. The director should have hired a technical advisor that actually knew something about the Army",
            "review_date": "2020-05-03",
            "source": "rt"
        },
        {
            "content": "I absolutely hated this movie. Although Travolta and the other primary characters did a fine job acting, the plot was awful and just an industrial size vat full of man and military bashing. It seemed to me to be agenda driven to indoctrinate that all service men are knuckle dragging troglodytes and all women are either weak or become twisted because of the patriarchal oppression. Were they doing a movie on the UN troops who routinely rape the people they are meant to protect, then the documentation is there to back it up. The US military and our culture stand alone in the world as a beacon of fairness, so, this movie for me was a huge waste of time because of the yawn inducing formulaic bias. It was so awful it was like mixing worms in brownie mix. Yeah, that's how much I disliked this movie.",
            "review_date": "2020-01-31",
            "source": "rt"
        },
        {
            "content": "I want to see those rapists get convicted..anyway it was a great story about father's bettayal",
            "review_date": "2019-11-03",
            "source": "rt"
        },
        {
            "content": "Somewhat mixed movie set in the humid claustrophobia of an Army base in Georgia. Travolta, in one of his more human roles, plays Paul Brenner a United States Army Criminal Investigation Command investigator who is on the base undercover brokering an illegal arms deal when his investigation takes a dead end (pun intended) and then takes are far more disturbing left field when the naked and suspected raped body of  Elisabeth Campbell, the daughter of the bases General, is found within an urban training ground strung out with ropes. Brenner, assisted with ex-flame Sarah Sunhill follow the clues in an increasingly disturbing trail of cover-ups and lies. James Woods as Colonel Moore privides a strong foil for Travolta and only Oscar winner Timothy Hutton appears to be dialing in the performance. Greg Hale Jones and Carter Burwell's soundtrack is of particular note. Sure, it strays a little, can be over sentimental and isn't quite as fantastic as other movies of it's ilk. But it's far, far from the currenty 22% score. There are worse movies with higher ratings and maybe it's just a nostalgic thing for me. But I've always enjoyed this movie. \n\"What she violated a code? She cheated? She lied? What?\"\n\"Worse.\"\n\"Rape?\"\n\"Worse.\"\n\"What's worse than rape?\"\n\"When you know that... then you'll know everything... won't you.\" ",
            "review_date": "2019-10-21",
            "source": "rt"
        },
        {
            "content": "John Travolta is Great of 1999 film",
            "review_date": "2019-07-15",
            "source": "rt"
        },
        {
            "content": "One of the more underrated movies of John Travolta, The General's Daughter is a great whodunnit which makes excellent use of its location (a military base in Louisiana) and its ensemble cast. Travolta is on fine form and charismatic as ever as the investigator who is torn between his urge to find out the truth and his loyalty to the army. Travolta and Madeleine Stowe, who is always an asset in any cast in my opinion, play well off one another and make for a nice couple of investigators. James Woods and James Cromwell shine in crucial supporting roles. Espcecially the scenes with Woods and Travolta crackle with intensity and are full of wordgames and sharp dialogue. The strong atmosphere (enhanced by a great Carter Burwell soundtrack) ,the engrossing mystery (with disturbing themes of rape, sexism, betrayal and parental negligence: themes sadly still relevant to this day), and some good performances make for a more than entertaining watch.",
            "review_date": "2018-02-28",
            "source": "rt"
        },
        {
            "content": "Story about the military police investigating the murder of a general's daughter. One of the dumbest endings in a movie I've ever seen. No way a woman ties herself up naked to the ground so her own father can come rescue her. What moron wrote this stuff?",
            "review_date": "2017-11-12",
            "source": "rt"
        },
        {
            "content": "One of Travoltas better movies",
            "review_date": "2017-11-10",
            "source": "rt"
        },
        {
            "content": "The real crime here is that this movie is based on a true story. I first heard this one in 1978. However, women have been in the American Armed Forces, and facing the rape issue since WWII and probably since Molly Pitcher. But the one I heard about in '78 was a noble soul who reasoned that if she made a big deal out of it, which \"they\" were expecting her to, \"they\" would use it as an excuse to keep women out of Military academies and positions from then on. You decide if it made any difference in the long run. Does anyone think rape doesn't still happen in the military? This movie goes AWOL, gets real weird, lands way off target in my opinion. The actual soldier woman gets less screen time than anyone else, how ironic is that? What a gyp. She sounds to me like the female version of Jesus, if she did what she did for the reason I was told she did, by a source in the know. She deserves a better salute than this. Let's hope someone approaches the subject again, but attempts to breathe some actual life into the soldier woman who took rape in stride, because that is what the military is STILL asking rape survivors to do, I hope you know.",
            "review_date": "2017-09-02",
            "source": "rt"
        },
        {
            "content": "General Devilish Deceiving Deviousness.",
            "review_date": "2017-09-01",
            "source": "rt"
        },
        {
            "content": "Excellent murder mystery with lots of twists and turns to keep you guessing. Travolta is excellent, with a great supporting cast.",
            "review_date": "2017-08-18",
            "source": "rt"
        },
        {
            "content": "John Travolta is the best thing about this movie",
            "review_date": "2017-04-16",
            "source": "rt"
        },
        {
            "content": "It's good movie to watch",
            "review_date": "2017-01-31",
            "source": "rt"
        },
        {
            "content": "7/22/2016: It was ok, but nothing extraordinary or memorable.",
            "review_date": "2016-07-22",
            "source": "rt"
        },
        {
            "content": "misuse of the novel....i personally think John Travolta is not perfect for the role....but it watchable",
            "review_date": "2016-01-12",
            "source": "rt"
        },
        {
            "content": "good military suspenser like 'the presidio' & others",
            "review_date": "2015-10-25",
            "source": "rt"
        },
        {
            "content": "In continuing proof that I am totally out of touch with the general viewing public, I found this to be watchable and interesting. Travolta was likeable and interesting, and the story was also interesting. My only real negatives were the over-the-top acting by Clarence Williams (remember \"Mod Squad\"?) and James Woods. And I mean WAY over the top with Clarence Williams. And my other minor problem was the way that everything was so clearly explained at the end, like they wanted to make absolutely sure we got it. Other than that, it was a good, watchable, military crime \"who dunnit\". I suppose some were a bit shocked and disturbed that the daughter had a kinky side, but as films go that was quite tame, IMO. Unlike, say \"Se7en\" with Morgan Freeman and Brad Pitt. Geez, now THAT was disturbing. Anyway, I'd call it a good, watchable movie.",
            "review_date": "2015-10-11",
            "source": "rt"
        },
        {
            "content": "Military rape & sexual harassment is a real & present danger.",
            "review_date": "2015-09-02",
            "source": "rt"
        },
        {
            "content": "Based on  true story, this story of brutality & cover-up in the military is given the Hollywood treatment. Worth seeing once.",
            "review_date": "2015-08-10",
            "source": "rt"
        },
        {
            "content": "Big try but a very small fish of a thriller which should be thrown back.",
            "review_date": "2015-05-24",
            "source": "rt"
        },
        {
            "content": "I have no idea what the critics were thinking when they rated this film. The dialogue is snappy, the investigation is swift and does not grow boring, and the ending is something one may never suspect. The filming was also excellent with very stable camerawork and aesthetic camera angles. The only complaint that I have is the horrid sound mixing. At times it was impossible to hear the dialogue over the music, making for some muddy sounding scenes.",
            "review_date": "2015-01-04",
            "source": "rt"
        },
        {
            "content": "A good thriller with what I thought was a real good performance by John Travolta.  He's kind of a hard ass but a loyal, good moraled one. He co stars with Madeline Stowe who plays a cool confident role. Together they try to solve the rape murder of the generals daughter on an army base. There are some good thrills to be had here and the plot is good but it does take silly turns at time. Overall a good mystery thriller. Nothing too exceptional but nothing bad by any means.",
            "review_date": "2014-10-15",
            "source": "rt"
        },
        {
            "content": "Now why would the Critics Not like this film? Too formulaic? I think being in the Military must have something to do with the feeling! Enjoyable to the Max for Atmosphere.",
            "review_date": "2014-08-11",
            "source": "rt"
        },
        {
            "content": "From the man who brought us Con air brings this let down of a action flick. The villains in the movie are forgettable and John Travolta was okay in this film.",
            "review_date": "2014-06-05",
            "source": "rt"
        },
        {
            "content": "Popcorn movie and something Travolta was pretty good in. Shame it suffered in other areas. You know, like the script, visuals, plot, costume, convincing acting, etc. But who cares, Travolta!",
            "review_date": "2014-04-23",
            "source": "rt"
        },
        {
            "content": "I really tried to like this movie but it was dull. Even with some fine actors this movie just didn't move me. I couldn't finish it. Nice cinematography but poor storytelling.",
            "review_date": "2014-04-01",
            "source": "rt"
        },
        {
            "content": "\"Two problems there. First the obvious: there are no good ones. Second, you're not a civilian, Colonel, you're in the army. You have no rights to an attorney. You have no right to remain silent. And if you don't cooperate I may have to put you in jail and that would make me feel really bad.\"",
            "review_date": "2014-03-20",
            "source": "rt"
        },
        {
            "content": "Very intense crime thriller. It's not what you expect until all is revealed. Good cast. Travolta beings it all to the table again.",
            "review_date": "2013-11-10",
            "source": "rt"
        },
        {
            "content": "Pretty good movie. Decent story, ok twists, fairly good performances from Travolta and other cast members.",
            "review_date": "2013-10-26",
            "source": "rt"
        },
        {
            "content": "The General's Daughter (Simon West, 1999)\n[originally posted 14Feb2000]\n\nThe General's Daughter was just as bad as everyone said it was, but Michele has a thing for Madeline Stowe and I have a thing for Jimmy Woods, so we rented it. Ugh. I've developed a theory-- it takes a great screenwriter to get a good movie out of a mediocre novel (for example, the chap who did the screenwriting for Hitch, who transformed many a bad book into an excellent film-- did Hitch do his own screenwriting?). And GD didn't have a great screenwriter, or even a good one. Travolta, however, does a spot-on Georgia accent. Oh, yeah-- and a shoo-in for most annoying soundtrack of the year and most annoying song of the year (\"Sea Lion Woman,\" which should be stewed in a fire kindled from its own sheet music).  1/2",
            "review_date": "2013-08-14",
            "source": "rt"
        },
        {
            "content": "Don't understand why Travolta was using a southern accent (then randomly dropped it), and some of the writing is pretty cringe-worthy.",
            "review_date": "2013-08-07",
            "source": "rt"
        },
        {
            "content": "So real it made me cry! Most women don't commit suicide but the scars are deep, very deep! Can't imagine if it was ones own father who stifled the truth. Most are just other  narcissistic self- serving a--holes!!!",
            "review_date": "2013-06-05",
            "source": "rt"
        },
        {
            "content": "great story. love military issues, but i was expecting anything but this. good job!",
            "review_date": "2013-03-09",
            "source": "rt"
        },
        {
            "content": "Much more could have been done with this. 2.5 stars, not quite good enough to recommend worth watching.",
            "review_date": "2013-02-11",
            "source": "rt"
        },
        {
            "content": "The General's Daughter Starts Very Promising & Quickly Propels Into The Average Thriller. Basically An Average Detective Thriller, This Time Based Round The Millitary, Which Gives It A Refreshing Change, Which I Think It's One Of The Reasons I Extremely Enjoyed This Film, That & The Fact That Travolta Gives A Pleasingly Intense Performance As Head Investigator In A Murder Case Involving A Highly Respected General's Daughter.",
            "review_date": "2013-02-11",
            "source": "rt"
        },
        {
            "content": "Well, it was an average thriller. Even though, the movie falls under suspense thriller, but there was not much suspense in the movie. John Travolta was good in his role and a decent casting.",
            "review_date": "2013-01-21",
            "source": "rt"
        },
        {
            "content": "Not godawful, but pretty bland overall. That'snot to say it wasn't entertaining, but I had to finish it over multiple sittings. Dialogue gets annoying, the violence is at times needlessly graphic, and the only resson I just kept watching was due to Mr. Travolta's redeeming presence.",
            "review_date": "2013-01-05",
            "source": "rt"
        },
        {
            "content": "Decent action flick with Travolta being, well... Travola. The topic was thankfully dark enough to make it an interesting ride. James Cromwell was the best part of the movie.",
            "review_date": "2012-12-25",
            "source": "rt"
        }
    ]
}