{
    "rating": 9.5,
    "release_date": "1987-02-06",
    "num_reviews": 170,
    "genres": [
        "Belarusian"
    ],
    "summary": "The invasion of a village in Byelorussia by German forces sends young Florya (Aleksey Kravchenko) into the forest to join the weary Resistance fighters, against his family's wishes. There he meets a girl, Glasha (Olga Mironova), who accompanies him back to his village. On returning home, Florya finds his family and fellow peasants massacred. His continued survival amidst the brutal debris of war becomes increasingly nightmarish, a battle between despair and hope.",
    "reviews": [
        {
            "content": "Hard to watch. All Nazis should have been exterminated at the end of the war like the vermin they are.",
            "review_date": "2023-04-25",
            "source": "rt"
        },
        {
            "content": "For casual viewers this movie can be too much due to its slow pace and violence, Come and See is so gutwrenching and so brutal but very effective in its message that influenced many directors that tried to replicate the same formula.",
            "review_date": "2023-04-02",
            "source": "rt"
        },
        {
            "content": "This is a hard film to review as it means and says so much about who we are as people and our ability to kill and be cruel. However on reflection I think Tarkovsky has done this material more justice over longer periods of cinematic time. The cinematic poetry is peeking through but ultimately the film is weighed down by its need to shock because the responsibility is so great for the director. The face of the boy is harrowing as he grows old within the days depicted and I heard all the munitions were real which helped the actors emote. I hear the director hired a hypnotist for the lead due to the distressing material to help him forget if required. Its an 80's film though and feels removed from the immediate pain of the time when the story was set, it has a modern sensibility only gained by watching all those great films that came after the war when cinema was explored more as a historical vista, a waking dream or a shared catharsis or poetic tome. \nThis film is less artful, it shows what happened but not enough to fully shock or to fully answer the question its trying to elude to - should Hitler have been destroyed as a child - and would you have done this?\nUltimately its an open wound for the people about whom this film is made (Byelorussia) it is a powerful touchpoint but its craft falls short of saying something bigger than the sum of its parts for me.",
            "review_date": "2023-03-28",
            "source": "rt"
        },
        {
            "content": "Brutal, personal, and haunting, Come and See gives a disturbing look into the very worst of humanity. The movie uses a lot of handheld camera shots as well as closeup character-centered shots. This way the situation becomes intimately familiar to the audience which then makes it more effective when everything becomes increasingly worse. The message is clear: war is terrible. This is conveyed in a historical setting that is particularly well-suited to get the message across.",
            "review_date": "2023-03-03",
            "source": "rt"
        },
        {
            "content": "Elem Klimov's Come and See is a film about war unlike any other in its genre.  Set during WW2, Belarusian teenager Flyora (Alexei Kravchenko) is recruited to join the Soviet resistance in an effort to thwart the advance of the German army.  As he travels the countryside with his seemingly ill-equipped detachment, he witnesses events that will forever change his life.  Kravchenko is outstanding in his role and the cinematography is remarkable, especially the lengthy takes using the Steadicam.  While there are many powerful scenes and images throughout the film, the final 45-minutes may be the most gut-wrenching piece of filmmaking ever to fill a screen, a non-stop baggage of horror and degradation that will leave a lasting image in the mind of even the most calloused viewer.",
            "review_date": "2023-03-01",
            "source": "rt"
        },
        {
            "content": "Film anti guerre par excellence. \nCe film soviétique réalisé par Elem Klimov explore un pan peu connu de la seconde guerre mondiale : l'invasion allemande en Biélorussie. Dans ce film, on suit l'histoire d'un enfant (incarné par Aleksei Kravchenko, dont le jeu d'acteur est formidable et qui se remarque par ses expressions faciales) qui se verra transformé (au sens figuré comme au sens propre du terme) par les atrocités de la guerre dont il est témoin. \nOn retrouve également un grand réalisme dans le film, notamment par le peu (voire pas ?) d'effets spéciaux, et l'utilisation de vraies balles et obus lors du tournage, ce qui permet de rajouter une couche véritablement horrifique au film. \nA voir absolument.",
            "review_date": "2023-02-02",
            "source": "rt"
        },
        {
            "content": "The invasion of a village in Byelorussia by German forces sends young Florya into the forest to join the weary Resistance fighters, against his family's wishes. His continued survival amidst the brutal debris of war becomes increasingly nightmarish, a battle between despair and hope.\n\nCome and See is a movie that has been praised a lot and for good reasons. The movie shows the brutality of war and this time of the view of the Russians. The movie is definitely a hard one to watch and not one I see myself revisting in a short amount of time, however there is no denying that this is an important movie. The movie really shows the pain and loses that people had to deal with in the war: children, property, women and animals. I was actually kind of shocked by that scene with the cow dying and finding out, that they actually shot the cow with real bullets. I can't imagine what a hard role this is to play, emotionally and as well physically. While I couldnt connect with every emotion in the movie and relation the main characters had, this is a movie that has had a big impact on me and one that everyone has to watch at least once in their lifetime!",
            "review_date": "2023-01-31",
            "source": "rt"
        },
        {
            "content": "Truly the perfect war film. It leaves you with a despair that no other war film has left me with. The acting is superb, the directing is heartfelt and it is beautiful cinematography-wise. \n\nAn important story that was told by someone close to the events depicted.",
            "review_date": "2023-01-27",
            "source": "rt"
        },
        {
            "content": "Epic WWII movie showing the horrors of Nazism, which not only still exists in our world today, but incredibly is even growing in some places. We must not forget, ever.",
            "review_date": "2022-12-12",
            "source": "rt"
        },
        {
            "content": "Were the nazis ever better depicted? Shocking.",
            "review_date": "2022-12-07",
            "source": "rt"
        },
        {
            "content": "Strong, but somehow expectations were higher.",
            "review_date": "2022-12-01",
            "source": "rt"
        },
        {
            "content": "Loved it. I was blown away with the story, cinematography and performances in this movies. It is one of the finest and most brutal anti-war movies that I have ever seen.",
            "review_date": "2022-11-14",
            "source": "rt"
        },
        {
            "content": "I would put this film in my all time top ten. Unbelievably powerful due to the flawless film making – great sound, directing, cinematography, editing and acting... it's hard to fault. Maybe the best war film that's been made.",
            "review_date": "2022-09-05",
            "source": "rt"
        },
        {
            "content": "A visceral movie with interesting first-person shots; should be done more often.",
            "review_date": "2022-08-08",
            "source": "rt"
        },
        {
            "content": "7/22/22 I'm giving this rating for the good acting. The movie itself didn't do much for me. Maybe I don't get it. Everybody said this was the most realistic depiction of war and that it would leave the viewer uncomfortable. Yeah, the beginning of Saving Private Ryan and the battle scene from Hacksaw Ridge made me way uncomfortable than anything this movie did. In terms of witnessing war crimes in a movie that make you sick to your stomach, Schindler's List and The Pianist did a better job of that than this movie did as well. The first 2/3 of the movie are kind of a waste of time",
            "review_date": "2022-07-22",
            "source": "rt"
        },
        {
            "content": "The tale of the loss of innocence in a burning world. Powerful and PTSD inducing, it allows for a harrowing experience of the horrors of war, but the surrealism and pace are difficult to follow. An interesting film that explores little known crimes that happened in Belarus.",
            "review_date": "2022-06-20",
            "source": "rt"
        },
        {
            "content": "A visceral, devastating film",
            "review_date": "2022-06-05",
            "source": "rt"
        },
        {
            "content": "Warning: Spoilers\nIf any movie can induce PTSD or reduce one's expected lifespan simply by viewing it, this is that film. I am not usually in favor of restricting movie viewership, but this is one film that I cannot rightfully recommend to any person under the age of 18. If I had watched this film when I was 12, I would have either created some sort of psychological barrier and have been unable to fully comprehend the events taking place, or I would have been emotionally damaged for life. Possibly both. After viewing \"Come and See\", I am a changed man. Though it contains no graphic sex, outright gore, or extensive vulgarity, \"Come and See\" is so powerful it's haunted me long after it ended. I've seen many horror movies (and even more war movies throughout my life, but no film I've ever seen even holds a candle to \"Come and See\" in terms of psychological trauma. I've heard stories about the horrors of the holocaust and of WWII, my grandfather was even in a concentration camp in Poland during the war- at the tender age of 14, about the same age as the main character in the film. I've read \"Night\" by Elie Wiesel, and I have seen \"Schindler's List,\" and though I felt great sorrow for the pain of those who lived through such terrible ordeals, at the end of the day all of the stories I'd heard resonated with me as just that; stories (very real stories, but stories nonetheless). This was not the case with \"Come and See.\" Klimov's brilliant directing style is somehow capable of pulling you in and making you feel absolutely helpless against the surrounding evils. Not just sorrow and remorse for the characters, but complete empathy for their pain in a way that is indescribable. \"Schindler's List\" might be hard to get through at times, but you still remain fully cognizant of the screen separating you from the death and suffering you see. \"Come and See\" destroys that protective mechanism. As an audience member, you have no feelings of \"seeing\" the film through a lens, but you \"experience\" it like you might experience the effects of a hallucinogenic substance that latches onto your brain and changes the very chemicals that determine the way you view the world- in a way I would imagine that is similar to an LSD trip gone horribly wrong. I now have even greater compassion for my grandfather's ordeals, and cannot imagine what I would have done were I in the same position as he. The film raises serious questions about whether or not it is truly \"better\" to survive a massacre than die in it. Even if you walk out of this film, it's too late. Closing your eyes, covering your ears; all attempts at ignorance are pointless -because \"Come and See\" goes past your vision and hearing- it penetrates your very consciousness. If you've seen enough to want to turn off the film, it's already too late and you've already felt the film's power. By the end of it, there is no way you'll ever look at war the same way again, and you'll likely remember this film and its lessons for years to come. Every single person considering joining the military, and every single person capable of voting should watch this film, because I guarantee it will cause you to deeply reconsider the choices that could easily send thousands of men into similar situations you see unfolding in \"Come and See.\" Though I am always in favor of watching all great movies at least twice, and though \"Come and See\" is nothing less than great (if not spectacular), it is one film I dread watching a second time. Be sure to have a pack of cigarettes, black coffee, and/or a stiff drink ready in hand before viewing this film.",
            "review_date": "2022-05-30",
            "source": "rt"
        },
        {
            "content": "WOW!!!  Imagine the hatred that exists in Eastern Europe between the different nationalities.  THe events of this movie happened within on average lifetime and watching it today made me think about the hatred that exists in Belarus and Ukraine and Russia today and is actively fermenting WWIII",
            "review_date": "2022-05-02",
            "source": "rt"
        },
        {
            "content": "Hands down the best WW2 movie ever made. Absolutely incredible in all aspects. It truly makes you live their experience as is you were there. It truly is horrific and brilliant. The acting is superb and especially so by the main character but also by everyone in it. A must see. Also a reminder to not let this type of evil creep it's way into the world again. As Orwell said \"don't let it happen.\"",
            "review_date": "2022-02-05",
            "source": "rt"
        },
        {
            "content": "What can I say or feel about this movie that so many others have already said or felt after watching this movie? It is a slow film but in the best of ways. My girlfriend often does not enjoy these type of films but even she was unable to stop watching and loved it just as much as I did. I watch it again and I feel it's something we all should watch at least once in our lives.",
            "review_date": "2022-01-27",
            "source": "rt"
        },
        {
            "content": "This may be the most powerful war/anti-war movie I have ever seen.  I will never be able to put it out of my mind.",
            "review_date": "2022-01-18",
            "source": "rt"
        },
        {
            "content": "Come and See is one of the most profoundly moving films I have ever watched. It is also the single most disturbing movie I have ever seen. Do not take watching this movie lightly- it depicts the horror of genocide, war, and human evil in a way that was so unflinching it made me feel sick to my stomach. I will never watch it again, but it was absolutely brilliant in conveying its anti-war message. For a movie with no professional actors- this had some of the greatest acting I have ever seen. The actor who plays the main character was absolutely phenomenal. Watching this movie might be the strongest inoculation against warmongering outside of actually being in a war.",
            "review_date": "2022-01-12",
            "source": "rt"
        },
        {
            "content": "The war film to end all war films! An unflinching look at the brutal-reality of war and the deep-seeded scars it leaves behind.  There is no happy ending with war. And this director knows it!\n\nEmir Kilmov pastes his own childhood experiences of World War 2 onto celluloid in nightmarish fashion. There is only death, pain and suffering in this version of events. Absolute trauma! And this film shows it all through the eyes of a child. Honestly. Truthfully. Without the sugar coating or propaganda of American War movies. And it hits home like a grenade to the face. \n\nYes 'Saving Private Ryan' has some of of the most immersive and incredible action sequences in War movie history but... it's laced with Spielberg sentimentality and dripping with American patriotism, which dilutes the Horror. \n\n'Come and See' strips away any sort of softening, delivering, in my opinion, the greatest and most honest war movie of all time. \n\nThis was Emir Klimov's final film and I guess with good reason. I hope he finally lay the ghosts of his past to rest.",
            "review_date": "2022-01-06",
            "source": "rt"
        },
        {
            "content": "An amazing film that made me actually feel sick after watching. This one will stay in your head long after viewing.",
            "review_date": "2021-11-17",
            "source": "rt"
        },
        {
            "content": "Hollywood could not.",
            "review_date": "2021-11-15",
            "source": "rt"
        },
        {
            "content": "I haven't written a review for a while but after seeing this film I just had to talk about it. This film is by far the most haunting depiction of war and it's affects I have ever seen. Through and through this is a mature and brutal look at the reality of war in a way that I have never seen done before. The Director Elim Klimov masterfully gives the audience a look at what war truly is, not a spectacle, not a grand adventure to be sought after or enjoyed, it's Hell and in it there is no joy to be found or peace to be had. The cast is amazing and every performance feels like you are watching a real person of that time being filmed, you feel just as a part of it all as they are. I implore you, if you have not seen this film, you must, for it is truly a reminder of what we should never forget and never let happen again. I give Come and See a 10/10.",
            "review_date": "2021-10-26",
            "source": "rt"
        },
        {
            "content": "The acting is phenomenal. The camera work is legendary. The setting is mind blowing. The script is flawless. The action sequences are among the most competent ever filmed. There are scenes in this film that stay with you for life. It's the most important film ever made from a spiritual and emotional standpoint. There are no films above it. There are no ways to improve it. There are no words to describe the experience of watching it There are only scars and tears on a young boys face.",
            "review_date": "2021-10-24",
            "source": "rt"
        },
        {
            "content": "A masterpiece. Journey into despair, madness, evilnesss and atrocity of war. Inmersive and suffocating. Its charachters are none alive or dead, they remain in between, in a limbo in which the viewer sees himself dragged to, it is also a call to mercy and humanity.",
            "review_date": "2021-10-22",
            "source": "rt"
        },
        {
            "content": "After watching it i was sitting 10 minutes on the couch thinking about what i watched. I had chills all the time. Not talking about cinematography would be a crime. It's truly extravagant. The really last part just shocked me to the point i would have my eyes opened so wide they started itching. I recognized one \"error\" where the sky changes as the scene was shot in two different moments. I really dont think everyone should watch it simply because it has very strong violence, and impact on the viewer.",
            "review_date": "2021-09-02",
            "source": "rt"
        },
        {
            "content": "Only the level of visual poetry and a slow narrative are the only drag on the most visceral film of its time. 7/10",
            "review_date": "2021-08-25",
            "source": "rt"
        },
        {
            "content": "An unrelenting, harrowing, surrealistic journey from a giddy, naive, idealistic view of war into the seventh circle of hell. The title derives from the Book of Revelations when the fourth seal is opened and John hears the voice of the fourth beast say, \"Come and see. And I looked, and behold a pale horse; and his name that sat on him was Death, and Hell followed with him.\" This 1985 anti-war film directed by Elem Klimov opens with two boys playing at war, but in a terrifyingly surreal manner, heightened by the younger boy emitting grotesque, chilling words that sound more beastlike than human. A hyper-realistic quality inhabits the entire film, made more horrifying by sound design which sounds as if we are experiencing everything through 14 yr old Flyora's eyes AND ears...there are sounds that occur throughout...both identifiable and all too realistic, but just as often not identifiable but sounding alive/organic or like life slipping away. Aleksei Kravchenko* who plays Flyora has an incredibly expressive face ...and closeups force us to feel what he's feeling. The entire film was mesmerizingly painful. I'm going to have to go read up on the cinematographer and sound design to try to understand how that contributed mightily to feeling submerged into, suffused with and overwhelmed by Flyora's experience. \n*In reading through Critereon's \"ComeAndSee_press-notes_r1_original.pdf\", I just learned that Kravchenko \"had never appeared in a film before\"...astonishing given his masterful performance in this film.",
            "review_date": "2021-08-25",
            "source": "rt"
        },
        {
            "content": "Let's talk about it.  So this is about a young Belarusian boy named Flyora (Aleksei Kravchenko) during WWII.  He wants to join the war and fight Nazis.  He may have found his ticket to enlist when he finds a rifle buried in the sand.  Well, let's just say that circumstances are going to change his outlook with the quickness.  Now I saw this movie once a long time ago.  It was well over a decade ago when I watched this last, so the specific details are hazy and blurry.  I remembered a scarring scene involving a cow and being deeply affected by the film as a whole, but that was about it.  I think I'm going to pay more attention to the Letterboxd list of Top 250 Narrative Feature Films since there are some holes that need to be filled on this blog, and this film currently sits at number two on that list behind Parasite.  I'm now one of those rare people who have seen Come and See more than once.  Yes, I am saying that one time is usually more than enough for most.  If you've managed to live your life blissfully unaware of this movie's existence, there are a couple of things that you need to know.  For starters, this is one of the greatest war/anti-war movies ever made, if not the greatest.  It's inarguably up there, and it deserves your respect.  With that said, it comes with a content advisory.  I know many people out there have a button for animal cruelty, and this does feature a real death of an animal onscreen.  You will likely get a sense of realism and authenticity as you watch this, but that should come as no surprise if you read about this production.  They used live ammunition when making this movie, which is insane by any standards.  Not surprisingly, the main kid they got for this, Aleksei Kravchenko, was highly traumatized.  They tried to use hypnosis so as to not damage his young psyche since he was just a child at the time, but it was ineffective, so they just plowed ahead with making the movie anyway.  It's disturbing content to be sure, but it gets amplified by the fact that these kids are so young.  These are horrors of war that are being witnessed, and it is a lot to process.  Come and See has gained its notoriety for a reason.  The sound design is visceral and disorienting, and it gets permanently altered for the audience once the protagonist suffers hearing loss after an explosion.  The whole film has this dream-like quality; you feel like you may snap out of it at any moment, but that wake-up call never comes.  I remembered the cow from my first watch years back, but I completely blacked out my memory of the church scene as some sort of brain-defense mechanism; it's absolutely horrifying and is almost guaranteed to make you feel sick.  You should watch this at least one time in your life.",
            "review_date": "2021-08-20",
            "source": "rt"
        },
        {
            "content": "The most effective anti-war film to be made. Horror themes and grotesque imagery are exactly what makes this movie so real and terrifying. Come and see is a mandatory watch to remind us of the horrors of war, and the sacrifices made by the many, at the demand of the few.",
            "review_date": "2021-07-31",
            "source": "rt"
        },
        {
            "content": "One of the greatest and most disturbing war films ever made",
            "review_date": "2021-07-28",
            "source": "rt"
        },
        {
            "content": "It may seem strange, with a film as brutal and bleak as this, to highlight its beauty. It's not beautiful in the Hollywood sense. The characters are destitute and careworn, the landscape - fields and forests in 1940s Belarus - is pockmarked with puddles, the simple narrative - a young boy joins the Belarus resistance and witnesses the cruelty of the invading Gestapo at first hand - is grim and unrelenting. And yet the overriding quality is one of unsentimental and angry beauty, as the characters hold us in their gaze and the flames roar.",
            "review_date": "2021-07-27",
            "source": "rt"
        },
        {
            "content": "This is perhaps the most harrowing film I've watched.  It could be described as a journey into hell, which is drawn on the face of the protagonist; a young boy who finds a gun so he can join the resistance.  This mythological sense is transformed into lasting images to the director and cinematographer's credit.  At times, there is a beauty in it, only to be subsumed by a darkness unimaginable.  It's difficult to sit through, but worth the discomfort because this wasn't myth or soft power propaganda, it was real.",
            "review_date": "2021-07-23",
            "source": "rt"
        },
        {
            "content": "One of the most horrific and important movies ever made.",
            "review_date": "2021-06-20",
            "source": "rt"
        },
        {
            "content": "One of the heaviest films I have ever watched hands down. Perfectly depicts the horrors of WWII and the rollercoaster of emotions it left. This film is captivating, mesmerizing and horrific all in one.",
            "review_date": "2021-05-18",
            "source": "rt"
        },
        {
            "content": "A heartbreaking film that shows us uncensored the horrible consequences of war and hatred. Perfectly filmed. Its cinematography is beautiful and all the actors and actresses do their jobs perfectly.",
            "review_date": "2021-03-29",
            "source": "rt"
        },
        {
            "content": "This film hints both at what humans are capable of and what we can endure. It's big, in a real way, with mass extras and practical effects. The Nazis act like they're on a pub crawl from town to town wreaking havoc and creating entertainment. In reality these events deeply disturbed a lot of the German soldiers, hence inventing the gas chambers. Very well made and the use of constant portrait close-ups harness the raw emotions.",
            "review_date": "2021-03-19",
            "source": "rt"
        },
        {
            "content": "It was hard to believe that Come and See could live up to its brutal and highly esteemed reputation, but it is a devastating film that will be more than likely to leave you stunned upon first viewing. Klimov and Adamovich pull no punches, depicting war as cruel and terrible and refusing to moderate with even a touch of traditional romanticism; the closest they come is providing a sense of revenge that is clear only drives its young protagonist into a darker place. The barbarism can't be undone and considering that it could be is onyl wishful thinking, a sense of futile escapism in a bleak hellscape. Life in the Eastern Front under a foreign occupation focused on ethnic cleansing has little value and can melt away in an instant due to completely unforeseen circumstances. There's pure evil at play here, and it can turn your stomach. Kravchenko's naive, stunned Flyora is subjected to unspeakable tragedy and must undergo a radical transformation just to comprehend the implications of events around him, brought to screen through distinct shot framing (face shots chronicling wordless character development). The production value is top-notch and the atmosphere is immersive (the latter of which is for better or worse). One of the relatively few films that you actually must see before you die. (5/5)",
            "review_date": "2021-02-27",
            "source": "rt"
        },
        {
            "content": "One of the best war movies ever made and also one of the best horror movies ever made.  So horrific you won't want to watch it again.  Based on true stories of the massacre of Russian civilians in Belarus written by a survivor and directed by a survivor of Stalingrad.",
            "review_date": "2021-01-28",
            "source": "rt"
        },
        {
            "content": "I came, I saw and I can't go back.",
            "review_date": "2021-01-12",
            "source": "rt"
        },
        {
            "content": "An unsparing depiction of inhumanity. More than any war film of its kind, \"Come and See\" stands as a memorial to moral catastrophe, wrought not in stone or marble but w/ all the resources of the cinema. A nightmare to haunt all others.",
            "review_date": "2020-12-30",
            "source": "rt"
        },
        {
            "content": "At the beginning it seemed like it had been filmed in 1943.  But by the end it was hard to believe it's from 1985.  What a devastating experience, watching that.  As I read somewhere: no, not a date movie.",
            "review_date": "2020-12-28",
            "source": "rt"
        },
        {
            "content": "Gut wrenching WWII film that depicts the true horrors of war. Well filmed and well acted. It's one of the best WWII films that rarely gets talked about.",
            "review_date": "2020-12-20",
            "source": "rt"
        },
        {
            "content": "While I personally do not find Idi i smotri (Come and See) as amazing as most do, it is still an undeniably powerful anti-war movie that is unexpectedly brutal and heartbreaking in its atrocious tragedies. It felt repetitive tonally and plotwise at times, but it has its fair share of impressive imagery and iconic scenes while the direction, acting and cinematography are uniformly accomplished.",
            "review_date": "2020-11-17",
            "source": "rt"
        },
        {
            "content": "Come and See is a gritty and rough war movie with heavy flaws.\nThe main attraction is the last third of the movie, when our main character actually get's to experience the war(crimes) first hand.\n\nAnything before that is either boring, predictable or unrealistic, with even for it's time quite bad cinematography that feels more like a spontaneous student movie being shot run-and-gun than a real movie with thought put into things like camera movement, choreography or placements. \n\nWhile some of the scenes in the first two thirds of the movie are memorable, \nI can recommend just skipping to the end.\n\nWhen it comes to the viewing experience, these are subtitles from hell.\nWhile original audio is generally to be preferred, the subtitles in this movie often show long sentences between eight and fourteen words for less than one second or roughly one seconds. \n\nYou will constantly pause and rewind to make up for their bad implementation.\nThis is another reason to skip right through the beginning and to around when the main character returns to his home village - there will be more action and less talking from here on out, making the horrible subtitles less of a problem.\n\nDespite all those flaws, I think it's a movie that every war movie fan should see at least once.\nJust don't feel guilty for skipping the first hour, you won't miss any high art, deep thoughts or good cinematography.",
            "review_date": "2020-11-10",
            "source": "rt"
        },
        {
            "content": "I have only experienced such strong emotions after watching a WWII movie only after \"Schindler's list\". This film just shows war how it is : a battle for survival, an ultimate grief. \"Come and see\" is the closest to how war have looked like, whereas nearly all the other ww2 movies just show how it could have been. The actor's portrayals are really realistic, there wasn't a second when I thought it was a movie, I have seen it as a real documentary. It shows nazi soldiers just how they really were — murderers, as well as I think the scene where they are about to be killed being an absolute masterpiece, as people there are like in a court, where they are being punished for the atrocities they made. It shows that these people were only responsible for what they did and felt like that only when they were on a death trigger. The village scene, when Glasha and the main hero are witnessing what has happened show how deeply it affects the character. It is not just tears, it's an absolute blast of emotions, which leads you into deep thoughts. About 30 million soviet people were killed by nazi soldiers, so how could they be excused? And those are just soviet people. This movie just shows what the meaning of human life really is, as it takes the viewer on a journey of a boy, who thinks that war is alright and it drains him throughout the entire movie to really understand all the horrors of it. The music in this movie is stunning, perfectly giving the emotions, as well as sound effects, for example the one of a bomb exploding nearby and the character's hear loss. It shows greatly how people were affected by the war, all the tears are real, the depression and the struggle are real. People have BURNED kids alive and laughed at it, what could be an excuse for that? — that is the main dilemma of the movie. This is a true masterpiece and a must watch for everybody. A real history book. There is a documentary on the same topic called \"Regular Fascism\", which I thought was shocking, but after I have seen this there is probably nothing else as good. I would even say that's the best movie I have ever watched, as I was hooked to my seat for the rest of the film. A true cinema magical masterpiece and an ode to those, who died in the great war. 10/10 without any discussion, must see for everybody",
            "review_date": "2020-11-01",
            "source": "rt"
        },
        {
            "content": "absolute absurd war drunken stupor. Do you want to stop war? put this one in schools",
            "review_date": "2020-10-05",
            "source": "rt"
        },
        {
            "content": "Watching this movie is very depressive. But shown the effects of war during its time.",
            "review_date": "2020-09-14",
            "source": "rt"
        },
        {
            "content": "Yeah this is pretty brutal. Cost me a small fortune to buy a copy of this classic Russian war film. It is a pretty unremitting and unapologetically grim film about the Nazi blitz of Belarus. There's a few messages in there but mainly it's that war is bleak and dreadful. Some slow scenes but also some powerful scenes, particularly the barn. Ooof I need to watch something uplifting after that. Come and see if you're in the mood for something apocalyptic. If not, try to avoid, which won't be hard to do as it's nigh on impossible to find a copy of this film.",
            "review_date": "2020-08-28",
            "source": "rt"
        },
        {
            "content": "Come and See feels like a horror movie but without any zombies, vampires or wolves. Instead, the movie used horrific elements during a forgotten historical event during the Second World War. I love the direction, the performance, the script and the emotional tone. I love how this movie managed to show the horror of the Nazis with the perspective of the civilians. Overall, Come and See is a fine hidden jewel for any WWII movie goer.",
            "review_date": "2020-08-06",
            "source": "rt"
        },
        {
            "content": "Come and See is a truly disturbing and horrifying film that perfectly captures the true nature of war. Few other movies have ever captured the horrors of war so effectively and realistically disturbingly.",
            "review_date": "2020-08-01",
            "source": "rt"
        },
        {
            "content": "Well acted and amazingly directed, a movie using the strangest, most horrifying tale to deliver his Peacful, much important massege.",
            "review_date": "2020-07-12",
            "source": "rt"
        },
        {
            "content": "One of the best war movies I have ever seen and the only one I have seen to portray, in what must be an accurate depiction, of what it must have been like to be a civilian boy swept up into the chaos and murderous brutality of war. An indictment of the Nazis and WWII Germany. Belorussian civilians are viewed realistically and sympathetically.   I have watched this movie twice and just got the video from Netflix to watch it a third time.",
            "review_date": "2020-07-03",
            "source": "rt"
        },
        {
            "content": "Harrowing and brilliant, but annoyingly slow.\n\nElem Klimov's Come and See (1985) is a timeless anti-war picture that depicts Nazi Germany's war crimes in Russia in the most horrifyingly real way. It's honestly a hard watch, not just because of the mass murder and devastating implications, but because the pacing is dreadfully slow for the first 45 minutes before all the war footage. It's a grim perspective on the horrors of war shown in a sincere fashion and arthouse style. I cannot even really describe it further. If you can handle a slow burn, Come and See evolves into a visual masterpiece in portraying misery and death. Watch at your own risk.",
            "review_date": "2020-06-28",
            "source": "rt"
        },
        {
            "content": "Awesome war movie. It's deep, hardcore. The sound effects will disturb you in accordance to what they go trough. It does not focus on the primary aspects of war as in other movies. Rather than that, it shows how and why the populations suffers because of war.",
            "review_date": "2020-06-04",
            "source": "rt"
        },
        {
            "content": "After an invasion of a small village by German forces a young boy tries to join the resistance, but after returning home, he find's his family massacred & his continued survival becomes increasingly nightmarish & full of despair.",
            "review_date": "2020-05-26",
            "source": "rt"
        },
        {
            "content": "ALL CACOPHONOUS ON THE EASTERN FRONT - My Review of COME AND SEE (5 Stars)\n\n\nWe all have gaps in our moviegoing experiences.  I've never seen It Happened One Night and only very recently did I watch It's A Wonderful Life.  In February, Janus Films released a 2K restoration of Come And See, a Soviet-era film from 1985 which depicts the horrors of World War II from a child's perspective, but the onset of the global pandemic overshadowed it somewhat.  In my self-isolation, I sought it out what has been called \"one of the greatest war films ever made\" and, after viewing it, felt compelled to write about this unforgettable masterpiece.    \n\nSet in 1943 Nazi occupied Belorussia, the film follows a young man named Flyora (Aleksey Kravchenko, a non-actor at the time) who, upon finding a rifle amidst the rubble of a war torn village, joins up with a mostly civilian branch of the Soviet Army to fight the brutal invaders.  We experience, almost in real time, every agonizing moment our protagonist suffers through. Its Director, Elem Klimov, who never made another film after this one, and Writer, Ales Adamovich both as children lived through many of the harrowing experiences depicted here.  \n\nWhen Flyora first joins up, he leaves behind his young mother and two adorable twin sisters.  The army assigns him menial tasks and leave him behind at camp when sent off to face the Nazis on the front.  Soon Flyora meets Glasha (Olga Mironova), a young girl who's attached to one of the leaders and has also been left behind.  Their sweetly idyllic moments together end swiftly when the Nazis start bombing.  Often throughout the film, Flyora will look up to the sky and see a portentous luftwaffe in the sky, seemingly tracking his every move.  \n\nFlyora and Glasha quickly flee back to his village to check in on his family, and here is where everything changes in the blink of an eye.  With nobody home, flies buzzing around half-eaten plates of food, and a kettle still warm on the stove, Flyora guesses they have fled to a secret hiding place.  As they hurry there, Glasha looks back and sees something horrifying yet doesn't reveal it to our young hero.  This unforgettable moment sets the stage for the rest of this disorienting, nightmarish film.  \n\nAs Flyora wades through mud, dodges bullets whizzing over his head, and sees the worst in humanity, he seems to age decades before our eyes, despite the film taking place over a matter of days.  This wholly immersive experience puts the viewer right in the middle of the chaos, yet Klimov's filmmaking technique is so precise, so artful, that you never feel like you're in the hands of a \"point and shoot\" filmmaker.  Often, he has his characters stare directly into the camera, revealing their agonized souls.  The fluid use of steadicam by his Cinematographer Aleksey Rodionov feels as accomplished as anything seen in Paths of Glory and it's clear that 1917 wouldn't have existed without this film.  Roger Deakins, who won the Oscar for shooting last year's incredible World War I story, has even called Come And See one of his favorite films.  \n\nWhat truly sets this film apart, however, is its sound mix by Viktor Mors.  He fills the soundtrack with a nonstop buzz of animal and insect noises, tortured screams of villagers, military marches, and more to create a wall of sound guaranteed to please generations of David Lynch fans.  On top of this, we're treated to operatic Soviet anthems.  It took Klimov many years to get this film past the censors, who deemed it aesthetically dirty.  It wasn't until the onset of glasnost that he was basically given free rein to shoot the movie however he wanted.  Of course, a film about the Nazis from a Russian point of view still props up the regime, but the grimy, gutted look and feel of the film remained true to Klimov's original vision.  \n\nMuch like 1917, the film plays almost like a video game, with young Flyora bouncing from one challenge to the next.  Luckily the similarities end there, due to Kravchenko's fantastic performance and Klimov's dedication to bringing the truth to the screen.  While not particularly graphic, you feel every bit of Flyora's inch by inch struggle to survive.  You won't soon forget the third act set piece in which the Nazi's set about destroying an entire village and its inhabitants.  Same goes for the last few minutes, which plays with time to show us the root of all evil.  It's a feat of editing and sound to rival some of the best sequences in film and leaves you breathless.  It's following by a memorable final shot, and this film is filled with them, as we watch a massive group of soldiers marching towards an unknown destiny.  Come And See, like its title, urges you to not look away at man's inhumanity towards man.  It's by no means a pleasant time at the movies, but it's essential viewing nonetheless.",
            "review_date": "2020-05-25",
            "source": "rt"
        },
        {
            "content": "\"Come and see\" manages to make us feel sad, happy, angry and mostly disturbed by the whole story. A masterpiece that everyone should watch at least once in their life",
            "review_date": "2020-04-17",
            "source": "rt"
        },
        {
            "content": "One of the heaviest film I ever seen. A carousel of death and horror, something only war and humanity is able to create. The direction is brilliant even for our days, but very slow, so as you can imagine, not an easy film by all means.",
            "review_date": "2020-03-29",
            "source": "rt"
        },
        {
            "content": "An effectively miserable and sad journey so excellently crafted and brilliantly acted. The protagonists transformation as a character throughout the movie through expression alone is astounding. A breathtaking, dreary, nightmarish, and often times absurdist masterpiece.",
            "review_date": "2020-02-25",
            "source": "rt"
        },
        {
            "content": "Incredibly realistic",
            "review_date": "2020-02-24",
            "source": "rt"
        },
        {
            "content": "Quite possibly the greatest anti-war film of all time. Harrowing and unforgiving to the end. A must see.",
            "review_date": "2020-02-23",
            "source": "rt"
        },
        {
            "content": "Most historically accurate portrayal of the Eastern Front of WWII and the Holocaust of Generalplan Ost put to film. Horrific and haunting.",
            "review_date": "2020-01-09",
            "source": "rt"
        },
        {
            "content": "A cold, hard, real film which you cant forget. It's all real. Atrocities on both sides. The cold feeling this film has seeps into your bones and remains fir a long time after\n Another historical film of note.\n\n\"Come and see\"",
            "review_date": "2019-12-09",
            "source": "rt"
        },
        {
            "content": "A World War II must-see.",
            "review_date": "2019-11-22",
            "source": "rt"
        },
        {
            "content": "Filme pesado mas extremamente importante :|\nQue final pesado.",
            "review_date": "2019-10-21",
            "source": "rt"
        },
        {
            "content": "A disturbing view of what probably happened more than we know.",
            "review_date": "2019-10-19",
            "source": "rt"
        },
        {
            "content": "One of the best war films of all time. You want to know what the eastern front was really like? Watch a film from the cold war soviet perspective.  They lost 14% of their population to the Nazis (28 Million). This film about the Belarusian resistance is a psychological masterpiece that will (for a brief time) make you as sick to your stomach as the millions who endured the slaughter for half a decade- only to spend half a century puting the pieces back together. ",
            "review_date": "2019-10-06",
            "source": "rt"
        },
        {
            "content": "This is the bare none the best war movie I have ever seen. The fact that this movie did not even make a single entry on the \"100 BEST WAR MOVIES OF ALL TIME\" list is unforgivable. This movie gives a look at the largest conflict ever fought in history (i.e. the eastern front)  in the eyes of an indifferent 15 year old boy from Belarus. it portrays the struggle with a horror which is hypnotic and disorientation. You see this simple boy go through the living hell which engulfed the Western USSR after the summer of 1941. You see it all.\n       This is a difficult movie to find, and the only version which is any good is in Russian with English subs. Still, it is a masterpiece. It is a nightmarish tale of a boy and a culture loosing its innocence, and then developing crippling PTSD in real time. You get the sense that this movies director wanted the audience to understand just how much operation Barbarossa f**cked up the soviet people.  It will leave you shocked, nauseous, and feeling perversely traumatized. But damn is this a good movie.  \n This is soviet propaganda at its finest. Please give it the attention it deserves.",
            "review_date": "2019-04-02",
            "source": "rt"
        },
        {
            "content": "Ð­Ñ,Ð 3/4 Ð 1/2Ðµ ÑÐ¸Ð»ÑÐ 1/4, Ñ?Ñ,Ð 3/4 Ð¿Ð¸Ð·Ð´ÐµÑ. Ð§Ð¸Ñ?Ñ,Ð°Ñ? Ñ?Ð 1/4Ð 3/4ÑÐ¸Ñ? ÑÐµÐ¶Ð¸Ñ?Ñ?ÐµÑÐ°.",
            "review_date": "2019-02-10",
            "source": "rt"
        },
        {
            "content": "So incredibly real feeling, raw emotion, fear, and sorrow caught on camera.",
            "review_date": "2018-12-16",
            "source": "rt"
        },
        {
            "content": "By forcing us to follow a series of unspeakable atrocities entirely from the point of view of a naive young boy, making us see what he sees and hear what he hears, this film becomes a horrific nightmare of filtered realism that shocks us even more due to the young actor's deranged performance.",
            "review_date": "2018-06-21",
            "source": "rt"
        },
        {
            "content": "Powerful, brutal WW2 drama. \n\n1943, German-occupied Belarus.   A teenage boy, Florya, joins the partisans and expects a life of duty and adventure.  Little prepares him for the terror and brutality he will witness.\n\nPower, brutal WW2 drama.  Shows the horror of war - certainly not your average glamour-and-glory WW2 movie.  In particular, demonstrates well the atrocities the Germans, and the SS especially, inflicted on Russian civilians in WW2.\n\nNot perfect though.  Starts in haphazard style, with plot developments that sometimes don't make sense or seem random.  Some of the acting can be a bit hammy at times too.  However, from a point the movie finds its focus and from then on it is a relentless, gritty, tension-filled ride.",
            "review_date": "2018-05-20",
            "source": "rt"
        },
        {
            "content": "a WAR FILM ABOUT THE VICTIMS. UNFORGETTABLE AND WELL DIRECTED. a CHARACTER STUDY.",
            "review_date": "2018-05-18",
            "source": "rt"
        },
        {
            "content": "When the horrors of history become an apocalyptic metaphor of metaphysical evil, and when the soteriological hope consists in finding something healthy, salvable and salvific not in Hitler (who killed people already born), but in his mother (who sentenced to death people not yet existing).\n\"I must not describe the famous sequence at the end. It must unfold as a surprise for you. It pretends to roll back history. You will see how. It is unutterably depressing, because history can never undo itself, and is with us forever\" (Roger Ebert, 16 June 2010). Yet in the biblical context chosen by Klimov for his movie, always in Chapter 6 of the Apocalypse, verse 14 states: \"the sky receded as a scroll when it is rolled up\" (6:14 || Isaiah 34:4).\n(Mauro Lanari)",
            "review_date": "2018-05-13",
            "source": "rt"
        },
        {
            "content": "Most of the credit that is due for the quality of Come and See should be given to Aleksey Kravchenko. This young boy not only has to be on camera through the majority of the film, but there are countless scenes where we don’t see the what is happening and have to experience it by watching his expression. He has a lot of dramatic reactions and we are allowed to experience joy, sadness, fear, and more through him. Almost every other actor is only in a few scenes. These supporting players make up the friends and foes that our hero interacts with on his journey through war-torn Russia. The director, Elem Klimov, aims for a particular style in Come and See. There are so many shots of characters staring right down the barrel of the lens, that it’s off-putting. At times, I like how this technique forces us to see what the horrors of war are doing to this young man. However, when it’s a relatively mundane conversation, I don’t need to stare into the eyes of each character as they deliver their lines. The film also uses some symbolism that I assume is supposed to deepen the experience for those who look for a bit more meaning in film, although it flew over my head like the bomber that constantly showed up in the movie. The one thing that Come and See mastered was making war look unpleasant and even devastating for some people. The entire film is a journey from the most mundane aspects of invasion all the way to the most gruesome things you can imagine. I think I followed the flow of the story well enough, even though there wasn’t much exposition setting things up. The end got into a hyper-stylized montage that strangely put the main character in the shoes of his enemies. I didn’t think that moment worked as effectively as they wanted, and it almost muddled the message of the movie for me. Despite my complaints, I can still respect Come and See for what it is, and I might recommend it if someone wants to see a good anti-war film.",
            "review_date": "2018-04-20",
            "source": "rt"
        },
        {
            "content": "A monument.\n\nIt's difficult to process.\n\nAhead of its time, genius at every level, completely gut-wrenching and harrowing. A film to be studied, preserved, dissected, celebrated, venerated.\n\nHumanity, huh?",
            "review_date": "2018-04-09",
            "source": "rt"
        },
        {
            "content": "sticks with you, the horror, moments of beauty, cinematography, the score. Perfect.",
            "review_date": "2018-03-23",
            "source": "rt"
        },
        {
            "content": "1001 movies to see before you die.  An odd portrayal of Nazi occupancy and its transition to Russian occupancy.  It was very artsy and disturbing with its visuals and direction.",
            "review_date": "2018-02-23",
            "source": "rt"
        },
        {
            "content": "This film is truly a masterpiece that needs more attention due to it's outstanding performances, most realistic storyline and special effects and the greatest sound of any film IN THE WORLD! This film will traumatize you! Like most war film they have a barrier that make life, life and a movie, a movie. But this this has no barrier this is brutal and real! 5 STARS!!!",
            "review_date": "2018-01-31",
            "source": "rt"
        },
        {
            "content": "Pessoalmente achei muito ruim.",
            "review_date": "2018-01-07",
            "source": "rt"
        },
        {
            "content": "Best war movie ever made, but it is a bit disturbing to watch",
            "review_date": "2017-09-05",
            "source": "rt"
        },
        {
            "content": "i thought i had seen realism and nostalgia in War movies, and i thought i had seen tragedy well this masterpiece proved me wrong and to think its based in real events just gives me tears. powerful and horrifying to see but you still feel the need to go and see it",
            "review_date": "2017-07-27",
            "source": "rt"
        },
        {
            "content": "The most realistic war film I have ever seen in my life.",
            "review_date": "2017-06-11",
            "source": "rt"
        },
        {
            "content": "Without a doubt, the most powerful and emotional war film ever made, Also, the depiction in the film of the disgusting, vile Nazi mobile killing squad was so very very accurate.  I have watch the film 3 times now but on the third occasion i had become so emotionally attached to the lead actor i will not be able to stomach it again for a while. Absolutely brilliant-no other war film compares.  Everybody should watch it.  I have read a tremendous amount about the Holocaust, some books so powerful i have had to leave them for a few days before continuing.  Thank Buddha´s that the Russians managed to win at Stalingrad.  What state this insane planet would be in now had they not does not bear thinking about. Thank you to anybody who has read thIs.",
            "review_date": "2017-05-30",
            "source": "rt"
        },
        {
            "content": "One of the best foreign language films I've ever seen, I rarely give movies a rating of 4 and a half stars and above. It was Atmospheric, Incredible Acting, And Extremely realistic. Never expected it to be so good and that Ending was one of the best endings I have ever seen in a movie.",
            "review_date": "2017-05-06",
            "source": "rt"
        },
        {
            "content": "Wow, the restoration looks immaculate. All the colors pop the images are crisp. That's so twisted. These kids are digging up recently lost weapons and ammo from the war that was just fought right there on their soil. And they're doing this because they want to join the war. That deep synth bass sound is so ominous. It's getting us ready for the horrors that are about to come. This director was definitely inspired by Tarkovsky by the way he films some scenes and the overall aesthetic he uses. The sound design is similar as well, only it's much more experimental in this film. That kid has the stupidest grin on his face when the officers are in his mom's house. What a dumb, naive boy. Like he's overly excited that he's getting to fight for his country. Little does he know, he's making a big stupid mistake that's going to change his life and scar him forever. His little twin sisters are so cute. And his mom is overly dramatic. I felt so bad when they showed her crying her eyes out. I really felt that, it felt so real and something that could happen to anyone. Wow, so crazy how they'll just about recruit anyone to join their army. \n\nThe hand held camera gives it a real, almost documentary-like feel to it all as if we're there experiencing it in person. The cinematography and composition is out of this world. That scene where Flyora is on guard duty was so incredibly dark, yet was still able to capture everything. Wow, that blonde girl is quite pretty. She has similar facial features that are reminiscent of Kirsten Dunst. There's something obviously going on between her and the Commander. He's probably putting her on but at the same time doesn't care about her. Damn, Flyora had to give up his nice boots for the old man's rotting ones on the Commander's orders. That sucks. And now wtf is he doing?! He's wallowing around in a swamp instead of marching with his platoon? Has he given up already?\n\nMan, they really do a good job at keeping you feeling unsettled with all the uncomfortable close up shots of the actors faces. Especially when they're making ugly faces or giving unattractive looks at the camera. So the blonde girl, Glasha, seems to be the village whore lol. Ok that's putting it harshly. But she definitely has some issue. She seems lonely, wants company. Particularly from men. Oh shit! That bombing scene in the forrest was insane! They legit blew up the ground and trees while the camera was literally right there in front of the explosions too close for comfort. This whole movie tests ones comfort level. That was really cool how they ran his voice through a flanger effect after the bombing. That scene with the big white stork creeping up on them while inside the makeshift tent was so creepily hauntingly beautiful. And the stork continues to stalk them even when they get to Flyora's village where his mom lives. Maybe the stork is a representation of his recently deceased mom and sisters reincarnated. Just by the dark ominous tone of the music, you can tell that something bad happened to his mom and sisters. \n\nOh my god… when Glasha looks back and they show the pile of dead bodies that have been shot up against the wall. That was so shocking and horrific to look at. I literally gasped out loud. God, this movie's so haunting. And then the bog scene right after was so unsettling. It's just pure horror. You want to believe that what he's experiencing is a nightmare, but it isn't. When he gets to the survivor camp and they tell him his family was killed and the village elder told him that he warned him about digging up (literally the past) - it's extremely haunting. Pure nightmare fuel. This is where the anti-war element of the movie starts and this is where the movie begins to feel like the worst nightmare you've ever seen. Thank god he had Glasha right beside him or else he probably would've just died. My god, his face afterwards is just devoid of life, he's dead inside. \n\nOmg… when they herd everyone into the barn like sheep. That has to be one of the most horrifying scenes in the movie. The way everyone's screaming and crying for their lives. God, it's so chaotic and fucked up. Jesus, the way they portray these Nazi's in the film are unlike anything I've ever seen in a movie. They're dehumanized. To the point where killing people doesn't even affect them anymore. It's second nature to them. Just like wiping their ass after a shit. For these Germans, it's just a party to them. Where they take pleasure in torturing, abusing, killing and doing whatever they want with their Russian prisoners. I mean it literally made me sick to my stomach watching it all unfold. Seeing how they have no remorse for taking human lives. Probably the most horrific and realistic depiction of war and abuse of power that I've ever seen in film. I mean they literally pillaged and destroyed a whole village and they showed everything! Omg… the way Glasha returns to camp with her inner things all bloodied up, her face a mess and a whistle in her mouth. So fucked up. \n\nGorgeously stark and dark imagery all throughout the movie. The use of natural light is beautiful. A lot of scenes in this movie feel incredibly surreal. Parts of it feel like a fever dream or the worst nightmare you've ever had with the way they edited some scenes. I mean this movie really is one of a kind. And the sound design, my god. It's so twisted and ominous. Always playing with expectations. Come and See is basically a horror movie lol. This movie's just one big unsettling nightmare. Perhaps the most haunting, disturbing, unsettling, horrific, brutal and dehumanizing anti-war/war movie in the history of cinema. It's kind of one of those movies you never want to watch again, kind of like Requiem for a Dream. You almost don't want to believe that something as horrifying as the Holocaust happened, but it did. Like you start asking yourself, how are people capable of being so cruel? So inhuman and soulless? I mean it really was a dark and scary time in history. With all of that being said though, I think this is essential viewing. I think everyone should watch this film at least once in their lifetime. It really puts in perspective how horrifying war can be and how needless, pointless and cruel it can be.",
            "review_date": "2017-04-14",
            "source": "rt"
        },
        {
            "content": "Sound design and surrealism set it a part from other war films. Appropriately horrifying, but the revenge ending feels like propaganda.",
            "review_date": "2017-04-13",
            "source": "rt"
        },
        {
            "content": "Extremely powerful, disturbing, and will never leave my mind. This is one of the best movies I have ever seen and I never want to see it again.",
            "review_date": "2017-03-27",
            "source": "rt"
        },
        {
            "content": "A rare war film that shows the horrors and not the glory. Infuriating, stomach-churning, and artistic.",
            "review_date": "2017-01-27",
            "source": "rt"
        },
        {
            "content": "Truly tragic on so many fronts. I have friends whose parents or grandparents fought the Germans in Russia, according to them this movie is accurate. They fled to the U.S at the start of the cold war and had no love for Soviet-style movies but had seen a few this being one of them. Personally, the Germans (full disclosure I'm 60% German 40% Scandinavian) suffered far less than they would have if I'd been in charge. It's the same for the Russians in Germany rapes in the 100's of thousands or my own nation America whose soldiers were not above raping women, children. I think they all should done away with, Slowly.",
            "review_date": "2017-01-04",
            "source": "rt"
        },
        {
            "content": "Impeccably depicted.",
            "review_date": "2016-12-25",
            "source": "rt"
        },
        {
            "content": "A film you only need to watch once and will forever carry with you. Not easy to sit through but completely worth the heartbreak.",
            "review_date": "2016-12-08",
            "source": "rt"
        },
        {
            "content": "A war epic that depicts the barbarity of humanity so ghastly, the images haunt and linger like ghosts of the butchery.",
            "review_date": "2016-11-24",
            "source": "rt"
        },
        {
            "content": "Great movie. Darkest War movie I've ever seen. The acting was great, the story was great, the cinematography was great. The only problem I had was that the movie was too long. I fell asleep and had to finish the rest. But, it does wonders with its length. I do wish I watched a better dubbed version though.",
            "review_date": "2016-10-29",
            "source": "rt"
        },
        {
            "content": "One of the most realistic and deeply moving war movies I have ever seen!",
            "review_date": "2016-08-28",
            "source": "rt"
        },
        {
            "content": "a nightmare of a film, not in the sense that you will go to bed with, but in the sense of realising just how man kills man, and the atrocities that one can never forget. One of the best war films i have ever seen.",
            "review_date": "2016-07-30",
            "source": "rt"
        },
        {
            "content": "Ever wondered how Hell looks like? Just watch this hyperrealistic cinematographic masterpiece: it will describe it with just enough detail.",
            "review_date": "2016-05-14",
            "source": "rt"
        },
        {
            "content": "This is probably the most memorable war movie I've ever seen. It's scenes are so gruesome, yet, sometimes, beautiful. It has a lot of messages in it that I love, although I think the Russian partisans are glorified a little too much.",
            "review_date": "2016-05-13",
            "source": "rt"
        },
        {
            "content": "Tremendously powerful war drama. One of the finest I've seen.",
            "review_date": "2016-05-09",
            "source": "rt"
        },
        {
            "content": "Unforgettable and deeply traumatic ,Like a figurative sledgehammer to the psyche ,  the impact of this is both devastating and hauntingly beautiful , that it will leave your soul shattered into pieces but  definitely grateful for having had this singular viewing experience..10/10",
            "review_date": "2016-03-12",
            "source": "rt"
        },
        {
            "content": "If the first half of the film where as strong as the second half, this would be an easy 10/10.\n\nThe film follows Florya, a Belorussian partisan, as he travels across Belarus, fighting, surviving, and witnessing the horrors of war.\n\nLet's start with the positive. The film's imagery is brutal. We're talking \"You won't sleep for days\" levels of brutal. The highlight of the film is a scene where the Nazis force the residents of a village into one big building and set it ablaze. This scene is horrifying and uneasy in all the right ways.\n\nHowever, it's the beginning that brings the film down. In the beginning, our main character (played wonderfully by Alexei Kravchenko) finds a gun from a dead soldier, his entry token to the partisan group. There, he befriends a woman (Olga Mironova) who gets left behind by the group a long with him. The two form a bond, but this part of the film feels a little weird. It's difficult to quite place a finger on it, but these scenes feel off and a tad disjointed from where the film ultimately wants to end up.\n\nThere are a lot of close-ups in this film. All of the ones on Kravchenko work. All of the ones on Mironova make you think she's about to murder someone in the dead of night. It's unnerving and not in the way the film wants you to be unnerved. Towards the end, the film uses archive footage of deaths camps and a unique sequence showing Hitler's rise to power in reverse order as Florya shoots mercilessly at a photo of Adolf Hitler. That part is pretty great.\n\nIt's a harrowing, unflinching, and difficult movie to watch. It does get much better as it goes on, though.",
            "review_date": "2016-01-31",
            "source": "rt"
        },
        {
            "content": "It is 1943. The Nazi armies are in full retreat due to Hitler's many blunders, which have effectively sabotaged his armies ability to wage a winning campaign. The Nazi soldiers sense the war is lost and so, in their madness take exceptional glee committing genocide against the Russian people. In Belarus alone, the inhabitants of 628 villages, men, women and children, will be exterminated. These are facts.  This film shows an entire village, mostly women, children and old men, being rounded up and crammed into a large barn. The Nazis will allow a few to escape in order to mentally and emotionally torture the rest. Then the barn is set on fire, grenades are thrown in, flamethrowers are used, and guns will kill the rest. Yes, this film is utterly horrific and is shown to us through the experiences of a 13 year old boy who survived the war and co-wrote the screenplay.",
            "review_date": "2015-12-26",
            "source": "rt"
        },
        {
            "content": "This is a brutal film and very moving. I haven't seen a war movie this poignant since the original, oscar winning All Quiet on the Western Front. The performances will stay with you, as you see children forever changed by the horrors confronting them. There's so little dialogue, but none is really needed.",
            "review_date": "2015-09-15",
            "source": "rt"
        },
        {
            "content": "https://youtu.be/L-Ro0SZf438",
            "review_date": "2015-08-22",
            "source": "rt"
        },
        {
            "content": "This 1985 Russian film was one on a list of brilliant films too painful to watch twice, and it's not hard to see why. Come And See is a dark, heavy depiction of the horrors of war and Nazi atrocities towards Slavic peoples through the eyes of a fourteen year old boy. The title comes from Revelation 6:7-8, referring to the Fourth Horseman of the Apocalypse, unleashed to bring death and destruction. The fitting reference drives home that this inhuman brutality actually happened. The story is based on the Khatyn massacre by the Dirlewanger Brigade, an SS unit mostly composed of hardened criminals. They had the reputation even among the Nazi leaders of being the most unnecessarily ruthless and unprofessional of all SS units. The film reveals this reputation well, especially when they descend upon a helpless village. The awful results will scar all but the most calloused viewer. Like Schindler's List, it's painful to watch but important history to see. The violence is disturbing but more often implied or glimpsed, with a couple significant exceptions. (The film doesn't show how the partisan armies were often just as awful as the Germans, but perhaps that is for another story.) The fourteen-year-old mentally deteriorates with every encounter of violence. No heroes or celebratory victories. Everyone loses in this war. The narrative takes some disjointed turns in keeping with the chaotic nature of war as well as the protagonist's numbness and perhaps insanity. Many minor characters come and go without knowing much about them or what happens to them: The girl at the beginning, the partisan recruiters, a group of displaced villagers. The sound gets dull and we hear ears ringing during a bombardment. The camera lingers at trees and wildlife but gives only glimpses of the slaughters and devastating aftermaths that would normally grab the eyes. Early on, the young boy's face smiles in eagerness to defend his homeland. But as he meanders through each episode of war his face becomes painfully contorted, then stone-faced fury and finally a speechless blank stare. The young actor does an incredible job at using facial expressions to speak volumes of anger, pain and loss. In Russian, German and Belorussian with English subtitles.",
            "review_date": "2015-08-09",
            "source": "rt"
        },
        {
            "content": "Its hard to depict the catastrophe of War through film. The suffering stems directly through experiencing it and its difficult to capture it through mere medium of Art. \n\nBut Elem Klimov's masterwork 'Come and See' (1985) takes you into a nightmarish journey of the incurable wrath of Humanity. Depicting the massacre of Belarus villagers by the Nazi army through hand held shots, atmospheric set designs and relentless performances by the lead characters brings the anit-war message to such depths that one might have never experienced it through film before.\n\n'Come and See' (1985) is truly a masterwork of Soviet cinema. One of the best anti-war films ever made.",
            "review_date": "2015-08-08",
            "source": "rt"
        },
        {
            "content": "Outstanding cinematography!",
            "review_date": "2015-08-02",
            "source": "rt"
        },
        {
            "content": "A frightening vision of war. The way it's filmed every scene is either stunningly realistic or very surreal. Everyone seems at least a little mad and creepy.",
            "review_date": "2015-03-25",
            "source": "rt"
        },
        {
            "content": "There are many good films about the Holocaust. However very few ever try to look at it through this lens. Terry Gilliam once criticize Schindler's List because, \"The Holocaust was about failure\" and Schindler's List was about what \"A man can do what a man can do.\" Though Schindler's List is a great film it does not show the horrors of the Holocaust and war quite like this film. I kind of compare this to the book \"Night\" in terms of how both \"Come and See\" and \"Night\" is so an unforgiving and bleak but true. Various historians and people who participated in the atrocities during the Nazi occupation of the Soviet Union would say that this is a very realistic portrayal of the events that unfolded in areas. It is not propaganda it is a very direct and concise portrayal of horror and the extent of human evil and the consequences of it.",
            "review_date": "2015-02-26",
            "source": "rt"
        },
        {
            "content": "Psychological horror set during the nazi invasion of Russia and one of the most disturbing war films I've ever seen. An unsettling experience with some unforgettable scenes.",
            "review_date": "2015-01-30",
            "source": "rt"
        },
        {
            "content": "This film challenges the iconic, staged Hollywood war films. The use of the handheld film camera and brutal violence make this film ultra realistic. At parts the film felt more like a documentary since the camera work was up close and personal and because the shots weren't completely fluid. While the film is disturbing I would recommend it.",
            "review_date": "2015-01-08",
            "source": "rt"
        },
        {
            "content": "\" And the name sat on him was death and hell follow with him,\" Out of all the holocaust related movies I seen, this is the only one I made be wanted to go in the film and kill a Nazi. One of the best movie I ever seen. Love the ending too. You can't change history",
            "review_date": "2014-12-28",
            "source": "rt"
        },
        {
            "content": "A teenage boy's bleak-as-pitch odyssey through war-torn Belarus is named after a verse from the book of Revelation which, while too long to quote in full, can be paraphrased in this context as, \"Don't come expecting a Nora Ephron rom-com.\" Biplanes circle like buzzards above, corpses are piled like firewood against buildings, while Nazi death squads scour the countryside with bug-eyed glee. It's a journey that carriers the viewer to hell and leaves us there. Nothing, before or since, has captured the psychological carnage of war like the final shot of the boy's face, now hollow-eyed, lined and aged. Under-seen but riding high on critics' and filmmakers' lists, this is the Russian Apocalypse Now, a dizzying, terrifying portrayal of brutality and genocide during the Nazis' scorched-earth campaign through Belorussia",
            "review_date": "2014-11-24",
            "source": "rt"
        },
        {
            "content": "Made me determined to swallow down the Russian masterpieces .",
            "review_date": "2014-10-12",
            "source": "rt"
        },
        {
            "content": "A young Belarusian boy finds a rifle and decides to join World War II. We follow him as he discover it's horrors - slowly turning him insane.\n\nPowerful and brutal film that looks like few, or no other war-films. Raw and ugly, it makes the viewer both angry and sad. Amazingly shot with typical russian style - long, slow scenes. That sound usage - that noisy, droney music as well as the larm of screams and terror also deserves a mention. Woah, it creates the perfect \"unwanted\" experience.\n\nThe lead does an incredible job here. Gradually he is emptied from his natural self, turning into something else. Truly a great performance. Not very graphic, still a very hard film to watch.\n\nBy the way, the director was married to Larisa Shepitko, who made \"Voskhozhdeniye\" - a film to look out for even if it's not as great as this piece.\n\n9 out of 10 storks.",
            "review_date": "2014-09-25",
            "source": "rt"
        },
        {
            "content": "The best war movie I have ever seen. It is terrifying.",
            "review_date": "2014-09-12",
            "source": "rt"
        },
        {
            "content": "I had to watch this film in my Senior Seminar class and write a paper on it. Although there is hardly any battlefield action in this movie, it is one of the most disturbing portrayals of war I have ever seen. The filming of this movie was so emotionally draining, that according to the director, it was a miracle that everybody was able to maintain their sanity. 10/10",
            "review_date": "2014-09-07",
            "source": "rt"
        },
        {
            "content": "Soviet Director Elem Klimov has crafted a rough diamond of a film. It is unlike any war film I have ever seen. Few motion pictures have recreated events so real, so horrific, it borders on the level of documentary. Yet, the lush cinematography doesn't detract from it's unflinching recount of the massacre in Belarus. If you've seen other films about WW2 it is only natural to immediately draw comparisons to \"Saving Private Ryan\" or \"Schindler's List\", important and masterfully made films in their own right. \"Come and See\", however, is more intimate, functioning as a real-life nightmare experienced by Ales Adamovich, here renamed Florya Gaishun. To say Alexei Kravchenko  \"played\" this character would be an insult, the pathos etched in this boy's eyes as he watches the systematic destruction of his nation, his people and his identity are all too real to emulate. Something is happening beyond the frame, these filmmakers know the story all too well, perhaps they knew these people, were these people and their only choice was to live to tell the truth. This one of the few great cinematic experiences in which you'll be doing more than watching a film, you'll be preserving a memory.",
            "review_date": "2014-09-06",
            "source": "rt"
        },
        {
            "content": "Russian Apocalypse Now. Story telling and visual effects at its best.",
            "review_date": "2014-08-28",
            "source": "rt"
        },
        {
            "content": "Aleksey Kravchenko performance was so incredibly real, so powerful it left a lasting mark!",
            "review_date": "2014-08-22",
            "source": "rt"
        },
        {
            "content": "This movie is a masterpiece. Essential viewing if you're remotely interested in WW II. It will stay with you.",
            "review_date": "2014-06-15",
            "source": "rt"
        },
        {
            "content": "By far the most brutal Holocaust-centered film I've ever seen. I don't think it would presumptuous of me to say that this film has some of the most haunting images in all of cinematic history.",
            "review_date": "2014-05-11",
            "source": "rt"
        },
        {
            "content": "A borderline hallucinatory journey through the increasingly devastated Byelorussia with an increasingly traumatized 13 year old soldier. The ending trips and stumbles for awhile, but mostly a very well made, uncomfortably evocative, tortuous movie.",
            "review_date": "2014-04-26",
            "source": "rt"
        },
        {
            "content": "Disturbing. It took a while to get used to the actors performing directly into the camera at times.  Shows a bleak picture of war (as it should).",
            "review_date": "2014-04-18",
            "source": "rt"
        },
        {
            "content": "Somehow, Elem Klimov did exactly make a WWII film that really struck me in such a way I don't think I can ever possibly describe it at all. In fact, \"Come and See\" is not even a war film. It is the actual war put on camera.\n\nFull review at filmbroadcaster.weebly.com",
            "review_date": "2014-04-03",
            "source": "rt"
        },
        {
            "content": "love this movie. makes me want to learn Belarusian .",
            "review_date": "2014-03-30",
            "source": "rt"
        },
        {
            "content": "This soviet war film was actually filmed and concentrated on my heritage land of Belarus, and whileÂ Come and SeeÂ has an anti-war message this brought out a want of vengeance. This is thanks to the powerful imagery that brings out empathy and terror at the same time. Some of the scenes were truly brutal, my most powerful emotions were felt based on the images on the screen, and not in the overall sympathy for the protagonist. The film is often overwhelming in either violent scenes or darkly surreal moments, Glasha's monologue was really dark. Director Kilmov makes use of irony often, an injured foot getting blown off is a notable example. Much of what happens inÂ Come and SeeÂ is symbolic, the only use of the rifle (which is focused on during Florya's progression) is purely symbolic in an astonishing ending. It's understandable that this film will have it's biases but it shows the atrocities on both sides of World War II. Extremely powerful during the watching experience, but the feelings wore off fairly quick. Many films that are this harrowing rely on shocking images,Â Come and Seehas that but these have an important purpose in showing the sick nature and/or separation of a soldier at war.Â \n\n3.5 stars+",
            "review_date": "2014-03-16",
            "source": "rt"
        },
        {
            "content": "COME AND SEE is one of the most extreme, arid, and hopeless films I've seen. It is also incredibly effective at what it sets out to do- a forceful, powerful piece of filmmaking. The film is an artistic expression of the psychological effects that war has on normal civilians, normal people who are in a situation where they have no other option other than to defend themselves from the enemy. The movie has very clear feelings on war- but it is confilcted morally- and it's meant to be. The ending of the film gets this across very clearly. \n\nThis is one of the finest war movies ever made- a it's powerful, intense feat.",
            "review_date": "2014-02-10",
            "source": "rt"
        },
        {
            "content": "I've heard so much about this as being one of the most disturbing and depressing films of all time, I've been trying to see it for a while now and I finally got the chance, it's definitely intense and harrowing, tho I wasn't as shocked and awed as I expected, maybe I'm just desensitized, the kid does a good job, and it sucks to see him endure all this shit, and the film definitely doesn't hold back, it does drag a bit in the middle though, I also had never seen a WWII movie from the Russian perspective before, so that was interesting",
            "review_date": "2014-02-04",
            "source": "rt"
        },
        {
            "content": "unremitting graphical terror and accumulating atrocities--Depressing, mind-boggling and unique!!",
            "review_date": "2013-12-05",
            "source": "rt"
        },
        {
            "content": "This movie catches you and will not let go. Compelling drama that leaves you changed. If you only watch one movie this year let it be this.",
            "review_date": "2013-11-25",
            "source": "rt"
        },
        {
            "content": "a look at WWII from the russian perspective",
            "review_date": "2013-11-23",
            "source": "rt"
        },
        {
            "content": "One of the best war movies I've ever seen. Absolutely staggering, beautiful, horrifying work of art.",
            "review_date": "2013-11-11",
            "source": "rt"
        },
        {
            "content": "One of the most realistic, and traumatizing views on the war. In fact, \"Come and See\" is not a war film. It is the actual war put on camera.\n\nFull review at filmbroadcaster.weebly.com",
            "review_date": "2013-11-01",
            "source": "rt"
        },
        {
            "content": "To see the inhumanity and cruelty that humans can and have inflicted on one another is not easy viewing, but it is necessary viewing. Come and See is perhaps the most disturbing, haunting picture about war of all time.",
            "review_date": "2013-10-21",
            "source": "rt"
        },
        {
            "content": "One of the greatest movies I've ever seen. If you ask me what are the best movies, this and wings of desire will always be mentioned. It reaches to express the childs trauma, in the midst of chaos, and does so with an intense realism. Simply stating the facts would fail to express florya's plight truthfully. I wish I could explain myself better, I just know that it's great in a way few movies are...",
            "review_date": "2013-10-13",
            "source": "rt"
        },
        {
            "content": "Possibly the greatest film ever made about World War II, Come and See is everything that a film about this subject matter is NOT supposed to be. An overdose of surrealism. An amplified sense of self-righteousness. Some too-familiar suspense tactics. Yet, it reflects the filmmaker's uncompromising attitude: a rejection of an attempt to understand, despite knowing all the facts. Now, this may sound extremely inappropriate in the context of the post-modern world where multi-perspective is trendy. But, frankly, how many of us can actually claim to understand the horror of the war? Klimov is unequivocal about it: you'd better not go there, because once you reach, there is no turning back.",
            "review_date": "2013-09-28",
            "source": "rt"
        },
        {
            "content": "Devastating anti-war movie that will forever change you.",
            "review_date": "2013-09-15",
            "source": "rt"
        },
        {
            "content": "A punishing two and a quarter hours of hideous inhumanity.",
            "review_date": "2013-08-23",
            "source": "rt"
        },
        {
            "content": "Very powerful and disturbing war film set in Belarus during the time of the German invasion. Really good film that pulls no punches in it's attempt to portray reality.",
            "review_date": "2013-08-08",
            "source": "rt"
        },
        {
            "content": "Russians sure do know how to make a boring movie, no matter how interesting the story is.\n\n\"Come and See\" is an intense true story about a kind and quiet russian boy who looks for a gun, which could be his ticket to join the Soviet Army. Little does he know the horrors that will come once he does join the army.\n\nIt started out pretty good, but it soon got to a point where it all felt messy and nauseating, kind of like the feeling I get when watching an overly artsy Nicolas Roeg film. My only problem with it was that I might've not been in the right mood to enjoy a film like this, but I can't disagree with others calling it a masterpiece. Apart from that, some parts were very uncinematic and the editing was horrible.\n\nThe best part of the film has got to be the natural cinematography, without it there probably wouldn't be much to talk about. I loved the point of view shots, they made me feel really uncomfortable. Some dialogue was pretty good and there were some scenes that were extremely tense, too bad they were followed by other scenes of boredom and nonsense.\n\nI've got to also point out how I loved the way the movie established so many characters in no time by doing simple things like taking a picture and seeing their reactions as they walked towards the group and how they posed was enough to tell me who these guys were. Once again, I have to say the camera work was brilliant, it reminded me of the similar work in \"Children of Men\" and \"There Will Be Blood\".\n\nTowards the end I kept thinking this would make a great double bill to watch before \"Inglourious Basterds\", for that way you wouldn't look away when the \"Bear Jew\" beats the Nazi who doesn't give Aldo Raine the information he asks him for. There's a sense of realism the movie brings that makes it so discomforting to the viewer, even the bullets used in the movie were real and they even killed a cow. I'm not saying it's just an okay movie, its actually a great movie, but it's not a movie I'd like to see ever again as it left me feeling real bad and might've just ruined my day.\n\nI'd recommend it to anyone who liked \"Apocalypse Now\", \"Full Metal Jacket\", \"The Thin Red Line\", \"Au Revoir Les Enfants\", \"The Pianist\", and/or \"Requiem for a Dream\".",
            "review_date": "2013-08-07",
            "source": "rt"
        },
        {
            "content": "30 minutes that should have been cut make for a lot of anxious waiting. A disquieting look at the scorched earth tactics used by the Nazis, circa 1943 in Belarus. \"Come And See is an intimate epic in which all the promise of adolescence is perverted by war.\" Tense, grim and chilling. Powerful finale.",
            "review_date": "2013-06-28",
            "source": "rt"
        },
        {
            "content": "Critically hailed as the 'most horrifying wartime drama', Come and See offers you an utterly disturbing and spine-shivering experience to witness the hideous atrocities of German soldiers. Unlike most contemporary WWII dramas which only focus on the evil motives and post-destruction brutality at most, it ruthlessly depicts the 'real' destruction of humanity in order to get us to taste the 'real' meaning of horror. However, personally speaking, I find the eye-whitening and the freakly-grinning Glasha at the beginning far more frightening. The hideous images will never get out of your mind.",
            "review_date": "2013-06-23",
            "source": "rt"
        },
        {
            "content": "I watched two war films this week, the Life and Death of Colonel Blimp and this. I can't imagine two films that deal with the war from such a different angle. \n\nThis one was harrowing.",
            "review_date": "2013-05-29",
            "source": "rt"
        },
        {
            "content": "If you were looking for a war film then I would suggest you turn away. While it is set in World War II it is more of an emotional and gritty realistic look at events in the war. This is not a feel good, pump you with patriotic sense of self worth. This film will punch you in the gut, and really make you look at the realities of war.\n\nIn that way it is a very powerful anti-war film that will leave you with many questions. Beautifully shot, and really good acting as well. While the ending is certainly a fantasy of revenge, it is the culmination of what made our protagonist who he is by the end of the film.\n\nI would also agree with other reviewers here that it is very operatic. If you watch this film be prepared to watch for about 2 hours.",
            "review_date": "2013-05-10",
            "source": "rt"
        },
        {
            "content": "A realistic approach about the German occupation of a village in Byelorussian S.S.R. in 1943. It focus the atrocity upon the civilians. This Russian film defines horror.",
            "review_date": "2013-05-07",
            "source": "rt"
        },
        {
            "content": "One of the most intense and powerful WW2 films that I've ever seen.",
            "review_date": "2013-03-10",
            "source": "rt"
        },
        {
            "content": "I've seen tons of World War II movies and a whole bunch of the subgenre of World War II films from the point of view of children and adolescents. This one ranks as one of the best. The plot is simple: An eager beaver teenage boy from a small village in Russia volunteers for the army during the war and witnesses first hand the true horrors of war. I've heard this film's reputation for being bleak. It is. Very. But also it has moments of beautiful imagery that almost borders on dark fantasy/horror/surrealism especially on the first half. I thought I've seen everything but this managed to still shock and horrify me despite seeing and knowing all that I know about World War II. It hammers the point too hard just a tad at the end but it's still a stunning piece of cinema.",
            "review_date": "2013-02-27",
            "source": "rt"
        },
        {
            "content": "Made 40 years after the end of \"The Great Patriotic War\", Kilmov's 'Come and See' is often hailed as a \"masterpiece\" of \"realism\" and \"fact\", regarding German actions in Russia during the war. Unfortunately, real factual atrocity notwithstanding, I found very little in 'Come and See' to be factual at all, because the director chose to shoot the film in a shroud of arty murkiness, rather than as a clear historical document of atrocity and for the vast majority of the film, there is very little going on.\n\nEssentially, viewed through the eyes of the young protagonist, Florya, the viewer is presented a singular Russian view of WWII. It's simplistic, with little grey area and it absolutely subtracts any homegrown Russian atrocity in favor of the bog standard foreign invader type. There are no complexities available in 'Come and See', there are no questions on the nature of war, or atrocity and there are no honest appraisals of the conduct of the people involved in the conflict. It's simply a short film about an atrocity, wrapped up in a much longer film about nothing.\n\nIn the first three quarters of the film, Florya and his young naive female friend, Glasha, go on an insipid odyssey, leading him to seek out a partisan band and \"join up\". The kids dance in the rain, babble on inanely about nothing, go deaf from explosions and look up at a FW189 recon plane that drones around the sky above their heads. Eventually, after a terribly tedious amount of time detailing very little, we get to the point of the film, the German's burning down a village barn and killing the inhabitants.\n\nThese scenes at the end of the film are quite hard to watch and are handled well, for what they are. But, it takes so long for the film to get to the point that the danger is that the viewer might not care any more. I really cannot emphasize enough how little actually happens for the bulk of the running time. It's a film that demands that the viewer be extremely patient with it.\n\nBut, there are also issues to be dealt with regarding 'Come and See's central scene. The \"nazis\" are presented as some sort of wasteland warrior types, straight out of a 'Mad Max' film, or something. They absolutely do not represent any historical counterpart, though the film attempts to suggest that they are the 15th Einsatzkommando. They are the \"Russian\" view of the \"Germans\" and in that bracket alone, the viewer must be careful of what he's being told. The \"Germans\" are cardboard villains, not people. They are sadistic, vile, rapacious, murderous and cowardly. The lead up to burning the barn is also filled with ridiculous shots of surreal nonsense, with people doing extraordinary things for no reason. The \"Germans\" herd the Russian villagers to their doom, while playing music over a loudspeaker and saying things like \"Germany is a civilised country\". They laugh and goof around, drink alcohol, make stupid faces at the camera and get ready to enjoy some good old slaughter.\n\nOn the other hand the Communist partisans are playful, comradely and righteous in the way only movies can portray. They are completely contrasted to the \"German\" savages, with neither portrayal of the opposing sides containing any real truth or fact and the view of the Germans is bordering on racism.\n\nIt's clear what this Soviet commissioned film is trying to do.\n\nAs a surrealist horror fantasy, 'Come and See' has some merit, if only for the 20 minute barn burning sequence. The rest of the film though, is a real chore and very tough going. It's filled with absurd imagery too, like the female nazi eating shellfish while she enjoys the view of the burning barn. She looks like she's come straight from a nazi fetish website. One also never gets the sense that the director is inviting the viewer to do anything but get bludgeoned over the head by his visuals and overwrought tone.\n\nIn the end, I'm left with mixed feelings about 'Come and See'. The mechanics of the film are dreadful at times and it certainly is in need of a much better script. The acting is decent throughout and the last quarter of the film, though heavyhanded, is rewarding...if one can call such visuals \"rewarding\". However, while it's important to remember man's inhumanity to man, when it's constantly portrayed as coming from certain quarters only, one can get a little jaded. Films with purpose, like 'Come and See', can also leave a bad taste in the mouth. While its comments on Hitler and Nazism as a vile entity are entirely correct, it quite conveniently leaves out any comments on Communism's own atrocious excesses.",
            "review_date": "2013-01-26",
            "source": "rt"
        },
        {
            "content": "Extremely powerful drama. But do not watch it before getting to sleep.",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "A kick in the balls. You've never seen war like this. which is also what it probably feels like. I wish I never get to know from actual experience. Exta points for it being in the eastern front; we don't get much covering this side of the war, what with Americans dominating the war film genre.",
            "review_date": "2012-12-19",
            "source": "rt"
        },
        {
            "content": "I DARE anyone who's watched this to honestly tell me that this was just Soviet propaganda. The most horrifying film about war ever made.",
            "review_date": "2012-12-16",
            "source": "rt"
        },
        {
            "content": "Operatic, nightmarish, and utterly horrifying. Beauty and friendship war with ugliness and hatred for the entire running time, and it is indeed something to come and see.",
            "review_date": "2012-12-09",
            "source": "rt"
        },
        {
            "content": "Unsettling, devastating and very visual film",
            "review_date": "2012-12-04",
            "source": "rt"
        },
        {
            "content": "My all-time favorite war movie! A rare jewel from cinema history, a very painful film.. must see!",
            "review_date": "2012-11-29",
            "source": "rt"
        },
        {
            "content": "A heavy hitter in the seriously effed up war-drama arena. The entire movie seems like a dream, taking us from one memory to the next. It's a very quaint film, and focuses very deeply on just the main character, who is thrown into a haze of war. The culminating sequence at the end was incredibly vivid and real. Watch at your own discretion.",
            "review_date": "2012-10-28",
            "source": "rt"
        },
        {
            "content": "If I called this film unsettling, I wouldn't be doing it justice. It is creepy, violent, and, quite intentionally, horrifying. As far as war movies go, I'll agree with Tim Lott: Come and See \"makes Apocalypse Now look lightweight.\"",
            "review_date": "2012-09-27",
            "source": "rt"
        },
        {
            "content": "What the fuck, that was so sad. *slow clap*",
            "review_date": "2012-09-24",
            "source": "rt"
        },
        {
            "content": "ja mislin da je ovo jedini film u kojen je njemacka vojska pijana a sovjeti trijezni :) al sve u svemu odlicni anti ratni film..podsjeca na jugoslavenske ratne hitove,miljun statista,prave eksplozije,nema cgi-a...klasik",
            "review_date": "2012-09-16",
            "source": "rt"
        },
        {
            "content": "Stark, grungy, and undeniably brutal, Come and See is a testament to the abomination of war. Elem Klimov's rendition of ravaged Belorussia is so tangible the viewer can almost feel the mud and trees, just as they can feel the heat of flames as they consume innocent life. The sharpness with which the protagonist Florya loses his purity in the face of wanton slaughter is the film's most powerful achievement: music, camera work, performance and sheer historical verity all unite to bring limits of man's hatred towards one another to life.",
            "review_date": "2012-09-15",
            "source": "rt"
        },
        {
            "content": "Easily lives up to its reputation as the most brutal war film ever made. (Curiously, the other essential Soviet WWII film was directed by Klimov's wife, Larisa Shepitko.)",
            "review_date": "2012-09-10",
            "source": "rt"
        },
        {
            "content": "A rare look at the world of war from the Soviet point of view. Haunting, terrifying. The seen with the burning barn is one of the most upsetting in film history.",
            "review_date": "2012-08-31",
            "source": "rt"
        },
        {
            "content": "go and watch.brilliantly moving 2nd world war film from the russian perspective.were they real artillery shells in the forest, sure looked like it.",
            "review_date": "2012-08-17",
            "source": "rt"
        },
        {
            "content": "Best depiction of the cruelty of the necessary evil.",
            "review_date": "2012-07-22",
            "source": "rt"
        },
        {
            "content": "A disturbing, yet effective portrayal of war.",
            "review_date": "2012-07-12",
            "source": "rt"
        }
    ]
}