{
    "rating": 9.0,
    "release_date": "1987-12-09",
    "num_reviews": 210,
    "genres": [
        "Adventure"
    ],
    "summary": "Jamie Graham (Christian Bale), a privileged English boy, is living in Shanghai when the Japanese invade and force all foreigners into prison camps. Jamie is captured with an American sailor named Basie (John Malkovich), who looks out for him while they are in the camp together. Even though he is separated from his parents and in a hostile environment, Jamie maintains his dignity and youthful spirits, providing a beacon of hope for the others held captive with him.",
    "reviews": [
        {
            "content": "This Spielbergs best movie imo. It pulls at every heartstrings. Drama, humor, tragedy and hope. The movie takes you through every emotion and the soundtrack is spectacular. Christian Bale is awesome and believable. One of my favorite movies of all time.",
            "review_date": "2023-04-25",
            "source": "rt"
        },
        {
            "content": "not a perfect movie, but huge fan of the writer whose semi-autobiography the movie was based on, and it captured much of what informed his very strange writings... no doubt helped by Ballard (the author) having input on Stoppard's first draft. only movie I've seen twice in one day in the theatre (noon, then 8 pm)",
            "review_date": "2023-02-09",
            "source": "rt"
        },
        {
            "content": "There were just a couple of scenes that didn't hold my attention, however most of the movie was a memorable and emotional adventure and beautifully made. Steven Spielberg is of course the grandmaster of movie-making and Christian Bale has always been talented even from a young age, and this film definitely proves it! I bought into what he went through and how he survived, and this is a side of the war that isn't taught enough (at least where I came up). Some of it might be fact and some of it might be fiction, but it nevertheless felt real and like you were actually going through the experience of wartime occupation yourself!",
            "review_date": "2022-10-26",
            "source": "rt"
        },
        {
            "content": "This is close to being my favourite film of all time.  The whole production is incredible, which facilitates things a lot, but the story is timeless and beautifully driven by the young Christian Bale.  There is much excess here, but the message of humanity is real and tenderly conveyed.  The scene at the end is crushing in its love and decency.  The Malkovich character is actually a distraction, although an informative one.  The doctor seems to understand what drives the young Jim and it is lovely.  Forgive the excess and watch it to the end.",
            "review_date": "2022-10-10",
            "source": "rt"
        },
        {
            "content": "incredible film - It has haunted me throughout my life and I often reflect back on it.",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "An Underrated Gem and a War Drama Classic. As much as this is a Spielberg Film, this film belongs to Christian Bale who shows he was born to be an actor and one of the best. He carries this film from start to finish and is riveting to watch. The soundtrack, acting, editing and cinematography are all a marvel to be hold. That being said there are two problems I had watching this. First the plot get muddled down in the middle of the film and it feel like the film isn't sure if it wants to be a War Movie or a Drama and the two start to clash but still is carried by Bale so well. And finally the pacing starts to suffer at times in the middle noticeably despite everything being so well done. I feel there is about 15-20 minutes could've been cut and nothing would be lost. Overall though everything is solidly done and was a very memorable expierence. A classic",
            "review_date": "2022-08-30",
            "source": "rt"
        },
        {
            "content": "If you love movies about WW2, then this is for you. ",
            "review_date": "2022-08-25",
            "source": "rt"
        },
        {
            "content": "This I perhaps one of the best movies ever made. Very underrated but powerful in every aspect. The struggle and mental strength is a great learning for anyone.",
            "review_date": "2022-08-16",
            "source": "rt"
        },
        {
            "content": "Here's the proof that Christian Bale's talent is inborn. This movie could have been a simple meh', but it's a wow all thanks to he's majestic performance.\nReally enjoyed it.",
            "review_date": "2022-08-13",
            "source": "rt"
        },
        {
            "content": "This prison movie was great. Christian Bale, John Malkovich, Joe Pantoliano, Ben Stiller, Nigel Havers, and the rest of the cast did a fantastic job in this movie. The story of the movie was dramatic, entertaining, and inspirational. It's about never giving up hope and lifting peoples' spirits during a time of war. If you haven't seen this movie yet, check it out sometime. It's a must see.",
            "review_date": "2022-08-13",
            "source": "rt"
        },
        {
            "content": "Great movie from Spielberg.  Stars a very young Christian bale. John Malkovich is outstanding",
            "review_date": "2022-06-10",
            "source": "rt"
        },
        {
            "content": "Empire of the Sun is filled with expansive, gorgeous Spielbergian shots paired with a powerful story concerning the loss of innocence, hero worship, and horrors of war. Spielberg made some of the most memorable movies ever in the 70s and 80s and this one seemed buried in that formidable pile. It isn't exactly the fun adventure that is The Goonies or Raiders of the Lost Ark, and doesn't get as violent as Jaws, but EotS is still a mixture of coming-of-age and extreme peril — although, it never reaches Schindler's List depression. Jim (Christian Bale) is a British schoolboy of wealthy parents in Shanghai during the eve of WWII. The viewer watches as Jim, a literal choirboy, is separated from his parents (Rupert Frazer & Emily Richard) and cast out as a gamin into the city's fray while the invading Japanese march through the streets. The most significant and largest chunk of the movies concerns Jim in a concentration camp for foreigners, mainly British and Americans, who live as prisoners to the Japanese — while it is nowhere near as bad as the Nazi-run camps in Europe for Jews, Gypsies, Slavs, etc., it is not a day spa either. Jim counting the weevils in his porridge (and then eating them for the protein) displays the conditions and the boy's acclimation to them. When Jim stumbles upon the Chinese soldiers in their bunker just beyond the posh Halloween party, the Japanese ships in the harbor at night, the send-off of the kamikazes, and the stadium filled with all of the valuables are all excellent scenes. Having a child as the lead is always a gamble, but Christian Bale, as we now know, is a phenomenal actor and was at thirteen. There are times when the movie drags and 30 mins could've been shaved from the film. The relationship he has with Basie (John Malkovitch) has the kind of multi-dimensional layers I wasn't expecting. It has a complicated view on patriotism and respect — I was actually surprised it wasn't more ridiculed for its portrayal of the Japanese military. You've seen all the big names, give this one a shot, if you haven't already.",
            "review_date": "2022-05-11",
            "source": "rt"
        },
        {
            "content": "Coming-of-age genre is not my favorite.  However, watching Christian Bale as a child actor was interesting.  Theme of loss of innocent of the child and the world is the best part.",
            "review_date": "2022-03-27",
            "source": "rt"
        },
        {
            "content": "Very touching! An exploration of the best and worst parts of the human spirit; unanticipated life events may change your perspective forever.",
            "review_date": "2022-02-02",
            "source": "rt"
        },
        {
            "content": "Very slow, intense depiction of war and internment camps. John Malkovich was solid. Really interesting and trippy to watch a super young Christian Bale",
            "review_date": "2021-12-28",
            "source": "rt"
        },
        {
            "content": "Despite its spectacular score and its beautiful cinematography, the film fails to make anything meaningful.",
            "review_date": "2021-11-24",
            "source": "rt"
        },
        {
            "content": "Very emotional film, with brilliant young Christian Bale.",
            "review_date": "2021-10-05",
            "source": "rt"
        },
        {
            "content": "So many wonderfully memorable scenes.  And, notice Spielberg's technique of showing the boy in the crowd by focusing on his red jacket.  He's going to use the same technique years later to show the little girl in an otherwise black and white scene in Schindler's List.",
            "review_date": "2021-09-06",
            "source": "rt"
        },
        {
            "content": "A long time has passed since this review and when I watched the movie, but my memory of the film is very positive. Christian Bale's character evolves from a spoiled rich boy to a hardnosed scrounger to... frankly a shell of a person that is unrecognizable to his parents. I do recall at times feeling like the movie wasn't going anywhere, but that may in fact be the intended effect as his life (and mobility) shrinks in the prison camps. Christian Bale carried this movie, and I highly recommend watching it.",
            "review_date": "2021-08-20",
            "source": "rt"
        },
        {
            "content": "Steven Spielberg's \"Empire of the Sun\" is an ambitious, heartwarming and sweeping historical epic that showcases the strengths of the filmmaker. With his tenth feature, Spielberg crafted an old-fashioned historical drama that offered an insightful look at prisoners of war in WWII. Using captivating cinematography, Spielberg draws viewers into the world of an inquisitive British boy that struggles for survival in war-torn Japan.  From captivating close-ups to stunning establishing shots, the cinematography keeps viewers engrossed in the film's period setting. As per usual, Spielberg exhibits extraordinary control over the production design, locations and music, using these elements to craft an awe-inspiring cinematic experience. It is hard to not praise the phenomenal performances from the cast. Christian Bale delivers one of the finest performances of his career as Jim Graham. With riveting expressions, he conveys the curiosity, inquisitiveness and resilience of a priviliged British boy that struggles to survive in war-torn Japan. In his first ever leading role, Bale showcases extraordinary talent as a child star that would later serve him well in his illustrious career. The supporting cast, which includes the scene-stealing John Malkovich, is sensational and also worthy of recognition. Although \"Empire of the Sun\" is undeniably riveting, ultimately it is not a flawless film. At nearly two and a half hours, it suffers from an extended running-time that tests the viewer's patience. Moreover, the film lacks the compelling character development of Spielberg's finest work. Nevertheless, fans of historical dramas will definitely appreciate \"Empire of the Sun\" and so will movie-goers seeking heartfelt entertainment. At a time when Steven Spielberg remains best known for his gruesome grown-up war epics, it remains a refreshing reminder of his little-known talent for telling wartime stories from the point-of-view of children that lose their innocence.",
            "review_date": "2021-06-18",
            "source": "rt"
        },
        {
            "content": "Empire of the Sun, based on the J.G. Ballard book, follows the story of Jamie Graham (Christian Bale in his first major role), a privileged young boy living in Shanghai during WW2.  When the area is attacked by the Japanese, he is separated from his parents and ultimately assigned to an internment camp, where he learns to survive by his wits and resourcefulness.  Like a lot of Steven Spielberg films, there are pros and cons with the movie.  On the negative side, there seems to be a lot of scenes that don't appear to serve much of a purpose and are a slog to get through. In addition, it feels very sanitized for a war-time film and the John Williams' score is a bit overbearing, providing guidance to the audience regarding how they should feel at any given time.  On the positive side, there are some beautiful images captured by cinematographer Allen Daviau, Bale's performance is remarkable, and the story is undeniably interesting.  For such a mixed bag, Empire of the Sun is pretty satisfying stuff.",
            "review_date": "2021-04-25",
            "source": "rt"
        },
        {
            "content": "Not particularly bad in any way. I just think that the story could have been more compelling for the unique setting and subject matter. Early Christian Bale gives a good performance, but the film is long and ultimately I found myself almost wanting to skip through it before an hour. John Malkovich is usually entertaining, but even he gives a rather by-the-numbers take.",
            "review_date": "2021-03-28",
            "source": "rt"
        },
        {
            "content": "A sweeping, Spielbergian historical epic and an absolutely excellent one. From the opening scenes of British colonial China to the closing moments, it’s beautifully made, acted and keeps you invested. Spielberg you’ve done it again!",
            "review_date": "2021-03-02",
            "source": "rt"
        },
        {
            "content": "An overly long and tedious film without an engaging story to hold it together. It has an abrupt ending and misses what would have been the more the interesting part of the story. It does have some visually ambitious crowd scenes and the arrival of the Mustangs provides a highlight.",
            "review_date": "2021-02-28",
            "source": "rt"
        },
        {
            "content": "I loved this movie. It was a well produced, well acted, well written movie. Bale was super in the movie. The story was profound. It was an epic movie.",
            "review_date": "2021-02-15",
            "source": "rt"
        },
        {
            "content": "Story about a boy that grows up in a Shanghai prison camp during WWII. A few flaws. Sometimes Spielberg gets way too grandiose and sentimental. The kid (Christian Bale) over-acts to the point of embarrassment. But it's a good movie.",
            "review_date": "2021-01-07",
            "source": "rt"
        },
        {
            "content": "Empire of the Sun doesn't really feel like a Steven Spielberg movie. This film focuses on the beauty of cinema rather than telling a story. It takes its time and meanders its way through the plot while showcasing some amazing cinematography. Christian Bale is also very impressive, even as a young actor, and even though I had a difficult time identifying with his character.",
            "review_date": "2020-09-01",
            "source": "rt"
        },
        {
            "content": "About to climax, Spielberg paints a beautiful picture in the light of the sunset, with Jim watching his young pilot friend getting ready to take off for the first time, with Bale singing a beautiful song composed by John Williams - in fact, part of a beautiful track from the veteran - only to then introduce a past action sequence with the sun high. Okay, we can use common sense and see it as a more fantastical scene, in which Jim feels in a way that only that lighting could illustrate, and it would make sense. However, what really suggests is that Spielberg was so enchanted with his aesthetic achievements in A Cor Púrpura (1986), that he also abused this photograph, and decided to repeat it as soon as possible.",
            "review_date": "2020-07-16",
            "source": "rt"
        },
        {
            "content": "Overly long and surprisingly boring.",
            "review_date": "2020-07-12",
            "source": "rt"
        },
        {
            "content": "Empire is a film that is often overlooked by many of Spielberg’s more popular works. It definitely isn’t perfect and often seems overlong, but it is filled with many moments of pure emotion and heart. Bale’s youthful performance is something of a spectacle. He comes at this role with such an advanced skill level that most actors dream of, even if his character was annoying at times. Malkovich was excellent as well. The Suo Gan melody was incredibly emotional too, as it is performed at many of the film’s most important moments",
            "review_date": "2020-07-08",
            "source": "rt"
        },
        {
            "content": "No words can describe this movie.",
            "review_date": "2020-06-29",
            "source": "rt"
        },
        {
            "content": "Say on my shelf to watch for far too long and I've watched a lot of dross instead of this over the past couple of years. Had no idea what a fantastic and weirdly offbeat film this would be. Interesting for Spielberg, not sure where it was going or even where it went but it was a great tale. Really enjoyed it.",
            "review_date": "2020-06-10",
            "source": "rt"
        },
        {
            "content": "Young Christian Bale's performance here makes every other child actor's pale by comparison. Wow!!",
            "review_date": "2020-06-06",
            "source": "rt"
        },
        {
            "content": "Empire of the Sun is a lesser Spielberg work that benefits from some terrific technical aspects – particularly the cinematography is great and the score is beautiful and grandiose. But the movie has forgettable characters, it's overlong and emotionally manipulative per usual for the director. On a side note, it's comforting to know that some things in life just never change with Christian Bale having been just as annoying as a kid as he is now.",
            "review_date": "2020-04-30",
            "source": "rt"
        },
        {
            "content": "Great direction by Steven Spielberg and a superb performance by a young Christian Bale.",
            "review_date": "2020-04-25",
            "source": "rt"
        },
        {
            "content": "a very Spielberg-esque film that is very very necessary.",
            "review_date": "2020-04-21",
            "source": "rt"
        },
        {
            "content": "Classic Spielberg...inspiring, thought-provoking, heart-wrenching. Sorry I didn't see it when it came out, and grateful I finally did. Well worth the watch.",
            "review_date": "2020-04-20",
            "source": "rt"
        },
        {
            "content": "I miss seeing Siskel & Ebert on tv. With that said, they didn't like so many classics from the 80's. This is one of them.\nSiskel called Empire of the Sun a rip-off of other Spielberg films. Yeah since E.T. about a spoiled by learning to be independent ??",
            "review_date": "2020-04-14",
            "source": "rt"
        },
        {
            "content": "An ambitious look into an often overlooked portion of WWII, combined with Spielberg's direction, Stoppard's script, the performances of the cast, Williams' score, Daviau's cinematography, Kahn's editing, Reynolds' production design, Cordwell and Ford's set decoration, Ringwood's costume design, action sequences and visual effects, Empire Of The Sun is one of the best of Spielberg's career, even if it is often overlooked!!!",
            "review_date": "2020-02-27",
            "source": "rt"
        },
        {
            "content": "This movie for me is what makes Christian Bale the Batman, why it was such a let down when Hollywood changed that.",
            "review_date": "2020-02-21",
            "source": "rt"
        },
        {
            "content": "4.3 though the white savior/white washing may annoy a few people today, it's undeniable that this is one of Spielberg's most personable passion films.",
            "review_date": "2020-02-21",
            "source": "rt"
        },
        {
            "content": "It can drag a little in some parts, but Empire of the Sun is one of Steven Spielberg's best directed movies of the 1980s that is beautifully photographed and has a powerful story with a really good debut performance from Christian Bale.",
            "review_date": "2020-01-22",
            "source": "rt"
        },
        {
            "content": "A sublime, if sentimental war epic.\n\nSteven Spielberg's coming of age war drama Empire of the Sun (1987) is a solid epic with exemplary direction and cinematography, but it delves into nostalgia too often. Empire of the Sun is genuinely moving during the tragedies of a child being separated from his parents and millions of people being displaced by World War II. However, when a Japanese boy is shot in a misunderstanding, Empire of the Sun feels predictable and forced at times. I think Spielberg directed a fine war film, but a touching testament to the resilience of children and their innocence fortitude.\n\nEven the mighty composer John Williams can only muster a pretty and sentimental sounding score for Empire of the Sun. It's a lovely score, but it does feel like all the soft melodies and little flourishes sound contrived to force you to cry. I never cried during Empire of the Sun, but it sure does want to get you there.\n\nChristian Bale is magnificent despite being in such a decent movie even as a young child actor. He is riveting with his sincere emotion and expressive young man. I do find his character unrealistic in how he speaks and acts, but he's so fun and likable by the end that you are captivated by Bale's resonant performance. Bale harnesses the childlike wonder of hope and hobbies to keep busy in an internment camp, but he portrays a universal sense of respect for his enemy and appreciation for a different culture. Empire of the Sun is a phenomenal introduction to Christian Bale's career.\n\nJohn Malkovich is engaging and endearing as a Fagin from Oliver type character named Basie. I really enjoyed Joe Pantoliano's shyster Frank by the same note. Miranda Richardson is really interesting as a woman barely surviving and resenting the boy that is saving her. Masato Ibu is rather nuanced in a near silent role as Sgt. Nagata. Everyone else in Empire of the Sun is completely forgettable. Spielberg's casts are normally more versatile and memorable, but only the main characters here really bask in Spielberg's directorial sunlight.\n\nOverall, Empire of the Sun is nearly a fantastic war film, but it will merely have to be satisfied with reaching incredible coming of age heights instead. Steven Spielberg surely has directed better, but Empire of the Sun remains one of his stronger pieces.",
            "review_date": "2019-12-28",
            "source": "rt"
        },
        {
            "content": "This movie feels like practice for Schindler. While it's not nearly as emotionally rich or mature, Empire of the Sun is more beautiful & visually interesting than I remember. The scene of Jamie discovered the remnants of a struggle in the spilled sugar is showy but undeniably masterful. Bale was clearly born to act, & while he never quite transfers his emotional plight onto us, he's still a wonderful lead for a passable if forgettable story, one that's better during the watching than during the reflection on it.",
            "review_date": "2019-11-13",
            "source": "rt"
        },
        {
            "content": "critics are clueless",
            "review_date": "2019-08-27",
            "source": "rt"
        },
        {
            "content": "One of my favorites movies. Christian Bale is magnificent. John Malkovich gives a dependable terrific performance.  Never understood why this film was not more popular. Well done.",
            "review_date": "2019-08-25",
            "source": "rt"
        },
        {
            "content": "One of the most underrated movies ever made.  The brutality of occupation in war and the life of survival of a 12 year old prisoner. What a movie!",
            "review_date": "2019-08-18",
            "source": "rt"
        },
        {
            "content": "Empire Of The Sun makes no sense. It's impossible to follow. It's boring. Is the boy a prisoner or what. He seems to be having the time of his life. ",
            "review_date": "2019-08-02",
            "source": "rt"
        },
        {
            "content": "Best Little Christian Bale Acting ",
            "review_date": "2019-08-01",
            "source": "rt"
        },
        {
            "content": "Steven Spielberg's lesser known wartime drama \"Empire Of The Sun\" brings the semi-autobiographical stylings of J.G. Ballard to the big-screen, with then up-and-comer Christian Bale doing the heavy lifting as the young protagonist who loses track of his family and subsequently succumbs to the harsh realities of human hardship. And, to be absolutely sure, Christian Bale commits to the role entirely, offering up an incredible performance for anyone, let alone that of someone at such a young age at the time. In fact, all of the acting is up to snuff. Where this movie falters, I find, is actually in that of one of its primary intentions. Part of the movie's aim is to really drive home the desperation and exhaustion on the part of the film's main character. In relating the devastation and pain at hand -- especially towards the end of the film -- the movie does this a bit too well, in my opinion, ultimately allowing things to dip in terms of entertainment value. Granted, this isn't necessarily a movie that's supposed to entertain you, but my engagement suffered nonetheless. ",
            "review_date": "2019-06-03",
            "source": "rt"
        },
        {
            "content": "The best reason to see this movie is to regale in Christian Bale's magnificent performance; he commands the screen, despite being an adolescent. The movie is a fantasy based in real life and inspired by a true story.  It is an inherently interesting - in fact, fascinating - situation, and for that reason we maintain our focus even when the narrative doesn't have a point.  The \"story\" is simply a narrative of four years out of the life of this child.  The value of that story is simply that it happened, or more likely that a more prosaic and less dramatic version of this happened.  And that is by itself worthy of our gaze.  It is a good looking movie, and lots works.  The stumbles seem typical of Spielberg: an attempt to make something mystical and transcendent out of prosaic aspects of life that don't need the manipulation to make them interesting.  This is particularly noticeable in several scenes at the end that Spielberg seems to be trying too hard to elevate to a place where - at least for me - he didn't need to go. ",
            "review_date": "2019-05-25",
            "source": "rt"
        },
        {
            "content": "Seen this again the other day, first time seeing it since I was kid. I liked it as a kid, and I still like it. One of Malkovich's best characters that I've seen. The invasion that displaces \"Jaime\" is well done. Does a good job of instilling the fear and panic. There is a childlike wonder to the film, for me it worked. Really enjoyed this movie.",
            "review_date": "2019-04-15",
            "source": "rt"
        },
        {
            "content": "Underrated is an understatement.  Few if any movies that I have seen look at the formative years of a young man and reveal what a societally forced tough exterior hides.  For a male viewer, this is one of the finest, most honest and beautiful movies I have ever seen.  For the female viewer, watch this movie with an open heart and learn what lies deep inside a man. Love, love, love this movie.",
            "review_date": "2019-01-22",
            "source": "rt"
        },
        {
            "content": "The cinematography of the film was on point, most notably in the footprint scene. But the tone of the film was off-putting, with a curious score that only seemed to be suitable in the stressful scene where the boy was nearly caught. I did not identify with any character, and particularly disliked Bale's. The film stagnated greatly once he went to Suzhou, where he seemed to have a bizarrely happy life. The film tried to fill the audience with the sense of wonder, but it just left me confused.",
            "review_date": "2019-01-12",
            "source": "rt"
        },
        {
            "content": "Out For A Walk.\n\nEmpire Of The Sun\n\nSpielberg's symphony on the disastrous incident has a young heart pulsating among the cold sinister world. To drive an entire more than two hours of a film with a kid on the lead role to speak of a tale that is bizarrely horrendous and gloomy to be palpable. But then this is Spielberg's strongest genre, and the reason why his take on war over the year has created such a jarring effect on the viewers is to his gore yet clean vision. There is undoubtedly inedible sequences as the concept suggests and demands, but his little tactics through which he scales the depth of the water, is to be admired in here.\n\nBarring no restraints on taking the storyline to various places and wider ranges, the consistency is kept alive through familiar faces that shows up every now and then like surfing through different channels. Spielberg's world is not dependent of any medium, as the war should be, and through physical sequences with using less words as possible, he demands attention of the viewers on a much larger scale. Bale, upfront in the field, marching without any flags or troops, is a committed floating bubble that narrates this resistance fluently.\n\nAmong all the harrowing images shown, one of the worst ought to be Bale's innocence being ripped off in the field to almost nothing. And it's that journey of nothing to existence, if not meaningful, that arcs up a magnificent moon on the screen; a pure brilliance. But all the good bits aside, there are times where the film sinks too much into the semantics of it to brew the bittersweet essence of the tale. Nevertheless, Spielberg's second World War triumph claimed Empire Of The Sun has a white bright light that Bale sees it and so do we.",
            "review_date": "2019-01-01",
            "source": "rt"
        },
        {
            "content": "This film was great.",
            "review_date": "2018-11-07",
            "source": "rt"
        },
        {
            "content": "Absolutely one of the most underrated films of all time. Every tween and teen should see this film. A coming of age story tracing innocence to maturity under stress, to the point of madness.",
            "review_date": "2018-09-26",
            "source": "rt"
        },
        {
            "content": "Great, well made and powerful story.",
            "review_date": "2018-09-21",
            "source": "rt"
        },
        {
            "content": "What a grand disappointment.  This film seemed more lost than Christian Bale's character.  I'm a huge Spielberg fan, but even he couldn't save this drawn out film that never gets an identity.  My God, 2 hrs and 30 min felt like 3:50.  Unbelievable. A few nice nuggets are delivered along the way to make you want to stay attached, but then 60% through when you realize this is a failure, you figure you're already so invested you should just keep the DVD rolling in case there is a reward.  Alas, there is none.  Just a truly weird movie I will never watch again.  I guess I was right to not watch this movie the last 31 years.  If you want to see a much better film of the same British/WW2 young man's angst theme, watch Alan Parker's/Pink Floyd's \"The Wall\".  Empire of the Sun goes to show you need a sharp, driving script to succeed in fim, even if you have quite possibly the best director ever trying to bring it all together.",
            "review_date": "2018-08-17",
            "source": "rt"
        },
        {
            "content": "A special film, the portrayal of a boy's unharnessed adventurous nature!",
            "review_date": "2018-08-09",
            "source": "rt"
        },
        {
            "content": "Like any Spielberg picture, there are things about it that are brilliant. But some of the characterization is oblique, and John Williams' score is a complete misfire, an ill fit for the material in every way.",
            "review_date": "2018-07-27",
            "source": "rt"
        },
        {
            "content": "From great locations and sets to perfect casting this film has you gripped from the first minute to the last. The physical transformation of the lead character through the ordeals of the movie show their toll. A must see.",
            "review_date": "2018-06-16",
            "source": "rt"
        },
        {
            "content": "Empire of the Sun is my favorite movie, and super underrated! It's perfect for any type of age, it has a great amount of humor and really gets you into it!",
            "review_date": "2018-05-25",
            "source": "rt"
        },
        {
            "content": "I was seriously excited to watch Empire of the Sun because I heard it widely praised and it sounded like my kind of war film. Perhaps I elevated my expectations too much, but I did not manage to connect with this movie. The story starts off well, but once the inciting incident occurs I struggled to care. There was a nugget of something magical in the movie because it featured a young boy who revered planes and pilots without fully understanding what they were doing. One scene of him singing to a group of kamikaze pilots who were preparing for their mission made me pause and say “This is the movie they should have been making!” Instead it was like an adaptation of Oliver Twist in the midst of war where everyone around this little boy is despicable and there is no hope of salvation from the squalor until the war ends. John Malkovich was the pseudo-Fagin and every time he steps on screen I’m trying to figure out why our main character spends any time with him. There were so many moments that I could see what the screenwriter and director were attempting, but there was no emotional resonance for me because I wasn’t engaged in the drama of the story. Christian Bale tries his best, and he is a good child actor, but the writing keeps letting him down. In one scene he suddenly makes a declaration that’s clearly intended to be an emotional punch to the gut, but it came out of nowhere and didn’t seem to be motivated by what was happening. It took me by surprise so much that I let out an involuntary laugh. This is indicative of how drastically the film failed to resonate with me. It had a few moments of magic, but not enough to redeem it. Although, I suspect I have the minority opinion on Empire of the Sun, because it is a highly-lauded film.",
            "review_date": "2018-02-09",
            "source": "rt"
        },
        {
            "content": "THE BEST MOVIE I'VE EVER SEEN!!!!!!!! THIS KID SHOWS HOW STRONG A PERSON CAN BE...NOTHING LIKE TODAY'S KID!!!",
            "review_date": "2018-01-30",
            "source": "rt"
        },
        {
            "content": "A moving story from a unique perspective during WWII. Terrific acting. I love Bale's performance here, and everyone else's to boot. I watch this at least once every year or two.",
            "review_date": "2017-12-28",
            "source": "rt"
        },
        {
            "content": "Jim, a young man growing up in rich environments, gets his whole life turned as the war comes his way. He must survive under the Japanese occupation and things are rough. He's parents are gone and he must hang around some sleasy fellas to survive. Well, he's very smart, so he mostly stands up for himself, but being eleven or so, he is not truly fit for such surroundings.\n\nThe movie lost to \"The Last Emperor\" in all six nomitated categories at the Oscars. Two pretty similiar films actually. Both sat in Asia, with young boys as leads. Both are also very long films. This one felt too long, I fell out of it after a great build up, 1.5 hours in. I failed to focus and I figured that I never bought the story, I guess. Too many happy undertones, even if it's seen from a childs perspective. Some great scenes, like the sneaky mission and the footrint sceene, done in a room covered with powder.\n\nThis is Bale's film, he is very impressive. His debut to screen, at age twelve. I've always thought he debuted in \"Mio Min Mio\", but I stand corrected. They came out the same year, though. Huge film, but not my favorite work from Steven. Far from it.\n\n6 out of 10 golf shoes.",
            "review_date": "2017-12-15",
            "source": "rt"
        },
        {
            "content": "Insightful drama from 1987 directed by Steven Spielberg. The story loosely follows events in the Pacific region as China and Japan are at war.\nThe U.S. become involved after Pearl Harbor leading to the atom bombing of Hiroshima and Nagasaki.\nThe film has a good cast including a pre-teen Christian Bale as posh English schoolboy Jim, John Malkovich and Nigel Havers. I also recognised Leslie Phillips from the Carry On films.\nThe story is told over three or so hours as the few English in Shanghai become pawns in the China/Japan conflict.\nBale plays Jim and it is his painful journey that is followed. A journey that sees him separated from his parents, become a prisoner in a prisoner of war camp until the end of the war before being reunited with his parents at the end of the war.\nThe film embarks on a journey that has been explored many times but has a degree of excellence in Spielbergs direction.\nThe variety of Spielbergs work holds no bounds. Empire Of The Sun is one of his more serious efforts from the 1980s alongside The Color Purple.\nPerhaps thirty or so minutes could have been edited from the three hour or so run time but I was left fully engaged with the film.",
            "review_date": "2017-10-09",
            "source": "rt"
        },
        {
            "content": "Hate all the characters, no idea why people like this",
            "review_date": "2017-08-27",
            "source": "rt"
        },
        {
            "content": "Boy of a wealthy British family in China becomes separated from his parents after the Japanese invade during World War II and spends the duration of the war in an internment camp before being reunited with his parents afterwards.  Good acting but only a decent picture.",
            "review_date": "2017-08-20",
            "source": "rt"
        },
        {
            "content": "A fantastic movie. one of the top 10 movies from the 80's. amazing story, great acting, and an emotional ending. Christian bales performance for his first movie was phenomenal, great actor.\n\nthis movie is AWESOMETACULAR",
            "review_date": "2017-05-27",
            "source": "rt"
        },
        {
            "content": "EooS is a carefully crafted visual rendition of the novel of the same name by J.G. Ballard. It is meticulously detailed in its reconstruction of period attire, facilities, and aircraft. Malkovich and Bale, and Havers turn in excellent performances. I am a bit surprised by the \"professional\" critics' reactions; if there is a complaint about character development or plot they might refer to the novel (which the FILM critics seem not to have read). On the other hand, Ballard's NOVEL, like the film, is substantially allegorical, and possibly beyond the comprehension of your average professional film critic; after all, professional critics are people who are so unimaginative and underinformed that they basically can't create anything on their own.",
            "review_date": "2017-04-11",
            "source": "rt"
        },
        {
            "content": "A great piece of inspiring and uplifting epic filmmaking. Spielberg doesn't subject us to the horrors of the camp, but that's useful in this case. He cements into a child's perspective. All that he can see is the silver lining with brief flashes of grief and tragedy. So, that's what Spielberg shows us.",
            "review_date": "2017-04-05",
            "source": "rt"
        },
        {
            "content": "Although it has Christian Bale acting in one of his best movies, the overall tone and feel to this WWII movie is not showing the war accurately.",
            "review_date": "2016-12-05",
            "source": "rt"
        },
        {
            "content": "I really liked this Steven Spielberg drama which I think was treated somewhat harshly by critics upon its initial release.  The story takes place in Shanghai during WWII after the Japanese invasion and follows a young British boy as he tries to survive in an internment camp.. That youngster is played by Christian Bale who is excellent, you can see that even at 13yrs old he had tremendous talent and dive and carries the picture.  Now, this film has some of Spielberg's typical flaws in that the story has his usual sheen and polish to it, somehow making even the terrible interment camp look beautiful and epic, but it didn't detract from the story for me.  John Malkovich is great in a supporting role as well and a young Ben Stiller also pops-up.. Give it a try!",
            "review_date": "2016-11-20",
            "source": "rt"
        },
        {
            "content": "Saw in t heater when came out. Ruined by depressing desperation of being invaded by Japs, & even worse the almost incessant yelling and screaming by the lost rich boy Bale, & others.  Think i liked it then (1987) partly cuzheard great reviews on NPR.    Cruel Japs invading China city.  But too much kid.  And couldn't enjoy cuz my irritable girlfriend hated all the annoying screaming and yelling.   And watching it again on PBS-TV 11.12.21, , for the first time since '87, it is really depressing and tedious and annoying and takes a lot of patience.  And kid Christian Bale is really really annoying (as one of the men tells him \"Kid, your starting to get on my nerves.\"\n\"Steven Spielberg's acclaimed account of an English boy's life in a WWII internment camp in Japanese-occupied China.\nChristian Bale as a child, John Malkovich as annoying & strange as ever.",
            "review_date": "2016-11-09",
            "source": "rt"
        },
        {
            "content": "Didn't know who Christian Bale was when I first watched this as a teenager. What an amazing child actor he was!! Emma 10/10. Lucy 9/10. Charlotte 10/10.",
            "review_date": "2016-10-29",
            "source": "rt"
        },
        {
            "content": "A unique war film that showed what Spielberg could do with war long before Saving Private Ryan, Empire of the Sun is a masterpiece with great performances, a captivating (if long) story and impressive sequences.",
            "review_date": "2016-08-30",
            "source": "rt"
        },
        {
            "content": "The film suffers from awkward drama and some forgettable characters.",
            "review_date": "2016-08-28",
            "source": "rt"
        },
        {
            "content": "Story/Screenplay: (4/5) A bit depressing, but overall a good story.\n\nDuration/Tempo: (3.5/5) At 2 hours and 33 minutes, it's a very, very long movie that felt shorter.\n\nCast & Crew: (4.5/5) A young Christian Bale was outstanding in a film that largely revolved around him.  John Malkovich was also very good.\n\nSummary: (4/5) The cinematography and cast were excellent, the story was very good, and the film didn't feel long.  A thumbs up.",
            "review_date": "2016-08-27",
            "source": "rt"
        },
        {
            "content": "When you make as many movies as Spielberg, there are bound to be a few misfires. This is unfortunately one of them.",
            "review_date": "2016-07-18",
            "source": "rt"
        },
        {
            "content": "One of the best child performances ever",
            "review_date": "2016-07-12",
            "source": "rt"
        },
        {
            "content": "My favorite film of all. Spielberg's best movie!",
            "review_date": "2016-06-16",
            "source": "rt"
        },
        {
            "content": "Perhaps the best Spielberg film ever, this war drama has a large cast but focuses on mainly one character, a boy out of his familiars. Malkevich plays an\n American, capitalism uncaged, for whom the war is primarily an opportunity for gain. Richardson is a British socialite, forced against her will to look at real life and none too happy about it. And Bale, the star, is a Brit of privilege too, but barely manages to make do. This piece had two things against it as I went in, Spielberg and Bale, but both rise above their comfort zones to deliver an exceptional story.",
            "review_date": "2016-06-01",
            "source": "rt"
        },
        {
            "content": "Christian Bale carrying a movie as a youngster, showing the confinements of what he shall become. The movie itself plays out on a rather interesting point of view of the WW2. From e foreign perspective in Shanghai, as China goes under Japanese controll, Bale and Malkovich among others are captured in a  prisoncamp. Endurance is gold.",
            "review_date": "2016-05-25",
            "source": "rt"
        },
        {
            "content": "Empire Of The Sun features a great debut for Christian Bale and is emotional at times, despite its slow pacing and somewhat boring story that are not typically in a Spielberg film.",
            "review_date": "2016-05-23",
            "source": "rt"
        },
        {
            "content": "Young Christian Bale ð???",
            "review_date": "2016-04-22",
            "source": "rt"
        },
        {
            "content": "Another film I have only just got aroundd to seeing.  Superbly done by Steven Spielberg and with a great performance from Christian Bale, it's strange that this film is underrated.\n\nA harrowing coming of age tale of life during World War 2 occupation and all the nightmares that entails.  If you haven't seen it, I do recommend it.",
            "review_date": "2016-04-14",
            "source": "rt"
        },
        {
            "content": "Visually spectacular, Spielberg doesn't hold back in making something special. It's scope along with its fantastic designs and locations help to transport the viewer and experience this situation as Bale's character does.",
            "review_date": "2016-04-12",
            "source": "rt"
        },
        {
            "content": "I would love to see this movie in its' entirety!",
            "review_date": "2016-03-29",
            "source": "rt"
        },
        {
            "content": "There is a scene in Spielberg's film adaption of J. G. Ballard's novel, Empire of the Sun, where an imprisoned boy by the name of Jim salutes and sings the heart-piercing \"Suo Gân\" to three Kamikaze pilots in their pre-flight ritual. This little airplane enthusiast has no care - more specifically, he doesn't know - of the class and physical barriers that separated Japan and their captives. He respects and cares for all; everyone is equal in his innocent eyes. He salutes, befriends and surrenders to Japanese and American alike without a thought of wires or possible consequences, and everyone, even the brutal Japanese sergeant Nagata, enjoys his presence with a certain respect and adoration for him. \n\nLike the author J. G. Ballard's own experiences, Jim, or James Graham (Christian Bale's first major role that brought him into the limelight), lives in the untouched International Settlement in Shanghai before Japan invaded it, while his well-to-do parents keep him oblivious to the intense nature of the war raging outside the metal barricades of the settlement. When the Japanese do finally march in, Jim and his parents are separated by the great throngs of chaotic crowds. Jim now has to survive on his own until he runs into a strange, snobbish American, Basie, whom he persuades to protect him. The war moves on, and our characters are moved to the Soochow camp, but we don't care as it makes no difference to unenlightened Jim. \n\nSpielberg definitely succeeds in creating movies on World War II, and like any other of them, the oppressors bring down numerous beatings, though Spielberg curbed it to a PG rating, and mild language is spit out in intense, emotional scenes. Though Jim loudly proclaims his atheistic faith, his beliefs are radically different. He talks about God and what he does, possibly a touch in order to appeal to Christian viewers. \n\n\nThroughout the movie, the tween-aged Jim often cries \"I surrender\" to anyone in a uniform, hoping to gain access to his parents or a guardian through that act. But I doubt little Jim understands that phrase, because, instead of a weak, fainthearted boy, we see one with a strong constitution and standing up to oppressors and respecting all (even the dead). Even in conditions so arduous and severe, his manners and respect last through the entire war, recognized by us and an admiring Basie who says, \"You've got nice manners. I appreciate that.\" \n\nSpielberg's powerful use of the camera and Bale's show-stopping performance emphasizes what man would do in harsh and demanding environments. On the other hand, Jim, scraping out a living through a complex network of theft and trade, lives unknowing to the motives behind the cruelties of the camp in his high world of airplanes. We follow Jim and his experiences like a close friend, but like everyone else, we can't convince him of the real dangers and truths he is ignorant of. Unlike Jurassic Park, Spielberg enhances the original material, and touches it with emotion, friendships and an inspirational story.",
            "review_date": "2016-03-10",
            "source": "rt"
        },
        {
            "content": "Really tough one to get through for me. Has some nice visuals, but I feel this is definitely one of Spielberg's worst films. It drags from start to finish and Christian Bale's character is one of the most annoying kids I've seen in a movie. I just wanted this to end as soon as possible.",
            "review_date": "2016-02-09",
            "source": "rt"
        },
        {
            "content": "Yup...once again I am in the minority.  I hated this with every ounce of my soul!  I found it boring and I really didn't care about the story at all.  Everyone likes to blow Spielberg...but this movie was just not for me.",
            "review_date": "2016-01-13",
            "source": "rt"
        },
        {
            "content": "89%\nWatched this on 21/12/15\nSpielberg's film about the loss of Innocence is surprisingly not an antiwar film and it has a mature performance from Christian Bale in the leading role. The film is about a boy of British Origin born and raised on Shanghai who knows nothing about politics or patriotism and the only thing he respects is aviation and the pilots who fly the war planes despite whichever country they belong to. The film has one of the best aviation sequences shot for film after Top Gun I believe. The boy salutes the aviators even from Japan who imprisons him and he exhales in happiness seeing P51 fighters bomb the hell out of Japan, moreover he sees the beauty in Atomic Explosion. This is the better than Spielberg's hit films such as Close Encounters, ET, Jaws, Jurassic Park and the Indiana Jones series.",
            "review_date": "2015-12-20",
            "source": "rt"
        },
        {
            "content": "\"Empire of The Sun\" is a superb drama film of 1987. The plot to this movie is that a 13 year old boy named \"Jim\" portrayed by \"Christian Bale\", who's family is extremely wealthy. Jim's family lives in Shanghai during the 1940's. After Jim and his family are trying to escape Shanghai, Jim looses his family and tries to find them. The plot to this film is amazing, the character change of Jim's character is perfect. The acting in this movie is superb, even at age 13 \"Christain Bale\" was an amazing actor. Another great actor in this film is \"John Malkovich\", he does a great job at playing the character \"Basie\". \"John Williams\" is perfect for creating suspenseful and dramatic music in movies, and \"Empire of The Sun\" is no exception. \"Steven Spielberg\" always films movies beautifully, he made a hot and dusty place look great. The drama in this movie was handled very well, because this movie could have easily become a kid crying all the time, but due to \"Steven Spielberg's\" perfect directing it didn't. If you enjoy drama films then I highly recommend you watch \"Empire of The Sun\"  as it is a film with great acting, great directing and amazing music. I give \"Empire of The Sun\" an 8/10.",
            "review_date": "2015-12-11",
            "source": "rt"
        },
        {
            "content": "Una pelicula, bueno, aceptable, aunque notoriamente mal actuada y demasiado exagerada.",
            "review_date": "2015-11-08",
            "source": "rt"
        },
        {
            "content": "Well I, for one, didn't know that Christian Bale had been a child star and, having seen this, it's no surprise that he has gone on to be the adult star that he is. This is a very interesting account of an English kid living in luxury in Shanghai with his posh family when the Japanese take control in the second world war. It's epic but worth it.",
            "review_date": "2015-11-08",
            "source": "rt"
        },
        {
            "content": "One of my all time favs.",
            "review_date": "2015-10-29",
            "source": "rt"
        },
        {
            "content": "Even there's no torture or killing, the war can still break a person's heart.\nIt's not just about what you done, It's what you see that destroy you.",
            "review_date": "2015-10-24",
            "source": "rt"
        },
        {
            "content": "A visually gorgeous tale of growing up in the harshest kind of way, led by a riveting young Christian Bale.",
            "review_date": "2015-10-06",
            "source": "rt"
        },
        {
            "content": "Even if not completely as striking as it was aiming for, this remains a strong WWII movie from a still-unrecognized point of view that brings out Spielberg's best in detail and human drama, and represents a shining start for Christian Bale.",
            "review_date": "2015-09-23",
            "source": "rt"
        },
        {
            "content": "A bit too aimless for Spielberg, but it offers a good Dickensian performance from a young Pre-Newsies Christian Bale.",
            "review_date": "2015-09-19",
            "source": "rt"
        },
        {
            "content": "Empire of the Sun is one of my favorite Spielberg. Christian Bale, truly magnificent throughout. It's these kind of films that shows the world in a little different perspective. It's good to be ambitious at times. It's necessary to be brave at times.\nUnderrated, unsung, less-discussed yet one of Spielberg's best.",
            "review_date": "2015-08-16",
            "source": "rt"
        },
        {
            "content": "I loved this movie! Isn't this supposed to get a certified rating??",
            "review_date": "2015-07-09",
            "source": "rt"
        },
        {
            "content": "Christian Bale ha sido un 'Señor Actor' desde niño.",
            "review_date": "2015-07-02",
            "source": "rt"
        },
        {
            "content": "Between a 4 and 4.5. Bumped up for emotional impact and overall good work by everyone involved.",
            "review_date": "2015-06-16",
            "source": "rt"
        },
        {
            "content": "Full of John Williams' incredible music and his usual technical masterwork, Empire of the Sun stands out actually due to a young Christian Bale's incredible performance as a child estranged from his family at Japanese prison camp.",
            "review_date": "2015-06-10",
            "source": "rt"
        },
        {
            "content": "A Classic! One of my favorite film of all time!",
            "review_date": "2015-04-26",
            "source": "rt"
        },
        {
            "content": "Another great flick from Uncle Steve :) Young Christian Bale was brilliant.",
            "review_date": "2015-04-05",
            "source": "rt"
        },
        {
            "content": "Another admirable and satisfying film by Steven Spielberg, with a wonderful lead performance from an incredibly young Christian Bale. I wonder if he ever made it as an actor.",
            "review_date": "2015-03-29",
            "source": "rt"
        },
        {
            "content": "The movie that made me want to go to film school.",
            "review_date": "2015-03-19",
            "source": "rt"
        },
        {
            "content": "A Brilliant WWII movie, set in China. Christian Bale, as a kid, playing Jim, is amazing. His transformation from a spoiled brat to a mature adolescent is amazing. Lots of amazing visual shots and techniques by Speilberg. The Welsh song \"Suo Gan\" is beautiful.",
            "review_date": "2015-02-23",
            "source": "rt"
        },
        {
            "content": "Best acting by a child ever.",
            "review_date": "2015-02-04",
            "source": "rt"
        },
        {
            "content": "Desgarradora y llena de magnÃ¬ficos momentos, es una buena pelicula a pesar de sus detractores.",
            "review_date": "2015-01-20",
            "source": "rt"
        },
        {
            "content": "It reduces Ballard's rather tough, difficult novel into a soppy, family-friendly blockbuster.",
            "review_date": "2014-12-30",
            "source": "rt"
        },
        {
            "content": "\"Empire of The Sun\" is a Spielberg's first-effort in (serious) War-Drama film, it has deep exploration of young boy's life in wartime. It's not too emotional, but ambitious enough to lift up its chronicles for Spielberg's class. Christian Bale's acting debut is splendid.",
            "review_date": "2014-12-19",
            "source": "rt"
        },
        {
            "content": "Although it's one of the esteemed director's lesser-known works, \"Empire of the Sun\" is ripe with themes acquainted to those who love the works of Steven Spielberg and it feels very familiar. It's a worthy story centered around a conflict during World War II that not much is known about, and the filmmaker tells that story with the same passion and style that has become his trademark.\n\nUnfortunately, I also found the film to be somewhat cold and uninvolving, with a lead character atypical of Spielberg, a precocious young boy played by Christian Bale. He's difficult to like in the beginning, a spoiled brat which I suppose is the point. But after the war is over and the lengthy film comes to an end, you don not get the sense that he's evolved any. \n\nIt's a rather unemotional journey, and you wonder what the point of it all was. The film seems to shelter Bale (and the audience) from the true horrors of the war, and a great many details are ignored which would seem to be quite important and relevant to the story. Most notably missing, in my opinion, is the Pearl harbor bombing which is only alluded to in the very beginning of the film.\n\nIt's clear that the filmmaker was trying to tell a very personal story against the backdrop of a global conflict, and these minor qualms could have been overlooked had I been better able to connect with the movie. Sadly, \"Empire of the Sun\" will remain one of the director's good movies among a great deal of great ones. Everything about it feels right but it left me rather indifferent.",
            "review_date": "2014-12-05",
            "source": "rt"
        },
        {
            "content": "Although it's one of the esteemed director's lesser-known works, \"Empire of the Sun\" is ripe with themes acquainted to those who love the work of Steven Spielberg, and it feels very familiar. It's a worthy story centered around a conflict during World War II that not much is known about, and the filmmaker tells that story with the same passion and style that has become his trademark.\n\nUnfortunately, I also found the film to be somewhat cold and uninvolving, with a lead character atypical of Spielberg, a precocious young boy played by Christian Bale. He's difficult to like in the beginning simply because he's a spoiled brat, but I suppose that's the point. But after the war is over and the lengthy film comes to an end, you never get the sense that he has evolved.\n\nIt's a rather unemotional journey, and you just wonder what the point of it all was. The film seems to shelter Bale (and the audience) from the true horrors of the way, and a great many details are ignored which would appear to be quite important and relevant to the story. Most notably missing, in my opinion, is the Pearl harbor bombing which is only alluded to in the very beginning of the film.\n\nIt'c very clear that the filmmaker was trying to tell a very personal story against the vast backdrop of the global conflict, and these minor qualms could have been overlooked had it been able to better connect with its audience. Sadly, \"Empire of the Sun\" will remain one of the director's good movies among a great deal of great ones. Everything about it feels right but it left me rather indifferent.",
            "review_date": "2014-12-05",
            "source": "rt"
        },
        {
            "content": "Steven Spielberg's adaptation of J. G. Ballard's novel. Empire of the Sun is an excellent historical drama that, in my opinion, nearly rivals the cinematic quality of Saving Private Ryan.\nThe film centres around a young boy named Jim (Christian Bale) who lives with his affluent parents in Shanghai in the midst of World War II. During a riot he is separated from his family and starts living on the streets until he is eventually taken to a Japanese internment camp. His experiences there carve away his narcissism and naivete that his rich lifestyle had previously granted him. \nEmpire of the Sun is an extremely touching, emotionally compelling drama that incorporates beautiful cinematography and brilliant performances into a masterpiece that is regrettably overlooked by most viewers and critics.",
            "review_date": "2014-11-27",
            "source": "rt"
        },
        {
            "content": "Great interplay, and pristine costumes splendid drama.",
            "review_date": "2014-11-26",
            "source": "rt"
        },
        {
            "content": "best of John Williams incredible movie scores",
            "review_date": "2014-11-21",
            "source": "rt"
        },
        {
            "content": "A good story was told in this movie. Even in a film where the central protagonist is a child, Spielberg did not shy away from showing the horrific realities of war. \n\nSpielberg has a knack for getting believable performances from child actors.",
            "review_date": "2014-11-14",
            "source": "rt"
        },
        {
            "content": "a spellbinding performance by Bale holds Spielberg's World War 2 fairy tale together. Some people have noted that the story itself is muddled or thin. I don't find it to be that at all. I'd liken it's narrative more to something like Alice in Wonderland. It's really the journey itself that is compelling. There are plenty of off-hand morality minuets throughout to give you deeper meaning. Spielberg has chosen to adapt Ballard's true life account in a way that's very true to life. No Hollywood happy ending. No real retribution. Just a slice of world war through the eyes of a boy that lived through it.",
            "review_date": "2014-10-30",
            "source": "rt"
        },
        {
            "content": "It my be not be Schindler's List or Saving Private Ryan but it still a good movie through the acting from Christian Bale and John Malkovich and all technical aspects not a classic but still enjoyable",
            "review_date": "2014-10-21",
            "source": "rt"
        },
        {
            "content": "Empire of the Sun is a powerful, intense, and emotional masterpiece boasting a strong act by Bale and great directing by Spielberg.",
            "review_date": "2014-10-02",
            "source": "rt"
        },
        {
            "content": "Just too long and too many attempts at plots and symbolism.",
            "review_date": "2014-10-02",
            "source": "rt"
        },
        {
            "content": "One of the best movies of WW2",
            "review_date": "2014-09-22",
            "source": "rt"
        },
        {
            "content": "Finding out that Steven Spielberg's name is attached to this excellent movie gives people even more proof that he is one of the greatest filmmakers of all-time.  When the man is on his game, he can always give you something moving and powerful.  'Empire of the Sun' is no exception to this and its emotional core is brought to life from an engaging performance from Christian Bale as Jim Graham, a young boy who is raised in luxury in China but is forced to survive once war reaches his peaceful and quaint home.  Graham is interred at a prison camp and is forced to grow up beyond his years and try to find joy in a completely new lifestyle.  This lifestyle is full of desperation, destruction, and death.  Through Jim's eyes, audiences will see firsthand how war can misplace lives in several ways.  This film put Bale on the map in a beautiful way.  The imagery and solemnly beautiful score by John Williams pulls it all together.",
            "review_date": "2014-09-03",
            "source": "rt"
        },
        {
            "content": "I found this movie a bit uneven and disjointed. Bale is annoying at best and I found myself not caring if he reunited with his parents. The cinematography is a bit heavy-handed and distracting. Overall, this film did not live up to my expectations.",
            "review_date": "2014-08-23",
            "source": "rt"
        },
        {
            "content": "Bale is incredible.  I loved this movie.",
            "review_date": "2014-08-21",
            "source": "rt"
        },
        {
            "content": "One of Steven Spielberg's more overlooked films, Empire of the Sun's authenticity as well as Christian Bale's performance make it highly recommended .",
            "review_date": "2014-08-19",
            "source": "rt"
        },
        {
            "content": "Si Empire of the Sun est bien trop long (sa première partie particulièrement et certaines scènes dans son dernier acte), le film de Steven Spielberg est aussi particulièrement bien joué par un tout jeune Christian Bale qui bouffe l'écran constamment, même face à un type aussi génial que John Malkovich (un peu moins bon qu'à l'accoutumée, par contre). Quelques scènes sont très marquantes, comme les retrouvailles entre le héros et son ami japonais, mais d'autres scènes sont complètement loupées, comme l'arrivée de la bombe atomique. Il n'empêche que dans son ensemble, Empire of the Sun reste un film efficace et franchement sympathique. La bande-son de John Williams est un peu envahissante, cependant.",
            "review_date": "2014-08-17",
            "source": "rt"
        },
        {
            "content": "The first time I watched this, I didn't know that the kid is gonna be Batman, but I knew he'd be one of the greatest actor of our generation.",
            "review_date": "2014-08-07",
            "source": "rt"
        },
        {
            "content": "Though I do appreciate the way film comes together, I can't keep myself from noticing the film's central problem. The biggest problem is that the narrative is kid-centric, which is a big problem when the kid in question happens to be a complete moron. Seriously, when everyone's running from Shanghai, he has no idea why everyone's running, even though almost everyone was talking about war between China and Japan. To me, he just gets more annoying as the film progresses, and in the second half of the film, he hasn't even aged. It's as though Steven Spielberg and Christian Bale were deliberately insulting my intelligence. To be fair, the film isn't all bad. It looks pretty good, and the music is pretty good too, but none of it matters when you have a have that spends its two-and-a-half hour length revelling in child-like idealism and naivety.",
            "review_date": "2014-08-03",
            "source": "rt"
        },
        {
            "content": "I always forget what a wee cutie CB is in this. Also a great performance.",
            "review_date": "2014-08-02",
            "source": "rt"
        },
        {
            "content": "Unbelievably satisfying drown in ex-pat, pre-WWII bathos. (Probably third time watching. Dylan remembered the kid who said, \"No mama, no papa, no whiskey soda.\" Liam and Clare were marginally interested.) I was transfixed, once again.",
            "review_date": "2014-05-27",
            "source": "rt"
        },
        {
            "content": "Is this guy made Schindler's List ? Emptiness of empathy in WWII looks like action movie for kids",
            "review_date": "2014-05-27",
            "source": "rt"
        },
        {
            "content": "Spielberg creates amazing set pieces and puts the viewer in a position of awe due to the realism of chaos. There are instances that you just have your eyes wide open and can't believe what's going on. Christian Bale plays a young child lost in China among chaos in WW2. He is a young Britt who gets lost from his family and ends up in a WW2 camp.  It's fun to watch him grow as he befriends a schemester in John Malkovich. It's just a good story of survival and will, and truly what it takes to be a man and doing what you have to.",
            "review_date": "2014-05-27",
            "source": "rt"
        },
        {
            "content": "While certainly a difficult film to watch, \"Empire of the Sun\" powerfully portrays World War II in the Pacific through the eyes of a precocious and (initially) bratty British child (brilliantly played by Christian Bale). Raises fascinating and provocative questions  about war, childhood, human greed and friendship. Beautifully shot, it may suffer from being a tad slowly paced, but Spielberg's genius for the potential of cinema shines through all the same. Fantastic use of music as well.",
            "review_date": "2014-05-24",
            "source": "rt"
        },
        {
            "content": "Epic!  The budget certainly allowed for that in this grand production.  Had no idea Christian Bale started so young and he was just brilliant as a child actor.  I also had no idea I was watching a Spielberg film and I can see it a bit now, but it's not really that typical of Spielberg.  It is a film I think very much worth watching, but doesn't seem to have gotten as much attention as it deserves.  I was Bale's age at the time he made the film.  The typical Spielberg popishness does detract sometimes, but the film is nevertheless a note-worthy spectacle of the triumphant youthful spirit.  Great cast, but the film doesn't really express their talents so much, as it is very much told through young Jim's (Bale) eyes, and the telling is full of energy, which is something Spielberg can do well.",
            "review_date": "2014-05-18",
            "source": "rt"
        },
        {
            "content": "Great movie, I watched once I was kid, and now, it has that sense of war which makes you feel that every thing is wrong!. war is wrong. very wrong.",
            "review_date": "2014-05-17",
            "source": "rt"
        },
        {
            "content": "Christian Bale's been so talented since he was a kid, that is impressive.",
            "review_date": "2014-05-12",
            "source": "rt"
        },
        {
            "content": "Christian Bale's performances are always so engrossing partly because of the extreme bodily modifications he endures for his roles. In this film, he lost 27 years to play a young boy.",
            "review_date": "2014-05-10",
            "source": "rt"
        },
        {
            "content": "Besides some brief moments of poor story telling and chopped editing, Empire of the Sun is a beautiful and masterful piece of art that shows the face of human nature. Spielberg has undoubtably gained his wings.",
            "review_date": "2014-05-03",
            "source": "rt"
        },
        {
            "content": "Empire of the Sun features some good acting, but ultimately it will bore you to death and make you wonder things like, \"what's going on?\" and \"why am I watching this?\"",
            "review_date": "2014-05-02",
            "source": "rt"
        },
        {
            "content": "I admit I'm fetched by Spielberg sentimentalism; but I think Empire of the Sun is also something more than sentimentalism. It's not radical stuff, but still is very nice. Highlights: Christian Bale as cute-obnoxious British boy in the traditional coming-of-age story; lovely Welsh lullaby Suo Gân; very convincing performances by Nigel Havers and Miranda Richardson. Basie seems rather hurriedly characterised though, and is not given the depth he deserves. In 2014 we might get rather tired of being reminded of how war 'dehumanises', but I don't think there's harm in being reminded. At least the protagonist actually learnt something through the film (viz. the gerund, as in fugiendo vincimus & par est disserendo).",
            "review_date": "2014-04-26",
            "source": "rt"
        },
        {
            "content": "definitely a tearjerker. has great acting + score is great.",
            "review_date": "2014-04-25",
            "source": "rt"
        },
        {
            "content": "It was good, probably won't see it again.",
            "review_date": "2014-04-16",
            "source": "rt"
        },
        {
            "content": "Introducing a young and talented Christian Bale, Steven Spielberg's Empire of the Sun is a brilliant war drama about survival and the will to live!",
            "review_date": "2014-04-12",
            "source": "rt"
        },
        {
            "content": "Over-sentimentalized and bogged down by it's direction. The theme, which is the loss of innocence, isn't presented in an effective manner.",
            "review_date": "2014-04-10",
            "source": "rt"
        },
        {
            "content": "One of the most moving movie i ever saw.",
            "review_date": "2014-03-17",
            "source": "rt"
        },
        {
            "content": "Christian Bale's iconic childhood role and it was brilliant as he plays a spoilt British kid Jamie living with his parents in China during WWII. During the Japanese invasion, Jamie is separated from his parents. With the help of soldier-of-fortune Basie (John Malkovich) Bale learns to survive without a retinue of servants at his beck and call. By the time Basie and Jamie are tossed into a Japanese prison camp the boy has picked up enough street smarts and developed enough intestinal fortitude to regard his imprisonment as an exciting adventure. Its very Spielberg in terms of how the story is told and the length of the film but its helped by a very mature performance from Bale who carried the movie with help from John Malkovich",
            "review_date": "2014-02-18",
            "source": "rt"
        },
        {
            "content": "This was much more profound when I watched it as a young boy. So I recommend it as a family film for families who seriously like serious cinema. Some pretty memorable performances. Some really great cinematography. Definitely carries the Spielberg touch. Just feels a bit forced. Will raise lots of questions from the kids.",
            "review_date": "2014-01-25",
            "source": "rt"
        },
        {
            "content": "By far one of Stephen Spielberg and Christian Bales best movie. One of those movies some people do not know of but once they watch never forget.",
            "review_date": "2014-01-17",
            "source": "rt"
        },
        {
            "content": "I think this may be Spielberg's masterpiece. Yes, that is a heady statement, but I believe it's accurate. Christian Bale gives a remarkable performance, especially for such a young actor. And the music, particularly the key song (you know which one I'm talking about), was excellent and emotionally perfect.",
            "review_date": "2014-01-09",
            "source": "rt"
        },
        {
            "content": "quite exceptional and moving",
            "review_date": "2014-01-05",
            "source": "rt"
        },
        {
            "content": "nothing better that Christian bale begins in the hands of The great Steven Spielberg",
            "review_date": "2014-01-04",
            "source": "rt"
        },
        {
            "content": "One of the best movies never to win the Oscar for best film.",
            "review_date": "2013-12-25",
            "source": "rt"
        },
        {
            "content": "Mahtavat näyttelijät! Elokuvana eteni hieman hitaasti ja vähän pitkänlainen. Hyvä tarina ja hienosti kuvattu.",
            "review_date": "2013-12-25",
            "source": "rt"
        },
        {
            "content": "The young Christian Bale had a spell-binding screen presence, and helped elevate Spielberg's beautiful and woefully under-appreciated war epic to something truly wonderful.",
            "review_date": "2013-12-14",
            "source": "rt"
        },
        {
            "content": "An excellent look at war through the eyes of a child. An amazing coming of age classic, held together by an incredible child performance.",
            "review_date": "2013-12-11",
            "source": "rt"
        },
        {
            "content": "This definitely didn't grab me as much as it could have, or as much as some of Spielberg's other films, especially 'Schindler's List' & 'Saving Private Ryan'. And, while Bale's OK, he's still a 13-year-old kid and can be annoying. And this is much more of a Prisoner-of-War movie than it is a war movie - which I think Bale did better with 'Rescue Dawn'! I think John Malkovich & Ben Stiller could've been used more and there needed to be a bit more excitement and character exploration during the middle (it does go for almost 2 & a half hours), instead of the tediousness of prison life.",
            "review_date": "2013-11-06",
            "source": "rt"
        },
        {
            "content": "one the worst movies i have ever seen",
            "review_date": "2013-11-01",
            "source": "rt"
        },
        {
            "content": "Visually stunning with impeccable performances from Bale and Malkovich, 'Empire of the Sun' (1987) is a seriously underrated gem from Steven Spielberg and argubly, one of his finest achievement in cinema history.",
            "review_date": "2013-10-30",
            "source": "rt"
        },
        {
            "content": "This is Christian Bales first movie and Wow! What a great performance. Also Steven Spielberg's most underrated film.",
            "review_date": "2013-10-26",
            "source": "rt"
        },
        {
            "content": "When it comes to child performances in film, Christian Bale as Jim has to be in the Top 5 of all-time. Not too bad for his first film, and it is no surprise that he has continued his great acting through his adult years. This is early dramatic Spielberg in a time when he was still widely known for his popcorn blockbusters. Many elements used in this film can be seen in his later films like Amistad and Schindler's List. I would put this film in the list of his more underrated films. This is a solid WWII drama about how war can change a person, even a child.\n\nGrade: A-",
            "review_date": "2013-10-12",
            "source": "rt"
        },
        {
            "content": "Not exactly your typical Spielberg film, although it is showing quite a few of his trademarks, this story tells the pacific events of World War 2 from the perspective of a little British boy. Stunning to see what a man and actor has become of Christian Bale, who gave his debut here. While he does a great job, he tends to overact at times. That's no problem though, the direction, beautiful cinematography, enthralling story-telling and gorgeous John Williams soundtrack more than make up for it. A highly underrated war drama, that won't leave a viewer untouched.",
            "review_date": "2013-10-08",
            "source": "rt"
        },
        {
            "content": "I don't know if I actually like it, but it seems to improve upon reflection.",
            "review_date": "2013-10-05",
            "source": "rt"
        },
        {
            "content": "Having read the novel for the first time last year, I looked into watching the film. It's a bit of an oldie now, dating from 1987. Christian Bale is far from his role as Batman, and instead plays the part of Jim; the teenage lead of the story.\n\nSpeilberg keeps the film fairly true to the novel, though the timeframe seems a bit rushed. I felt as if everything transpired so quickly in the movie, whereas the book conveyed the agonizing time spent at the camps and the slow progression of each year that passed. Basie is played by an arrogant John Malkovich, and there is even a surprise glimpse of Ben Stiller, cast as an American soldier.\n\nAs with the book, I found the story not really to my taste. It's one of those tales that needs telling, but I'm generally not the type of person to tune in. I detest war and get emotionally disturbed by realistic descriptions. Already a staunch peace advocate, I do not need a dose of grim war scenes to open my eyes. There is something more special in this, the survival tale of a child, however. Jim is irrepressable and resilient; amazingly well-adjusted. The touching scene of his reunion with his parents betrays the fraility that he hid so well throughout his hardships.\n\nAll told, it is probably a better movie than I give it credit for, but this is after all, just my humble opinion. It's saying something that I even took the time to watch the film in its entirety. I'm sure people will be watching it for many years to come.",
            "review_date": "2013-09-25",
            "source": "rt"
        },
        {
            "content": "Bales debut is spot on and there's plenty of Spielberg touches on show. This movie is never mentioned much when listing his best, but it deserves to be up there, mid table at the very least.",
            "review_date": "2013-09-21",
            "source": "rt"
        },
        {
            "content": "best movie ever so well done and interesting",
            "review_date": "2013-09-18",
            "source": "rt"
        },
        {
            "content": "I just watched this film-saw it long ago-only this time it struck a very deep cord....about survival and the soul sick depravity we can all stoop to when pushed far enough-stunning-Christain Bails performance reminded me of Hushpuppy from Beasts Of the Southern Wild.....he may be nuts as a human-but he can act! (and sing-whowy!)",
            "review_date": "2013-09-17",
            "source": "rt"
        },
        {
            "content": "A very enjoyable entry by Spielberg, could lose some minutes.",
            "review_date": "2013-09-05",
            "source": "rt"
        },
        {
            "content": "Spielberg es el maestro.",
            "review_date": "2013-08-31",
            "source": "rt"
        },
        {
            "content": "Fan-blooming-tastic :)",
            "review_date": "2013-08-25",
            "source": "rt"
        },
        {
            "content": "Christian Bale's character and performance is great but the direction and overall story of the film just seemed like a random mishmash of scenes that weren't put together all that well.  Some memorable moments for sure, but there wasn't much flow, and mostly shallow, almost cartoon-ish like characters that you couldn't feel much connection or sympathy for.",
            "review_date": "2013-08-25",
            "source": "rt"
        },
        {
            "content": "Spielberg y Christian Bale",
            "review_date": "2013-08-22",
            "source": "rt"
        },
        {
            "content": "Watching it you can't help but feel Christian Bale even as a 13 yr old, was meant to play Bruce Wayne",
            "review_date": "2013-08-17",
            "source": "rt"
        },
        {
            "content": "12 yr old Bale's superior acting skills and performance in Empire Of The Sun arguably puts the adult Bale in puddle of humiliation. John Malkovich is a surprise.",
            "review_date": "2013-08-17",
            "source": "rt"
        },
        {
            "content": "Here's the thing.  I loathe Stephen Spielberg.  I'm sure he just wanted to make another kid-friendly movie about a kid (of course) undergoing some bathetic, heartwarming experience.  The problem was the material he chose to adapt.  J.G. (Jim Graham) Ballard is one of the 2 or 3 best and most important writers of the 20th Century and his vision is consistent and implacable.  The material simply overwhelmed the director and took on a life of its own.  Additionally, it didn't help that he hired an actor as Jim who was (and is) uh, decidedly off base.",
            "review_date": "2013-08-12",
            "source": "rt"
        },
        {
            "content": "Personally my favorite film by Spielberg. A beautifully filmed epic with great acting, especially from young Christian Bale, who has gone down to be one of the best actors alive. Sadly, Empire of the Sun is underrated and overshadowed by Spielberg's many overrated films.",
            "review_date": "2013-08-06",
            "source": "rt"
        },
        {
            "content": "This is one of the most powerful movies I've seen, and one of Steven Spielberg's best movie.\n\nGreat movie, great adventure, great filming, great plot, great story, great acting.\nThere is nothing else i can say! Empire of the Sun is a masterpiece, Steven knows how to thug the audience's heartstrings, and he knows how to capture our attention. This is just amazing, amazing movie. \n\nEmpire of the sun is a Precious treasure that's been long forgotten.\n\nThis is one of the greatest wonders of the world, indeed.",
            "review_date": "2013-08-02",
            "source": "rt"
        },
        {
            "content": "A such powerful movie. With an excellent directing, acting, producing and all. The cinematography and the score are beautiful. I don't need to say about Christian Bale's acting. It was magical. Spielberg did it again.",
            "review_date": "2013-07-07",
            "source": "rt"
        },
        {
            "content": "3.5: It seems pretty obvious why Christian Bale was attracted to The Flowers of War.  He had an early childhood experience that fit right in with that pictures subject matter.  Spielberg is certainly a director that can work in a wide range of tones, genres, moods, etc all the time maintaining his distinctive style.  I'm not exactly in love with it, but, for better or worse, he's helped define Hollywood for four plus decades.  The music is sensational, the story archetypal, and the characters fascinating.",
            "review_date": "2013-07-01",
            "source": "rt"
        },
        {
            "content": "One of Spielberg's best films. And definitely Christian Bale at this best. I've really come to love the detail in the filmmaking craft on showcase here. It's not the normal Spielberg flare, but it's a more subtle character-driven style indicative of Spielberg's earlier work. Paired with Saving Private Ryan and Schindler's List, Spielberg has made the definitive \"trilogy\" of WWII centered movies. And then when you count the WWII settings in Raiders of the Lost Ark and Indiana Jones and the Last Crusade, he's spent a lot of time in this period. And of course he's produced the incredible dual HBO miniseries \"Band of Brothers\" and \"The Pacific\".",
            "review_date": "2013-06-09",
            "source": "rt"
        },
        {
            "content": "Empire of the Sun. Down in history as one of the greatest child performances of all-time. As basically a 10 year old Christian Bale was better at acting than I am at anything current day. Just an unbelievable movie and you probably could have guessed that with Spielberg directing and Malkovich as one of the leads. The whole way through was action packed and not in the shitty just-for-show way. This was the wartime intensity kind of action. Incredible story that did not stop until the very last second. A straight up CLASSIC cameo role by Ben Stiller which could not have been more unnecessary and I could not have loved it anymore than I did. 8.5 no question maybe even a 9/10",
            "review_date": "2013-06-08",
            "source": "rt"
        },
        {
            "content": "Mr. Spielberg did the impossible. He made the children's film, and the adult film, seamlessly merge. What strikes one, is the impressive person who is the chauffeur of the ambassador, and then the similarity between what the ambassador views in the Japanese soldiers he encounters, and how he expresses it to his son. Both the Chinese chauffeur, and the Japanese soldiers, are 'biding their time', and their patience is what is striking. It seemed, that the Chinese chauffeur was being Confucian, in modern society, and worriedly, he was impatient by his endeavour. \n The next great impression, is when the young American boy, sees a young Chinese boy say angrily, no father, no mother, .... , and the Chinese boy is speaking about himself. It appeared, that I felt both the chauffeur, and the small boy were Japanese, and not Chinese.",
            "review_date": "2013-06-06",
            "source": "rt"
        },
        {
            "content": "How has this film flown under the radar for so long? Arguably Spielbergs best film.",
            "review_date": "2013-06-03",
            "source": "rt"
        },
        {
            "content": "the magic of Spielberg and 12 year old Christian bale. a story of a 12 year old boy separated from his parents during 2nd world war.amazing, spellbinding, unforgettable. as a 12 year old Bale delivered an unusually strong performance.",
            "review_date": "2013-06-02",
            "source": "rt"
        },
        {
            "content": "War does not determine who is right - only who is left. Bale first main role.",
            "review_date": "2013-06-01",
            "source": "rt"
        },
        {
            "content": "WTF is this movie, seriously?!  Nothing makes sense or feels credible.  The tone is either weak or adrift all over the place.",
            "review_date": "2013-05-31",
            "source": "rt"
        },
        {
            "content": "WTF is this movie, seriously?!  Nothing makes sense or feels credible.  The tone is either weak or adrift all over the place.",
            "review_date": "2013-05-31",
            "source": "rt"
        },
        {
            "content": "Jim Graham is a wealthy, brittish boy living in Shanghai. When world war II breaks out he is accidentally separated from his family and have to manage by himself. The story is quite engaging throughout the whole film, even though the film is a tad bit to long. The film has some focus on the thoughts and feelings of Jim and depicts the innocence of a child at many points, however, i think that this is something that isn´t done enough in the movie. The most interesting thing about the film is to see the transformation of Jim from a spoiled, young brat into a streetsmart survivor.",
            "review_date": "2013-05-29",
            "source": "rt"
        },
        {
            "content": "Christian Bale was an absolutely fantastic actor, even at such a young age.  Everything about this movie was fantastic, it was incredibly well done.",
            "review_date": "2013-05-23",
            "source": "rt"
        },
        {
            "content": "how a man could survive through some unexpected-difficult times; that's what you should teach your kids about",
            "review_date": "2013-05-22",
            "source": "rt"
        },
        {
            "content": "GOING BACK TO 1987, NO DOUBT THERE HAD NOT BEEN  ANY ONE WHO DIDN'T PREDICT THE TRAJECTORY OF BALE TO THE EMPIRE OF THE SUN.",
            "review_date": "2013-05-20",
            "source": "rt"
        },
        {
            "content": "Kuolettavan tylsä ja pitkäveteinen. Spielberg on ihan hukassa tämän elokuvan kanssa. Lieneekö jonkin sortin välityö?! Kaiken huipuksi, Christian Bale on  aivan superärsyttävä roolissaan.",
            "review_date": "2013-05-08",
            "source": "rt"
        },
        {
            "content": "Steven Spielberg adds the finest ingredients to a dreamlike Tom Stoppard adapted screenplay and trusts it all to work. A twelve year old Christian Bale, John Malkovich at his finest, production designer Norman Reynolds and the Shanghai International Settlement all insure that it does.\n\nStoppard's \"stadium of antiques\",  conceived in counterpoint to the Langhua Civilian Assembly Centre bears surreal testament to the power of the survival instinct - and of this film. A sewing needle has become more valuable than a 1938 Packard Super Eight Touring Sedan or a Ming vase.",
            "review_date": "2013-05-07",
            "source": "rt"
        },
        {
            "content": "Takes it time early on but Christian Bale's amazing central performance and it's sense of epic as it draws on make it ultimately another unforgettable war film, the brutality not as harsh as elsewhere but still harrowing.",
            "review_date": "2013-05-01",
            "source": "rt"
        },
        {
            "content": "Story telling at it's best.",
            "review_date": "2013-04-27",
            "source": "rt"
        },
        {
            "content": "Christian Bale deserves a standing ovation.",
            "review_date": "2013-04-26",
            "source": "rt"
        },
        {
            "content": "Empire Of The Sun is a moving film throughout.",
            "review_date": "2013-04-20",
            "source": "rt"
        },
        {
            "content": "One of the the most incredible movie ever made, Christian Bale was amazing.  This is one of my all time favorite movies.",
            "review_date": "2013-04-08",
            "source": "rt"
        },
        {
            "content": "As with any film directed by Steven Spielberg, Empire of the Sun sounded like a fascinating look at a new genre\n\nEmpire of the Sun first characterizes its historical context with a dramatically narrated opening credits scene, effectively establishing the historical context of the story for viewers who do not know it prior to seeing the film. This is something I really respect about Empire of the Sun because there are so many historical movies out there that expect viewers to be already familiar with the events about to be depicted. Steven Spielberg respects his viewers enough to ensure that they understand just what kind of a story they are experiencing.\nStevenm Spielberg takes a different approach to his role as the director of Empire of the Sun. Steven Spielberg films have a tendency to be larger than life, but with Empire of the Sun this is not exactly the case. There are elements of this that lie in the dreams and fantasies of protagonist Jamie \"Jim\" Graham and extensive production values, but the genuine approach that Steven Spielberg takes can be rather inconsistent. There doesn't seem to be much of a sense of story development in Empire of the Sun. Though the film is very much about Jamie \"Jim\" Graham's experiences as a child who has to face the tragedies of WWII, it is also about both the large spectacle of the war as a whole. At the same time, its general mood is largely grim in conveying a loss of innocence yet occasionally lighthearted to convey that very innocence. As a result, Empire of the Sun has some minor issues with focus and tone, unable to assert whether it wants to be a character piece or a Spielberg Spectacle. Ultimately, it ends up resting more on the latter, but it still has faults in doing so. With the story happening through the eyes of a child, the genuine scale of it all feels rather small so that aduiences gain a stronger understanding of Jamie \"Jim\" Graham's perspective on events. However, this interferes with the genuine spectacle of the film because it limits the effects of some of the production values to feeling like they are rather diminutive, particularly in the high profile climactic scenes of the film such as the bombings. Either way, there doesn't seem to be much structure consistency with either the tone of the film or its general story focus which can make it arather strange as an experience. But there is no denying the genuine charm and spirit that Steven Spielberg injects into Empire of the Sun.\nBeing the passionate filmmaker that he is, Steven Spielberg manages to ensure that the themes of shattered innocence are put into Empire of the Sun with gritty sophistication while the film also succeeds in conveying a child's fantasies gradually deteriorating against them. The film is intense and touching, and it is very rich in atmosphere.  The musical score in Empire of the Sun is always the most powerfully atmospheric thing about the film. Whenever the story calls upon it, John Williams' musical score is able to capture a joyful sense of life or heart wrenching grimness to match the visuals. Yet sometimes, the visuals are intentionally not in line with the music.The contrasting sights of a child riding his bicycle through a houe and enjoying a secret stock of his father's liqeur chocolates with the grim musical score effectively ensures that there is a powerful contrast between the imagery and musical score, creating strong dramatic results. \nAnd in all essence, the visuals are quite amazing. You can't expect anything less from Steven Spielberg because he is the creator of so many original blockbusters, and in Empire of the Sun he brings along his talent for spending a lot of money to create an extensive visual experience. With powerful on-location scenery, detailed production design and costumes and some big stunts, Empire of the Sun perfectly captures its timeframe and war themes with legitimacy. The spectacle of the film is truly amazing and the set pieces are a brilliant thing to experience, all captured with cinematography that turns them all into pieces of unforgettable imagery.\nAnd even as a spectacle, Empire of the Sun does not come up short on characters or cast.\nChristian Bale delivers an exceptional leading performance. Christian Bale can't shut up for a lot of Empire of the Sun, and that can prove annoying at times because the abundance of shouting that Jamie \"Jim\" Graham commits proves to be rather overwhelming with noise. As the film goes on this becomes less and less, but it can be somewhat frustrating at times. However, it works to the benefit of the character development. The way that Christian Bale transitions from being a pompous little English boy in fancy clothes at the start of the story to a damaged veteran of war covered in dirt and dog tags at the end is transcendent. Christian Bale goes from playing a juvenile child to a damaged soul, and the transition is exceptional for an actor of his age. Christian Bale develops into delivering the exact kind of iconic grit which he would eventually become iconic for, proving that his extensive acting talents have resonated with him since his earliest days. Christian Bale has such a wonderful spirit in Empire of the Sun, and the fact that Steven Spielberg plucked it and led him on the right path is just wonderful.\nJohn Malkovich's performance is excellent. Consistently proving himself as a brilliant character actor, John Malkovich tones down his common heavy persona and sophistication in favour of a more everyman persona. His restrained effort and genuinely likable nature effectively give him a sense of gritty charm in Empire of the Sun, and his chemistry with Christian Bale proves to bring out the best in both of them while adding a touch of light humour to some of the scene. John Malkovich works extremely well in Empire of the Sun, and his time on screen establishes a truly likable character whose genuine sense of support makes the experience more optimistic and charming.\nJoe Pantoliano also delivers a notable performance. His part is small, but his determined energy and grit prove to balance with Empire of the Sun to create a strong supporting character with a slight touch of comic charm at times, effectively bringing out talent in an actor long overdue for a breakthrough.\n\nSo although Empire of the Sun is inconsistent in its tone and focus, Steven Spielberg's tenaciously stylish direction, John Williams' strong atmospheric musical score and the extensive talents of the cast keep it fantastic.",
            "review_date": "2013-04-06",
            "source": "rt"
        },
        {
            "content": "this is christian bale's best performance...^^",
            "review_date": "2013-04-05",
            "source": "rt"
        },
        {
            "content": "the art director should be fired as the  hair style of the driver was too \"communist China\" which is not quite  historically correct. moreover the refugees were too clean on their face. on the filming location it is imperfect that the building had been modified. lastly what the hack the local Shanghaiese spoke mandarin? the language of Chinese people something mandarin but as local and only a few old people in the scene was right. and I doubt the brand and type of car was right or not. in the camp the environment was far more better than real situation, did they read the history for the camp in Singapore and Hong Kong?",
            "review_date": "2013-03-31",
            "source": "rt"
        },
        {
            "content": "\"Empire of the Sun\" is an old Steven Spielberg movie about an English boy who at that time was in China with his family when the Japanese troops attacked during WWII. Believe it or not, the boy is Christian Bale, now better known for his role in Christopher Nolan's \"Dark Knight Trilogy\" as the hero Batman. As a child actor, he was really good. Apparently, he is, to this day, a method actor, meaning he always gets into the mind and emotions of the character he plays and understands them before filming starts. This is one of Steven Spielberg's better war movies, alongside his greatest, \"Schindler's List\". The camerawork is finely done, earning the film a nomination for Best Cinematography at the Oscars. John William's score is also sublime and spine-tingling. It seems that many of Steven Spielberg films would not have worked if not for William's score--except for \"The Color Purple\" of course. Overall, I thoroughly enjoyed this movie and will be listed among my top favourite war films of all time, alongside \"Schindler's List\" and Polanski's \"The Pianist\".",
            "review_date": "2013-03-28",
            "source": "rt"
        },
        {
            "content": "WWII internment camps are the finishing school for a young Shanghai-born British national, who identifies more with Asia (& Japanese Imperialism) than his parents' England.  Watch for Burt Kwouk and a young Ben Stiller.",
            "review_date": "2013-03-26",
            "source": "rt"
        },
        {
            "content": "I love this movie. Good story, good directing and a very good performance of Christian Bale at 13 year old. He should get an Oscar for this!! Shame, he wasn't nominated, really!",
            "review_date": "2013-03-26",
            "source": "rt"
        },
        {
            "content": "An underrated effort from Spielberg.  It can be overly sentimental at times but it works for the most part, being shot from a child's point of view.",
            "review_date": "2013-03-11",
            "source": "rt"
        }
    ]
}