{
    "rating": 8.9,
    "release_date": "1987-06-03",
    "num_reviews": 370,
    "genres": [
        "Crime",
        "Drama"
    ],
    "summary": "After building an empire with bootleg alcohol, legendary crime boss Al Capone (Robert De Niro) rules Chicago with an iron fist. Though Prohibition agent Eliot Ness (Kevin Costner) attempts to take Capone down, even his best efforts fail due to widespread corruption within the Windy City's police force. Recruiting an elite group of lawmen who won't be swayed by bribes or fear, including Irish-American cop Jimmy Malone (Sean Connery), Ness renews his determination to bring Capone to justice.",
    "reviews": [
        {
            "content": "Sean Connery is noteworthy and the rest of the cast is decent, but what makes The Untouchables memorable is Brian De Palma's ability to create brilliant screen tension, and David Mamet's violent screenplay.",
            "review_date": "2023-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely the most entertaining mafia crime revenge thriller is absolutely very bloody and violent but really outstanding performance and beautiful cinematography and really outstanding director.",
            "review_date": "2023-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie that moves around the mafia plot with great excellence.\nHas its highs and lows, but it truly is a good movie.",
            "review_date": "2023-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No need to comment anything, just watch",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": " It’s occasionally over the top but it’s well acted. As well as one of the best cops vs the mob movies.",
            "review_date": "2022-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really liked this movie and I'm glad I streamed it. Robert De Niro and Sean Connery acted amazingly as always and I loved the chemistry of the team and their moments together. Even though the dialogue was a bit clunky in a few scenes and wished that De Niro and Connery were in some scenes together, it still was more than enough with how it delivered itself in the more suspenseful, dramatic scenes. The chase on top of the courthouse building, the shootout in the train station, the scene when Sean Connery got ambushed and shot in the back ally or when they ambushed the liquor hand-offs, it was pretty much all magnificent!",
            "review_date": "2022-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film \"The untouchables\" directed by brian de palma, made in 1987 features well known cast members like Robert de niro and Kevin costner. It takes place in Chicago during the prohibition era where a gang member group lead by al capone was politically protected, causing him to rise in power. The movie also introduces the Chicago investigators, a group of special agents that was formed to put an end to al capone illegal activities. It can be described as a crime and mystery that includes touches of action when needed to make the movie more enticing. The way the move is structured allures the audience to want more, where in the end you will be satisfied you waited the two hours to finish it. \n\nWhat stood out to me the most was when the title of the movie \"the untouchables\" was mentioned. In the beginning the Chicago investigators refer to themselves being the \"untouchables\", meaning that they are undefeated. Though we find out later that this isn't true when one of al capone's gang members writes on the elevator walls \"touchables\" with the blood of investigator Wallace. After this, the movie becomes progressively more chaotic. We are presented with the perspective of one of Al Capone's men as we see him looking through a window at \"agent Jim Malone\". Essentially it has us as the audience anticipate what is about to happen. A big part of how the movie does this is how it's shot and by its music. The music and how its shot connects effortlessly, causing you to feel a sense of tension about how it will occur. It also moves through the scene quickly once we enter inside Jims home and eventually gets shot multiple times. The feeling gets left lingering when \"Elliot Ness\" approaches Jim in his blood, struggling to catch his own breath while slowly reaching out to grab something. This is a classic movie trope, yet every time makes you feel frustrated because you want it to go faster, having you question \"What is he trying to grab\" and how crucial it will be to the plot for us to know. The lighting in the movie as well was very vibrant, which was interesting because the overall theme was dark, though the contrast of the two makes the movie work nicely. \n\nAt the beginning of the film, I honestly was left wanting more. The build up to the good part took a while, so if you aren't patient this is not the movie for you. Though if you are someone who appreciates movies that are well shot and have a slow dramatic climax, this is for you! Personally I like movies that are more fast paced and if it's an action movie, go all out. Although, this is not only an action movie, it's mostly crime and mystery, which I think it did decently. I also felt the acting was a bit bland, although there were some scenes that did a great job. The scene where \"Elliot Ness\" is locking eyes with agent George and tells him to shoot his shot, perfect! It was the best scene in my opinion. Overall, I would give the movie \"The untouchables\" a 3.5/5.",
            "review_date": "2022-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the aspects of the film that really caught my eye was the wardrobe/costume design. Although the \"gangster pinstripe suits\" are a bit stereotypical or cliche, I think they really tie the characters together as a person. The suits feel old-timey which makes sense since that was the attire for a lot of people in that era. If the characters had worn modern clothing such as jeans and t-shirts, the movie would feel like it is all over the place. This aspect was one of the more noticeable ones especially as the characters were constantly in said costumes. Overall, I would give the film a 4 out of 5 stars. Although the film is inaccurate and dramatizes the events that lead to the eventual fall of one of America's most prominent mafia leaders, it does successfully paint a picture of the struggle and difficulty that law enforcement faced while taking down Al Capone. This was Brian de Palma's second film; the first being Scarface. Although this was his second film, it did feel like he had been directing for years.",
            "review_date": "2022-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The aspect that stood out to me in this video was the action and fight scenes plus the costumes they really fit with the story and personalities of each character. And I also like the music's response to the gunshots and violent activities. In my experience watching these kinds of movies is like watching Tom and Jerry as a kid for example the gunshots are similar to the movie when there were gunshots like the station shootouts (Spoiler Alerts). And finally, I liked the lighting in one scene with a store catching on fire had a sudden moment (Spoiler Alert).\n\nMy overall reaction to this movie goes like this I liked the action and adventure, and the character's beginning of the movie. If I were to recommend this movie to young viewers I would give them the chance to watch this movie but ask them if they have the courage to face the violent scenes plus the harsh and strong language. In my honest opinion, this movie feels too long I cannot complain about the quality of the movie since it was made in 1987, and besides, I had a hard time understanding what they are saying at the end of the important sentence of a scene. On a scale of 5 stars, I would probably give this movie about 3.5 stars out of 5 stars because my full reason for this is that the movie didn't have really great sound quality it was hard to make out words while they are speaking, and plus if viewers were watching this movie it would give other viewers a hard time to understanding what the characters, and also the movie was in color making it easier for me to see things that are easier for me and viewers to see the whole scene and where it's taking place and also black and white makes it difficult to see objects with shades of darker colors.",
            "review_date": "2022-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting in this movie was fantastic. They had a great selection of actors and brought the characters to life. Robert De Niro was a great choice for Al Capone, he really made the character feel threatening. The music was brilliant, very fitting for each scene and none felt out of place. The cinematography in this film is very well done. \n\nOverall I really liked this movie. The tension is build up of tension was executed brilliantly, especially during the final scenes of the movie. It was shot well, camera work was great. It's a brilliant dramatized version of Al Capone's capture that I think anyone who is a fan of classic gangster movies can enjoy. A nice and well done depiction of crime rings in the 1930's.",
            "review_date": "2022-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit of an overrated film that deals with a young detective taking down one of the most famous and violent gangsters of all time.",
            "review_date": "2022-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a good film that features a pretty impressive cast, including Kevin Costner, Sean Connery and Robert DeNiro. DeNiro as Al Capone is really quite sinister and its certainly a pretty gripping film in general. I was aware of the general story but not all the details and so I found this, I suppose, an insightful watch, although I can't be sure how accurate it is. There was one long scene set in I think Grand Central station, feautring a mother and a pram, that really did have me right at the edge of my seat. I thought the use of incidental music was quite well judged too - not too little and not too over the top. There are some nice settings/locations too. \n\nI would definitely recommend this film, yes.",
            "review_date": "2022-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Untouchables is a great movie, which brings together a great spirit, highlighting Kevin Costner, Robert de Niro, Andy García and the magnificent performance of Sean Connery with Jim Malone. The director takes advantage of the great cast he has, and creates a fascinating, fast-paced and very entertaining story, knowing how to exploit the qualities of his actors. The music is great, the scenes very well shot, and a supremely satisfying yet predictable ending. Undoubtedly, a jewel of its time.",
            "review_date": "2022-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really terrible movie with a stellar cast. The script was a nonsense its incredible how it received a release. When you think of a series like NARCOS it like a film school movie.",
            "review_date": "2022-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant and well-made gangster film. The action and suspense in this film are very outstanding. I love it!",
            "review_date": "2022-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really liked this movie and I'm glad I streamed it. Robert De Niro and Sean Connery acted amazingly as always and I loved the chemistry of the team and their moments together. Even though the dialogue was a bit clunky in a few scenes and wished that De Niro and Connery were in some scenes together, it still was more than enough with how it delivered itself in the more suspenseful, dramatic scenes. The chase on top of the courthouse building, the shootout in the train station, the scene when Sean Connery got ambushed and shot in the back ally or when they ambushed the liquor hand-offs, it was pretty much all magnificent!",
            "review_date": "2022-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film made a huge impact as a teenager when it was first released. I remember talking about it with my biology teacher. I was bad at biology, but she was one of the few teachers at the school who really took an interest in her pupils and formed relationships with us. I remember telling her how much I'd enjoyed 'The Untouchables', and her replying 'The best Western I've seen all year!'. \n\nShe was right, of course. There's much of the Western about it, and nothing about it that doesn't work together as a whole to expertly crank the tension to levels that are at times almost unbearable. It's moving too, with fleshed-out minor characters and a real sense of the stakes as the situation escalates. \n\nMy son, 19 years old with intellectual limitations, asked to watch 'a mafia movie' with me, and this was what I chose today. He loved it, gripped and engaged throughout. It ages well.",
            "review_date": "2022-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My 1000th film\n\nAll 6 years of using KinoPoisk, I was waiting for when, finally, I would get to the treasured thousand ratings. And now the time has come. I spent a long time choosing which film to bestow with such a title, and decided to turn to my favorite subgenre - gangster cinema, namely, to its only cult representative that I had not watched - The Untouchables.\n\nHigh expectations, although I usually try not to give in to them, this time was unavoidable. And it's not just about the numbering of the score. A film by Brian De Palma who directed the legendary Scarface, one of my favorite films, about my favorite era (20-30s), in my favorite genre, with one of my favorite actors (Robert De Niro) as Al Capone himself , and composers (Ennio Morricone), screenwriters Pulitzer laureate, and costume designer - Giorgio Armani himself - this cannot but excite.\n\nIn fact, I can not say that the film is bad - by no means. These people will never do anything wrong. The movie is good, but not great. It is too standard, licked, correct, schematic, simple and as if made according to a training manual. It's overly superficial and straightforward, very predictable and lacking in zest, and in this day and age, outdated. All the characters here are clearly divided into good and bad - each character has his character written on his face. Almost every action and event of the story is absolutely obvious and understandable - it's boring. I would like more disclosure of the same Al Capone, at least as a villain, because the main character is just despondency itself. The film lasts only 2 hours, which is not much for gangster films, but still manages to sag and be drawn out. Sean Connery pulls here and De Niro, although he performs a flat antagonist, and Costner has almost nothing to play here. Garcia walked by.\n\nThe atmosphere of the 30s is conveyed well, but the music is also insipid. I liked only the theme of Al Capone. De Palma's directing is no match for his previous work in Scarface. The feeling that he was holding himself back here in order to make an academic picture and like awards, but only Connery received an Oscar.\n\nAs a result, my thousandth assessment, unfortunately, will be a seven. It could have been worse, but I expected more. Not to say that I'm just disappointed - the film, I repeat, is not bad and, if you don't expect anything from it, you can read it once. And it just so happened that it was he who became a great anniversary for me. Well, it was my choice and I don't regret it. But now I have seen all the outstanding gangster sagas, with the exception, of course, of the classics of old Hollywood, but more on that some other time ...",
            "review_date": "2022-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though this movie *is* good and features 007 Sean Connery, Elliot Ness and The Untouchables well deserves it's four star review (p,s,) I gave it an extra 1/2 star because the collectible old cars used in this movie were all so fixed up and new and that's my only gripe!!!!",
            "review_date": "2022-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have seen many movies, and while The Untouchables is not the best movie of all of them, it is one I enjoyed enormously. There is so much to recommend it and I found it great to watch. The story is riveting and well constructed, and while he doesn't show off as such, a good thing in my book, Brian DePalma does let loose with some very inventive not to mention bloody set pieces. See the climax at the railway station for instance, while essentially a nod to the famous Odyssey steps sequence in the Battleship Potemkin, it was brilliantly done all the same. Speaking of DePalma, he does do a wonderful job directing.\n\nThat isn't the only reason why the Untouchables was such a hit with me. There are many more reasons. The dialogue is like crackling fire works, it is witty, intelligent and sophisticated, and some of it goes by surprisingly quickly. Ennio Morricone is one of the finest film composers ever, his score here is no exception, as it soars very like an eagle in full flight. And we have some truly sparkling production design, I love films with beautiful sets, scenery and costumes and The Untouchables scored highly in this area. Then we have very strong acting, Kevin Costner mayn't be to everybody's tastes but I think in his star-making turn he gave one of his better performances in this film. Andy Garcia joins the team with enthusiasm, and a plumped-up Robert DeNiro as Al Capone is wonderful as always. However, in my opinion, as the Irish cop who shows Costner the ropes, Sean Connery one of the most charismatic actors around gives the best and even perhaps most memorable performance here.\n\nOverall, a wonderful film, with an awful lot to recommend it. 10/10 Bethany Cox",
            "review_date": "2022-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Filled with iconic lines (‘he pulls a knife, you pull a gun!!') and equally iconic scenes (the nod to Potemkin's Odessa Steps in the train station), Brian De Palma's The Untouchables follows Agent Eliot Ness (Kevin Costner) and his group of ‘Untouchables' (Sean Connery, Andy Garcia, Charles Martin Smith) as they pursue the ruthless Al Capone (Robert DeNiro) in Prohibition-era Chicago.  Despite a sporadically irritating music score from Ennio Morricone and the sense that some scenes feel longer than necessary (the Ness/Nitti courthouse confrontation, for example), it's a fairly compelling crime drama featuring a great cast, some strong performances, great period sets and costumes, and enough action to keep things interesting.",
            "review_date": "2022-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good time piece on getting Capone on tax fraud.  How true, who knows?",
            "review_date": "2021-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie of all time. I love it.",
            "review_date": "2021-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice storytelling, although the silly and non-sense sequences ruins it. Sean Connery stole the show.",
            "review_date": "2021-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent crime flick glad to see the legendary gangster Al Capone so well portrayed on screen, score is very iconic and memorable",
            "review_date": "2021-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overall its a good movie but it just seemed a bit too cheesy and cliché at some points",
            "review_date": "2021-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All in all, there are many great things about this movie.  Great casting, great cinematography, and it's a greatly crafted period piece etc.  It falls short of being a masterpiece though.  My LEAST favorite part of the movie is the musical score.  There are moments where the music certainly makes the movie feel very dated.  Furthermore, there are other parts that could have been told better with a tense musical score instead of an \"action\" sounding backdrop.  This movie is not Indiana Jones.  Other scenes have a sappy sentimental musical backdrop that just didn't work for me.  I don't imagine that I'll ever take the time to watch this again.",
            "review_date": "2021-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't like gangsters movies, generally but... This is an outstanding Mamet's and De Palma's work ! Quite a perfect movie: great cast (my favourite actors here are Sir Sean Connery -his scene on the bridge where Malone meets Agent Nell!- first of all, followed by Bob De Niro -Capone at the barbershop!- both in excellent performances) and the cinematography too. This kind of criminal masterpiece is going to disappear on today's screens, unfortunately !",
            "review_date": "2021-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie. One of my favorites. Excellent cast, especially Costner and Connery. Great soundtrack to boot.",
            "review_date": "2021-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I swear to God this is a comedy.\nSean Connery was fantastic but made Kevin Costner's acting like a wooden doll in comparison.\nAn accountant gets to wield a shotgun around, hurray!",
            "review_date": "2021-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The untouchables by Brian De Palma adapts the story of Elliot Ness and his '' untouchable's '' gang of cops as they fight their way to put notorious Chicago mobster  Al Capone behind bars. De Palma here creates an exhilarating and powerful drama of cops vs the mob with some cheesy acting coupled with great action and intense bloody violence. The film stars some of the most prominent macho actors in recent cinematic history with Kevin Costner playing Elliot Ness the prohibition agent who brought down Capone, who plays ness as a by the book law and order agent who's not quite ready to face the wrath of the mob but is persistent in bringing justice and ending the carnage brought by Capone. Robert De Niro as Al Capone who has to be now one of the most celebrated and powerful male actors in cinema plays a very cheesy and perhaps cartoony version of Capone yet De Niro is able to humanize the man and show him as the powerful and sadistic gangster that he was. The best performance goes to the now late legend Sean Connery who plays a cop with a strong sense of justice , bravery, bravado, who steals every scene he is in. The script is great as written by the great writer David Mamet and De Palma's incredible direction of close ups and interior spaces and his signature bloody violence make this film a quite entertaining  and delightful piece of cinema.",
            "review_date": "2021-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film has a great cast with Kevin Costner, Sean Connery, and Robert De Niro. The score of Ennio Morricone is exceptional (like always) and I was surprised this film did not when for best original score.",
            "review_date": "2021-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is about Elliot Ness and the cops in The Prohibition, that is the answer for whom expected see \"mobs in a gunfights\" . Although the good efforts of Costner and Connery made it remarkable. 7/10",
            "review_date": "2021-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Director Brian de palma did a fantastic job capturing the look and feel of 1930s Chicago. Along with the stellar cast, the untouchables is top of the line in old school gangster films.",
            "review_date": "2021-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The problem isn't really that it's style over substance, rather that it is very uncertain style and never compelling, entertaining for sure, but very undecided, you can read it on Costner's face; De Palma surely makes it look like he has got everything under control (and from his point of view probably he does), but the plot is laughable as it is laughable De Niro's performance.",
            "review_date": "2021-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The cast did great and it had some cool moments, but I felt it the story was tweeked and De Niro got more screentime, I would of liked it more. All in all, it's okay but it is a bit overrated.",
            "review_date": "2021-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is overrated, not highly, but it got all too much attention prior to and during it's release, which there naturally is no prohibition against, it's only unfair against other and better productions or performers. Media was going wild about Robert De Niro as Al Capone, followed up by a new star in the making, the then so adorable Kevin Costner, but also that Sean Connory wasn't such a bad actor, truly getting rid of his Bond label. No disrespect for the late Scotsman, but there were others who deserved an Oscar for best supporting actor, but it was his, half as a token for him surprising people, and the rest due to the general hype psychosis. However, that's nothing new in Hollywood. The Untouchables is a solid fictional gangster film based on a certain part of history, nothing more. Still, there are two exceptions that should be named artistically great, the railway station shoot-out, which was a tribute to the Odessa Steps montage in Sergei Eisenstein's famous 1925 silent movie Battleship Potemkin. Also, any film gets better when Ennio Morricone makes the music score.",
            "review_date": "2021-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great old style gangster movie with terrific performances",
            "review_date": "2021-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can see why this movie would get a lot of praise. You got some big time actors here with Costner, Connery and De Niro and it takes place in Chicago during the Prohibition era with the gangsters bootlegging alcohol and so on. Yeah, that's cool I guess..  but really, this was a bit of a yawner. I liked some bits here and there(the US/Canada border bridge scene and pretty much all of De Niro's scenes as Al Capone), other than that.. meh.",
            "review_date": "2021-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best crime films ever made ",
            "review_date": "2021-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very entertaining gangster period piece. Great acting from heavyweights like Connery and De Niro, excellent script and stylish direction. I also love the Morricone score. In terms of historical accuracy, its a simplification of the time. Nonetheless it really captures the feel of the Prohibition Era and there are plenty of memorable scenes and set piece action moments.",
            "review_date": "2021-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an excellent invocation of Prohibition-era violence and the events that surrounded the takedown of Al Capone. Supported by a talented cast, there are some phenomenal scenes and an atmosphere of raw brutality where no blows are held back.",
            "review_date": "2021-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome acting and entertaining action.",
            "review_date": "2021-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie looked great visually, but it had almost nothing on the inside. The character development felt like the director was under the impression that he was making a action film, when he was in fact he was making a noir drama. The acting was dreadful, except for Sean Connery which says something. The characters felt so wacky and out there that sometimes I thought the 12 monkey music would start playing. Not enjoyable at all, but visually well crafted.",
            "review_date": "2021-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's great. De Palma on top form. Wonderful Morricone score. Connery does the worst Irish accent ever committed to film!",
            "review_date": "2021-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best gangster movies of 80th years. Even better than Scarface.",
            "review_date": "2020-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really solid gangster-cop outing. I found the score to be good but overdone throughout the entirety of the film. I also think the lead would have been better with a different actor than Costner. He’s great but I don’t think he was the best choice for the role. Connery was excellent though as was De Niro",
            "review_date": "2020-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slick and well made movie. Connery deserved his Oscar for his final scene alone - one of the great (Spoiler) movie deaths.",
            "review_date": "2020-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thirty years on, it's very noticeable how darkly comic Brian de Palma's gangster epic is. For all the blood and gunfire it has the kinetic energy of a 1920s Hal Roach two-reeler, underscored by David Mamet's penny dreadful pulp screenplay (excellent), and the way several of the set piece sequences are framed - flat on and with easily identifiable villains. Even Ennio Morricone's staccato score sounds like bullets and quicksteps - cartoony and meaning business. There are few subtleties, but with a cast as fine as this, who cares?",
            "review_date": "2020-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great gangster flick with plenty of memorable moments and performances.",
            "review_date": "2020-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredibly well acted film.A great script. Compelling protagonist. I would recommend you watch The Untouchables",
            "review_date": "2020-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sean Connery won the Oscar for Best Supporting Actor while Kevin Costner and Andy Garcia are playing parts you've grown used to seeing.\nIt's an over-De Palmatized (as in Brian) piece about the good guys taking on the bad guys and winning -- which is no surprise at all.",
            "review_date": "2020-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The untouchables is a great movie. This film has epic scenes, incredible soundtrack and very competent performances.",
            "review_date": "2020-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one deserves to be a classic with its clever moments and memorable characters.",
            "review_date": "2020-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well acted, fresh and powerful",
            "review_date": "2020-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Top-tier gangster movie absolute classic",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is one of the worst I have ever seen. My hopes were high considering it has good actors but it was by far the cheesiest movie I have ever had the displeasure of watching. It was full of cheesy one liners, glorification of police, misogyny, racism, and lacked humor entirely. I would not recommend this movie to anyone aged 1-100. If you are over 100 you may be just senile enough to enjoy this display or police brutality, horrible acting, cheesy, unrealistic  action, and the most boring portrayal of 1930s gangsters humanly possible.",
            "review_date": "2020-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This prohibition gangster flick is bottom shelf. Starts out decent but progressively devolves into more and more ludacris acting, storyline, and cinematography. You can chalk some of it up to the era, but ultimately it's only good for a bad movie night and some laughs.",
            "review_date": "2020-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Effective but again playing with history did nothing to help the film.",
            "review_date": "2020-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie. Not historically accurate but a lot of fun.",
            "review_date": "2020-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brian DePalma's film is great entertainment.  It's a tense battle played out vividly on Chicago's streets, with great music, sets and costumes.  It has a touch of comedy, some genuinely tender moments, drama and some melodrama, and lots of action.  Kevin Costner is great, and Sean Connery outstanding.  Because the movie is about the Untouchables and not about Al Capone, DePalma and Robert DeNiro made a good choice to spend very little time developing Capone's character, and instead do that brilliantly in just a few scenes of exaggerated, larger-than-life activity.  A reference for this genre,",
            "review_date": "2020-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid movie, great action sequences, Sean Connery is great and deserved the Oscar, and Morricone should have won the Oscar for his terrific score. But I did not like how they altered history, still worth your time.",
            "review_date": "2020-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seldom a film can be this straightforward. It's fun to watch and has a great production design, with some awesome performances. It's a quintessential 80's film, especially the score. But it has some weird editing and unreasonable plot sequences.",
            "review_date": "2020-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Within minutes you are drawn into 1930's Chicago. Authentic and entertaining, The Untouchables features a superb cast, an excellent screenplay, and scenery that works as the perfect backdrop. A brilliant, if not completely accurate, account of Ness vs Capone. De Niro, Costner, and especially Connery at their best.",
            "review_date": "2020-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rating: A-\n\n\"All in all, The Untouchables still holds up incredibly well after more than thirty years. Production-wise, not only the sets and costumes seamlessly resemble the Prohibition Era, but Brian DePalma's technically impressive blocking and framing are a joy to watch. Long, captivating, uncut dialogues are elevated by a remarkable cast (Sean Connery is undoubtedly the standout), despite Kevin Costner lacking a bit of emotional range. Even the action sequences of this 1987's movie look better than a lot of blockbusters of today. David Mamet writes a well-structured screenplay that rarely loses interest and featuring exceptionally compelling characters. Addictive score from Ennio Morricone as well. However, both Robert De Niro and his character, Al Capone, are underused, especially the latter. For such an important character who constantly changes the path of the narrative, the lack of screentime doesn't allow the viewer to understand Al Capone's motivations or feel how much of a threat he truly is. Still, it's a classic worthy of a rewatch, and I definitely recommend it.\"",
            "review_date": "2020-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although historically incorrect, The Untouchables is eventful and fun to watch. \nwith strong performances by De Niro, Costner and Billy Drago. \nThe Untouchables is certainly a must watch!",
            "review_date": "2020-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic movie with a great storyline and many dramatic moments. Performances are terrific, specially Sean Connery and Robert DeNiro, whose character could have been more relevant.",
            "review_date": "2020-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This thriller movie was very good. Kevin Costner, Sean Connery, Andy Garcia, Robert De Niro, and Charles Martin Smith did a spectacular job in this movie. This movie based on a true story was very suspenseful and dramatic. It's about taking down the most famous criminal ever by any means necessary. If you haven't seen this movie yet, check it out sometime. It's a definite must see.",
            "review_date": "2020-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic! A very entertaining film, which captivates from the beginning. The 1930s setting is stylish, there's quite a bit of ferocious violence and shootouts, but most of all, it retells a tough and amazing time in American history. And the movie's cast is indeed golden, it features a killer performance by Kevin Costner, he is so good as Elliot Ness, and Sean Connery is also very good, no wonder he win the Oscar for best supporting actor. Robert DeNiro is also quite bad ass as Al Capone. Overall, this film is another accomplishment from director Brian De Palma, who also brought us the horror film Carrie in 1976. A great pic and completely recommended!!",
            "review_date": "2020-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good, but lacks depth.",
            "review_date": "2020-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everything about it feels dated (screenplay, editing, music, acting), and Costner's one-dimensional character can't do much to save proceedings; even De Niro's portrayal of Capone feels uncharacteristically cartoonish.",
            "review_date": "2020-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It took a special kind of team to create The Untouchables. With Brian De Palma directing, David Mamet writing the screenplay, music by Ennio Morricone, and iconic performances from Robert De Niro & Sean Connery, this gripping drama rises above most other gangster films. Some moments may feel a little cliched, and no, it's not historically accurate, but this movie is definitely worth watching, if only to see the train station scene.",
            "review_date": "2020-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't care for \"historical\" movies that throw \"history off a roof.\"",
            "review_date": "2020-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A glossy look at the peak of the Chicago mafia era.\n\nThe number of A-listers appearing is surprising. Started this movie not knowing what to expect and loved seeing so many well-known faces. Though, seeing Andy Garcia act did make me want to hurl. The acting was cheesy in some parts. Take, for example, Sean Connery's horrendous \"Irish\" accent or breathing \"dead\" people.\n\nAttire and set design in this movie were visual eye-candy. Giorgio Armani did a nifty job making sure everyone's suit were a sign of the times and roles. Chicago was visually stunning and the movie portrayed the classical Windy City well.\n\nThe action scenes pepper the movie well and leaves enough to not bore.\n\nFor all its pluses, two things bothered me about this movie.\n\nFor starters, the cheesy musical score was distracting and felt ripped from a cheap 90s film. Nothing in the musical score was memorable or added much to the movie. I found myself more annoyed by the music than anything. Punches and gunshots sounded off and didn't match what was on screen. Out of all the money spent on this movie, more should've been spent on sound design.\n\nSecond, historical inaccuracies were glaring. The operation itself was a lot less flashy than what the movie makes it out to be. A lot fewer people died than what was in the movie. But this can be forgiven, Hollywood has to sell a story somehow.\n\nFor all that it gives and takes, this movie was a tough one to rate. I'll have to settle on a 3/5. Average at best. The movie aims too high above the bar and misses its mark.\n\nThough critically received at the time, this movie felt a bit too cheesy and cliche for my tastes. Scenes were predictable, music was horrendous, and Sean Connery's accent was damnable.\n\nI'd recommend this to those interested in Prohibition-era Chicago culture... but not for those with an eye for historical accuracy.",
            "review_date": "2020-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First time I have seen the cough (33 year old!) film about prohibition era Chicago and I enjoyed it. Unlike some of the more clever clog reviews.\n\nThe Untouchables was originally a television series but director Brian De Palma brings a successful film adaptation. \n\nThe film focuses on the gangland warfare between gangster Al Capone (Robert De Niro) and Federal U.S. Treasury agent Eliot Ness (Kevin Costner) brought into Chicago to snare Capone.\n\nNess forms an 'Untouchables' police unit with an older and wise Irish-American Malone (Sean Connery) and Oscar Wallace, a young Cop George Wallace (Andy Garcia) and a federal IRS like accountant?\n\nThe film is notable for the elaborate production design. I am thinking of scenes in 1930 Chicago including street scenes with period features, a Chicago courtroom and Chicago Grand Central railway station.\n\nA good musical score is presented by Ennio  Morricone that has elements of his Once Upon A Time In The West work.\n\nI don't usually endear to Kevin Costner's career opus in the late 1980s/1990s but he delivers a good performance here. In fact all the cast do in particular Sean Connery who won an Academy Award for this.\n\nAl Capone is played by De Niro. Watching De Niro strutting around and smirking got me thinking. He plays the same character in a lot of his films! In particular some of his collaborations with director Martin Scorsese.\n\nComing in at just under two hours, perhaps the film could have been beefed up with some other scenes?\n\n4/5",
            "review_date": "2020-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A flawless cast, de Palma's edgy direction and excellent art direction make this film remain emblematic and one of the best exponents of its genre.",
            "review_date": "2019-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would say this is 4 stars. The movie does have errors or flaws, its not perfect but it has real emotion that is raw and satisfying and some iconic sequences. The 2nd hour is better than the first hour. The movie perhaps should have been padded out a little and made longer as it is quite tightly packed and the plot seems to flow surprisingly quick making it seem a little too convenient to be true to real life. It also seems some of the emotion in the first hour feels forced and lacks gravitas. However the 2nd hour packs a punch, the music is great and includes some of the most memorable and iconic scenes in movie history. This film also has a sense of satisfaction. On a side note de niro was no great shakes in this movie and even when the movie is at it's best it also has an undercurrent of stress.",
            "review_date": "2019-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brian De Palma's career has been tumultuous as he experienced huge success with Scarface (1983), an unabashed celebration of violence, but a crushing defeat in The Bonfire of the Vanities (1990) which proved he didn't necessarily have a strong grasp on tone. This film falls somewhere in between as it contains beautifully choreographed action set pieces but struggles to decide whether it is a serious crime drama or a campy, over the top caper. This allows for some odd scenes as a scenery chewing performance from Robert De Niro, phoning it in, left me sickened come up against a bland, expressionless performance from Kevin Costner who displays the lack of charisma that would weigh down Bull Durham (1988) and Dances with Wolves (1990). I enjoyed the film but it didn't reach the heights of the crime epics it clearly aims to imitate and it was disappointing to see a director with such exuberance in his style of filmmaking bogged down by a subpar film.\n\nIdealistic police officer Eliot Ness, Kevin Costner, attempts to take down gangster Al Capone, Robert De Niro, in the era of prohibition but is fooled repeatedly and mocked as he begins his quest. He discovers that he will need to toughen up if he is to take down his enemy and enlists mentor Jimmy Malone, Sean Connery, to serve as his partner along with meek accountant Oscar Wallace, Charles Martin Smith, and fiery George Stone, Andy Garcia, to take the fight to Capone. The men are successful with their new freewheeling tactics but still struggle to pin any real blame on Capone and face constant threats to their families from him. After the murders of Malone and Wallace the two remaining members of the team are more motivated than ever to take down their primary target.\n\nThe film has several major assets with an excellent score from Ennio Morricone, beautiful cinematography from Stephen H. Burrum and the over the top choreography from De Palma but somehow this is lost amongst the film's attempts to appeal to a wide audience. One can't help feeling that for a film which so clearly delights in graphic violence it is odd to have such a generalized good guy who is supposedly anti-violence presented as our hero. De Palma is clearly more interested in the film's ostensible villain but this aspect of the film is let down by De Niro's scenery chewing performance which is not campy and enjoyable as it should be but painful to watch. The scenes of an underused Patricia Clarkson staring adoringly at a stolid Costner were so overplayed that they felt like a parody of sorts and the menace of De Niro is cut down by how much of him we see before the final act. I wanted to like the film more than I did but it was let down by these tonal issues and the misjudged performances which lean heavily on stereotypes and lack humanity.\n\nFortunately there are some scenes of note as De Palma doesn't lose all of the flair he brought to previous films with an homage to Battleship Potemkin (1925) and a violent chase on top of a courthouse being highlights. While the original is still more impactful De Palma restages an iconic scene with gusto as our fears for the gurgling baby are alighted as he slowly descends a staircase in his carriage and the carefully choreographed sequences of bullets flying every which way are damned entertaining. The shootout towards the end is helped considerably by the creepy appearance of Billy Drago as the appropriately titled Frank Nitti and the climactic descent of the character onto the pavement below is another clear homage to Rear Window (1954). It is hard not to be thrilled and exhilarated by these moments but sadly they are sandwiched in between scenes of incredible mediocrity which drag down the film as a whole.\n\nConnery won an Academy Award for his portrayal of a sagacious old Irish/Scottish? cop against relatively weak competition and although I can see the charm in this sort of old fashioned performance he doesn't bring anything new to the table. Similarly the entire film feels like a rip-off of other better films that I would recommend you watch instead of it.",
            "review_date": "2019-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid Hollywood movie. Some especially interesting shots. ",
            "review_date": "2019-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nowhere near as good as it’s been made out to be. Pacing is good and De Niro is fun, but Costner is wooden and the script is choppy. A lot of good actors doing not much.",
            "review_date": "2019-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A superb film that will always have a special place in my heart. \n\nA",
            "review_date": "2019-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The untouchables is one of the best crime movies. Good acting and plot. ",
            "review_date": "2019-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films of the '80's and arguably THE best Chicago movie. ",
            "review_date": "2019-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies ever. Connery more than deserved his Oscar. ",
            "review_date": "2019-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "De niro delivers another terrific performance. He's so good... That's it !",
            "review_date": "2019-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my most favorite movies ever. It's a mobster movie on the other side of the fence. Showing how difficult it was for Eliot Ness to take down Al Capone. This movie did add a bit of movie drama to the story with untrue facts like Frank Nitti jumping off the court building but overall recognized a lot that the real untouchables faced in their fight to quell liquor distribution in the roaring 20's and 30's.",
            "review_date": "2019-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horribly acted and directed.  Rivals the Baywatch remake for bad dialog and triteness.",
            "review_date": "2019-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The untouchables is a film based on true life events. Very good acting especially Kevin Costner as Elliott Ness. Very good characters personally my favourite is Al Capone played by Robert De Niro. Really good cinematography with a great shot toward the beginning. Good setting with Chicago in the 1930s. Very good set design and props with the guns and buildings. Very good costume design. Very good style with the colour scheme and the cinematography. Very good music conducted by Ennio Morricone. Really good action that is directed really well. Very good dialogue that fits with the era. Very good sound design that I noticed. Very good story. Good comedy between the characters. Good suspense especially with a scene with a baby in a carriage. There were a few little things that annoy me but they dont take away to much. Over all the film is really enjoyable and is based on true life events. Over all I give it a 8/10 - worth paying for two tickets",
            "review_date": "2019-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A would be classic movie until you read biographies on Al Capone. I don't have a problem with the acting, directing or any of that. It's just the way it's been written. There's very little in this movie that actually happened in real life. I know writers use a certain amount of artistic licence to make it interesting, but this is pretty much pure fiction. About the only two characters in this movie that ever really existed were Ness and Capone, who never actually met. So pretty much everything else that happens on screen with Ness's deputies who never existed is total BS. The evil Frank Netti assassin character in the movie (who Eliot Ness throws from the court house roof)  in real life was one of Capone's accountants. He committed suicide. The baseball bat scene was sort of true, although it happened in a kitchen with Capone's henchmen holding two victims down while Big Al did all the swinging. The Judge at Capone's trial swapped juries on his own accord after realizing they'd been paid off. I'm sure his descendants aren't too pleased at how he's been portrayed. I wish some Hollywood producer would actually read the true story of Capone's life and make a decent film about it. It doesn't need embellishment and fiction. The true story, as horrific and violent as it was, properly told would far surpass this script.",
            "review_date": "2019-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic gangster film with a hauntingly memorable Morricone score that pairs with fantastic displays of acting and an Oscar-worthy showing by Sean Connery for his moving performance. The only thing that sometimes creeps through that hindered the movie was the youthful exuberance of Costner that he couldn't escape making it a bit kiddish and when it worked in Silverado, not so much here, but it does work in the end; something does feel missing from his character though.  It could be too that his career was just on the rise and he was simply outshined by the likes of Connery and De Niro who had more experience. Nevertheless, De Niro really comes off as a very good typecast in this movie. It feels like after his roles in Godfather Part II and Taxi Driver he never stopped playing the same tough guy character...even in his comedies he is a retired tough guy, but to the tune of 300 million doing the same thing every day who wouldn't? I think this comfortably sits at the 90-95% range and will continue to age well and for those who enjoy the genre it is a must watch and must have.",
            "review_date": "2019-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This fictionalized account of Elliot Ness' time in Prohibition Era Chicago has stood the test of time.  More than three decades after it's premiere, the movie still delivers on every level.  The performances are uniformly excellent from a young Kevin Costner in one of his early roles to Sean Connery in a role that won him an Academy Award for Best Supporting Actor (and rightfully so).  What also helps this movie is that many of its scenes were actually filmed in Chicago and not on studio sets which just made me enjoy the film even more.  The script is terrific with well written dialogue and well staged action scenes.  There is a lot to like about \"the Untouchables\".  So much in fact that I don't have enough room to list them here.  If you have not seen this already, I highly recommend you do.",
            "review_date": "2018-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A commercial and artistic high point for director Brian De Palma (\"Blow Out\" \"Dressed to Kill\" \"Scarface\" \"Femme Fatale\"), working from a script by David Mamet (\"House of Games\" \"Glengarry Glen Ross\" \"Heist\" etc.) and featuring Kevin Costner in his breakout star making performance as prohibition era crime fighter Eliot Ness. There's little historical accuracy to the film, but who really cares about that when there is so many other things to love about the film. Besides the above mentioned assets, you have an incredibly strong cast led by Coster as an idealistic Ness, who's joined by honest beat cop Jim Malone, a wonderfully over-the-hill Sean Connery, a rookie cop recruited straight from the Academy who hasn't been corrupted yet (\"If you're afraid of getting a rotten apple, don't go to the barrel. Get it off the tree.\") played by a young Andy Garcia (\"8 Million Ways to Die\" was his only other major credit before this), and capped off by Robert De Niro packing on a ton of weight to play Chicago gangster Al Capone. Incidentally, De Niro started his career with director Brian De Palma well before he made Mean Streets\" with Martin Scorsese, so it's a treat to see the two reunite. Besides the strong leads, you also have Charles Martin Smith, Richard Bradford, Billy Drago, Patricia Clarkson, Del Close, and even Clifton James (the tobacco chewing sheriff from \"Man with the Golden Gun\" and \"Live and Let Die\") all in memorable parts, so it really is a cast to die for. In addition to a sharp script, an amazing cast, you have some serious talent behind the camera that includes cinematographer Stephen H. Burum (\"Rumble Fish\" \"Carlito's Way\" \"Hoffa\"), composer Ennio Morricone (\"The Good, the Bad, and the Ugly\" \"The Mission\" \"The Hateful Eight\"), set decoration by the guy who's everything from Disney's \"Mary Poppins\" to \"Back to the Future,\" and the editor of \"The French Connection\" \"Apocalypse Now\" and \"Scarface,\" but the real hero behind the camera is director Brian De Palma. The sets, costumes, music, and overall period atmosphere are amazing, but it's the visual stylistics from De Palma that make this film a classic. Without spoiling anything, the Pagliacci scene and the Sergei Eisenstein inspired baby carriage scene are moments of pure cinema (meaning they are scenes that would be impossible to capture or recreate as effectively in another medium. Not written word, not painting, not stage play, not graphic novel, etc.). Although a major studio film, this is unmistakably a Brian De Palma picture. \"The Untouchables\" is minus his usual obsessions around voyeurism and sexuality, but the film does have his trademark fascination with violence (\"They pull a knife, you pull a gun. He sends one of yours to the hospital, you send one of his to the morgue. That's the Chicago way!\"), guilt/betrayal (most all of the characters are motivated by some form of guilt), as well as his many visual hallmarks (camera zooms, slow motion, and memorable POV shots). De Palma's fingerprints are all over the film, especially the \"Battleship Potemkin\" inspired train station shootout with a baby carriage bouncing down marble steps amongst a hail of slow motion gunfire. According to Mamet, the scene was not in the original script and was added by De Palma, but this particular scene ends up being the most memorable of the film. It's De Palma's signature suspenseful build-up that makes the scene so effective. In lesser hands, this 10-minute sequence might have been a straight forward shootout, but with De Palma it achieves operatic levels, with about a dozen moving parts all contributing to mounting suspense as he turns the screws on the audience, stretching out about 10 seconds of real time action into a two minute slow motion action masterpiece. Whether it's a bucket of pigs blood above Carrie's head or Tom Cruise trying to catch a bead of sweat, De Palma builds suspense better almost anyone. What makes \"The Untouchables\" different from many of his other films is its emotional center, which comes from an earnest performance by Coster and Mamet's carefully plotted script. Many of De Palma's films seem at times mere exercises in cinematic stylistics and explorations of his various obsessions, but his best films have an emotional center, which I would say are \"Carrie,\" \"Blow Out,\" \"Casualties of War,\" \"Carlito's Way,\" and this film. Overall, from the the stylish opening credits to the soaring finale, \"The Untouchables\" doesn't have a single false note. This is the film that De Palma will be remembered for and deserves to be recognized as a true American film classic. SIDE NOTE: Rewatching the film 2018, I was struck by how \"1980s\" this otherwise very authentic looking period film seemed.",
            "review_date": "2018-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good, but historically inaccurate",
            "review_date": "2018-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kevin Costner and Sean Connery kick Capone's ass in this movie! ",
            "review_date": "2018-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An old-school kinda goofy gangster flick is never what you think it would be when there is a remarkable filmmaker like Brian De Palma behind the camera. Alongside with Spielberg's Raiders of the Lost Ark, The Untouchables proves that old-style action movies is far from being dated. In fact, they are nothing but timeless.\n\nThe Untouchables is a deeply entertaining cop/mob movie. But what made it stand the test of time, besides its A-List cast, is its unique, and exceptional direction by none other than Brian De Palma. There is no shortage of De Palma's trademarks and his own visual style, nor his way of creating the tension that shouldn't be considered far behind Hitchcock's. But I don't think I've been shocked so many times in a movie before like here. The Untouchables's zany humor and wackiness can't make you think for a moment that it can be so brutal like that. It's like you know you're watching a PG-13 movie then all of a sudden comes a ruthless scene filled with gore and blood.\n\nBut what impressed me the most in this movie is how Brian De Palma simply could made us think \"The Untouchables\" are very touchable, and their mission is impossible to be done just by showing us a scene featuring the pure evil, Al Capone. De Niro's lunatic over-the-top performance was more than enough to make the viewers feel worry as much as the titular team.\n\nThe issues I've with this movie are with the silly and ridiculous nature of this movie. Yes, this very thing that I've praised above. Because halfway through the movie I think De Palma went too far making the movie's tone so absurd and ludicrous that you have to turn my brain off, while the movie didn't ask me to do so. Especially when the movie contains some very serious and emotional moments that worked so well on their own. So I felt there is a lot of inconsistency, and the tone could have been balanced way better. That being said, I enjoyed the entire movie even its brainless moments.\n\nIt would be unnecessary to mention that all the performances are superb. But Kevin Costner's performance helped flesh out his character, Eliot Ness. Speaking of which, all the characters are well-established, and have enough depth to serve the plot and to make you care about them.\n\nThe end is a little bit rushed, and could seem implausible for some. But I think it makes all the sense looking back on all what have been established throughout the movie.\n\nThe Untouchables is not Scarface, but it offers a genuine entertainment that can't be resist. Can't wait to see more of De Palma's work, let alone Domino that will be released later this year.\n\n(8.5/10)",
            "review_date": "2018-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Untouchables, a movie I only recently watched, included an incredible cast, with the likes of Robert De Niro, Kevin Costner, Sean Connery and Andy Garcia, with a fantastic script and an action-packed plot that serves it's purpose flawlessly. Sean Connery shines with a witty and aggressive yet intelligent and charming performance that truly earned him his first and only Oscar, while Robert De Niro shines as Al Capone with his charismatic yet cruel and cunning performance that truly demonstrates the power of the legendary gangster. Kevin Costner creates a determined and strong-willed character whom faces the adversities of death and loss on his quest to destroy Al Capone and his empire of injustice, and Andy Garcia demonstrates a laid-back yet aggressive character that is not as compelling as the other three main cast members but still is effective. A fantastic commentary on Chicago in the 1930s, this movie has become a personal favourite of mine and is nearly flawless in it's purpose and plot.",
            "review_date": "2018-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite a rather underused Robert De Niro as Al Capone Brian De Palma’s The Untouchables is a slick and entertaining thriller that deeply looks into the Chicago crime life and has fantastic performances from Kevin Costner and Sean Connery. ",
            "review_date": "2018-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest gangster films ever!\n\nNotably, Brian De Palma directed his masterpiece with his 1987 movie The Untouchables. Crime films reached their peak with movies like The Godfather, Gangs of New York, Heat, and The Untouchables. L.A. Confidential (1997) certainly was influenced by The Untouchables. The deep dive into the mindset of good law enforcement is commented on in this movie. It's style is reminiscent of the aforementioned movies, while creating an atmosphere all its own. The Untouchables goes full noir style police work. You get to watch what Eliot Ness had to do to catch notorious mobster Al Capone.\n\nVisually, The Untouchables contains some of the most memorable and skillful cinematography ever captured on film. The opening alleyway raid is so tense right off the start. The scene in Sean Connery's apartment is so suspense and nerve racking as we get long pans up and down his hallway. The finale at the train station's stair is as violent and exciting as any shootout. The camera is always showing emotional close ups or characters in the foreground speaking while we get the reaction of someone in the background. Endless clever and creative camera work is on full display throughout The Untouchables.\n\nMusically, Ennio Morricone composed the most thrilling score for The Untouchables. There is grand classical music to build up an air of class, while some sultry jazz might be playing elsewhere. The suspense is multiplied by the anxiety inducing score underneath the most tense scenes. Morricone proves he is still a genius with this score.\n\nFurthermore, the attention to detail that De Palma went to recreate 1930 in Chicago is astounding. You get to see many Chicago landmarks and familiar spots that build a sense of verisimilitude. Giorgio Armani did all the gorgeous costumes and suits that create a sleek style and continue the realism of The Untouchables. You actually believe you are there.\n\nIndeed, The Untouchables boasts a brilliant script with many lines that will stay with you. You feel the audacity of Al Capone and the bravery of Eliot Ness. There are moral and legal lessons to be learned within, but you always feel like these characters would speak like how The Untouchables is written.\n\nLastly, The Untouchables has one of the most well cast ensembles in film. Kevin Costner delivers his most humane performance as the stalwart Eliot Ness. Charles Martin Smith plays the most lovable accountant officer on film. Sean Connery astonishes and delights as the  experienced beat cop Malone. Andy Garcia is a compelling rookie cop that is hellbent on catching Capone. Billy Drago is perfectly cast as the creepy murderous henchmen to Capone. Finally, Robert De Niro is monstrous and threatening as the ever boastful Al Capone. The Untouchables stars some of the greatest actors ever as their best. It is a pleasure to watch them work.\n\nOverall, Brian De Palma did a fantastic job directing The Untouchables. This movie holds up with its imaginative direction, suspenseful sequences, thrilling shootouts, clever investigation, deep characterization, lovely music, stylish suits, painstaking recreation, historical accuracy, apt casting, and genius acting.",
            "review_date": "2018-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "that's the chicago way..\n\nThe Untouchables\n\nThere are some nail biting sequences created that leaves you with an awe but for the rest of the feature the character link and the world portrayed is weak contrary to its premise. Brian De Palma chews off too much for his characters that sometimes comes off as a bit slow and downer for the audience especially when the script is wafer thin. Kevin Costner; as the protagonist is convincing but the real game changers are the supporting cast i.e. Sean Connery and Robert De Niro. The Untouchables; being of course a character driven feature, doesn't seek attention especially in its first half that is barely standing on any grounds and is fortunately saved by the second half where things get brutal, up close and personal offering the perfect amount of drama that was essential all along.",
            "review_date": "2018-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie that taught me to never bring a knife to a gunfight.",
            "review_date": "2018-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great old fashioned mob movie with a terrific performance from Connery.\nAlso, Bobby De Niro has a small role as Capone and is very impressive.",
            "review_date": "2018-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wish it had more Al Capone",
            "review_date": "2018-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fairly standard but still solidly made crime drama with a level of violence that is frankly shocking. Some of the shit Sean Connery's character does in this film is crazy.",
            "review_date": "2018-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some good performances. The tone is quite weird, in some parts it's trying to be noir but other parts a bit of a different feeling - almost camp.",
            "review_date": "2018-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fantastic, suspense filled movie with great performances.",
            "review_date": "2018-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is probably my favorite mobster movie. Yes, better than the Godfather parts I and II. Sure Kevin Costner's acting is.... Kevin Costner's acting (meaning dry) but I find it a lot more redeemable and justifying character and story wise than the Godfather films. ",
            "review_date": "2018-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok movie starring Kevin Costner about al Capone and I already forgot about this movie.",
            "review_date": "2017-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you're looking for anything factual or authentic, you might not be looking in the right place. But if you're looking for some white knuckle, high-octane, Hollywood popcorn fun, and a satisfyingly pissed off Sean Connery to boot, then welcome to Brian De Palma and David Mamet's \"The Untouchables,\" one of cinema's premier gangster flicks, and deservedly so. It's endlessly quotable and ruthlessly staged, featuring some beautiful camera work and a wicked score from Ennio Morricone. They rarely make them like this anymore, if ever.",
            "review_date": "2017-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Connery was terrific in his role. not sure why I hadn't seen this movie sooner, great film",
            "review_date": "2017-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gripping, suspenseful and well-acted, \"The Untouchables\" is one of the greatest gangster movies ever made. Brian De Palma's crime classic offers an insightful look at crime during the Prohibition era. It features fantastic performances from an all-star cast. Kevin Costner delivers one of the finest performances of his career as a lawful cop. Sean Connery is marvellous and steals nearly every scene as a corrupt cop. Then there is Robert De Niro, who is almost unrecognizable in the role of Al Capone. With his menacing expressions and larger than life presence, De Niro is absolutely unforgettable. Although the ending is over-the-top and unrealistic, \"The Untouchables\" is a must-see for fans of the genre. If you are a fan of the gangster genre, lets just say that you won't be disappointed by this film.",
            "review_date": "2017-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film! Truly a classic gangster thriller!",
            "review_date": "2017-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brian de Palm is one of the directors who most copied the best sense of the word- Alfred Hitchcock, and \"The Untouchables,\" is a gangster psychological thriller, is a thought-provoking movie, full of features and good performances, although extremely caricature and dated. The script tells the story of Al Capone from the point of view of his executioners, who despite all the crimes committed by the dry law kingpin, he was convicted of tax evasion, a story so incredible that it looks like a sweet fiction, though Extremely flowery and romanticized, in very general lines, the story is true. The screenplay tells the story of four men, an accountant, an almost retired police officer, a police officer who has not even finished the academy yet, and a treasury agent, all obstinate to capture Al Capone. We have betrayal, death and demonstration of power, and how simply the act of taking away the drink (drink) of people would cause chaos and gigantic contraband, proving also that in the case of alcohol, the restriction only created a parallel market. Technically, the film has footage that looks like a 1950s movie, and that's nice, although sometimes I'm a bit of a shame, because Hitchcock's style is copied, and copied very well, we have an exquisite camera job, With prefect angles, plans sequences, against plounge, always privileged the suspense, in addition to a soundtrack that has a beautiful song and very good (even being one of suspense in a film of mafia,) already the rest of the track often gets half Dislocated from the rest of the film, but Brian always makes a point of guiding the scenes from his extremely varied track, which refers to the western to pop music, we also have a beautiful photograph that shouts that the film was made into film, it is a film Which already causes nostalgia, even for the 80's. Kevin Costner is excellent, conveying an air of patriotism and honesty blended with anger, which suits his partner, and the film's great highlight in terms of Performances that is the wonderful Sean Connery, ale more, even if with little screen time, Robert De Niro is giant and completely scary when it appears. Brian of Palm is sure to have traumas of his great \"Scarface\" to be completely ignored of the great festivals and even of big cinemas due to its violence, with that, in \"The Untouchables\" he censures the violence and diminishes the very concept of it, and This harms his film because it takes away the terror of Al Capone's actions by taking the fear out of his viewer (even in the taco scene, which was done precisely to make the viewer feel the fear, does not work because it is badly made, and even in the Viscerality is silly); finally, \"The Untouchables\" is a good suspense thriller mafia movie, which appeals too much.",
            "review_date": "2017-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though it was not very accurate, this movie was entertaining, with an all star cast that lives up to expectations, and good action scenes.",
            "review_date": "2017-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best part of this movie is definitely Ennio Morricone's beautiful score, which reflects the decadent mobster world this movie portrays. That's not to say that the story, acting, direction, and every other part of this aren't all near perfect as well.",
            "review_date": "2017-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exciting to look at, but a rather boring watch, with dull performances (save Connery) and a thin script lacking characterization-yet the score and DePalma's typically dazzling camerawork bolster the lackluster.",
            "review_date": "2017-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Untouchables is fantastic! Brian De Palma definitely knows how to direct action sequences. This film also has a very good script. The acting is amazing, especially from Sean Connery, Kevin Costner, Robert De Niro, and Andy Garcia. This film has a lot to offer and definitely one of the best mob movies of all time!",
            "review_date": "2017-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Featuring one of Sean Connery's best performances, the film also boasts memorable shoot-outs including The Godfather meets Battleship Potempkin finale complete with falling pram. Interestingly, Clifton James (Sheriff J W Pepper from the Roger Moore Bonds) plays a lawyer.",
            "review_date": "2017-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Grade - C\nAlthough 'The Untouchables' has its redeeming features, ultimately it's not that good. Some poor performances and a weak script stop it from reaching its true potential.",
            "review_date": "2017-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I want him dead! I want his family dead! I want his house burned to the ground! I want to go there in the middle of the night and piss on the ashes!",
            "review_date": "2017-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crowd-pleasing version of the legendary television series benefits from exceptional direction by Brian De Palma and a good script by David Mamet that doesn't feel at all like a script by David Mamet.",
            "review_date": "2017-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Highly fictionalized, but great story about Eliot Ness & his Untouchables. Outstanding direction from Brian De Palma, great sets & costume design by Giorgio Armani. Sean Connery does a lot of scene-stealing and Robert DeNiro isn't in it enough",
            "review_date": "2017-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A gangster classic, The Untouchables has nice touch to the TV series with Sean Connery as Jim Malone and Ennio Morricone's score to this action-filled flick",
            "review_date": "2017-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best period gangster films going its just a shame that this story of elliot ness is a complet work of fiction",
            "review_date": "2017-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Remains a classic mob flick as corruption still in grasp of modern times. Kevin Costner in his prime played Agent Ness, but it is Connery who steals the show as a veteran walk-beat cop Malone. Takes a vice adversary to make a great story, and the movie presented De Niro getting Al Capone role. The thrill ends long after the credit roll.\n\nEnnio Morricone arranged the sound department, he did it so eloquently accompanying the scene here and there in harmony. We would reminisce his work later in Hateful Eight.\n\nDignity doesn't made up overnight, it needs a driven composure to persevere the integrity in the long shot.",
            "review_date": "2017-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Featuring one of Sean Connery's best performances, the film also boasts memorable shoot-outs including The Godfather meets Battleship Potempkin finale complete with falling pram. Interestingly, Clifton James (Sheriff J W Pepper from the Roger Moore Bonds) plays a lawyer.",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The untouchables is a movie of sensibility and setting. It doesn't do much to heighten the graphic nature of living as a gangster, but it provides an epic plot to highlight the daring stand made by law enforcement during the prohibition act.",
            "review_date": "2017-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Untouchables features a plot that has been done countless times, but executes firmly in Brian De Palma's slick direction, filling the movie with suspenseful moments, awesome shootouts, and well-rounded performances.",
            "review_date": "2016-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Violent, long and slow",
            "review_date": "2016-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An entertaining and very well directed gangster/crime thriller with excellent performances given by all cast members.",
            "review_date": "2016-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Untouchables is a crime story following Eliot Ness and his rag-tag team of \"untouchable\" men who cannot be corrupted, in their mission to bring down gangster, Al Capone during 1930's Prohibition. The film is based off of the real Eliot Ness' memoir and is directed with ferociousness by Brian De Palma who crafts a gritty, street-level cop film that has a shaky first half, but really picks up momentum in the latter half and becomes something truly memorable. Kevin Costner leads the cast, including Andy Garcia, Charles Martin Smith, Patricia Clarkson, Robert De Niro as Al Capone, and Sean Connery as the fourth, and most bitter, member of the Untouchables in an Oscar-winning role! Connery really nails it as the take-no-shit, grump and easily steals the movie, De Niro on the opposite spectrum plays it over-the-top, though he's not in the film much so it's easy to look past. The real highlight of the film is the gritty violence and there are many stand-out moments, including a truly suspenseful sequence at a train station involving a big shoot-out and a runaway baby carriage! As mentioned, the first half of the film is a bit uneven, and most of that is due to the bizarre music choices that turn dramatic moments into cheesy, almost lighthearted affair and the constant tonal shifts really made it a struggle to connect with. All in all, The Untouchables is a pretty good cops vs. gangsters film and the period setting helps it tremendously. The acting is great, the directing is creative, and the shoot-outs are worth seeing!",
            "review_date": "2016-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ambitious, flawed gangster film\n\nThe Untouchables might be said to be less than the sum of its parts. Certain of those parts are very good indeed: Sean Connery gives an Oscar winning performance as a street-wise Irish-American cop, Robert De Niro is unforgettable as Al Capone (though he's not actually on screen that much), the atmosphere of Prohibition-era Chicago is elaborately and convincingly realized, and certain of the cinematic set-pieces, like the justly famous midnight shoot-out in Chicago's train station, are about as good as they can be. But against this, Kevin Costner's performance as Eliot Ness is wooden, the scenes with his family seem too goody-goody, as if the film were straining to make a point of the decent values he's defending, and, with the exception of Connery's character, it's hard to feel much empathy with either the good guys or the bad guys. All in all, an ambitious film which ends up being a bravura piece of film making but a good, not great, gangster movie. Rated R for occasional language and lots of graphic violence. Available in various DVD issues, including a recent Blu-Ray; I saw it on the 2004 Paramount standard DVD Collector's Edition, and I thought the DVD quality was very good.",
            "review_date": "2016-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shittiest and cringiest movie Ive ever seen in my life. 2 hours that I ll never gain again.",
            "review_date": "2016-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well-acted albeit traditional crime story.",
            "review_date": "2016-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining film with an A-list cast.  Fared better than Geraldo's special The Mystery of Al Capone's Vaults, which aired a year earlier.",
            "review_date": "2016-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overall underwhelming. A-List actors don't bring anything remotely A-level. DePalma disappoints. At least Morricone delivers.",
            "review_date": "2016-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Gangster film",
            "review_date": "2016-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An insultingly cartoonish simplification of America's prohibition era, that's irrevocably raped by the worlds worst actor, Kevin Costner. Definately the worst Brian de Palma ever. What the hell was he thinking??????? I mean the same guy made Scarface FFS. Not even Connery or De Niro can help pick up the pieces. Okay, I'll be fair, there is one good bit in this shit storm, the baby carriage scene, but that's it.",
            "review_date": "2016-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How violent are these mobsters? A pretty decent film nonetheless.",
            "review_date": "2016-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never seen this before but I really enjoyed it.  I can see why many laud Kevin Costner's performance.  A great cast and a classic movie.",
            "review_date": "2016-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The whole movie is just dumb and childish. Robert DeNiro doesnt give a damn. Apart from a couple of scenes where i must admit i was entertained, its an overrated film that has no subtlety.",
            "review_date": "2016-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Untouchables is exciting, but at the same time dark and thrilling while also featuring a fantastic cast filled with great performances!",
            "review_date": "2016-02-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Untouchables is a movie that should work perfectly for me. It has a classic story of a small group of good guys who seem to be taking on the whole world, it has amazing scenes that are emotional and intense, and it has a great cast. In fact I really did like the movie a lot. Sean Connery was better than words could possibly describe. Andy Garcia and Robert DeNiro were stellar as you'd always expect them to be. Even Charles Martin Smith was perfectly cast as a nerdy accountant who finds the financial loophole to catch Capone. The only problems I have with this movie are 2 things, but they kept taking me out of the movie and I'd have to struggle to get invested again. First of all was the music. I'm not sure what Morricone was thinking here, but there are scenes where the music is extremely out of place and it changes the tone of a scene from dramatic to silly. And there was a couple other scenes where the music was overly dramatic and telegraphed the events that were coming. It's not something I ordinarily point out in films, but the fact that it stood out so much to me should attest to how distracting his score was in The Untouchables.\n\nThe other, perhaps even bigger flaw is Kevin Costner. I don't ordinarily have a problem with Costner starring in a movie, but there wasn't a single second where I was convinced of his performance in this movie. He was not the right person to play Eliot Ness in my opinion. He was flat and awkward, and I just couldn't figure out what he was doing. His facial expressions barely shifted from a scene where he was supposed to be in deep mourning to a scene where he was furious with rage. There were a couple of scenes where I found myself laughing involuntarily, because the line delivery felt so wrong. I don't know what it is, because at the beginning I thought he was perfect as the straight-laced cop who wouldn't dare to bend the rules. The problem is when his character was supposed to start shifting, I just wasn't seeing it in his performance. It's tough because he's on screen with so many others that are knocking it out of the park, but he did nothing for me. (On a side note: It also didn't help that I recently saw Naked Gun 3 and that movie has an opening scene which directly parodies the baby carriage/train station sequence. I seriously had to fight to avoid cracking up when I saw it here.) The plot of the film, and the other great performances lifted it up so I still enjoyed the experience of watching, but I think it could have been truly great if a couple of different decisions were made in the production.",
            "review_date": "2016-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brian DePalma's mob movie is led by a great cast of Coster, Connery, and De Niro. Making The Untouchables a sure fire hit!",
            "review_date": "2015-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nice action/thriller but at sometimes felt a little sugarcoated. Would have  preferred it to be a little darker. Cool plot and exciting tense moments!",
            "review_date": "2015-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hollywood has always loved outlaws, from Billy the Kid to Bonnie and Clyde, and the outlaws that it has most consistently loved are gangsters. Gangsters tick all the boxes for classic Hollywood antagonists: they're stylish, dangerous, well-spoken, they combine history and nostalgia for the 'good old days' in the old country with weapons and schemes that are quintessentially modern. Quentin Tarantino was right when he called gangster films \"parodies of the American dream\": they hold up a mirror to American society and its ideals, letting it either question its very foundations or revel in its dark underbelly.\n\nIt's ironic, therefore, that despite decades of trying, Hollywood has never really done justice to Al Capone. Numerous directors have tried, including trash maestro Roger Corman, but Capone has always worked best as an incidental character in other people's stories. The Untouchables may enjoy a better reputation that Corman's work, thanks in part to Sean Connery's preposterous Oscar win. But it's still an immensely flawed beast which is watchable and empty in equal measure.\n\nPart of the reason for the lack of a definitive on-screen Capone may because he has become the cliché of the Hollywood gangster. When Mark Gatiss and Steven Moffat were creating Sherlock, they deliberately steered away from making their version of Moriarty identical to those in the original stories; they reasoned that, since he was the first supervillain, to whom every subsequent supervillain owes a debt, he had become the cliché and wouldn't scare audiences as he originally had done. Capone, the argument goes, has become a caricature, a parody of what American gangsterism means, so that any attempt to present him seriously could be unintentionally risible.\n\nIf we buy this line of reasoning, one of the greatest failings of The Untouchables is that it fails to deal with this problem. Casting Robert de Niro may have seemed like a no-brainer, given his brilliance in The Godfather Part II as the younger Don Corleone.  But the part came at a time when de Niro was tired of playing gangsters, and had sought to diversify his portfolio through roles in Brazil and The Mission. What we get feels like a bizarre self-parody of de Niro's past roles, complete with his trademark repetition of lines - the 'I wan' 'im dead!\" rant after the border raid stands in for the famous \"are you talkin' to me?\" speech in Taxi Driver.\n\nDe Niro's creative decisions aside, this is also partially down to David Mamet's screenplay, which is muddled and conflicted. The film cannot decide whether it wants to be a style-over-substance, silly gangster film, with all the stock characters and plenty of shoot-outs, or a serious drama about having to go above and beyond the law to bring someone to justice. De Niro is indulged during his scenes and comes across as more comical than threatening, with the score telegraphing to the audience how to feel in the baseball bat scene. When he's not on screen, Mamet tries to make things more macho, but here he is undone by another bad performance: Kevin Costner.\n\nWhile de Niro is coasting (and Connery is largely playing himself), Costner is the dictionary definition of trying too hard. His critics like to assume that he became overly serious as a result of the Oscar success of Dances with Wolves, but the truth is that he's always been a wooden and limited actor. His performance as Eliot Ness is drab and dreary, having neither the presence nor the moral ambiguity of, say, Gene Hackman in The French Connection, which is what the role calls for. He spends the whole film with one facial expression (somewhere between bored and \"but my Dad thinks I'm good\"), and his line readings are flat and unconvincing. In the words of Sheila Benson, writing in The Los Angeles Times, \"to Mamet and De Palma, goodness and dullness seem inseparable.\"\n\nAdmittedly, however, not all of The Untouchables' failings can be pinned on Mamet, Costner or de Niro. Some of the blame must lie with Brian De Palma, whose work from Scarface onwards is an emphatic case of style over substance. Where Martin Scorsese or William Friedkin would have properly marshalled their actors, building an intensity with the characters first and foremost, De Palma always seems more concerned with constructing incredibly stylish death scenes or paying homage to his favourite directors. Tipping one's hat to Battleship Potemkin does not in itself make the train station showdown exciting, and the use of slow-motion is less effective at building tension than the quiet minutes leading up to it.\n\nThroughout his career, De Palma has always been fascinated by death; he likes putting his characters through the mill, as his idol Alfred Hitchcock did before him, and staging beautiful demises for them complete with razor blades, guns and plenty of stage blood. The train station offers a lot in this regard, with carefully positioned squibs, broken glass and blood practically oozing from henchman's mouths.\n\nBut the ne plus ultra of this is the gunning down of Malone, which is every bit as drawn out and ridiculous as Alan Rickman's pantomime death scene in Robin Hood: Prince of Thieves four years later. We start with a protracted nod to Hallowe'en in the use of first-person steadicam, and end with one of the most contrived farewells of two characters in Hollywood history; no man, riddled with that many machine gun bullets, could have survived that long, let alone been in a position to relay such a vital detail.\n\nIn amongst all this indulgence and over-abundance of style, there are a number of qualities which make The Untouchables watchable. The first and biggest of these is the historical quirk of how Capone was caught, through tax evasion. The film does lose focus from time to time, particularly in the scenes with a high body count, but we do keep coming back to the theme of how the smallest error or indiscretion can lead to a person's downfall - something that's as true of Capone as it is of the police officers who allowed Frank Nitti to infiltrate their ranks.\n\nThe most interesting characters in The Untouchables are the minor players on both sides of the divide. Charles Martin Smith (who was very good in Starman) deftly conveys someone who is out of his depth but driven by the need to do good, turning his own skills to the advantage of the team. Andy Garcia's character is a little underwritten, but he takes what chances he can to portray a hot-head trying to turn his life around - ample preparation for his later role in The Godfather Part III. And Billy Drago, as a heavily fictionalised Frank Nitti, is one of the coolest, most underrated villains of the 1980s. Not only does he look tremendous, but his icy demeanour and playful sense of humour make his evildoing for Capone resonate all the more (his death, on the other hand, is riddled with disappointing wire work).\n\nThe Untouchables is a watchable but ultimately empty experience which has neither the substance nor the discipline of De Palma at his best. Lumbered by a problematic script and unintentionally silly performances by its main leads, it provides just enough drama to keep an audience interested while never getting to grips with its subject matter in a sufficiently deep manner. There are many Oscar-winning films which are far, far worse, but there's very little about this film which is truly untouchable.",
            "review_date": "2015-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "whilst it does have some minor flaws in scripting and (in costners case) acting chops, this movie is damn good. Connery owns this movie and DeNiro is formidable as Capone.",
            "review_date": "2015-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant classic gangster film. With its all star cast and iconic scenes, it is a must see for any fan of movies.",
            "review_date": "2015-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This American gangster film based on a true story, contains solid performances from an all-star cast, with Connery the standout. Including period costumes and settings, this film accurately recreates the 1920s era. 1001",
            "review_date": "2015-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic.  One of the best Gangster flicks.  One of Depalmas more straightforward pictures, but you could still see his fingerprints on it.",
            "review_date": "2015-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "2015-07-31 excellent with just a few plot holes.",
            "review_date": "2015-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it doesn't exactly follow history as closely as you'd believe, it gets the look and feel of Prohibition era Chicago down. Costner is our white knight protagonist, De Niro gives a memorable villain turn, and Connery collects an Oscar for his best non Bond performance.",
            "review_date": "2015-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have never cared so much for a baby stroller until this film!",
            "review_date": "2015-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A near-perfect movie full of epic performances! Connery, Costner, Deniro! Just a great movie that's incredibly rewatchable!",
            "review_date": "2015-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very cool cops and gangsters flick with great performances and Brian DePalma's signature action style. \n\nGrade: A-",
            "review_date": "2015-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't remember the last time I saw such an unremarkable film. A larger-than-life tale with direction that is duller-than-a-pile-of-beans.",
            "review_date": "2015-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun, dramatic, greatly performed, and nice actions scenes. it serves to be a fine De Palma film.",
            "review_date": "2015-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lousy. Unrealistic drama. Not serious at all.",
            "review_date": "2015-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How do you think he feels now, better or worse?\n\nTreasury Officer Elliot Ness has been assigned the impossible mission of bringing down Al Capone.  Initially, he has all the men and resources at his disposal he needs but keeps coming up short because Capone has paid people on his team.  He finds a friend who helps him form a smaller more effective team; but Ness quickly discovers as he gets closer to Capone, more and more lives become at risk.\n\n\"It's nice to be married.\"\n\"If you can stand the pain.\"\n\nBrian De Palma, director of Scarface, Carlito's Way, Mission: Impossible, Black Dahlia, Mission to Mars, Snake Eyes, Femme Fatale, and Carrie (1976), delivers The Untouchables.  The storyline for this seems a bit fabricated but entertaining and well done similar to Tombstone.  The action and script is very well written and the cast delivers solid performances.  The cast includes Kevin Costner, Robert De Niro, Sean Connery, Andy Garcia, Charles Martin Smith, and Billy Drago.\n\n\"Make sure when your shift is over you go home alive.\"\n\nI came across this on HBOGO and decided to watch it again for the first time in a long time.  I always adored this movie and how the character interactions unfold and the great shootouts.  The film also has the perfect \"feel\" to it like Tombstone or Hoodlum.  This is an underrated classic that is a must see.\n\n\"And don't let him clean himself until after he talks.\"\n\nGrade: A",
            "review_date": "2015-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "81% on my Tomatometer.",
            "review_date": "2015-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have not seen this film as a whole. It may be unfair for me to even give a review, but there is something about The Untouchables that is so satisfying, and ridiculously fun. It's a big cartoon. Lots of giant set pieces and big men in high pants trying to eat up all of the scenery. Kevin Costner pulls it off really well. Sean Connery is the film's star. He's just fantastic as that bad-ass irishman, the right one to combat with the ruthless gangsters. Then, there's Robert DeNiro as Al Capone. Oh my goodness, he is absolutely frightening. This  rivals Jake LaMotta as his best role EVER in a film. What's so tragic about it, however, is that he barely gets enough screen-time. The film opens with DeNiro, in a genius, menacing monologue, and then we have such a long stretch before he returns. It just seemed inconsistent, and why this movie isn't perfect. We needed more Capone. Then again, Capone is such a huge figure in American history, he needs his own biopic.. but these days, it's too little, too late. I think the film also suffers a little with it's tongue-in-cheek humor. That big jumpy soundtrack, and theatrical sets mixed in with the great dramatic story by Mamet and the bloody shootouts.. perhaps I missed the point? Slick, funny and piercingly dramatic, could this have been the precursor to Inglorious Basterds? You know what? I've gotta see this movie again.",
            "review_date": "2015-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The start of the Costner run of well done box office hits......Connery steals the movie.",
            "review_date": "2015-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The excellent cast and the amazing thrills are what make this slick, clever, intense, and fun crime film worthy of multiple viewings. It was absolutely stunning. Also, the score is just a work of God.",
            "review_date": "2015-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great crime flick that's packed with spontaneous acting, great set pieces, gripping action, and a proper outlook on historical gang-related crimes in Chicago.",
            "review_date": "2015-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "95%\nWatched this on 21/3/15\nLike L.A. Confidential, the best gangster films of the 20th century are about police officers and not about the mafia. Untouchables has a stellar cast including Kevin Costner, Robert De Niro, Sean Connery and Andy Garcia, all turned up commendable performances. Brian DePalma's thriller flick is not onlky stylish, but it adds action to the otherwise dialogue driven gangster flicks. The shooting scene in the railway station is a true pleasure to watch and the director of Mission Impossible has done a fabulous task here and this is one amongst the best films of Kevin Costner.",
            "review_date": "2015-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent as far as mob movies go. Sean Connery was the best part.",
            "review_date": "2015-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot is not much exciting as it follow the old days old-fashioned mafia movie.",
            "review_date": "2015-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It hits the action beats a little harder than the dramatic side would merit, but The Untouchables is thrilling, well-acted and has a great director behind it. Full review later.",
            "review_date": "2015-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie! Well acted and well directed!",
            "review_date": "2015-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There have been many, many Al Capone stories, but this one is the best.  A tense drama, utterly serious, with a great score that sets the mood, it stars Kevin Costner as Eliot Ness, Robert DeNiro as Al Capone, and Andy Garcia, but Sean Connery steals the show as the old Chicago cop who mentors Ness.  A great performance by Connery earned him the best supporting actor oscar that year, and most deservedly so.  \"What are you prepared to do now?\"",
            "review_date": "2015-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After all these years it's still one of my favourites.",
            "review_date": "2015-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brian DePalma's mob film succeeds as gangster thriller which features a marvelous cast as it explores the prohibition period in Chicago back in the 30s.",
            "review_date": "2014-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first few scenes of \"The Untouchables\" show off director Brian de Palma's skill at creating expectations, subverting them, and manipulating the audience, three modes that he uses to good effect and bad over the course of the film. It is important that we like Treasury Department investigator Elliott Ness, the man who brings down Al Capone, because this is his story. But as the stiff, humorless enforcer of two deeply unpopular laws, Prohibition and the U.S. tax code, sympathy for him is hardly automatic. De Palma creates that sympathy in short order through a series of carefully crafted moments. First, he makes Ness's foe a larger-than-life villain. Robert de Niro's Capone is a grotesque monster, cocky and immature as a school bully, but incalculably more frightening. His first on-screen victim is a 10-year-old girl, and just like that the audience is out of his corner. The camera is always markedly above or below de Niro so that his face and body, swollen by decadence, bulge out in unnatural and off-putting ways. By contrast, Kevin Costner's Ness is quiet, steady, unassuming, and life-size. The camera looks straight at him as he keeps his composure in the face of a news crew's cynical heckling. Their faceless taunting, and his defenselessness, puts the audience on Ness's side even though Costner has far less natural charismatic than de Niro. But de Palma is not through crafting his protagonist: instead of being truly untouchable, a flawless Superman, the first major set piece sees Ness engage in farcical vainglory. He shouts \"Let's do some good!\" as he drives a truck through a warehouse wall, only to find that his first big bust is a big bust. Seeing Ness humbled is the final piece of de Palma's masterful opening arc. By humanizing him, by refusing to make him simply pure in counterpoise to Capone's simple evil, de Palma makes a killjoy Fed into a hero worth rooting for.\n\nUnfortunately, de Palma's deftness at audience manipulation and his penchant for highly-manufactured staging have their downsides. The plot unfolds in a series of violent vignettes, and while these are exciting and memorable entries in the long tradition of shoot-em-up cinema, de Palma does not always know how much is too much and where to draw the line. The first big showdown takes place on a bridge, and the visuals are great. We see the plan unfold clearly. But the music is all wrong for the moment. It sounds almost comical, and is the kind of music that can only be played after the fact because its tension-killing jauntiness indicates that none of the principles are going to die. The film is scored by universally-acknowledged genius Ennio Morricone, so the fault must lie with de Palma for putting the music in the wrong place. In the next major bloodbath, which involves Sean Connery's quotable Irish cop Malone and a pair of assassins, de Palma switches to first-person view for an extended shot that moves seamlessly through a window and up and down a hallway. This technique is often used in schlock horror, but it works just as well to build tension in a period piece drama. As a bonus, it showcases the movie's excellent set dressing; the 1930-ish furniture and fixtures are museum-display perfect, yet feel authentic and lived-in. The end of this sequence has enough bullets that it really must result in an immediate death, but for the sake of melodrama de Palma stretches out the victim's life in a way that is unforgivably unbelievable. The loss of believability is only compounded in the movie's final act, in which de Palma detaches the film from the realm of physical probability in order to indulge in a slow-motion massacre on a staircase. It is an obvious homage to the famous Odessa Staircase scene in Sergei Eisenstein's \"The Battleship Potemkin\" (1925), which popularized the telescoping of time as a way to tell several small stories that occur in the same place at the same moment. It looks great, and it's gripping, but when it ends we can feel that we've been played.\n\nThe conclusion of the film is too easy, even corny, completing de Palma's drift away from stylized reality and into pure fantasy. Stray elements of the movie-the wife, the determined photographer, the corrupt police chief-never reach their full potential. \"The Untouchables\" can't be considered a flawless film by a long shot, but as a playground for big, bold personalities like de Niro, Connery, and de Palma, it's absolutely a fun one.",
            "review_date": "2014-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On paper Untouchables comes across as a brilliant piece of material, with promise of being an exempelary piece of work by some serious talent. However this piece, although extremely entertaining and well executed misses the mark, one too many times to make it a classic. During prohabition, in 1930's Chicago, Crime lord Al Capone, sweeps under the radar, illegally exporting alcohol and weapons, while tax dodging. The Bureau send in new boy Elliot Ness, in order to bring Capone to justice, however he quickly learns that even his own department are in on Capone's regime. Elliot is then forced to create his own gung ho team nicknamed The Untouchables, in order to finally bring Capone to justice. Its a strong cast, lead by Costner, who gives a heart warming and likable performance as Ness, De Niro is superb as crime lord Capone, the only fault is we dont quite get enough of him on screen to really enjoy him chomping his way through the dialogue. Sean Connery and Andy Garcia also make worthwhile appearances, however the problem is it just doesnt seem to work properly. Everything seems to clean cut and efficent, tonally there are times when this movie gets it all wrong, playing out more like a spagetti western than an American gangster flick. Brian De Palma does a wonderful job of creating some excellent set pieces, most notably the train station stair case sequence, where a shoot out entangles the lives of innocent people, gangsters, cops and a baby in a buggy, its a notorious scene, executed well but on further inspection of it, everything just fits together to easily. Bodies just happen to be in front of the buggy every time a shot is fired anywhere near, Costner happens to have an invisable shield round him, as he in involved in a sea of bullets. Its times like this that show the double edged angle of this film, it wants to be more but just cant seem to get over the hurdle. The look and feel is excellent, even in Ennio Moricone's score can some times feel dated and hammy at points, the costume and locations are all lush and fantastic, the cinematography for the most part is innovative and well executed. There is however just not enough strong cement to hold it together and in parts the film has no idea what it truely wants to be. That being said, with slick pacing, decent character actors and a wealth of tense set pieces, this film is extremely enjoyable, if not quite the gritty crime drama you would expect.",
            "review_date": "2014-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though the tonal shifts can be jarring, the film does succeed more often than not with fine performances, tension, and action.",
            "review_date": "2014-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Well-Crafted Gangster Epic!",
            "review_date": "2014-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good gangster film but quite as good as Goodfellas in my opinion.",
            "review_date": "2014-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw this many years ago, but felt like I had to watch it again to reconnect it.  Great cast, great historical period to make a film about and a good story that brings it to the screen.  It was a little cheesy some times and I would have expected more from Mamet and DePalma, but overall was worth watching.",
            "review_date": "2014-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Untouchables is a decent 80's movie to sit down and watch. It's set in the Prohibition Era, in Chicago, of 1930: the time of ruthless gangsters and low lives. Kevin Costner is Eliot Ness, an agent in the Treasury Department. Ness's main priority is to ensure the people of Chicago that he will do his outmost, in the line of duty, to bring evil mobster Al Capone to justice, whatever the cost. He approaches an elderly and well-experienced police officer, played by Sean Connery. He's called Malone and Malone decides to use his talents to assist Ness with the best advantage he could possibly gain, to overthrow Capone and restore justice. They recruit two other reliable members called Oscar Wallace and George Stone, they're played by Charles Martin Smith and Andy Garcia. Robert De Niro makes brief appearances as Capone.\n\nThe Untouchables is a great movie, with great actors. Connery stole the show with his mismatched performance as Malone. Brian De Palma's directing in the movie was fair, but I think his direction needed a bit of effort. The writing is ok as well, but still it needed a bit of effort. All aside, The Untouchables proves to be one of finest Mobster movies ever made. It has it's way of proceeding without disappointment.",
            "review_date": "2014-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tommy guns take the credit. The movie's greatness belongs in the simplicity of the screenplay. The stairway scene and the killing of Malone remain the best scene. A great watch.",
            "review_date": "2014-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "biggest mistake is watching this after seeing boardwalk empire. 4 stars trying to ignore the show, 2 stars after watching the show.",
            "review_date": "2014-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stylish and kinda cheesy, with some well shot scenes and great performances from Connery, Costner and DeNiro.",
            "review_date": "2014-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Artificial and boring.",
            "review_date": "2014-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is a lot to like about this movie. It has a historically interesting subject, impressive cast, visual richness, and it packs some quality excitement. The streetscapes and interior shots of the Prohibition Era Chicago setting look great. It has tons of charm as a period piece. It is not full force action, but it moves right along and there are some very intense moments. The climax scene in the end is particularly enjoyable. Sean Connery is memorable in his Oscar-winning performance. He helps build a character lively that is full of fire. It is not perfect though, for all the strong points, it has it still fails to develop a potentially interesting set of characters. Kevin Costner and Robert De Niro are not as lucky as Connery with their characters. They do not develop the depth or personality, and the writing does not give them same opportunity to spread their wings. I want more from Elliot Ness and his family life; maybe get into his back-story to understand what drives him. Similarly, Al Capone is a larger than life character, but he does not get the focus required to capture who he is.",
            "review_date": "2014-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although it problably isn't the best gangster movie out there, it is one of the greats.  The cast is good, unfortunately we don't see a whole lot of Al Capone, and therefore we don't see a whole lot of Robert de Niro.  It has an older feel to the film, with older style sound effects and filming, but it easily stands up to the others of its time.  The acting is all great, it's full if good actors, and I was suprised to see Kevin Costner in this film, as he usually isn't in this type of movie.  The movie itself was well done, it was exciting, had some good action scenes, and some quoteable moments.  The action is good, although Capones men never seem to have the ability to hit anything unless their right in front of them, if they even pull the trigger before being killed.  But the movie is on the more gory bloody side compared to the movies of the day.  The films often suspenseful and sad at the right moments, however often predictable as well.  How much the movie follows what actually happened, I don't really know, but I can say that the idea of the four misfits taking down Al Capone in their own isn't the most believable.  However it does make for a great film, and it proves that nobody is untouchable.  Great movie about the mob in Chicago, and is a lot like an older Gangster Squad movie.",
            "review_date": "2014-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fair Hollywood treatment of the most famed piece of history to come from the United States' prohibition era.",
            "review_date": "2014-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Netflix is an awesome thing....great movie - first time seeing it.",
            "review_date": "2014-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Connery and De Niro are fantastic.",
            "review_date": "2014-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really love this movie, except ...See a battleship Potemkin for that baby carriage, what a rip!",
            "review_date": "2014-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "DePalma displays the usual stylistic flare and some sequences are superbly crafted (most of which influenced from other classic films such as \"Halloween\" and \"Battleship Potemkin\"), however, \"The Untouchables\" evidently suffers from some clunky execution and generic representations of morality.",
            "review_date": "2014-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While featuring strong performances from Connery, Costner, and De Niro, The Untouchables suffers from an inconsistent pace and tone, slow buildup, and Hollywood clichés. Every scene in this movie is dragged out and beaten to death.",
            "review_date": "2014-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a great cast lined up and Brian De Palma directing, The Unthouchable sounded like an entertaining gangster film.\n\nThe Untouchables ended up as a somewhat entertaining film, but I found that it was rather faulty in many retrospects.\nThe general tone of The Untouchables may faze viewers. Although it should be a gritty and tense film, the nature of the film feels a bit too lighthearted to be truly intense and thrilling. I felt like I was reading a Dick Tracy comic book when watching The Untouchables becuase while the film was entertaining, the fast pace of the project and heavy focus on style gave the film a certain unprecendented artificiality. The Untouchables was a stylish film, but sometimes it felt as if is a comic book film which intends to be a crime drama but ends up feeling more like a Dick Tracy inspired film with elements of western cinema and crime drama instead of staying singularly as a gritty crime drama like it should for a story about Al Capone. I guess what I'm saying is that Brian De Palma clearly had an eye for great imagery when he directed The Untouchables, but he is really so focused on style that it even feels a bit like some kind of superhero adventure at times due to the visual style and the musical score.\nEnnio Morricone's musical score evokes a mixed response from me. I am a fan of the man and have loved his music for many years, and in The Untouchables it was not an exception as it was beauitifully crafted. But a lot of the time it does not seem to fit the mood of the scene that it is in. Occasionally in some of the very emotional moments, the music is great, but in many of the others the nature of the music is too lighthearted by nature to really have the correct mood of the moments. One example is the scene in which the titular untouchables make a bust at a bridge. The nature of the scene looks like it is straight from a western film while the music sounds as if it is from an adventure movie. The mix between adventure and western in this scene does not honestly grasp the intended gritty nature of The Untouchables, and in other scenes it is similarly strange. So the style of the film has some issues to it, and Brian De Palma's direction does not echo the same gritty nature that he executed on the gangster masterpiece Scarface. If you mixed the original 1932 Scarface with Warren Beatty's 1990 film adaptation of Dick Tracy, you would end up with something along the lines of The Untouchables, and I guess I was not prepared for Brian De Palma's approach to the subject matter and the way that he took on a style over substance approach to the film. In short, The Untouchables is a lot more about glamour over grit and so it lacks the dramatic impact of the more powerful gangster films that proceed it, and as Roger Ebert put it \" the movie seems more interested in the era than in the war\", and there is so much focus on style that the entire time watching The Untouchables I was very aware that a film was playing.\nLastly, Robert De Niro's portrayal of Al Capone is an issue. It is not so much because of his performance which is routine yet effective, but becuase of the fact that the structure of the plotting makes it feel cut off from the rest of the film. He comes and goes with  various moments in the film which do not last all that long, and he never really gets tied into the story. Despite being the man behind the war, he feels distant from it as if his actual relevance to the war is not that key. It seems that the filmmakers forgot him to be the cause of the Prohibition war and never really display his relavance to the story all that directly. The scenes with Robert De Niro do not really display the harsh reality of Al Capone as a gangster and therefore do not reveal the volatile nature of him as a criminal, resorting to focusing more on the thugs that he hid behind than the role he actually played in it all. The Untouchables is a story about Eliot Ness and his war on bringing down Al Capone, but the lack of focus on Al Capone ends up leaving The Untouchables feeling like a movie more focused on the idea of gangsters than on the gansters themselves.\nSo The Untouchables is not the best example of storytelling. It has the appeal of its visual elements such as the fact that it has thoroughly detailed production design and great scenery to echo the look of Chicago during its prohibition era, and it has old fashioned cars cruising down the streets and fancy costumes to deck its characters out in. It is all captured with great cinematography which follows a style which feels like a mix of classical and western camera techniques to capture the scale of the events. Visually, The Untouchables has problems but it really looks good. And the visual style of the film plays over well into the action scenes which are very entertaining. They play out like western shootouts, and althoughit isn't the right mood for the film, it is still entertaining. The action in The Untouchables is crafted greatly, filmed and edited well without skimping on the blood.\nAnd the script doesn't have perfect story focus, but it does have a lot of snappy dialogue for the actors to work with. Though the cast tends to be a bit hit and miss in the end.\nKevin Costner's performance is lacking in charisma. Although he fits the role well physically and is convincing decked up in his suit as well as the fact that he has a tense stare in him, his performance has the issue of feeling rather thinly sketched which means that he can only act it out as such from there. I watched his performance closely in The Untouchables and found that it seemed like somebody forget to tell Kevin Costner that he was not in a western movie. You wouldn't be able to tell based on certain elements of the film's style, but yeah, THe Untouchables is not a cowboy movie. Kevin Costner acts like it is, and although his western archetype has a certain extent of appeal to it, it is just not one of his better performances. Kevin Costner does the job just barely, but he really does not put much energetic spirit into his line delivery which makes his appeal as the lead limited. Kevin Costner cannot branch out all that much for his leading performance in The Untouchables. Kevin Costner stands, but delivering is a challenge for him.\nRobert De Niro has a similar problem with his performance as Al Capone. As well as being stuck with a character that does not connect to the story well, Robert De Niro portrays Al Capone in such a generic way that it is familiar of essentially all his performances in any other crime film ever made, especially ones when he worked with Martin Scorsese. He looks the part well, but he plays it out in a way that has been seen too many times before. If Bob Hoskins had taken the role, who knows what might have happened. But I can tell you for certain that I would have enjoyed it more as it would show him branching out. Robert De Niro on the other hand is as familiar at playing a Gangster as John Wayne is at playing a cowboy. So The Untouchables was not ideal as a front for Robert De Niro because there is little spirit in the role, and since the character is damaged by the structure of the film's plotting, there is reLly not much he can do to save it.\nAs viewers will have learned from literally every film where Sean Connery was meant to portray someone that was not Scottish, the man has no talent for accents. When Andy Garcia refers to Sean Connery as an \"Irish Pig\", all I was thinking was \"there is no way that he could be any less Irish.\" Yet as usual, it is hard to be bothered by it, although it is pretty funny that he ended up winning an Academy Award for the role. I'm not saying he didn't deserve it, I'm jsut saying that the Academy rewarding a man who cannot do an accent is actually pretty funny. Still, his performance is the best of the film. He has a humane spirit to him which he combines with his  natural heroism that  delivers a firm spirit to the character. He is able to just build his performance up from there because he incorporates in a tense line delivery which suffers only slightly from his inability to do a good Irish accent. Sean Connery succeeds at holding the grit of the film right in his palm with a burning tenacity and he brings his distinct charm to the role without problem which makes him a genial presence in the film. Sean Connery is spot on in The Untouchables, and if the other actors were as dedicated to the film as he was then maybe it would have turned out better. At least he got some recognition for the part.\nAndy Garcia makes a powerful supporting effort because he shows off some of the natural crime-themed charisma which would later score him an Academy Award nomination in The Godfather Part III where he was one of the best aspects of the film, and Charles Martin Smith has an entertaining heroism to him.\n\nSo The Untouchables looks good and boasts an Academy Award winning performance from Sean Connery, but the lack of grit in the film in favour of directional approach which is heavy in style but light in nature ends up making it a film which has visual appeal but not storytelling strength.",
            "review_date": "2014-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am a Brian DePalma fan - and this is one of his better films.  Admittedly, I am not a huge fan of Kevin Costner, but this movie is right in his wheelhouse as he doesn't need a lot of range to play the role of Eliot Ness.  Sean Connery and Robert De Niro make this movie great, and Andy Garcia is solid in his role.  Paced well with a lot of ebbs and flows in the story, this movie has just enough action with superb dialogue to make it on this list.  \n\nGrade = 8.5/10",
            "review_date": "2014-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fantastic Morricone score, a great use of the Chicago setting, slick moviemaking and Sean Connery do not fully make up for a stuffy missed opportunity of a plot and a dull binary morality. Had this been pure fiction it would've been a great crowd-pleaser, but as a stylized take on a far more interesting true story, it disappoints.",
            "review_date": "2014-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "De Palma........ What happened to you?",
            "review_date": "2014-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nostalgic win. Classic crime/mob flick from De Palma. Very realistic visuals.",
            "review_date": "2014-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great story that was told very well. De Niro is so evil. A classic mob movie. I wish it had more of the relationship between Ness and Capone. I think it would have been even better since Costner and De Niro had good chemistry",
            "review_date": "2014-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The untouchables directed by Brian Depalma is definitely worth watching more than once. It's perfect casting made the movie that much better. The story is great, however not perfect, it is filled with some clichés and predictable moments.(8.5)",
            "review_date": "2014-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a cool little Brian DePalma movie. It had great action, acting and a great cast. The plot was somewhat true but there was some non-factual stuff in it though. The shootouts were great and well shot. I liked the characters a lot and they were never boring. This movie might not be Scarface good, it's still great.",
            "review_date": "2014-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More or less historically accurate. Even the supporting characters are well acted.  De Niro is phenomenal as usual.",
            "review_date": "2014-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the greatest mafia films ever, and probably my favorite 80's movie. featuring excellent performances and exciting action, the untouchables is an undeniable classic",
            "review_date": "2014-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the show. That show was untouchable ... but for a move basted on a TV series... not bad.",
            "review_date": "2014-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thank god for Sean Connery otherwise this movie would of been a complete bust. Decent action and the only other thing that kept me interested is that its in Chicago.",
            "review_date": "2014-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best mobster movies of all time.  A must see.",
            "review_date": "2014-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slick, stylish and well acted (DeNiro's Capone is a real standout) with some great action the film has held up incredibly well and is still a lot of fun",
            "review_date": "2014-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The usual De Palma shine is used to polish this slick true crime tale of the Prohibition. It is sharp, straight-to-the-point, violent, suspenseful, but somewhat lacking in emotion.",
            "review_date": "2014-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The Untouchables\" isn't your average mega budget Hollywood movie. What sets it apart from most extravagant movies is that it actually has a good story and showcases fine acting.  You would expect nothing less from a Brian de Palma film.\n\t\tSet in Chicago during Prohibition, this movie is based on a book by Oscar Fraley titled \"The Untouchables.\" Eliot Ness (Kevin Costner) is the protagonist who hires a small and efficient team to take down the biggest gangster in Chicago, Al Capone (Robert De Niro). The movie has a sense of sophistication and class to it with its subtle use of comedy and the Armani suits donned by the characters. The star of this movie is Sean Connery as Jim Malone, who delivers some very iconic dialogues. He knows how to get around the law and with his unorthodox technique he plays a vital part in trying to arrest Capone. He calls it the \"Chicago way.\" \n \t\tThe movie is full of ups and downs and the background score really accentuates the suspense and thrill of this vastly engaging movie. The film captures the spirit of Chicago in the 1920s. Robert De Niro makes a fantastic villain and he has a sense of pride and arrogance about him, which can be associated with Capone. The cinematography in certain scenes gives the viewer a sense of anticipation, such as the scene when the man is peering into Jim Malone's house. \n\t\t\"The Untouchables\" is an engaging movie, which will have everyone at the edge of their seats for two hours.",
            "review_date": "2014-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie. Very suspenseful, great storytelling, great period piece, with incredible performances from De Niro and Connery, and good performances from the rest of the cast.",
            "review_date": "2014-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolute A list cast leads the way in a decent crime caper. I love Kevin Coster in here and his dedication to capturing capone. He was calm, strong willed, and confident in his performance.  In my opinion the movie is at its best when Connery is on the screen. The man is a bad mamajama.  His no holds bar approach helps Elliott Ness eventually capture capone. Deniro is great as Al Capone and fully transformed himself. The story is good despite some dull parts the movie is an excellent addition to the genre.",
            "review_date": "2014-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A grand adventure film under the clever guise of a crime drama with a fabulous homage to Potemkin.",
            "review_date": "2014-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two words: Sean Connery.",
            "review_date": "2014-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't think the values of the 1980s were compatible with the gangster genre, or maybe just not with such a backwards-looking one as this. There was some beautiful location scenery from Chicago but the macho face off between Treasury agent Eliot Ness and gangster Al Capone lacked much flavour.",
            "review_date": "2014-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Featuring a superb cast, The Untouchables is an original gangster film unlike any other of its genre",
            "review_date": "2014-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lot of it feels hodge podge-y, a mess, but there's so much classic about it you can't help but be enthralled even when it's less than perfect.",
            "review_date": "2014-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"I think I'll have a drink.\"\n\nThe Untouchables is the classic tale of the gritty arrest of Al Capone (displayed wonderfully by Robert De Niro). All is great with this one and Sean Connery is even greater.",
            "review_date": "2014-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"A state that's untouchable like Elliot Ness\"",
            "review_date": "2014-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Elliot Ness (Costner) tries to save Chicago and get a mob boss Capone (De Niro) out of power.He gets help from patrolman Jimmy Malone (Connery) and tries to save his neighborhood from corruption.Rookie Stone (Garcia) aides in the fight ,and the rest is \"history\".",
            "review_date": "2014-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just turned off The Unwatchables... making it the fifteenth movie to elicit such a level of disgust from me. Full review soon.",
            "review_date": "2014-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it's not the finest hour of any maestro involved, the film calls upon the likes of Brian De Palma, Sean Connery, Robert De Niro and Ennio Morricone to create a comic-bookish crime epic of the Chicago Police Department's prohibition crusade against Al Capone. The results are about as satisfying - brash, rousing, over-the-top - as one would expect.",
            "review_date": "2014-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best gangster movies ever made, fantastic slow mo scene.",
            "review_date": "2014-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of my favorite movie",
            "review_date": "2014-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Twenty-seven years later it's starting to get a bit dated, but still fantastic.",
            "review_date": "2014-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is gruesome scene in this movie. I love the story and I love the characters.",
            "review_date": "2014-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "May not be the most realistic of accounts of the story of how Al Capone was stopped for tax evasion; an exaggerated portrayal by Brian De Palma where the style becomes a little too overwhelming. But one cannot overlook the fact that this may well be one of the most genuinely entertaining crime epics, and that the performances, including Connery's award winning performances as a street wise mature cop, and De Niro's almost comical depiction of Al Capone, contribute to making this film memorable.",
            "review_date": "2014-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "De Palma gains a lot of attention as a boundary pusher and a visual stylist, but he does not get a lot of credit for being an entertainer in the most traditional Hollywood style.  I think that's one of his strongest characteristics, and \"The Untouchables\" is a masterpiece of storytelling in big, broad Hollywood strokes.  I think it's his best film.",
            "review_date": "2014-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are few films with such a star studded line-up where each of them actually perform to the best of their abilities. Nowadays movies like 'Expendables' just want to throw the big names together without giving them a script that highlights their acting ability. The Untouchables is not one of those movies. Starring a young Kevin Costner who shines throughout and clearly suits the clean-cut and slick law enforcement role in his younger days. Andy Garcia also is in his early acting days and he doesn't disappoint. Robert De Niro does what Robert De Niro does best. Although it would have been good to have seen him involved in more scenes as he pulled of the role of Al Capone to perfection. Sean Connery was his silky smooth operator status quo. Definitely a good watch.",
            "review_date": "2014-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"I want him dead, I want his family dead, I want his house burned to the ground - I wanna go there in the middle of the night & I wanna piss on his ashes!\"",
            "review_date": "2014-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An interesting and entertaining look at just some of what the prohibition did to the US.",
            "review_date": "2013-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brian De Palma strikes again with another amazing film! I really enjoyed it and the time flew by, I was interested and wanted to see Capone brought down. The style was great, the music was outstanding and the film was solid. I only have a couple of complaints the acting seemed a little off in parts and the group seemed like an odd choice. The acting felt weird to me because Costner seemed very muted and dumbed down, I like Kevin Costner and think he is really great but here he just felt really off which confuses me because just a mere 3 years later a film he makes sweeps the Oscars with a very committed role by Costner, De Niro felt very over the top and Connery seemed very aggressive. Now, I'm aware this is based off of a true story but films always like to stretch the truth but if this is how the real people acted, then I'm not to argue. Connery was great however, I can see why he got an Oscar and I'm glad he did, although out of his impressive body of work he got it for this? At least he got it! Like I said, I also didnt like the group or felt it to be a little unbelievable, again, I'm aware this is based on a true story but even in real life a group of four with a nerdy guy as one of them it seemed like the whole thing was just going to be a failure. That being said, I didn't analyse it all that much and I did enjoy it but it shows its age.",
            "review_date": "2013-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "definitely the best prohibition era Gangster movie perfect 5/5. ennio morricone's beautiful soundtrack fits this film perfectly and makes it even more memorable. the acting is excellent except for Sean Connery's terrible irish accent, and probably his over the top  death .",
            "review_date": "2013-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Untouchables is considered to be a classic gangster film, and for good reason. It has an all-star cast and hits all the police cliches of the genre (emphasis on the police). Despite it's outstanding story and fantastic acting, it's not without flaws. With all of it's head explosions and dramatic speeches... it's cheesy. And until I confirmed with rottentomatoes, I was wondering if it was intentional.\n\nThe Untouchables is the story of Elliot Ness who assembles a small crew of honest cops to take down the dangerous Al Capone. In the process he must watch his, his companions and his family's backs or suffer the harsh reality of the Chicago streets.\n\nThe first main problem that lead to cheesiness is the score. It's so bloody terrible. With booming orchestras that remind you of a western followed by an electric synth/horn jazz remix, the music is horribly distracting and overwhelms a good chunk of the scenes. I could have taken it more seriously if it had the subtlety (yes subtlety) of Goodfellas, but with the cacophonous score I just can't.\n\nThe cheesiness doesn't end there. Some of the speeches characters give don't come off as effective as the writer would like, not because of the actors, but because of the stupid analogies or catchphrases. It's hard to take Capone seriously when he's rambling about prize fighting for no reason. While there are genuinely intense and suspenseful scenes, there are plenty of outrageous scenes that leave you with tonal whiplash. From the intensity of a baby and mass shooting to Kevin Costner catching a gun and Andy Garcia stopping the carriage with his leg, it's not a smooth transition.\n\nSpeaking of shitty transitions, the editing in this movie is all over the place. I know this is a snob complaint, but there are many rough cuts and inconsistencies in the editing. The dubbing is absolute shit too, which is a pet peeve of mine. To be fair, the second half of the movie got better (probably because of the second editor).\n\nNow that I've complained, lets talk about the good stuff (which we all know isn't as fun). If you can get past the cheesiness that may or may not be there, then there is an engaging story to be had. The story develops at a good pace and even though we all know how it ends, the journey is still an exciting one. The acting is stupendous, Shaun Connery being his usual big badass (although I don't know if it was Oscar worthy). DeNiro does an okay Capone, but he still is very DeNiro. It's not an intense emotional drama like Goodfellas or The Godfather, since it's from the police perspective, but it does have it's fair share of character drama.\n\nThe Untouchables is a fun and engaging cops and robbers movie, but it's \"classic\" status is up to question. That's not to say you shouldn't watch it, just that I'm too much of a snob. For the first movie I've seen since moving to Chicago, it's a pretty good one. The Untouchables is available on Netflix, Amazon Instant, Google Play, itunes and Blockbuster (OH WAIT!).\nRead more reviews at mentalmultiverse.wordpress.com",
            "review_date": "2013-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "my favorite gangster movie, although with each viewing i notice more and more flaws, but who cares. it's great.",
            "review_date": "2013-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great cast with some old school climactic scenes done with some artsy cinematography added to some good dialog is taken down from the poor soundtrack. As much as I like Chicago filmed this way this movie is good not great.",
            "review_date": "2013-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They really don't make films like this anymore. De Palma delivers the goods pulling together some brilliant set pieces (particularly the sequence at the train station) which are truly gripping. Costner is solid up front and the supporting cast are on top form (especially De Niro and Garcia). \n\nAlongside this, the visuals are superb and Morricone's score is just beautiful. Filled with character and suspense, this is a great flick....",
            "review_date": "2013-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When I saw this, I felt less like I was watching a film and more like I was watching a two-hour time kill.",
            "review_date": "2013-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An all star cast, and an intriguing and suspenseful story with very real stakes. Loved this movie.",
            "review_date": "2013-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Revisionist history does not impress me.",
            "review_date": "2013-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film is stylized as a noir, however at times it feels like a cliché and a bit forced.",
            "review_date": "2013-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic mob flick with an all star cast,  De Niro as Capone is truly terrifying. If you haven't watched this, you aren't a mafia movie fan.",
            "review_date": "2013-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "75% \nTo be honest, I found this to be pretty disappointing, however it's still an enjoyable gangster yarn with De Niro in the classically cheesy Italian gangster mode.",
            "review_date": "2013-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Blessed with stylish direction, witty script and impeccable cast, THE UNTOUCHABLES is entertaining, if slightly hollow cops-and-gangsters saga.\n\nhttp://caseymoviemania.blogspot.com/2013/09/the-untouchables-1987.html",
            "review_date": "2013-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie enjoyed it",
            "review_date": "2013-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my personal favorite mob related film of all time.  I enjoyed this much better than any of the Godfather movies. Told the story of Al Capone and I loved every second of it.  Had great action and fantastic character development.  You'll love the 4 main characters.",
            "review_date": "2013-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Connery is great in this movie!",
            "review_date": "2013-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great, if uneven, direction from DePalma, as usual, with some really memorable moments throughout. Wished the dialogue was more period, and in general script was a tad bland, but overall it's definitely worth the watch.",
            "review_date": "2013-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Having This Film On VHS Made Me Watch It Like More Than 30 Times !!!\n\nLots Of Memories Around That Picture,\n\nClassic Action Film From A Classic Age,\n\nMany Unforgettable Scenes Really Worth To Watch Them Over & Over again .",
            "review_date": "2013-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Untouchables is an above average crime drama that doesn't quite reach the heights of the best films of the genre.",
            "review_date": "2013-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sean Connery (voice) R.I.P.",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It lacks in character development and because of it we find it difficult to get in touch with the characters, however the sleek,suave tone in which the movie is executed in, not to mention a lot very fun action scenes makes it worth it.",
            "review_date": "2013-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sturdy crime drama based on the capture of Al Capone. Well paced, well acted and features an electric 3rd act. However DeNiro isn't a major part of the film, despite the advertisements attempts to show him as such.",
            "review_date": "2013-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is this one of the best movies made? Yes it truly is, it's beautifully and lovingly shot, and after the two hours go by you want more. This is by far Kevin Costner's best movie, and Sean Connery is absolutely fantastic.",
            "review_date": "2013-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible movie, it's like watching everything gangster squad should have been",
            "review_date": "2013-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Just like a Wop to bring a knife to a gun fight.\"  Didn't President Obama say something to this effect?",
            "review_date": "2013-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stopped watching after 30 minutes....way too cheesy",
            "review_date": "2013-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fine, classic movie with perfect cinematography and well directed by De-Palma.\nCostner, De-niro, Garcia and Connery are all the main reasons for this must-see gangster\nmovie.",
            "review_date": "2013-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fantastic film, that may not be entirely true, but it doesn't matter. Featuring on-the-nose performances from Robert De Niro and Sean Connery, who doesn't always get the accent right, but what do you care? Brian De Palma's gangster film about Al Capone has so many memorable and exciting scenes, that it will hold you on the edge of your seat for its entire 120 minute length. De Palma invokes Hitchock, as he usually does, and it pays him back ten fold. The film is tight, tense, and entertaining, and even Costner does a pretty good job. \n\nFor more movie reviews visit: www.reelfive.com",
            "review_date": "2013-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The title says it all",
            "review_date": "2013-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible, boring, cheesy, pointless, inacurate, unbelievable, bad set design and poorly acted. Does not stand the test of time, may have been great in 1987, but not now.",
            "review_date": "2013-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really, overly saturated with cliches and cheesy characters. The plot is incredibly predictable, and like I said, cliche. Robert De Niro acts like he was on the set for two days, so let's just get my scenes shot already. And seriously the baby stroller falling down the stairs? The movie was completely unoriginal.",
            "review_date": "2013-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I expected to see a movie that was much more serious concerning that this is a gangster movie and how he portrayed tony montana in scarface. However, I enjoyed the movie because there were shootouts and suspense cinematic following scenes. The gangsters were dapper provided that the wardrobe was provided by giorgio armani! I just wish there was a little more believable",
            "review_date": "2013-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brian De Palma's 'The Untouchables' is violent and visceral, with a combination of potent storytelling and good acting. Connery and De Niro are obviously magnificent, and the movie's tight plot keeps everyone engaged from beginning to end. 'The Untouchables' is one of the best gangster films around.",
            "review_date": "2013-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Untouchables- 4.5/5\n\nBrian De Palma's The Untouchables is unlike any other suspense thriller movie I've ever seen, and having the story based upon a dangerous Mafia head it also adds the extra bit of excitement to it which makes it one of the most realistic yet entertaining suspense movie's I've seen which keeps the audience glued to there seats throughout the course of the movie. The Untouchables is pacy, enthralling, entertaining and full of suspense which keeps you at the edge of you're seat and constently wondering about what the next sequence will be and the brilliance from all around, especially the cast who have all done a sublime job especially the superb Connery who was the best supporting actor one could ever wish for, a unique yet realistic story about how good prevails over evil and some amazing presentation by Director Brian De Palma who has detailed the movie perfectly and made it in a subtle yet entertaining manner which ensures that The Untouchables remains as one of the best suspense-thriller's ever made.\n\nThe Story is based upon the novel written by Oscar Fraley and Eliot Ness is showing the year 1930 Chicago where dangerous mafia leader Al Capone(Robert De Niro) has made Chicago almost like his own city and dominates the drug/ illegal products dealing scene and Treasury Officer Eliot Ness takes it on his own to bring him down and send him to jail for his innumerous crimes. But after finding out that most of his allies are all corrupted by Capone, he decides to make a team of his own in his accountant-friend Agent Oscar Wallace(Charles Smith Martin Smith), an anti-corrupt officer who turns out to be his greatest asset named Jim Malone( Sean Connery) and a young up-and coming officer George Stone( Andy Garcia) and makes it his task to put Capone in jail, but his journey towards it is a very difficult one as he finds out how much corrupted the people he knows can get.\n\nThe Acting Cast in the movie was chosen very wisely and perfectly by Brian De Palma, because all the actor's who portray there character's are almost like made for these kind of characters. Kevin Costner was the main protagonist in the movie as the Treasury Officer Elliot Ness who is adamant on putting Al Capone behind bars, and he did the role quite perfectly and he is a quite perfect choice for a good cop, because he excels in these kinds of roles and he imperfected the role of Ness. Sean Connery was possible more influencial in the movie than Costner portraying the anti-corruptible Jim Malone, and he portrays the character of an old justical policeman so well that he is more of a protagonist than Costner and with sublime dialogues with a bit of sarcasm at times, he almosts guides Costner in the movie. He was a brilliant support for Costner in the movie and excelled Costner's performance as well as perfected his, and he probably deserved his Oscar that year. Robert De Niro is almost meant for roles such of the mafia head, and he again excels so easily portraying the ruthless Al Capone, and his ability to dish out brilliant and sarcastic dialogues at one point and then kill a man on another is so marvelous that you think that he really is Al Capone and he again shows why he is given so many roles of Mafia Leaders in numerous movies. The Rest of the cast also did a great job in portraying there respective characters and I especially loved the acting of Andy Garcia and Billy Drago, one who is a brash young-cop and another who is ruthless right hand man of Capone.\n\nNow Brian De Palma really deserves A Lot Of credit for his presentation of The Untouchables, because not only has he made a brilliant suspense-thriller which shows the victory of the good guys against the corrupted one's( a thing which Is shown in a subtle yet entertaining way), it is also very influencial for film-makers deciding to make movies in this type of genre in the future because The Untouchables is not only brilliant in the acting and story aspect but the technical aspects of it are also very sound and quite futuristic. He showed the dark side of Chicago at that time brilliantly and some of the action scene including a slow-motion action scene really mesmerized me by thinking how much devotion he gave to create such brilliant action scenes. He made sure that the technical aspects of the movie we're also spot on and chose a brilliant crew which in turn repaid with an amazing movie.\n\nThe Story which I presume is about the events which happened in 1930, Chicago in which the real Eliott Ness took down Al Capone is written by Eliott Ness and Oscar Fraley is a brilliant look at the level of domination and power Al Capone had at the time and how he corrupted any one he wanted except for the Untouchables. The Screenplay is also a brilliant one, containing some really amazing and sarcastic dialogues which are quite pleasing to hear and the dialogues throughout the movies were brilliant, and the screenplay was very well scripted and shown which was duely delivered by the cast. Credit goes to David Marmet for writing the screenplay and dialogues for the movie which really well showed the brilliant and realistic story written by Ness and Fraley.\n\nThe Cinematography in this movie is quite brilliant and the camerawork throughout the course of the movie was superbly handled. Some of the camerawork in the movie are really well shown in an almost futuristic way with some of those action scenes and the credit goes to Cinematographer Stephen H.Burum for presenting some really good camerawork in the movie. Although there isn't much special effects shown in this film, some of the scenes(specially the action scenes) are really well detailed with some special effects such as slow-motion which really took me aback seeing it in a movie which was made in the 1980's! Even the costume design and makeup in this movie is so spot on and its visible that De Palma has used the best of what was available, because of the costume's my rating went from 8.5 to 9. Even the Art direction team has done an amazing job in showing the 1930 Chicago and it's surrounding in a dark time, so credit goes to them too. Credit goes to the visual effects team and costume design team who have contributed a lot to the movie and made sure that it's a hit on the technical aspects as well.\n\nThe Background Music throughout the course of the movie was quite fantastic as the different type's of music used such as classical music as well as music from other genre's was really well synchronized with the sequences and it really brought that right kind of tone to the atmosphere of each scene, and the music used in the action sequences was really good. Credit goes to music director Ennio Morricone for delivering such sublime different types of music throughout the course of the movie which really up-ed the level of the sequences.\n\nThe Untouchables was a real delight to watch because of the way it was presented, that kind of subtle yet entertaining and enthralling presentation of this suspense-thriller regarding the downfall of one of the most dangerous mafia criminals of all time was presented superbly by Director Brian De Palma who was supported superbly by his acting cast and remaining staff and in turn made one of the best suspense-thrillers of all time which has that realism and uniqueness to it and The Untouchables is definitely a movie which can be entertaining for all kind of public.",
            "review_date": "2013-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hadn't watched this one in ages, still found it quite enjoyable.  Sean Connery was excellent and the film has a really good pace to it.  If it's been a while, check it out again!",
            "review_date": "2013-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty much a bullshit portrayal of historic events...",
            "review_date": "2013-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't quite get the love for this movie. It's a pretty by-the-numbers gangster movie with a noteworthy ending set-piece moment. Still a well-made movie though.",
            "review_date": "2013-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the finest films ever made. Costner, Garcia, DeNiro and an oscar winning Sean Connery as an Irish cop with a Scottish accent all give quality performances but for me it is the legend that is Billy Drago that stands out the most as Capone's enforcer Frank NittiIt. This flick contains so many memorable scenes. Its opening with \"I grew up in a tough neighbourhood\", Connery and the wop bringing a knife to a gun fight and the Battleship Potemkin shoot out on the steps of Union Station. The soundtrack by Morricone is immense.",
            "review_date": "2013-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Untouchables is a great crime movie and a fantastic biopic.",
            "review_date": "2013-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Federal Agent Eliot Ness sets out to stop Al Capone; because of rampant corruption, he assembles a small, hand-picked team.",
            "review_date": "2013-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally got around watching this for the first time, I loved every minute of this. Kevin Costner, Sean Connery, and Robert De Niro were terrific, I think Niro might be my 2nd favorite Capone portrayal after Stephen Graham. Loved Ennio Morricone's jazz centric score, I wish more crime/gangster films today could use some jazz. Overall it's now one of my favorite films, can't wait to see it again later on.",
            "review_date": "2013-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "with brian depalma in the driving seat and the talents that they got with'em, i think it fell short",
            "review_date": "2013-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a must see for anybody",
            "review_date": "2013-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing set pieces and performances that is filled with violence and surprising emotion.",
            "review_date": "2013-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic gangsta flick bout Al Capone love how they filmed this",
            "review_date": "2013-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite being a classic in its execution, the story fails to capture the minds of those who recognize the utter stupidity of prohibition, and the character treatment is far too sterile to capture the heart.  The Untouchables is a respectable failure.",
            "review_date": "2013-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once Sean Connery gets popped, DeNiro gets less screen time and it's all downhill from there. Weird, tacky, and clearly outdated in every way.",
            "review_date": "2013-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Untouchables is a powerful, entertaining classic cops vs criminals drama. Kevin Costner, who plays as an officer named Eliot Ness, brings together a small group of agents to take down the gangster Al Capone in the Prohibition-era Chicago. Sure, it's historically inaccurate, and it's an exaggerated retelling of the events that actually happened, but all is forgiven thanks to its great performances from everyone (Particularly Sean Connery, Kevin Costner, and Robert De Niro), its stylized but entertaining action sequences, and Ennio Morricone's brilliant score. I was glued to the screen for nearly every moment of the movie, and the way the suspense was handled was great, and never kept me anywhere less than engaged to the story. \n\nThe acting from everyone is great too, and Kevin Costner does his role well, Sean Connery gives a strong, likable performance, and De Niro plays Al Capone pretty much flawlessly, with multiple breathtaking scenes. The amount of action is not little nor excessive, and perfectly fits into the plot without disrupting anything or making it feel over the top. Ennio's score really adds to the film because it gives the film a great 1930s feel to it, and sets the mood and intensity of scenes that wouldn't be anywhere as good without it. It has enough substance so it's not completely devoid of intellect, and the characters are developed enough to the point where you at least care about the characters. It has many memorable scenes, especially one regarding a staircase (which I won't spoil).\n\n It doesn't boast incredible depth or anything extraordinary, so don't expect something like The Godfather, but has a satisfying and entertaining enough plot along with a great cast that helps make what could've been a somewhat sprawling drama, into a very good, classic cops vs Al Capone thriller from the amazing Brian DePalma, with its great (if inaccurate) look at the Prohibition-era.",
            "review_date": "2013-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you want to see a good DePalma gangster film,  Carlitos Way.  If you want a good De Niro gangster film,  Goodfellas or Casino will do.   This is a sub par work from two greats, which is strange to me.",
            "review_date": "2013-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "always enjoy this movie, wasn't until recently I realized Robert DeNiro was Capone, now I enjoy it even more.",
            "review_date": "2013-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the movie Gangster Squad wanted to be.",
            "review_date": "2013-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching the IMDb Top 250, this was #249. The tone of this film was set from the first scene, with Robert De Niro showing us what Al Capone is all about. With a strong cast, including Kevin Costner and Sean Connery, they set about telling a compelling tale of Law vs. Outlaw. Interestingly, despite Connery delivering an Oscar-winning performance, Empire voted his accent the worst in film history. There is some consensus that the film drags out slightly in the second half, but with a couple of twists and turns later on, the viewer is left satisfied, and therefore I gave it 83 out of 100 (4 stars here).\r\n\r\nhttp://toptwofifty.wordpress.com",
            "review_date": "2013-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An Oscar worthy performance Robert De Niro presents( once again!) as Al Capone!",
            "review_date": "2013-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thank god for Sean Connery otherwise this movie would of been a complete bust. Decent action and the only other thing that kept me interested is that its in Chicago.",
            "review_date": "2013-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic gangster movie.",
            "review_date": "2013-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brian DePalma,Kevin Costner,Sean Connery,Charles Martin Smith,Andy Garcia and Robert De Niro. If you expect something less than a top notch film you should be beat up! Taking a more realistic look at Chicago crime, The Untouchables is classic work of art yet again by Brian DePalma worthy of innumerable viewings just like any other one of his movies.",
            "review_date": "2013-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "De Palma's winning effort includes a phenomenal cast and gripping direction. Costner and Connery are on fire especially with De Niro on the flip side. The train station scene is incredible and the theme touches on marriage and becoming what you fight. The 30s war on alcohol reminds us of what the law leads to no matter the intentions and how what's right doesn't change even if the law does.",
            "review_date": "2013-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of those films I thought I had seen from how much it's referenced. Sometimes all that build-up can ruin it, but the film was so understated that it actually doesn't. Really enjoyed how history was displayed here, right down to the shot guns.",
            "review_date": "2013-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Malone: Don't wait for it to happen. Don't even want it to happen. Just watch what does happen.\n\n\"The Chicago dream is that big\"\n\nI don't know what it is, but I just found The Untouchables to be lacking the power to be a gangster classic. I mean sure",
            "review_date": "2013-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Add a Review (Optional)",
            "review_date": "2013-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is violent, funny, interesting and down right corny. It's a great movie.",
            "review_date": "2013-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great movie Connery steals the show. billy drago also shines in this.",
            "review_date": "2013-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A little disturbing at times, but a good crime drama with some great actors.",
            "review_date": "2013-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing Gangster film! It`s very well directed by Brian De Palma.",
            "review_date": "2013-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a huge fan of the mob/gangster genre, I can't help but say that I was dissapointed with The Untouchables. With a great cast and a cool premise, the film should have been much better. Unfortunately, over the top performances (Robert De Niro) and cheesy dialouge ruin what could have been a great addition to the genre. The movie is undoubtedly entertaining but not too much else. Brian De Palma isn't exactly a great director, but he manages to make a pretty enjoyable film. What could have been terrific ends up being average with 2 good performances from Sean Connery and Andy Garcia. Other than that, I never understood the hype towards this film. Sure some action scenes were cool, however The Untouchables is a film that is built on clichÃ (C)s and relies solely on entertainment to make up for it. If your looking for a great gangster flick, check out The Godfather Trilogy and/or Goodfellas. The Untouchables isn't the best in the genre, but nonetheless enjoyable for what it is.",
            "review_date": "2013-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie they just don't make movies like this anymore!",
            "review_date": "2013-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "was good when it came out, doesn't hold up well",
            "review_date": "2013-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you like still shots that go for at least 40 seconds longer than they should, Kevin Costner looking pensive, and Robert De Niro totally phoning his performances in, you'll love \"The Untouchables\". Never have I seen so much talent put to such terrible use.",
            "review_date": "2013-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A mob film that displays the harsh reality of what life was like for the police in the Prohibition Era and is captured very well by the cast and crew.",
            "review_date": "2013-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The talented cast saves this movie from being a sloppy crime drama that runs all over the place, but maintains the very important nostalgic feel.",
            "review_date": "2013-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the Chicago Way.... I've been debating how hard to come down on 'The Untouchables' since I watched it again the other day. I don't know anything about the background of the film; whether it was made in a hurry or if there were problems with the production or a lot of re-shooting afterward. All I know is that with all the talent involved and the subject matter chosen, this should have been a masterpiece, a classic along the lines of 'The Godfather' or 'Goodfellas,' but sadly it doesn't even come close.",
            "review_date": "2013-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well crafted and streamlined crime drama with enough action, drama, and tense scenes to completely satisfy the audience.",
            "review_date": "2013-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gangster genre at its highest. The stairs scene is a classic.",
            "review_date": "2013-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Untouchables is a luke warm, polar film that still manages to transcend it's cliched direction and Kevin Costner's lack luster acting with a smart script.",
            "review_date": "2013-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "unintentionally funny and absolute s*** .",
            "review_date": "2013-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A different spin on the gangster genre. \"The Untouchables\" is a good, simple drama film that makes itself unique from all the other gangster films thanks to its music and diversed cast.",
            "review_date": "2013-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A proper critic of this movie probably would have resulted in a worse rating. The acting from Kevin Costner, Sean Connery and most of the other cast is below par. You'll definitely notice Costner emotionless demeanour and forced  expressions in the dramatic scenes. Didn't mind Robert De Niro as Al Capone but the film mainly concentrated on the police. The Untouchables would have benefited from showing more perspective from Capone and inside his organisation. The soundtrack was peculiar as well, the best example being when they go to bust a deal on the Canadian border and there is a constant western hero theme playing throughout. More things like cops and gangsters shooting without taking cover and never getting hit certainly removes a sense of realism. \n\nIt didn't get lower because I never got bored and the setting of prohibition and Al Capone is strong enough to carry it through. Even though I have started to expect the unexpected through watching so many Mafia/gangster films and TV shows, there are still some scenes in here that create good shock value. \n\nA better cast and director could have created a classic here. Intrigued to here other viewers thoughts (comment below if you wish) but I recommend Boardwalk Empire if, like me, you prefer a gritty interpretation of the prohibition period.",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While Connery is top notch, and De Niro does a decent job as Capone, this Gangster flick is troubled by Costner in the lead, whom I never find particularly entertaining (he is too dull).  Historically speaking this film is really inaccurate, to the point where I wonder why they didn't just BASE this script on real events and change the names and have a few similar events.  Still it is an entertaining watch, especially any scene featuring Connery.",
            "review_date": "2013-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "FINALLY got around to this classic. I'm such a sucker for historical pieces. America's cultural history is so fascinating. De Niro was ridiculously spot-on. One of Costner's stronger roles. A young Andy Garcia is impossible to disappoint. Sean Connery stole the show. A Morricone masterpiece, as well.",
            "review_date": "2013-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Here end the leason.  Great movie",
            "review_date": "2013-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slick on the surface but loaded with artful touches, Brian DePalma's classical gangster thriller is a sharp look at period Chicago crime, featuring excellent performances from a top-notch cast.",
            "review_date": "2013-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Untouchables, by Brian De Palma, was quite a hit when it came out and for good causes. Action, violence, and blood done with a touch of class, a solid dose of heroism, and some drama.\n\nThe theme music is excellent. The rest of the soundtrack, though, is not always up to the same standard. Sean Connery is very good, as well as Robert De Niro. The same cannot be said for the others, like Kevin Costner who did give a good performance, but not one of his best.\n\nThe costumes are great, especially the suits, thanks to Giorgio Armani. The story is uninventive, yet interesting, even if the events seem to move along too quickly, giving us the impression that everything happened at the same time. The sets are great, and detailed. However, the dialogs of the good guys are rather simplistic, to the exception of Connery's.\n\nThe film is good entertainment, especially if you like old prohibition cops versus gangster flicks.",
            "review_date": "2013-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although I felt there were a poor scenes with bad performance but still an excellent movie",
            "review_date": "2013-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't understand the good ratings for this movie. The pacing dragged, plot points were laughably predictable, Costner's acting was wooden, and the musical score just did not fit emotionally with any of the scenes. (Connery's scenes were fun, at least.)",
            "review_date": "2013-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best I've seen for Kevin Costner. De Niro is good as always. I just love anything Al Capone related.",
            "review_date": "2013-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For seeing it twenty years after it was made, it was awesome.",
            "review_date": "2013-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Director Brian DE Palma's best film has magnificent performances all around the table especially Connery. It also has rich direction, amazing screenplay, excellent score, fantastic photography, incredible Art direction-Set decoration, terrific costumes, marvelous sound, stunning editing, and mind-blowing special effects (the best of all time) The best of 1987. One of my all time favorites.",
            "review_date": "2013-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Besides Sean Connery's fantastic performance, this is one of the most generic, aggravating, and downright silly gangster films I have ever seen.",
            "review_date": "2013-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Drama from first to last.  Nice direction and great acting, particularly by DeNiro, Garcia and Connery.  First rate storytelling.",
            "review_date": "2013-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "He beat that bitch with a bat... Love it!",
            "review_date": "2013-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The cast makes this movie. As well as the look, music and action. Brian DePalma's greatest movie.",
            "review_date": "2013-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a flick it was cool, especially for 1987. However, I found the soundtrack wildly inappropriate and made it less enjoyable than if there would have been no music at all.",
            "review_date": "2013-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is well casted, but some parts of the acting feel forced. The film feels rushed or drawn out in odd places. Character development Is nonexistent. The horribly uninspiring/corny soundtrack does not help. However some aspects of the film are masterfully done. Connery is outstanding as a supporting role. The main issue I have though is The Untouchables feels more like a broadway play that was recorded than an actual film, at least by the style of acting and script the cast was directed to perform. The cinematography is also nothing special for the most part. Mediocre angles. The Untouchables will either be seen as a classic that was made with the intention of feeling very dated or a decent gangster flick released in the shadowing and intimidating post era of 70's greatness.",
            "review_date": "2013-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Brian De Palma's best films! \n\n\"You wanna know how to get Capone? They pull a knife, you pull a gun. He sends one of yours to the hospital, you send one of his to the morgue. *That's* the *Chicago* way!\"",
            "review_date": "2013-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From the opening scene to the end credits, this film had me. The cast alone makes this film worth watching.",
            "review_date": "2013-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies about Chicago ever made. Inspiring.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hated the ending..",
            "review_date": "2013-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting film, mainly because of Sean Connery and Robert De Niro's acting, and Brian De Palma's excellent directing. Kevin Costner isn't the best, but that's fine because he's normally never in a scene without one of the better actors. De Palma excellency with a camera shows in this film, from the opening overhead shot of Capone (De Niro) getting a shave, to the masterful tracking shot through Malone's (Connery) house, to the somewhat cheesy staircase/stroller scene. Good historical fiction film, with a few inaccuracies. Frank Nitti (Drago) is very creepy also.",
            "review_date": "2013-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I will keep this short and sweet. One of and perhaps the most overrated mobster film of all time. Absolute bore fest.",
            "review_date": "2013-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining..dont expect a Godfather like standard.",
            "review_date": "2013-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great performances and great direction make this a superb action film. I wish Costner was a bit more charismatic as Eliot Ness, but overall the pieces come together for a great movie.",
            "review_date": "2013-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic gangster movie...Connery has all the best lines though \"typical wop, brings a knife to a gun fight....Get outta here ya diego bastard\"...then he goes and gets shot Doh!",
            "review_date": "2013-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not only is The Untouchables a film that is showcased by performances from Sean Connery, Robert De Niro, and Andy Garcia but is carefully directed by Brian De Palma.",
            "review_date": "2013-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Short of the Godfather, gangster movies usually don't have the triumph of this film.",
            "review_date": "2013-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With this film, Brian de Palma proves that he knows how to do two things very well: compose a shot and tell a story. Its not perfect, and its a little too sentimental for my taste, but still a very well-done film.",
            "review_date": "2013-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good but could have been much better.",
            "review_date": "2013-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Directed by Brian De Palma, written by David Mamet, adapted from the 1957 novel by Eliot Ness, which in turn was made into a TV series that ran from 1959 to 1962. This is an exciting and entertaining thriller with an amazing cast. While the film did take some liberties with what really happened, that's irrelevant, De Palma creates a stunning piece of screen entertainment that will never age. In 1930, Al Capone (Robert De Niro) has control of Chicago, bring in liqour and alcohol from Canada during the Prohibition. Bureau of Prohibition agent Eliot Ness (Kevin Costner) comes to Chicago to bring down Capone, but he finds it difficult because of corrupt policemen, but Ness finds one honest cop, Jim Malone (Sean Connery) to work with, he convinces Ness to get a team from the police academy, who haven't been influenced by Capone, and they go with George Smith (Andy García) and accountant Oscar Wallace (Charles Martin Smith). They declare war on Capone's empire, but Capone fights back and makes it personal. It's a great piece of entertainment, and it's brilliantly filmed and has an unusual yet fitting score by Ennio Morricone. It's got some brilliant performances, and Mamet's script has some brilliant dialogue, and it's cast act it out superbly. It's a great crime thriller.",
            "review_date": "2012-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Highly entertaining, and a good thriller, Connery steals the show with his role as Malone the Irish cop. DePalma and company catches the style of the time period, and De Niro - though a surprising choice for Al Capone - proves himself once again.  The one things that lack in this movie are historical inaccuracies.",
            "review_date": "2012-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The cinematography has withstood the test of time. Everything else? No such luck.",
            "review_date": "2012-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie I liked how it really felt like those 1940s movies !!",
            "review_date": "2012-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For those of you who liked Scarface - This one was just better.  Probaby because of my Chi-town roots...",
            "review_date": "2012-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not an amazing movie, but it still holds up as a pretty good movie",
            "review_date": "2012-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a film I saw many years ago and have been wanting to see again for some time now. Fortunately it turned up on TV recently and I was able to record it. A very slick telling of the story of Eliot Ness; his team of â~Untouchablesâ(TM) and their fight to bring down 1930â(TM)s Chicago gangland leader, Al Capone. I have the impression an awful lot of poetic licence was used here, but then I guess the idea is to make it entertaining after all! Hereâ(TM)s a very brief summary before I give you my thoughts.\n\nItâ(TM)s 1930 and Chicago is virtually the property of gangsters like Al Capone (Robert De Niro). They have the police, the courts and all the city officials in their pocket giving them free reign to peddle illicit booze and drugs (prohibition was still in force then). Enter Treasury Agent Eliot Ness (Kevin Costner) who has vowed to rid the city of these parasites, and in particular Capone. He soon finds that a corrupt police force is no help and so recruits a small group who are incorruptible (or Untouchable as the title suggests). The group members are Ness (of course), Jim Malone (Sean Connery), Treasury Agent Oscar Wallace (Charles Martin Smith) and Agent George Stone (Andy Garcia). They begin a violent campaign, taking down Caponeâ(TM)s empire piece by piece but there is never any evidence linking Capone directly to anything illegal. They eventually come across a ledger that may give them the break they need, but itâ(TM)s encoded and the guy that wrote it is heavily guardedâ¦ Iâ(TM)ll leave it there or I may say too much.\n\nAll the performance are excellent, I think Sean Connery got an Oscar for his portrayal of Malone. I thought Robert De Niro was particularly good as Capone and Kevin Costner did a very decent job as Ness. I hadnâ(TM)t realised that the score was written by Ennio Morricone, and now I know that I also know why I like it so much. The film itself is very well made with some quite memorable set pieces and some nicely phrased dialogue. Itâ(TM)s quite an adventure although Iâ(TM)m not entirely sure about its historical accuracy. As a piece of entertainment though, it does a very good job and I found it well worth a viewing.\n\nSteelMonsterâ(TM)s verdict: RECOMMENDED\n\nMy score: 8.0/10",
            "review_date": "2012-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a biggie in the eighties. Everyone saw it and everyone loved it but what once stood up as outstanding for a teenage boy doesn't have quite the same impact on an adult. I now find it passable. Maybe it's my first Mr. Costner who is too uncool for school.",
            "review_date": "2012-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story is not a very different one, it is predictable. But the acting by all the characters is worth watching, nothing out of the book, de Nero is the most impressive for me, but others also put up a great acting display.",
            "review_date": "2012-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Glossy and stylized, The Untouchables is a smart glimpse at Prohibition-era Chicago, boasting first-rate performances from first-rate actors.",
            "review_date": "2012-12-11",
            "source": "rt",
            "lang": "en"
        }
    ]
}