{
    "rating": 8.8,
    "release_date": "1987-11-18",
    "num_reviews": 130,
    "genres": [
        "Biography",
        "History",
        "Drama"
    ],
    "summary": "This sweeping account of the life of Pu Yi (John Lone), the last emperor of China, follows the leader's tumultuous reign. After being captured by the Red Army as a war criminal in 1950, Pu Yi recalls his childhood from prison. He remembers his lavish youth in the Forbidden City, where he was afforded every luxury but unfortunately sheltered from the outside world and complex political situation surrounding him. As revolution sweeps through China, the world Pu Yi knew is dramatically upended.",
    "reviews": [
        {
            "content": "Though maybe dated a bit (I found it a bit of a tough sit through this time out) this is one sweeping epic about the last Emperor of Manchuria / China and, when various government people took over, how various government people screwed him over, eventually winding up in a work camp prison. It's majestic, glorious to look at, but by the 2 hour mark, your butt will start getting sore.",
            "review_date": "2023-04-08",
            "source": "rt"
        },
        {
            "content": "I watched it when it was released and loved it. Now upon my second look, 35 years later, I see the deep flaws. The sets were fantastic; on-location in the Forbidden City! But the artistic cost paid by Bertolucci & Producers was to portray any enemy of the Chinese Communist Party as a one-dimensional cartoon character. Strangely, Puyi who was contemptable in real life but portrayed as a sympathetic victim of history in this Italian-take on 20th century China made for an American audience . Everyone else in his entourage was corrupt, treacherous, addicted or otherwise shifty. Bertolucci was doctrinaire - class struggle & party discipline are reoccurring themes in all his movies",
            "review_date": "2023-03-31",
            "source": "rt"
        },
        {
            "content": "\"You went to Manchuria by your own choice because you wanted to be emperor again!\"\n\nWas there some sort of personification realized and narratively studied? This humane masterpiece dramatizes China's titular societal finalization of Puyi's life as he, toddler aged, was taken from his home after being picked by an ailing empress to lead the nation. The framework finds him captured by the Red Army as a war criminal in 1950, and he recounts his childhood and how his reign led to his current situation. He had any sort of luxury, along with blinded power since he was forbidden to ever interact with the outside world beyond his kingdom-like Forbidden City, including any complex politicism. His shrunken world dramatically changes as revolution sweeps through China that eventually exposes him to the outside world, with his nurtured thirst for power retained as a form of denying the commonfolk status.\n\nEven when he got imprisoned later in life, the only difference is the lack of the luxurious lifestyle whereas everything was done for him, meaning he's been imprisoned for most of his life from the entire sheltered childhood to exposed adulthood. As dramatization goes, it doesn't fully embody the whole story to the behavioral-wise extent from looking at omitted details regarding the usual sorts of historical inaccuracy. But even when acknowledging those afterwards, it adds into the understanding how the storytelling process enables us to sympathize with Puyi's imprisoned soul that nurtured certain addiction he just couldn't pull himself away from till much later.\n\nMaybe director Bernardo Bertolucci indeed considered the other factual side and offered as glimpses as prompts then focused on finding the humane center that not many could dive deep for. The final scene's beauty perfectly concluded one's life story and everyone's currently fed perception, coming off as symbolically poetic along the respectful lines that only film form could artistically deliver as visual addition to the facts. There are historical texts between carried eyewitness accounts, if not lost in translation along the way, and autobiographies detailing what could be considered a whole story with inspired open-ended speculations contributed from the side. This film may be considered a classic in its own right over the unseen angles accumulated into a perfect resolution over its communication towards modern perceptualized presentations.\n\nAs for its epic standard, the soulful apparatus signifies the elemental growth whilst arguably an unconventional biographical film that narratively adds onto the facts, leaving the grandeur apparently relied through the cinematography defining that scale. This throws back to previous epics with similar scopes that now dimmed down as very rare occasions. It functions like a carriage but also as an enhancement as it maintains distance amidst certain dimensions while capturing details purposely over their relevance rather than going at every angles. Efficiently achieved by Vittorio Storaro, who peaked then after \"Apocalypse Now\" with the same stunning vision.\n\nWe may keep on finding that epic picture being truly the last stemmed by inspiration from Hollywood's Golden Age, \"The Last Emperor\" is possibly a time capsule looking back at similar grandeur right before the descriptively categorized genre's modernization. The fitting collaboration of Ryuichi Sakamoto, David Byrne and Cong Su provides transportive music that heightens the story and its mesmerizing scale with hinted poeticism throughout. Brilliantly performed with professional ethics in boldly tackling specified hefts, particularly led by John Lone resurrecting Puyi's second chance of life just to retell the story with aligned spiritual passivity. This realized retrospective, albeit questioned nativism under differential tongues even though it enables full envelopment for accessible entertainment value, is admittedly thought-provoking as something to possibly consider under similar flaws proposed in the fact-based character study, but not without inevitable debates, especially regarding the platform. It's just another layer of how much of a masterpiece this film turned out to be, with its accolades rightfully certifying its grand lengths. (A-)",
            "review_date": "2023-03-24",
            "source": "rt"
        },
        {
            "content": "An amazing movie that focuses on the life of the last emperor of the Forbidden City. With stunning visuals, stellar writing, a beautiful instrumental score and brilliant cinematography that makes it worth watching.",
            "review_date": "2022-08-30",
            "source": "rt"
        },
        {
            "content": "Hauntingly beautiful score, astounding cinematography and outstanding performances bring life to this historical tragedy-however cannot get past unnecessary nudity.",
            "review_date": "2022-06-12",
            "source": "rt"
        },
        {
            "content": "It may be beautifully shot and detailed, but its overall joylessness makes it hard to justify its runtime.",
            "review_date": "2022-05-09",
            "source": "rt"
        },
        {
            "content": "A masterpiece! This is one of the finest examples of what a movie should be, and one which will be appreciated by anyone, to boot. It pleases you at every moment of its almost three-hour length and you finish the movie thoroughly satisfied from an extraordinary audio-visual-emotional-educational experience. It fully deserves every one of the nine Oscars it won (and was nominated for) -  Picture, Director, Screenplay, Editing, Art Direction, Cinematography, Costumes, Original Score, and Sound. I am listing these categories because even a layman like me could recognize the exceptional quality of the film in those disciplines. I can think of only a couple of other spoken English movies that gave me such satisfaction - \"Ben Hur\" (1959) and \"My Fair Lady\". \n\nThe movie (directed by Bernardo Bertolucci) is a biopic of Pu Yi, the last emperor of China, who was crowned in 1908 at the age of two, during a time of great instability in China, which had become a republic. Pathetically, Pu Yi's loses all control of his life after that, restricted to the Forbidden City and successively manipulated by the palace eunuchs, warlords, Japanese (who conquered Manchuria and installed him as a puppet \"Emperor\"), and the Communists. He leads a simple life as a gardener after being \"re-educated\" in a communist prison for 10 years and eventually dies without any fanfare. It is a very tragic story of someone who never had control of his life or anything in it  - despite being the Emperor of China!\n\nThis movie must be one of Bertolucci's greatest achievements - every scene is so poignant and memorable. Even the sex scenes are so sensuously & elegantly portrayed, unlike the tawdry affairs in Hollywood movies. Conversely, Bertolucci does not spare us the brutalities of war (such as the rape of Nanking) - he does make a point! And the canvas is so huge, covering the Chinese imperial hierarchy, the Japanese conquest of Manchuria, World War 2, and the Chinese revolution. You could say Bertolucci out-Leans David Lean, the master teller of epic tales! There are so many visually exquisite and emotionally wrenching scenes - soldiers streaming down to the tennis courts, Pu Yi vainly running after his departing wet nurse, his wife eating flowers at a state ball, Pu Yi vainly running after his departing wife, the revolutionary song and dance sequence by the Red Guards - the list goes on and on.\n\nAs we afterward ponder over this cinematic achievement, one of the inexplicable questions which arises is: how did the western mind of Bertolucci capture the Chinese environment and ethos so perfectly? It is best to avoid such cosmic questions and to simply enjoy the work of a genius.",
            "review_date": "2022-04-12",
            "source": "rt"
        },
        {
            "content": "Beautiful film initially set in 2 time periods: the past when a young boy becomes emperor of China and decades later when he is re-educated in a Communist prison. The film covers the emperor's loss of power and change of persona during his time in prison. The film contains amazing scenes set in the Forbidden City. The acting is very good. The overall story is interesting, but could have shown a bit more reflection on the emperor's later life.",
            "review_date": "2022-03-09",
            "source": "rt"
        },
        {
            "content": "The Last Emperor is considered as one of the great epic films of the 1980's, much due to its cinematographical brilliance, but also because it was filmed on true location in the Forbidden City, as the first ever permitted to. That's quite a piece of art in itself, and particularly the first half of the film, basically taking place in this amazing scenery is outstanding. It also works marvellously as a reverse retrospect to the emperor's, or Puyi's, later destiny, where he has become a long time prisoner of the Chinese Communist Revolution. The absurd contrast between the ancient reverence and awe for him as a holly figure in his imperial court, and the degrading simplicity of the state prison is prominent and intriguing, as both circumstances made him a kind of prisoner. However, in its final half the film sadly loses some of its rythm, as so many historical factors come into play. Maybe 163 minutes just wasn't enough after all. Painting a true picture of Puyi and his relations with the Japanese is complicated, but many aspects about this are left out, toned down or given far too little space, like the time he spent in Soviet asylum pre to the Chinese captivity. His emperor personality really was rather remorseless, more disillusioned and obsessed with his holy role than described in Bertolucci's film, but Puyi's personal transformation during ten years in a so called re-education camp was more radical, and his emotional reaction to the final pardon from Mao also stronger. Nevertheless, if not an absolute masterpiece, this film is truly one of a kind.",
            "review_date": "2022-03-08",
            "source": "rt"
        },
        {
            "content": "Told a whole man’s life and a good chunk of history in a concise and interesting way. It was a big undertaking to nail all of the costumes, culture, and traditions involved with the emperor. ",
            "review_date": "2022-02-20",
            "source": "rt"
        },
        {
            "content": "Great cinematography and story telling, but boy was that a long watch. For a regular audience member trying to sit through this without being a full fledged history buff, it is a feat.",
            "review_date": "2021-12-02",
            "source": "rt"
        },
        {
            "content": "Awesome spectacular movie about the Last Emperor of China!!!!",
            "review_date": "2021-09-05",
            "source": "rt"
        },
        {
            "content": "Visually magnificent, but very slow going.",
            "review_date": "2021-08-20",
            "source": "rt"
        },
        {
            "content": "A history of modern China as seen through the eyes of the last emperor.  Moving.",
            "review_date": "2021-05-12",
            "source": "rt"
        },
        {
            "content": "Bernardo Bertolucci's \"The Last Emperor\" is an ambitious, lavish and sweeping historical epic that offers an insightful look at the eventful life of the Last Emperor of China. With his award-winning feature, Bertolucci crafted a gorgeous historical drama about the life of the legendary emperor of China. Using spellbinding cinematography, Bertolucci draws viewers into the world of an emperor that struggles with customs in the Forbidden City of Beijing. From intimate close-ups to extraordinary establishing shots, the cinematography keeps viewers immersed in the film's Imperial setting. Bertolocci showcases immense control of craftsmanship over the production design, costumes and musical score, using these elements to create an unforgettable cinematic experience. It is hard to not praise the powerful performances from the cast. John Lone delivers one of the finest performances of his career as the adult Puyi. With mesmerizing expressions, he conveys the angst, desperation and perseverance of a young man that struggles to assert authority as a majestic king. The supporting cast, which includes the legendary Peter O'Toole is also spectacular and worthy of recognition. Although \"The Last Emperor\" is undeniably a riveting historical drama, ultimately it is not a flawless film. At nearly three hours, it is unevenly paced and suffers from an extended running-time. Moreover, its story can be hard to follow for viewers that are not well-versed in Chinese history. Nevertheless, fans of historical dramas will definitely enjoy \"The Last Emperor\" and so will movie-goers seeking enlightening entertainment. At a time when modern audiences have never heard of the last emperor of China, it's a stirring reminder that the stories of legendary Chinese sovereigns are worth retelling on the big-screen.",
            "review_date": "2021-02-26",
            "source": "rt"
        },
        {
            "content": "The Last Emperor is one of those films that truly reminds you that there are so many vastly different worlds, within this planet. It's beautiful, wide scrope transports your mind into a story that charms you with it's unfamiliarity.",
            "review_date": "2020-12-22",
            "source": "rt"
        },
        {
            "content": "Wow . A lot of good things in this movie to watch",
            "review_date": "2020-12-21",
            "source": "rt"
        },
        {
            "content": "Amazing historical film with a superb wardrobe, filmography, scenography, so on...\nIt is a film that everyone should watch. This is the incredible true story of the last emperor of China Puyi.",
            "review_date": "2020-12-19",
            "source": "rt"
        },
        {
            "content": "The perspective and narrative are obviously very Western in execution but Bertolucci was making this for American and European audiences. It is accessible history that is still fairly honest. I do wish the final section was a lot longer as I think that's where the film's most compelling stretch falls.",
            "review_date": "2020-12-18",
            "source": "rt"
        },
        {
            "content": "Magnificently directed by Bernardo Bertolucci",
            "review_date": "2020-12-16",
            "source": "rt"
        },
        {
            "content": "Another good exotic epic. Not gripping but an interesting tale and clearly well produced. A decent enough best picture winner.",
            "review_date": "2020-12-13",
            "source": "rt"
        },
        {
            "content": "More than anything else \"The Last Emperor\" transported me into a different era very convincingly. The attention to set design, costume design, and general visual flair make this a gorgeous movie to look at. The movie is fairly long but it is also a historical account of a real person, and I don't really feel anything could have been taken out. However, this doesn't change that the movie starts to become somewhat boring and long-winded in the final act. I liked how the movie ended and was consistently fascinated by it, but it definitely one of those slower movies that would be tough to watch again. Overall, even if you're not a history buff, this is an interesting movie that is often great to look at.",
            "review_date": "2020-10-13",
            "source": "rt"
        },
        {
            "content": "In this film you can see how much Bertolucci mature as a filmaker, he tells the story without the use of unnecessary dutch angles, movement of the camara over it's own axis, much more focus storytelling, he focus on the main character's journey and leaves subplots aside. Music, art direction, costume design are fantastic.\n\nThe history of China in those years is fascinating by itself.\n\nEnding is very poetic and sums perfectly the movie and Puyi character.",
            "review_date": "2020-09-12",
            "source": "rt"
        },
        {
            "content": "Let's return back to history epics, one set on the other side of the Earth. As you can tell from the title, The Last Emperor is about the life of the final emperor of China, Aisin-Gioro Puyi (John Lone). The movie chronicles his childhood as emperor of the Qing Dynasty, his private lesson with a Scottish tutor Reginald Johnston (Peter O'Toole), his arranged marriage to Wanrong (Joan Chen), his reign of Manchuria, and the communist overthrow. His arc is that once Puyi becomes ruler, his followers blind him from reality and he is prohibited from exiting his palace grounds until a dictating government forces him out. When he ruled China, he was forbidden to visit his wet nurse and, when he ruled Manchuria, he was stripped away from his wife and his dead son. All of them result in his eunuchs and servants closing the gate in his face, Puyi commanding to open them, and the servants refusing. By repeating this arc in the second act, Bernardo Bertolucci tells us that the former emperor was as powerless during childhood as he was during adulthood, all while wearing the same imperial suit. That same suit was given to him since he was four years old and continued to burden it even after the Reds took over. Presently a free man, Puyi returns to his old home, the palace in the Forbidden City, and reunites with his old throne. Therefore, The Last Emperor is about the descent of an imperial icon, one who's glued to the royal family for all eternity. \n\n(4 Pet Crickets out of 5)",
            "review_date": "2020-07-23",
            "source": "rt"
        },
        {
            "content": "More visually stunning than anything else.",
            "review_date": "2020-07-12",
            "source": "rt"
        },
        {
            "content": "An overly patient, artful epic",
            "review_date": "2020-07-03",
            "source": "rt"
        },
        {
            "content": "A film that presents a history lesson through the 20th century of China. Its not fully historical accurate but still is an interesting. Visually its a treat with the locations used very well. Seeing inside the vast Forbidden city with the last emperor. We see the emperor as a young child and how he grows up but never being allowed to leave. The film shows this scenes alongside as the emperor is now in prison for political reasons. For a large part of his life he never really knew what is was like not being trapped. The start of the films shows his attempted suicide and its a striking start to the film and which intrigued me and i wanted to know what happened. The fact that the film was spoken in English at times did not work, i wanted the native tongue. The English seemed out of place to me. There are many moments which did bore me and i none of the actors really stood out. I felt the prison scenes has the most interest with the main character having many links to his past. The colours and production were very well done. The bright colours from the past as the emperor changes through the film, with the prison scenes very much darker. An interesting film with the changing China and the changing politics.",
            "review_date": "2020-06-01",
            "source": "rt"
        },
        {
            "content": "\"The last Emperor\" by Bernardo Bertolucci - it is a trully brilliant example of historical movie.\nBernardo Bertolucci created a truly large-scale and significant film. He immortalized the life of the last emperor of the dynasty Aisin Gero - Puyi. That's why the plot is completelly based on real events.\nThe culture of China of that time is perfectly conveyed. Attention is paid to both general plans and small things. The picture is full of dancing, costumes, extras and scenery. The screenwriter was really engrossed in this sphere.\nIn my own opinion the central character, Puyi, is a amazing person which went through a lot. That's why this film was higly recommended by many reviewers and critics.",
            "review_date": "2020-05-19",
            "source": "rt"
        },
        {
            "content": "The Last Emperor won the Best Picture Oscar in 1988. I'm so glad I can cross this one off my unseen list. It was a fantastic film. Given the grandeur of the camera as it moves around China's Forbidden City, I really wish I had seen this one on the big screen. It was breathtaking.\n\nThis is the true story of Aisin-Gioro Pu Yi, the last emperor of the Ching dynasty. The story is not presented in a linear timeline, but rather through a series of connected vignettes that span back and forth through various points in time over a sixty year period.\n\nPu Yi had the role of Emperor forced on him at the age of 3, lost it, worked to get it back and along the way finds his place among those who he was raised to look down upon and rule.\n\nBoth John Lone and Peter O'Toole are more than worthy of positive recognition in their roles, but personally I was most moved by Joan Chen's haunting performance as the opium addicted Empress Wan Jung.\n\nThis one was informative as well as entertaining and visually stunning. A great film that I'm glad to have taken a few hours out to watch.",
            "review_date": "2020-05-01",
            "source": "rt"
        },
        {
            "content": "It is an incredible piece of film making and an intriguing look at China's modern history.\n\nBertolucci's historical-epic, biopic is not a character study, it is a fascinating glimpse at the tumultuous modern history of China told through an incredibly unique perspective. While the titular \"Last Emperor\" is the protagonist and audience P.O.V character, the film maintains a cool distance creating a sense of objectivity that lends greater credibility in the eyes of the viewer to the film's depiction of Pu Yi. We can at times sympathise with his dramatic displacement and disillusionment and then feel disgusted by his lust to regain power and his inhumane indifference to others. It is however important to recognise there is a difference between the film language conveying a sense of objectivity and true objectivity, the script was after all based largely off the Emperor's autobiography and it would be near impossible for the book or the film to truly capture his character wholly and without judgement. \n\nThe scale and ambition of this film is undeniable. The real locations, perfectly reconstructed sets, amazing costuming and multitude of extras feel authentic and convey the immense power and opulence of The Forbidden City. The image of a baby Emperor standing atop high stairs overlooking thousands of subjects is such a striking image that it stays with the audience all throughout the film. That impression is evoked within the mind of the viewer repeatedly during the film as the long wide-angle shots are mirrored, juxtaposing the changed Forbidden City as it rapidly declines in its grandeur. It is both beautiful to look at and a great example of visual storytelling, the Forbidden City becomes barren and seeing the Emperor small and alone we feel his isolation. \n\nThe attention to detail and meticulous craft of this only recently lost world has a strong feeling of authenticity. This is unfortunately undercut by one of the films strangest creative decisions, that being the choice to have all the characters speak English. The otherwise quality performances are diminished by the actors delivering understandably stilted dialogue in what is clearly not their first language. This awkward delivery robs the film of much of its' intended emotion. To cover such a large story and span of time, covering complex issues the film is forced to gloss over some of the finer details leading to a potential misrepresentation of some historical accuracies. Whether this was intentional or not the film glosses over the civil unrest within China during the reign and fall of the dynasty, the horrific acts that followed the Japanese occupation of Manchuria, and the conditions within the \"re-education\" camps which were used for brainwashing and forced labour were accounted to be far more brutal with many prisoners suffering from starvation and few prisoners ever being released. \n\nDespite the clunky dialogue, historical inaccuracies and very long run time, the film remains an incredible achievement. Telling an enthralling epic about a lesser known side of modern history put to screen with beautiful design and purposeful cinematography. Imperfect yet impressive.",
            "review_date": "2020-02-03",
            "source": "rt"
        },
        {
            "content": "A mesmerizing depiction of an extraordinary life.\n\nBernardo Bertolucci's historical epic drama The Last Emperor (1987) is a fantastic film recounting the endless imprisonment of China's final emperor Pu Yi. Bertolucci was a maestro as a film director. His auteur style continued to display dreamy cinematography, sweeping grandeur, classy thoughtfulness, and heartfelt writing. The Last Emperor is one of Bertolucci's finest films as he directs this magnificent feature with meticulous detail and impressive empathy for a man who lived an unusual life. I appreciate Bertolucci's usage of Chinese customs and culture with a respectful display and earnest reverence in The Last Emperor.\n\nI have to mention the heavenly score for The Last Emperor makes you feel like you're floating on clouds while watching Bertolucci's phenomenal film. Composers Ryuichi Sakamoto, Cong Su, and David Bryne reached up into the clouds and pulled down angelic symphonies for us to hear. Sakamoto himself has a cool cameo role to look out for in The Last Emperor! I adore the main theme to as its memorable melody is a joy to hear repeated throughout The Last Emperor. I will always remember The Last Emperor's score as it's inspiring and hopeful music will be a comfort for years to come.\n\nGabriella Cristiani's smooth editing keeps a leisurely pace, so that you are never bogged down by the intimidating length. Her clever cuts keep the story moving seamlessly between time periods and jumps to flashbacks. The Last Emperor feels more like an hour and a half instead of a nearly 3 hour run-time. She adds a level of artistry and class with her masterfully gentle editing hand.\n\nVittorio Storaro's cinematography crafts a serene dreamy quality for The Last Emperor. You feel like the long tracking shots and flowing panning shots keep you attention held on character reactions, so that you only ever think about their feelings rather than shallow plot points. His camera work is so wondrous that you feel like you're getting a viewpoint into the room itself rather than a recreation of the time. Vittorio Storaro's shots are a calming reassurance of the graceful capabilities of the camera.\n\nJames Acheson's costumes look gorgeous with his ornate period accurate clothing. From the emperor's decadent outfits to the average servant, everyone looks like they exist in ancient China of the past. The colors alone are inspired. Likewise, Fabrizio Sforza's make-up is outstanding aging characters decades left and right with effortless realism. You cannot tell who is what age at all.\n\nJohn Lone is so subtle in how he portrays Emperor Puyi as a lonely man, whose sheltered upbringing led him to pain and ruination. Lone gives us his best acting in The Last Emperor as his empathetically acts to express how hard Puyi's life was despite the luxury he was born with in China and Manchuria. Similarly, Joan Chen is sympathetic as Puyi's alluring and adoring wife Empress Wang Jung, who grows unhappy with her life ignored by the emperor. Her sullen disposition is most affecting when she mopes at a celebration eating a flower by herself. John Lone and Joan Chen are equally impressive in their portrayals of these depressed and isolated royals.\n\nPeter O'Toole is a welcome addition to The Last Emperor as Puyi's Scottish tutor named Reginal Flemming Johnson. His supportive and attentive character is made all the more likable by O'Toole's performance as an empathetic teacher wishing well for his student and friend. In a similar vein, Cary-Hiroyuki Tagawa is genuinely kind and unbelievably patient as Emperor Puyi's servant Chang.\n\nVivian Wu is devastating as the second wife to Puyi named Wen Hsiu, who wants a divorce because she cannot stand being secondary wife and lover to Emperor Puyi. Wu is affecting and tragic as she quietly leaves with resonant emotional impact. On the other hand, Maggie Han is so effective as Eastern Jewel that you hate her immediately and despise her for her betrayal by the end. She's very playful and cruel at the same time.\n\nLastly, I liked Ruocheng Ying as the Governor who aids Emperor Puyi while he is imprisoned by the Japanese throughout World War II. He feels like a real person among the faceless inmate masses. Ric Young is funny and scary as the interrogator in the prison camp too!\n\nIn all, The Last Emperor is both a peerless display of Bernardo Bertolucci's filmmaking prowess as well as a compassionate portrayal of one man's loneliness.",
            "review_date": "2019-12-05",
            "source": "rt"
        },
        {
            "content": "Very Good. Must Watch 219mins version.",
            "review_date": "2019-08-28",
            "source": "rt"
        },
        {
            "content": "The only thing wrong with this movie is that it should not have been made in English. Besides that, it is filled with colour symbolism, amazing camera work with a story of epic proportions.",
            "review_date": "2019-08-18",
            "source": "rt"
        },
        {
            "content": "Slow pace, but a fascinating story and stunning visuals help sustain this odd and incredible story.",
            "review_date": "2019-07-13",
            "source": "rt"
        },
        {
            "content": "This film only made me hate Gandhi (1982) more as it manages to do everything that film couldn't do in less than three hours while also looking extraordinarily beautiful and focusing on an under-represented historical figure in western society. We view a fascinating period of history through the eyes of an almost entirely passive character and yet the director makes his struggle compelling as we witness how he is essentially imprisoned in the walls of the Forbidden City as a child and is incompetent living in the real world when he becomes a man. This is what grand, sweeping epics should be and who better than the masterful Bernardo Bertolucci to direct such an ambitious project.\n\nPu Yi, John Lone, becomes the Emperor of China in 1908 but rules over only the Forbidden City as the rest of the nation is engaging in revolution. He feels increasingly trapped as he grows older with his only real confidant being his Scottish tutor Mr. Johnston, Peter O'Toole. He adopts two wives, Wanrong, Joan Chen, and Wenxiu, Wu Junmei, and dreams of becoming a British man as he attempts to reform the Forbidden City with disastrous consequences. When the invasion of Manchuria occurs he is removed from the throne and re-educated by the Japanese which eventually leads to him becoming content with his simple life and afraid of the symbols of his power in his youth.\n\nThe real star of the film is the cinematography as the incomparable Vittorio Storaro, of Apocalypse Now (1979) and One from the Heart (1981) fame, lends his talents to capturing the fierce beauty of the Forbidden City. Every frame is packed with stunning moments and even scenes of an adult Pu Yi cutting his wrists appear impressive. He is able to make the audience see the location through Pu Yi's eyes as we are intimidated by the eunuchs who kowtow to him as a child and feel trapped by the restrictions of the city as he becomes a teenager. I often found myself gaping at just how fantastic the film looked and it was certainly deserving of all of the technical awards that it won.\n\nBeyond the technical elements of the film the way that Bertolucci and screenwriter Mark Peploe manage to tell this story is remarkable. We see the impact of being treated like an emperor instead of a human being on Pu Yi as he is not educated and therefore ill equipped to deal with a life absent of servants when he is removed from the throne. His discontent is obvious even while he is ruler as the influence of his tutor and his desperation to experience some of the simple pleasures that make a regular life so wonderful such as riding a bike wherever you desire can be seen. The conclusion of his story does not come with an angry, impassioned speech or a killing or a self-serious voiceover but rather with a mild acknowledgement of the fact that he was not cut out to live the life of an emperor.\n\nIn terms of performances I wouldn't call any of the actors who play Pu Yi at various stages of his life fantastic but the film is more of a cinematographers or directors movie. O'Toole is reliably good in a supporting role but it's Chen who steals the show as the innocent young wife who becomes an opium addicted train wreck as an adult. She is disturbingly childish while also being an experienced courtesan during the love scene between herself and Pu Yi and this innocence is transferred to performance as the character who even as an adult refuses to accept that they are no longer armed with servants and respected. I understand why nobody received an Academy Award nomination for their performance but they each appear to know and understand their character's motivations and work with a great script.\n\nThe 1987 Best Picture nominees are odd as I doubt that Moonstruck (1987) or Fatal Attraction (1987) would be nominated today but they are certainly more enjoyable than Black Panther (2018). I personally would have given Best Picture to The Last Emperor because I think it's an epic that goes beyond bringing the Wikipedia summary of a famous historical figure's life to the screen. This is a Best Picture winning epic that is worth seeing along with the terrific Gone with the Wind (1939) and Out of Africa (1985).",
            "review_date": "2019-05-27",
            "source": "rt"
        },
        {
            "content": "I think really highly of this movie the last emperor and I think it's supposed to be one of the greatest movie. It use three hours to show the path of China's last emperor's life road and in the other aspect, it shows the development of China from an old dynasty to a modern, or nearly modern country, due to the political enviorment of that time, I can say this movie is already beyond the limit of time background.",
            "review_date": "2019-05-03",
            "source": "rt"
        },
        {
            "content": "how could that cricket stay alive in a jar all those years? don't chinese crickets require any amount of care",
            "review_date": "2019-04-09",
            "source": "rt"
        },
        {
            "content": "Visually stunning with its shot and costumes but it's extremely slow and dragged out.",
            "review_date": "2019-04-04",
            "source": "rt"
        },
        {
            "content": "The best, GREATEST epic movie ever made!",
            "review_date": "2019-02-01",
            "source": "rt"
        },
        {
            "content": "Wish this movie could be shot in Chinese, lost of a lot of substances when the fucking emperor of China speaks English. But overall, one of my favorites of all time",
            "review_date": "2019-01-14",
            "source": "rt"
        },
        {
            "content": "This film was great.",
            "review_date": "2018-11-13",
            "source": "rt"
        },
        {
            "content": "Stunning from top to bottom.  Legendary filmmaker Bernardo Bertolucci's account of a defining period in China's history.  Truly awe inspiring.",
            "review_date": "2018-08-23",
            "source": "rt"
        },
        {
            "content": "Beautifully filmed?  The Forbidden City?  Wonderful. - watch a few minutes...Entertainment?  Don't waste your time.  I watch movies for the fantasy and entertainment it brings.  If I only want artistic beauty or an education, I go to a museum or school.\n\nThis is a snooze-fest and, for some reason they made it exceedingly long.  Go watch  the paint dry on a beautiful painting for the same experience..  After about 10 hours of watching this boring film and waiting for something interesting to happen, I gave up and fast forwarded it.  Not anywhere near worth the time you will spend watching it.  Life is short -- don't waste it watching this.",
            "review_date": "2018-08-05",
            "source": "rt"
        },
        {
            "content": "a brief and rigid reign..\n\nThe Last Emperor\n\n3 And A Half Out Of 5\n\nThe Last Emperor is a character driven biography about the Last Emperor of China and his journey on adapting and facing the evolving reality. The passion and enthusiasm towards the project is clearly visible which also pays off as the craft touches the audience within first few minutes which clearly shows how explicitly and beautifully the project is created. \n\nIt is rich on technical aspects like background score, production design, cinematography, costume design, sound department, art design and editing. The writing is strong and creates the anticipated among the viewers and sets the energy of the cinema with a perfect amount of tense and glorious as it can aspire to be. \n\nThe screenplay by Mark Peploe and Bernardo Bertolucci is elaborated and not over-stretched which is essential for the writers to be aware of, which helps them filter out dull inessential sequences easily. Bernardo Bertolucci; the director, has done a tremendous work on executing the script and not lose the grip on any frame of it, which seems possible considering the runtime of the feature. Each and every actor linked to the feature has given its all in, since being aware of the opportunity and it is communicated swiftly with the audience. \n\nThe Last Emperor is a brief and rigid reign whose journey is depicted with all passion; all love; all heart.",
            "review_date": "2018-07-04",
            "source": "rt"
        },
        {
            "content": "Bloated, kverwrought, and sanctimonious. Was anyone moved by this museum piece? The Academy chose this over the delightful and warm classic Moonstruck because it feels it must honor films with gravitas over films with a soul. #Oscarhasnosoul",
            "review_date": "2018-07-01",
            "source": "rt"
        },
        {
            "content": "As beautiful to look at as it is tedious to watch, The Last Emperor is an incredible visual feat. Not just because it's the first western film to be shot in the Forbidden City, but because of the costumes, set designs and the Directorial style, which captures the elegant beauty and eventual chaos of the Chinese Cultural Revolution. John Lone gives a tough if slightly passive performance as the titular Emperor, at first unwilling to accept his position and later desperate to hold onto it. Where the movie falls down is it's pacing. After doing a little research, I discovered that I was watching the extended edition, which was meant to be aired as a TV special, chopped up into several chapters for weekly viewing. But when viewed as a whole, it's unbelievably slow. Like most historical epics, the slow, sweeping movements of the camera over landscapes, ancient buildings and throngs of people looks gorgeous, but it plays havoc with the ebb and flow of the film itself. So many sequences feel overextended, like the Director simply let them go on because he liked how they looked. It feels like the film was intentionally trying to be longer for no other reason than it would seem more, for lack of a better word, epic. Having worked in China for years, I was fascinated to see the development of the Emperor, his restrictive role in society and how the country adapted to life after his reign, but everything took so long to happen or say that the message quickly became lost. The film certainly made me want to learn more about China in the depicted time period, but it failed to engage me with the characters or the narrative. I hope to see the 2-hour 40-minute version in the future, as I'm sure it would clear up most of the pacing issues, but as for the story itself, it just didn't speak to me.",
            "review_date": "2018-06-08",
            "source": "rt"
        },
        {
            "content": "I saw \"The :Last Emperor\" when first released theatrically during 1987. It's a visually stunning, lavish, beautifully photographed, artistic looking film in every way. There are some weaknesses in the storytelling and the main character of Pu Yi proves to be weak minded as an adult, after China ends thousands of years of monarchy and adopts communism. We have an Italian director here, an English speaking film, all set and photographed in China.. Mandarin Chinese was the obvious best language choice here, but I understand director Bernardo Bertolucci's decision using English, to make his historical, biographical epic film reachable to a wide mainstream audience.",
            "review_date": "2018-04-29",
            "source": "rt"
        },
        {
            "content": "The Directors Cut is my all time favourite movie",
            "review_date": "2018-03-22",
            "source": "rt"
        },
        {
            "content": "A journey through the scope of the capturing of locations is enough to exhaust you. But when you are additionally enduring the politics, the landscapes, the luscious music and art department, the raw emotions, and deeper questions you feel as if you have gone through history itself. What an unbelievable way of taking a viewer on a journey.",
            "review_date": "2017-12-31",
            "source": "rt"
        },
        {
            "content": "I can see why it won best picture, its definitely something the academy would like: An epic period film. Some interesting historical stuff in a pretty good movie.",
            "review_date": "2017-10-21",
            "source": "rt"
        },
        {
            "content": "This lavish, and beautiful epic pulled me in and never let go. It truly is a wonderful fully realized epic.",
            "review_date": "2017-10-04",
            "source": "rt"
        },
        {
            "content": "While beautiful features to the film certainly add to it, overall I found it to be a quite slow film without much drama. Some really emotional scenes with Puyi as a child are soon forgotten about and he becomes a character simply chasing a throne without doing much chasing, with a lot of stalling and slow scenes along the way.",
            "review_date": "2017-08-17",
            "source": "rt"
        },
        {
            "content": "10 out of 10:\n\nAn interesting story, great acting, gorgeous costumes and sets, and who could forget the astounding cinematography that makes The Last Emperor an epic delight.",
            "review_date": "2017-08-05",
            "source": "rt"
        },
        {
            "content": "Truly epic, particularly because I watched the 218 minute cut created for Italian television rather than the theatrical release.  Bernardo Bertolucci's film follows the last emperor of China, Pu Yi, who was brought to the Forbidden City at age 3 but forced to abdicate only a few years later in 1912, retaining some privileges until he and his entourage were expelled in 1924.  The film views these events from the future, in 1950, when Pu Yi is imprisoned by the People's Republic and put through a 10-year period of re-education, eventually recanting his right to the throne.  However, we see his journey to this point as a painful one, as he grows from a selfish sheltered boy into a wilful adolescent, sparring with this Scottish tutor (Peter O'Toole, at home in another epic after his tenure with David Lean) and demanding to be treated as special.  Eventually he is played as an adult by John Lone and Joan Chen is chosen to be his bride (he also has a concubine or two).  All of this happens quite outside of the public eye - and Pu Yi is apparently unaware of the various transitions in Chinese society and government outside the walls of the Forbidden City (where the production actually filmed, with the blessing of the current Chinese leadership).  His ignorance and desire to return to ruling the entire country made him an easy pawn of the Japanese who eventually took over Manchuria (from where the emperor's family originated) and coronated Pu Yi as (puppet) leader.  In prison, he claims that his actions were forced but in flashback we see this not to be the case.  Things become depressing and decadent.  After his release from prison in 1959, Pu Yi takes on the role of gardener and, alone, after his separation from his spouse(s) and all others, he dies quietly during the era of Mao.  Bertolucci and cinematographer Vittorio Storaro make the most of this material, offering up beautiful images, richly coloured according to era (and eventually reminding one of the deco period glamour of The Conformist, 1970).  Although I suspect the theatrical cut (which won 9 Oscars) was tighter, I found this unfamiliar story engrossing, an experience that was heightened by the magnificent style of the film.",
            "review_date": "2017-06-24",
            "source": "rt"
        },
        {
            "content": "The Last Emperor lacks the flavor of most Asian cinema, but has a certain grandeur that covers the entire life of a man who spent nearly all his years under so much repression that only at the end did he find happiness: as a gardener - in prison.",
            "review_date": "2017-06-21",
            "source": "rt"
        },
        {
            "content": "With such extensive Academy Award recognition to its name, The Last Emperor sounded like Bernardo Bertolucci's true masterpiece.\n\nBernardo Bertolucci is the kind of filmmaker who has proven that even in times when he cannot craft the most interesting story, he knowns how to create a visionary experience. As Stealing Beauty (1996) and The Dreamers (2003) are the only two films of his I have seen which have both lived up to this prophecy, I guess I shouldn't have been too surprised when The Last Emperor did as well. It was just more disappointing this time around due to the higher level of critical acclaim this film held over the director's other works. \nI wasn't all that familiar with the political history of China before going in to The Last Emperor so I had hoped that it would provide me some kind of historical understanding of the country. In actual fact, the audience gets as much of a sheltered perspective of the political context as the titular character. The same way that Puyi is hidden from the world in the Forbidden City in Beijing. As a result we are able to see the world through the eyes of the protagonist yet blinded to the mass amounts of history that he is missing. The fact that the story maintains such a narrow focus over such a lengthy period of time makes it an epic which is actually rather small in scale. When considering that, it just makes the film seem like an oxymoron. \nIt's clear that The Last Emperor has such a great story to it, but Bernardo Bertolucci insists on keeping the focus so minimal without knowing precisely what makes the story interesting. The beginning of the film is focused so heavily on Puyi growing up as a child granted the title of the next Emperor that essentially nothing happens for the entire first hour. The film is nice to look at for the duration of this, but the lack of actual story dynamics grows increasingly frustrated. Eventually we begin to see some things happening, but the slow pace of the film is maintained the entire time and so the sparks of intrigue are not turned into flames at any major point in the film. We are expected to just looking at the pretty pictures while little else happens until around halfway through the film, and by that point the damage is already done. Even when the story does finally begin to explore more engaging territory, the unsatisfactory build-up and continuously slow pace keep the film from making any kind of emotional impact.\nDuring this extensive waiting period, the character development doesn't prove to justify the small scale of the film. Rather than emphasizing who Puyi was as a person, the film simply presents his life as an emperor. Obviously this needed to be a key story factor in a film called The Last Emperor, but we never gain any understanding of who he truly was as a person. The film begins by showing Puyi's childhood in which we see the traditional manner a child is raised in the Forbidden City as the story intertwines this with his contemporary experiences as a prisoner of Fushun. Trying to keep up with both these time periods while the context of them is so elusive proves to just make the experience thoroughly confusing, and the already boring nature of the film makes it a chore to have to follow along with. So ultimately, The Last Emperor has a story which is too poorly focused, too confusing, too slow and too long for its own good.\nBut as with any Bernardo Bertolucci film, The Last Emperor is pretty to look at. Given that the production of the film marked the first time a European filmmaker had been granted access to film in the Forbidden City of Beijing, it's quite a momentous production. And the director has no fear for showing off as much of the land as he can. The scenery is therefore picture perfect and makes the story seamlessly believable while the added production design and costumes just help to reinforce it. The film is a magnificent spectacle of imagery which is captured with perfectly gentle cinematography that always grasps the scale of the setting it deals with, and the beautiful musical score helps to compliment the visuals by reinforcing the film's cultural grace and atmospheric strength.\nAnd even if the characters aren't magnificent, the cast in The Last Emperor make a solid effort. \nJohn Lone proves perfectly sophisticated as Puyi. He only comes into the film during the later years of the story, but he enters during the most character-focused segments of the story and manages to capture the sophistication and genuine political concern of China's last emperor. He is also assisted by Joan Chen whose natural charisma helps to spark a strong chemistry between the two when the story makes them interact. Both John Lone and Joan Chen make a memorable presence in The Last Emperor.\nOf course, it is the legendary actor Peter O'Toole who stands out in The Last Emperor. Assisted by the fact that he plays the only role in the film whose relevance to the story is explicit, Peter O'Toole's delightful charm helps to give energy to the film when it plods along at a tediously slow rate much of the time. The actor presents a naturally intelligent character who interacts with Puyi by showing some actual heart and transcending the background that all the other characters fade into. The man's natural charisma just lights up the screen and his friendly nature really pushes the film out of the bleak tone it finds itself trapped in for much of the time. Peter O'Toole's supporting effort in The Last Emperor really proves to be one of the most enjoyable assets to the film.\nThe presence of popular 80's Asian actors Victor Wong and Dennis Dun is also entertaining after their prior collaborations on Year of the Dragon (1985) and Big Trouble in Little China (1986). And as a fan of B-movie action cinema, I'm always happy to spot Cary Hiroyuki Tagawa.\n\nThe Last Emperor boasts Bernardo Bertolucci's magnificent eye for imagery and Peter O'Toole's finely-tuned charm, but the epic political story behind the narrative is forsaken for a one-dimensional depiction of an identity-ridden narrative stretched on for too long by a tedious pace.",
            "review_date": "2017-02-07",
            "source": "rt"
        },
        {
            "content": "While Bernardo Bertolucci's The Last Emperor is a stylish epic drama, it lacks historical accuracy and its excessive lenght proves to be quite bothersome.",
            "review_date": "2017-01-15",
            "source": "rt"
        },
        {
            "content": "The costumes and cinematography are top notch, and, accompained with a compelling story, make this film a great watch.",
            "review_date": "2017-01-05",
            "source": "rt"
        },
        {
            "content": "Essential viewing for any film watcher or would-be filmmaker. Essential viewing for historical purposes and life purposes.",
            "review_date": "2016-09-19",
            "source": "rt"
        },
        {
            "content": "Classic! One of those very well made films and well directed. The sceneries are fantastic. And the cinematography is top notch. Performances are over dramatic some times, not a fan of the teen version of the emperor. I think they could get another better Chinese actor than that. Also story wise, I hate it. One of those character driven films that I despise so much despite of its great writing. All I see is a spoiled brat emperor grows old and learned from his past being a prisoner. Nevertheless it is deserving to get accolades. Ideal films for the critics.",
            "review_date": "2016-08-12",
            "source": "rt"
        },
        {
            "content": "Visually stunning historical epic\n\nA very remarkable film indeed, Bernardo Bertolucci's The Last Emperor tells the astonishing true story of Pu Yi, who was crowned the last emperor of China at the age of three and died a simple gardener in Beijing in the 1960s. But the real story is about China, and its turmoil through the wars and revolutions of the 20th century.\n\nThe film's richness and beauty are almost daunting, but it's certainly a film which anyone interested in the art of cinema will want to see. The Criterion standard DVD special edition, on which this review is based, includes two versions of the film, the original theatrical release and the director's special television release. Both are digitally remastered and have the same aspect ratio; unlike the usual situation, the television release is longer, and many fans of the film think it tells the story more fully and therefore more clearly, while others prefer the more tightly edited theatrical release. I recommend the television release, provided you have lots of time --- it's very long.\n\nThe Criterion set includes many special extras and a booklet. Advisories: a couple moderately explicit sex scenes, and a few short but shocking violent ones.",
            "review_date": "2016-08-07",
            "source": "rt"
        },
        {
            "content": "Many of the critics, Ebert included, praised this film for being a beautifully filmed story of a man whose life was really a waste. It is indeed fascinating in this regard since most epic films focus on men who did great things, but this unique element is what sadly hurts the film in my opinion. I just don't see the point of a three hour film about a man whose position was fake and who ultimately did nothing but become a pleasant gardener. When the (astonishing) set that you're filming on is better than the character that your whole movie is riding on, you've got yourself a problem.",
            "review_date": "2016-05-09",
            "source": "rt"
        },
        {
            "content": "The Last Emperor (1987) ????\nSpellbinding saga recollecting the final emperor of China.A haunting, sumtous, unforgettable epic, and is among Bernardo Bertolucci's best movie. Acting, dialogue, direction, score, A generally great movie experience that demands multiple viewings.",
            "review_date": "2016-05-05",
            "source": "rt"
        },
        {
            "content": "It's somewhat ironic that I watched 1987 Best Picture winner The Last Emperor so soon after seeing 1996 winner The English Patient because the two share so many techniques, strengths, and weaknesses. It's a gorgeous piece of work in every way. The way director Bernardo Bertolucci rendered this world is astounding. It's honestly one of the most beautiful-looking films I've seen. That being said, the film is muddled and far too long. Its acting is questionable at best. And some (many) scenes felt entirely unnecessary.\n\nThe film chronicles the life of Pu Yi, who \"ruled\" over China during its most transitional period-from the early 1900s when it was a republic to the days when it was a Japanese puppet state to the time of Mao and the Communists. At the age of 3, Pu Yi was brought to the Forbidden City and was named emperor. He grew up knowing nothing of the outside world, though he desperately wanted to escape the city's walls.\n\nFlash forward many years to when Pu Yi (now an adult and played by John Lone) becomes a Chinese prisoner, accused of collaborating with the Japanese during the war. He tries to commit suicide, presumably to conceal something, but he is saved and forced to recount his entire life's story.\n\nThe film jumps back and forth between these two storylines a little too much for my taste. It's fine to use a framing device like this-The English Patient actually utilized it well-but The Last Emperor's intentions are a little too vague for it to leave much of an impact. And because the film goes on for so very long, this device gets old...fast.\n\nThe acting is not great. Peter O'Toole is on hand in a strangely small role as Pu Yi's tutor. He's gives what is without question the best performance in the bunch. John Lone is good, not great as the emperor himself. He gets better as the film goes on, and during the scenes in which Pu Yi is an older man, Lone gives off a sense of world-weariness and wisdom that feels appropriate. He's not quite as successful when he needs to play Pu Yi as an eager young leader who is desperate to spread his wings. In fact, the entire beginning of the film is a little laughable as actors of different ages try to pull off the whole \"troubled young leader\" thing.\n\nThe screenplay could have used a lot of tightening. I found most scenes with the empress(es) unnecessary at best-including the flower-eating, toe-sucking lesbian tryst with a Japanese spy (yes, you read that right). I thought the Forbidden City stuff went on a little long. It's OK to have a long film, but you run the risk of people looking for places where trimming would have been welcome. The Last Emperor is full of those moments.\n\nThe Last Emperor does have some amazing strengths. Top on that list is the incredible cinematography and art direction. The setting is ideal for a quiet sort of film that allows us to marvel at its beauty. In spurts, The Last Emperor does just that. The score is exceptional, blending Eastern and Western sounds and styles with ease. And the direction, though long in the tooth, is never heavy-handed. Bertolucci, in many ways, constructs an odd sort of biopic. Some of the themes (like Pu Yi's whole breast feeding thing) are surprising and just a little strange. I liked he doesn't resort to pure idolatry.\n\nThe Last Emperor is definitely one of the more underwhelming Best Picture winners I've seen, and it's not hard to understand why it's rarely mentioned as a bright spot in Academy history. It's the kind of film that, by and large, we've seen before, and though it boasts some wonderful imagery, that's not enough to save it from its own bloated ambitions.\n\nhttp://www.johnlikesmovies.com/last-emperor-review/",
            "review_date": "2016-03-13",
            "source": "rt"
        },
        {
            "content": "I do not think that this deserved the Best Picture award.  Hell, I am not even sure I would agree with it being nominated at all.  There are a few good scenes, but there is no story worth remembering here. I stopped caring before the first half of it was even over.",
            "review_date": "2015-12-08",
            "source": "rt"
        },
        {
            "content": "saw it in theater when it came out.  fascinating.  the ending with the cricket still behind the throne was incredible.   Good portrayal of terrible Maoist cultural revolution.",
            "review_date": "2015-11-05",
            "source": "rt"
        },
        {
            "content": "Interesting and great story. it makes me wonder how much that is added though. Well acted and I really dig that tudor character. It's a long film, a bit too long if you ask me. Could have been shortened by 15 minutes or so. At times I fail to let it grip me, somewhere near the middle, but it starts of nicely and has some great moments.\n\nEveryone is speaking English, well people that are not props or soliders or something. It felt funny at first. Unnatural and even dumb, actually. That's what bothered me the most about this film. I got used to it, but I think I would preffered it in original language. It seems like there would be a rather solid English part anyhow. It's lovely shot, that must be mentioned. 9 Oscars seem a bit over the top, even for this big, solid film.\n\n7.5 out of 10 bicycles.",
            "review_date": "2015-10-30",
            "source": "rt"
        },
        {
            "content": "Una mirada intima al declive y ultimos dias del Imperio Chino previo a la ocupacion japonesa y el ascenso del Maoismo.La escenografia,el ambiente de epoca y el vestuario son excelentes",
            "review_date": "2015-09-13",
            "source": "rt"
        },
        {
            "content": "The Last Emperor looks great and you can tell from the opening shot that this is an epic production.  Follows the life from rise to the throne to the takeover of the communists movement in China, the film stays close with the lead character and doesn't want to tell anything else.  Bertolucci puts in as much of his signature sexuality that he can and still save the PG-13 rating, the cinematography is amazing, and the performances are great.",
            "review_date": "2015-08-11",
            "source": "rt"
        },
        {
            "content": "If it is classical period dramas you are behind, this bowl serves the dish delicious. Bernardo's approach in presenting this emperor of 10,000 years who was a victim of his own glory is impeccable. One thing unique about this movie is that the very protagonist of the movie has a hollow and weak stature vulnerable to manipulation, unlike those heroic characters often encountered. Screenplay is written with a great precision in weaving scenes emotionally chronologically, developing the drama into a fantastic shape. Cinematography and costume design are successful in recreating the rich and glorious past. Finally, one will feel as if he really knew this emperor personally, such is the impact this movie casts on the audience.",
            "review_date": "2015-06-08",
            "source": "rt"
        },
        {
            "content": "The film's beauty comes more from its setting that the story itself, but if you have about 3 to 4 hours to spare, it is worth the watch.",
            "review_date": "2015-05-15",
            "source": "rt"
        },
        {
            "content": "73% on my Tomatometer.",
            "review_date": "2015-05-13",
            "source": "rt"
        },
        {
            "content": "Cinematography was so good! However, it wasn't my type of film as much as I wanted it to be.",
            "review_date": "2015-04-28",
            "source": "rt"
        },
        {
            "content": "Fascinating but oddly cold. There is so much focus on detail and ritual, and the movie keeps you at arm's length, never allowing you to get to know anyone well - it's almost Orientalist, really.",
            "review_date": "2015-04-19",
            "source": "rt"
        },
        {
            "content": "beautiful film. but i can't get past the fact that the actors were speaking english...",
            "review_date": "2015-04-15",
            "source": "rt"
        },
        {
            "content": "Layers upon layers of well done storytelling.Wonderful visuals and great work in front and behind the camera....Bravo.",
            "review_date": "2015-04-09",
            "source": "rt"
        },
        {
            "content": "Shot on location actually inside the Forbidden city, and the history and the visuals that can be seen through that on location filming is amazing, just widely amazing. Beautifully shot epic. The history of Pu Yi's life and reign is greatly explored and visualized though Bertolucci's  foreign drama.",
            "review_date": "2015-03-27",
            "source": "rt"
        },
        {
            "content": "Captures the spectacular change that can occur in a society over a single lifetime. One is awed.",
            "review_date": "2014-12-05",
            "source": "rt"
        },
        {
            "content": "Pretty good film about a man who grows up at exactly the wrong time. Very good acting, very good story, very good movie. But, a lot of it was slow-paced.",
            "review_date": "2014-09-13",
            "source": "rt"
        },
        {
            "content": "A magnificent biographical historical film. Great real sceneries. A story flowing during time of changes, great changes and the paradoxical character of this child emperor and is tragedy life.",
            "review_date": "2014-07-25",
            "source": "rt"
        },
        {
            "content": "A poetic, beautifully shot, powerfully acted, as well as an epic and compelling story. \"The last Emperor\" is one Bertolucci film that will leave you mesmerized as you watch it.",
            "review_date": "2014-07-08",
            "source": "rt"
        },
        {
            "content": "Another Bernardo bertolucci great movie",
            "review_date": "2014-07-06",
            "source": "rt"
        },
        {
            "content": "A grand film, with spectacular performances all along. An epic, in the true sense of the word.",
            "review_date": "2014-06-24",
            "source": "rt"
        },
        {
            "content": "I think the main thing I liked about this (besides the great images) is the fact that I knew nothing about this history lesson)",
            "review_date": "2014-06-12",
            "source": "rt"
        },
        {
            "content": "Sympathy for the emperor.",
            "review_date": "2014-06-01",
            "source": "rt"
        },
        {
            "content": "Sympathy for the emperor.",
            "review_date": "2014-06-01",
            "source": "rt"
        },
        {
            "content": "There are a lot of great things from this movie like the production design, cinematography, costumes, music, and directing but it is way too long to hold anyone's attention. I got to and hour and 15 and I still had 2 hours left and that my friends is not worth anyone's time unless you really have an interesting story. It starts off with potential but that fades away fast. Peter O'Toole is great in this but really that is it. I think it won Best Picture because it's pretty to look at and that's about it",
            "review_date": "2014-05-11",
            "source": "rt"
        },
        {
            "content": "Good looking, but overall not memorable at all.",
            "review_date": "2014-04-21",
            "source": "rt"
        },
        {
            "content": "Happy 27th Anniversary to The Last Emperor (1987). This film began my predilection for asian films and historical films.",
            "review_date": "2014-04-15",
            "source": "rt"
        },
        {
            "content": "The Last Emperor is a stunning, vibrant, elegant, and mesmeric historical epic. After hearing all the great things about it and being a fan of film epics, I obtained the 3.5-hour Director's Cut and I was blown away by it, as I hoped I would be by the director of Last Tango In Paris. The Last Emperor is an all-encompassing epic, one that demands every bit of your attention to process everything that it throws at you, both intellectually and visually because of its grand scale and ambition that still impresses to this very day.\n\nThe plot focuses on China's last emperor, Pu Yi throughout the course of life, ranging from his abdication to the throne in 1908 at age three, to both World Wars, his imprisonment for his involvement with the Japanese government during World War II, to his eventual death in 1967, complete with his torrid family drama, his love affairs, and his western teacher, R.J., who opens his mind to the outside world of the Forbidden City, altering the course of his life as the world so rapidly changes around him.\n\nThere's a lot to be found in the story, which is why it is highly recommended that you watch the 3.5-hour version of the film to appreciate the grand scope and become immersed in the life of Pu Yi. There's plenty of drama, romance, tragedies, some humor, and a whole lot more. I cannot properly explain what the film entails because there is so much to explore in the story, making it difficult to take your eyes away from the screen as you eagerly process everything.\n\nThe acting across the board is pretty good, though I would have preferred it if the film had been in a Chinese language (Like Mandarin or Cantonese), as opposed to English. It took me a little while to accept its English language because it didn't feel quite as authentic to me, but it's surprisingly good compared to a lot of other Asian-set films with English languages and I grew to accept it. John Lone does a great job as Pu Yi, and as expected, Peter O'Toole was great as R.J. Surprisingly, the acting is also so good that even the child actors are quite good, which is extremely rare in films. What also made the acting so great is that every actor made their characters feel like their own person, as opposed to just being static characters. Everyone seemed to have a purpose and a soul, which is something that definitely makes the viewer feel more immersed in the film. They make the film feel alive.\n\nThe Last Emperor is a grand epic, but only for people who have patience to watch it. It's a very story-oriented and dialogue-heavy film that will reward patient viewers and give them a lot to feed on. If you don't have the patience for this sort of film, you shouldn't be watching it. If you love a good film epic, The Last Emperor is definitely something to check out because of its story, superb acting, stunning visuals and set pieces, great music, and so much more. I think it's an amazing film and a masterpiece.",
            "review_date": "2014-03-31",
            "source": "rt"
        },
        {
            "content": "A fascinating biopic about the tragic fate of Puyi, the last Emperor of China - unfortunately, presented in English, not Mandarin.",
            "review_date": "2014-03-19",
            "source": "rt"
        },
        {
            "content": "Solid film which is one of them I can sit and say to myself \"i've been there\" all the way through, which I enjoy, sadly. The forbidden city is such a great place to make a film though, it couldn't have ended up as a bad film. This does get slow in the second half though but the ending is worth waiting for. Oh and it's got Josie Packard from Twin Peaks in it.",
            "review_date": "2014-03-08",
            "source": "rt"
        },
        {
            "content": "This was an excellent film. I love the character development, and the character study. Cinematography was amazing, The art direction and the sets were absolutely fantastic, and to top it all off I love the music. This definitely deserved to win best picture in 1987.",
            "review_date": "2014-03-07",
            "source": "rt"
        },
        {
            "content": "La película muestra la verdadera historia del ultimo emperador de china y su tragica vida atravez de los años",
            "review_date": "2014-03-03",
            "source": "rt"
        },
        {
            "content": "A beautiful film. B+",
            "review_date": "2014-01-22",
            "source": "rt"
        },
        {
            "content": "Should be required viewing for high school history classes (okay, a few parts would probably have to be trimmed for American audiences).  A poignant look at China's early 20th century history and a nice complement to Japanese history during that time period.  Highly recommended.",
            "review_date": "2014-01-19",
            "source": "rt"
        },
        {
            "content": "An incredible page of history told through the magnificent epic drama directed by master director Italian Bernardo Bertolucci.",
            "review_date": "2014-01-17",
            "source": "rt"
        },
        {
            "content": "The Last Emperor is a very sweeping and engaging epic. From a visual perspective it is fantastic and in terms of this man forced to be King, we ultimately get a very tragic tale.",
            "review_date": "2013-11-20",
            "source": "rt"
        },
        {
            "content": "An almost four hours incredible visual feast. The story didn't have much emotional impact on me, but it was well executed anyway.",
            "review_date": "2013-10-11",
            "source": "rt"
        },
        {
            "content": "I saw this last night with a brother... simply PHENOMENAL!!! :)",
            "review_date": "2013-09-20",
            "source": "rt"
        },
        {
            "content": "Slow and dull as ----, which was why I quit watching it after less than 30 minutes into the film. Visually stunning - so are Michael Bay films and most of them are terrible. I recommend this film be used to interrogate Al-Qaeda members, if making them watch the two Sex and the City films isn't enough",
            "review_date": "2013-08-31",
            "source": "rt"
        },
        {
            "content": "Beautifully filmed movie with the Forbidden City as monumental as ever. However, the film is rather slow, which is worsened by it's 3h45m running time.",
            "review_date": "2013-08-30",
            "source": "rt"
        },
        {
            "content": "Quiero verla otra vez",
            "review_date": "2013-08-22",
            "source": "rt"
        },
        {
            "content": "With Bernardo Bertolucci's magnum opus -- fifteen years after making his mark on society with \"Last Tango In Paris\" and \"The Conformist\" -- we are given an inside look at Pu-Yi, the last emperor not only of the Qin dynasty -- which had ruled China since the seventeenth century -- but of China as well. \n\nThrough beautiful imagery that manages to employ the massive scale that the Forbidden City communicates, sharp direction, as well as an enticing score by Ryuichi Sakamoto, Talking Heads frontman David Byrne, and Cong Su, \"The Last Emperor\" equally ranks alongside other instant classics as among the greatest films of all time!",
            "review_date": "2013-08-18",
            "source": "rt"
        },
        {
            "content": "The Last Emperor feels like an educational film. I feel like I learned some new things about Chinese history, and I got to see some places I've never seen before, but it's not a great film. Even though the locations and costumes are impressive, the story is very flat, the acting isn't great and the editing is sloppy. I think the only reason this won Best Picture is because it was the first feature film authorized to film in the Forbidden City.",
            "review_date": "2013-08-16",
            "source": "rt"
        },
        {
            "content": "Even though the first hour and a half was primarily unnecessary it did feature the best acting performance in the movie, which was Peter O'Toole. Aside from the first hour and a half, The Last Emperor was a very entertaining and informative movie.",
            "review_date": "2013-08-11",
            "source": "rt"
        },
        {
            "content": "High quality epic, i admit i wasnt too excited to see this, the subject matter didnt really interest me, but since it won a shit ton of oscars i figured id check it out, i was definitely surprised by how much i enjoyed it, it keeps it at the human level, not dealing with generals and politics, but with the emperor growing up, and how his life is as a kid in the forbidden city, and then as a young man after he's forced out, i had no idea really on how china was during this time period and their customs, i found it all very interesting and never boring or confusing, it looks great with great shots of the forbidden city, a great score, and good acting by everyone, it may look long and boring, but if you give it a shot you wont be disappointed",
            "review_date": "2013-08-05",
            "source": "rt"
        },
        {
            "content": "Beautiful. Incredible. Again - Beautiful. Wow... Such powerful images backed by an amazing story, great script and a soundtrack that will make you cry with love. Cannot wait to watch the director's cut at some point...",
            "review_date": "2013-07-29",
            "source": "rt"
        },
        {
            "content": "Grandly staged and beautifully executed, The Last Emperor is a visually stunning biopic on the life of Aisin-Gioror Pu Yi. The film covers his rise to power, his privileged isolation, and the political turmoil he found himself in later in life. At three and a half hours, The Last Emperor is a film that requires some patience, but has the technical skill and sufficient narrative power to keep you engaged. \n\nDirector Bernardo Bertolucci is able to fill The Last Emperor with so much visual intrigue, that one can hardly afford to look away. Each scene is framed with immense elegance, and is accentuated masterfully by brilliant costume design and set design. In this way, the world building for Last Emperor is nearly perfect. We see China and its traditional grandeur, the awkwardness that the outside poverty offers, and the contrast to the more modern changes taking place. As such, it is an exceedingly strong example of how a period piece should be staged.\n\nAs a narrative Last Emperor is largely successfully, but not flawless. Whereas the technical elements of the film are executed to excellence, the story in Last Emperor is told with some mishaps. It offers very interesting characters, but not full characterizations. Peter O'Toole's character, for instance, is a hallmark of the first half, but is never fully paid off. O'Toole brings a fine performance, as does John Lone, but the relationship between the two is never fully realized. How his influence escalates is never quite shown, he exits in far too much of a disjointed manner.  \n\nThis is true of a number of the secondary actors as well, such a Vivian Wu, whose character feels oddly inexplicable in the film. The character arc for Lone is done well up until the last act, where his seeming betrayal is never explored enough, and whose increased intellectual prowess never seems quite on point with where he should be. \n\nTaken on a whole, however, the story in Last Emperor is fascinating. The themes are interwoven especially well, examining class, power, change, and retrospection. We are treated not only to a historical journey that is reality-based, but we are also given a biopic that would exist successful on its own dramatic merits, outside of the actual people it's based on. \n\nAn overall strong and memorable drama.\n\n4/5 Stars",
            "review_date": "2013-07-27",
            "source": "rt"
        },
        {
            "content": "Quite a long history lesson. Interesting, though",
            "review_date": "2013-06-14",
            "source": "rt"
        },
        {
            "content": "This was a wonderful film. I knew nothing about the last emperor of China when I started watching this film. I came away with a greater appreciation of that period in China's past, but also a better understanding of what his life must have been like. My one complaint is that in order to make the protagonist more sympathetic, some of the characters were two dimensional bad guys. Otherwise, it was a good movie with amazing actors.",
            "review_date": "2013-06-06",
            "source": "rt"
        },
        {
            "content": "This Film Got The Academy Award For Best Picture Way Back In 1988 Which Was 25 Years Ago.",
            "review_date": "2013-06-06",
            "source": "rt"
        },
        {
            "content": "It's a big, sweeping epic for sure, but The Last Emperor suffers from a lack of character and a muddled narrative towards the back half of the film.",
            "review_date": "2013-05-28",
            "source": "rt"
        },
        {
            "content": "Beautifully shot but the use of English language instead of Chinese is very jarring.",
            "review_date": "2013-05-26",
            "source": "rt"
        },
        {
            "content": "I first caught this film at age 12 in the theatre and it was a thrilling and mesmerizing cinematic experience.  I've seen it since and watch it with less awe but fully aware of the scale and spectacle and Bertolucci's deft storytelling touch that blitzed me way back when.  It's a terrific film - a wondrous glimpse into China and it's hierarchal system at the beginning of the 20th centurey - all through the life of an individual crowned Emperor as a baby and through the tumultous years that follow while his authority and power ebbs away.  It's a beautiful film and a fascinating historical retelling of one life's immense heights razed by external events - conniving individuals and the march of communism.  This is a tragic, beautiful film.",
            "review_date": "2013-04-27",
            "source": "rt"
        },
        {
            "content": "Amazing.  Powerful.  Cinematic.  Beautiful.  Tragic.",
            "review_date": "2013-04-27",
            "source": "rt"
        },
        {
            "content": "Poutavý p?íb?h o konci jedné ?ínské éry, o ivot? posledního císa?e. Pro m? celkem zajímavé nahlédnutí do ?ínské historie.",
            "review_date": "2013-04-22",
            "source": "rt"
        },
        {
            "content": "i see i give lots of 5 stars; thats because i tend to watch masterpieces ( what seems middling i dont bother with unless an odd quirk gets me) So for this one, it is epic, the steetings and costumes are grand but thats secondary to the elegance of the direction, the articulation of the script and the richness of the caracters. A very complex political stroy may be ofputting to the neophytes but the writing soemhow alleviate this burden with concise contextualizations. S its one of those poem of a movie...",
            "review_date": "2013-04-14",
            "source": "rt"
        },
        {
            "content": "To it's credit the cinematography is marvelous and is one of only two films to have been allowed to film in the Forbidden City.   .  While I like mundane films like Gandhi, who's principle protagonist is active in the world he desires to correct, the Emperor in this film is a passive in his world, which doesn't make him an interesting subject.",
            "review_date": "2013-04-12",
            "source": "rt"
        },
        {
            "content": "My 3rd favorite movie of all time. I give this five stars, and that's saying a lot because I rarely give five stars. John Lone is perfect as a naive former emperor of China who, through his numerous experiences, becomes a wise old comrade of the new People's Republic. The music is amazing, and the cinematography in the Forbidden City is breathtaking. To earn a full 5th star, a movie has to have a solid ending and this movie does just that.",
            "review_date": "2013-04-11",
            "source": "rt"
        },
        {
            "content": "I watched this movie when I was 10 - 12 years old and found it to be pretty slow and difficult to get into.  Watched it this past weekend and loved it.  Captures the first half of the 20th century in China, which was a fairly confused time, from the perspective of a child emperor trapped inside Peking's Forbidden City.  Definitely worth the 3 hr 45 min viewing time.",
            "review_date": "2013-04-08",
            "source": "rt"
        },
        {
            "content": "in my opinion, i think that this movie is somehow rather disappointing, especially when it's made by bernardo bertolucci, which should've been great. i've seen some of his works and i think they're all good, great actually. at the extend of taking the story of pu-yi into the cinema, personally i think he failed. some of the actresses in this movie, who are mostly chinese have failed to show their true acting capabilties. on the other hand, actor peter o'toole too doesn't give much more effect to the film itself. the setting is alright. but bertolucci should've explored more of pu-yi's emotions and transitions from an emperor to a lowly peasant. i, myself think that bertolucci is too focused on the history parts that somewhere on the way, he forgot to put more intensities in the film. somehow, this film has failed to amuse me.",
            "review_date": "2013-04-05",
            "source": "rt"
        },
        {
            "content": "It reflects the upheaval to some extent through a different angle of view.This angle,on the one hand,brings us a conspicuously new feeling and understanding of the history,on the other hand,the fact that European invaders had been there are elided.",
            "review_date": "2013-03-30",
            "source": "rt"
        },
        {
            "content": "Lo unico malo de esta pelicula es que los chinos hablan ingles.  Pero no me atrevo a quitarle estrellas porque todo lo demas es perfectirijillo, incluyendo lo que mas me gusta en una pelicula: personajes queribles.",
            "review_date": "2013-03-13",
            "source": "rt"
        },
        {
            "content": "At the beginning of the film, I was unsure about finishing it. The voiceover for the children was almost unbearable. But then the story kicked in and I totally forgot that it was a 3hr 45min long movie until seeing that online.",
            "review_date": "2013-03-05",
            "source": "rt"
        },
        {
            "content": "An epic tale of the last emperor of China. The Last Emperor is beautifully shot and superbly directed. The film manages to capture Pu Yi from birth and shows many arks in character throughout his life, a truly interesting and stirring film.",
            "review_date": "2013-02-26",
            "source": "rt"
        },
        {
            "content": "The power and captivation that coincides with the presentation of \"The Last Emperor\" is as strong today as it was in 1987. Not only is the film a brilliant study of China's progression into a communist nation, but its a necessary and relevant commentary on modernization and the progression of time. Vittorio Storaro's flawless visuals give the film most of its power, but its also backed up by a wonderfully crafted soundtrack and amazing performances by John Lone and of course Peter O'Toole. \n\nThe film follows the true story of Aisin-Gioro Pu Yi, who was actually the last emperor of China before the entire nation was enveloped by communism. From a young age, the Emperor is given everything that his heart desires, and has thousands of people follow his every command. The one thing that he doesn't experience is the outside world, which is going through major shifts that seem completely foreign to him. The only source of education that he begins to experience is through his tutor, played by Peter O'Toole. The depiction of this kind of ignorance is so fascinating, and conveyed perfectly on the screen. The masterful performances by everyone excel the content of the picture as well. More than anything, the execution of the film's story provides a wonderful documentation of the human condition. The feeling of loss that the emperor experiences even from a young age sticks with him through his adult years. \n\nVittorio Storaro provides some of the best cinematography ever presented on film. The visuals are absolutely flawless. The way that colors and large groups of people are caught on camera is rather astounding. The film gives the feeling and vibrancy of a painting, brushing its own strokes as it goes along. Storaro's visuals are the most important aspect of this production. \n\nThe musical composition of this film was actually done by three people. Ryuichi Sakamoto, David Byrne, and Cong Su provide a wonderfully rich soundtrack that truly gives you goosebumps every time you hear it. The musicality is as radiant as the characters themselves. Truly brilliant. \n\nFrom the moment the film begins, Bernardo Bertolucci's \"The Last Emperor\" shows signs of greatness. The film itself is landmark achievement in cinematography, but every other sense of the production is wonderful as well. The near-perfect acting, well done script, and fantastic soundtrack propel the film beyond any notion of linearity and into its own category of brilliance. Not only is the film a timeless effort, but its story and political commentary is one that still offers some relevance in today's world. A timeless picture, and a timeless classic.",
            "review_date": "2013-02-25",
            "source": "rt"
        },
        {
            "content": "oh come on.. such a western imagination ...",
            "review_date": "2013-02-17",
            "source": "rt"
        },
        {
            "content": "this was a heart wrenching story about a man who was given too much responsibility and high expectations. a man who was thrust into his position before he was prepared and who struggled his whole life with what it means to be an emperor and coming to terms with the mistakes he made in the process. I loved the way the story was told in fragments of flashbacks and while you know how things will turn out, I still myself spellbound by the storytelling that took me to that end. In a way, this was almost a Shakespearean story of possibilities gone awry. It's definitely a thought provoking and interesting movie.",
            "review_date": "2013-02-17",
            "source": "rt"
        },
        {
            "content": "The Last Emperor is well-made, but not very engaging.",
            "review_date": "2013-02-05",
            "source": "rt"
        }
    ]
}