{
    "rating": 8.8,
    "release_date": "2011-09-30",
    "num_reviews": 570,
    "genres": [
        "Comedy",
        "Drama"
    ],
    "summary": "Adam Lerner (Joseph Gordon-Levitt) has always tried to take good care of his health, so it comes as a cruel surprise when he learns that he has malignant tumors along his spine. His doctor gives him a 50/50 chance of survival, but Adam tries to remain upbeat, though his mother (Anjelica Huston) and his friend Kyle (Seth Rogen), react badly to the news. Adam starts seeing a therapist (Anna Kendrick), but their relationship threatens to cross the boundary between doctor and patient.",
    "reviews": [
        {
            "content": "As someone who's partner is going through cancer treatment at the moment I found this movie, for whatever reason, extremely helpful for me right now. I'm very very happy to have randomly come across it. ❤️❤️❤️",
            "review_date": "2023-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There was a perfect balance of raunchy comedy, and bittersweet drama that will hit all the feels. We all need to laugh in our most trying moments.",
            "review_date": "2023-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't believe it's taken me till 2023 to watch this. The comedy-drama tackles a difficult topic while taking you on a rollercoaster of emotions that are conveyed beautifully.",
            "review_date": "2023-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So slow paced, uninteresting movie. I had no emotions watching this other than boringness.",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is an emotional exploration of friendship, love and sickness that is simultaneously funny as its potently serious, and while it could have gone even deeper in certain scenes, it's supremely well-acted and incredibly focused.",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films I've ever seen. It has heart for days.",
            "review_date": "2022-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie. JGL and Rogan formed a great chemistry. The movie is sad and good but also gives the element of comedy to cope with the dark tones.",
            "review_date": "2022-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Adam (Joseph Gordon-Levitt) is a young man who lives healthy and plays by the rules, which somehow makes his cancer diagnosis and the grim prognosis that follows all the more difficult for him to come to grips with.  50/50 is probably the funniest movie about cancer that's ever hit the screen and what makes it work is the fact that the humor feels real – never has applying ointment to a fresh wound been so funny.  Gordon-Levitt is solid in lead role, showing an understandably wide range of emotions as he tackles the reality of his own mortality, and Seth Rogen and Anna Kendrick give solid supporting performances (both seem to just play themselves, but that's okay).  Despite the fact that it's horribly predictable from the start and that it sticks closely to the standard Hollywood formula, 50/50 at least has the courage to tackle a difficult subject with a degree of levity.",
            "review_date": "2022-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "10 years ago-no review given",
            "review_date": "2022-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie i have watched. And the only movie i have cried to so far.",
            "review_date": "2022-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "lots of tearjerker moments. some funny moments (mostly seth rogen duh). kinda slow at times but still worth a watch. provokes some interesting questions about the ethics and mechanics of a budding potential romance between a therapist and their [ex-]patient, esp as i have found myself in a similar situation when i was vulnerable with a supportive person in the past",
            "review_date": "2022-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is really important com-drama film is really well written and directing about cancer which is the ultimate fear of death in America.",
            "review_date": "2022-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok i guess I'm or was on a rom-com spree. But this hit hard.\n\nJoseph Gordon Levitt starring 50/50 turns out to be a solid movie with equal amounts of humor, realism and despair. The realism depicted is pretty fresh. Certain character scenes done are exactly how you'd react when someone you care about gets hurt. How one can be ignorant to be the people who care them. Anna Kendrik is in this and she's just adorable and she's a med student so thats an automatic win for me. Wish we could have had a bit more of her. The death and that despair has been handled perfectly it makes you cry at the perfect moments. Joseph Gordon Levitt really made me think what would happen if I were in that situation and how I'd have to handle it.\n\nSeth Rogen is equal part good and equally on the nose but he provides a good balance to the movie.\n\nYeah, this movie is pretty good. I RECOMMEND to watch it. No regrets.\n\nThanks for reading. See you later✌",
            "review_date": "2022-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another \"based on a true story\" and I really don't wanna sound like an asshole.  But speaking as a cancer survivor myself, what makes Adam's story more important than mine?  Why does his story of survival warrant a movie over the thousands of other survivors?  Also, they never explained why he shaved his head when the Kemo causes temporary hair loss.  But my biggest issue is the pacing.  God this thing is SLOOOW!  It has a few chuckles but it is SLOW!  Almost to the point of boring.  Because for something billed as a comedy, because of Seth Rogan, it's mostly a drama.  Bordering on melodrama at times.  Overall, it's not good.  It's not horrible either.  It could have been WAY better but it could have been a lot worse.  I can't fail it but I can give a very indifferent, Meh.",
            "review_date": "2022-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 (A+)\nThis movie surprised me with it's heavy topics it handles and how it still feels so heartwarming. The cast here of Rogen, Gordon-Levitt, and Kendrick all do a good job of giving a healthy balance to the humor and drama in the film. I thought this film would be more like other Rogen comedies such as pineapple express but I was surprised to find a lot more drama here. Sure there are scenes where Rogen will go on his little comedy tangents but they feel authentic and like a real crazy buddy you might have in real life.\nThe chemistry between the lead of Joseph Gordon-Levitt and his therapist Anna Kendrick feels weird and awkward at ifrst but slowly swells into something special.\nCancer is a topic that can be hard to cover in a comedy because so many people face or have loved ones who have faced cancer. Somehow this film navigates the scenes dealing with the serious tones of cancer really well while still making light of the leads crappy situations he is always in. The main character's life could be seen as hard or unfair but the characters do a good job of still pushing forward and finding things to be happy and joyful for.\nI found myself laughing, cringing and getting emotional while watching 50/50. Johnathan Levine really captured something special here. Sure the plot might not have the most grand or shocking story arches ever but the way the film feels so grounded in reality and the way we as humans find humor even in tough situations was special to watch.",
            "review_date": "2022-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not my kind of film. sorry not sorry",
            "review_date": "2021-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of 1000 other cancer movies. There was nothing to set it apart.",
            "review_date": "2021-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly, I didn't really like it as much as other people did. I don't know why but I just didn't find it funny and didn't find it entertaining enough.",
            "review_date": "2021-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good film about a difficult topic, it maneuvers between jokes and drama with finesse.  The stellar cast from Joseph Gordon-Levitt to Anjelica Huston, Anna Kendrick, and Seth Rogan delivers a Home Run.  At the end of the day people like to laugh at tragedy.  It makes them feel better.",
            "review_date": "2021-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film can only be described as a highly enjoyable, heartfelt trial by fire. I think that the main reason this movie is as funny as it is, as gut-wrenching as it is, and as special as it is is it's blend of chill buddy comedy and romance after breakup story under the solemn shroud of looming cancer. I was struck by the absolute futility, the despair that Adam must be feeling. The scene before the day of his definitive surgery, after fellow cancer patient had recently passed away, after he has expressed how tired of being sick he is, he wants to drive, he angrily kicks Kyle out of the car and calming down he calls Katherine finally saying wistfully \"you would've made a good girlfriend\". After the build up in the first part of the film that wanders through the ever worsening prospect of Adam's life with humorous, sweet and sad predicaments, this moment of despair, this realization of his loss of hope is heartbreaking, what could be the last night with his best friend to end in a fight, to have to leave the prospect of a good relationship, all of this, developed with the air of light comedy and romance, makes for an emotionally crushing window into the inferno that is terminal illness. I'm sure to those who have gone through similar this movie rang true as well, I have been in surgery and I had the same fear as Adam of waking up before the surgery was over. That along with the high emotions the main characters and we feel coupled with the completely normal procedure carried out by the hospital hit hard. But what makes this movie a highly enjoyable window is that it doesn't just show the sorrow of Adam's struggles, it shows the good that a trial by fire can do. Adam is driven down the path of not only bettering his life, but finding the good things he had all along. The moment where he sits next to his mom and asks her how here day was, when he sees the book that Kyle was reading about cancer, he lets go completely of his relationship with Rachael. All of these are poignant moments of growth for the better, but they were hard to come by which makes them all the better. While I choked up a lot in this movie, the parts I loved the most were the genuine moments with Kyle. His bumbling around (and his being played by Seth Rogan) make it seem like the character is just some comic relief that also just brings out the \"friend\" aspect in Adam, getting into misadventures together. I love that he's more than just that. That Seth Rogan got a great character to play, that there's a friend who I know genuinely cares about his buddy to the very end even when they fight and get on each others nerves they're there for each other. That's the kind of friend I want to be. Add to the performances Joseph Gordon-Levitt making the most of every frame with evident anguish under the surface and Anna Kendrick's uncanny ability to look nervous and awkward and there's excellent performances all across the board. Overall this movie was the good kind of rollercoaster, there were some slow and straight sections for sure but they were eclipsed fully by the ups and downs around them. I laughed, I cried, it moved me.",
            "review_date": "2021-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although it does juggle the comedy and drama quite well, 50/50 starts to wear thin near the second half. The film starts to linger longer than it should and lessens the effect of the initial effects.",
            "review_date": "2021-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was expecting something a little more light when it says \"from the creators of superbad\", but it was still a good movie.",
            "review_date": "2021-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1/2 star because that puke Seth Rogen is in it. ",
            "review_date": "2021-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a very heart warming movie. It makes you have a perspective of life, mainly when you feel like yours isn't so great. Just honestly love it. I cannot explain how this movie makes me feel but it's in a good way",
            "review_date": "2021-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed the film, it delves into the psychological struggle in accepting death, or as the protagonist puts it: I'm fine with dying, why nobody would just tell me that. Before changing his stance to: I haven't been to Canada, I haven't told a girl that I love her\n\n interactions are somewhat awkward, sometimes in a good and justified way, and some are not, for instance, the protagonist has an odd relationship with his parents at first, and though it's marginal, it sheds some light on how much of a \"dick\" you are when don't appreciate your mom's worry, who also deals with a husband with Alzheimer's and feels lonely, hence, she resorts to support groups. \n\nhe also breaks up with his girlfriend, who cheated on him, due to constant stress and issues before his sickness. This shows how relationships are fragile during sickness, especially out of wedlock. He says in one scene: \"it's not like you're my wife\" giving her the option to bail out on him.\n\nI must say that his best friend as vulgar as he is, he's also genuine in his care of him and always tries to cheer him up, and added a much-needed sense of humor during these hard times.\n\nthe story gets bleak towards the second half, a breakup, loss of mates at the hospital, awkwardness with parents and the therapist, and to top it off, the tumor isn't responding to the chemotherapy. \n\nhowever, the movie ends in a joyful tone, and things look up for him after all. He heals and shortly after starts dating his therapist and there the movie wraps up.",
            "review_date": "2021-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 has it charming moments, mainly due to its top notch cast, leaded by Joseph Gordon-Levitt and due to the well played soundtrack. It has its funny scenes, even not plenty of them. It seems that it starts falling into the cliches of the genre in the middle of its runtime, but in the end it worths the time.",
            "review_date": "2021-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A mature film which meanders occasionally with silly jokes here and there, but is ultimately a winsome experience due to realistic acting of Gordon Lewitt",
            "review_date": "2021-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Holy balling my eyes out Batman!",
            "review_date": "2021-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is very beautiful because it manages to blend the fact that it is nice and the fact that it is very sad very well and it also manages to convey a beautiful message of hope",
            "review_date": "2021-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Typically American take on the horror of cancer in the young. Too schmaltzy. Tries to be serious but fails. Loved the greyhound though.",
            "review_date": "2020-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hadn't a clue this is inspired by a true story, of which Seth Rogen was actually an integral part (see trivia at end of this review)! That's blown my mind... It balances comedy and drama really well, whilst traversing some difficult moments, and delivers a heart-warming movie. It's understated, and focusses on the relationships between the key characters, which is good, as it feels more 'life-like' as a result [[[ Interesting trivia, taken from IMDb - - Adam (Joseph Gordon-Levitt) is based on screenwriter Will Reiser, who was diagnosed with cancer, and later recovered. Seth Rogen (Kyle) helped Reiser cope with his disease, and convinced him to write a screenplay during their early twenties together. Will Reiser makes a cameo during Adam's party. He tells Adam, \"My uncle had what you have.\" ]]]",
            "review_date": "2020-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not one for shedding a tear, but the heart rending moments before Adam's (an excellent Levitt) life threatening surgery to remove a tumour on his spine, I found myself doing exactly that. Based on a true story centred on a seemingly healthy 27 year old's battle after he learns of his cancer diagnosis.",
            "review_date": "2020-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is just so wholesome and impactful. 8.4/10, B+",
            "review_date": "2020-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easy watch and enjoyable great",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was pleasantly surprised at how much I enjoyed this movie.",
            "review_date": "2020-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good emotional movie starring Joseph Gordon levitt.",
            "review_date": "2020-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't find 50/50 that funny, but the acting was decent at least. The story was acceptable, handled the topic well, and the pacing was fine. The writing was light hearted and silly until near the end when things became serious and that was honestly the best part of the film. The cinematography was decent, and the soundtrack was fine. If you like comedies you'll probably enjoy it otherwise give it a miss as it's nothing special.",
            "review_date": "2020-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Where do these movies come from? Like allot of you, I'm stuck at home and browse through my cable guide for movies that might seem ok. Recently '71 and Don Jon were on cable and I thought were pretty good. Movies I never heard of. Saw this got great reviews and checked it out. Very bizarre movie about getting Cancer but it works. Yes it has some comedy scenes in it but its not like you think. Give it a try.",
            "review_date": "2020-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hit the right note for me, bringing both laughs and some tearing up, and it's always a bonus when the landing is stuck. Anna Kendrick was prob my MVP here, but good work all around from the cast.",
            "review_date": "2020-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What, Anna Kendrick AND Jessica Parker Kennedy? Humpty dance! \nBut serially, this is alright. Bit syrup at times; melodrama & such, but it works. The principal characters all give good performances. Howard really has that 'cold, detached, useless girlfriend with all the fake put-on of concern who makes everything about her' thing down pat. Houston was great, but she usually is. Levitt was very good in the lead, with Rogen doing the dick buddy thing he can do in his sleep by now, thankfully.\nA little less of the sappy bits would've been good, but there's a good bit of really funny dialogue and situational humor to more than balance out the weak stuff. The last several minutes esp. had a lot of the funniest scenes. Well, except for the surgery for his cancer, and the chance of him dying, then the godawful talk about what all they had to take out, yeesh. But besides all that, hoo, I was rollin'. Straight 3.5 stars",
            "review_date": "2020-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is great drama/comedy. The acting is really on point. It has heart and realistic situation that makes you think how precious life really is.",
            "review_date": "2020-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ana Kendrick, Joseph Gordon Levitt, Seth Rogen are treasure and future hall of fame actors. The way they portray everyday characters are unmatched. The story is heartwarming and life-affirming just like 1+1 and Knockin' on Heaven's Door but stands out on its own. One of the best movies i saw",
            "review_date": "2020-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Equal parts romantic comedy and bittersweet drama, the film deftly balances the simplicity of its all-too-familiar story and the sophistication of its nuanced, warmly detailed characters.",
            "review_date": "2020-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heart warming, emotional and uplifting comedy. Gripping throughout with genuine characters with a great storyline",
            "review_date": "2020-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "JGL is great in all his roles. Heartfelt, funny, and a feel good movie all in one.",
            "review_date": "2020-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Somewhat surprising how good this one came out. It's emotional. It makes you want to appreciate the present and those around you because it could all go away faster than we expect.",
            "review_date": "2020-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A real gem, I think, of 2011. One of the most heart-warming stories told about battling cancer in a young person's life, surrounded by his friends and loved whilst trying to conquer the trials that is 'adversity'. With a strong and clear direction, the writing pulsates with a profound beat and the performances given by Seth Rogan, Anna Kendrick and especially, Joseph Gorden Levitt, are frankly top notch. I was late to the viewing party on this film, but all that really matters is that I eventually showed up to experience it. All whom watch shall not be dissapointed.",
            "review_date": "2020-02-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sort of flat to me.  Some good jokes.  Gordon Levitt was terrible.",
            "review_date": "2020-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film balanced comedy with a serious topic nearly perfectly. The tone didn't seem out of place at any moment, and when it switched from funny to serious or vice versa, it made sense. Seth Rogen's character delivers most of the laughs, but even he turns around to have some touching moments. Anna Kendrick's character is the girl, even when we initially meet her as Adam's therapist, that we expect Adam to end up with at the movie's conclusion. Kendrick's character is the perfect girl next door, or in this case, the perfect cancer therapist. Joseph Gordon-Levitt's character, Adam, goes through his cancer with all the ups and downs (mostly downs) that'd we expect, but in the end, he triumphs. A good portion of this movie is sad, but the triumphant end makes it all worth it.",
            "review_date": "2020-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Gordon Levitt's best performances. Hard to not shed a tear at some point while watching this movie.",
            "review_date": "2020-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is able to balance a serious subject and comedy perfectly well. Gordon-Levitt's performance feels so real and authentic. Rogen plays his role as the comedic lovable best friend perfectly.",
            "review_date": "2020-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A honest film that's presented in comedic form, the pairing of the two leads is perfect.  A must see for sure",
            "review_date": "2020-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never seen a movie where I was sad and happy at the same time. 50/50 gets right to the point and capitalizes from an interesting cast that play interesting and likable characters all with different personalities. Truly an enjoyable 100 minutes",
            "review_date": "2020-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the greatest movie ever, but I enjoyed this.  Seth was probably my favorite character.  Seth is almost always funny.  Nice laughs from this movie.  Joseph Gordon-Levitt was also very likable.  I like to think that the likability of characters has something to do with the likability of the people in real life.  Not likely though.  Anna Kendrick is my new Hollywood crush.  Very cute and believable.  Worth my time watching.",
            "review_date": "2019-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, Jospeh Gordon Levitt does a fantastic job. It gets me everytime.",
            "review_date": "2019-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strong acting, strong writing, and a strong score accompany a film that falls between several lines; bromance, romcom, drama, and tearjerker. Even though it can't seem to pull it all together, it's individual parts stayed with me until I watched it again 2 weeks later.",
            "review_date": "2019-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 includes multiple themes for a mix of comedy, romance, and drama to create a compelling film about pushing through the tough times. It moves smoothly to complete a great film with a mix of emotions.",
            "review_date": "2019-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"50/50\" is structured like a basic sitcom with comedy undercut with a sentimental meaning about a young man with a rare form of cancer and delivers a satisfying third act due to meaningful character development.",
            "review_date": "2019-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good story about a man and his sudden journey with cancer. \nThe character evolvements are great!",
            "review_date": "2019-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was hesitant to watch a comedy about such a dark topic, but it was really good. It was the perfect mix of funny and emotional.",
            "review_date": "2019-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A terrific feel good, feel bad movie that takes you on a rollercoaster of emotions. The film not only showcases the hardship and journey it is for someone with cancer, but also the effects on the patient's close friends and family. The cast is great and only aids the terrific script. ",
            "review_date": "2019-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The drama and comedy is kept in a nice mixture with amazing performances and a well crafted script brings you 50/50",
            "review_date": "2019-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was actually good to see Seth Rogen show some range and get involved in a drama. Ya their are some funny moments, but its mostly sticks to drama. Well written and directed.",
            "review_date": "2019-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is a surprisingly heartfelt and emotion film, despite the involvement of the comedian Seth Rogen. The film does a great job of making you care about the characters, especially the lead, and really makes you feel bad for what cancer patients go through. The film is also able to sprinkle in enough jokes to keep the film fairly light, but in the moments where the drama needs to hit hard, no comedy is included to undercut it. Some Seth Rogen fans may find it disappointing that this film is not a nonstop laugh fest like most Seth Rogen films, but it didn't bother me in the slightest. What my problem was is Anna Kendrick's character. Though the filmmakers make her likeable, the direction they take her character in is extremely predictable from the moment she is introduced. The ending involving her character wasn't developed enough, so it just seems so forced. All in all though, 50/50 was a fantastic and emotional film that made me cry a little.",
            "review_date": "2019-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thoughtful and well balanced, 50/50 hits all the right bases when exploring a difficult topic, handled by Levine with relative ease; resulting in a deeply-affecting feature that is a perfect blend of humour and emotional potency. (It's well-chosen cast doesn't hurt either!)\nIroh's grade: B",
            "review_date": "2019-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's so good that I cried, either that or I'm really sensitive person. ",
            "review_date": "2019-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderfully sad and also funny when it needs to be. A couple of gut-punching and heartbreaking moments but an overall beautiful film.",
            "review_date": "2019-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The jokes are downright hilarious, it will make you cry, Joseph Gordon-Levitt and Seth Rogen are both on point, everything about 50/50 is great. 100%, my favorite film at the moment.",
            "review_date": "2019-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, what is the hype around this movie? I get that it's supposed to be a touching tale about someone who goes through one of the worst human experiences in existence, but it falls extremely flat. The biggest disappointment is the writing. The entire movie consists of awkward exchanges between characters and bizarre story elements. So many parts of this movie were just written in to draw tears from its audience. Why did we need Rachael's whole storyline? The in particular just seemed to be there to say, \"Hey, look how terrible this guy's life is! Feel sorry for him!\" The characters didn't learn anything from her character, the audience sure doesn't, so why is she there? A similar technique is used with Katherine. Will Reiser (the writer) just wanted a romance story to make the film feel wholesome and beautiful at the end. She never said anything profound. She never did anything extravagant. She sat there through the whole movie and exchanged choppy dialogue with Adam. How did a relationship blossom from this? Their interactions showed no signs of attraction between the two characters, but they're all of a sudden together and falling for each other. This story was just repulsively cliché and jumbled.\n\nAs if this doesn't remove you from the movie already, the actual filming of it leaves much to be desired. So much of the quality of a film lies in how it was shot and framed for the audience. There was so little creativity put into this movie. It never comes alive and gives you more information about the scenes. Even some of the most basic shots that are commonly used to convey information aren't given any attention here.\n\nThe only decent part of the movie is the acting. The actors do the best with the script they were given, and I can appreciate that. Seth Rogen and Joseph Gordon-Levitt make a great team, despite how shallow their characters are. Bryce Dallas Howard does some wonderful work here, even if her character shouldn't be in the movie. She commands most of her scenes with raw emotion that makes her Rachael come to life. Unfortunately, this was probably the wrong role for Anna Kendrick. She has done some great things in her career, but this is not one of them. She requires a character with so much more personality and individuality, something that Katherine does not have in this film.\n\nThe bottom line is that you can't write a pile of dog crap, sprinkle some good actors in there, and try to serve it to me as a cake.",
            "review_date": "2019-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies of all time",
            "review_date": "2019-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Soooo good. Moving touching sad happy and funny all in one. Awesome movie ",
            "review_date": "2019-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest movies I've seen in a while! Rogen and Leveit have unforgettable performances! Will leave you with tears in your eyes! Strongly recommend!!",
            "review_date": "2019-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm a big Seth fan and I've never had a chance to see this movie till now but simply wow. The humor was awesome and the story it tells is so moving. I was fighting back tears and burst of laughter the whole time. 5/5",
            "review_date": "2019-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This 2011 film directed by Jonathan Levine presents the harsh realities of terminal illness in a coherent, eloquent, and lighthearted way; without taking away from the seriousness of the topic.  Joseph Gordon-Levitt delivers an evolving, dynamic, and strangely relatable performance that leaves audiences thinking ï¿ 1/2 1/2~What if this happened to me?ï¿ 1/2 1/2(TM)  After watching the film and subsequently reflecting on their own life, the viewer is truly left thinking, ï¿ 1/2 1/2~Now what?ï¿ 1/2 1/2(TM)",
            "review_date": "2019-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50: Pros: - Great Acting - Fine Directing - Good Screenplay - Passable Cinematography - Acceptable Editing - Perfect balance of drama and comedy - Brilliant Pacing - Manages to tackle subjects of cancer in a way that is not too dark, but also not too sugar-coated either - Emotionally Resonant - Some of the jokes were funny Cons: - Not every joke lands Overall Grade: A (9.5/10)",
            "review_date": "2019-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A champion of feel-good comedies that's brilliantly written and fantastically performed providing comic relief at all the right moments and slamming the humor home with Seth Rogen's comedic presence. The film serves as a reminder to always look on the bright side of life.",
            "review_date": "2018-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was great.",
            "review_date": "2018-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's always a risk to stage the drama of a life-threatening illness and try to spice it with humor, but careful direction and an excellent cast actually help manage to pull it off.",
            "review_date": "2018-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great performances, interesting and well written characters as well as some strong emotional moments keep you fully engaged in 50/50 throughout its 90 minute runtime. Wish it was longer! 5/5 stars",
            "review_date": "2018-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awkward movie to watch. Great chemistry between the two leads. Really could have toned down on the vulgarity in particular Rogan.  Everything was about getting laid.  Anna Kendrick played a doctor but never acted like one.  Two older cancer patients were caricature and one dying was predictable. Wasted Bryce who was the reason I watched the movie. Still , not to bad, but nothing to stay in memory for long",
            "review_date": "2018-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well acted and funny but it's vulgarity feels unnecessary.",
            "review_date": "2018-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touching and refreshing.",
            "review_date": "2018-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This foo has become one of my favorite films. I can rewatch it over and over and still enjoy it every time. His film manages and it’s cast manages the difficult task of capture both ridiculous comedy and is funny with drama that actually tugs at the heart strings.",
            "review_date": "2018-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A compelling piece of film about overcoming life's biggest hardships with the help of one's loved ones. 50/50 is a concept elevated by its consistently funny and wholesome script as well as the incredible chemistry shared by its leads.",
            "review_date": "2018-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first thing that hits me about 50/50 is the authenticity of the story. It’s clear that a lot of this came from personal experience for screenwriter Will Reiser, because this isn’t the Hollywood version of a man fighting cancer, it all feels real. It helps that Joseph Gordon-Levitt delivers what could easily be the best performance of his career. He taps into all the emotions of this journey, which did a lot to connect me to his struggles. I cannot express how invested I was with this film. I felt like I was going through this with him, as if it was my own best friend who was dealing with illness and his mortality. I’m not at all ashamed to admit I broke down in tears more than once while watching, and any time a movie can impact me in that way I love it more, because a cathartic outpouring of emotion is a powerful thing. Ordinarily I’m not a big fan of Seth Rogen’s brand of comedy, but he is more controlled in 50/50. This isn’t his movie, and he doesn’t feel the need to steal the spotlight with ill-timed jokes that are more inappropriate than they are funny. Instead, this is Rogen as a real human being, and the picture of true friendship between these men is astounding. There aren’t enough movies that show realistic depictions of male friendship, but this was a powerful example of how to do it right. I always love Anna Kendrick, and she adds a lot to this movie as well, even though she doesn’t have a huge role. It’s in the scenes where she’s attempting to counsel Joseph Gordon-Levitt where some of the more repressed emotions come pouring out. The arc of their relationship is where this movie comes closest to being the clichéd Hollywood version of the story, but I still love it. 50/50 has so much going for it. Between the powerful story and the great performances, I struggle to find anything to complain about. This is one of those movies that I don’t find to be easy to watch, because it deals with some heavy subjects. It’s hard to see someone so young facing their potential death, particularly because I’ve seen people I know deal with this exact same thing. However, the power of this kind of film is undeniable. It has humor that works, and that gives me some laughs, and breaks up the serious tone of the film. Then it has some darker moments that make me cry. Taking me on that kind of emotional roller coaster is one of the most exhilarating experiences I can have watching a film. I’m sure there are those cynical people who find 50/50 to be lame or uninteresting, but I think it’s close to a masterpiece. ",
            "review_date": "2018-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is fantastic, it was well acted, well written, and very entertaining.",
            "review_date": "2018-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a solid movie that does a good job leveling the seriousness and humor. JGL does a great job, Rogen has his moments in this one, and Anna Kendrick was great as well. Some of the jokes definitely were a bit corny though.",
            "review_date": "2018-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Crude Reality of Cancer with the touch of comedy with Seth Rogen, and one of the best performances of Joseph Gordon-Levitt",
            "review_date": "2018-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was a great movie, I went through cancer, and gordan portrayed the emotions that process perfectly, sure, some is overexaggerated. No1 is ever that open when they're towards a young adult diagnosed with cancer. But they do have the emotions that is hard to portray :) glad I watched this with family",
            "review_date": "2018-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intelligent story and film based on a true story. Seth Rogen is Seth Rogen and the comic anchor in the film as well as in the real life story. The story was made more cinematic. Pretty good.",
            "review_date": "2018-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cast is awesome, especially Anna Kendrick.",
            "review_date": "2018-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good emotional movie starring Joseph Gordon levitt.",
            "review_date": "2018-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a super enjoyable movie. I love it when a movie shows off what real people would be like in a situation like this, that is why I love movies like The Big Sick and Don Jon. I love everything about this movie like the real humor, the story, an the acting is amazing. Joseph Gordon-Levitt has blown me away in every movie I have seen him in, Anna Kendrick is funny and Sweet and this is definitely my favorite one of her movies, and even Seth Rogen someone who I normally see as very annoying is absolutely hilarious in this movie. Overall this one of the most real and funny movies that I have ever watched and definitely needs to be talked about more.",
            "review_date": "2018-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though it's a drama about cancer, 50/50 overcomes sappy cliches with contagious comedy to become a feel-good film that's worth your time.",
            "review_date": "2018-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie!!! Excellent story, great acting ... speechless",
            "review_date": "2018-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "hey man, you're gonna die..\n\n50/50\n\nIt's tone and the environment of it seems a bit off track some time and it's not that because of some funny sequences, it's just the surrounding of it and the characters they just aren't palpable to it. 50/50 may come off a bit eerie and not easy to digest but it's advantage is that it floats on a light mode and delivers everything in appropriate amount. Jonathan Levine's execution seems like a TV dramatic episode along with the writer Will Reiser. Joseph Gordon-Levitt is doing some of the best work of his career in here and along with the help of a good supporting cast like Anna Kendrick, Bryce Dallas Howard and Seth Rogen it pretty much gets it right on performance level. 50/50 even though being of around 100 minutes seems a bit long, slow and quite pretentious and one of the main thing it lacks is carrying out the emotional or intense sequences to the audience.",
            "review_date": "2018-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had avoided this film because I am not a huge fan of Kenrick nor Rogen but Rogen grew on me, especially as the buddy who really cares.  Well done",
            "review_date": "2018-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Made me laugh and cry; great movie",
            "review_date": "2017-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely good movie filled with drama and comedy with great actors",
            "review_date": "2017-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Could not finish it.",
            "review_date": "2017-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie.  It is funny and yet serious all at the same time.  Joseph Gordon-Levitt gives an incredible authentic performance in this that is just as heartbreaking as it is charming.  I think this is worth your time to watch if you haven't done so already.  Great little film.",
            "review_date": "2017-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is a 2011 American comedy film directed by Jonathan Levine, written by Will Reiser 🍿 \n\nIt takes a pair to beat the odds\n\nIt's good 🙂\nI'd recommend it if you like this genre 👍🏼",
            "review_date": "2017-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Joseph Gordon-Levitt continues his reign as Hollywood's most underrated young actor in a refreshingly candid performance as a young man who is diagnosed with a rare form of cancer.  What unfolds throughout teeters on the brink of sappy melodrama but manages to always put itself back on balance with its wry and hysterical comedic elements.  Aided by his best friend (Seth Rogen), girlfriend (Bryce Dallas Howard), mother (Anjelica Huston), and therapist turned love interest (Anna Kendrick),.  The basis of the story is Will Reiser's experience with cancer diagnosis and the fragility of human life is always kept within the balance of the script.  The performances are full of wit and tact.  A wonderful dramedy that manages to overcome the dialogue downfalls of many of its peers.",
            "review_date": "2017-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well written, well acted and funny, but also manages to be a serious emotional film about cancer and the hardships that come with it.",
            "review_date": "2017-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strengths: Handling the reins of a comedy movie that has to do with tough subject matter like cancer is a difficult balancing act. Jonathan Levine does a great job with that as the director. The movie is consistently funny, yet never gets to a point where the serious moments miss the mark. Each important moment feels big. The music led scene before and during the big surgery is exceptional and showcases the good soundtrack choices made for this movie. Joseph Gordon-Levitt (Adam Lerner) is tremendous in this. It's one of the best performances of his career, which is saying something. The scene where he's in the car and has his breakdown is incredible. Seth Rogen (Kyle Hirons) is playing the kind of guy he always plays. It's not special, but he gets it right. His chemistry with Levitt was key. Speaking of chemistry, each scene involving Anna Kendrick (Katherine McKay) is delightful, partially because she and Levitt had it in spades. Anjelica Houston (Diane Lerner) and Bryce Dallas Howard (Rachael) both also did well in their roles. The screenplay is another huge positive. Most characters are given some depth, the dialogue is sharp, and there's a lot of heart to everything done.\n\nWeaknesses: While I thought his performance ultimately fine, Seth Rogen's character is the one that doesn't fully work. He's overly vulgar to the point where it feels a bit out of place. He's one note and it's not a note that is always funny.\n\nOverall: An incredible movie. I love Joseph Gordon-Levitt and this is one of his two or three best movies in my opinion. The cast is stellar, the script works completely, and the balance between comedy and drama is perfect.",
            "review_date": "2017-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nice film about family and friendship. Levitt and Rogen are great together and at times it is quite touching and really funny.",
            "review_date": "2017-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was a little skeptical about this film before watching it, I suspected the high ratings might be because of the subject matter (sensitive subjects such as cancer always seem to get high ratings, regardless of the actual worthiness of the film). But in this case I was wrong, and was in for a good surprise. The seriousness of the subject was balanced with humour in just the right amount. The acting by Gordon-Levitt and Kendrick was outstanding; and Rogen, whom I normally avoid like the plague, gave a surprisingly honest and deep performance. The film deals with many issues related to serious illnesses such as cancer, especially in how friends, acquaintances and relatives react to the patient. Definitely an emotional film, and definitely worth watching.",
            "review_date": "2017-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even with a depressing subject like cancer as the main theme, 50/50 offers a great deal of smiles, laughs and of course, tears. Gordon-Levitt and Rogen's chemistry is truly amazing. Anna Kendrick, Anjelica Huston, Bryce Dallas Howard so pretty much every character in this movie, they all give impressive performances. This movie is a perfect combination of drama and comedy and you should have no problem enjoying this movie. Kudos to everyone involved.",
            "review_date": "2017-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot may be a bit thin, but I really really liked 50/50. It knows when to be funny, when to be serious, and knows when to add a little bit of humor in a more dramatic moment. Aside from that, its heartfelt, well-directed, well-written dialogue, the characters feel real, and the actors all give good performances.",
            "review_date": "2017-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is the perfect example as to why we like going to the movies. It's smartly written, extremely funny in some areas, and it has heart the entire way through that gives the emotional areas more of an impact.  Joseph Gordon-Levitt gives us his best performance as a man who's convinced he's dying, and Rogen is there to help lighten the mood quite a bit, which he does all so well. With all of that said, though, 50/50 is a movie about the nature of human beings, and how even in the hardest of times, we can find reasons to laugh in life.",
            "review_date": "2017-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fan of JGL since then but with all the efforts of everyone here in this movie, it really pays off a lot. Full of laughter, seriousness and a heartfelt film. Highly recommended one.",
            "review_date": "2017-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good. It's funny throughout, the performances are good, and the dramatic scenes are fine. My main flaw with it is that a lot of the more hard-hitting subject matter feels toned down to appeal to that wide-release American demographic that Seth Rogen movies are generally made for. I think it could've benefited from some less fantasticalâ?? resolutions. I do appreciate that there aren't all that many story cliches in the first three quarters.",
            "review_date": "2017-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Improvement is required.",
            "review_date": "2017-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a GREAT movie. It manages to be funny and profoundly moving at the same time. This one made me cry. Brilliant performances, writing and direction.",
            "review_date": "2017-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very well done film that tackles sensitive matter with ease. Feels very genuine, even if it is a bit too much \"feel-good\" leaning.",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't think this quite lived-up to the critics' reviews. We all know cancer fighters/survivors, and this connects there on a good level, but it doesn't seem realistic at times. It's a decent relationships story, with Rogen sometimes funny but sometimes single-tone, and Gordon-Levitt seemed to me too passive for reality. 3.5 stars. OK.",
            "review_date": "2017-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was totally misled by the poster, which seems to show Joseph Gordon Levitt with A Wii controller on his head, right? THAT'S HILARIOUS. No, what he's actually doing is shaving his head because he has CANCER. THAT'S SO NOT HILARIOUS. Oh, god, I was really not prepared for this movie. WAIT, SETH ROGEN IS IN THIS MOVIE. Hes HILARIOUS. Well, yes, he seems to be the Bill Murray to Levitt's Dustin Hoffman, I suppose the movie is ALL RIGHT. But it's tranquilizer depressing at times. Fuck.",
            "review_date": "2017-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Moving comedy-drama.",
            "review_date": "2017-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very touching movie.",
            "review_date": "2017-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its never easy, you really can't talk too much about this subject matter. This movie does however bring to light some of the issues and offers some interesting perspectives in the journey of a person battling cancer, and I believe that since the movie brings awareness and is well done it can definitely be reccomended.",
            "review_date": "2017-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good watch, balance of humour just right",
            "review_date": "2017-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good movie to watch",
            "review_date": "2016-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most beautiful movies in a long time. Goes from humor to emotions with finesse and tells a story that resonates with humanity.",
            "review_date": "2016-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "10/10, happy and sad all in one mixture of emotions.",
            "review_date": "2016-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honest ad Genuine, 50/50 is a rom-com based on an unconfortable topic that strikes right in the heart.\nAn unexpected chemistry between Joseph Gordon-Levitt and Seth Rogen keeps the movie on a wave of delighting humor.",
            "review_date": "2016-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not funny. It feels really long. But the pacing is still fine, it just feels long, not slow. Seth Rogen is fine, but not much different from his other characters, he was just written to be a little more toned down. Joseph Gordon Levitt was really good! It's not bad, but it's not great, and I don't think it deserves the rating it has on here. I was expecting better from director Jonathan Levine, who did The Night Before which I love, and has done other things that I have heard are good!",
            "review_date": "2016-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is a sincere yet humorous take on the rough topic of cancer, and by extension, death. Joseph Gordon Leavitt and Seth Rogen are hilarious as the main characters, and Anna Kendrick does a good job playing the part of an inexperienced but well-meaning social worker. There is an abundance of profanity, so be aware of that if that bothers you. But otherwise, I would consider it quite a \"feel-good\" movie",
            "review_date": "2016-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hadn't seen this movie until yesterday and yes that's a shame. Absolutely loved it from the beginning till the end. Comedy and bit drama, good acting. Everyone should see this film. Think Joseph Gordon-Levitt is my new favorite actor. Can't wait for new movies with this guy. Also Anna Kendrick and Seth Rogen did a great job!",
            "review_date": "2016-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very funny, very sad, and very heart warming. I went through all of the key emotions for me to know that this is a fantastic film. The casting was good and also the story is original. Go see this movie.",
            "review_date": "2016-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "touching. makes me want to be a doctor",
            "review_date": "2016-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honest ad Genuine, 50/50 is a rom-com based on an unconfortable topic that strikes right in the heart. An unexpected chemistry between Joseph Gordon-Levitt ad Seth Rogen keeps the movie on a wave of delighting humor.",
            "review_date": "2016-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It offers a real take on fighting cancer with well-developed characters and a plot that doesn't try to be too joyful.",
            "review_date": "2016-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some funny moments and overall a light hearted, entertaining film. Not very rewarding movie overall though.",
            "review_date": "2016-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is not a comedy, it is a heartfelt movie about the struggle a friend has to go through when fighting cancer at a difficult time.",
            "review_date": "2016-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the hearth warmth bromance of the last decade.",
            "review_date": "2016-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A semi-autobiographical account of director Levine that excellently deals with the sensitive topic of cancer by carefully tightroping between comedy and drama. 50/50 never gets too serious or depressing, but never too comical or flippant creating a dramedy that induces tears, laughter, gasps and applause.",
            "review_date": "2016-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is an honest film that effortlessly balances the serious, dramatic portions of the film with some hilarious comedy.",
            "review_date": "2016-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a fan of Joseph gordon Levitt and Seth Rogen this movie was amazing",
            "review_date": "2016-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Grade: A+. Phenomenal film. It really played through my emotions the whole time. Joseph Gordon-Levitt was a great choice for this role and nailed it in every way possible.",
            "review_date": "2016-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really fun movie sad at time but the change in tone is amazingly done cast is spot on for the most part could of done on the role of the best friend but Seth still did great the lighting is very good reflecting the tone at the time of the movie it's one of the few movie that feels like you're peeking in someone's life and it's holds your attention for the whole run time",
            "review_date": "2016-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What can i say about this movie that hasn't already been said. It takes the topic of cancer and shows it a humanizing light. Seth rogen is the side character and surprisingly he works well with this movie. It doesn't feel like any of his other movies. Joseph Gordon Levitt is great. He's a leading actor, the best parts of this movie are with him. The love put into this movie is shown.",
            "review_date": "2016-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie handles a very serious and sensitive topic in a light-hearted, funny manner. All of the performances by the actors are really good especially Joesph's and Seth's. The film is just really good, one of my favourites actually.",
            "review_date": "2016-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just finished 50/50 and this is hands down one of if not my favorite performance from JGL. He gives a masterful performance of a young man who's life is turned upside down by a cancer diagnosis. The raw emotion he delivers in several scenes is so good, especially in the scene where he drives for the first time. The supporting cast was very good as well especially his mother. Anjelica Huston plays an excellent, nagging, worrisome mother. I will be owning this",
            "review_date": "2016-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cancer, sadly, is something most people need to deal with sometime in their lives, whether it's their own diagnosis or that of a family member or friend. That's what makes 50/50 so believable and relatable. It looks at one young man's diagnosis of a rare form of the disease, the way he copes with the possibility of death, and how his friends and families react to such sad and shocking news. It's a very thoughtful film with one of the best screenplays of the year. I thought it dipped into comedy a little too often, but it manages to cover a lot of ground in a surprisingly smart and emotional way.\n\nAdam (Joseph Gordon-Levitt) is a happy, well-adjusted, and relatively successful twenty-something in Seattle. He's dating a girl, Rachael (Bryce Dallas Howard), who is way out of his league and has a good job at a radio station with his best friend, Kyle (Seth Rogen), but after complaining of back pain for a while, he visits a doctor and finds out he has a rare form of spinal cancer. With only a 50% survival rate, Adam nearly goes into shock, as do Kyle, Rachael, and Adam's mother (Anjelica Huston). As he begins chemotherapy, he starts seeing a shrink, Katherine (Anna Kendrick). But as those around him begin changing, Adam realizes it's up to him to find strength and the necessary attitude he needs to defeat the disease.\n\n50/50 has three very distinct thirds, and if I had to give them all a grade, I'd say the first third is a solid B+, the second third a slightly worse B, and the final third a definite A. Our introduction to Adam is just what it needs to be, and it's interesting to see the various people that will play different, but equally important, roles in his hopeful recovery. The middle of the film spends a little too much time with Adam and Kyle trying to pick up chicks and not nearly enough time with the underused paring of Phillip Baker Hall and Matt Frewer, Adam's kindly, pot-brownie-eating friends from chemo. I thought the way Adam's relationships with Rachael and Katherine change to be interesting, but like I said, this section of the film suffered a little from Seth Rogen overload.\n\nThe film's final 20-30 minutes, however, are near perfection. It's during this time, that Adam's relationship with his mother shines, and Anjelica Huston seizes the moment by turning out one of the best supporting actress performances I've seen in years. Hell if I know how her name has been kept out of the Oscar discussion, but she's phenomenal, and an easy choice for supporting performance of the year thus far. JGL, of course, is as good as you'd expect, and he has two, maybe three, scenes during this portion of the film that will just break your heart. Anna Kendrick, as well, is fantastic, especially during the film's latter scenes. I was feeling good about 50/50 most of the way through, but my opinion skyrocketed as it inches closer and closer toward its very poignant finale.\n\nI loved 50/50's screenplay for the most part, though I blame Will Reiser (the inspiration for Adam) for the missteps with Rogen. It's not as if the actor is bad (he's doing what he's asked to do), nor is it that the material isn't funny (quite the contrary, actually), it's just that I didn't think it was necessary and I think the crude Apatow-style humor distracted from what was, at its heart, a very moving story.\n\nBut no amount of dick jokes can take away what I ultimately took away from this film: That JGL is one of his generation's best. That Anjelica Huston has still got it. That Anna Kendrick is the real deal. And that it's possible to make a story about cancer that's so relatable I nearly found myself in tears on multiple occasions.\n\nIt's the last point that really made 50/50 so special. So many moments in this film rang true to me. I couldn't help but identify with Adam, despite (thankfully) never going through what he did in the film. And every relationship he found himself in-whether it be with the overprotective mother, the girlfriend who is in over her head, or the young professional trying a little too hard-was easy to accept. Bravo to all involved for making a real winner-the fourth such film already this fall.\n\nhttp://www.johnlikesmovies.com/5050-review/",
            "review_date": "2016-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dramedy at it's absolute best. Rogen and Gordon-Levitt are exceptional but it's Anna Kendrick who pieces the film together. A massive surprise when I saw it and for all the right reasons too.",
            "review_date": "2016-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is funny when it needs to be and serious when it needs to be. This film does tackle a difficult subject but is definitely worth a watch!",
            "review_date": "2016-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know it's cancer but mood-swings man",
            "review_date": "2016-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought a movie about any humor while battling cancer could be a seriously tasteless flop, but it's the exact opposite.  It's one of those life goes on no matter what stories that resonates with most anyone.  The acting is superb, and I really rooted for the good guys (and gals) in this story.  And the front porch scene between Joseph Gordon-Levitt and Bryce Dallas Howard is classic, as is the telephone call between him and Anna Kendrick.  Brilliantly done.",
            "review_date": "2016-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Neatly balances funny and anxious moments of a delicate topic, with Joseph Gordon-Levitt outstanding and Seth Rogen delivering on the usual gag-front.",
            "review_date": "2016-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't remember that much.\nWanna see it again:)",
            "review_date": "2016-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love how this movie gives you an uplifting as well as heart warming feeling through all serious behind cancer. This movie shows how an average man tackles cancer an his everyday life and the humour behind cancer as well",
            "review_date": "2015-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's funny, sad, and well balanced. Seth Rogen shines in his role.",
            "review_date": "2015-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It provides a true look at someone's struggle with cancer. Made me cry.",
            "review_date": "2015-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Anna Kendrick is unbelievably hot in this. Outside of Kendrick, this is pretty good, but pretty forgettable at the same time.",
            "review_date": "2015-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, dramatic and underrated. Joseph Gordon-Levitt should've been nominated.",
            "review_date": "2015-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's hard to do a good cancer movie, let alone one that is funny and authentic.  One of the reasons for that authenticity is the writer, Wil Reiser had cancer so it's based on a true story.  Joseph Gordon-Levitt and Seth Rogen have incredible chemistry and the supporting cast is real and believable.  This is the perfect film for Rogan as his awkward humor fits well.  This is lovely and fun and how often can you say that about a cancer movie?  Final Score:  8.9/10",
            "review_date": "2015-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is a heartbreaking take on the topic of cancer, and will not only manage to bring you tears, but has a decent balance between comedy and drama.\n\nJoseph Gordon-Levitt plays a guy who one day out of the blue got diagnosed with cancer. As the story progresses, we see a lot of what someone in this situation would have to go through, and not only was this movie excellent, but it also felt really genuine. Everything about this movie felt very human and real, and at no point did I feel like this topic was being taken lightly, or being overdone. When watching the characters on screen, it felt like they were actually living through this situation, and at times, it's one that is really a tear jerker. \n\nTo start out, this movie really is a respectable nod to those who are still fighting through this battle. Although there is a couple lines of toilet humor or a couple of raunchy moments, overall the movie had a perfect tone to it. I felt the perfect amount of emotion that I wanted to feel from a film like this, and there were also plenty of moments where I was dying of laughter. Considering this can be a sensitive topic, we don't neccesarily see a ton of movies being made about cancer, but when made, they are normally done right. This movie made a great film out of cancer, and shows many people just how difficult in can be at times. \n\nThe actors were phenomenal in this movie, and I really liked every single one of their performances. Joseph Gordon-Levitt was superb in this movie, and I truly admire him as an actor even more. He played the role perfectly, and I can't think of anyone else that would've been better for this role. He makes the character his own, and he makes everything feel so real. As I watched him, I completely forgot he was Joseph Gordon-Levitt at times, and I just saw him as a guy who was diagnosed with cancer. He was amazing, and I loved his relationship with Anna Kendrick. Anna Kendrick plays his therapist, and there's no other word to describe them other than cute. They really are cute together, and when watching their relationship evolve and grow, it felt real, and it made me really happy to watch their chemistry on screen. Anna Kendrick was amazing as always, and I'm glad she's carved out a career for herself today. Seth Rogen was also good in this movie, and I actually really liked the banter between him and Bryce Dallas Howard. Both were great in this movie, and their arguing actually made for some of the funnier moments in the movie. \n\nI'll be honest, the first act of this movie was actually pretty slow. I wasn't too interested in what I was watching, and it felt like nothing really happened. It had a couple of weird jokes, and I wasn't entertained by the events that were taking place. I felt that the pacing could've been a bit better in the movie, but as the movie started to progress, I soon found myself loving this film. As the film advanced, it started to gain momentum and I was eventually hooked on it. The second act started to make the movie feel a lot more life like and the script started to feel more natural. Things started to feel less stale and less awkward, and by the time the finale unfolded, I was nearly in tears. \n\nThe script was also great for the most part, and I could just imagine that people actually in this situation would do or say many of the things that they did in this movie, so props to them for that. The movie also had a consistent tone throughout, which is not something you can say for many movies nowadays. It had a great blend between its drama and comedy, and for every comedic joke cracked on screen, there were two more sentimental moments to follow. Although it did a good job of that overall, there were still a couple of jokes that didn't settle well and a few awkward moments, but otherwise, the movie really was a quality produced film.\n\nIn the end, I have to say that this film was nearly perfect. It really touched my heart and it took the topic of cancer, and turned it into something that we can all relate to. I truly mean it when I say this film is worth watching, and if it weren't for the slightly troublesome first act, I would've given this movie a perfect 5 stars.",
            "review_date": "2015-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not typically my kind of film yet enjoyable for the most part",
            "review_date": "2015-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good movie made to \"exorcise\" the fear of cancer? I don't know, but surely funny although the strong topic. The cast is excellent and Jonathan Levine is great in portraying the movie in the most simple way possible.",
            "review_date": "2015-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious and heartwarming at the same time. Definitely worth the watch.",
            "review_date": "2015-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very gripping and perfectly written, yet the most simple plot of any writer's wonders...and based on a true story!?!?!?!?",
            "review_date": "2015-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i fucking love this film great preformces by Joseph Gordon Levitt and Seth Rogen",
            "review_date": "2015-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "***\nIt has likeable characters and some good jokes, which in itself is quite a feat in a comedy about cancer, but '50/50' doesn't always hit.",
            "review_date": "2015-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can't say is wanna see this again, definitely made me laugh",
            "review_date": "2015-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An insanely effective film in emotion and drama, but it falls a little in comedy. I wish this film did have more laughs, that being said, the overshadow of how effectively this movie created sadness is good enough for me. Really impressive stuff",
            "review_date": "2015-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is an amazing blend of humor and drama, which is anchored by the solid performances and great writing.",
            "review_date": "2015-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was okay considering it was probably a low budget film.",
            "review_date": "2015-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inspired by a true story, 50/50 is an original story about friendship, love, survival and finding humor in unlikely places. Joseph Gordon-Levitt and Seth Rogen star as best friends whose lives are changed by a cancer diagnosis in this new comedy directed by Jonathan Levine from a script by Will Reiser. 50/50 is the story of a guy's transformative and, yes, sometimes funny journey to health - drawing its emotional core from Will Reiser's own experience with cancer and reminding us that friendship and love, no matter what bizarre turns they take, are the greatest healers.",
            "review_date": "2015-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "55%\nSaw this on 25/7/15\nWe live in a time when the word cliche itself has become a cliche and on it's light I would like to say that 50/50 is the most cliched film I have seen in the recent times, perhaps after Jurassic World. The film's cliches range from the nauseating sexism of Seth Rogen movies, rom-com cliches and cliches of protagonist suffering from diseases and not to mention parent-child cliches. Anyways, 50/50 does have some touching moments and fine acting from Anna Kendrick and Joseph Gordon-Levitt .",
            "review_date": "2015-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed this film very much, funny and heartwarming, worth a watch.",
            "review_date": "2015-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is making me question whether I cry with every movie or just special ones. Never have I cried so much during a movie. I should hate this movie. It has all the stereotypes. Man has cancer, girlfriend dumps him, best friend is a horndog, he meets a new girl, the nit picky mother, and the ever so famous hollywood ending. But heres the thing, these stereotypes all come with real characters. Adam (played by Joseph Gordon Levitt) is one of the most real characters I've seen. He's not the typical whiny cancer kid, and he's not the typical bold pretty boy. He's flawed and those flaws make him real, his friend Kyle (played by Seth Rogen) is not just a horndog, he cares for his friend and he is more than the comic relief Seth Rogen character. Ive seen movies with characters I cant believe that have whole franchises to make them believable (Twilight, Cars, and any Michael Bay project), yet somehow, I feel for everyone including the minor characters. Without giving too much away, one of the times I cried the most had to do with a minor character. Im surprised this didnt get nominated for anything\n9.5/10",
            "review_date": "2015-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All this despite having an indifference to the 3 main leads. \n\nCancer and humour, it just works for some reason. This and \"Fault in Their Stars\" both great films",
            "review_date": "2015-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not exactly a classic but a reasonable watch, difficult subject dealt with excellently and the 2 male characters very close to how I imagine it would.",
            "review_date": "2015-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny and heart warming thanks to the most perfect cast to match. There some funny moments and some equally sad moments. Seth Rogen adds some of his humour and his chemistry with Levitt is very good. Levitt was great in his role. Everyone fit their character very well.",
            "review_date": "2015-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hard-hitting as a drama, and even harder as a comedy, \"50/50\" deals with a relatable and tough subject, and Joseph Gordon-Levitt takes on the role with absolute courage.",
            "review_date": "2015-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A realistic movie with great direction and performances by all, specially by Levitt and Seth.",
            "review_date": "2015-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a mean movie!. everyone did a good job!.",
            "review_date": "2015-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, entertaining, touching, a great film.",
            "review_date": "2015-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another good movie bought , good mix with drama & comedy , one of my younger favorite actors Joseph Gorden-Levitt does that good ! SOMDVD",
            "review_date": "2015-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite comedy! even thought it has more drama elements then comedy it is still a great dramedy movie.",
            "review_date": "2015-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"50/50\" successfully balances comedy and drama while treating its subject matter with sensitivity and insight in order to honestly appeal to the emotions.",
            "review_date": "2015-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Witty and sad. The perfect mix of what a good black-comedy should be!",
            "review_date": "2015-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is a heartwarming/ heartbreaking drama that had me in tears and in stitches.",
            "review_date": "2015-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie mixes comedy and emotion without ever feeling forced or manipulative.",
            "review_date": "2015-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an underrated movie. Adam is informed that he has cancer and is told that he has a 50/50 chance of surviving it, this changes his perspective on life and his best friend Kyle tries to help him get through this ordeal. \"50/50\" is not your typical cancer movie where it tries to tell the story without trying to be over-dramatic while at the same time balancing humor and tragedy.",
            "review_date": "2015-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why did it take me so long to watch this? I need to buy this shit.",
            "review_date": "2015-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has a whole lotta heart. Seth Rogen and Joseph Gordon Levitt have such believable chemistry.",
            "review_date": "2015-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "remarkably tender buddy comedy and serious drama",
            "review_date": "2015-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Get the box of Kleenex ready.  If you are a \"manly man\" and want to stay that way, do not watch in front of your gal.  She will see your sensitive side. This movie is touching, hilarious and a great story!",
            "review_date": "2015-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 succeeds on its subtlety and naturalism, a refreshing change for an american comedy drama. Joseph Gordon Levitt shows us another side to his acting, as he plays a shy well mannered man who we follow in the troubles of dealing with this devastating disease. Backed by great performances from the charismatic Anna Kendrick, always funny Seth Rogan and entertaining Anjelica Huston and Bryce Dallas Howard, 50/50 is likable film, which although underplayed, excels for it.",
            "review_date": "2015-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie Seth Rogen Film. In my opinion. A",
            "review_date": "2015-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie of the strong of a soul",
            "review_date": "2015-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film truly pulls at the heart  strings when it is needed to and makes me laugh at just the right parts",
            "review_date": "2015-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A delightful comedy with difficult themes, 50/50 is both heartwarmingly funny and heartbreakingly sad, a combination that works thanks to Jonathan Levine's subtle direction, an honest and engaging screenplay, and phenomenal acting performances.",
            "review_date": "2015-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A different way to see life drama. Thumbs up!",
            "review_date": "2014-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A delicate story about a difficult subject. 50/50 almost wants to be a comedy, but fails to mask the emotion and rawness conveyed by Gordon-Levitt and Rogen, throughout the film I felt a real sense of compassion and sympathy for Adam (Gordon-Levitt) but couldn't help allowing my spirits raised by the instant connection between Adam and Kyle (Rogen).",
            "review_date": "2014-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Deft in both emotion and humor, 50/50 employs Gordon-Levitt's gravity foiled by Rogen's earnest crass to a sincere but not exploitative end, making the most out of the practical, unspoken, awkward circumstance of cancer.",
            "review_date": "2014-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Joseph Gordon Levitt is great but Seth Rogan is close to unbearable. Hard subject dealt with well at times but clumsily at others.",
            "review_date": "2014-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I never thought a film like 50/50 that has drama mix with comedy, all about cancer, could be a fantastically well done comedy with a little touch of drama that's been handle so well in this film, because 50/50 is one of the best movies of 2011. \n\nThe story to 50/50 is about a young man is diagnosed with a rare form of spinal cancer and decides to fight for his life with the help his friend, mother and a young therapist. \n\nWhen 50/50 first came out back in 2011 I didn't take much notice on it, as I was only watching movies that I wanted to watch, and let's not forget I was only about 12 years old at that time, and as a brainless 12 year old, I liked Green Lantern and Transformers: Dark of the Moon but skipped this movie, and boy was it the biggest mistake of my life for skipping this movie. \n\nThis has to be Joseph Gordon-Levitt best role that he was in, because in this movie he showed anger, sadness and pure happiest with his friend, and Joseph nailed all those three and he carried this movie by his actions and his performance that was nothing short, but spectacular in any way. \n\nNow I'm going to get this out of the way, but I thought Seth Rogen was going to be annoying in this movie, just by the posters and the trailers made it out that he was annoying tool, but my god I was dead wrong about Rogen, because in this movie I saw Seth Rogen giving a serious, but still funny performance, and I'm not kidding you but in this movie he almost made me cry and I never thought that could be possible. His character is supportive, caring and really caring and it's all by the brilliant performance from Seth and the movie groundbreaking writing. \n\nThe writing is some of the best written comedy and the most down to earth wring I've seen in a while, and I'm still shocked that this movie didn't get a Oscar Nomination for writing. Man f''k the Oscars.\n\nNow I normally don't do this in my reviews and what I mean is like I don't talk about big dramas or something very serious happening in my life, because it's my life and it's private, but now I have to get something out there and I want you all to know why I think this movie is freaking fantastic, is because one of my family members use to have cancer and that was my mum, while she was going through chemo and surgery. I watched her and supported her and I saw her doing extreme and crazy things that she will never do before, and as a person (Like me) who had to go through something so horrible like that and then watch 50/50 a movie that to me get's anything right and the character's that feel like people not movie character's that's why I think this movie is just flawless and get's it right.",
            "review_date": "2014-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its transition from drama to comedy is not always seamless, but 50/50 is a very fine film with exceptional screenplay, excellent realistic approach which goes from humorous to grounded to moving, some funny as well as some heartbreaking moments and superb acting, especially from Joseph Gordon-Levitt who gives another powerhouse performance here. It is a film that easily could have gone to cliched/forgettable territory given its usual subject matter, but which deftly avoids those genre trappings with a truly refined direction and execution. It is funny, emotionally resonant and grounded dramedy all at the same time and it is quite honestly one of the finest films of 2011.",
            "review_date": "2014-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not easy to blend Cancer stories with humor and a touch of hope. This movie pulled it off.",
            "review_date": "2014-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is yet another example of how you should never determine the outcome of a movie until viewing it yourself. Anyone can jump to the conclusion that this movie wouldn't work due to the casting of stoner comedy actor Seth Rogen. Not only was Seth Rogen really good but the movie he was in was phenomenal! The plot of 50/50 consists of the life of Adam (played by Joseph Gordon Levitt) who finds out that he has a tumor growing in his spine and that there's a 50/50 chance that he will survive. As weird as this sounds, this is most likely the funniest movie about cancer you'll ever see. There a lot of humor that makes a depressing and sad situation seem lighter in heaviness of the fact that Adam may not survive. This adds an on edge experience to an otherwise funny movie. The character of Adam I really enjoyed because of his attitude. He doesn't always accept the fact that he may die and when he does accept that he has a poor attitude and doesn't know how to handle it in the best ways. He lashed out at people and treats them like garbage even. He's vulnerable and nervous and I really believed Gordon Levitt's performance. Seth Rogen was perfectly cast as Kyle, he was the brightness at the end of the tunnel. Like Adam, he couldn't channel his emotions very well either with people. Deep down everyone hides their emotions and even though they don't always show it, they care. Adam wasn't able to realize the way he was treating people until he talked to someone. Katherine was the perfect and believable significant alter for Adam because of the way that they connected with each other and knew each other's flaws when they themselves couldn't realize them. There's also multiple takeaways from 50/50 that apply to everyday life like realizing what you have and treating it respectfully. But not only that but also to find hope at the end of it all. Adam is told to have hold throughout it all and that even though he feels alienated that there are people all around him that care. This whole experience changed Adam's life around as well as everyone around him and while not all of that was positive, he still learned that it's important to have an open mind about the situation. There were more than a few emotional scenes that didn't feel fake or forced, they felt real. When a situation as sad as this feels real, there's something special to behold. 50/50 is not your typical film. At one point it feels like a downer and then brightens up, it made me laugh in one scene and then cry in the next. It was endless entertainment and a really great time to watch. A",
            "review_date": "2014-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 effortlessly blends comedy and drama around the harsh reality of cancer, and along with it, multi-dimensional characters that are intriguing in their own unique way.",
            "review_date": "2014-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Both sad and funny, this is an amazing movie!",
            "review_date": "2014-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is such a heartlight comedy and Joseph-Gordon Levitt gives his best in portraying cancer and all the pain it causes, so this movie is very good.",
            "review_date": "2014-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pleasantly surprised. I appreciate the heart.",
            "review_date": "2014-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fantastic film deftly swerving through a touchy topic with humor and heart felt emotions.",
            "review_date": "2014-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A positive film with a difficult topic. Well delivered.",
            "review_date": "2014-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Starts slowly with a difficult subject, but ultimately a well made film with some great comedic pieces",
            "review_date": "2014-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A pretty good film with good acting had a lot of heart and humorus moments a great dramedy with great performances \nGrade A-",
            "review_date": "2014-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Joseph Gordon-Levitt is exceptional (as always)",
            "review_date": "2014-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice angle on a hard subject and very funny.",
            "review_date": "2014-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A picture of an inspiring & heartwarming story combined with Seth Rogen's humor and Levitt's natural acting with amazing screenplay of Levine's brilliance is equivalent of one of the best Comedy - drama that will come out in years. Seriously it deserve more than a Oscars.",
            "review_date": "2014-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Caricatures in place of characters sink the potential of this film.",
            "review_date": "2014-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a movie that really puts in the perspective of life and all its up and downs",
            "review_date": "2014-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the first time a buddy film made me teary-eyed because of the story and not because of the laughter. \n\n50/50 is easily one of the best drama-comedy movies I've seen. Ever. You seriously need to add this on your watch list because once you start watching, there is no turning back. The story cuts to the chase right from the very first five minutes and from there, it just continues to reel you closer and closer to its characters. What's more is that the cast have done superlative performances making the protagonists' situation even more moving and dramatic. Joseph Gordon-Levitt and Seth Rogen did a fantastic job in portraying a duo of friends who stood by each other through thick and thin. Likewise, the writing is undoubtedly a killer! It's a rollercoaster ride of laughs, tears, love, friendship and survival. Beats out all the cancer-themed films I've heard and seen so far. Director Jonathan Levine, you are awesome. 5/5 hands down.",
            "review_date": "2014-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review In A Nutshell:\n\nI wasn't blown away with the first film that I have seen from director Jonathan Levine, Warm Bodies, as there were elements of it that showed high potential when read on paper but seeing his execution on screen felt underwhelming. Though even after that experience, I still had high hopes for 50/50, as its premise seemed to show an opportunity for drama and its poster and cast shows that it also could come off as funny. This film could have been the perfect drama-comedy but due to problems in balance prevent it from being so. Nevertheless, 50/50 still has its charms.\n\nThe film's plot of a young and healthy man, who suddenly received news of spinal cancer, was definitely an interesting one. I have seen many films that contain characters who suffer from the disease, but their role always seems to play as a hurdle for other characters to deal with. This time, we see a film that centralizes on the stages during this unfortunate event and ultimately leading to the final destination that determines his prognosis.\n\nThe story features interesting events that I felt was true to life. We get to watch the ranges of emotions that a person would go through when the chance of death is just around the corner. Stages of grief are clearly shown obviously here but the film prevents itself from being predictable in that sense, as though our protagonist does undergo those stages, it is written in such a way that felt personalized rather than an example from a psychological textbook.\n\nThough I was impressed with the film's personal character driven narrative, I was even more impressed with the aspects slightly outside that, which are the relationships that the protagonist has. All figures of his life are given enough time for exploration, and each one could simply be a story on their own. I did have fun watching his relationship with his best friend as it handles the idea of friendship in such a natural way that one can't help but feel a little convinced that these are more than just fictional characters. The protagonist's relationship with his girlfriend and therapist, particularly the former, felt realistic and dealing with problems that one can also find in the people that walk around us; though I did have minor issues with his relationship with his therapist as its ending felt warm but ethically immoral even if he is not her patient anymore, I think my problem is that for a film that contains so many elements that feel organic, why hurt that with a false ending? Both of these relationships were entertaining to watch, none of them though was able to make me care as much as his relationship with his parents. Levine handles it with such tenderness that I was close to showing external sadness towards it. There was a scene near the end of the film, where the protagonist and his parents are at the pre-operation ward, waiting to be called into surgery; that moment resonated so much with me as I have had many opportunities to care for patients like him and I never really understood the feelings they go through as they always seem to project a persona in front of you telling that they are fine. Seeing him express his fear and anxiety made me recall back on my own experiences and the look his father gave to him after saying \"I love you\" was heartbreaking.\n\nMy core issue with this film is simply in Levine's handling of the film's tone. He clearly wants to blend the film with both a comedic and dramatic aspect but I felt he has not mixed efficiently enough that it felt like eating something with curds. The comedy in this film was certainly effective as I did find myself chuckling quite a few times but its first half reached to a point of over-saturation where it starts to hurt my overall experience, it could have been improved if Levine was able to buffer these moments with drama that echoes the effectiveness of its comedy. Also sentimentality is a tricky element, when it comes to judging how I feel about it in film, as it entirely depends on how the director executes it and the overall value of its purpose; 50/50 is definitely the type of film that I expected high sentimentality from but the film just couldn't deliver the goods. Its key moments did feel melancholy and sympathetic, but it didn't reach the heights that for example \"Terms of Endearment\" was able to achieve. I think Levine in this film was attempting to match the quality that Marc Webb was able to bring with \"500 Days of Summer\", but sadly missed the mark.\n\nThe performances from the cast in this film were great, though what they have delivered, aside from Rogen's, are far from their best. Joseph Gordon Levitt was able to handle the demands that Levine required from him, carrying heavily the dramatic aspect of the film while still possess a sense of humour. Watching him interact with both Rogen and Kendrick, and the differences that he brings to the character in each moment makes his character come to life, and avoiding coming off as one-note. Seth Rogen as I have said surprised me here, showing off a bit of emotion that I never thought the actor even had, and delivers it in such a way that was layered. This is now twice in a row that Anna Kendrick has impressed me, her performance in this film was fantastic, portraying as the love interest but does so in a way that avoids the overly-recycled and recognizable characteristics, at least that is how I felt. This is certainly far from her best role, as for now that merit goes to her role in Up in the Air.\n\nI definitely expected more from 50/50, but overall it holds up and has determined itself to be worthy of at least positive praise. After seeing this, it does make me worry whether or not Levine is actually a worthy filmmaker to invest my time in as he doesn't seem to have a personal trademark that make himself distinctive from his rival competitors.",
            "review_date": "2014-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review In A Nutshell:\n\nI wasn't blown away with the first film that I have seen from director Jonathan Levine, Warm Bodies, as there were elements of it that showed high potential when read on paper but seeing his execution on screen felt underwhelming. Though even after that experience, I still had high hopes for 50/50, as its premise seemed to show an opportunity for drama and its poster and cast shows that it also could come off as funny. This film could have been the perfect drama-comedy but due to problems in balance prevent it from being so. Nevertheless, 50/50 still has its charms.\n\nThe film's plot of a young and healthy man, who suddenly received news of spinal cancer, was definitely an interesting one. I have seen many films that contain characters who suffer from the disease, but their role always seems to play as a hurdle for other characters to deal with. This time, we see a film that centralizes on the stages during this unfortunate event and ultimately leading to the final destination that determines his prognosis.\n\nThe story features interesting events that I felt was true to life. We get to watch the ranges of emotions that a person would go through when the chance of death is just around the corner. Stages of grief are clearly shown obviously here but the film prevents itself from being predictable in that sense, as though our protagonist does undergo those stages, it is written in such a way that felt personalized rather than an example from a psychological textbook.\n\nThough I was impressed with the film's personal character driven narrative, I was even more impressed with the aspects slightly outside that, which are the relationships that the protagonist has. All figures of his life are given enough time for exploration, and each one could simply be a story on their own. I did have fun watching his relationship with his best friend as it handles the idea of friendship in such a natural way that one can't help but feel a little convinced that these are more than just fictional characters. The protagonist's relationship with his girlfriend and therapist, particularly the former, felt realistic and dealing with problems that one can also find in the people that walk around us; though I did have minor issues with his relationship with his therapist as its ending felt warm but ethically immoral even if he is not her patient anymore, I think my problem is that for a film that contains so many elements that feel organic, why hurt that with a false ending? Both of these relationships were entertaining to watch, none of them though was able to make me care as much as his relationship with his parents. Levine handles it with such tenderness that I was close to showing external sadness towards it. There was a scene near the end of the film, where the protagonist and his parents are at the pre-operation ward, waiting to be called into surgery; that moment resonated so much with me as I have had many opportunities to care for patients like him and I never really understood the feelings they go through as they always seem to project a persona in front of you telling that they are fine. Seeing him express his fear and anxiety made me recall back on my own experiences and the look his father gave to him after saying \"I love you\" was heartbreaking.\n\nMy core issue with this film is simply in Levine's handling of the film's tone. He clearly wants to blend the film with both a comedic and dramatic aspect but I felt he has not mixed efficiently enough that it felt like eating something with curds. The comedy in this film was certainly effective as I did find myself chuckling quite a few times but its first half reached to a point of over-saturation where it starts to hurt my overall experience, it could have been improved if Levine was able to buffer these moments with drama that echoes the effectiveness of its comedy. Also sentimentality is a tricky element, when it comes to judging how I feel about it in film, as it entirely depends on how the director executes it and the overall value of its purpose; 50/50 is definitely the type of film that I expected high sentimentality from but the film just couldn't deliver the goods. Its key moments did feel melancholy and sympathetic, but it didn't reach the heights that for example \"Terms of Endearment\" was able to achieve. I think Levine in this film was attempting to match the quality that Marc Webb was able to bring with \"500 Days of Summer\", but sadly missed the mark.\n\nThe performances from the cast in this film were great, though what they have delivered, aside from Rogen's, are far from their best. Joseph Gordon Levitt was able to handle the demands that Levine required from him, carrying heavily the dramatic aspect of the film while still possess a sense of humour. Watching him interact with both Rogen and Kendrick, and the differences that he brings to the character in each moment makes his character come to life, and avoiding coming off as one-note. Seth Rogen as I have said surprised me here, showing off a bit of emotion that I never thought the actor even had, and delivers it in such a way that was layered. This is now twice in a row that Anna Kendrick has impressed me, her performance in this film was fantastic, portraying as the love interest but does so in a way that avoids the overly-recycled and recognizable characteristics, at least that is how I felt. This is certainly far from her best role, as for now that merit goes to her role in Up in the Air.\n\nI definitely expected more from 50/50, but overall it holds up and has determined itself to be worthy of at least positive praise. After seeing this, it does make me worry whether or not Levine is actually a worthy filmmaker to invest my time in as he doesn't seem to have a personal trademark that make himself distinctive from his rival competitors.",
            "review_date": "2014-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the ultimate Bromance movie, either way it is awesome.",
            "review_date": "2014-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well written, well acted.  50/50 is a gem.  Very rarely do movies capture the essence of health relationships so well, but 50/50 does it wonderfully.  The music is great as well, as is the comedy.  See it!",
            "review_date": "2014-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 presents a touch topic, but is charming, heartfelt, surprisingly funny and emotionally powerful at times, and features a career best performance from Joseph Gordon-Levitt.",
            "review_date": "2014-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a spectacular leading performance from Joseph Gordon-Levitt, this is an remarkable film that perfectly blends comedy and drama.",
            "review_date": "2014-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50 50 is like life, true and direct...Great casting makes this intents subject, Cancer, and struggle and desire to live, easier to deal with and there are good break times from the subject for the audience.",
            "review_date": "2014-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An incredibly captivating film that smartly blends humor and drama.  It's a real tear-jerker for sure!",
            "review_date": "2014-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The problem with 50/50 is that it tries to cushion the blow of the subject matter with cliché, Seth Rogen and neat conclusions which makes the whole film feel cheap and predictable. It's disappointing that this route was chosen given the potential of the premise.",
            "review_date": "2014-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An emotional feel so good movie",
            "review_date": "2014-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I laughed, I cried and I cheered.  Winning combination.  Oh look...Seth Rogen playing himself...again.  JGL playing a great character...Amazing.",
            "review_date": "2014-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a movie inspired by events in Seth Rogen's life, or rather that of his best friend (here named Adam, and played well by Joseph Gordon Levitt), who was diagnosed with cancer at a very young age and given a 50/50 chance to live (hence the title).   Seth Rogen is playing himself in a similar manner as his other performances, and it is probably the best movie he has been in.  Oddly, he doesn't often come off that well, and I don't think he was really meant to in the way he often is.  He is an inept friend who doesn't know how to respond to something as unexpected, serious and seemingly unnatural as a young best friend getting cancer.  Nobody else does either, especially the stricken lad's mother.  Frankly, there is no good way to respond to this sort of thing, only levels of insufficient. \n\nThis is a movie of disarming realness which creeps up on you.  It isn't raw, but it knows when to be harrowing.  The scene where Adam finally breaks down in the car is hard to watch, especially for me because I've seen that breakdown with my own eyes.   50/50 unexpectedly takes the understated approach throughout, this is effective in capturing the banality that makes up most of the life of being a patient.  It is a movie which, due to the trailer and the presence of Seth Rogen, one expects to be like another buddy raunch movie, but it isn't.   I found it to possess a quiet dignity and resonance.  A really good little movie.",
            "review_date": "2014-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable, but not quite as funny or emotionally stimulating (?) as I expected.  That's why it's bad to go into movies with high expectations.",
            "review_date": "2014-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfectly paced, perfectly directed, perfectly enjoyable, this may one of the most single best overall packages a movie has ever done.",
            "review_date": "2014-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "JGL! proven once again.",
            "review_date": "2014-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honest and powerful performances from the lead. Definitely Seth Rogans best roll. Heartfelt, touching and just edgy enough to make this film a joy. \nGrade: A-",
            "review_date": "2014-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Second time I watched and it still keeps my attention riveted.  Substance, actors, music, scenery, filming :  All exceptionally moving.  And funny.",
            "review_date": "2014-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, Sad, Heartwarming, but most of all entertaining. The last 40 to 30 minutes I almost cried. It's just so good. Overall, it's a movie everyone should see.",
            "review_date": "2014-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most moving films I have ever seen. It's funny when it needs to be and heartfelt as well. It's a beautiful balancing act and one of 2012's best movies.",
            "review_date": "2014-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story about a young, scared, man(Joseph gordon-levitt) struggling to fight cancer. My biggest love for this film is that it makes you cry then laugh. Seth rogen  plays well, Seth rogen, Joseph's crude friend. They have a great chemistry through out the movie. Then we have the young therapist(Ana Kendrick) which isn't a doctor yet, a over protective mom, and two funny old men with cancer. This movie is a fun emotional ride.",
            "review_date": "2014-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this movie! So very good.",
            "review_date": "2014-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tackles a sensitive subject with smart writing, perfectly timed humor, and solid acting/chemistry from its leads. A comedy/drama that I revisit all the time.",
            "review_date": "2014-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 a dramatic comedy about a young man that out of some bad luck gets a rare cancer and goes on this journey to fight this cancer and get rid of it and it also shows the importance of the support system around the patient.\nJoseph Gordon-Levitt\nplays an unforgettable role of the patient that is going through the battle.\nSeth Rogen at first i was like yea maybe he is the wrong casting choice for this film, but he plays the humor at the right levels and plays the supportive best friend to a Tee.\nI would recommend this movie to anyone a little too adult for the kiddies.\nBryce Dallas Howard plays the bad girlfriend that really does not have the best intentions for Adam.\nAngelica Huston plays the mum of Adam and at first i could not recognize her she was a bit like wow is that really her i had to take a double take on how she looked and thats not a bad thing she just looked like some other actor i had seen in another movie.\nThe bonds of family support and love in this movie mean a great lot.",
            "review_date": "2014-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great drama. An ok comedy.",
            "review_date": "2014-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie, could happen to anyone.",
            "review_date": "2014-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie with even-keeled, deeply moving performances.",
            "review_date": "2014-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good movie. Full of ups and downs, and the emotional effects of cancer. Overall, an amazing and thoughtful film about a difficult disease.",
            "review_date": "2014-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wanted to like this movie, but it was a challenge. Not bad, but not very good. \n\nNo emotional hooks, lackluster performances by the leads too. I'd give it about 60%",
            "review_date": "2014-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am not a Levitt fan. I am not a Rogen fan. Placed in this offensive, poorly constructed story that can't decide if it's a comedy or a drama, both actors fail miserably and quite predictably. Rogen can't bring the laughs, as those have been expended long ago. Levitt doesn't have the acting chops to bring the drama and so this movie hovers in the awkward in between, boring the audience at some points, offending at others and leaving us speechless with horror at other times. 50/50 is a stereotypical Rogen and Levitt bomb respectively. Sadly for the audience, they just happen to do it in the same movie.",
            "review_date": "2014-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "made me cry it was really good :)",
            "review_date": "2014-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, a movie with Seth Rogen and Anna Kendrick that I didn't hate. However, Rogen and Kendrick are still irritating and it's Gordon-Levitt that makes the movie work. It's kind of fluff for a film about cancer and isn't anything amazing but it's pretty enjoyable for what it is.",
            "review_date": "2014-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I haven't seen many cancer-themed movies, but I'm willing to bet this is one of the best. Funny, mature, honest, touching, and ultimately inspiring, this may also be the best film in Seth Rogen's career.",
            "review_date": "2014-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A melodramatic idea without a melodramatic execution. I like that!",
            "review_date": "2014-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was funny heartwarming and was one Joseph Gordon Levitt best performances on the big screen.",
            "review_date": "2014-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What makes this a really well crafted film is it's appreciation for the little things.  It's filled with small scenes that focus on facial expression and symbolism.  A lesser film would have Joseph Gordon Levitt's character go soul searching, constantly saying melodramatic corny lines, and constant crying and screaming.  Instead all of the characters barely show any emotion and deny the situation.  It gives a strong realism, showing that situations like this are actually uncomfortable.",
            "review_date": "2014-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bright and quite light film about a very serious subject. The story is very believable and made fitting for the bigger audiences with well know actors, a standard build-up and setting.\n\nNot a unique film, it's very standard and it follows a prosedure that you see in every other Hollywood drama.The acting is all right, it got it's moments and it surely is enjoyable even if cliches are trying to kill it. It surely is easy to figure, nothing comes as a shock here. It's not especially funny or heartbreaking - it's somewhere in the middle but somehow it manages to come out of it quite nicely.\n\n7 out of 10 bald heads.",
            "review_date": "2014-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A clever, funny and touching comedy which deserves praise for handling its sensitive topic, whilst seamlessly switching between drama and humour",
            "review_date": "2014-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The saddest part of all was between him and his mother. Not gonna lie. I teared up.",
            "review_date": "2014-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best thing that this movie does is while it is a comedy, it treats a serious subject seriously. It doesn't make light of cancer or use it as a recurring joke, but really makes you feel how difficult it must be for Adam and the people around him. The characters are written well - even Rachel, who could come across as completely unlikable, has her redeeming moments. Most of the laughs come from Seth Rogen, and it is quite funny at times. As much as I love her, I think Anna Kendrick is actually the weak link in this movie. Especially in her early scenes, she is overplaying the flustered, young doctor who doesn't know what to do. And so it took a while for me to believe that Katherine and Adam should get together. That aside, it's definitely worth seeing.",
            "review_date": "2014-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit over crude in places, but also some real gems sprinkled throughout, especially the scenes with Kendrick.",
            "review_date": "2014-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One word for Gordon Lewitt and Rogen - AWESOME",
            "review_date": "2014-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are so many 'Awkward Moment' on this film. Not really sure how to feel about it . btw, Anna Kendrick >>>>>>>>>>>>>>>",
            "review_date": "2014-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's no way to predict how an severe illness will effect your family and friends. This is a wide open view of love and respect.",
            "review_date": "2014-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartwarming, original, humourous, and entertaining.",
            "review_date": "2014-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Theres a 50/50 chance you will like this movie...Oh wait that's not true, there's a 100% chance you will LOVE this movie.",
            "review_date": "2014-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Reasonable job of delivering light hearted laughs while tackling cancer.",
            "review_date": "2014-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Moving and funny, 50/50 is a great vehicle for Joseph Gordon-Levitt, Seth Rogen, and Anna Kendrick.",
            "review_date": "2014-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really enjoyed this.  Kind of puts some things in perspective.  Also a nice mix of humor in there with Seth Rogen.",
            "review_date": "2014-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the...if not the only Seth Rogen film I have ever seen and liked. \n\nI knew of Joseph Gordon and Rogen prior to this film and was a little hesitant to see it thinking it would be lame and cause me to drool, however it was surprising.\n\nThe character relationships were awesome and as usual Bryce didn't disappoint as the bitch. \n\nThe parent aspect was on par with how an overbearing mom would act and the therapist relationship left you wondering just where boundaries were. The relationship between JGL and the men he meets at Chemo was equally as compelling and funny and gave an added element to the film to toss you back and forth on that roller coaster of emotions you had no idea a movie like this would insight. \n\nIf you are going just for funny you will be disappointed as this movie isn't just about funny (Which it has) it is about fear, pain, heartache, friendship, family and new beginnings. All this rolled up into characters you can relate to played well by actors that make you think you are their friends and this movie was a must see, more than once.",
            "review_date": "2014-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredibly dramatic and funny. 50/50 is a movie that makes you think about what would you do if you were there.",
            "review_date": "2014-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was an absolutely terrible movie and a tremendous waste of a brilliant cast. The film lacked energy, humor, and made a gloomy subject even more gloomy. I would rather have cancer than be forced to watch this awful movie",
            "review_date": "2014-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's like \"Terms of Endearment\" - except it's for dudes! And it ends better. Yikes, that's probably a spoiler. Anyway, a true comedy-drama that sheds some light on cancer and cancer treatment. Bryce Dallas Howard's continues her theme of despicable characters - carrying over \"The Help.\" Seth Rogen delivers an above-average performance again as himself (but I still love it!) Angelica Houston has a great role as the martyr.",
            "review_date": "2014-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very very beautiful film! \nGreat actors!",
            "review_date": "2014-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious and serious, 50/50's intensity is equally matched by its humor.",
            "review_date": "2014-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny and heart warming. 7/10",
            "review_date": "2014-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, moving and downright entertaining. It even brought tears to my eyes. 50/50 is an absolutely amazing movie and features incredible performances, Seth Rogen's best yet.",
            "review_date": "2014-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unemotive. Stiff. Blech.",
            "review_date": "2014-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible!!! I loved it http://lalunadebergen.wordpress.com/2014/03/29/5050-jonathan-levine-2011/",
            "review_date": "2014-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just as funny as it is sad.",
            "review_date": "2014-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good, more of a serious role for Rogen. Funny parts with a serious underlining.",
            "review_date": "2014-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing movie about how to live with cancer",
            "review_date": "2014-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really dig this movie.",
            "review_date": "2014-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's no surprise that Joseph Gordon-Levitt and Seth Rogen both gave excellent performances. With that, the movie also fused the elements of comedies and dramas really well.",
            "review_date": "2014-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is a film that can make a somber and dark subject as cancer into something joyful and actually, a bit beautiful.\nFave Film.",
            "review_date": "2014-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Works as a drama, and JGL plays the part just right. Seth Rogen tries, but doesn't succeed as the comical best friend in a movie with such a serious nature. Whenever there is a movie about a topic like cancer, jokes are not that acceptable.",
            "review_date": "2014-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inspirational, original, heartfelt, and also heartbreaking, 50/50 is one of the most beautiful and gut-wrenching dramedies I have ever seen.",
            "review_date": "2014-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story and terrific acting!",
            "review_date": "2014-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good, contrasting acting jobs by JGL and Rogan. Anna Kendrick also shines, and this funny, poignant film does too.",
            "review_date": "2014-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "joseph gordon-levitt has a lot of charisma and knew how to wear that character. the story is not powerful, but it is beautiful.",
            "review_date": "2014-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ah fuck I love this movie.",
            "review_date": "2014-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is actually the first movie where I don't hate Seth Rogen.......Anna Kendrick is as cute as always....I think the movie was pretty cool.....",
            "review_date": "2014-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I rented this movie on a whim. I never thought I'd fall in love with it.",
            "review_date": "2014-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My 90th R-rated movie, and an interesting and unique look at those who suffer from or survived cancer.  Loosely based off Will Reiser's experience with spinal cancer, 50/50 follows Adam, a public radio journalist, suffering from back pains, goes to the doctor, only to discover he has schwannoma neurofibrosarcoma, a malignant tumor in his spine (spine cancer), and must try to beat it while going through therapy and dealing with his life.  The film perfectly explores the way a cancer patient goes through life, including doctor appointments, treatments (chemotherapy, surgery, medical marijuana), and wondering what the outcome will be (not trying to scare anyone).  The film details how the case can affect the person and those close to him (friends and family) with their emotions and concerns towards the patient and the doctors.  Will Reiser, who had been diagnosed with spinal cancer in 2005, only to survive by going through a life saving surgery in order to remove the cancer, and was inspired by Seth Rogen and Evan Goldberg to write a screenplay based on his experience, captures everything that goes on in each character's life, as well as evenly following the events throughout.  Jonathan Levine is able to find the right place and time to shoot the scenes, and he nails his part in the production.  The acting is incredible, which includes main stars Joseph Gordon-Levitt, Seth Rogen, Anna Kendrick, and Bruce Dallas Howard in their respective roles, and they are able to find the appropriate reactions for each scene in the film.  The film has an intelligent blend of comedy and drama, and the transition between each genre is perfect, which gives lots of laughs and emotion.  A must-see for audiences and cancer patients.",
            "review_date": "2014-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touching with some very light heart-moments mixed in. \nSuperb casting, with Joseph Gorden Levitt being completely captivating.",
            "review_date": "2014-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic movie about a difficult subject. \nFunny, moving & thought provoking with fantastic performances all round.\n\nHighly recommended.",
            "review_date": "2014-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A light-hearted comedy about cancer shouldn't work as a whole, but in this case it really does. It's a nice story of friendship, budding romance & betrayal. Joseph Gordon-Levitt's character goes through all these different emotions that you guess you would after such a diagnosis too. It's natural & he's still beautiful when bald!",
            "review_date": "2014-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie about a guy trying to survive cancer with the support of his best buddy the plot is great the acting is great overall A",
            "review_date": "2014-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some good guys. One has some problems. One is a wit-master.",
            "review_date": "2014-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "all the ingredients come together just right to make great comfort food. a pleasure to watch.",
            "review_date": "2014-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"50/50\" is one of the best movie of the year!\" \"Joseph Gordon-Levitt delivers the emotional, very passion, and breathtaking performance of his career!\" The performances by the rest of the cast is outstanding. The directing by Jonathan Levine is incredible. The screenplay by Will Reiser know how to write a excellent screenplay for a great movie. The score in this movie is good. \"I'm raving the \"50/50\" is one movie of 2011 that it a must see movie!\"",
            "review_date": "2014-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "just saw this today pretty good movie",
            "review_date": "2014-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is well-written and the subtle acting is never over the top which makes this story so real.  Wonderful!",
            "review_date": "2014-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed this movie! I felt a real emotional connection with the main character Adam. For all of the emotional drama that this movie has, it has its equal share of comedy which is really nice. I found myself laughing out loud many different occasions throughout. I would definitely recommend it to everyone!",
            "review_date": "2014-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film about true friendship.",
            "review_date": "2014-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good-hearted, touching and funny, 50/50 skillfully tackles a rather difficult topic of cancer. The lead character Adam, played impeccably by Joseph Gordon-Levitt, had gone through being diagnosed, chemotherapy, surgery and finally surviving cancer. 50/50 draws on how the world of a man diagnosed with cancer get rocked, goes through a tumultuous ride of highs and lows and brings the best of emotions from family and friends. A definitive watch.",
            "review_date": "2014-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5 stars across the board! One of my favorite movies of all time. Seth Rogen is hilarious and JGL is great. Anna kendrick is very good and the story went along very smoothly. Definitely recommend!",
            "review_date": "2014-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just as funny as it is sad.",
            "review_date": "2014-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 skyrockets to success on a topic everyone can relate to: cancer. Joseph Gordon Levitt's powerhouse performance as the cancer ailed Adam is enough to carry the movie to the home stretch while Seth Rogen as his sometimes hard to deal with best friend helps even the drama into comedy territory. A gloomy Seattle setting, excellent and somber soundtrack, well chosen cast (Angelica Houston, Anna Kendrick) and near perfect screenwriting make 50/50 a modern classic",
            "review_date": "2014-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Started off a bit stale but it was pretty good when it got going. Gordon-Levitt captures the mixed emotions inherent in such a depressing dilemma, successfully invoking empathy from the audience. No surprise that Seth Rogen plays usual Seth Rogen but he works as the funny best friend who offers a contrast to Gordon-Levitt's more serious personality. The scenes with the two old fellow cancer patients are well done, giving a light-hearted perspective on the situation, but unfortunately they don't use them enough. Best thing is how it integrates the comedy and drama elements, efficiently balancing the two. However, it does not reach new heights in either department to warrant anything higher than the score given.",
            "review_date": "2014-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Joseph Gordon Levitts greatest movies and performances",
            "review_date": "2014-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awful. A lifetime movie masquerading as an Apatow, using the very worst elements from each.",
            "review_date": "2014-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is not as sad as I'd expect it to be. JGL is great, but Seth Rogen steals the show. A very good flick. RECOMMENDED.",
            "review_date": "2014-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 could not have picked a more perfect cast for this film. 50/50 is an eye opening experience that has the perfect amount of comedy to counter the idea that death is right around the corner. Really makes you wonder what you would do in your last moments.",
            "review_date": "2014-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inspiring movie. It's really good and a must-see.",
            "review_date": "2014-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would give 100/100 for the illness plot and 50/100 for the romantic subplot.  Yes, I understand that every comedy needs a little bit of sex, but the relationship between Adam and Katherine felt forced.",
            "review_date": "2014-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that's equally funny and sad, but really entertaining",
            "review_date": "2014-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A difficult subject that is approached with the right amount of humour and thoughtfulness. Some reality is brought to the fore through some great acting and storytelling leaving you completely pulled in to the moment.",
            "review_date": "2014-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seth Rogen and Joseph Gordon-Levitt are hilarious, extremely entertaining, emotional, and very funny.",
            "review_date": "2014-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A serious drama about dealing with cancer sprinkled  with a few comedy creating the perfect blend.",
            "review_date": "2014-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good tear-jerking, feel good buddy flick.",
            "review_date": "2014-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "want to hear an oxymoron? tear jerking comedy.",
            "review_date": "2014-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it. Very smart, funny, and inspiring. Joseph Gordon-Levitt is awesome. Highly recommended.",
            "review_date": "2014-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gordon-Levitt, not unlike a dormant volcano with his slowly burning disquietude, gives the best performance of his career (alongside equally able supporting cast Rogen, Huston, and Baker Hall) in this unique blend of heavy drama and screwball comedy that gets both right, and in a triumphant way.\n*3.5/4*",
            "review_date": "2014-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie will always make me happy no matter what",
            "review_date": "2013-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly entertaining and heart warming movie that isn't to mopey and makes you feel sorry for the lead character without forcing it down your throat.",
            "review_date": "2013-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outstanding performance from Gordon-Levitt",
            "review_date": "2013-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolute gem, one of my all-time favorites.",
            "review_date": "2013-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "loved every minute of it",
            "review_date": "2013-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A though-provoking comedy drama about a man who receives the jolt of his life when he receives the news of his cancer diagnosis. This one is not a sappy and and sleazy piece using unwarranted means for audience approval. Rather it has to be one of the most thought provoking movies I have watched and one the best on-screen portrayals of cancer and its impact in a person's life.",
            "review_date": "2013-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It must be so difficult to play a cancer patient, as a young actor. Seth is hilarious and Anna Kendrick is gorgeous.",
            "review_date": "2013-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is great. The performances and chemistry between Seth Rogen and Joseph Gordon-Levitt really make this movie great. It is really difficult to make a movie about cancer feel real, funny, and genuinely believable. This drama comedy is unique and  is a must watch. You really feel attatched and emotional. It was real. It was fun. It was real fun!",
            "review_date": "2013-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really connected with this film, seeing as I went through a situation similar to what the main character goes through. Great performances, funny, and very touching.",
            "review_date": "2013-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was pretty good, but I guess because I'd heard so much about it when it first came out I was expecting more. I was also severely distracted by the fact that this was filmed in Vancouver (subbing as Seattle) so that I kept thinking things like; where's the cemetery in Stanley park? Nice day for a jog under Lions Gate bridge. Anyways that's just me. There are couple of humorous moments along the way as Kyle (Seth Rogen) tries to keep Adam's (Levitt) spirits up through his 50/50 survival rate cancer diagnosis, treatment, subsequent pot smoking and loss of his bitch of a girlfriend (Bryce Dallas Howard). Adam is a pretty dull, dry character, the one scene that he got me in however was right before he goes in for his surgery and he's so scared, turning to his mother for comfort. Very raw. I also liked Anna Kendrick as the bumbling therapist. 12.25.13",
            "review_date": "2013-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What 50/50 succeeds at the most is treading a very thin line between a sap-filled story and morbidly dark-humored comedy. Levine never let's the movie fall into generic drama tropes nor let's its heavy content tug away too much at the heart of viewer. The result is a very rewarding experience into one of the most dodgy topics in mainstream Hollywood movies.\r\n\r\nGordon-Levitt, joined by a stellar cast including Anna Kendrick, Seth Rogen, Angelica Huston and Bryce Dallas Howard, shines as the lead character of a young man dealing with the aftermath of learning he has cancer. His performance is poignant, sincere and most important of all - human.\r\n\r\nThere wasn't a movie this year that will feel as genuine and thoughtful as this one, and despite a few short comings in some of its cinematography (poor lighting, interesting angles) this is definitely a dramedy worth bringing into any list regarding the best of the best in 2011.\r\n\r\nIts at times funny, at times tough to watch, and very often cathartic, especially with any audience that can relate to the subject matter. Definitely worth seeing for the journey of Gordon-Levitt's character and phenomenal performances by Angelica Huston and Seth Rogen.",
            "review_date": "2013-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More amusing than I expected with a good cast and well performed but fairly conventional overall.  Still an entertaining, funny, sad, sweet and enjoyable film.",
            "review_date": "2013-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it could have gone the route of being maudlin and going for a cheap emotional gut punch, 50/50 is a fairly well-written, honest portrayal of someone who finds out they have cancer. Joseph Gordon-Levitt plays Adam, a guy who \"doesn't smoke...and recycles\" but finds out that he has a rare form of spinal cancer. Together with his friend Kyle (Seth Rogen) and a novice therapist (Anna Kendrick), he eventually comes to terms with his condition despite the many setbacks he experiences. Chief among these is a cheating girlfriend (Dallas Bryce Howard). I mean, what girl would cheat on her boyfriend after he finds out he has cancer? That was pretty low, and made her character extremely unlikeable. Of course, most of the central cast is unlikeable in some way. Adam becomes kind of a prick once he finds out about his condition, although this is somewhat understandable. Less understandable, although it's intrinsic to the type of characters Seth Rogen usually plays, is Kyle who uses Adam's condition as a way to hook up with women. Even though I can understand that someone who finds out they have a potentially terminal illness might use it to score, actually seeing it play out in a movie was kind of crass to me. Thankfully, the film doesn't stay there. Generally speaking, the plot was rather predictable in terms of the romantic aspect. You just kind of know that after Adam breaks up with his girlfriend he'll eventually end up with his cute therapist because that's just the way things work. I can almost forgive it since Anna Kendrick played such a dorky, likeable person, but cliches are still cliches. I also didn't buy her for a second as someone working on their doctorate. Still, the performances were generally good and I couldn't really find fault with anyone. What really saved the film for me from being just a run-of-the-mill \"cancer comedy\" (kind of odd to see those two words juxtaposed) were a couple of key scenes late in the movie which provided the emotional weight needed to anchor the film and provided a counter-balance to the crude humor that one would expect from a comedy starring Seth Rogen. But even though Seth Rogen is in the film, this is Joseph Gordon-Levitt's movie all the way and he does a great job of carrying it. Overall, I liked it a little more than I thought I might at first. The plot is rather predictable and cliche at times, but there was a lot of humor and heart that lifted it beyond other similar films.",
            "review_date": "2013-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really liked this movie.  It is primarily a study in friendship, which is not addressed enough in movies.  Rogen is charming, and Gordon-Levitt plumbs the depths without ever becoming maudlin.",
            "review_date": "2013-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Phenomenal. \nOne of my all time favorite movies I HIGHLY recommend it to everyone",
            "review_date": "2013-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's thoughtful, totally believable, and all of the characters are so loveable - even the phoney girlfriend. It's an emotional ride but well worth it",
            "review_date": "2013-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was an absolutely incredible movie. I loved it. The acting and story was amazing, and Anna Kendrick is absolutely beautiful. Very well worth watching!!",
            "review_date": "2013-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When you watch enough Seth Rogen you expect a certain tone of comedy, but the friendship he portrays here maintains a greater depth without letting go of the comedic element.  How to tell a cancer story that has something serious to say about love and friendship while still keeping it funny is difficult, and this film does it well.",
            "review_date": "2013-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies ever.",
            "review_date": "2013-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is an absolutely great film mixed with humour and emotional drama that goes so well together; with Joseph Gordon-Levitt's best performance to date. This is one of \"those movies\" that made me tear-jerked as well.",
            "review_date": "2013-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fantastic script that walks a fine line of humor and drama with a sensitive topic, anchored by fine performances, 50/50 earns both laughs and tears.",
            "review_date": "2013-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If 93% of critics and 80% of users liked the movie, than I guess your chance of liking this movie is more than 50/50 (see what I did there?). The movie shows that laughter is the best cure and it helps when dealing with cancer. It's a great film, highly recommended it.",
            "review_date": "2013-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartbreaking and hilarious all at once, this movie did an amazing job at tackling its serious subject matter. Its realistic approach makes you connect with the main characters and experience their emotions throughout. This movie was surprisingly human and the comedic aspect was refreshing. Joseph Gordon-Levitt's acting is superb as always.",
            "review_date": "2013-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie. Joseph Gordon-Levitt and Anna Kendrick give wonderful performances.",
            "review_date": "2013-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touching, inspiring, and makes a viewer realize how special anyone's life is.",
            "review_date": "2013-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Several laugh out loud moments thanks to Seth Rogen.",
            "review_date": "2013-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most hilarious and heartwarming takes on the clichÃ© main character-cancer plot.",
            "review_date": "2013-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even if I don't like this type of movies, it really moves you and can touch you deeply",
            "review_date": "2013-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You will laugh out loud and shed a little tear. All this while showing respect to the subject matter.",
            "review_date": "2013-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "something very touching about this movie",
            "review_date": "2013-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Developed into such a fantastic and tear jerking experience that you can't resist this one. Joseph Gordon Levett truly picks his films well",
            "review_date": "2013-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'50/50' is a movie where the laughs are hit-or-miss and it's sentimental at it's final 5-10 minutes. But it can be a bit offensive for those who are fighting cancer.",
            "review_date": "2013-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cancer is a difficult and sad subject to base a movie on. This movie manages to achieve a good balance and gets things right. It handles the issue with a sense of realism that is not too light and fluffy, but at the same time shows tasteful restraint. It is very serious and emotional but it does not unload the full brunt of depressive details and ugly realities that come with battling cancer. The cast is extremely good from top to bottom; it is one of the strongest aspects of this movie. The friendship between Joseph Gordon Levitt and Seth Rogan are particularly strong. Anjelica Huston is great; she plays the part as an overbearing mother perfectly. Anna Kendrick also delivers a notable performance playing a rookie therapist. Bryce Dallas Howard does a good job in her less than likable role. It is uncomfortable and heavy at times, but keeps it all within reason. This is a very well made movie about friendship and the resilience of the human spirit.",
            "review_date": "2013-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really enjoyable story-driven offering hat was well-paced, emotional, and unglamorously personal.",
            "review_date": "2013-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie had me in tears it was so inspirational on how he takes his situation on and how the power of friendship and family can get u places and keep u positive",
            "review_date": "2013-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Smoothly blending humour with content that is quite serious, 50/50 ends up catching you off guard at times with very emotional moments supported by well-performed characters.",
            "review_date": "2013-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Plot/Summary,Inspired by a true story, 50/50 is an original story about friendship, love, survival and finding humor in unlikely places. Joseph Gordon-Levitt and Seth Rogen star as best friends whose lives are changed by a cancer diagnosis in this new comedy directed by Jonathan Levine from a script by Will Reiser. 50/50 is the story of a guy's transformative and, yes, sometimes funny journey to health - drawing its emotional core from Will Reiser's own experience with cancer and reminding us that friendship and love, no matter what bizarre turns they take, are the greatest healers.\nMy Review\nCancer turned into one hour of comedy oh my goodness that's not what it is. 50/50 is more then just a comedy about cancer. This film has to also talk getting help from someone. Adam has cancer and go's to therapy and dumps his girlfriend for cheating on him. He's not having in life and then is known to have cancer,it's like maybe well a self-help film,and a great one at that.",
            "review_date": "2013-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Uplifting dramedy about cancer. Great performances by everyone!",
            "review_date": "2013-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious and heartbreaking. Often at the same time. Amazing lead performances from Seth Rogen and Joseph Gordon-Levitt with a really solid script and direction that's worthy of an Oscar. The fact that this film won no Oscars is a crime as it's better than the majority of the winners of the past decade. 50/50 captures the realism of cancer as well as it's emotion and heart warming moments. Absolutely fantastic. Cannot recommend enough.",
            "review_date": "2013-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Laugh out loud yet poignant. A beautifully made film with great actors",
            "review_date": "2013-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great film that's amazingly versatile in its range between heart-wrenching drama and laugh-out-loud comedy (the latter mostly courtesy of Seth Rogen).",
            "review_date": "2013-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 makes you laugh when it's funny and hurt when it hurts.",
            "review_date": "2013-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Murder by Numbers?\n\n 50/50 is a hip indie comedy drama starting Joseph Gordon-Levitt and Seth Rogan, the film aims to tackle the subject of cancer, an interesting pick for any movie. But I suppose the reel question is will 50/50 be Broken or Bad?\n\n You know sometimes a film can surprise you, and sometimes it can be as obvious as they come, and some times, just sometimes a film can feel by the numbers, 50/50 does all 3.\n\n The film is an independent movie and boy does it show, the film is both themed, scripted and directed as if it's must tick every single box that an Indie film must fore fill. Two main characters, played by two sort of well-known actors? Check. A acoustic soundtrack? Check. A little to moderate amount of soul searching? Check. A amount of peril introduced early on? Check. A musical montage for the finale? Check. And so it goes on and on.\n\n However, 50/50 did surprise me, it is in fact a neat little comedy drama, both about friendship and cancer. Any film about cancer must be a hard sell to make, but somehow the film got made and the world might just be a little bit of a better place because of it. I'm not saying the film is ground breaking in anyway, however it was a pleasant surprise.\n\n In the same way as I was surprised I was also underwhelmed by it all, (I know that sounds like a contradiction but stay with me) the film has no real surprises, you could watch the first 15 minutes and accurately guess the ending of the movie. But this in its self asks the question of, why do we watch films like this? If we know the ending before we start why bother?\n\n Personally? I think it's just for the sheer enjoyment of cinema, to see those little moments you hadn't predicted on, and to view the ones you had play out on screen in front of you is the joy of a film like 50/50, it also does try and take a stab at a very difficult subject and brings it out so well.\n\n That's what I liked about 50/50 was that it felt realistic. The movie didn't come across forced or as if it was trying to impress anyone, 50/50 appears to be made so people might think differently about cancer and the people who suffer from it. For it's guts alone 50/50 deserves to be seen.\n\n To the films credit it is incredibly well acted, but I expect nothing less than perfection from Joseph Gordon-Levitt and Anna Kendrick. The film is sprinkled with a couple more familiar faces however it was interesting to watch Seth Rogan play pretty much the same roles he always plays. I can't tell if I enjoyed his performance yet or not.\n\n 50/50 does have one major drawback which should be raised. The film has a kind of morbid and nasty view on women, all of the female characters are either used or neglected. I find it difficult to accept Seth Rogan's treatment of them in particular, but maybe that's just me.\n\n 50/50 is worth the gamble of your time and effort to watch, it's a film that has the right measure of almost everything, apart from gender politics.",
            "review_date": "2013-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie on a very sensitive topic yet gets the audience laughing and had me crying like a baby at the end.",
            "review_date": "2013-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50-50 is a charming tale on a 27-year old man's take on battling cancer when you still have most of your life to look forward too. We learn to empathize with him as he goes on his journey of ups and downs, mostly downs. He matures greatly in this 100 minute comedy, it is a sight to watch as he evolves in front of our faces.",
            "review_date": "2013-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Emotional, funny, and very entertaining.",
            "review_date": "2013-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow! A must watch !!!",
            "review_date": "2013-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring piece of shit!!!!",
            "review_date": "2013-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartwarming film about friendship, family and health. Its funny and touching with a brilliant performance my Joseph Gordon Levitt. One of my favourite flicks of all time.",
            "review_date": "2013-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kinda mopey, somewhat funny and extremely depressing at times. 50/50 sometimes manages to balance the aspect of comedy and drama but it usually gets blended together, ultimately creating an unpleasant outcome. Especially when it is dealing with such a fragile subject like cancer, the last thing that people would want to do when dealing with that is to laugh.",
            "review_date": "2013-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love how Seth Rogan's character read the books to help his best friend in the movie, and also showed him that he could keep living his life before he got the cancer. I think that goes to show that there are people who want to make life that much more easier for people who are told that they have cancer.",
            "review_date": "2013-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's Anna Kendrick for goodness sakes... of course it's amazing!!!",
            "review_date": "2013-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good movie and real acting.",
            "review_date": "2013-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You know who the best part of this movie is? Serge Houde. Hands down. 50/50 may not have the most profound message on the topic, but it handles it well and is very funny.",
            "review_date": "2013-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is such a great movie :) The drama in this movie is right on and I love the humor that is thrown in to the mix.",
            "review_date": "2013-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Something about this movie just gets me every time. Brilliant cast, though the script + narrative could use a little polishing.",
            "review_date": "2013-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "JGL is great in this flick as a cancer victim",
            "review_date": "2013-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 [2011] What's so good about this movie is that it can and it will make you laugh in between cries. 8/10",
            "review_date": "2013-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This made me feel all the feelings. Loved it.",
            "review_date": "2013-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartfelt with funny moments, well done.",
            "review_date": "2013-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cried the whole 2nd of the movie, I loved it!!!",
            "review_date": "2013-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 tells the story of how your life can change for the worst in an instance but to also live life to the fullest even in the worst of situations. Cancer is no laughing matter, but the movie manages to perfectly walk the line between drama and comedy without feeling unbalanced. The comedic aspects of the movie are funny and charismatic, and the dramatic aspects are emotionally powerful and heart wrenching.  \r\n\r\nJoseph Gordon-Levitt is quickly becoming one of my favorite actors in Hollywood, and he delivers possibly his best performance in 50/50. He always brings a likable presence to his characters, even when he does things that make him come off as an asshole, you feel sympathy for him because you understand that he's been put in such an impossible situation. Seth Rogen is hilarious as always and Anna Kendrick is adorable.\r\n\r\nHaving been written by a cancer survivor, the script feels authentic and genuine. It never makes fun of having cancer, but rather it uses comedy to offset the tragedy of the situation, and reminds us to look on the brighter side of life even during the harshest of circumstances. \r\n\r\n50/50 is a wonderful film that will make you appreciate life even more and allows you to experience the heartbreak through genuine human drama. It's a realistic and intelligent approach to a comedic look at living with cancer.",
            "review_date": "2013-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great film and performances",
            "review_date": "2013-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seth Rogen stars in dramedy about cancer.  Seems like familiar territory, but \"50/50\" feels like a better movie overall when compared with \"Funny People.\"  It's not a deep story in any way, but it's a realistic look at a young man's battle with cancer (with a cliche romantic subplot added in for good measure.)  It's not jaw-dropping or life-changing, but it's well-paced and never comes across as mean-spirited or overtly sarcastic.",
            "review_date": "2013-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is fantastic, it's not a laugh out loud movie but its original and just lovely to watch, maybe one of my favourite movies of all time I love Jo-Go and Seth Rogen and the chemistry between the two characters is amazing, I recommend this film greatly to anyone!",
            "review_date": "2013-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is just so moving and honest that it really needs to be experienced; words don't do it justice, because it's a movie about emotions and bonds and goodness that exists in the seen and unseen realms alike. It's not a story, it's a life experience, a movie that goes to show that wherever bad may be, wherever life may lead, there's the undying power of love, friendship, and hope that's to be found along every path, with each step, through each diagnosis, people to say \"yes\" when the world says \"no.\" 50/50 is the most uplifting and honest movie to come along in a long time and something that should be at the top of everyone's \"must see\" list, a movie that thereafter will shoot to the top of the \"never to be forgotten\" list.",
            "review_date": "2013-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great balance between humor and drama, good acting (Yes, even Seth), good story, great themes.\n\nWhat makes this film great is not just that it's funny or that it reveals real emotion in a difficult situation. What makes this film great is the execution and balance of comedy and drama. The film was able to reveal real emotion and deal with issues of friendship, love, and disease all while being funny. The film had a tremendous amount of respect for its situation despite being a comedy.\n\nAnd Anna was cute.",
            "review_date": "2013-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is without a doubt, one of my top 5 favorite films of all time. Turning such a tragic theme into a feel-good comedy is a very thin line to cross, but Jonathan Levine's ingenious direction gives this rarity true balance. And Joseph Gordon-Levitt, in my opinion, gives one of the best performances in cinema history.",
            "review_date": "2013-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a fantastic movie grounded so well in reality that every emotion the characters feel is shared by the audience. I didn't see this when it first came out because I didn't think that I would like it, but two years later, when I finally did end up watching it, I was blown away. Joseph Gordon-Levitt is a great actor... He was phenomenal in Brick, awe-inspiring in 500 Days Of Summer, and incredible in Inception, Looper, and The Dark Knight Rises; but 50/50 was the film that sold me on Gordon-Levitt being a Hollywood A-lister. His performance in this film is nothing short of breathtaking. Seth Rogen was also incredible in a role somewhat outside of his comfort zone. The direction and the script were riddled with raw emotion and occasional, well placed comic relief. Bottom line, this movie will more than likely leave you teary-eyed. I'd recommend it to everyone.",
            "review_date": "2013-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is a movie which will leave you satisfied.And I mean truly satisfied.The movie is inspired by a true story.Joseph Gordon Levitt is Adam,who receives the shock of his life when he is informed by the doctor that he has cancer.He feels helpless as he does not smoke,drink or do anything that could have potentially lead to him getting cancer.And since he is in his 20's,the shock is felt more severely.However,the movie takes this issue and deals not only with the serious aspects,but also adds some humor to the situation in a very non-offensive way.\r\n Adam gets to know who he can trust and comes to terms with some harsh realities while he has cancer.Anna Kendrick,who plays Katie in the movie,gives one of her best performances.However,apart from Gordon Levitt,it is Seth Rogen who makes this movie all the more fun to watch.You can really understand what his character is like,and he portrays his character with so much perfection,that you could actually take that character to be real.\r\n 50-50 is an underrated movie.It is a feel good movie which blends a serious story with some really well thought out humor.If you have not seen this movie,I implore you to watch it.Its probably a sin as to how underrated this movie is.",
            "review_date": "2013-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well acted, well directed, and an amazing heartwarming story.",
            "review_date": "2013-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50. i dont think so... the focus is obviously on jgl.",
            "review_date": "2013-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A. Of such many releases of comedies of 2011, few will make you sad and reflect about life and disease, while they make you laugh until your stomach hurts.",
            "review_date": "2013-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched: 11 Sept 2013",
            "review_date": "2013-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most enjoyable drama/comedies of the year.",
            "review_date": "2013-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honest, fun and well acted 50/50 it's a nice and proper film.",
            "review_date": "2013-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "MINI REVIEW: The moving humorous ridden tale of a young man who gets a rare type of cancer yet seems to be the calmest of his group as the rest of people panic. Seth Rogen brings a comedic lightness to a topic which could otherwise be depressing. Just about everybody cast wise did a good or better job. OVERALL GRADE: B plus.",
            "review_date": "2013-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie - standout performance from JGL",
            "review_date": "2013-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 skillfully blends the gross out comedy style of Rogen and the quietly emotive nature of Gordon Levitt, resulting in an emotionally satisfying tale of friendship, love and loss.",
            "review_date": "2013-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know why I liked it so much.",
            "review_date": "2013-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even with plenty of jokes it does manages to take it's topic seriously. Amazingly sweet 50/50 succeeds thanks to a strong cast and a great script.",
            "review_date": "2013-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 walks a very tight line between being overly jokey about a sensitive topic or being overly sappy and sentimental. Thankfully with great actors, strong direction, and sensitive writing thrown into the mix, 50/50 is a deeply effective and surprisingly sweet film.",
            "review_date": "2013-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's rare that you find a film that's able to take a subject matter that is inherently serious and depressing and manages to find the humour within it without diluting the more important themes. 50/50 is one of those films, a consistently engaging character drama/comedy that while on the offbeat side of cinematic experiences is at times hilarious, touching, heart breaking and life affirming.\n\n50/50 tells the story of Adam; a radio station employee in his late twenties who finds out one day that he has a rare form of spinal cancer, one in which there's allegedly a 50:50 chance of survival from. Immediately changes start to occur in various aspects of his life. His seemingly kind but selfish girlfriend decides to stick around but isn't so sure of what to do with the situation. His overly worrisome mother threatens to move in and increases the frequency of her calls. His sex obsessed best friend sees an opportunity to turn the illness into prime wingman material. And on top of this his newly assigned therapist is still involved with her doctorate and currently only has three patients, including him, and doesn't do a very good job of hiding her lack of experience. Through all this Adam finds it hard to know exactly how to react to his unfortunate predicament, happy to stay relatively relaxed and let time and therapy take its course. But as the chemotherapy and people around him start to take their toll, it becomes more difficult to stay cool as the foreboding reality that he may not live through this looms ever closer.\n\nOn the surface this might seem like a pretty predictable affair. A person gets some bad news about their life and they have to adapt to it while dealing with everything else going on, perhaps not quite feeling the full impact of the situation until much later. What makes 50/50 work though is that it makes us care deeply about the main character and his situation, keeping almost the entire experience firmly rooted in his shoes, so we see what he's feeling, where, when and with which people. This can more or less be laid squarely on the shoulders of Joseph Gordon-Levitt, without whom none of this would have worked. What the actor does is extremely subtle as there's nothing particularly overt about Adam; he's not very outspoken, he's quite reserved and seems to be a bit of a hypochondriac (he refuses to drive or even try for the license because of the safety risks). Yet Levitt makes him into a constantly engaging, likeable individual almost effortlessly. He's basically just a nice guy who's had some terrible news befall him, over which he has no control. Most people can relate to that. As time goes on and his situation becomes direr, he begins to reflect upon the important things and people in his life and eventually starts to realise his mortality and questions whether or not he's actually ready to accept the reality that he may not win this battle. All these struggles and emotions are plaid out in the actor's face and bodily gestures with complete conviction and many times without dialogue. There are a couple of hard hitting dramatic moments in 50/50 and it all comes from Levitt. Hard to believe this guy was once that geeky little kid next to John Lithgow in Third Rock from the Sun.\n\nThe supporting cast is short but full of talent, both old and new, and they all have interesting roles to play, while never outshining the main actor. Seth Rogan, as Adam's best friend, plays his usual foul mouthed shtick and it provides some of the film's funniest moments. Also on the comedic side are Philip Baker Hall and Matt Frewer who are instantly likeable as a couple of old time cancer patients. Bryce Dallas Howard isn't in the movie for too long but has a pivotal role to play as Adam's girlfriend. Angelica Huston is her usual reliable self, having to play Adam's smothering mother who while tends to worry about everything still manages to provide that supportive blanket, despite having a husband suffering from Alzheimer's and a son who hardly talks to her. Lastly there's Anna Kendrick, who plays Adam's disorganised, inexperienced therapist. Kendrick is starting to prove a considerable talent since her oh so long ago appearance in the Twilight movies. Like Levitt, her role isn't very showy but is instantly likeable because the actress is so charming and she manages to bring out the vulnerabilities in Katherine without turning her into an emotional wreck. She's not the typical love interest with emotional baggage, she's far more interesting than that and a lot of the humour in the movie comes from her trying to vainly keep a professional face and not get emotionally attached to her patient. She and Levitt also have great chemistry together.\n\nA film starring a character who is potentially heading for his death bed is not what would instantly come to mind for the idea of a comedy. But while 50/50 does contain some very real drama, it also has a light hearted edge. The main character's relatively easy going, no care at all demeanour means that the spectre of his illness is never overbearing in the first half of the movie. Life carries on for Adam and the various idiosyncrasies in his life that occur out of his situation make for quite entertaining scenarios. Whether it's using his illness to pick up girls, awkwardly interacting with his amateur therapist or exchanging witty banter between fellow cancer patients, it's all quite heart-warming while also darkly humorous. Eventually things do become grimmer, but it's not a tonal shift. While the situation for the characters may have changed, the irreverent tone still remains. Even so, what really struck me about 50/50 was how powerful it became, setting up this perfectly realistic scenario and digging deep into the humanity behind it, in all of its humour and all of its suffering. Great films pull you into the character's struggles and so we ride the same wave of emotions they do. Adam goes through a lot in this film, and so do we.\n\n50/50 has a familiar premise but an unorthodox way of presenting it. Mixing humour and terminal illness seems ill advised but when handled as well as this, it doesn't matter. Ultimately it works because the comedy is low key and comes from the character moments as they interact with the situation, rather than from the situation itself. It makes for an entertaining, thought provoking and at times an emotional experience. This is proof that serious subject material can be handled with a light touch when done carefully.",
            "review_date": "2013-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very touching film with great writing.\nAnjelica Huston and Joseph Gordon-Levitt give great performances but I believe Seth Rogen was a terrible choice as Adam's best friend.\nYou do get a few laugh out loud moments, plenty of chuckles and aww's, and you may even cry once or twice, but this film still does not fulfill the job of winning me over because there is no originality that separates it from any other \"bonding for the better\" film \"during a tragic time.\"\nOverall, for me, 50/50 somewhat succeeded with keeping my attention and even making me cry a couple times, but the very ending was terribly cliche like any other happy-go-luck film. See it and you'll know.\n50/50, I give you a 60%.",
            "review_date": "2013-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50.  Adam discovers he has cancer. As his best friend Kyle tries to help out his girlfriend Rachael proves to be a less than ideal life partner for this crisis that Adam is dealing with. All the while Adam's overprotective mother Diane tries to overcome her son's continued attempts to keep her out of his life. As Adam begins to discover how hard it is to deal with his unfortunate situation, and to maintain various relationships in his life, he begins seeing a counselor who might prove to be just as helpful personally as she is professionally. The objective of the film is to remind us that friendship and love, no matter what bizarre turns they take, are the greatest healers in life and I feel like they succeeded in doing that Seth Rogen and Joseph Gordon-Levitt had a nice chemistry together. This movie provided me with a decent amount of laughs while also making me feel sympathy for the main character if you have a heart most likely you will enjoy this movie.",
            "review_date": "2013-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good realistic storyline, great acting from JGL as always.",
            "review_date": "2013-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not sure I've ever seen a Seth Rogen movie that I particularly liked. This was the movie that changed that. This one is actually really good. It is a little crude in spots, but it's worth the watch. Joseph Gordon-Levitt was absolutely amazing in this. Just a great flick. One of the best I've seen in a while.",
            "review_date": "2013-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartwarming story of how dealing cancer with hope,humor,friendship and love.Brilliant Gordon Levitt.",
            "review_date": "2013-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inspiriting story. I like how it was concentrate on how the different people in his life reacted to the main character getting cancer and not just solely him own feeling.",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Implacable. Can't explain how good this movie is. The chemistry is to die for. The story is real and so is the love.",
            "review_date": "2013-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is 100% pure enjoyment. Joseph Gordon Levitt is one of the greatest working actors today. Unless your a\n handmaiden from hell or had your soul surgically removed this movie will have you laughing crying and enjoying all 100 minutes that make up this true life tale. Great performences from every actor/actress involved in this project it is truley a film you will be happy you have seen no matter what genre of movies you hold close to your heart.   !",
            "review_date": "2013-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LOVE THIS MOVIE. But some scenes and language don't need to be in there..",
            "review_date": "2013-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Joseph Gordon-Levitt's spotlight movie",
            "review_date": "2013-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is brilliant film. One of the best film in recent years. A true story about an average guy who had cancer like nothing else. It is so rare that there are films which connected to the audience, and this is one of them. Brilliantly scripted, directed and acted. For me this is one of the best performance by Joseph Gordon Levitt. And the ending is just simply perfect. And did i tell you that i've got crush with Anna Kendrick, she is just loveable. Awesome film..",
            "review_date": "2013-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Joseph Gordon-Levitt was cheated out of an Oscar nomination. For a comical look at the uncertain battle against cancer, this is a rough movie. It is especially rough if you've ever lost someone to it. Rogen and Gordon-Levitts' comical friendship provides just enough cushion to keep the movie from becoming too grim. Anjelica Huston has only a few minutes screen time, but manages to make her turn memorable and all too realistic. Excellent.",
            "review_date": "2013-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is fantastic- brings you on the edge of tears and then bam, comic relief! It's the best of both worlds, hilarious and serious; about friendship, love, family and resilience. I really recommend this film!",
            "review_date": "2013-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant and emotional.",
            "review_date": "2013-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This would be damn depressing if not for Rogen.  That being said, when it's funny it is outright hilarious.",
            "review_date": "2013-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It looked like a comedy, but this movie pulls at the heartstrings like you wouldn't believe. Solid acting and a very realistic look at the way hardship affects your relationships with those around you.",
            "review_date": "2013-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Adam, the newly diagnosed cancer victim at the center of this film, despite our knowledge to the contrary, keeps saying, \"I'm fine\". While maybe not all of us will get cancer or another fatal disease, this is still a strong reminder that, although none of us are ever fully \"okay\", to live in that bitter truth is to not live at all. That honesty that permeates every cell of this movie is what helps make this sweet-and-sour drama more about life than death. Funny, emotional, and extremely personal filmmaking.",
            "review_date": "2013-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The perfect balance of drama by Levitt and comedy by Rogen is what makes this movie so good. Oh and... Someone give JGL an Oscar already!",
            "review_date": "2013-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I could watch JGL watch paint dry.",
            "review_date": "2013-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sweet... I loved it.",
            "review_date": "2013-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Comedy drama about a man coping with cancer and his struggle to beat the desease. With its more comedic approach, 50/50 not only feels fresh and modern but also comes across as more effective in dealing with a serious disease than most other films which share its theme. The film's biggest asset is also its balance between the jokes and the melodrama.",
            "review_date": "2013-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dramatic Comedy is a tough genre. Sometimes they are too serious and not funny and sometimes they are too funny and it's too much of a comedy. The movie is called 50/50 but the drama to comedy ratio is more like 80/20. Joseph Gordon Levitt start as a 27 year old man who gets diagnosed with a rare form of cancer and is given a 50/50 shot of staying alive. Seth Rogan is his best friend and he is hilarious as always. Levitt goes to a treatment center and meets two older cancer patients and they are also very funny, but other than that this movie was straight up drama. \n\tIs 50/50 a good movie? Eh, yes, it has a lot of emotion and Joseph Gordon Levitt makes the character very believable. Cancer is a very hard thing to live with affecting so many people. He has a girlfriend and she eventually shows her true colors. A lot of the scenes in this movie felt real. The relationships between Levitt and other characters felt real and how he treats them was expected. He didn't want a therapist so he gives her attitude. He is sick of his overbearing mother so he ignores her. He and his girlfriend don't have the best relationship which in this situation can be expected. It was Rogan and Levitt that had the best relationship because we see Levitt's character smile and be normal. It was good for him and better for the movie.\nThe comedy came in at the right and wrong time but it really lacked. This movie straight up wasn't that funny. Rogan is the center of all the comedy, as he should have been, but I wanted to laugh more in this movie. I expected to laugh more in this movie. When the comedy was there it was hysterical. Something happens between Levitt and his girlfriend and Rogan's character is right in the middle and you can tell this scene was written by Rogan himself or completely improve. I was laughing so hard in this moment and a few others but the core of the movie is a cancer story.\nThe dramatic moments are really well done but the majority of the movie is predictable. You have seen this movie before time and time again but it is still entertaining. I expected something a little different than what I got but predictable does not always mean bad. There were a few moments and outcomes I did not see coming but the majority I could have written myself. At first Levitt hates his young therapist. He is 27 and she 24, and it is obvious they grow on each other and become a love interest in the least expected of ways. \nIn the cancer treatment center Levitt meets these two old guys who also have cancer and they are a riot. The first scene with the three of them was great. One of them gives Levitt pot cookies and that whole scene is great and hysterical. When the three of them are together it is pure entertainment, but then the drama bug comes around and kills one of them and we never see Levitt interact with the remaining one again. That was a shame but it was a big reality punch in the face. I felt really sad when he died and it hit me as hard as it hit Levitt. This movie touched me as it probably touched most people because we all know somebody who has cancer or is affected by another family member who has cancer. \nIn a more cheerful note Seth Rogan is in this movie. I love Seth Rogan, he may play the laid back pot head in every movie but he does it so well. There are few people who could pull off what he did. He made a terrible situation not as terrible. He isn't laughing at cancer or saying it isn't a big deal, but he is saying it isn't the end of the world. You may have less time than the rest of us and that is unfortunate but he tries to make the best of it for his friend. Yeah there is that one scene where they use it to get laid but come on that would probably work in real life. \nOverall 50/50 is a dramatic comedy and one of the better ones I have seen. I'm not crazy about this genre but I am crazy about any movie Seth Rogan is in. I had doubts going into this movie and as predictable and emotional as it was, I did enjoy it. I had fun with this movie through my laughs and fighting back of tears. The characters all felt real and the endgame of all of them felt real. Levitt's father in the movie has Alzheimer's disease but in all honestly I thought it was wasted. I think he was supposed to be used for comedic relief but he isn't really used. He says a few lines but other than that he stands around and looks stupid. There were a lot of things I liked and a lot I didn't but it is still a solid movie I found entertaining so it gets a very high WillyT Recommendation.",
            "review_date": "2013-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Made me feel ready for the horrors life might throw at me with an incredibly relatable protagonist, a lovable idiot, a loving mother character and cute psychiatrist, it also paints Rogen in a new colour which will open new doors for him.",
            "review_date": "2013-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best, moving movies I've seen in a long time with 2 of my favourite actors. Love it!!",
            "review_date": "2013-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely love this movie one of my favourite",
            "review_date": "2013-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw it because i think that Joseph Gordon-Levitt  and Seth Rogen are great actors, plus i really like comedy movies. I thought this movie had a real thin line between very funny and kinda of sad, because well it is very funny movie but there is parts in the film that one just feels what the guy is going through and well you feel the sadness. I think its a very great film, I've seen the movie about 4 times and i plan on seeing it more.",
            "review_date": "2013-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really funny and really heartfelt.",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I normally don't like watching stuff on cancer, let alone cancer comedies.",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie. Levitt nailed his role. Seth Rogen was crude and hilarious as always. Kendrick played her role spotlessly. I enjoyed how this movie was funny as well as serious. I thought it really brought the battle of cancer into perspective. Fantastic plot line full of drama between loved ones and the inner self. I really enjoyed the film.",
            "review_date": "2013-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie to kick of my weekend movie marathon ð???",
            "review_date": "2013-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing character drama. Levitt at his best and Rogan at his better",
            "review_date": "2013-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed the movie a lot.",
            "review_date": "2013-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not very engaging the first time around so I'll have to watch it again.",
            "review_date": "2013-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50% Humour, 50% serious.",
            "review_date": "2013-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun and dramatic a great movie",
            "review_date": "2013-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Joseph Gordon-Levitt, Seth Rogen, already a good start. Even though this is a film about cancer, I wasn't prepared for how emotional it was. I guess I see Seth Rogen in something and I just assume it's more comedy then drama, but there is so much more to this movie. And then there's Anna Kendrick, who is officially one of my new favorite actresses. In all aspects of film-making, this is a fantastic watch.",
            "review_date": "2013-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a wonderful film.\nLevitt's character is well written and well acted. Rogan plays a smart comedic role that's not too...vulgar.\nKendrick is wonderful too.\nVery good film.",
            "review_date": "2013-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best buddy movie I saw in a loooong time!",
            "review_date": "2013-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie. Awesome dramedy.",
            "review_date": "2013-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3 stars! \n\nThis film was actually pretty good! \nJoseph Gordon levitt was spectacular as always! I had a few tears, but not all the way through! The only disappointing bit was the ending! I was really waiting for that kiss to happen and it never did :(",
            "review_date": "2013-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious moments and sad moments. Balanced very well. Great movie about such a life changing topic.",
            "review_date": "2013-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the better Seth rogen movies I've seen",
            "review_date": "2013-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's an often-used cliche to describe great films that they will \"make you laugh and make you cry\"; this one really does both without overdoing it on either end.",
            "review_date": "2013-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great sense of humour. great adaption and amazing acting. a very brave film indeed",
            "review_date": "2013-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the synopsis tells it all, it is warm gentle story",
            "review_date": "2013-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"She doesn't want to mix the positive and the negative. It's an energy thing.\"\n\n\"Sounds like a bullshit thing!\"",
            "review_date": "2013-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inspired by a true story 50/50 takes us on the journey of Adam, your typical nice-guy who is diagnosed with a rare form of cancer, that no one can pronounce. The movie takes on a light-hearted comedy vibe early, but later on the film takes a serious turn and we see how horrific the cancer is and how it is eating at Adam from the inside out.\n\nDespite the story line early on being somewhat predictable and a pair of obvious product placements, 50/50 was an enormous success, definitely being one, if not the best comedy/drama movies ever seen. The incredible directing by Jonathan Levine, gets everything right, the unexpected diagnosis, the overbearing mother, the girlfriend that will not touch him, the unexpectedly not so self-centered best friend, the cute therapist, and of course the cancer ridden protagonist. From the on-point cinematography by Terry Stacey and the realistic, depressing, yet still comedic writing of Will Reiser, to the incredible acting performances by Joseph Gordon-Levitt and Anna Kendrick, both of whom never cease to amaze me. It is the perfect blend of comedy and drama, with a stone-cold message about friendship and illness, but still including the comic relief that makes life tolerable.\n\n Typically I find that comedies, whether it be a TV show, a stand up comedian, or a movie are best enjoyed with friends. This movie however, exceeded my expectations and was definitely appreciated although I watched it alone, in my bedroom, on a Saturday night. This film definitely deserves much more recognition, as it is an unsung hero of the film word.\n\nThe very first thing I noticed about this film was that it was set in my hometown of Vancouver, B.C. and although it was meant to be set in Seattle, Washington I suppose we can let them go on this one. I am not however, letting them off the hook when Adam, during a nervous breakdown says \"I've never been to f*cking Canada\", seriously... this was filmed in Vancouver, CANADA.",
            "review_date": "2013-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is the greatest movie I have ever seen. I am a big fan of Joseph Gordon-Levitt and Seth Rogen so I found that it would be an ideal choice. It was much better than I had anticipated. With a good cast, humorous personalities, and a heartfelt journey through a young man's experience with cancer, I'm not surprised it has surpassed every other movie I have seen.",
            "review_date": "2013-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie shows how friendship and love can be found in the darkest of places.",
            "review_date": "2013-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely LOVE this film. Something about it makes me hopeful about life. It makes me want to live life to the fullest because deplorable things in your life may happen unexpectedly. And the best thing you can do to cope with situations like getting cancer is to just laugh about it. Not necessarily downplay the reality of your terrible situation, but to pause for a moment and learn to laugh at yourself in tough times. Definitely an underrated film.",
            "review_date": "2013-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like A Good Shakespearean Drama The Illness Acts As A Third Wheel In Testing Every Relationship. Very Well Scripted But The Short-Bit-Part  Scenes Vary Drastically In Effectiveness.. So You Get A Mixed Feeling With It All. Still Good Overall, Deals With Very Difficult Subject Matter.",
            "review_date": "2013-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oscar worthy performance by Joseph Gordon Levitt same with screenplay. If this film does not get either of those nominees, that is a total snub.",
            "review_date": "2013-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of those strange films where the scenes individually work but as a total piece the film does not cohere properly. The first half stalls constantly whenever Dallas Howard appears but the second half flows much better. The cast is very good across the board. Rogen (who I don't quite get) and Kendricks steal the film. In fact, the core of the film is the relationship between Gordon-Levitt's Adam and Rogen's Kyle. Its not often that a mainstream films depicts a mature relationship between two males but this nails it. Stuck halfway between a stoner comedy and a weepie, this is very good without being great.",
            "review_date": "2013-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 has a great balence between drama and comedy its a good one",
            "review_date": "2013-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A charming film, but nothing you really haven't seen done millions of times before.  It's not particularly funny either so basically you've just got your standard cancer themed love-story just added dashes of bro-mance.  Hell, stick him on a Grand National horse and it could be 'Champion' all over again.",
            "review_date": "2013-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WOW!! It found humour in such a horrible thing. This movie rocks!",
            "review_date": "2013-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Knows when to be funny, and when to be emotional.  Never oversteps its boundaries.  In short, one of the best movies in recent memory.",
            "review_date": "2013-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really liked this movie.  I was expecting a lot of stupid forced humor and instead found it very real.  G-L beautifully portrays a young man going through this battle for his life against cancer.  The supporting actors are good as well.  The emotions are high....I laughed and cried.",
            "review_date": "2013-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An incredible combination of comedy and heartfelt emotion. Laugh, then cry, then laugh again. This is a must see for everyone.",
            "review_date": "2013-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie really knows how to mix comedy and emotional drama together. It's a sad, but funny story that is very well done thanks to stellar performances from Joseph Gordon-Levitt and Seth Rogen.",
            "review_date": "2013-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has everything you can imagine. It has heart, it has humor, it has drama, it has romance. Anything you can imagine being in a film, 50/50 has it. It literally had me laughing so hard I was crying in one scene, and then in the very next  scene it was so sad I was crying. Everything about this film is perfect. They balance the humor and the drama perfectly and the performances are incredible. This movie has the best performances Ive seen in a long time. I strongly recommend everyone to watch this. This is my 2nd favorite movie of all time and comes very close to taking Die Hard from number 1. Absolutely incredible film.",
            "review_date": "2013-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, depressing, and touching.",
            "review_date": "2013-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw this on cable last night. I liked how the director handled cancer in a unique, touching, and sometimes humorous manner.",
            "review_date": "2013-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Featuring JGL at his very best, 50/50 is a very good \"bromance\" movie.",
            "review_date": "2013-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gordon-Levitt's performance, combined with the chemistry of the cast, creates a heartwarming comedy amid devastating circumstances.",
            "review_date": "2013-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Compelling, emotionally moving, artistic, and I'd say a really good take on what the movie wanted to get across to people. I really enjoyed this movie.",
            "review_date": "2013-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An enjoyable film throughout, a wonderful dramedy.",
            "review_date": "2013-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is both funny and sad and I find its execution to be a tremendous achievement considering the dualistic nature. It brings the frailty of life to perspective. Even if it is through a movie character, you begin to empathize with Adam and that is one of the most successful facets of this film.",
            "review_date": "2013-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sad and sweet. And a great one.",
            "review_date": "2013-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Holy crap what a great surprise of a movie! A cross-section between drama and comedy and a just a genuine heartfelt experience watching this movie.\nIf you've known or know anybody who has had or has cancer then this movie rings so true in many ways, but it does so in a way that you don't expect, it strangely makes you laugh at cancer and then cry about it's affects too.\nJoseph is a very good actor and it shows through strongly in this movie, you feel his performance in way that many movies these days can't attain, Seth Rogan plays himself in the best friends part and brings many of the laughs I previously mentioned, and if you liked Knocked up then you'll like the humour style in this movie.\nWant a movie that blow your socks off for quality human contemplation, give this movie a big shot, you won't regret it.",
            "review_date": "2013-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am a huge Joseph Gordon-Levitt fan. He is probably my second favorite actor. And this movie, in my opinion, is his second best. So much more than a comedy. It is a deep drama about what goes through the life of a regular everyday guy who has cancer. It might even leave a tear in your eye.",
            "review_date": "2013-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Subject matter vs comedy. Impressive.",
            "review_date": "2013-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing film. I lost my mother to cancer when I was 18, and this film really sums up the feelings herself and our whole family went through. Joseph Gordon Levitt does an amazing performance.",
            "review_date": "2013-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant movie. Inspired by true events - which happened to Jonathan Levine who wrote the movie. Seth Rogan stars in the movie and kind of plays himself. He is best friends with Jonathan Levine. Its another great performance by Joseph Gordon Levitt's. With the movie theme, you wouldnt think it would be funny but it is. Is has sad moments, \"dramatic\" moments and funny moments. Recommended. \n\nIts gets a good 4/5.",
            "review_date": "2013-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best I've seen",
            "review_date": "2013-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The score spoilt the movie and it is not close to real",
            "review_date": "2013-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As \"feel-good\" a film as you'll find.",
            "review_date": "2013-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Who would have guess the \"cancer comedy\" would have been so good? 50/50 is an amazing film. What other movie can you say can take a topic as dark and depressing as cancer and turn it into a story that is so bright and actually hilarious? Sure, there was drama and some difficult times, but this movie mostly showed the story of a man trying to embrace the good aspects of the horrible disease and to see the bright side with the help of family and friends.\nIt's the little things that get you. 50/50 is impressive on many levels, but by far the most impressive was the writing. The writing was beautiful. It embraced every aspect to the story that even the smallest parts were as if they were the huge ones. In the scene where Joseph Gordon-Levitt has dropped off Seth Rogen at his house, Gordon-Levitt goes to the bathroom and notices that Rogen has a book called \"Facing Cancer Together\"  and when Gordon-Levitt opens up the book you see that there are sections underlined and arrows pointing to important information. 50/50 is full of scenes like this and that's what makes it so impactful and emotionally rewarding.\n50/50 probably gets a bad wrap for being the movie that makes fun of cancer, but it doesn't, not even close. It takes cancer and instead of making it dreary and somber, it becomes a film that can mask the sadness and put something incredible in its place, even beautiful.",
            "review_date": "2013-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This young guy has a rare and extremely serious cancer on his back and needs to fight for his life. No, this isn't a drama. It has some sad scenes, of course, but the magic of 50/50 is how Will Reiser added the perfect dose of comedy to his script. People can still find happiness in life in tough times and these characters show this in a beautiful way thorugh friendship, love and pain.",
            "review_date": "2013-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an exceptionally heartfelt film with a touch of some great humor. It balances drama and comedy exceptionally well. Joseph Gordon-Levitt is phenomenal in the role and Rogen is obnoxious as usual but it works in this particular film. Rogen actually steals the show and shows a truly grounded performance. It is a great tale of friendship and one great feel-good movie. This movie had me laughing out loud in certain scenes, and reduced to a puddle of tears in others. It's a beautiful and genuine movie that feels very grounded in reality. I love everything about and watch it again regularly because it is a moving and inspirational experience. ",
            "review_date": "2013-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "[2013-06-05] Life is always full of 50/50 stuff, depends on how you want to choose.",
            "review_date": "2013-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie with a lot of emotion!",
            "review_date": "2013-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think I was expecting something different from what I got out of 50/50.  I thought this was going to be one of those somewhat light-hearted dramas where the main dude gets cancer and him and his best friend use the sympathy factor to get laid as much as possible.  Not so.  This is a drama that had genuine emotions and reactions to the absolutely horrible circumstances cancer can bring.  I found myself almost sobbing near the end during the scene between Gordon-Levitt and Anjelica Huston, and that's completely the fault of the spot-on subtlety of Gordon-Levitt's performance.  Not my wussy-ness, I swear.  This was such a great film, I can't help but push it onto anyone who'll listen.",
            "review_date": "2013-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolute classic that will make you laugh, cry and cringe.",
            "review_date": "2013-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That doesn't make any sense though. I mean... I don't smoke, I don't drink... I recycle...",
            "review_date": "2013-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seth Rogen's best acting performance in my opinion. JGL is very good as well and the movie takes a really realistic take on a young man getting cancer. Would have liked to see a little more side character development but the movie was charming and memorable. If your looking for a great dramedy this one is up there.",
            "review_date": "2013-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A extremely well acted and tonaly perfect film that only misses a higher score due to its predictable first 30 mins. There are too many moments especially at the start where you know exactly what is going to happen with Bryce Dallas Howard especially. The earlier things lead far to obviously into the could be surprise moments. With that said Joseph Gordon-Levitt is incredibly believable and honest in his challenging role and plays it to perfection. His chemistry with Anna Kendrick pulls the last act together extremely well. The comedy is well placed and tastefully added into the soft moments. A seriously great movie",
            "review_date": "2013-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'll keep it short - Joseph is amazing, Seth Rogan is hilarious, the story is toucuing. 9.3/10 for me!",
            "review_date": "2013-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very enjoyable movie, a mixture of funny as well as sad.",
            "review_date": "2013-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good balance between drama and comedy make for a good movie.",
            "review_date": "2013-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit sappy and slow and I've seen the cancer movie thing done before but! There was some really hilarious moments and some really sweet ones!",
            "review_date": "2013-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Somehow managing to create a seemingly impossible 'cancer comedy', the real life experiences of the creators shine through in this funny and touching film. The only real complaint is the sometimes awkward dialogue of Rogen in an otherwise very well performed movie.",
            "review_date": "2013-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie... funny and sad, solid cast.",
            "review_date": "2013-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a really good movie but I was expecting a little more. Don't get me wrong, I still thought it was great and it made me cry a little towards the end, however I was expecting a little more comedy and a little more emotion. All of the actors did amazing (which was expected) and the soundtrack was pretty cool but I don't feel fully satisfied.",
            "review_date": "2013-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An odd choice of subject for a comedy. But entertains.",
            "review_date": "2013-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Laughing at cancer. Excellent.",
            "review_date": "2013-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, touching, honest. Good performances all round",
            "review_date": "2013-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant, brilliant film.",
            "review_date": "2013-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is a comedy/drama movie which deals with cancer, so I didn't know how it could possibly be funny. Yet, 50/50 is one of the funniest movies in the past couple of years. Seth Rogen is someone who I have never found to be funny, yet in this movie he was hilarious. He really surprised me and brought great comedic timing. The performance that was the best though of course was Joseph Gordon-Levitt. The relationship that him and his therapist have is awesome and really cute. 50/50 never made me cry or anything, but it does succeed in bringing emotions.",
            "review_date": "2013-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i love this movie, i almost cry everytime but its so real.",
            "review_date": "2013-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is it even remotely possible to make a subject like cancer funny?  Well, in the case of 50/50 it is.  50/50 is an amazing drama that is both comedic and emotional.  The acting and writing is they main highlight of the film; both work nearly perfect and are what elevate the film to do and amazing job.  The story and direction both work perfectly and it's obvious Levine knew what he was doing the entire film.  50/50 is truly a great film about a serious topic and plays every emotion out very well.",
            "review_date": "2013-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny and lovable. Adding humor to a very serious illness and sad situation makes this movie one you can watch over and over.",
            "review_date": "2013-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One minute you're laughing hysterically the next you're crying. 50/50 is the perfect dramedy.",
            "review_date": "2013-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Humor and drama, sometimes a tear jerker.  Liked this movie more than I thought I would.  Joseph Gordon Levitt continues to amaze...he is getting better and better as an actor in each film he appears in.",
            "review_date": "2013-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "my review of 50-50 : http://jigar-doshi.com/2013/05/5050-2011-movie-review/",
            "review_date": "2013-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is a comedy/drama movie which deals with cancer so I didn't know how it could possibly be funny. Yet, 50/50 is one of the funniest movies in the past couple of years. Seth Rogen is someone who I have never found to be funny, yet in this movie he was hilarious. He really surprised me and brought great comedic timing. The performance that was the best though, of course was Joseph Gordon-Levitt. The relationship that him and his therapist is awesome and really cute. 50/50 never made me cry or anything, but it does succeed in bringing emotions.",
            "review_date": "2013-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly one of my favourite movies of all time",
            "review_date": "2013-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really sweet movie about friendship. The female lead sucks though. Worth watching anyway.",
            "review_date": "2013-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simple, yet humorous and emotional.",
            "review_date": "2013-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "light but heartwarming movie",
            "review_date": "2013-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbly leaded by Joseph Gordon-Levitt, 50/50 is a heartfelt and quiet story about a man who receives a cancer diagnosis, creatively balancing between comedy and drama.",
            "review_date": "2013-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watchable some good comedic moments",
            "review_date": "2013-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can't believe I'd been pushing this away for 2 years.",
            "review_date": "2013-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even if everybody plays cool about it, it's hard for everyone.",
            "review_date": "2013-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely and perfectly made to inspire!",
            "review_date": "2013-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So much worse than what I was hoping for. It's supposed to be funny and entertaining but the movie ended up being boring and dull. The plot moves along slowly and really doesn't go anywhere. It's just a sad guy being sad and then having a crazy night. There could've been so much more drama and comedy and fun and adventure in the 1 hour 40 minute period. Too bland for my liking.",
            "review_date": "2013-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was skeptical going in, but the reviews were so good I gave it a try. So worth it. No cheap jokes or emotionally manipulative dramatic moments. Every moment feels exactly like you think it would while still being actually legit funny all the way to the end.",
            "review_date": "2013-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie!!  Seth Rogen is hilarious!!",
            "review_date": "2013-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 makes me cry :(",
            "review_date": "2013-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tough to make a romantic comedy centred around cancer - Joseph Gordon-Lovitt makes it happen along with an incredible supporting cast.",
            "review_date": "2013-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a very powerful movie it shows what cancer patience go through its sad and you feel bad for adam at times in the movie but with the addition of seth rogan it has comedy in it aswell so you get some good laughs,very well made movie and could be inspirational to people going through the same sort of thing. I think most may enjoy this movie",
            "review_date": "2013-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was quite depressing and yet also uplifting.  A young man is diagnosed with cancer and has to go through the process of dealing with his new reality and his changed relationships with everyone he knows.  A good message on the meaning of friendship, this film reaches the highs and the lows - quite worth the view.",
            "review_date": "2013-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good movie , a little sad though",
            "review_date": "2013-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this movie was wonderful and very well acted.I really enjoyed this movie.  I thought it was very uplifting and gives a different prospective...to me it felt like we were on this journey with him!",
            "review_date": "2013-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One more great surprise! Perfect balance between laughs and tears. 50/50 is 100% good!",
            "review_date": "2013-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was a good movie and all with a good point, except that it started to become redundant. you could see where it was going. no surprises. but still a good movie none the less.",
            "review_date": "2013-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another fine choice from Joe Gordon-Levitt. Poignant yet humorous. A little indie gem.",
            "review_date": "2013-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Blending comedy and heartfelt drama in one film is a hard thing to pull off, and every so often a cmedy feels rather uneven or off when it puts in some dramatic and emotional scenes. Those usually makes you less comfortable when a film has branded itself as a comedy. This, however, is not the case here. What we have here is one of the funniest movies of 2011 as well as one of the most heartfelt. Its sentimentality is not to a fault in this case, and the comedy workds surprisingly well. \n\nThe actors have a great chemistry all around, and the performances are rock solid from a great cast. Joseph Gordon-Levitt gives a surprisingly plausible performance. Not that he is bad, but he has become such an icon that you usually see nothing but the actor playing himself. \n\nThe movie goes back and forth between drama and comedy with wit and easy thanks to a clever script. It is overall a very satisfying watch, and there are plenty of things to enjoy from this picture, even if most of it is not all that original.",
            "review_date": "2013-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4.5 \nI think that 50/50 could of gone either way because of the subject matter and the use of drama and comedy together. Thankfully they hit all the right strings with this one. With 50/50 you could be in the knots laughing and then two minutes later you're trying to hold in the tears, and it doesn't feel uneven. All actors were at the top of their game, Joseph Gordon-Levitt obviously being the best, but Anna Kendrick and Seth Rogen were fantastic aswel. The script is also very well written and all the dialogue feels natural even when its going from laugh out loud comedy to something really sad.",
            "review_date": "2013-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 is predictable, but the film moves intelligently between the dark comedy and drama with a talented cast.",
            "review_date": "2013-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic film, showing the many sides of dealing with cancer but with a very warming underlying connection between Joseph Gordon-Levitt & Anna Kendrick. Seth Rogen brings a sympathetic comedy to what could be a very dark storyline. Great acting, captivating from start to finish.",
            "review_date": "2013-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 pokes fun at harsh subjects and provides a heartwarming story that will both make you laugh and make you think. I highly recommend it.",
            "review_date": "2013-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing film, can't describe how good it us in words. It's just perfect, so heartwarming, emotional and funny mixed together. Also with a brilliant cast.",
            "review_date": "2013-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50/50 will give you some thought.. so more people will know about people who had a cancer.. and how to support them from inside..",
            "review_date": "2013-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just saw this. It's a OK movie knowing it's true.Just Wish the ending was longer with more of a happier ending.",
            "review_date": "2013-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice sentiment, great story...\n...but a lot of nonsensical sensationalism thrown in. \nToo grim in parts, not grim enough in others.",
            "review_date": "2013-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Meh... I didn't love it. Cancer stories don't make a film good. The story and experience can be beautiful and touching at a human level, but that doesn't mean the movie is good. Yellow Ledbetter though.",
            "review_date": "2013-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dark humor, smart characters and a script with a heart",
            "review_date": "2013-03-30",
            "source": "rt",
            "lang": "en"
        }
    ]
}