{
    "rating": 5.1,
    "release_date": "2011-12-16",
    "num_reviews": 249,
    "genres": [
        "Kids&family",
        "Comedy",
        "Adventure"
    ],
    "summary": "Dave Seville (Jason Lee), the Chipmunks (Justin Long, Matthew Gray Gubler, Jesse McCartney) and the Chipettes are taking a luxury cruise to the International Music Awards. Of course, Alvin cannot resist the urge to create havoc, and the singing rodents soon find themselves marooned on a seemingly deserted island. While Dave and an unlikely ally launch a search, Alvin and company discover that they are not alone on the island, as they first thought.",
    "reviews": [
        {
            "content": "Honestly this entire franchise is so underrated like the tomato meter for this movie isn't deserved. When I watch these movies I'm never bored and the plot has something to do with each character's personality like Alvin wants his family to be respected even he doesn't show that very much, Simon is in love with Jannette and really wants to fit in but he's  easy to be picked on, and Theodore is DEATHLY AFRAID OF EAGLES! He shows this fear due to Toby telling him his family would die if an eagle picked up the chipmunks accidentally scaring him. Theodore becomes obsessed with meerkats and thinks that he should live with meerkats due to him being body shamed and thinks he doesn't fit in. Brittany is a great character because she shows she cares about her sisters and believes no one should be a lead but all of them are lead singers but Ian doesn't approve and influences her to be a leader practically forcing her to be a lead singer. Overall this movie didn't deserve the ratings it got. Alvin the Chipmunks: the Squeakquel was not a hidden gem but a hidden diamond. I think that since this movie was made for kids critics didn't really pay attention to the movie and gave it a bad rating because it's Alvin and the Chipmunks. You can really see how hard people worked on this movie just for people to say it's bad and walk away.",
            "review_date": "2023-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very cheap low effort film",
            "review_date": "2023-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was my favorite film when I was little, the songs were good, David cross is back and my favorite character was Simon's Jungle form it was my childhood.",
            "review_date": "2023-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best of the 4 live-actions, since there's the most character growth/challenges in general. If you look at it more deeply, there is a great story being told- metaphorically as well!",
            "review_date": "2023-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I honestly don't get the criticism, it's a fun and lighthearted movie, with adorable characters and a nice growth of characters, with the right amount of jokes. Very enjoyable, loved it.",
            "review_date": "2023-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cap. This movie is one of my favorite Alvin and the Chipmunks movies. The tomatometer is whack. They know nothing about these movies. He is trying to ruin these movies",
            "review_date": "2023-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cinematic masterpiece. On par with the Godfather, Citizen Kane, and the Titanic.",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They're singing why are they still singing\n1/10",
            "review_date": "2022-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The more exciting setting and plot, along with bad humor will likely only appeal to little kids.",
            "review_date": "2022-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awful. Lazy Acting, Terrible Puns, terrible pacing. This movie for 75% of it has no plot the characters just do stuff. The CGI looks average at best and bad at worst. 85% of the jokes miss. Most of all it just boring. Even the songs are boring and forgettable. Skip This Completely.",
            "review_date": "2022-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst alvin and the chipmunks movie because the imdb rating is the worst alvin movie",
            "review_date": "2022-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alvin and the Chipmunks 3 is my favorite of the series, despite what the critics say.",
            "review_date": "2022-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "does pretty bland bland bland bland dear god why they still make theses movies?they tryed but the story is predictable,dumb,boring again no one likes theses movies.   :(",
            "review_date": "2022-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "absolutely beautiful work of art , the vocals are on point and it's very good and easy to follow story line",
            "review_date": "2022-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It a fun family movie to sit back and relax it fun to watch for the first time but not the seconds  time",
            "review_date": "2021-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent family movie that will entertain young children!",
            "review_date": "2021-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really good when the girl goes to get money",
            "review_date": "2021-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "alvin and the chipmunks on an island",
            "review_date": "2021-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really unpleasant and cringe. I hope alvin and the chipmunk the road trip the last live action of this series.",
            "review_date": "2021-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not good, but (for me) nostalgic.",
            "review_date": "2021-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The funniest segment is the \"Bad Romance\" music video!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2021-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am being honest here, this is a movie I despised. The plot is xtremeky stupid and lazy, has no devolopment, its so predictible, the acting sucks, the soundtrack sucks, its so reliant of it being talking chipmunks that its mostly songs. It is such an obvious cash grab and the cgi is still decent. It was a sort of entertaining film. Alvin and the chimpunks: chipwrecked. 19% F",
            "review_date": "2021-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is kind of focused on small children but it is okay. Some of the set in the jungle scenes look fake, like the plants and stuff.",
            "review_date": "2021-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I only recall being a big fan of the chipmunks movies when i was young, but i honestly don't know what to think of them anymore. I sorta remembering wanting an Alvin And The Chipmunks pirate movie called Alvin And The Chipmunks The Pirates, although that never happened, but we got this movie, Chipwrecked. I never saw these movies in a long time, like other people, i either seemed to like or hate this movie along with other Chipmunks flicks. I'm not saying i like nor hate any of these movies, but i feel like i should move on from Alvin And The Chipmunks. Not their Christmas song, i like it, but the films i should possibly move on from. Okay, this was honestly a very misunderstandable review.",
            "review_date": "2020-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not a movie that makes you watch it more than once.",
            "review_date": "2020-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I feel like we just needed 1 & 2 at that would be it",
            "review_date": "2020-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Trilogy is the absolute worst of the Alvin and The Chipmunks 🐿 Franchise with Jenny Slate in it. Awful jokers and boring plot this is a awful piece of C**p 2/10",
            "review_date": "2020-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Barely even about music, and that's what the chipmunks are meant for. Easily the worst in the franchise.",
            "review_date": "2020-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By far the worst Alvin and the Chipmunks movie. Maybe not even worth seeing at all. It isn't funny or anything. It's just annoying.",
            "review_date": "2020-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lazy setting, unlikable characters, poor plotting and derivative jokes will make it only enjoyable for very young children.",
            "review_date": "2020-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As actually the improved beat catches on. Everyone still keeps on that softer beat, beating down the third escape to the island of chipmunks. Oddly nostalgic...",
            "review_date": "2020-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie takes the charm of the other three movies and puts it in the bin this movie takes the cringe factor level up to 11 and appeal to the lowest common denominator the critics were right about this movie they really need to do some rewrites with this story because the road chip told this story in a way better way",
            "review_date": "2020-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was honestly one of the best movies that I have seen in a LONG time. It was a truly \"laugh out loud\" comedy with humor for all ages. I was inspired by main character, Ian Hawke, to be myself and never give up on my dreams. Don't even get me started on the costume designers for this movie. They were absolutely FABULOUS. My favorite piece was Ian's majestic bird costume. I am truly thankful to the writers of this film because before this franchise, I honestly had lost all hope for Hollywood. Alvin brings so much character to the big screen, Simon brings the brains, and Theodore brings great representation to all overweight chipmunks.",
            "review_date": "2020-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Listen, The first 40 minutes of this movie i really like, tho the other parts are pretty boring. \nbut i still like it! 7,2/10",
            "review_date": "2020-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Garbage and joke of a movie, the original chipmunks is the way to go.",
            "review_date": "2020-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't let your kids watch Chipwreaked or these other piece of shit CG Chipmunk films I would rather put a pine cone up in my ass, shredded by a demon tiger, and tear my eardrums out because of these POP SONGS SUNG BY THE CHIPMUNKS!!!! Not even the actors like Jason lee, David Cross or Jenny Slate can save this film. This film makes me admit that I love the first two Spy Kids and the hand drawn film the chipmunk adventure are more like films than this crap. no stars and fuck this film! I am glad that I've never watch the sequels like the squeakual and the road chip.",
            "review_date": "2019-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alvin and the Chipmunks: Chipwrecked can be better and more fun than his predecessors because of great direction by Mike Mitchell, a good screenplay by Jonathan Aibel and Glenn Berger, even better visual effects, excellent voice acting and charismatic performances by Jason Lee, David Cross and Jenny Slate",
            "review_date": "2019-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was alright it was pretty cool but not to good I still recommend it though ",
            "review_date": "2019-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I actually used to unironically like these movies back when I was an idiot with no taste. I laughed at them and not sarcastically or out of pity. Even back in 2011, part of me felt that it wasn't as entertaining as the last two. Guess a juvenile parody of Cast Away wasn't trendy with the kids. Lowest common denominator fare that's one of the laziest films I've ever seen that couldn't be more blatantly screaming \"Money, dear boy\" if it had Laurence Olivier (or rather, a CGI likeness of him which is most definitely not a reference to a movie released in 2004 that did the CGI resurrection thing years before Star Wars did it) in it. There's a reason why I REALLY didn't want to write these reviews.",
            "review_date": "2019-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love Alvin and the chipmunks. when ever I see it just makes my day. They are so cute and the songs are amazing.\n",
            "review_date": "2019-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the best Chipmunk movie ever.",
            "review_date": "2019-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can see why the plot and settings are getting bloated but remember this is a very kid friendly setting and it still works",
            "review_date": "2019-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is a amazing moviw with really funny bits and this deserves a 6 star if i had to",
            "review_date": "2019-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was unwatchable.",
            "review_date": "2018-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as bad as the 2nd",
            "review_date": "2018-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The mean spirited tone and annoying voices, as well as the constant ruining of songs, make this movie the worst pile of chipmunk droppings of the four.",
            "review_date": "2018-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie had some laughs",
            "review_date": "2018-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie wasn't even close to being funny it was so annoying to here those chipmunks sing with their high pitch voice I couldn't stand another word out of their mouths not even close to being a good movie I would give it a 0 but I can't but it should be a0 percent of how bad this movie was",
            "review_date": "2018-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i really liked this one its fun",
            "review_date": "2018-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story for this movie seemed a bit \"Made for TV-ish\" but at least the filmmakers finally gave the chipmunks more songs to sing.  I am not the biggest fan of pop music, but that genre seems to work best with these characters.  The movie is pure nonsense, but I am sure that the younger kids will still like it.",
            "review_date": "2018-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not fun to watch unless you're really, really young.",
            "review_date": "2018-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The chipmunks are back music was good but I’m still for the first one",
            "review_date": "2018-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am saying this once: This movie is decent and is not as bad as the tasteless The Road Chip movie.",
            "review_date": "2017-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "|It's a 7,0 out of 10| - just because i remember liking it.",
            "review_date": "2017-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Perfect family holiday comedy",
            "review_date": "2017-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although \"Alvin and the Chipmunks: Chipwrecked\" was pretty unrealistic, it relates a lot to real life by distributing some wonderful messages throughout the fantastic plot.\nAll of the characters were unique, and it was very well directed by Mike Mitchell. It was also brilliantly written by Glenn Berger & Jonathan Aibel. \nAs with all the previous movies, the performances really need to improve. I also hate when Jason Lee (Dave) yells. It sounds really cheesy. I don't think this sequel was as good as the first movie (Mainly because it was a bit boring), but it was ok. After all, it did end with a pretty catchy song!\nSo overall, this was an ok movie with some unique messages to offer. :)",
            "review_date": "2017-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The backgrounds are slightly better, but that isn't enough for this still being terrible.",
            "review_date": "2017-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just fucking shoot me!",
            "review_date": "2017-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not a good movie to watch",
            "review_date": "2016-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cute characters, horrible/cheesy story",
            "review_date": "2016-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very lazy, Girl lady actor Sucks. Pretty Bland movie.",
            "review_date": "2016-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What's the matter, Fox? Two chipmunk movies didn't make enough money for you? Didn't sell enough toys? Hmm?",
            "review_date": "2016-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie Tries to be great, Songs are nice, okay story",
            "review_date": "2016-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst out of all of them!",
            "review_date": "2016-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie was terrible",
            "review_date": "2016-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alvin and the Chipmunks: Chipwrecked is greater than the other two. The movie is hilarious and is a great family movie. I would very much suggest this movie.",
            "review_date": "2016-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WORST MOVIE OF ALL TIME!!!",
            "review_date": "2016-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "better than the first two and way more hilarious",
            "review_date": "2016-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More of the same escapades, only this time, at sea and in an episode of Survivor...  In the entire series, the only character with even a tiny chunk of charm is Theodore. As before... strictly for the little ones\nResonant Line: \"Alvin: You can follow me on Critter.\"",
            "review_date": "2016-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie from begging to end and it is fun for fans of the series.",
            "review_date": "2016-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even worse then the second",
            "review_date": "2016-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is the one of the worst movies of all fucking time. I hate every thing about this movie. it took everything in me to not look away from the screen or turn it off. the dialogue is so godawful that it's not even fun to listen to because it's so bad. the acting is some of the worst I've ever fucking seen. I wanted the characters to die when the volcano was erupting. don't see this..........ever.",
            "review_date": "2016-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought the movie was pretty good. Younger viewers are most likely will be entertained. Older viewers will have to grin and bear it.",
            "review_date": "2016-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alvin and the chipmunks is a good kids movie. And it's cool that they have new songs and new characters.",
            "review_date": "2016-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When will they stop making these annoying movies?",
            "review_date": "2016-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "bad because it want let me watch it",
            "review_date": "2016-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why do I keep doing this to myself.",
            "review_date": "2015-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "These movies are like going way too far. It's just only money grabbing.",
            "review_date": "2015-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best one in the franchise.",
            "review_date": "2015-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "18/100 - I don't know how these films keep getting made. The first Alvin and the Chipmunks movie was bad enough. The sequel was a disaster. This is no better. Juvenile comedy, juvenile characters, and juvenile production values all come to a head here. Anyone who has their kid asking them to see this should direct them towards literally anything outside of this franchise because it would be leagues better. I regret putting my time into this, a third installment of a franchise that shouldn't have had a second.",
            "review_date": "2015-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This just a slight improvement over the Squeakquel but in away thats just like saying one turd smells better than another. I saw movie in theaters on my 11th birthday and even back then I didn't it was that good and this would have been my first stage of my becoming a critic in not only movie but in entertainment in general so I at least have to thank this movie helping me become the who I am today.",
            "review_date": "2015-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "0.5 out of 10:\n\nThey made 3 of these turds?",
            "review_date": "2015-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is funny and cool",
            "review_date": "2015-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had to talk through his movie, GOD SAVE ME!\n\nThe Worst Alvin and the Chipmunks movie i have ever seen.\nAnd Yet I thought the 1st one was the worst, But Nope, This was!\n\nScore: 1/10",
            "review_date": "2015-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cute but doesn't have that much to it. It's everything you expect and/or hate from this franchise and young kids will love it. Had a few moments but really this is the one that demented the chipmunks as an ehh franchise.",
            "review_date": "2015-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Chipwrecked might have wrecked the comedy a bit, the clever plot and returning cast makes this 3rd installment a big party cruise on the screen. Review by Logan Cornn.",
            "review_date": "2015-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one is very much for kids, there's no attempt to make it family friendly.",
            "review_date": "2015-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It wasn't very good . It was kinda dumb. Where is the plot because if this was the plot it was stupid.",
            "review_date": "2015-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now, if you told me that The Chipmunks and Chipettes were he cruise entertainment, THAT would be kinda cool. But they're only on the cruise to get to a music awards show performance. Not so much. Then there's the whole Cast Away parody. Crazy Cast Away parody. The parts do not add up to a completely entertaining whole.",
            "review_date": "2015-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rating: 7%\nTerribly written, horribly acted, and inferior to its already disappointing predecessors, Alvin and the Chipmunks: Chipwrecked should only be entertaining for children 4 and under.",
            "review_date": "2015-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First one was good. second was okay. This one is probably one of the worst movies ever made. One of the stupidest plots ever made. I don't wanna waste my time talking about this movie.\nGrade: F",
            "review_date": "2015-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Um  what can I say about thisâ¦interesting movie. Okay admittedly there were some goods things about this. The chipmunks were very cute, and had some very good songs. But this just has so many flaws. I'm not going to list them because there's so much bad things about this. But the main problem is that the story is horrible and has no purpose whatsoever. This one is strictly for kids 10 and under. Olderâ¦just try to look at the bright side of things and enjoy it.\n\nD+",
            "review_date": "2015-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They still make these things?!",
            "review_date": "2015-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lowest-common denominator kiddie fare. Witless, annoying and loud. Rating: 18",
            "review_date": "2015-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you ask me, everything in this movie is a total \"chip-wreck\", such as the story, the script, the acting and the singing. Do not even bother to take one little glimpse at this movie, even for a split second! A total waste of time, this movie is extremely rotten! Those people at 20th Century Fox will be very sorry for ever making this BS! Unacceptable! What a joke and disappointment! It deserves two thumbs down and two middle fingers!",
            "review_date": "2015-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first two.",
            "review_date": "2015-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decently fun.  Seems like they hit a stride, as this also feels more in tone like the old cartoons.",
            "review_date": "2015-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alvin and the Chipmunks chipwrecked",
            "review_date": "2015-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the second worst movie of 2011",
            "review_date": "2015-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review from my child; I like when the volcano exploded.",
            "review_date": "2015-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first two movies, and frankly it's quite sad.",
            "review_date": "2015-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Did they even try? The movie is bad, the singing is bad, and the acting is just plain awful. This addition to the Alvin and The Chipmunks series has really ruined any future of there ever being another film with cute singing Chipmunks.",
            "review_date": "2015-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THIS IS ONE OF THE WORST FILMS THAT I HAVE EVER SEEN. It's not funny, charming, or enjoyable on ANY level.",
            "review_date": "2014-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WOW......WOW......WOW......WOW....WOW...SO SO SO SO SO BAD.....MAN THIS MOVIE IS JUST SO SO SO SO DREADFUL, THIS IS SO SO SO AWFUL, MAN THIS IS SUCH A COMPLETLEY DREADFUL MOVIE 2 WATCH.....IT IS NOT AS GOOD AS THE 1ST MOVIE AS I THINK THAT THE 1ST MOVIE IS THE BEST OUT OF ALL 3 MOVIES......ITS GOT A GOOD SOUNDTRACK THROUGHOUT THIS MOVIE.....WARNING THIS MOVIE CONTAINS STROBE LIGHTNING EFFECTS THROUGHOUT SOME SCENES THROUGHOUT THS MOVIE.......MAN THIS IS SUCH A DREADFUL MOVIE 2 WATCH, WARNING YOU HAVE GOT TO WATCH THE END OF THE CREDITS THROUGHOUT THIS MOVIE AS SOMETHING HAPPENS AT THE END OF THE CREDITS THROUGHOUT THIS MOVIE.....\n\n\nIn June 2013, 20th Century Fox announced that a sequel, Alvin and the Chipmunks 4, would be released on December 11, 2015.\n\n\n\n\nMAN THIS IS SUCH A DREADFUL AWFUL MESSY REALLY REALLY BAD MOVIE 2 WATCH, IT IS SO SO SO SO SO BAD, IT IS SO SO SO AWFUL MOVIE 2 WATCH, IT IS SO SO SO BAD, JUST AVOID THIS MOVIE IT IS SO SO SO SO BAD IT IS SO DREADFUL, IT IS A GREAT WASTE OF TIME IT IS SUCH A DREADFUL MOVIE 2 WATCH......THE SCRIPT IS SO SO SO WEAK IT IS SO SO SO BAD, IT IS A DREADFUL MOVIE 2 WATCH, IT IS SUCH A REALLY REALLY WEAK/POOR SCRIPT IT IS SO BAD ACTING JUST AVOID THIS MOVIE IT IS SO SO SO BAD......",
            "review_date": "2014-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't believe that this movie got a theatrical release. Everything about it, it's title, it's acting, it's plot, and it's overall quality, seems like a direct to dvd sequel, but nope, I saw it in theatres. It's just total crap. Nothing about it is quality. By far the worst out of the chipmunks films.\n\nHalf a star/5",
            "review_date": "2014-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You cannot make me review this movie in-depth. This was an absoulte waste of time and I don't want to go any further into it. \nSongs range from okay to terrible. The plot feels awfully recycled and this is a movie that is difficult to sit through. \n\nPlease..just no more ruining of my childhood. Please. \nTheodore has some cute moments, but that's about it. End of discussion.\n\n2/10 Awful",
            "review_date": "2014-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It Gave me a headache",
            "review_date": "2014-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the animated version and the real life version. Awesome movie but probably the worst chipmunks movie ever. I like the idea of chip deck but not good.",
            "review_date": "2014-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pop culture references aside, unwatchable except with the under-10 crowd as an audience.",
            "review_date": "2014-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I must really hate myself to put me through the torture of watching this excuse of a movie. On a side note I'm sure the kids would love it not sure I as a kid would have though.",
            "review_date": "2014-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A series that truly shows that this should have never been a series.\n\nUsually whenever a trilogy is formed, I'm always very interested how it will turn out. The 1st one should be the best, the 2nd is not that great, but the third redeems itself. Truly, this movie failed that idea of trilogy's. \n\nWhen I first watched this, I was surprised to see how quickly the movie got. I understand that the ship was important, but I felt like their was no true dynamic as to why out of all things it needed to be a ship. I understand that the movie was built for kids, but there's many other kid movies out there like \"Despicable Me\" and \"The Lego Movie\" that were great for all ages. The plot became so week as soon as they got on the island that I fast-forward until the end, seeing that was truly nothing special and very predictable. The chipmunks although are always a pleasure to see, but when the story is predictable, then the movie just fails. \n\nKnowing that Chris Miller from \"The Lego Movie\" will be working on the next installment of the series makes me feel really confident that the movies will be back on track as to how good the first movie was. \n\nF",
            "review_date": "2014-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When Hollywood can manage to take such a lovable cartoon and turn it into a movie full of annoying pop culture references, terrible \"acting\", bad cgi, FAR FETCHED story, and just awful on all counts. By the way no one cares about Jeanette enough for her to be saved. Theodore and David Cross were the only things remotely tolerable about this Chippy Dippy Crapfest.",
            "review_date": "2014-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just when you thought things in this series of films couldn't get any worse, this pathetic movie comes along to wreck it up again.",
            "review_date": "2014-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst out of the series It sometimes won't keep kids entertained overall average C",
            "review_date": "2014-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think Jason Lee needs to quit acting before I make him personally stop",
            "review_date": "2014-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best of the 3 for ages 7+",
            "review_date": "2014-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay, let's all think back to the first trailer of the first movie of this trilogy. It hurts, but try.\n\nIt opens with a montage of screaming rock fans through the ages, building up like a documentary of some classic rock legend, or some overdue comeback tour. Then you found out it was CGI chipmunks. They screech at you with helium fueled voices, and the whole thing ends when Alvin eats Theodore's shit.\n\nConsider that. They blind you with used spectacle and feel you their shit. The metaphor is palpable.\n\nAnd now? They got away with three of them. I want you all to remember, this was all your fault. They told you what you were getting on day one, and you bought it anyway.  I blame you, because they didn't film this crap on MY dollar.",
            "review_date": "2014-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent Animation + Comedy + Family + Fiction Movie.......................................\nExcellent Work.............................",
            "review_date": "2014-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So hard to watch!\nThe first one wasn't that bad.\nThe second was getting worse.\nThen the third was made purely because of money as they were clearly not trying in the script or anything but they knew they would get money because of the success and moderate success of the first two & that is the same reason that they will be making a fourth which they sadly are.",
            "review_date": "2014-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is good it's when the chipmunks go on a cruise and then Alvin, Simon, Theodore, Britney, Jeanette and Eleanor get stuck on an island with a girl who has been there for nine years first she acts friendly but she has been using the chipmunks to try and steal some treasure that's hidden. \nWill the chipmunks be found?\nIn stores now",
            "review_date": "2014-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "please no more the chipmunks I'm getting sick of it you know what I like the actual cartoon version",
            "review_date": "2014-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They took it to the extreme with the Chipmunks this time but it rocked",
            "review_date": "2014-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "love it want to see it so funny lol please",
            "review_date": "2014-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome!! Movie! I love it!!\nThe Chipettes and The Chipmunks, , Awesome!\n\n\nYou know I don't know why alvin always  has trouble with Dave! And he shouts like this! ALVIN!!!! Hahahahaahah!",
            "review_date": "2014-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I want to see it\nrealyly bad",
            "review_date": "2014-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With an all-new story, a cute script full of funny dialogue, a great cast that returns once again featuring Jason Lee as Dave Seville, David Cross as Ian Hawke and the voices of Justin Long as Alvin, Matthew Gray Gubler as Simon, Jesse McCartney as Theodore, Christina Applegate as Brittany, Anna Farris as Jeanette and Amy Poehler as Eleanor along with the addition of Jenny Slate as Zoe, good directing by Mike Mitchell, perfect songs, hilarious scenes and sequences and a fantastic pace and flow, Alvin and the Chipmunks: Chipwrecked is another fun adventure you'll enjoy over and over again with Alvin and the gang.",
            "review_date": "2014-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I getting worse than the previous one...",
            "review_date": "2014-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I never thought id hate a movie within the first few seconds of viewing it. I guess I was wrong.",
            "review_date": "2013-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Was Better Than The First Two.B-",
            "review_date": "2013-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lame Just no Nope Not Negative Absolutely dont Totally not Bogus Horrible Terrible Uh nuh Not the best ",
            "review_date": "2013-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "IF I was shipwreaked with these rats, I would cook em up from the word go!\n...\ncrap movie",
            "review_date": "2013-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best one yet a great movie a funny one too a 90% by Aidan",
            "review_date": "2013-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As if the premise of stupid talking rats isn't ludicrous enough, they have to go on a cruise and get shipwrecked. The fact the someone had to come up with that is very sad indeed. This makes The Room watchable.",
            "review_date": "2013-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My 5 year old loves it.",
            "review_date": "2013-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Alvin and the Chipmunks: Chipwrecked\" is the worst in the series. There wasn't even a plot. Worst then the first and second.",
            "review_date": "2013-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its bad. its really REALLY BAD! not the worst movie of all time but definetly up there. don't trust the user rating but trust the critic rating",
            "review_date": "2013-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The third in the movie series lets me down",
            "review_date": "2013-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one is my favorite chipmunks movie. It has the funny factor more than the the first two.",
            "review_date": "2013-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good a funny adventure movie I give it a 98%",
            "review_date": "2013-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first two movies were enjoyable.  This film on the other hand was not.  Skip at all costs.",
            "review_date": "2013-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is something about harmonizing a cappella chipmunks that brings a smile to your face. It's hard to resist. Another good installment to the Chipmunk saga. I actually liked this better than the Squeakal. It compares to the first film in quality, only this one doesn't have that holiday motif. A goo fun film for the whole family. The soundtrack is entertaining, with mash ups combining songs you would've never imagined would go together. Who would've ever thought in 2011, Gloria Estefan's Conga would be remixed with a remixed version of an old Italian song? In this movie we watch the Chipmunks stranded on an island. Granted the things they construct out of bamboo and coconuts make Gilligan's Island seem realistic--but then again, this is a movie about a man who is raising six talking chipmunks as children. They even pay homage to \"Cast Away\" (2000). Simon's transformation into \"Simone\" is entertaining, but was this perhaps an attempt at competing with \"Puss 'n boots\" (2011)? Interesting nonetheless. This movie is fun to watch.",
            "review_date": "2013-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good but not the best 93%",
            "review_date": "2013-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I found this movie really adorable",
            "review_date": "2013-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film title isn't even accurate. Chipwrecked has no shipwreck. Your pun fails.",
            "review_date": "2013-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alvin and the chipmunks :chipwrecked",
            "review_date": "2013-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "STOP. NO MORE. I hated it the first time.THIS IS THE MOST ANNOYING MOVIES OF ALL TIME. \n1 out of 10",
            "review_date": "2013-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My little one loves it. Lord help me.",
            "review_date": "2013-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yet another movie (after Spy Kids 4D) that I'm embarrassed to say I've seen. I'm not kidding when I say this movie makes me want to commit suicide. I guess I can see why some enjoyed the first one, but how the hell could you like this?! Why does this movie exist? Really? Why? I'll tell you why, to make a shitload of money, that's why. Ugg, everything is absolutely depressingly bad in this movie. The jokes are terrible, and oh my god could those damn chipmunks be any more annoying?! Really, I want to go and hide. It's a movie I'm embarrassed to say I watched, like I said before. Then again, I didn't watch it on my own free will, so I guess I'm not quite as embarrassed then if I decided to watch it myself. Either way though, this movie is terrible, so stay away. Ps- parents, if you're going to have a family movie night, be sure to make the flick an old 90s Disney and Hayao Miyazaki film. Ok. I don't care what the kids want. Tell them they can't watch this shit because it's for their own good. Literally, it kills brain cells. Fuck, fuck, fuck! I'm mad just thinking about this movie.",
            "review_date": "2013-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "FUNNY CARTOON/movie THEY WERE OUT OF HAND THE MON THEY GOT ON THE SHIP.",
            "review_date": "2013-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a good sequel that you will enjoy if you like the characters, but, not as good as the other ones",
            "review_date": "2013-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Especially Alvin made mistake and accident while Dave was fell asleep.....somehow all chipmunks stuck into island and tried for help.....so Uncle wore Duck dress and accident happen on glide!!! Into island again.  Search little friends to save life!!!! Worth to watch....",
            "review_date": "2013-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was good cause Matthew Gray Gubler in it:-)",
            "review_date": "2013-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "And the second one now seems to be good.",
            "review_date": "2013-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh, once more, slapstick galore, with everyone's \"favorite\" furry friends. Surprisingly, the movie isn't half bad. Yah the plot was simplistic. Yah the jokes would hit as often as they would miss and of course, the ending was a bit too preachy on values. But, the novelty of seeing all these little chipmunks scurrying about hasn't worn out yet for me. The kid in me loved it and I'm not ashamed to say it was a fun ride.\n\nOverall: Good family film. Slapstick galore. Run of the mill plot, acting etc, but fun to watch and enjoyable nevertheless.",
            "review_date": "2013-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not much to like here. The humour was weak, the animation looked subpar, and a little too much cheese, even for a children's film.",
            "review_date": "2013-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why didn't they end the Alvin saga last movie? Why are they recycling this trash? They should kill Alvin.",
            "review_date": "2013-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "SO STUPID. Alvian Simon Theodore Brittany Jeanete and Eleanore plus there dad Dave go on a Cruse where they meet Ian there enemy. The third movie more like the turd movie. 2 in a half stars.",
            "review_date": "2013-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If only the chipmunks boarded on Titanic",
            "review_date": "2013-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its lack of storyline makes me drift away fairly early, too much singing in inappropriate areas. pretty sure the whole film is just  trying to advertise its soundtrack and diversity for old/copyrighted music.",
            "review_date": "2013-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Should probably not exist.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hopefully this third instalment might bring the series to a close - they say bad things happen in threes. But i honestly i don't think i could take a fourth one! The first one i didn't mind,The second one sucked!,This one sucks more! SKIP IT!!!",
            "review_date": "2013-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "funny and awesome love it",
            "review_date": "2013-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My kids loved it, which I guess is all that really matters.",
            "review_date": "2013-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Someone reply!!!! This picture says free movie to get u started on the app of this how do i get it!!!",
            "review_date": "2013-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Prob the best of the series and that's not saying much.",
            "review_date": "2013-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this movie. Really enjoy the chipmunks.",
            "review_date": "2013-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the best one in the trilogy.",
            "review_date": "2012-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ugh. This movie was terrible. Brutal, really. Sucked like a Hoover.",
            "review_date": "2012-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first movie was quite deep, had a lot of emotional moments and was a lot of fun. The second one was focused more on the fun part rather than the emotions. This is another step in the not quite so well-picked direction. A lot of silly fun, limited deep and emotional stuff. Could have been worse but then it could have been a whole lot better. The overall experience is fortunately still watchable but should there ever be another chipmunk movie, let's hope it goes back to it's roots.",
            "review_date": "2012-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This wasn't that good. Obviously it's a kid movie, but I found the other two films to be enjoyable. This was pretty dull. There first twenty minutes was good, but after the whole shipwreck it just got really boring. Also, I did not like what they did with the lady on the island. She was definitely crazy and tried to harm one of the chipmunks, yet they got over this way too quickly (this was not really becoming for a children's movie when it comes to enslaving little chipmunks). I enjoyed the song covers, but the movie was not worth watching again.",
            "review_date": "2012-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Actually really really cute",
            "review_date": "2012-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is better than the second AATC in my opinion. I was entertained by this film, but it was still a pretty bad film.",
            "review_date": "2012-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fletcher enjoyed which is the main thing!!!",
            "review_date": "2012-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good for the kids",
            "review_date": "2012-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They should've stopped in it's 1st installment.",
            "review_date": "2012-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit disappointed about the plot, i was definitely expecting much more but still great effects, furry cuteness and music. Does not push it past average in my eyes like the previous 2 movies did which actually had some kind of spark.",
            "review_date": "2012-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "funny but the first two were better",
            "review_date": "2012-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible.  Was forced by the gf to watch it and we turned it off after 15 min.",
            "review_date": "2012-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "AAALLLVVIIINNNN!  Forget Alvin, I want a Theodore! lol  Well, they're all cute! This annoyed me at first with Alvin's sillyness, but lets face it, that's his character.  Led into a cool, family fun movie with a few good lessons.  Great to see the evil Ian back again with a surprising outcome.  Highlight, Theodore and Alvin snuggling in and hugging their 'dad' Dave - soooooo cute.",
            "review_date": "2012-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring as hell. The movie was very predictable as there was barely any music at all. The chipmunks never shut up as this 90 minute of a crap filled money wasted so called film made me dreadful by wasting my time to come see this. Yes its good for the kids but not above the age of 10. so dont waste your money on this. waste it on something better. Lets hope it ends here. 0.5/5",
            "review_date": "2012-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film is cute, but not the greatest. It reminded me a little of Cast Away, 6 Days 7 Nights, and Madagascar. Jason Lee is always great as Dave in all of the films. David Cross is more annoying as Ian. The Zoe character is as annoying as David Cross's character. Of the 3 Chipmunks film, the first one, in my opinion is the best one. However, I like the cartoon of Alvin and the Chipmunks better than the movies.",
            "review_date": "2012-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know why I find chipmunks singing pop songs hilarious.  I guess there's symmetry to it.",
            "review_date": "2012-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It wasn't horrible.. but those chipmunks are just so darn cute..",
            "review_date": "2012-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My daughter is 2 and she sat through the whole movie In the theatre.",
            "review_date": "2012-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ian: Not many record studios want to hire the guy that blew it with the chipmunks, blew it with the chipettes, and passed on Justin Bieber. Twice, actually. \nNo. Never again. That. That was terrible. I can't really find many more movies that were as bad as this one. I couldn't take it. There was what, ONE funny line? And them making fun of Castaway... I just couldn't. I can see your kids liking this movie. You'll wish you had a 12 gauge pressed to your neck by the end of this movie. I don't have much to say other than I recommend nobody seeing this at all.  Never will I watch this movie again.",
            "review_date": "2012-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn't finish, Ian was too annoying & rude.",
            "review_date": "2012-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie i havent seen",
            "review_date": "2012-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i got bored during this movie. it fails to make me laugh this can be way better",
            "review_date": "2012-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sweet nice not great but enjoyable",
            "review_date": "2012-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My name is Anthony Aranda from Kids First!  and I am reviewing a really funny movie called âAlvin and the Chipmunks: Chipwrecked.â? This was awesome because there is a lot of action in the movie and everything the chipmunks and Chipettes do is so funny.\nThis movie is all about Dave, the chipmunks, and the Chipettes who go on vacation and have a really big adventure. They go on a cruise ship and Alvin keeps causing lots of trouble on the ship (like always). Alvin comes up with a really great idea to fly on top of a kite. All of the chipmunks and Chipettes are holding the kite while Alvin is flying but the wind picks up too hard. They start to fly away and Simon tries to help by tying the kite to Daveâ(TM)s chair (while he is sleeping). This still doesnâ(TM)t work and the chair and the chipmunks start to move down the deck of the ship. Eventually, the kite slips off the chair and the chair flips over. Dave wakes up to see the chipmunks and the Chipettes fly away on the kite.\nSome of the main characters in the movie are Dave, the chipmunks (Alvin, Simon, and Theodore), the Chipettes (Eleanor, Jeanette, and Brittany), Zoe, and Ian. My favorite character is Alvin because he is always having fun and causing lots of trouble. I also like him because in the end he learns that he can still have fun while being responsible.\nMy favorite part in the movie is when the chipmunks and Chipettes meet Zoe on the stranded island. She invites them to meet her friends and when they get there they see that her friends are a bunch of sports balls.  Itâ(TM)s really funny because it seems like she is a little crazy since she has been on the island for so long. We figure out later that there are spiders on the island that change a personâ(TM)s personality and make them act differently. Later in the movie Simon gets bit by one of the spiders and then he starts acting like someone else. It is really funny. \nI would recommend this movie for all ages because it is super funny and there was no violence or parts that would scare anyone. It also shows how much family means and that most families would do anything for each other.",
            "review_date": "2012-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The scenery is great to look at, but minus that, Chipwrecked is too inane and formulaic.",
            "review_date": "2012-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best of the trilogy. Hope there will be more.",
            "review_date": "2012-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I dont care what anyone says... I giggled and guffawed.  It reminded me of my childhood... I did begin to wonder where Miss Miller was, though! If you are child-like as I am, you will love it!",
            "review_date": "2012-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It Is A Really Good Movie I've Seen It About 3 Time's And It's Still Funny I Don't Know Why People Are Saying It's Bad When It's Clearly Not Maybe They Just Need To Enjoy It",
            "review_date": "2012-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OMG! my son begged me to see it and I HATED it!!! so much",
            "review_date": "2012-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "==== ( http://www.clothes8.us ) =====\n\nfree shipping\n\naccept the Credit card and other\n\njordan shoes $32\n\nSunglass $12\n\nCOACH_Necklace $18\n\nhandbag $33\n\nmore products\n\n====( http://www.clothes8.us ) =====",
            "review_date": "2012-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "though darker then the first,but to bad to be good",
            "review_date": "2012-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never enough chipmunks!",
            "review_date": "2012-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's kinda cute, not much else.",
            "review_date": "2012-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "annoying,boring,and a terrible ending took everything out of the first one",
            "review_date": "2012-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alvin and his cohorts have made a splash in 2007 and continue to belly-flop ever since. This time, the sixtet of super annoying squirrels (I know they are chipmunks, I will call them squirrels to mess with their heads) go onto a cruise ship in order to perform at the International Music Awards. When Alvin's fun turns into fail, he and the other five menaces to society end up on a desert island and their adoptive father Dave (Jason Lee) and arch nemesis Ian Hawke (David Cross) looking for them, for opposite reasons, obviously.\r\n\r\nAfter suffering through the first two \"munkin'\" annoying pictures, I cringed at the first feeling of renting this one, but I did and I want my money back. Honestly, how could any human being actually LIKE this franchise. It boggles the munkin' mind.\r\n\r\nI admit that at first Alvin, Simon and Theodore were cute in the first movie, but they went from cute, to tolerable, to completely annoying. I'd like to see a fourth movie... when they get rabies and die.\r\n\r\nBut I commend the series for being consistent... consistently sucking! The actors suck, the visuals suck, all but two jokes in the entire franchise (two of which are in the third movie) suck and of course kids everywhere will think that this movie sucks.\r\n\r\nThe only good thing about this movie was... it ended.\r\n\r\n1/2 out of ****\r\nFINAL VERDICT: 5%",
            "review_date": "2012-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "better than sequel...",
            "review_date": "2012-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Chipwrecked is a bump in the road for these munks. A horrible film focusing on Dave and singing. One plot is not enough for this horrid film that ruined the franchise.",
            "review_date": "2012-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Chipwrecked is one of the worst movies of 2011. With no creativity or originality, it's not enjoyable for anyone past kindergarten. It's cliche'd and unfunny and pretty much brainless. It's really just plain annoying. These aren't chipmunks you want to hug or pet and comfort, you wanna just punch them in the face.",
            "review_date": "2012-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its so full of giggles",
            "review_date": "2012-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "would love to see tis movie",
            "review_date": "2012-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "watch it but only if you really really want to",
            "review_date": "2012-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was really funny, I would love to have a chipmunk, they are sooo cute!!!",
            "review_date": "2012-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Alvin and the Chipmunks: Chipwrecked\" isn't particularly good or bad, and as a kid's movie, you can do a lot worse. The bad jokes and predictable plot makes this a definite NO! for adults, but for small children that enjoyed the first two, they'll have fun looking at the Chipmunks do their singing and dancing thing. At least the Chipmunks look really good on blu-ray. (Blu-ray, August 6, 2012)",
            "review_date": "2012-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favourite one of them all I think",
            "review_date": "2012-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a cute story with great music but I could be good without all the creapy balls with the faces and zoey losing it at the end but overall wonderful and my 3year old brother loves it.",
            "review_date": "2012-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first 'Alvin an the Chipmunks' movie was all we needed. 'Chipwrecked' is the epitome of cashgrabbing.",
            "review_date": "2012-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "People usually hate my taste in movies, so this one is no exception. I don't like the cliche movies hollywood pukes out these days. Alvin and the chipmunks takes the cliche and does it in a chipmunk voice. People clamor for crap like Charley Sheen and Two and a Half Men. Or housewives. or Jerry Springer. etc.. Disney is so leftwing and they do the same movie over and over again. People are like oh they are soo great. Let buy all their toys and fly to Disneyland! to feed the beast... Alvin and the Chipmunks was created by a guy and a tape deck in the 50's. Back when a guy could do something like that. He had a family and a job and made something in his basement. I want to do that. SO anything that can come from that and still be around today is amazing.",
            "review_date": "2012-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit unnecessary, but entertaining enough.",
            "review_date": "2012-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie really does SUCK.",
            "review_date": "2012-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie it's the best. And it's the 2 best movie I've ever saw thank you",
            "review_date": "2012-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A slightly more colourful, slightly better movie than the 2nd, is there any way that these movies are going to stop? There are moments of chuckles but they are few and far between but this movie is for kids, not sure how gambling is suppose to go down with kids though. These movies need to be taken with the kids in mind but I don't know how many times you can sit through the songs with the high pitched voices, I would aim for something from Pixar if you are trying to please the kids and keep your sanity.",
            "review_date": "2012-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Alvin and the Chipmunks: Chipwrecked\" 10 Scale Rating: 2.5 (Awful) ...\r\n\r\nThe Good: Jason Lee makes a great David Seville. \r\n\r\nThe Bad: It feels like a horrible direct-to-video sequel. It wasn't cute. It wasn't funny. It wasn't entertaining.",
            "review_date": "2012-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Alvin and the Chipmunks: Chipwrecked\" 10 Scale Rating: 2.5 (Awful) ...\r\n\r\nThe Good: Jason Lee makes a great David Seville. \r\n\r\nThe Bad: It feels like a horrible direct-to-video sequel. It wasn't cute. It wasn't funny. It wasn't entertaining.",
            "review_date": "2012-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Party rock is in the house tonight. :)",
            "review_date": "2012-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kids loved it.....that is the important thing!",
            "review_date": "2012-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love it !! It's soo cute.",
            "review_date": "2012-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't wait to see it",
            "review_date": "2012-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is much better than the first in the series, but that's not saying much.\r\n\r\nThe musical score, singing, and animated choreaography are quite good, but Jason Lee's performance as Dave is only slightly more convincing than his other efforts as the devoted father of these English-(and French)-speaking rodents.\r\n\r\nChipwrecked is a completely acceptable and mostly engaging family movie, but don't look for it to generate any academy awards.  I admit that I wasn't watching the clock to see how much longer it was going to last, but the sets were pathetic while the Zoe character had perfect clothes and hair, even though we were supposed to believe she had been alone on an uninhabited island for ten years. In fact, Chipwrecked regularly and repeatedly insulted my intelligence, and that's my biggest beef with it.  Nevertheless, my nine-year-old loved it.  My twelve-year-old also found it entertaining, but I suspect her real interest was in making me watch it and proving (which she did) that it's actually better than the first one.\r\n\r\nThat's true, but that's not saying much.",
            "review_date": "2012-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really bad. Had it not been for the boys I would have not sat through this. Don't watch it, please!",
            "review_date": "2012-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "my daughter I loved it!!!",
            "review_date": "2012-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OMG, this was so painful to watch!",
            "review_date": "2012-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ouch - torment all the way.",
            "review_date": "2012-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is great and epic",
            "review_date": "2012-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When an actor (David Cross) says he hated doing this movie, that it sucks, and so on... you know it's going to be a pile of garbage. Yet I still watched it for my brother's sake, it wasn't all bad, just mostly bad.",
            "review_date": "2012-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just completely awful from the start, I really think I'm done with talking animal movies.",
            "review_date": "2012-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like it but in some part I would get bored but a good movie",
            "review_date": "2012-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alvin's voices never get old but their voices were the only good thing in the movie!",
            "review_date": "2012-06-20",
            "source": "rt",
            "lang": "en"
        }
    ]
}