{
    "rating": 8.6,
    "release_date": "2011-12-20",
    "num_reviews": 370,
    "genres": [
        "Mystery&thriller",
        "Crime",
        "Drama"
    ],
    "summary": "Disgraced financial reporter Mikael Blomkvist (Daniel Craig) finds a chance to redeem his honor after being hired by wealthy Swedish industrialist Henrik Vanger (Christopher Plummer) to solve the 40-year-old murder of Vanger's niece, Harriet. Vanger believes that Harriet was killed by a member of his own family. Eventually joining Blomkvist on his dangerous quest for the truth is Lisbeth Salander (Rooney Mara), an unusual but ingenious investigator whose fragile trust is not easily won.",
    "reviews": [
        {
            "content": "Gripping and drenched in bleakness, The Girl With the Dragon Tattoo suffers from narrative imbalance, but thanks to David Fincher's astonishing direction, the darkly ruminating tone and the spellbinding performances by Rooney Mara and Daniel Craig (extra kudos to the brilliant score as well), this film is definitely worthy your time.",
            "review_date": "2023-04-22",
            "source": "rt"
        },
        {
            "content": "Is this an overlooked masterpiece? Kind of! What an impressive, entertaining, yet dark and serious and maybe not for everyone thriller. What a cast too! This movie rules, give it another look!",
            "review_date": "2023-02-21",
            "source": "rt"
        },
        {
            "content": "This movie surprised me a lot, a very well written plot with well-built characters. I really liked the synchrony between Daniel Craig and Rooney Mara, the two deliver excellent performances, and the investigation theme is worked very accurately, of course with some questionable scenes but nothing that breaks the immersion. Very good movie.",
            "review_date": "2023-02-02",
            "source": "rt"
        },
        {
            "content": "This is probably the closest we'll get to knowing what a Bond film directed by David Fincher would look like. It probably suffered on original release from following so closely on the heels of the excellent Swedish adaptation; but at more of a distance, the Fincher style does suit the dark themes - but like that earlier film, the brutal sexual assault in the film's first half is largely unnecessary at all, let alone unnecessary in terms of its graphic nature.\n\nMuted lighting, excellent cinematography and editing all contribute to the sinister tone; Craig is good, and Mara is excellent. The title sequence is a classic Fincher one and carries the sense that this will be a very particular sort of neo-Bond film. It is, of course, far more of a mystery thriller than a Bond film, but it's a shame we never got to see how Fincher and Mara would have taken the other two stories in the trilogy. All told it's a relatively minor, if interesting, entry in Fincher's filmography.",
            "review_date": "2023-01-20",
            "source": "rt"
        },
        {
            "content": "Despite a slow build up, this movie pays off with excellent characters and a thrilling plot. The twist is great, and ultimately unexpected. Rooney Mara provides a superstar performance that is well supported by Daniel Craig. A great film with great payoff.",
            "review_date": "2023-01-13",
            "source": "rt"
        },
        {
            "content": "I never expected that Daniel Craig could be so much more than Bond, but I then watched this movie and Knives Out. It's unbelievable the ideas we humans have, and the way we coordinate with others to display them.",
            "review_date": "2023-01-11",
            "source": "rt"
        },
        {
            "content": "David Fincher is such a perfectionist and that's what makes him one of my favorite directors of all time. Rooney Mara is amazing in this movie, i only could tell that it was her from her voice. Daniel Craig is amazing as well as the detective. The locations and cinematography are gorgeous, the story gripping. This feels like it is Fincher's darkest movie in some ways, I had some moments like JESUS we are really going to have to sit through this. The editing is of course perfection, as well as the sound design and mixing. I do think Zodiac, se7en and the Social Network are still a bit better, mainly because those were in some parts the same as this movie, but i have had watched earlier then this one.",
            "review_date": "2023-01-03",
            "source": "rt"
        },
        {
            "content": "Rooney Mara, Daniel Craig - the dream team. Fincher took his source material and ran with it. This is an intriguing story that is able to boast plot twists, fist-pumping revenge, beautiful landscapes, hot girls on motorcycles, good old fashioned detective work and Daniel Craig wearing glasses. What more could anyone ask for?",
            "review_date": "2023-01-03",
            "source": "rt"
        },
        {
            "content": "Wow. What a movie. Amazing performances all around. The way it was shot portrayed the vibe the story was trying to get to perfectly. ",
            "review_date": "2022-12-09",
            "source": "rt"
        },
        {
            "content": "After avoiding watching this film due to the brutality of some scenes, I finally mustered the courage to give it a shot, and I'm happy I did because The Girl With the Dragon Tattoo is another David Fincher masterpiece. The high praise and Oscar nominations were well earned. Daniel Craig and Rooney Mara were insane for going this hard, and the film's murder mystery plot was ingeniously interwoven with the other subplots. The plot twist ending was also crazy good. I definitely recommend it.",
            "review_date": "2022-12-04",
            "source": "rt"
        },
        {
            "content": "The best movie title sequence ever made!",
            "review_date": "2022-11-26",
            "source": "rt"
        },
        {
            "content": "A perfect thriller; Rooney Mara is flawless.",
            "review_date": "2022-10-15",
            "source": "rt"
        },
        {
            "content": "INTENSE, great movie just a little long",
            "review_date": "2022-10-07",
            "source": "rt"
        },
        {
            "content": "What a masterpiece! The main actress is stunning",
            "review_date": "2022-09-18",
            "source": "rt"
        },
        {
            "content": "I watched this movie for the fifth time recently. What a masterpiece! I love many of David Fincher´s movies. Se7en, Alien 3 and others. The complicated detective story is brilliant. There is a strong feminist message but in such a way that it just makes the story stronger and more interesting. \nRooney Mara is incredible in her role. This is a better and darker movie than the Swedish one with Noomi Rapace. I  am most sorry for that the other four books where not filmed by Fincher and the terrific cast. A missed opportunity for a fantastic franchise !",
            "review_date": "2022-09-12",
            "source": "rt"
        },
        {
            "content": "Film ko Mai deta hu 10 mese 0 star very funny movie 😂😂😂",
            "review_date": "2022-08-25",
            "source": "rt"
        },
        {
            "content": "David Fincher's slick, austere remake of the Swedish mystery thriller is solid but falls short of the original. Rooney Mara, in a breakout turn, can't quite match the fierce Noomi Rapace, but she puts her own brittle, damaged spin on the character. Daniel Craig doesn't try to match his castmates in affecting a slight Swedish accent, but he's good in a role that is far from Bond, a reporter who is smart enough to investigate a decades-old murder and possible cover-up but may be in over his head when facing up against European neo-Nazis. The production values have the usual Fincher touches--under-lit digital cinematography, brisk editing, the Trent Reznor-Atticus Ross ('The Social Network') score. But even if you're not familiar with the original, this isn't the gripping mystery to solve. It gets quite complicated, juggling many threads, motives, and characters, some of which gets lost on the viewer. It's also somewhat short on thrills. The best scene is a brilliantly cut silent stalking in a house, scored only by footsteps, the wind and ambient winter sound effects. It brings you the edge of your seat. Too bad the rest of this is only moderately entertaining and occasionally gripping, a lesser Fincher film",
            "review_date": "2022-08-14",
            "source": "rt"
        },
        {
            "content": "One of my all time favorite movies. Amazing performances from every single person in the cast, and the ways their stories are intertwined is beautiful and leaves you on the edge of your seat. The romance feels half assed and takes you out of the movie, but everything other than those 10 minutes of awkward Daniel Craig butt shots (although I am not complaining) is a masterpiece in raw and emotional cinema.",
            "review_date": "2022-07-23",
            "source": "rt"
        },
        {
            "content": "Difficult one to judge as the film was very watchable but also quite disturbing with the amount of violence and rape etc.  Rooney Mara totally dominated the film with her stunning performance and really should have been given an oscar.  I wondered what things dwelt in the mind of the man who wrote the book",
            "review_date": "2022-06-19",
            "source": "rt"
        },
        {
            "content": "This brilliant and gritty adventure through a dreary and cold Sweden was so full of suspense and mystery, I don't think I blinked throughout my entire viewing.",
            "review_date": "2022-05-06",
            "source": "rt"
        },
        {
            "content": "valeu muito a pena assistir  essa obra",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "Not quite in the top 5 of David Fincher's best films ('Se7en', 'The Social Network', 'Fight Club', 'Gone Girl' and 'Zodiac') but it does come close. And this is somebody who found a lot to like about all his films, including his lesser ones like 'Alien 3' and 'Panic Room'.\n\nDespite being often considered a remake, personally prefer to call it a second adaptation of the book. The book is a fantastic read, and as an adaptation while it is condensed and has some changes Fincher's film still adheres to the basic tone of the book as does the Swedish version. Of the two versions, the Swedish version just gets the edge for its incredible atmosphere complete with bleakness, chills, shocks and is more authentic, with Noomi Rapace burning the screen enigmatically with her presence.\n\nWhere Fincher's film improves over the previous version are in four areas. One is the production values, which are far more audacious here. The cinematography, both bleakly moody and exquisite to look at, is more cinematic and perfectly captures the frozen landscape which is like a character in itself. The film is very tightly edited too in a way that is distinctively Fincher. Trent Reznor and Atticus Ross' music score is another winner of theirs, it is haunting and gives a really unnerving vibe, combined with some clever sound mixing. The script, even when condensed, is more polished and tighter and also has more flow. While Lisbeth is a fascinating and complex character in the Swedish film, the Lisbeth in Fincher's film has even more complexity and more variation of emotions.\n\nFincher's direction is exemplary, showing a mastery of visual style and mood setting, ensuring that the film stays intriguing throughout the length. In lesser hands and with less assured pacing, with the long running time 'The Girl with the Dragon Tattoo' could have been a long haul but had plenty of intrigue. Much of the storytelling is gripping, and while not as authentic or quite as masterful in atmosphere like the Swedish counterpart was it has its fair share of chills, twists and turns (without being convoluted or illogical) and shock value as well as a murky bleakness. Contrary to what some believe, this second adaptation did have point (was fearing it wouldn't), as it made the story more accessible and gave it more exposure.\n\nGood acting helps. Daniel Craig is very wisely restrained, the character should have a quiet determination and dignity which Craig handles very well. Christopher Plummer is simply terrific as well, one of his best performances in recent years, while Stellan Skasgard is frighteningly demented and Yorick van Wageningen is unsettlingly sadistic. Robin Wright does her best with a shallow character. Best of all is a magnificent Rooney Mara, such a multi-layered performance and sees Mara not just playing the role but disappearing into it. See her appearance for example, so committed that when you see her in other films you would not believe that it's the same person.\n\nThere are faults however. Did not think much of the Gothic James Bond-like opening sequence that just felt jarring and out of place. Nor with the accents, which were a mix for some of the actors of having one too heavy or thick (Wright) or not attempting one at all (Craig). The decision to use both English and Swedish in some scenes did have a tendency to confuse, while the central relationship (mostly successfully done) did feel underdeveloped and, even for characters that are the heart of the story, takes over the story a little too much somewhat.\n\nAll in all, almost as good as the Swedish version and better than both of that film's heavily flawed but still worthy sequels. 8/10 Bethany Cox",
            "review_date": "2022-03-02",
            "source": "rt"
        },
        {
            "content": "This may not go down as one of Fincher's greatest achievements and the Swedish version may also be revered in higher regard, but there's lot to enjoy still.\n\nThe performances from all involved are exactly what you'd expect, the film has top class actors, Daniel Craig, Rooney Mara, Christopher Plummer and Stellan Skarsgaard. But it's Mara's performance that captivated my attention throughout the film, she is excellent as Lisburn Salander, the troubled computer hacker whom Criag's character, Mikael, hires to assist with the investigation. She brings a quite intensity that slowly builds up as the film progresses, leading to a climax I thought reflected her whole journey in the film.\n\nThe performances are aided by a solid script from Steven Zaillian. Usually this is the case with Fincher's films, think of Fight Club and The Social Network as prime examples. The cinematography from Jeff Cronanweth is equally immersive as he manages to stylistically combine the dull Scandinavian landscapes with the films menacing narrative.\n\nThe films pacing is perhaps the consistent Achilles heel, particularly in the opening half of the film, but overall it wasn't a huge distraction\n\nI truly enjoyed this adaptation, Fincher is without one of the great American filmmakers there has been, while this won't stand at the top, it can still be appreciated and stand alongside others in his ever growing filmmaking memoir.",
            "review_date": "2022-02-25",
            "source": "rt"
        },
        {
            "content": "87/100 --------------",
            "review_date": "2022-02-22",
            "source": "rt"
        },
        {
            "content": "It's a great movie with superb acting, and you should definitely watch it. That said, the sex and violence scenes felt like they were written from a male-fantasy perspective, with overtly explicit imagery, and \"what a guy would think a girl would feel / do\" - which wasn't as bad as it could be due to Rooney Mara's fantastic performance. The villain felt like the caricature of a cliche, but that happens very late into the story, so the impact is kinda reduced. Still, overall a good movie.",
            "review_date": "2022-02-16",
            "source": "rt"
        },
        {
            "content": "A brutal investigation movie which hits you hard. The character arc is amazing especially for Lisbeth (played by Rooney Mara). When Mara grows with the role, I found Craig's character very flat and lack of focus. I did not read the novel behind the movie and I did not watch the previous Sweden made movie. Therefore, I cannot do any comparisons. It is a good movie to watch if you are after a good story and very well portrayed investigation scenes.",
            "review_date": "2022-01-08",
            "source": "rt"
        },
        {
            "content": "Much like it's forebear ( Noomi Rapace), it's exceptionally well done, with some excruciating violence, but that was the point of the books in the first place. Unfortunately, any attempt at further outings, for the following books, have fell lamentably short. If only Lizbet could be resurrected by someone who cared about the character as much as me ?",
            "review_date": "2021-12-28",
            "source": "rt"
        },
        {
            "content": "A brutal film that is the result of a great cast, tone, score, and cinematography.  Rooney Mara is excellent in accenting a world where succinct moments of loyalty coexists with constant trials of betrayal.",
            "review_date": "2021-12-01",
            "source": "rt"
        },
        {
            "content": "If ever a film needed a warning rating for brutal violence and rape scenes, this one did. Why does it have no rating at all?",
            "review_date": "2021-11-21",
            "source": "rt"
        },
        {
            "content": "the issue here is that the original Swedish version is superior to this (basically) frame by frame American remake... i hate when they do this... However, Rooney Mara proved herself  to be one of the best American actors of her generation!",
            "review_date": "2021-11-10",
            "source": "rt"
        },
        {
            "content": "The mystery pulled me from the very beginning and kept its hold until the very end.",
            "review_date": "2021-10-31",
            "source": "rt"
        },
        {
            "content": "Just super made. Too bad that the other two parts were not filmed with Daniel Craig.",
            "review_date": "2021-10-29",
            "source": "rt"
        },
        {
            "content": "Despite an ostensibly better director and actors and a bigger budget this only manages to be workmanlike copy that doesn't add anything to the superior 2009 Swedish original, which I recommend instead.",
            "review_date": "2021-10-22",
            "source": "rt"
        },
        {
            "content": "Movie Rating: 8.5/10",
            "review_date": "2021-08-30",
            "source": "rt"
        },
        {
            "content": "After reading the book, this movie disappointed.  Plot points and characters were cut,  and the movie left more than a few loose ends. The climax of the movie has no resolution or explanation. I was bored throughout most of the film.",
            "review_date": "2021-08-26",
            "source": "rt"
        },
        {
            "content": "The Girl with the Dragon Tattoo movie is better than the book. I enjoyed the twist that surprised people going in thinking they know the story. The movie certainly has more style than the book and made the wise decision to downplay Mikael Blomkvist's off-putting affairs, but both are too enamored with the Lisbeth Salamander character.",
            "review_date": "2021-08-19",
            "source": "rt"
        },
        {
            "content": "Extremely long and in places horrifying thriller with a top notch cast and direction. I'd go so far as to say it's one of the rare occasions where the remake is better than the original and would have loved to have seen more of these characters from David Fincher.",
            "review_date": "2021-08-14",
            "source": "rt"
        },
        {
            "content": "Man that I love Fincher. He perfectly made justice to my favorite book of my favorite trilogy. The cinematography is sublime just like always. I just love his style. Gory, dark but still very enjoyable and beautiful. For exemple, the images of Sweden during winter with the wind and everything. It was a cake for my eyes. The music was also good and the acting too. It would have been nice to see a film for the other two films of the trilogy BY FINCHER.",
            "review_date": "2021-08-06",
            "source": "rt"
        },
        {
            "content": "I liked the film when the mizze was alive, but when the mizze died my disappointment was immeasurable and my day was ruined.....",
            "review_date": "2021-07-31",
            "source": "rt"
        },
        {
            "content": "A master filmmaker making great pulp, what's not to love?",
            "review_date": "2021-07-27",
            "source": "rt"
        },
        {
            "content": "This movie is a meticulously, even beautifully handcrafted telling of a story so grim, gritty, sordid, and vile that it doesn't merit being told. It's remarkable how good the film-making is, being one of the only movies that makes long-form research genuinely compelling, interesting, and even gripping. But there's no redeeming value to the story's conclusion, no satisfactory result that makes the slough of watching the story unfold worth having been watched. Daniel Craig's accent goes in and out (mostly out), but it barely rates mentioning against the mountain of other flaws in the film.\n\nContent warning: female nudity, graphic sex, rape\n\nClosest comparison: It's like Dolores Claiborne (1995) by way of Se7en.\n\nSetting: Police Procedural\nPlot: Detective\nTone: Psychological Horror",
            "review_date": "2021-07-22",
            "source": "rt"
        },
        {
            "content": "I wish you all just shut up and realized that Fincher just makes movies about the upper class that take them, and their circus of a lifestyle, way too seriously.",
            "review_date": "2021-07-19",
            "source": "rt"
        },
        {
            "content": "The Girl with the Dragon Tattoo is a gripping film from the first moment to the last, making its long runtime an asset rather than a hindrance. Mara really does some of the best work that I have seen from her. Her transformation from a small role in The Social Network to this is remarkable. Although I found some scenes of hers wooden, the guarded nature and enigma of Lisbeth eventually wins out. Daniel Craig, reliable as ever, also adds depth to Mikael, even if his method of simply toning down a British accent starkly contrasts to Mara's more concretely Swedish take. The presence of talented supporting stars such as Skarsgard, Plummer, and Wright deepens the acting capabilities on display, although the Western stars might have attracted the ire of Swedish purists. Above all, Fincher offers up an engaging visual outing and the dark, unforgiving source material is delivered with aplomb. Some of the more racy scenes will have alienated many, but I found it an important step in establishing the character of Lisbeth and developing the dual aura of both vulnerability and danger present in her actions. With this outstanding combination of performance and characterisation, this film cannot be missed.",
            "review_date": "2021-07-14",
            "source": "rt"
        },
        {
            "content": "A crime thriller by David Fincher. A disgraced journalist worked with an investigator to solve the case of the disappearance of a girl. \n\nWhat I liked about the movie was it's dark atmosphere. There was never a happy or colorful moment. This grim nature made sense, considering the disturbing circumstances surrounding the case.\n\nAlso, the girl with the dragon tattoo had a sad backstory, and in the first half something disturbing and abusive happened to her. However, she was smart and her retaliation was even more brutal, making her character interesting. \n\nThe case itself was not bad. However, I didn't feel much tension that would hook me into the story. When the twist was revealed, it was disturbing but also anticlimactic. The relationship between the girl and the journalist wasn't interesting or worth investing in. \n\nOverall, it's a good thriller but I wanted more. 7/10",
            "review_date": "2021-07-11",
            "source": "rt"
        },
        {
            "content": "Very bloated and long. Part Knives Out without the humor. Part Seven without the intensity. Part Tinker Tailor Soldier Spy with similar deliberate pacing.\n\n Awesome Rooney Mara performance. Through body language and facial expression, she really succeeds in establishing the character as a closed off, unattached, and isolated loner with emotional scars for days.",
            "review_date": "2021-07-09",
            "source": "rt"
        },
        {
            "content": "It's a who done it type movie with a good story. I expected part of the ending but not all of it, the part I didn't expect was something that I never would've thought about. Character relationships weren't super forced and almost felt natural. There were parts of the movie that seemed unneeded and just added to the already super long runtime but whatever. There was good character development and arcs. And the actors were really good. It's a long one but definitely recommend watching.",
            "review_date": "2021-07-05",
            "source": "rt"
        },
        {
            "content": "Rooney Mara is spectacular; and David Fincher shows he's one of the finest directors working today.",
            "review_date": "2021-06-14",
            "source": "rt"
        },
        {
            "content": "The original trilogy is great and this remake of one is well done. Great acting and casting and the story is good investigative work. The only flaw is the almost supernatural efficiency of the girl.",
            "review_date": "2021-06-12",
            "source": "rt"
        },
        {
            "content": "This movie worth to watch it again in order to get some details not perceived before knowing the outcomes of the investigation. Altough I consider it's well adapted from the book, there are some things that were a bit forced. If you like the movie, the book is a must read.",
            "review_date": "2021-04-22",
            "source": "rt"
        },
        {
            "content": "Daniel Craig is great but Rooney Mara is brilliant ! Her facial reaction when Craig's character asks her \"I want you to help me catch a killer of women\" draws goosebumps. And when she asks later  \"May I kill him? \", you know you've got something better than a Marvel superhero. Mara was Oscar nominated for Best Actress for the movie.",
            "review_date": "2021-04-19",
            "source": "rt"
        },
        {
            "content": "I'm biased because I love all Fincher films. Or maybe all of his films are simply amazing.",
            "review_date": "2021-04-12",
            "source": "rt"
        },
        {
            "content": "It's exploration of violence against women may lean to be too cruel for some viewers, but The Girl with the Dragon Tattoo is better for it and handled extremely well by David Fincher's somber direction and captivating performances by Rooney Mara and Danial Craig.",
            "review_date": "2021-04-08",
            "source": "rt"
        },
        {
            "content": "I really rate the Swedish versions, I felt like another version wasn't needed, but I loved this. \nRooney is the perfect Lisbeth. Fincher knocked this out the park. I would like to see the rest of the trilogy completed.",
            "review_date": "2021-04-06",
            "source": "rt"
        },
        {
            "content": "Lisbeth warmed up to me the closer we got to the credit roll, which is ironic in itself, given that she has to learn how to work with someone for the first time.",
            "review_date": "2021-04-05",
            "source": "rt"
        },
        {
            "content": "One of my favorite films, David Fincher's adaptation of The Girl with the Dragon Tattoo adds a fresh new spin on the source material written by Stieg Larsson. Rooney Mara is captivating as the brilliant but deeply troubled Lisbeth Salander. Daniel Craig strikes the perfect note as the respectable but not necessarily likeable Mikael Blomkvist, while Stellan Skarsgård is remarkly convincing as the suave but sinister Martin Vanger. Fincher does everything in his power to ensure the audience understands what is going on and beautifully connects the characters' separate lives into one storyline as the film progresses. While some viewers may find more than one scene of the film to be distressing, for those who can handle it, The Girl with the Dragon Tattoo is a very worthy watch.",
            "review_date": "2021-04-02",
            "source": "rt"
        },
        {
            "content": "Excellent thriller.  Just watch it.",
            "review_date": "2021-03-31",
            "source": "rt"
        },
        {
            "content": "I never thought I'd say this but Se7en was more pleasant.\n\nThis film made me feel so so so so so uncomfortable. But well, that's David Fincher for you. Like most of his films, this too was a brutal amalgamation of dark elements. It keeps you glued to the edge of your seat throughout its length. Daniel Craig proves that he shouldn't just be considered as the \"guy-who-plays-James Bond\". He delivers a very good performance and informs us of his talent and worth. Stellan Skarsgard was equally good in his limited role, which (in my opinion) seemed to parallel John Doe from Se7en. But I think everyone who watches this film will unanimously agree that Rooney Mara was the standout. She gives an absolutely brilliant, ruthless performance showcasing a complex, antisocial character with a dark past.\n\nThe sound design and score were amazing and manage to complement the dark tone of the storyline perfectly. So does the dark-ish lighting which is very commonly observed in Fincher's films .",
            "review_date": "2021-03-17",
            "source": "rt"
        },
        {
            "content": "Of course the book is better but this movie adaptation I think is excellent. I enjoyed getting to know the characters many layers. I thought it moved along at a very brisk pace and did a good job of keeping me engaged throughout the movie. I did also enjoy the complicated ending.",
            "review_date": "2021-03-16",
            "source": "rt"
        },
        {
            "content": "Solid caper with twists. I hadn't read the novel so it was full of suspense and discovery for me. Great cast really tells this story well.",
            "review_date": "2021-03-13",
            "source": "rt"
        },
        {
            "content": "The rape scene was exploitative and brutal, the sex scenes gratuitous and totally unnecessary for either character or plat development, and the ending was a head-scratching nothing. Good acting, good cinematography, but ultimately it felt like a total waste of time.",
            "review_date": "2021-03-11",
            "source": "rt"
        },
        {
            "content": "The Girl with the Dragon Tattoo is a weaving, complicated, and at times difficult watch. However, one very careful viewing or a repeat viewing to catch its many details is ultimately quite rewarding. David Fincher's adaptation didn't quite hit me the same way the 2009 Swedish film did, but it is without a doubt the sleeker of the 2 movies. It is admittedly difficult to follow at times as there is so much packed into an already long 2.5 hour watch, but in essence, the story is simple enough in the end that missing a few details will not ruin the experience. This movie is rarely \"fun\" to watch and is quite the opposite for a few scenes, but it is rife with intrigue and kept me glued to the screen as the mystery unravels.",
            "review_date": "2021-03-09",
            "source": "rt"
        },
        {
            "content": "Good story, acting, characters. Didn't like the sound design, too distracting.",
            "review_date": "2021-03-06",
            "source": "rt"
        },
        {
            "content": "Remarkably captivating. Often dark and lurid, always interesting.",
            "review_date": "2021-03-03",
            "source": "rt"
        },
        {
            "content": "In my opinion Falls into the top ten thrillers of all time, Excellent",
            "review_date": "2021-02-24",
            "source": "rt"
        },
        {
            "content": "This movie is actually great! Daniel Craig and Rooney Mara give amazing performances. The movie is creepy and mysterious.",
            "review_date": "2021-02-24",
            "source": "rt"
        },
        {
            "content": "I very much enjoyed it. Great atmosphere and characters. Tense at times but thilling. A great ending!",
            "review_date": "2021-02-01",
            "source": "rt"
        },
        {
            "content": "David Fincher's film was fun til it wasn't, capped by a horrible ending that isn't satisfying.  As a stand alone project, it's fine, but this viewer could see the ending a mile away.  I really enjoyed the ride, but there are serious flaws.  So it's a mixed bag.  Final Score: 7/10",
            "review_date": "2021-01-29",
            "source": "rt"
        },
        {
            "content": "VERY watchable & well done film. every bit as good as when it first came out.",
            "review_date": "2021-01-29",
            "source": "rt"
        },
        {
            "content": "This was a great movie well worth the watch",
            "review_date": "2021-01-29",
            "source": "rt"
        },
        {
            "content": "Hard to watch at certain points for sure, but being a big Daniel Craig fan, this movie for sure satisfies! Felt like a James Bond mystery movie!",
            "review_date": "2021-01-28",
            "source": "rt"
        },
        {
            "content": "An incredible adaptation of Larsson's first Millennium novel. Faithful to the book while Fincher is able to flex what he's best at. It's a shame Sony didn't bring him and the cast back for a sequel.",
            "review_date": "2021-01-26",
            "source": "rt"
        },
        {
            "content": "Lisbeth's personality is bland and one dimensional that it alienates the audience from her.  We have trouble being concerned over Harriet because we don't get much screen time with her.  And we're not worried about the serial killer because we only find out about his murders through newspaper clippings.  The whole thing leaves the audience desensitized.",
            "review_date": "2021-01-25",
            "source": "rt"
        },
        {
            "content": "Unless you are very bored, let me save you 2 1/2 hours. If you like this great cast, you can find them all in better movies. This film batters you with one unnecessary brutality after another until you finally reach the end to find, well, nothing. The ‘payoff’ is not worth the investment.",
            "review_date": "2021-01-24",
            "source": "rt"
        },
        {
            "content": "believe me...i love daniel craig...BUT I LOVE HOW AWESOME ROONEY MARA IS AS LISBETH SALANDER!!!!!!! MORE OF THAT PLEASE",
            "review_date": "2021-01-24",
            "source": "rt"
        },
        {
            "content": "The Girl with the Dragon Tattoo is an extremely well made, often mesmerizing, well acted, but ultimately excessive film. The mystery storyline with Daniel Craig is fascinating, and once Rooney Mara's character joins with him it gets even better. But this movie isn't paced well, and contains some unbelievably disturbing content that simply goes too far. I'm a horror movie junkie, I watch a lot of violent and intense content. The rape scene was excessive, exploitative, gross and horrific to watch. We would have more than understood the gravity of what happened if he had unzipped his pants, she screamed, and then it cut away. Instead we get an agonizingly long 5 or so minutes of pure nastiness. It doesn't make the story any better, and it just feels mean spirited, excessive, and over the top. I give credit to Mara's acting ability for selling the scene so well, which is a big part of what makes it so awful to watch. But I really question Fincher's judgement in putting this in the film. It ultimately distracts from what is mostly a very compelling storyline, instead of discussing the great performances, cinematography, and thrilling intrigue- I'm willing to bet most viewers of this movie will simply remember it for this one scene, which is disappointing. It goes too far in several other places (her revenge scene is equally nasty, but not nearly as disturbing as he clearly deserves it while she was an innocent victim). There was no reason for this movie to be almost 3 hours, cut out something like 45 minutes (especially cutting out the exploitative content) and you would have a tight, sharp, thrilling crime story.",
            "review_date": "2021-01-22",
            "source": "rt"
        },
        {
            "content": "David Fincher's \"The Girl with the Dragon Tattoo\" is an ambitious, gripping and suspenseful thriller that offers a fresh interpretation of Stieg Larsson's beloved book. With his ninth feature, director David Fincher crafted a mesmerizing murder mystery that showcased his sick strengths as a filmmaker. Using captivating cinematography, Fincher draws viewers into the world of two dedicated detectives that investigate the mysterious murder of a wealthy family. From intimate close-ups to tense long shots, the cinematography keeps viewers immersed in the film's gothic setting. Fincher showcases immense control over craftsmanship, proving to be an expert at building a suspenseful mood and atmosphere. Steven Zaillian's screenplay is also sensational, and expertly uses clever narrative twists to keep viewers absorbed in the murder mystery. It is hard to not admire the astonishing performances from the cast. Rooney Mara delivers one of the best performances of her career as Lisabeth Salander. With mesmerizing expressions, she conveys the angst, loneliness and introverted persona of an eccentric computer hacker that struggles to fit in with societal norms. Daniel Craig is equally excellent in the role of an obsessive detective that is determined to solve a mystery. He imbues layers of humanity into what could have otherwise been a one-dimensional character. Although \"The Girl with the Dragon Tattoo\" is undeniably a taut literary adaptation, ultimately it is not a flawless film. If there's a minor drawback to the movie, it suffers from a lengthy running-time. At nearly three hours, it tests the viewer's patience and may have benefitted from a tighter cut. Nevertheless, fans of the beloved book will definitely enjoy \"The Girl with the Dragon Tattoo\" and so will movie-goers seeking exhilarating entertainment. At a time when American audiences have never been exposed to the Swedish book, it's a stirring reminder that stories of foreign female detectives are worth adapting to the big-screen.",
            "review_date": "2021-01-19",
            "source": "rt"
        },
        {
            "content": "Rooney Mara and Daniel Craig are a sensational duo in this sleek and brutal mystery masterfully directed by one of the best and most unique filmmakers of our time: David Fincher.",
            "review_date": "2021-01-16",
            "source": "rt"
        },
        {
            "content": "I hate to have to give this movie a rating as low as a 6/10. Most of the movie was pretty good; the cinematography was good, the actors were really good (especially the actress who played Lisbeth), and the mystery was good also. However, the movie ended horribly. While the twist was decent, the way it was executed wasn't. The movie has a weird section at the end also, before having an unsatisfying last minute ending. Some of it made sense, but it also felt wasted. There's one scene near the beginning where Christopher Plummer mentions all of his family in detail as suspects, but the movie barely shows them, lessening the possibilities of the mystery. Also, another huge problem, without spoiling the movie, Rooney Mara and Daniel Craig meet up way too late in the story.",
            "review_date": "2021-01-13",
            "source": "rt"
        },
        {
            "content": "I truly fell in love with Lisbeth's complex personality. There was so many layers and interest facets about her character. Roony Mara truly nailed Lisbeth Salander character so amazingly. She is so incredibly talented in the film.  Not mention that she was absolute gothic gorgeous.",
            "review_date": "2021-01-11",
            "source": "rt"
        },
        {
            "content": "The terrific novel was done once in film, beautifully, but this is nearly as good.",
            "review_date": "2021-01-06",
            "source": "rt"
        },
        {
            "content": "A masterful remake by David Fincher to an already fantastic film. Daniel Craig and Rooney Mara are on screen powerhouses",
            "review_date": "2021-01-05",
            "source": "rt"
        },
        {
            "content": "Very good and shocking movie. \nGreetings again from the darkness. The character of Lisbeth Salander absolutely fascinates me. That's true whether we are discussing Stieg Larsson's Millennium trilogy novels, the Swedish film versions, or this latest film version from director David Fincher and a screenplay from Steve Zaillian. It's also true whether Lisbeth is played on screen by Noomi Rapace (Swedish films) or Rooney Mara. She is a brilliant character hiding in plain sight from a world that has fiercely mistreated her, and now misjudges and underestimates her. She is the oddest heroine I can recall ... and I can't get enough of her.\n\nLet's start with the source material. Stieg Larsson's books are far from perfect, but addictive just the same. The first book (on which this film is based) is, at its core, a simple who-dunnit presented in a manner that is claustrophobic, paranoid and eerie. Moving on to this particular film, we find the director and screenplay holding the basic tone while making a few changes ... some minor, others more substantial. These changes may irk those fans who are a bit more loyal to the books, but Fincher surely wanted to offer more than a simple re-telling of the story.\n\nDaniel Craig plays Mikael Blomkvist, the journalist hired to solve the 40 year old mystery of the disappearance/murder of Harriet Vanger, niece to Swedish millionaire Henrik Vanger (Christopher Plummer). To research, Blomkvist must dig into the Vanger's rotten family tree of Nazis, anti-Semites, sexual predators, anti-social fanatics, and a few just plain loony birds. You can imagine how excited this rich and once powerful family is to have someone uncovering long buried secrets. Circumstances allow for Lisbeth to assist Blomkvist in researching this.\n\nUnlike many mysteries where assembling the clues is the most fun, the real heart of this story is the odd, somewhat uncomfortable developing relationship between Blomkvist and Lisbeth. This latest version allows this to develop relatively smoothly, but it nonetheless rattles our senses. We see the subtle changes in Lisbeth as she slowly opens up to the idea of a real friendship based on trust. Fear not mystery fans, the Vanger clan still provides more than enough juice to keep any film sleuth happy.\n\nIt's truly impossible to avoid comparisons between the two movie versions and the respective casts. It's quite obvious Mr. Fincher was working with a substantially greater budget than Niels Arden Opler had for the first Swedish film. While they are both enthralling, I actually lean a bit towards the rawer original. That takes nothing away from this latest version. Same with Noomi Rapace vs. Rooney Mara. Ms. Mara is excellent in her performance and I was fully satisfied, but Ms. Rapace brought a rougher edge to the role ... one that made it even tougher to crack that shell. The biggest difference in the casts is Daniel Craig against Michael Nyqvist. Mr. Craig is just a bit too cool for the role, while Nyqvist captured the insecurity and vulnerability that Larsson wrote about.\n\nAll of that is nit-picking. Both film versions are sterling entertainment and hopefully the Fincher version will bring the story to a much wider audience. I would encourage those that are interested to check out the Swedish version, as well as the Larsson books. Maybe that will explain my fascination with this creature known as Lisbeth Salander. 8.5/10",
            "review_date": "2020-12-24",
            "source": "rt"
        },
        {
            "content": "I don't know which review to give so there are two: 1. By the 20 minute mark I felt like I had already seen a whole film. And by the end I felt like I'd seen and entire film series. 2. I've never felt so happy to feel so icky.",
            "review_date": "2020-12-15",
            "source": "rt"
        },
        {
            "content": "Brilliant movie from A-Z. One of the best thrillers ever.",
            "review_date": "2020-12-12",
            "source": "rt"
        },
        {
            "content": "I loved this movie. If you like dark mystery thrillers this one is a must see, it is a little sick at times so if you don't like that kind of stuff you probably won't like this movie, with that being said, I think this movie is absolutely flawless. I find myself wanting to change parts of movies or predicting plot points or endings too often and this was not one of those times, this movie really did a good job with plot twists that are unexpected. The last thing I would like to mention is that I think this is one of the most well written mystery thriller movies I have ever seen, if those are typically movies you enjoy, I think you will love this!",
            "review_date": "2020-12-05",
            "source": "rt"
        },
        {
            "content": "Since Fincher began making movies the expression \"this director is in complete control of his craft\" has become suitable for only one director.",
            "review_date": "2020-10-11",
            "source": "rt"
        },
        {
            "content": "Una thriller espectacular como siempre ha hecho David Fincher, aunque este siendo un poco mas pesado que otros y algo mas largo de lo que debería de ser, por aparte tenemos una historia enganchante y una muy buena actuación de Rooney Mara",
            "review_date": "2020-10-11",
            "source": "rt"
        },
        {
            "content": "It was really slow. It took almost an hour for something interesting to happen. The story was interesting but it was too drawn out for me.",
            "review_date": "2020-10-02",
            "source": "rt"
        },
        {
            "content": "OOPS! Rated this movie based on the original Swedish language film. I've never seen the English language version, disregard this rating/review.\n\nThis is a foreign language (Swedish) film with subtitles. Subtitles aren't an issue for me but I know they are for lots of movie goers.  This is an excellent who-done-it psychological thriller and in my opinion working through the subtitles is well worth the effort. This film follows the book closely.  As always when adapted from a book the film leaves out a little detail concerning character motivation and psychology. In The Girl With the Dragon Tattoo the book/film discrepancy is minimal but if you haven't read the book see the film first.",
            "review_date": "2020-10-02",
            "source": "rt"
        },
        {
            "content": "Excellent adaptation with exceptional performances. ",
            "review_date": "2020-09-19",
            "source": "rt"
        },
        {
            "content": "It's far too long, but it's impossible for just about any to watch The Girl with the Dragon Tattoo and not be intrigued.",
            "review_date": "2020-09-11",
            "source": "rt"
        },
        {
            "content": "Just saw this on cable the other night and am still bummed they never continued with the trilogy! Rooney Mara was fantastic. And she and Daniel Craig were inspired casting together.",
            "review_date": "2020-09-03",
            "source": "rt"
        },
        {
            "content": "Another film I wish could have performed better for as great as it truly was.",
            "review_date": "2020-09-01",
            "source": "rt"
        },
        {
            "content": "A dinâmica entre os protagonistas é muito bem feita. O personagem do Daniel Craig nos chama atenção só apenas pela sua trama, que o incentiva a aceitar o trato. Já a personagem de Rooney Mara possui uma introdução riquíssima, que deixa bem claro do que ela é capaz e apenas um pouco do que ela passou. O fato dela estar alinhada com o Mikael desde o início me deixou surpreso também.\n\nOs personagens tem uma construção quase que meticulosa, com muita personalidade e diálogos bem reais. Devo dar o mérito ao elenco, que de forma geral está ótimo. A tensão construída é muito bem mantida até o ápice, que não deixa a desejar. O incômodo da cena da quase execução vem de uma angústia inexplicável.\n\nNo fim das contas, a obra termina deixando os pontos bem amarrados e isso por si só já é um grande mérito pela complexidade da trama.",
            "review_date": "2020-08-22",
            "source": "rt"
        },
        {
            "content": "Convoluted and contrived story Daniel Craig's climbing of, and eventual falling from, the dysfunctional family tree.",
            "review_date": "2020-07-11",
            "source": "rt"
        },
        {
            "content": "Having seen a lot of Fincher's work, and being impressed with most of it, I've gotta say 'The Girl With The Dragon Tattoo' is the most disappointing film of his I've seen yet.  The first 15 or so minutes which introduces the titular characters, and the last 45 minutes with its plot reveals, are the best portions garnering genuine interest, mystery and intensity.  Everything in the middle however is just dull and long-winded.  I'm usually amazed by Fincher's cinematography and plot twists, but neither one of these blew me away here.  I've never read the novel this movie is based on, so whether or not this adaptation (also a remake) was accurate is irrelevant to me.  What I do know is that, once again, this is another film where the length is wholly unjustified.  A detective thriller about a cold case murder does not need to clock 20 minutes shy of 3 hours in order to be entertaining.  This could've easily been at the most 2 hours, maybe 2 and 15, without losing anything significant in the way of storytelling and subplots.  The performances were very good, and the opening Bond-esque title sequence was pretty badass.  Despite these qualities however, the flaws severely hold the movie back from being one of Fincher's greats.  I also hated the abrupt ending.  She sees Craig with his girlfriend, is heartbroken, drives off in her motorcycle, then *boom* roll credits?  Lame.  This was a rather pedestrian effort from a usually great filmmaker.",
            "review_date": "2020-07-11",
            "source": "rt"
        },
        {
            "content": "The two stories happening simultaneously felt well paced and it really builds an intrigue and a desire to know what will happen next. There are a couple of points where it drags in the second half, but overall worth watching.",
            "review_date": "2020-07-08",
            "source": "rt"
        },
        {
            "content": "Brilliant who done it. Perfect story, perfect acting, perfect cinematography. A top 10 21st century movie:)",
            "review_date": "2020-06-05",
            "source": "rt"
        },
        {
            "content": "recomendable pelicula,pasada en el libro 7/10",
            "review_date": "2020-05-23",
            "source": "rt"
        },
        {
            "content": "wasn't a bad movie at all, wish they would have made more.",
            "review_date": "2020-05-18",
            "source": "rt"
        },
        {
            "content": "An surprisingly excellent adaptation of stieg Larsson's iconic novel, it translates well the brutality and captivation of its source material, and showcases David Fincher's masterful direction and rooney Mara's great talent as a lead actress.",
            "review_date": "2020-05-12",
            "source": "rt"
        },
        {
            "content": "Before starting this review, it is important to state that I have never read the original books or seen the original Swedish films for this franchise. As far as this American remake from 2011 goes, \"The Girl with the Dragon Tattoo\" is a solid investigative thriller. I really like good mysteries and I thought this one did a good job keeping my interest. The movie is pretty long, but for the most part, I was very engaged. I thought the movie was very gritty, which as far as I know is pretty true to the source material. However, I think someone like David Fincher who is no stranger to dark subject matter lends a strong hand to a movie like this behind the camera. I also thought the performances were very good on screen, particularly Rooney Mara in the main role. The disturbing material in the movie is even more impactful due to the excellent performances. The mystery kept me on the edge of my seat but everything in the main story wraps up when there is one whole sequence left in the movie. I get that the movie probably had franchise plans, and I hope we do get to see them someday from the same team, but the last scene in the movie feels kind of abrupt and out of place. Nonetheless, I think if you like mysteries or movies that aren't afraid to get dark and disturbing, this is a solid choice.",
            "review_date": "2020-05-06",
            "source": "rt"
        },
        {
            "content": "It’s a pretty good movie just watch it ",
            "review_date": "2020-04-26",
            "source": "rt"
        },
        {
            "content": "Wonderfully written, very believable great actress.",
            "review_date": "2020-04-18",
            "source": "rt"
        },
        {
            "content": "Too graphic and gritty for my taste. It is far too long and never captures your interest. I didn't really connect with Lisbeth Salander. She's kind of scary. (First and only viewing - 3/26/2020)",
            "review_date": "2020-03-26",
            "source": "rt"
        },
        {
            "content": "Engrossing at times but given its length not always.  Eponymous heroine is ably abetted by relatively hapless Daniel Craig (certainly no 007 in this one).  Also evokes Sweden magnificently, usually cold and dark.  Great cameos (Plummer, Richardson, Jarvis) of merit in moving the plot on amidst a few longueurs. This was thus a 3.5 star review.",
            "review_date": "2020-03-26",
            "source": "rt"
        },
        {
            "content": "Mara's acting is something else",
            "review_date": "2020-03-15",
            "source": "rt"
        },
        {
            "content": "A unique and entertaining crime/mystery plot with great acting, cinematography, editing, and a nice soundtrack. It succeeds at being disturbing and interesting. However, the hacking was represented unrealistically like in most films.",
            "review_date": "2020-03-11",
            "source": "rt"
        },
        {
            "content": "A very interesting film about a girl who can get any personal data in a few minutes. It brings up certain thoughts, after watching it I decided to use Utopia p2p, so as not to risk it. But in general, a very interesting film, only those who are afraid of scenes of violence will not like it.",
            "review_date": "2020-02-26",
            "source": "rt"
        },
        {
            "content": "The Girl With the Dragon Tattoo is an excellent film. It is about journalist Mikael Blomkvist is aided in his search for a woman who has been missing for forty years by Lisbeth Salander, a young computer hacker. Daniel Craig and Rooney Mara give fantastic performances. The screenplay is well written. David Fincher did a great job directing this movie. I enjoyed watching this motion picture because of the drama and mystery. The Girl With the Dragoon Tattoo is a must see.",
            "review_date": "2020-02-08",
            "source": "rt"
        },
        {
            "content": "Psychological thriller remade with Daniel Craig as Mikael Blomkvist. Henrik Vanger wants to know what happened to his grand niece Harriet. Rooney Mara as Lisbeth Salander works with Mikael to uncover what has happened to Harriet. It gets murkier and murkier diggings up more dirt.",
            "review_date": "2020-01-18",
            "source": "rt"
        },
        {
            "content": "About a 92%. Moved it to a 5 star after the second watch. Lisabeth is super bad ass in her vengeance against the creep who raped her and throughout the movie. The connection between Daniel Craig and Lisabeth is unique. Great suspense and mystery story. Also a touching moment at the end when Henrik sees Harriet again",
            "review_date": "2020-01-12",
            "source": "rt"
        },
        {
            "content": "Like Seven this movie is dark but brilliant",
            "review_date": "2019-12-28",
            "source": "rt"
        },
        {
            "content": "As I write this, the RT critics and audience scores are the exact same at 86 each. The title sequence produced by Atticus Ross and Trent Reznor, throw you right into this movie with a solid cover of Zeppelin's \"Immigrant Song\" by the Yeah Yeah Yeahs' Karen O. In fact, the entire soundtrack is fantastic and throughout college it was one of my regular \"study\" playlists. Speaking of college, I had a huge crush on Lisbeth Salander when I first saw this movie, and although that magic may be gone, Mara still provides a wonderful performance I don't think she gets enough credit for. Mara is at her best when she's getting revenge — horrifying scenes you can't help but smile. Even though this movie keeps going well after most others would roll credits, it does so in a good way. While I rarely require a happy ending, I would've liked to see Lisbeth and Mikael end up together, continuing that unusual relationship. One issue I had with the movie was when Lisbeth asks Mikael if she can kill the villain — the Lisbeth we've grown to love at that point would just do it without hesitation.",
            "review_date": "2019-12-23",
            "source": "rt"
        },
        {
            "content": "Maybe it was the convoluted storyline, maybe it was the complicated family relationships, maybe it was because of the Swedish names, but I had a hard time following what was going on in The Girl with the Dragon Tattoo. Most of time, I just had to take the characters' word that they figured something out. I also had to some reading afterwards. I liked this murder mystery, but it just seemed too intricate (and far too dark) for its own good.",
            "review_date": "2019-12-22",
            "source": "rt"
        },
        {
            "content": "David Fincher's The Girl with the Dragon Tattoo is a brutal and intriguing mystery-thriller with a gripping story, well-written characters, a committed performance by Rooney Mara, and meticulous direction by Fincher.",
            "review_date": "2019-12-16",
            "source": "rt"
        },
        {
            "content": "Solid movie. Slow at times but good casting & compelling story.",
            "review_date": "2019-12-16",
            "source": "rt"
        },
        {
            "content": "I loved this movie \nAwesome screenplay and direction\nI love it",
            "review_date": "2019-12-10",
            "source": "rt"
        },
        {
            "content": "Really great plot story and it’s so captivating as as to how the unsolved mysteries were put together.",
            "review_date": "2019-12-08",
            "source": "rt"
        },
        {
            "content": "Great performances, great movie.",
            "review_date": "2019-11-09",
            "source": "rt"
        },
        {
            "content": "Good story, excellent performances, thoroughly entertaining even on second time of watching",
            "review_date": "2019-10-29",
            "source": "rt"
        },
        {
            "content": "Great piece of work from fincher. Rooney Mara is the perfect Lisbeth Salander. Soundtrack by tent reznor and Atticus Ross give the movie the score it needs to succeed as a dark corruption/hacker story. ",
            "review_date": "2019-10-27",
            "source": "rt"
        },
        {
            "content": "Rooney Mara embodies Lisbeth Salander like never before imagined. Daniel Craig is so good as her journalist work partner, turned sort-of-buddy, turned sort-of-lover counterpart, I mostly forget this guy plays James Bond the rest of the year. David Fincher does it again, what an absolute masterpiece. Even Trent Reznor's score is the perfect partner for the dark, cold, sinister feel Sweden encapsulates in the film. It's a shame we'll never see the full trilogy, however, I'll forever celebrate we got this one. ",
            "review_date": "2019-10-05",
            "source": "rt"
        },
        {
            "content": "A beautiful shot film with an engaging story. Rooney Mara's performance is incredible. Her Oscar nomination was well deserved. Shame they couldn't do a proper sequel with the original cast and team.",
            "review_date": "2019-10-01",
            "source": "rt"
        },
        {
            "content": "This is a good remake. I don't see it as being better than the original, but it is a very good film. A true remake worth the time, energy, and process. I definitely recommend it.",
            "review_date": "2019-09-24",
            "source": "rt"
        },
        {
            "content": "My personal favorite of Fincher's films!  The way he was able to recreate Sweden and the noir story form the novel was mind-blowing.  The comfortability of the movie is astounding, making you truly feel like you are also sitting by the fire, with Mikael Blomkvist, in the cold of winter.\n\nThe film itself has clever allusion to other films such as the Shining and the films of Humphrey Bogart, which add to its mystique.  With a story that sucks you in, a murder mystery that must be solved, and the comfort of a log cabin in Winter, This movie is a must see.",
            "review_date": "2019-09-09",
            "source": "rt"
        },
        {
            "content": "Imo this is Fincher's best and film and wow is the score amazing.  ",
            "review_date": "2019-09-01",
            "source": "rt"
        },
        {
            "content": "I loved this thriller, with Rooney Mara being exceptional as the lead. Some pretty brutal moments involved, but all in all hypnotic with a great finale. 4/5 ",
            "review_date": "2019-08-23",
            "source": "rt"
        },
        {
            "content": "While the movie could've benefitted from a trimmed-down runtime and having Daniel Craig actually bother with a Swedish accent, this American adaptation of The Girl With The Dragon Tattoo works thanks to David Fincher's direction, a grade A performance from Rooney Mara, a compelling mystery plot and the film editing as well as an amazing opening credit sequence set to the tune of a cover of Led Zeppelin's Immigrant Song. The end result? A well-shot, captivating movie that should also deserve credit for one of the most epic moments of revenge in film history. I won't spoil it but you'll know it when you see it.",
            "review_date": "2019-08-20",
            "source": "rt"
        },
        {
            "content": "A little too much hype in this movie. It is a good Mystery movie. The pacing in the middle slows down. It is better than the Swedish version. The movie is complex and it took me a second watch to fully understand.",
            "review_date": "2019-07-20",
            "source": "rt"
        },
        {
            "content": "Brilliant adaptation of brilliant novel.",
            "review_date": "2019-07-13",
            "source": "rt"
        },
        {
            "content": "This is an amazing movie and Rooney Mara's version of Lisbeth Salander may be my favorite movie character of all time.  I loved Noomey Rapace...but Rooney Mara \"IS\" the girl with the dragon tattoo.  ",
            "review_date": "2019-06-25",
            "source": "rt"
        },
        {
            "content": "The movie is amazing, very interesting and good actors",
            "review_date": "2019-06-09",
            "source": "rt"
        },
        {
            "content": "I'm still sad they didn't film the other 4 movies with this amazingly talented cast. ð~\" RIP",
            "review_date": "2019-04-07",
            "source": "rt"
        },
        {
            "content": "mara and craig are a great pairing.",
            "review_date": "2019-03-09",
            "source": "rt"
        },
        {
            "content": "Absolutely gripping albeit with a sad ending... can’t wait for the next one.",
            "review_date": "2019-02-04",
            "source": "rt"
        },
        {
            "content": "Like every other David Fincher film, he elevates the characters and story to a whole new medium that is just so intriguing to watch. The Girl With the Dragon Tattoo is no exception, with sharp and precise direction, a deep and layered screenplay, and two astonishing performances from the leads Daniel Craig and Rooney Mara. Right from the beginning with that stellar opening sequence that sets the tone for the rest of the film to come, you know what you are about to watch will be simply amazing. Even though the film is almost 3 hours in length, Fincher keeps the pace of the story moving with quick speed that never ever bores the audience. One of the smartest decisions this film made was to allow the audience to get to know Mikeal and Lisbeth each separately. What their stories are, what they are like as individuals. The two do not even meet until after the 1 hour mark, but when they do it feels completely natural and right. It is no secret that the source material they worked with from the novel is incredibly dark and complex. I appreciate Fincher for not holding back and truly portraying the ugliness that people can truly be. Rape and torture are just the surface of it, it goes far deeper than just that, and Fincher shows us that brilliantly. Some people will certainly have issues with it, but I for one think it is just haunting to watch play out in the way it did. I really wished that the studio would let Fincher, Craig, and Mara team up once again to finish the trilogy they set out to make. I sincerely believe that it could have been one of the best movie trilogies ever put to film. However, I am so grateful that we got to witness this beautiful film on the silver screen.",
            "review_date": "2019-01-21",
            "source": "rt"
        },
        {
            "content": "This was good, just not as good as the book and 2009 movie.",
            "review_date": "2019-01-17",
            "source": "rt"
        },
        {
            "content": "Another David Finger future classic. This film is extremely impressive, and most of all, very captivating. The script is very well written, I can tell that it was adapted from a modern best-seller, and the characters are memorable are three dimensional, Daniel Craig and Rooney Mara gives excellent performances. Some moments made me wish for the film never to end, because it's so entertaining. Overall, this is a brutal, dark crime thriller that is definitely worth seeing, it's a great movie. Recommended !!",
            "review_date": "2018-12-26",
            "source": "rt"
        },
        {
            "content": "Thriller with thrills too few and far between. Predictable ending. Its saving grace is the titular character who is far more interesting than anything else going on.",
            "review_date": "2018-12-25",
            "source": "rt"
        },
        {
            "content": "With all its disturbing and graphic scenes, The Girl With The Dragon Tattoo is a captivating film led by Rooney Mara's fantastic performance and the bleak and depressing Swedish countryside paired with an almost unnoticeable score.",
            "review_date": "2018-11-17",
            "source": "rt"
        },
        {
            "content": "Really well done. The original is perhaps a tad better but still a very well made re make. ",
            "review_date": "2018-11-10",
            "source": "rt"
        },
        {
            "content": "The franchise with Noomi Rapace is still the stellar version, the one to be compared to.  Rooney Mara is okay and Claire Foy plays a nice high school bad girl but neither comes close to the power of the iconic Noomi.",
            "review_date": "2018-11-10",
            "source": "rt"
        },
        {
            "content": "This entire series is totally badass!! It is a must see.",
            "review_date": "2018-10-29",
            "source": "rt"
        },
        {
            "content": "I had heard that this film was dark, disturbing, and haunting. It is certainly all of those things. However, it is also beautiful, thrilling, and bold.\n\nI really enjoyed the way that the story was constructed, building a world instead of forcing the narrative into one. The way that the film eases the viewer into the lives of Mikael (Daniel Craig) and Lisbeth (Rooney Mara) was enthralling and refreshing. I found myself caring much more about these characters than I would have if they'd just been dumped into a cliche murder mystery.\n\nLike many of David Fincher's films, The Girl with the Dragon Tattoo doesn't hold your hand. It doesn't spell everything out for you in neon letters. It isn't obsessed with providing answers, instead allowing the viewer to piece together the puzzle themselves.\n\nEvery performance in this film is spectacular. The chemistry between Craig and Mara is intoxicating, and it spills over into their performances. Their characters just feel right together, complimenting each other in the ways that each are deficient. Stellen Skarsgard does an excellent job portraying Martin as a kind, normal man; and the reveal of his true nature is chilling.\n\nThe inquisitive portion of my brain would have loved a reason for the way that Martin's father killed his victims, an explanation for his use of the Biblical references. Whether that is a facet of Fincher denying the viewer an easy answer or an unfortunate oversight, I'm not certain.\n\nI thought that the final portion of the film felt extremely forced, and was incredibly difficult to follow. I had no idea what Lisbeth was doing, and the reveal was inconsequential. I haven't read the novel, so I don't know if it held some greater importance there.\n\nThere is one scene that I have an immense problem with in this film, keeping me from counting it as one of my favorites: the scene where Lisbeth is raped. I understand the purpose, but I think that showing it was unnecessarily gratuitous and exploitative. Rape is horrible enough that it could have been implied to the same effect, without subjecting the viewer to the details. Not one person would think that the rape was any less horrible because they didn't see it.\n\nOverall, The Girl with the Dragon Tattoo is an excellent thriller and it is disappointing that Fincher will not direct the rest of the series. I would have much preferred a sequel to this instead of the dumpster fire that is Gone Girl.",
            "review_date": "2018-10-26",
            "source": "rt"
        },
        {
            "content": "It has some very explicit visualizations to characterize each protagonists' background, and there were some things that were not included in the movie that were in the book, but this movie was a very very good adaptation of the book. It is quite an exquisite piece in the dark investigative film genre.  Both actor and actress, Daniel Craig and Rooney Mara, captured Salander and Blomkvist perfectly.",
            "review_date": "2018-10-26",
            "source": "rt"
        },
        {
            "content": "Honestly i can write that i enjoyed this film right until the last 30 seconds. The ending of the movie leaves me wondering on Beth's true feelings towards Mikael. Any thoughts ?",
            "review_date": "2018-10-03",
            "source": "rt"
        },
        {
            "content": "(94/100)\nThe Girl with the Dragon Tattoo is such an amazing film. David Fincher and Jeff Cronenweth give such a great aesthetic to the movie and the overall style is just so… Fincher. Rooney Mara gave her best performance in any movie yet. She's really captivating and, although Lisbeth might not be very pleasing to look at and has clearly has some mental problems, Rooney Mara does give her a special touch that make you like her despite her shortcomings. The script by Steven Zaillian is also phenomenal, he did a really good job translating the book to screenplay. Daniel Craig is also really good as Mikael Blomkvist, along with Stellan Skarsgard as Martin Vanger. The use of CGI is also, wow, Fincher really knows when to use it to his advantage and when not to. Although, if you really pay attention to it, you can pick out which scenes are and aren't improved with CGI. As I said the cinematography by Jeff Cronenweth is just amazing. I really liked his earlier work, but now it has a new kind of updated aesthetic due to the Swedish landscapes. Those landscapes really help with building the overall feel of the movie. The score by Trent Reznor and Atticus Ross is, yet again, really great. Their scores for The Social Network, this movie and Gone Girl are really interesting and have a feel and mood to them that just screams Fincher. Overall, The Girl with the Dragon Tattoo makes you think and feel in a really interesting way and it's a great experience to have. ",
            "review_date": "2018-09-22",
            "source": "rt"
        },
        {
            "content": "4.5/5.  Some things are better in the original version.  Some are better in this one.  But both Craig and Mara are great, the direction is top notch, and the cinematography is amazing.",
            "review_date": "2018-08-17",
            "source": "rt"
        },
        {
            "content": "Esta Gruesa y tediosa historia culmina siendo una historia predecible que funciona como adaptación, pero que no funciona como una cinta para entretener y mostrar algo mas alla de lo que se logra deducir desde un principio, esta triste ejecución de Fincher sirve para mostrar el gran talento que tiene Rooney mara como actriz y lo interesante que llega a ser Jeff Cronenwet para presentar una Cinematografia impecable en esta cinta.",
            "review_date": "2018-07-09",
            "source": "rt"
        },
        {
            "content": "I have not read the books, nor have I seen the original version of the movie. Therefore, some of my pet peeves about the Girl with the Dragon Tattoo may lie somewhere in the story itself rather than the editing. Don't get me wrong. The movie is great. I immensely look forward to sequels. Rooney Mara's performance alone is enough to want to see the series continue. The entire cast is fantastic, but what seemed to bug me most during the movie is the extended amount of time spent on some elements of the story, like her being a ward of the state, but how much time wasn't spent on explaining the backstory re: Daniel Craig's lawsuit and relationship with Robin Penn. A lot effort was spent building up the need for Christopher Plummer to hire Daniel Craig to solve this mystery, yet very little into connecting Craig and Mara together. For someone so unsociable, she unnaturally connected quickly with Craig. Then, when it was all said and done, the story seemed to wrap up too quickly as compared to the build up. So, while the story was good, the directing was good and the cast was good, the piecing together of the film itself seemed haphazardly done. Was this editing? Was it the story itself? At 2:34 long, I would have expected a better flow, but nonetheless, my high expectations were met and I look forward to more.",
            "review_date": "2018-06-18",
            "source": "rt"
        },
        {
            "content": "LOVE THIS MOVIE. fantastic film. love the actors. however the rape scene, made me very uneasy (I know it needs to be seen, it happens! it's real! but once was enough for me). but you can skip chapter, and it picks right back up!(I love that, thank you dvd producers!) ",
            "review_date": "2018-06-01",
            "source": "rt"
        },
        {
            "content": "Thoroughly a damn good movie. The actors sink deeply into their characters, and the movie does not follow many of the conventions of a typical murder-mystery.",
            "review_date": "2018-05-07",
            "source": "rt"
        },
        {
            "content": "A thoroughly engaging film from David Fincher with a breakthrough performance from one of- if not the finest actor of my generation: Rooney Mara.",
            "review_date": "2018-03-21",
            "source": "rt"
        },
        {
            "content": "DOESN'T ADD MUCH NEW but an unnecessary, america fuck-yeah-type remake. BTW, MY KEyboard is forcing me to use caps.",
            "review_date": "2018-03-10",
            "source": "rt"
        },
        {
            "content": "why don't people trust their instincts..\n\nThe Girl With The Dragon Tattoo\n\nThe main case is strong, enthralling and attractive keeping the viewers on hold on its route but the other two tracks of lead characters may come off as a bit tiresome and even dark sometimes. The Girl With The Dragon Tattoo is raw, perilous and jaw dropping as it captures some of the worst phases of humanity along with some genuine performances and unpredictable plotlines. David Fincher; as always, nails it when it comes to execute a mystery or crime features and has a powerful screenplay to support adapted by Steve Zaillian. Daniel Craig justifies his part but in here, Rooney Mara steals the show by giving an outstanding performance on her parallel role with him. The Girl With The Dragon Tattoo is slow and takes its time on building up the characters on screen in its first act and comes off strong on its second which is the best one and then dips down on its last one as it stretches its way down the road.",
            "review_date": "2018-02-22",
            "source": "rt"
        },
        {
            "content": "Crime thriller doesn't get any better or more stylish.",
            "review_date": "2018-02-13",
            "source": "rt"
        },
        {
            "content": "This is the second time Daniel Craig has appeared in a thwarted film series , the His Dark Materials trilogy being the other. So it's a good job he wasn't cast as Harry Potter. Although how much better the world would be if he'd been in the first Hobbit, Star Wars, Alien or Jaws movies. It's a shame because this is smart and stylish with great performances from both leads, as well as a wonderful supporting cast. The violence can be graphic, the lawyers comeuppance is horrifying (if rather satisfying). The loss of momentum on getting the other books on film is a real lost opportunity. That said, the originals are there to view and that's no bad thing.",
            "review_date": "2018-01-28",
            "source": "rt"
        },
        {
            "content": "A very well put together film with some great shots - but still feels like it is missing something. Not quite as impactful as many of Fincher's other masterpieces.",
            "review_date": "2018-01-23",
            "source": "rt"
        },
        {
            "content": "Puntaje Original: 7.0\n\nUna notable dirección de David Fincher y una loable actuación de Rooney Mara. The Girl with the Dragon Tattoo nos ofrece una intrigante e impactante historia.",
            "review_date": "2018-01-04",
            "source": "rt"
        },
        {
            "content": "Another good film by David Fincher, even if a little confusing and not as clever as his other work. While it works as a standalone movie, I feel like the miniseries or the books should have been my first choice.",
            "review_date": "2018-01-03",
            "source": "rt"
        },
        {
            "content": "David Fincher's films are cerebrally beguiling experiences more often than not. He's a director who is a complete master of subtlety in cinema. Every shot is always meticulously planned and executed with a unique mastery.\n\tIn a conclusion which didn't shock me as much as I originally thought it would, The Girl with the Dragon Tattoo is more than just another great film from one of modern cinema's most enigmatic directors. It's a further development in the modern psychological thriller which hasn't been attempted before. It's true, the plot is somewhat complex enough to merit multiple viewings, but the overall brilliance of the film is enough to bring more cinema enthusiasts around for a second or third viewing on its own. Daniel Craig and Rooney Mara have an intense and volatile chemistry throughout the film, and bring a somewhat visceral dimension to Martin Blomkvist and Lisbeth Salander.\n\tHowever, its the psychological aspect which adds much of the film's edge. This is a dark movie with no restraint placed on the showings of manipulation, mystery, murder, and several different types of abuse which take place onscreen. Its a spellbinding film from beginning to end, with the negative aspects clearly visible as well. The first truly captivating modern psychological thriller in almost a decade.",
            "review_date": "2018-01-01",
            "source": "rt"
        },
        {
            "content": "I didn't see the original, but any way it goes, I was not too terribly impressed. Did I totally miss something very important, or what does the dragon tattoo have to do with anything? So, she's a \"punk\" with tattoos - so is everyone else these days. Other than that apparently meaningless note, it's not the worst movie ever made - _ I just don't need to watch it again. I could be wrong though. It's supposed to be based on a trilogy of books, so maybe there is some significance to the tattoo. I did not read the books, so I really don't know.",
            "review_date": "2017-11-27",
            "source": "rt"
        },
        {
            "content": "Wish I hadn’t waited so long to watch this. The opening credits alone are mesmerizing. It’s a captivating story of violence, mystery, family rivalries, power and abuse. Outstanding cast.",
            "review_date": "2017-11-19",
            "source": "rt"
        },
        {
            "content": "Now, when I've heard that The Girl with the Dragon Tattoo has come out three years ago, the remake is at cinemas. From what I know is the original is the Swedish version so I'll have to go watch the remake then the original. Now for this remake, this is actually pretty impressive. For a remake that is three years after the original, David Fincher has created the grittiness that really does show the audience how intense and violent this movie is. The revenge rape scene is intense you could cringe. I stomach through it all and I'm not disturbed by it and what can I say? Revenge is a b***h. I love the cinematography in this, it makes it look so gloomy you can tell it's David Fincher's style. The best thing about this film is Rooney Mara's performance as Lisbeth Salander as a computer hacker. The opening credits sequence kinda reminds me of something out a James Bond film. I mean, what can you really expect? It's Daniel Craig as James Bond but in this he plays a journalist, Mikael Blomkvist. So what can I say about the remake of The Girl with the Dragon Tattoo? Well, I love it and this is a great film. It's gripping, dark and brutal in some areas. Very captivating for it's story, the cinematography, the direction taken from David Fincher and a great performance from Rooney Mara. I actually am looking forward to seeing the original Swedish version with Swedish language and the English subtitles which I hope are gonna make up for it. But as remakes go, this is the best. Nothing can go wrong with this. It's a must-see.",
            "review_date": "2017-11-19",
            "source": "rt"
        },
        {
            "content": "One of David Fincher's best films, The Girl with the Dragon Tattoo is a modern masterpiece. I haven't read the book, but I have seen the original 2009 film, and Fincher's version is a noticeable improvement on it. Daniel Craig givers a fantastic performance, and Rooney Mara is absolutely perfect as Lisbeth Salander. It's brutal and a couple scenes are hard to watch, but that just makes the film that much better.",
            "review_date": "2017-11-13",
            "source": "rt"
        },
        {
            "content": "Having read the books I did know what to expect but this did not stop some of the scenes being very disturbing. Nevertheless strong performances throughout and a good tempo kept me engaged. Maybe one criticism would be the speed which Salmander and Blomkvist were meant to establish the bond but understandable in a Hollywood film.",
            "review_date": "2017-11-12",
            "source": "rt"
        },
        {
            "content": "****\nThe funny thing about this 2011 remake of 'The Girl with the Dragon Tattoo' is that, in the hands of almost anyone else, it would've turned out to be another average, un-notworthy thriller. In the hands of David Fischer, however, it's turned into something so much more. Carefully crafted and stunning on every technical level; the movie also supports fantastic performances, especially from the two leads. It sometimes falters in the telling of its mystery and was slightly incoherent in that respect but, thanks to Fincher's magic touch, this is a remake that actually has a right to exist.",
            "review_date": "2017-11-11",
            "source": "rt"
        },
        {
            "content": "I didnt see this film first time around, but have just watched it on TV. Rooney Mara is truly wonderful in this film and it ends with you just wanting more. If a sequel is ever made, not casting her would be criminal.\n\nI really wish Swedish films would have Swedish actors and English subtitles. But for this film, I was happy to make an exception. There are lots of themes mixed in this story, family love gone wrong, Nazism, corruption at the top and abuse. But friendship is also one of them too.",
            "review_date": "2017-11-07",
            "source": "rt"
        },
        {
            "content": "Great character development and heart wrenching moments makes this film worth a watch.",
            "review_date": "2017-10-23",
            "source": "rt"
        },
        {
            "content": "Great movie on par with the original which this ripped off.",
            "review_date": "2017-10-13",
            "source": "rt"
        },
        {
            "content": "My favourite David Fincher film after Fight Club, this film, as people know, is the American adaptation of Late Stieg Larsson's Book 1 of Millennium Trilogy, and features a stunning cast of Rooney Mara, Daniel Craig, Stellan Skårsgard, Goran Visnjic, Christopher Plummer, Robin Wright, Yorick Van Waginen, Tony Way, Josefin Asplund, Joely Richardson, Elodie Yung and others. The film revolves around a girl who goes missing 40 years prior and obsessive about finding her, the uncle (Christopher Plummer), hires Mikeal Blomkvist (Craig) to uncover the mystery behind it who in turn hires socially awkward, goth and vengeful freelance hacker Lisbeth Salander (Mara), as they come close to uncover the mystery, they find secrets hidden inside the family which might shock everyone. Rooney Mara, nominated for an Academy Award for her performance in this film, made sure as long as she is in the screen, she steals the show. When I first saw the film 3 years back, I couldn't recognize that was the beautiful looking Mara. Rooney Mara's Lisbeth is vengeful, traumatized and much more humane than her Swedish counterpart portrayed by Noomi Rapace. \n\nDaniel Craig, an actor better known as the 'Blond' James Bond, delivers a stunning performance in this film as an investigative journalist who unravels the mystery. He is seductive, friendly, enthusiastic and confused person. All these emotions are portrayed effortlessly by Craig. \n\nOther cast members, specially Plummer and Skårsgard also delivers killer acts in this film. Some scenes may disturb the viewer, but overall this is a decent, edge-of-the-seat thriller which makes you keep your eye glued to screen. A brilliant work by Fincher, this is certainly better than its Swedish counterpart specially for the climax alone.",
            "review_date": "2017-09-09",
            "source": "rt"
        },
        {
            "content": "I avoided watching the American version of this for 5 and a half years. I absolutely love the Swedish version, it's brilliant. Actually, all three movies are top notch. Noomi Rapace's performance is an acting tour de force right up there with the likes of Christian Bale's effort in, The Fighter. Avoid the American version of this movie at all costs.. its absolute rubbish. Fincher, hang your head in shame for dishing up this puke. \nNote, if you can't watch the Swedish version of this movie because you're illiterate, then make the effort to learn how to read and then watch it. You won't regret it...",
            "review_date": "2017-08-28",
            "source": "rt"
        },
        {
            "content": "\"The Girl with the Dragon Tattoo\" benefits from two particularly committed performances by Daniel Craig and Rooney Mara, David Fincher's usual mastery for psychological thrillers and Trent Reznor & Atticus Ross' hauting soundtrack in this adaptation of the well-known Swedish tale that is both disturbing and engaging.",
            "review_date": "2017-08-05",
            "source": "rt"
        },
        {
            "content": "The Tone, The Score, The Acting, The Cinematography, I am speechless.",
            "review_date": "2017-07-22",
            "source": "rt"
        },
        {
            "content": "Stieg Larsson's second film adaptation of the same book, I have to see the original Swedish films later. Journalist Mikael Blomkvist is aided in his search for a woman who has been missing for forty years by Lisbeth Salander, a young computer hacker. Rooney Mara has a lot of talent and this movie proves it. The plot is intriguing and smart and it has a good structure.",
            "review_date": "2017-07-07",
            "source": "rt"
        },
        {
            "content": "David Fincher yet again proves himself to be one of the finest directors working in Hollywood at the moment with another tightly composed, flawlessly scripted, and consistently engrossing entry to his filmography. I wish I had watched this sooner.",
            "review_date": "2017-06-21",
            "source": "rt"
        },
        {
            "content": "An excellent mystery film, with that constant sense of fear and dread Fincher has always seemed to be able to handle with more discipline and purpose than any other director. Aside from a few moments of questionable accent work, the acting is great (Rooney Mara especially). The score is also worth mentioning, as its intentionally misplaced notes and screeching synths add tremendously to the tension.",
            "review_date": "2017-05-13",
            "source": "rt"
        },
        {
            "content": "Great looking production a bit bogged down by its self-admiration.",
            "review_date": "2017-05-04",
            "source": "rt"
        },
        {
            "content": "Decent movie. However, not true to Stieg Larsson's book and a far second to the Swedish film. How can you completely change the story like that? Hollywood, please stick to what works...",
            "review_date": "2017-04-17",
            "source": "rt"
        },
        {
            "content": "Rooney Mara's not the only one disguised with a load of gothic makeup. TGWTDT is a conventional whodunnit given a modern makeover. One star deducted for presenting violence against women as entertainment while pretending to condemn it.",
            "review_date": "2017-04-17",
            "source": "rt"
        },
        {
            "content": "Cleanly shot against stunning backgrounds, but completely fails to capture the feel or flow of the story. It's no surprise that this telling of story ended with the first chapter. \nYou'd be better served by the Swedish movies, or even better, read the books.",
            "review_date": "2017-04-01",
            "source": "rt"
        },
        {
            "content": "Very violent movie about a girl who is a closed book of no emotions. She gets a big painful tattoo after a man rapes her, and then returns to see him again so she can sodomize him with a giant dildo. Not for your kids for sure, but I enjoyed it for its mystery in the second half of the movie. I also read the book, and like both.",
            "review_date": "2017-03-31",
            "source": "rt"
        },
        {
            "content": "not as good as the original",
            "review_date": "2017-03-27",
            "source": "rt"
        },
        {
            "content": "The first movie to have really captured my attention in a long time.",
            "review_date": "2017-03-20",
            "source": "rt"
        },
        {
            "content": "Nice version for a Hollywood movie of the Swedish film",
            "review_date": "2017-03-11",
            "source": "rt"
        },
        {
            "content": "Actually a decent remake. It was very David Fincher, this was a good thing, but it seemed to lack substance, lots of flair not enough care. It felt it's length. Even the ending (all 3 of them) were disappointing and drawn out. 6.5/10",
            "review_date": "2017-02-20",
            "source": "rt"
        },
        {
            "content": "David Fincher showing again why he is one of the best directors in Hollywood. This film is incredibly made. It is a dialogue driven film. Daniel Craig and Rooney Mara have great chemistry together and work off each other well. Mara deservedly was nominated for the best actress Oscar. This is a dark movie so be prepared for that when going in. Another great crime/drama that Fincher does so well.",
            "review_date": "2017-02-13",
            "source": "rt"
        },
        {
            "content": "\"Millenium - the men who did not love women,\" for that is, what a strong name, just as the film is also strong, with a seven-faced and a zoadic painted, fincher's investigative suspense hits again. We have here a very well worked script, not only in the construction and immersion of what is being investigated, but in the construction of an environment as a whole, its two protagonists are spectacularly presented and developed, all their nuances and dikes are shown, not always Played in the viewer's face, but for those who are paying attention, he perceives everything that guides our protagonists, just as the Vanger family, all their hatred of inheritance, their feuds and disagreements are extremely immersive, fault of this excellent fincher script that tells the story of Mikael Bomkvist (Daniel Craig) and Lisbeth Salander (Rooney Mara), a man who lives within social standards but is professionally discredited and a woman living out of social standards very professionally credited, the two unite to investigate a case in a family, Where there has been a disappearance more than 30 years. The film talks about invasion of privacy, domestic violence and abuse in a rough way, is like a punch in the stomach, the character of Lisbeth Salander (Rooney Mara) is incredible, a Gothic, with a completely opposite look of what is described in Social conventions that fight against itself in a search for something real. Technically, the film is very good, first the photography, we have nothing from another world, but the photography is always sober, gray, with darker tones, very traditional Fincher films, except in moments of flashbacks, there the Lighter tones take over, the film is clear and with a paler color palette, we can observe a care in this matter in every film, and the soundtrack is always sagacious, nothing memorable, but it is there, always. Rooney Mara, accustomed to cute roles is here completely decharacterized, and makes a very sober acting, just like her partner. Finally, \"Millenium - Men who did not love women\" is a movie that pleases.",
            "review_date": "2017-01-31",
            "source": "rt"
        },
        {
            "content": "Once again, Fincher demonstrates why he is one of the most unique directors ever and one of the few that can make a movie AS good as the book based off.",
            "review_date": "2017-01-25",
            "source": "rt"
        },
        {
            "content": "I liked the \"Americanized\" version. I wish they would make the others",
            "review_date": "2017-01-15",
            "source": "rt"
        },
        {
            "content": "Never read the book and din't expect much from the film. I was wrong mainly owing to the superb casting of Craig and particularly Rooney Mara whose performance dominates the film. Great storyline and well directed.",
            "review_date": "2017-01-07",
            "source": "rt"
        },
        {
            "content": "It's good movie to watch",
            "review_date": "2016-12-30",
            "source": "rt"
        },
        {
            "content": "This is the kind of movie Fincher was born to make and he made another damn good crime/drama with amazing performances. The movie was brutal, realistic, and very dark, he shines the most when making this sort of movie. The Girl With the Dragon Tattoo is an amazing movie, it could have used more character development though.",
            "review_date": "2016-12-22",
            "source": "rt"
        },
        {
            "content": "The girl with the dragon tattoo is a remake of a successful Swedish film that was itself an adaption of a book. The book is the first in a series and though the movie is a wonderful standalone, you can tell that they hoped to do more. The sequels though have been post poned for some time, but rumors swirl of Fede Alvarez to Direct. The director on the 2011 film was the meticulous David Fincher. He worked the story into submission. The film won a best editing Oscar to inform how well put together it is.\n\nMara Rooney dug deep into this role, that comes off lie a female superhero. Jessica drw is pretty much the Salamander charcters with powers. She plays the part with great contrast to Daniel Craig, whos charcter's life is tough in different ways. The list of potential suspects are also performed well and lead you to believe anyone on this little island could be the criminal. One such performance is by the gentle men from marvels \"Thor/Avengers\", who gives a layered performance of his character who is also putting on a performance.\n\nHaving never seen the original or first adaption of the source material I am totally unaware of what could have been. Critics say it was more faithful to the books, but nevertheless. This adaption is moving and confident with each step. The Swedish setting was a nice change of pace from the Americas that we most often see on film. In between the meaty parts, this thriller does seem like a TV show thats gone on far too long. This is due in part to it needed to cover so much ground in order to get to the next reveal and because they are leadin up to sequels. Being a lover of sequels and having a potential looming by the Evil Dead director, I honestly hope Rooney comes back due to her commitment to the role. Otherwise we might get the same girl from all Alvarez's movies, Jane Levy. The film is worth more than one watch",
            "review_date": "2016-11-28",
            "source": "rt"
        },
        {
            "content": "When a master director such as Fincher gets to adapt a book into the big screen, magic unfolds. The dark tone, masterful sound mixing and design, the acting, the writing, etc. It all oozes into the screen in the best possible way. At this point in his career, Fincher could film a man painting a wall and he would still find a way to make it interesting. We are extremely lucky to have such an incredible director working today. Please, do yourself a favor and don't just watch this film, but watch all of Finchers' movies. I highly recommend them all.",
            "review_date": "2016-10-29",
            "source": "rt"
        },
        {
            "content": "I really hated the book.",
            "review_date": "2016-10-24",
            "source": "rt"
        },
        {
            "content": "Truly one of my favorite films from one of my favorite directors. This film is full of beautiful imagery and amazing performances. An impeccably crafted thriller that thoroughly entertains",
            "review_date": "2016-10-23",
            "source": "rt"
        },
        {
            "content": "4,5/5 Ratings for The Girl with the Dragon Tattoo\nF: 86%\nR: 14%\nAction Adventure",
            "review_date": "2016-10-22",
            "source": "rt"
        },
        {
            "content": "Great film, Great remake. Seriously, both the Swedish version and the American version were great and so were the books, do not listen to any critics. I know good films, and I know how seldom a good movie comes along among the usual garbage that is pumped out annually, the story is refreshing, the characters are intriguing, and you end up wanting more. I believe this is a very capable franchise, and since the books themselves were so great and well read it would be very easy to give us more into the world of these fascinating characters. You may need to pay close attention to understand it, but it is without a doubt a classic, one of the few that is put out during the yearly one hundred or so crap films. That being said, to the writers and director, PLEASE MAKE MORE. Thank you, from a satisfied movie fan.",
            "review_date": "2016-10-21",
            "source": "rt"
        },
        {
            "content": "In my humble opinion, this is a poorer version of the superior and original Swedish adaptation. Is the Swedish version more faithful to the source material of the book? I cannot say because I haven't read it. But what I can tell you is that the Swedish version is simply a better told/paced, engaging, and well rounded story with (lead) characters whom you can get to know, like, and sympathise with.\n\nI found this very difficult with Fincher's take, in which the story and characters are kept at arms length from the audience. Lisbeth is also much colder and withdrawn, and although nobody can possibly condone the terrible things that she has had to endure in her troubled past, I found little in her to sympathise with. Likewise, Daniel Craig's Mickael is more of a husk and defeated man, and unlike the Swedish version, I felt no real bond or connection between the two main leads in both the solving of the crime/mystery with which they were presented, and the personal emotional connection which they flirt with while trying to crack the case.\n\nDue largely to Lisbeth's abusive past, the audience can accept that such a person would naturally be cautious and keep their cards close to their chest. But in the Swedish version this accomplished whilst also showing us glimpses of warmth, emotion, and humanity, whereas Fincher decides to keep Lisbeth more or less catatonic. I cannot possibly get on board with a character like that, even I do regret hearing about her abusive past.\n\nTo summarise, buy and watch the far superior Swedish version. 3/5",
            "review_date": "2016-10-09",
            "source": "rt"
        },
        {
            "content": "Absolutely thrilling from start to end. Mara is incredible beyond all words!",
            "review_date": "2016-09-28",
            "source": "rt"
        },
        {
            "content": "The Girl with the Dragon Tattoo is relentless, brutally captivating, great performance by Daniel Craig, and Rooney Mara. The story was great, it wasn't boring at all. The Girl with the Dragon Tattoo is a rare action/drama film that is astonishing.",
            "review_date": "2016-08-30",
            "source": "rt"
        },
        {
            "content": "Loved the movie even if it was condensed in to one movie.",
            "review_date": "2016-08-05",
            "source": "rt"
        },
        {
            "content": "I've now seen both the original and this American remake, The original seems to tell the story better. There is nothing wrong with this one - same great story, pretty good acting - It's just Rapace nailed Salander and Mara only came close. Both versions are worth the time to watch.",
            "review_date": "2016-07-29",
            "source": "rt"
        },
        {
            "content": "This was something else. It was unique and intense. Rooney Mara is so very talented. I was truly impressed by her character. She is intimidating and brilliant yet so very vulnerable. The plot twists in this film definitely keep you on the edge of your seat. If you won't be too uncomfortable, this film is definitely worth seeing.",
            "review_date": "2016-07-29",
            "source": "rt"
        },
        {
            "content": "It may be long, but it's great; and it proves that some remakes can in fact be as good, or even better, than the original. plus, Rooney Mara as Lisbeth Salander. nuff said",
            "review_date": "2016-07-05",
            "source": "rt"
        },
        {
            "content": "Good but a little slow",
            "review_date": "2016-06-15",
            "source": "rt"
        },
        {
            "content": "It's a little too long, and some scenes don't work, but Fincher's directing, and the writing, save it from not being good. Rooney Mara gave the performance of her lifetime, with complete committment to the role, she transforms into her character!",
            "review_date": "2016-05-09",
            "source": "rt"
        },
        {
            "content": "creepy But quite good after you get passed a few questionable seems scenes",
            "review_date": "2016-04-27",
            "source": "rt"
        },
        {
            "content": "I'd say for someone who's read and loved Larsson's novel, this adaption of Lisbeth's story is one that meets expectations, but doesn't really go that extra mile. It feels sort of impersonal and detached to the beauty I found in reading it. And I suppose to those who haven't read the novel, I feel like the story will present itself as very flat and unintelligible. The film itself has received good ratings I believe solely for its tale, but not its depiction. Great, still though for Larsson's feminist literature coming across as a powerful female character who won't take anyone's shit.",
            "review_date": "2016-04-15",
            "source": "rt"
        },
        {
            "content": "Great picture, great soundtrack\nI hope they do the other 2 movies",
            "review_date": "2016-04-03",
            "source": "rt"
        },
        {
            "content": "An amazing performance by Rooney Mara, displaying her full commitment to the role which is easily noticeable in the movie, on top that, an intriguing story, has made The Girl With The Dragon Tattoo a dark, but yet a work of genius in it's own way. Also I didn't personally like how there was so many things going on, and you were suppose to keep up with it, at times I found things hard to understand not because of how difficult or complex they were, but because of how much information the move was telling in every five minutes. But then again, it is a personal opinion, so some people might have had no problem understanding the large amounts of information. Overall, It may have been great, but the ending feels disappointing, feels as if something is missing.",
            "review_date": "2016-03-28",
            "source": "rt"
        },
        {
            "content": "David Fincher at his finest, The Girl With The Dragon Tattoo is both a great adaptation of a fantastic book but also a disturbing look into the human psych, lead by a bravura performance by Rooney Mara, a great visual look and feel, and a hypnotic score by Atticus Ross and Trent Reznor. Simply amazing.",
            "review_date": "2016-03-27",
            "source": "rt"
        },
        {
            "content": "David Fincher's film of the first of the Millennium Trilogy books is an extremely well paced and narratively satisfying psychological thriller.  There are significant differences from the Norwegian film but Fincher essentially tells the same story - albeit with a very different visual style and characterisations from Rooney Mara and Daniel Craig.  Mara is wonderful as the socially withdrawn, attachment-disordered researcher / hacker Lisbeth Salander, and it is sad that neither Fincher nor she appear to be involved with a continuation of the series.",
            "review_date": "2016-03-26",
            "source": "rt"
        },
        {
            "content": "David Fincher's The Girl with the Dragon Tattoo is about as good as its nauseatingly dense source material would allow. I'm no fan of Stieg Larsson's novel, nor the original Swedish film version. Fincher, however, is able to milk this puppy for all its worth. It's pulp for mass consumption. It hides its faults behind bursts of violence in the name of girl power. Yet, somehow, Fincher (with a big assist from Trent Reznor and Atticus Ross) makes it compelling.\n\nOur three primary characters are Henrik Vanger (Christopher Plummer), Mikael Blomkvist (Daniel Craig), and Lisbeth Salander (Rooney Mara). Vanger is a wealthy industrialist haunted by the disappearance and presumed death of his niece, Harriet. Blomkvist is a disgraced journalist hired by Vanger to hopefully give the Harriet's investigation new life. Salander, meanwhile, is a brilliant investigator with a penchant for violence-especially against her vile parole officer. She's brought in to assist Blomkvist in the investigation, which pits them against the Vangers-a clan of Nazis, recluses, drunks, and at least one murderer.\n\nIt takes nearly an hour for Blomkvist and Salander to connect, yet the film is oddly at its best when they are apart. Their connection isn't developed as much as it should be, and while they're focusing on the investigation, we're treated to a great deal of research-leafing through archives and photo albums. The character-building stuff, however, is strong. It helps us establish an early connection to our protagonists, even if we don't always agree with their actions.\n\nFincher's direction is very good, though perhaps not as flashy as you might expect (the opening credits being an obvious exception). The mood is instead primarily established by the film's score. Reznor and Ross, of course, won Oscars for their work on The Social Network last year. Their contribution to this film is just as strong. Without the presence of such an unusual and atmospheric score, there's little to distinguish this film from the dozen or so other high-profile potboilers of recent memory.\n\nThe film's other saving grace is Rooney Mara, whose portrayal of Salander is career-making. She's a steely individual with mountains of psychological issues, yet despite her problems and some of the more disturbing things she does, she's an immensely likable individual. She commands your attention whenever she's onscreen, and when she's off it, you long for her to return soon.\n\nDaniel Craig and Christopher Plummer disappoint slightly, if only because they play somewhat passive characters very passively. Their performances, then, are appropriate, but they aren't the most exciting individuals to spend almost three hours with. Robin Wright and Stellan Skarsgard also appear in two of the film's more prevalent supporting roles.\n\nI hope Fincher returns to this series for installments two and three. He'd be the only reason I'd bother to watch them because even though I did enjoy this film, it's not enough to give the stories a pass. That said, I also hope he doesn't abandon other properties entirely. His previous two films before this (The Social Network and The Curious Case of Benjamin Button) were my two favorite films from their respective years. This one won't sniff my top ten, but it's better than it probably should be, and it's a worthy whodunnit from one of cinema's greatest modern auteurs.\n\nhttp://www.johnlikesmovies.com/girl-with-the-dragon-tattoo-2011-review/",
            "review_date": "2016-03-12",
            "source": "rt"
        },
        {
            "content": "The Girl with the Dragon Tattoo is an adaption from the world famous book written by Stieg Larrson. It tells the story of a fiancial reporter hired Swedish industrialist looking to redeem himself from his past actions by solving a family murder mystery. I thought this film was really well done. David Fincher's dark take on the films story benefited the movie in so many ways. The entire tone and theme of the film is so creepy and chilling in so many scenes but it is so fantastic to watch. Daniel Craig and Rooney Marra are terrific. Both actors are extremely devoted to their roles making them very convincing and believable.  Their chemistry on screen also binds perfectly with each other, both two dark mysterious characters that I really enjoyed watching. The films pace is also remarkably fast. You would think a film nearly three hours long will drag at times or get really slow, but not this one. I was completely invested into the story getting fed with engaging dialogue and gritty details. I also loved the visual aspect of the film. The cold snowy scenes really added to chilling, dark perspective Fincher was going for. If I could nitpick a little, I'd say towards the last 15-20 minutes dragged on just a tad but that's about it. The Girl with the Dragon Tattoo with stellar performances, great visuals, and a thrilling story that anybody will appreciate.",
            "review_date": "2016-03-06",
            "source": "rt"
        },
        {
            "content": "September 29th 1966, 16 year old Harriet Vanger (Moa Garpendal) disappears without a trace\nfrom her family's isolated island estate in Sweden after a provincial fair.\n\nToday, Millennium magazine's crusading investigative journalist Mikel Blomkvist (Daniel Craig) emerges from a gruelling high-profile court case after receiving a hefty fine and a fatal blow to his credibility for running a corruption story on businessman Wennerstrom (Ulf Friberg) which turned out to be false.\n\nInterrupting his self-flagellation, Blomkvist is surprisingly sent for by one of Sweden's wealthiest industrialists and venerable business tycoon Henrik Vanger (Christopher Plummer). \n\nObsessed in solving the 35 year old mystery of his lost grandniece Harriet before the elderly patriarch's own death, Vanger commissions Blomkvist to investigate 'the most detestable people imaginable' consisting of Nazis, rapists, alcoholics, murderers; his dysfunctional family.\n\nBut before Vanger even considered the diminished careered writer, his security firm engaged a professional but unorthodox young hacker, Lisbeth (Rooney Mara) to run thorough background check to intimately personal detail.\n\nBi-sexual, multi-pierced, heavily tattooed and steely faced, Lisbeth is a true product of the system. A troubled punk-chick who bears the scars of being a ward of the state since the age of 12 and lumbered with a legal guardian who demands sexual favours, repeatedly violating and abuses her, Lisbeth is no-one's victim. \n\nUtilising her weapons of intelligence, resourcefulness and unparalleled technological abilities, the distrustful and ruthless girl finds her way out of any situation. When the morally scrupulous Blomkvist's investigation hits a wall, Vanger engages Lisbeth and her gifts to dig deeper. \n\nAs the duos paths intersect they uncover dark secrets, attract deadly danger and each other whilst unearthing some ugly revelations. \n\nThis intricately dense and edgy thriller is a film of substance. An English remake by director David Fincher of 2009's Danish director Niels Arden Oplev Swedish adaptation of Stieg Larsson's best-selling Millennium trilogy, this is a story with a great sense of place, intriguing relationships and an enigmatic central character.\n\nAlthough some seduced by the novel or the original film may not feel the need for an English reworking and dismiss this film as just another Hollywood money grab, it does in fact stand alone with decidedly different strengths.\n\nThe marvellous pop-culture character Lisbeth; originally portrayed by the wonderfully commanding Noomi Rapace who inspired fear and awe, is now played by Rooney Mara. With just as much impact but with a more quiet intrigue to her presence, Mara delivers both innocence and volatility in balanced measure.\n\nBlomkvist, pioneered by Michael Nyqvist now replaced with Daniel Craig is perhaps the only casting misstep. Not due to Craig's acting; which surprisingly is very good, but his age. The chemistry between Craig and Mara is palpable, but with the age gap almost 10 years closer, it doesn't deliver on the same level of emotional complication as depicted in both predecessors. \n\nPlummer's Vanger is pitch perfect and Stellan Skarsgård brings gravitas and cultural credibility to his role as Martin Vanger. \n\nThe Scandinavian cultural setting is was crucial to the ambient tone, cinematographer Jeff Cronenweth captured the inert chill of Vanger's private island brilliantly. The enthralling 158 minutes of running time spans emotions from curiously clever forensic detail to a disgustingly justifiable graphic and harrowing rape scene without lagging.\n\nThe Verdict: With a slick intensity, The Girl with the Dragoon Tattoo English version holds a place in its own right amongst the Millennium mythology, congratulation's to a film maker who didn't feel the need to drown a great story with underlying cultural conventions. \n\nPublished: The Queanbeyan Age\nDate of Publication: 20/01/2012",
            "review_date": "2016-03-01",
            "source": "rt"
        },
        {
            "content": "Although some important details of Stieg Larsson's novel has got lost in this Hollywood adaptation, David Fincher suceeds in delivering a visually compelling, fast paced thriller that rises on the stunning performance from Rooney Mara as Lisbeth Salander.",
            "review_date": "2016-02-27",
            "source": "rt"
        },
        {
            "content": "One could probably write a dissertation about the layers, themes, and characters of The Girl with the Dragon Tattoo with only cursory mention of the murder mystery plot. Indeed, David Fincher's latest masterpiece and the source novel both are complexly thought-provoking beyond the confines of a film review. The two compliment one another beautifully; though the film doesn't show everything from the book or follow it quite to the letter (in fact, the film wraps up the story with haste, which is its only real problem), Fincher's vision for the story stays pretty much true to the source. Seeing the people, watching them work, and witnessing their personal failures, positive traits, and places in the world gives an added layer to the story that nicely supplements the written word and helps tie together some of the ideas and themes that are fully explored in the book but that seem a little more obvious when watched rather than read. The movie is expertly crafted and the performances are superb, with Rooney Mara turning in one of the most complex and nuanced performances in quite a long time, a performance certainly deserving of more than an Oscar nomination. The Girl with the Dragon Tattoo has the potential to disturb its audiences with its graphic dealings and decidedly adult-oriented themes, but it's one of the top must-see films of 2011.",
            "review_date": "2016-02-24",
            "source": "rt"
        },
        {
            "content": "Well acted, beautifully shot, well made plot and Rooney Mara putting a lot of dedication to her role. The Girl with the Dragon Tattoo is a dark thriller that will make you immediately interested. The only flaw that I had with this film is that I felt that rape scene should've been handled differently rather than actually show it happening. I'm not the type of person to be like \"This movie is disturbing and violent I hate this vial crap!\" one of my favourite films of all time is Seven which ironically is also directed by David Fincher, but I felt that rape scene was unnecessary to show. That's my only flaw, this is a very well directed movie that you should definitely watch.",
            "review_date": "2016-02-06",
            "source": "rt"
        },
        {
            "content": "Wao! Excellent movie!!\n\nFavorite Quote: \n\"They say that I'm insane. No, it's okay, nod. I am insane.\"",
            "review_date": "2016-02-01",
            "source": "rt"
        },
        {
            "content": "I've yet to see a Fincher film that bored me (maybe it's time to watch Alien 3), and this film doesn't show it's length and kept me engrossed from beginning to end. It's also, surprisingly, the most brutal out of all Fincher's movies (dethroning Se7en, which I didn't expect).",
            "review_date": "2016-01-08",
            "source": "rt"
        },
        {
            "content": "A great film though if you have seen the original some of the twists won't be thrilling as they were the first time. Great casting, score and performances. It's a great remake but the story doesn't offer many surprises if you seen the original.",
            "review_date": "2016-01-05",
            "source": "rt"
        },
        {
            "content": "Extraordinary movie. I am really glad that Hollywood have a director that is not afraid to put himself out and make a legit detective movie like this one.",
            "review_date": "2016-01-04",
            "source": "rt"
        },
        {
            "content": "A re-make worth watching",
            "review_date": "2015-12-30",
            "source": "rt"
        },
        {
            "content": "Stylish take on the novel with an excellent and committed performance from Rooney Mara.",
            "review_date": "2015-12-21",
            "source": "rt"
        },
        {
            "content": "a more than adequate remake of an already spectacular foreign film. Why a sequel hasn't been made is beyond belief.",
            "review_date": "2015-12-14",
            "source": "rt"
        },
        {
            "content": "A very smart thriller, this film never gets boring, despite its relatively long length, due to its endlessly fascinating plot. It is a very confusing movie (in a good way) because of its very detailed and meticulous story, and it has very good character development.",
            "review_date": "2015-12-06",
            "source": "rt"
        },
        {
            "content": "First off the amount of layers to this film leaves you wishing to watch it immediately after the first screening.  Some may find the idea of dropping a major plot point for the majority of the movie just to revive it in the last 20 minutes a bit out of place, but I thought it was a great way to remind us the point of the two protagonists investigation in the first place, and reveals how daniel craigs personal gain transitions into full dedication to the family's mystery, almost leaving the original motive invisible for a great portion of the film. Although clearly a \"style over substance\" picture I found the substance to be intriguing for the entire film, never leaving you wishing for more depth. Great movie!",
            "review_date": "2015-12-03",
            "source": "rt"
        },
        {
            "content": "A dark thrilling mystery from David Fincher with two incredible lead performances from Craig and Mara.",
            "review_date": "2015-11-14",
            "source": "rt"
        },
        {
            "content": "It's one of those movies that's so good, yet it's kind of hard to watch again.",
            "review_date": "2015-11-12",
            "source": "rt"
        },
        {
            "content": "It is possible to be too gritty",
            "review_date": "2015-11-08",
            "source": "rt"
        },
        {
            "content": "Rooney Mara delivered an Oscar-worthy performance, along with a dark and mysterious tone, great plot twists, and a mesmerising direction by David Fincher.  But at times, the movie becomes inconsistent and boring.",
            "review_date": "2015-11-06",
            "source": "rt"
        },
        {
            "content": "Engrossing, yet brutal, adaptation of the international best seller. Great performances all around (especially Mara as Lisbeth Salander), a unique title sequence and gripping suspense throughout. An improvement from the original Swedish film, but not by much.",
            "review_date": "2015-10-31",
            "source": "rt"
        },
        {
            "content": "Based on Stieg Larsson's posthumously published crime thriller trilogy, \"The Millennium Series.\" The book describes the mystery surrounding the long-unsolved disappearance of an heiress. A journalist recently dinged by a libel case and a young female hacker try to resolve it, stirring up bundles of personal and industrial corruption along the way. (Sony Pictures)",
            "review_date": "2015-10-21",
            "source": "rt"
        },
        {
            "content": "Compelling story very well-told. The beginning was a bit slow but the pace picked up very quickly. Wonderfully stitched together and the colour tone of the movie reminds me of the dreary Swedish weather I experienced. \nLoved it!",
            "review_date": "2015-10-13",
            "source": "rt"
        },
        {
            "content": "A fan of Fincher since his first \"proper\" film (discounting Alien 3, of course) and all the followings, I am always fascinated by his obsession with the illustration of inhumanity in all forms. Almost all of his characters (the leading ones) are either very crazy or kind-of crazy but in a very strange way. As much as I deeply love his different angles of such craziness, I always find the films where he \"paints\" such inhumanity in a sympathetic way, like \"Seven\" (one of my all-time favourites), \"Fight Club\" (Brad Pitt's utmost craziness did not impress me, but Ed Norton's and others' human vulnerability is always refreshing), \"The Curious Case of Benjamin Button\", or \"Zodiac\". Fincher has been revered most and foremost for his technical superiority - perfect colourization, perfect cinematography, perfect editing, perfect soundtrack, but I admire his human depiction of his somewhat inhuman characters more than anything else - he crafts them with care, with kindness, with the profound understanding about their fates, their characteristics, their emotional vulnerabilities. Such care makes me feel relatable, give me a look at the hidden corners of our everyday life (this may be the reason why \"Zodiac\", despite being shadowed by two very excellent films in the same year - \"There Will Be Blood\" and \"No Country for Old Man\" - both about inhumanity at the extreme, is still loved as one of Fincher's very best - not because of its mystery or technical perfection, but because of its extremely sensitive touch on the fates of seemingly-strong-but-actually-very-vulnerable characters). This is the reason why I enjoy \"The Game\", \"Gone Girl\", or \"The Social Network\" very very much, I cannot consider them the purest of \"Fincherism\". The complexity and numerous twist-and-turns of the plots of these films make me feel that I am watching a \"gimmick\" about the technical prowess of Fincher rather than being presented with his heart, his soul (still, they are excellent films that I enjoy immensely, I just do not feel that they can represent who Fincher is as an \"auteur\" - even though I am sure that he does not care being an \"auteur\" or whatnot). \"The Girl with the Dragon Tattoo\" falls in this category. The film was perfectly made, with maybe one of the best, if not the best title sequence (the opening minutes) that I have ever seen (\"Skyfall\" also has an outstanding title sequence, but that film came out later, from the same company - Sony, so maybe there is some influence there) - bleak, confusing, techno, cold, dirty, inhuman - simply everything that the audience will experience watching the film, and even better, with a perfect soundtrack by Trent Reznor. Adapted from a very popular novel, the film's plot was able to distil all the best details from the book and retain the feeling of mysterious emptiness throughout its length with very, very tight editing, cinematography, colourization, set pieces. The weakest link of the film might be its leads - Daniel Craig's wooden face may be suitable for Bond, but not for the energetic journalist Mikael, Rooney Mara's appearance is spot-on, but she seemed to be too devoid of emotions, thus appeared more as a \"super-woman\" than an intelligent girl with a disturbing past (that Noomi Rapace translated perfectly from the novel's pages to the original Swedish adaptation). The rest of the cast were also very restrained, to the point that they seemed to be unenthusiastic about the prospect of acting in the middle of the North-Pole coldness of Sweden. Maybe that was not their fault, maybe that was because Fincher just wanted to experience with this \"foreign\" materials (this is the only film so far that Fincher adapted from a foreign novel) - maybe that is why he does not want to adapt the rest two books - one trial is enough for a successful experiment (and thankfully for the audience too, since the last two books are way less impressive than the first one, yes, I read and watched both the novels and the original adaptations). Still a very interesting film, but a lesser Fincher's film maybe.",
            "review_date": "2015-10-12",
            "source": "rt"
        },
        {
            "content": "I didn't completely understand it. I had the sound too low. Didn't want to disturb my horrible neighbours lest they retaliate.",
            "review_date": "2015-10-09",
            "source": "rt"
        },
        {
            "content": "One of fincher's best, not a flawless movie, but definitely a good one. It does the source material justice and is one of the best films of the past 5 years. This is also one of the mostly visually beautiful movies ever, with beautiful shots of the countryside that give the film an overall haunting tone. If your a fan of thrillers or the books definitely go watch this movie you won't be disappointed.",
            "review_date": "2015-10-08",
            "source": "rt"
        },
        {
            "content": "A film masterfully directed by David Fincher and an unbelievable performance by Rooney Mara.",
            "review_date": "2015-10-05",
            "source": "rt"
        },
        {
            "content": "Slow start but then kept on delivering.",
            "review_date": "2015-10-04",
            "source": "rt"
        },
        {
            "content": "Girl with shit her face.",
            "review_date": "2015-10-03",
            "source": "rt"
        },
        {
            "content": "David Fincher's version has some significant changes but keeps the dark and ardent atmosphere of the 2009 film, however it's hardly a match for the Swedish original.",
            "review_date": "2015-09-21",
            "source": "rt"
        },
        {
            "content": "Having not read the book or seen any of the adaptations, I wasn't sure what to expect after catching a few clips of it in the past, but I surprised myself by thoroughly enjoying the film. There are certainly some intense moments which I struggled with but overall a great film with a very interesting cast and make up set",
            "review_date": "2015-09-11",
            "source": "rt"
        },
        {
            "content": "A dark, captivating thrill ride, mastermind David Fincher delivers once again, providing quite a brilliant detective-style film based on the widely popular novel by Swedish author Stieg Larsson. From the opening scene, I was hooked on the compelling mystery forming around the intriguing characters, and I found myself paying attention to each little detail in the film, trying to find missing connections in the clues. From there, the story unravels in the most delightfully complicated of ways, delivering on a satisfying ending that sufficiently and believably ties up all loose ends.\n\nI can think of no one better to direct tension than David Fincher. This film is a fine example of this. Fincher's direction leads the film into brilliantly tense scenes, and I had to remind myself on numerous occasions that I was watching characters in a movie.\n\nHuge credit goes to the subtle, yet brilliant performance by lead actor Daniel Craig, who manages be the constant rock that keeps the film together. We as the audience follow Craig through the mystery, learning new information as he does. Rooney Mara, portraying the titular girl with the dragon tattoo, delivers an eerie, almost frighteningly good performance. You never quite know what her reaction to events will be, and just how far she'll go when she's pushed, which makes for really captivating cinema. Christopher Plummer and Stellan Skarsgård also deliver really top notch performances, embodying their characters with highly skilled ease.\n\nOverall, this film really surprised me with its sheer brilliance, and I wish Fincher were on board to continue the series. Sadly, sequels are not on the near horizon. However, I will most definitely be buying this film on Bluray.",
            "review_date": "2015-09-06",
            "source": "rt"
        },
        {
            "content": "Captivating mystery story. Well told. Daniel Craig and Rooney Mara have a competition of who's going to not overreach and it's delightful.\nMust watch,",
            "review_date": "2015-08-19",
            "source": "rt"
        },
        {
            "content": "The original is much better.",
            "review_date": "2015-08-15",
            "source": "rt"
        },
        {
            "content": "Lisbeth Salander is the kind of character that would normally be cast aside as the female counterpart to our testosterone infused hero, appreciated but still under-appreciated all the same.  But Salander doesn't live in the constraints of your average thriller: she exists in the kind of thriller that only rarely dives headfirst into theaters, the kind that snakes along the wet pavement with effective grit while The Prodigy plays in the background and cigarette smoke suffocates the misty air.  She's not a sexy Angelina Jolie but a deceivingly sexy goth-punk, bleached eyebrows and all.  Underweight and independent, we're immediately drawn to her: she's a heroine that doesn't look like a heroine but ends up saving the day and stealing the show.\n\tIn the Swedish adaptation of \"The Girl with the Dragon Tattoo\" (unseen by me), Salander was portrayed by Noomi Rapace with, as Roger Ebert puts it in his review of the film, \"unwavering intensity\".  In the American adaptation, released in 2011, she is played by Rooney Mara with ferocious authority, calm and cool in the most dangerous of situations, deadly when she needs to be.  Mara disappears so completely into the role that it will be hard, I imagine, for most audiences to succumb to her powers in a different role without referring back to this one.\n\t\"The Girl with the Dragon Tattoo\" would already be an excellent murder-mystery if it relied on story alone; its stunningly structured characters (and the cast playing them) work as additional shots of caffeine that give the plot enough staying power to keep our interest for the 158 minute running time (which zig zags along with the agility of a rabid cheetah).  It's unconventional, moodier than your average Chris Nolan foray and more misanthropic than your misogynists, misandrists.  But the cynicism is intoxicating, as if David Fincher reconfigured the glamorization of death in murder ballads and threw them onto the screen for us to inhale.  Yet \"The Girl with the Dragon Tattoo\" doesn't tread into contrived darkness; it strolls along cloaked in convincing darkness, so hypnotizing because it knows the brutality life has to offer and doesn't just stand by like a victim.  It wants to fight back, setting fire to the past and coming alive in the treacherous electricity of the present.\n\tThough the film is entitled after its central heroine, the lead of \"The Girl with the Dragon Tattoo\", in actuality, is Mikael Blomkvist (Daniel Craig), the newly disgraced co-editor of \"Millennium\" magazine.  Having just lost a libel suit against tycoon Hans-Erik Wennerström, he plans to take a much-needed vacation, gather his thoughts and figure out where his now-controversial life will be headed next.  At least, that's where he thinks he's going: after hiring Salander (a gifted hacker) to conduct an extensive search on Blomkvist, business giant Henrik Vanger (Christopher Plummer) invites him to his barren island home and proposes the unproposable; if Blomkvist investigates and eventually solves the 40-year-old murder of his grandniece, Harriet, he will exchange unreleased information about Wennerström that could give Blomkvist's career a much needed needle to the chest.  Complications arise, however, when Blomkvist and Salander join forces and dig deeper into the Vanger family's shocking past; there, they find long buried secrets better kept unearthed than out in the open.\n\tThe leads of \"The Girl with the Dragon Tattoo\" are not of Tom Cruise clean-cutishness but of fragmented Max Rockatansky depressiveness, committed to bringing justice to the corrupted nooks and crannies of the world but hardly able to provide closure to their damaged psyches.  That's what makes the film so tremendously sensational; while the story magnetizes with its abundance of second guesses, false leads, and red herrings, the leading characters are compelling enough to work as fragile individuals who could head a meaty character study without all the sin-infused iciness.  Throughout the course of \"The Girl with the Dragon Tattoo\", Salander is raped, Blomkvist shot, tortured, stalked; Salander tells horror stories of her past, while Blomkvist continuously puts his life on the line for his career.  But consider that Larsson's original material doesn't allow them to become victims of their own tragedies (Salander gets satisfying revenge on her rapist more methodical than Beatrix Kiddo could have ever dreamed, while Blomkvist repeatedly regains composure after having his world shattered over and over again).  They are survivors.  Craig and Mara are outstanding.\n\tMore poised to get under your skin than most films, \"The Girl with the Dragon Tattoo\" is an unforgettable experience, from the eerie crackling of Fincher's atmosphere to Mara's staggering transformation.  A must.",
            "review_date": "2015-08-06",
            "source": "rt"
        },
        {
            "content": "As usual fincher brings his A game",
            "review_date": "2015-08-06",
            "source": "rt"
        },
        {
            "content": "Sick, crazy but awesome!",
            "review_date": "2015-08-05",
            "source": "rt"
        },
        {
            "content": "The Girl With the Dragon Tattoo is filled with drama and suspense, but I have to admit, this is not among Fincher's best works.\n\nFull Review: http://wadesthoughts.com/2015/08/03/the-girl-with-the-dragon-tattoo-review/",
            "review_date": "2015-08-03",
            "source": "rt"
        },
        {
            "content": "Great Adaptation of the book. A lot of the side story was left out that elaborated the ending more, as well the alternate ending was less grand but was a good watch.",
            "review_date": "2015-07-06",
            "source": "rt"
        },
        {
            "content": "Definitely interesting.... female lead was very good.",
            "review_date": "2015-06-17",
            "source": "rt"
        },
        {
            "content": "6.3/10 — \"Okay\"/\"Watchable\"",
            "review_date": "2015-06-10",
            "source": "rt"
        },
        {
            "content": "Sure David Fincher is amazing with the camera work but I felt that this film had a lot of repetitive aspects from his other films, even in the way the movie wraps up.At the end of the day Rooney Mara pulls off the best heroine role.",
            "review_date": "2015-06-02",
            "source": "rt"
        },
        {
            "content": "Another brilliantly well crafted thriller from the modern master, David Fincher. The only issues being excessive product placement and a hammy, boring villain. \nGrade: B+",
            "review_date": "2015-06-01",
            "source": "rt"
        },
        {
            "content": "This should have been a good junk movie but takes its self way to seriously I squirmed through the run time,Rooney Mara createsan interesting Character but Craigs a bit of a dingus whos central character drags the first half down and is then overshadowed by Maras far More interesting lisbeth as time passes I can see Fincher being less and less interested in returning to this numbing possible franchise",
            "review_date": "2015-05-23",
            "source": "rt"
        },
        {
            "content": "A captivating and dark thriller, David Fincher's take on the Swedish-originated film is mesmerizing and exactly what you want from a movie of its caliber. Rooney Mara shines brightly as Lisbeth Salander and hits on every move and action to make her characterizations memorable and realistic. A strong supporting cast and leading man, Daniel Craig, follow in the wake with just as impressive, endearing and mysterious results.",
            "review_date": "2015-05-09",
            "source": "rt"
        },
        {
            "content": "An inmensely enjoyable and intriguing mystery thriller with a grim tone and a hypnotic performance by Rooney Mara.",
            "review_date": "2015-04-21",
            "source": "rt"
        },
        {
            "content": "You gotta love it when you come late to the party & you didn't miss out on a thing. I only recently watched this movie and damn I was surprised to find that I hadn't watched this earlier. This is a great crime/detective story with the right amount of grit that makes you squint but totally gets you to feel like the stakes are high. Rooney Mara kills it as Lisabeth & I love how the movie story starts in two separate streams & then links into one. Well worth the watch!",
            "review_date": "2015-04-07",
            "source": "rt"
        },
        {
            "content": "F\n\n8.1\n\n[David Fincher]",
            "review_date": "2015-04-03",
            "source": "rt"
        },
        {
            "content": "I prefer the original Swedish version which is more gripping and entertaining at the same time",
            "review_date": "2015-04-01",
            "source": "rt"
        },
        {
            "content": "After watching the original Girl with the Dragon Tattoo, I went in to the remake with no thoughts coming in and not be thinking that it's going to suck because it's a remake. David Fincher's The Girl with the Dragon Tattoo is just as amazing as the original, if not, better than it. They made the movie very different from the original, but still manage to create the same story which kudos to David Fincher and Steven Zaillian for knowing how to make a remake stand out on its own. The characters are just as memorable as the original, and it created the characters a bit differently too which I appreciated. Rooney Mara is outstanding in this and whether people would ask whether she's better or Noomi Repace, I have no idea because I think that they are equally excellent in it and they never seem to be acting the same. Daniel Craig is great in it and he has some funny moments in it which the original never seem to have. The chemistry between the two leads are great, and the soundtrack by Trent Reznor and Atticus Ross is really good. The opening title is the best opening I have ever seen. The effects were amazing in the opening, and Trent Reznor and Karen O.'s cover version of Led Zeppelin's Immigrant Song is really catchy which is rare because I'm not much of a fan of metal rock. The ending is not as great as the original, but it's still a good ending that is nothing like you seen before. David Fincher's The Girl with the Dragon Tattoo is one of the rare remakes that worked, one of the best remakes in a long time, and I hope that they make the sequels with the same crew, same director, and same writer as I know that they can only serve the source material justice.",
            "review_date": "2015-03-15",
            "source": "rt"
        },
        {
            "content": "Creepy as hell, at times dirsturbing and brutal, only Fincher could pull off a great \"remake\" from the original great film, Rooney Mara went very deep into her role, the chemistry and romance between Mara and Craig was odd and beautiful at the same time, Fincher's direction is at its best, the editing and cinematography were great, and also was the commitment of the cast",
            "review_date": "2015-03-07",
            "source": "rt"
        },
        {
            "content": "I seen the original some years back (its subtitled) cant remember everything about the original so it was time to check this one out. there probably equally as good.",
            "review_date": "2015-03-02",
            "source": "rt"
        },
        {
            "content": "Bleak, immersive, harrowing and yet somehow hopeful, the Hollywood adaptation of The Girl with the Dragon Tattoo finds David Fincher at the height of his powers, along with a legendary performance from Rooney Mara.",
            "review_date": "2015-02-20",
            "source": "rt"
        },
        {
            "content": "finally i saw it..  really good i enjoyed it",
            "review_date": "2015-02-17",
            "source": "rt"
        },
        {
            "content": "One of the greatest mystery thrillers I have ever seen hands down! Rooney Mara was completely unrecognizable as Lisbeth",
            "review_date": "2015-02-08",
            "source": "rt"
        },
        {
            "content": "Even though I prefer the original Swedish movies and books when it comes to the story and characters, I cannot deny that this is a really well crafted thriller from the always excellent David Fincher. The cinematography is gorgeous, the music by Trent Reznor & Atticus Ross is haunting and great and the performances are really great as well. I will not deny that I really liked this movie.",
            "review_date": "2015-02-03",
            "source": "rt"
        },
        {
            "content": "Remakes don't come often but this one was worth the wait.Its performances and the dark and gritty atmosphere created by Fincher makes for one incredible movie that I can watch over and over.",
            "review_date": "2015-01-31",
            "source": "rt"
        },
        {
            "content": "Its shocking opening title sequence implies that the movie is an entertainment of high quality and the implication never fails. It's not just a whodunit nor just a thrilling actioner but a portrayal of the titled girl as well. Rooney shows amazing performance as the girl who is mentally challenged with dark past and not good at expressing herself so that the girl's mind can be read. Its screen time is more than 150 minutes but it's fully enjoyable.",
            "review_date": "2015-01-30",
            "source": "rt"
        },
        {
            "content": "As gritty and slick as David Fincher gets. Brilliant performances and a great script only enhance the phenomenal source material. Full review later.",
            "review_date": "2015-01-30",
            "source": "rt"
        },
        {
            "content": "A very fast paced, fantastically edited and quite intense piece. David Fincher's style of film-making really captures the essence of crime-thriller!",
            "review_date": "2015-01-28",
            "source": "rt"
        },
        {
            "content": "My respect for David Fincher as a director is tested most when I come across a film from the man which I don't find nearly as satisfactory or compelling on both a technical and storytelling level than the rest of his exploits, most of which I greatly enjoy. Seven was an entertaining and riveting escapade, The Social Network featured an all star cast and an impeccable screenplay from Aaron Sorkin, and Gone Girl's unpredictability and social commentary lends itself to great acclaim. The Girl With The Dragon Tattoo, a remake of a literary adaptation, is his least impressive work to date (out of the four I've seen), featuring overbearing editing, another atrocious work from Trent Reznor and Atticus Ross, a lack of engaging material and the issue of multiple endings. It's a bit of a mess in much of its form, and it rushes itself. It's also somewhat incoherent in its plot at various points, and unlike Inherent Vice, I'm not willing to put that down to director's intention.\n\nAll that said, Dragon Tattoo is still a reasonably entertaining, gripping criminal drama that encapsulates evil, deceit and death, and uses interesting and resonant characters to explore such. Led by Daniel Craig who plays disgraced journalist Mikael Blomkvist, Dragon Tattoo centres around Blomkvist's attempts to unravel an intriguing plot about a missing girl's disappearance from a famous and rich family forty years prior. As Blomkvist's research and investigation into who may have taken or killed the girl intensifies, he recruits a troubled and supposedly \"mentally incompetent\" computer hacker, Lisbeth Salander, played by Rooney Mara. The two work together to attempt to uncover the truth on the matter, as well as to seek revenge for the public humiliation of Blomkvist.\n\nConstructed with darkness and minimal lighting at the forefront, the thing that Dragon Tattoo has going for it best is undeniably its cinematography, lighting and atmosphere. It is a film which encapsulates the dread of its story with pristine clarity, and forms a mood that is devoid of emotion but utterly enthralling. Fincher fully realises the worlds he is creating, and the intimacy of some locations contrasts with the broad scope of others, and he never forgets to provide detail in all of those aforementioned shooting sites. Basically, he constructs living and breathing worlds full of people that seem somewhat realistic. Like that of the rain in Seven or the rich lighting in The Social Network, Dragon Tattoo has a black and white colour palette and snow; for someone who has a strange infatuation with cold weather in film (particularly rain, as I believe it fleshes out any location or situation and makes it feel more real or alive), this is the dream.\n\nTo boot, Dragon Tattoo also possesses some exquisite performances, namely that of Rooney Mara's as Salander. Her dedication to her role is utterly palpable, not just due to her willingness to go nude or embrace a large quantity of piercings, but because of her dark nature. She's completely embellished in the performance she's giving, and whilst it's perhaps not as memorable as other memorable Fincher performances, such as Kevin Spacey in Seven or Rosamund Pike in Gone Girl, it is absolutely applaudable. Daniel Craig's work here is also immensely impressive, his performance of the character Blomkvist amiable and brave. The latter perhaps not to the extent of her co-stars, but still commendable all the same. The rest of the ensemble is note-worthy, Stellan Skarsgard and Yorick van Wageningen in particular giving riveting performances worthy of individual credit.\n\nWhere the issues start to enter the forefront is namely in terms of the score, which whilst not as perpetually irritating and neutral as The Social Network, is undeniably simplistic and plain. Composers Trent Reznor and Atticus Ross are often not capable of producing anything more than atmosphere for their Fincher projects, their works for Gone Girl and The Social Network never enunciating emotion or activity, but just humming in the background (or droning loudly, consuming the entire soundscape). The same can be said for Dragon Tattoo, but it's slightly less irritating in this situation, a semblance of thematic consistency and logic in place. That said, something like this is not exactly impressive or worthy of an Academy Award nomination. For those who wish to attack me on my position towards the simplicity of this score when I enjoy the works of Hans Zimmer, a man who composes generally repetitive works, I believe it's down to the fact that at least his work somewhat crescendos or develops. That and he possesses thematic consistency and the ability to reprise his ideas without blatantly reiterating them without change from the prior inclusion Much of Dragon Tattoo just stays at the same volume, lacking fluctuation or variation. It's boring and blatantly lazy. No, it's not difficult to hold down a key on the ambiance setting on a keyboard. It's not a hard job. The Social Network and Gone Girl were far worse in terms of general composition (I still don't get why In The Halls of The Mountain King was ever used for The Social Network, especially when it doesn't contain the size, scope or organic nature of the orchestral recording), but this isn't necessarily good.\n\nBut whilst I generally expect Reznor and Ross' efforts to yield little more than repetitive structures that don't contain a smidge of thematic consistency, I didn't expect to find that much of the editing within a Fincher film could be so irritatingly quick. Whilst cinematographer Jeff Cronenweth's work is predictably brilliant, the editing is far less fluid than it usually is, illustrated by this clip; whilst Fincher effectively captures the different point of views on a visceral level for this scene, his usual trademark for dialogue sequences, the editing is a bit too frantic and quick for the specific situation, and until the final shot of the scene, we don't get a hold which feels natural and relaxed. This is a small example for a huge film which contains many situations featuring such an issue, and although many won't notice it, I did. It's not overtly bad (I mean, we're not talking about Lee Smith's for The Dark Knight for crying out loud), but for a Fincher film, it's a drop in quality.\n\nAll that said, Dragon Tattoo is still an intriguing, albeit underwhelming criminal drama that is gloomy and mostly engaging. Its first act feels unfocused; the second act is impressively staged, acted and scripted, but the final act drags far too long, and whether or not the book stretches to such a finale is no matter; it felt overlong in this context. A case of The Return of the King complex, unfortunately, where the film doesn't seem to know where it wants to wrap up. Seeing as I haven't read the original literary material, I hold no biased for where I desire the story to start or end, so my opinion is based off little more than Fincher's interpretation of the material. That, and Steven Zaillian, the screenwriter's. It's a competent investigative story that has the individual pieces and often utilizes them to brutal or harrowing results, but can never seem to form a complete picture out of them.\n\nSo whilst Dragon Tattoo is not the most pristine Fincher film available, lacking the finesse that one desires from this talented individual, it is yet still an impressive feature that maintains an audience member's interest all throughout. It's cold, dark and atmospheric, and for one seeking a film of such a like, there are few better to recommend. And whilst I do not find it as compelling as everyone else, that doesn't mean I didn't enjoy my time here, as I did. An entertaining venture, this film falls short of being a triumph by any standard.",
            "review_date": "2015-01-26",
            "source": "rt"
        },
        {
            "content": "Mucho más espectacular que la original, Rooney Mara eres alucinante.",
            "review_date": "2015-01-20",
            "source": "rt"
        },
        {
            "content": "Lisbeth is kick @$$.\nRooney Mara should have played Catwoman in Dark Knight Rises.",
            "review_date": "2015-01-19",
            "source": "rt"
        },
        {
            "content": "A mesmerizingly twisted tale dripping in dread and gothic mystery with two fascinating characters in a brutal world.",
            "review_date": "2015-01-15",
            "source": "rt"
        },
        {
            "content": "Extremely dark and a little haunting, Girl With The Dragon Tat holds its own in comparisons with the Swedish version thanks to a great performance by Rooney Mara.",
            "review_date": "2015-01-15",
            "source": "rt"
        },
        {
            "content": "Really enjoyed this movie!  Looking forward to the sequels.",
            "review_date": "2015-01-14",
            "source": "rt"
        },
        {
            "content": "\"The Girl with the Dragon Tattoo\" is just a pleasure to watch, thank to Fincher's direction and the performances, especially Rooney Mara's one. The movie, in my opinion, is similar to Zodiac, but there's something authentic, maybe Lisbeth, a complex and well-written chatacter, This film is really stylish (no surprise), and it has an elegant touch, that makes it beautiful. The story itself maybe a little conventional for some people but it's craft it's amazing and you never know what it's going to happen until the end.",
            "review_date": "2015-01-09",
            "source": "rt"
        },
        {
            "content": "Better than the Swedish version, but there are still important differences compared to the plot of the book.",
            "review_date": "2015-01-03",
            "source": "rt"
        },
        {
            "content": "Something of a rarity to find an English remake of a foreign movie that is of a similar quality to the original. Great cast and moody settings and music make this a great watch whether you have seen the original or not. Highly recommended.",
            "review_date": "2014-12-31",
            "source": "rt"
        },
        {
            "content": "English version of The Girl With The Dragon Tattoo was pretty awesome. I liked it better than the other one cuz I understood everything maybe cuz I wasnt reading the subtitles the whole time but still. I def think Ill read the books. At least the 2nd and 3rd haha",
            "review_date": "2014-12-30",
            "source": "rt"
        },
        {
            "content": "Better than the Swedish version, but again, a rote copy of the book. How good can it be then?",
            "review_date": "2014-12-30",
            "source": "rt"
        },
        {
            "content": "Intelligent and captivating, The Girl with the Dragon Tattoo is excellent entertainment.",
            "review_date": "2014-12-27",
            "source": "rt"
        },
        {
            "content": "A stark and dark murder mystery, with an edge. Mara gives an excellent performance. AFI 1001",
            "review_date": "2014-12-27",
            "source": "rt"
        },
        {
            "content": "Lately, many of the movies I've been watching have been ruined for me because of their god awful pacing, for example: The Iceman. Luckily The Girl With the Dragon Tattoo, having a run time of 2h 38min, is long enough to fully develop its characters and story. The movie had to get the pacing right to work, and it did a great job at that. Director David Fincher is kind of like Tarantino in the way he's able to make these really long ass movies and have them feel like 90min. The movie pulls you in from the very first shot. The intro is filled with amazing imagery and a really kick ass electro version of Led Zeppelin's \"Immigrant Song.\" You want to learn the mystery behind the movie, and even though it's just a movie, it almost feels like you're watching real people. It's impossible not to be intrigued by the movie, yes, it's very long, but don't let that turn you off, it's masterfully made, and if you love complex psychological mysteries then you'll love this, and just so you know, I wouldn't really call this an art house movie. I mean yes, it is Oscar worthy, but Oscar contenders aren't necessarily art house movies. So if art house movies aren't your thing, you may still like this.",
            "review_date": "2014-12-25",
            "source": "rt"
        },
        {
            "content": "In this film, a smart tech-savvy investigator named Lisbeth (Rooney Mara) decides to help a journalist named Mikael Blomvist (Daniel Craig) investigate the serial murders of several women. The film is cool and sleek and Lisbeth is an engaging character for her practical wisdom. She knows how and when to use her judgment of a situation to prepare herself from danger, for instance, or to protect herself or others. The biggest problem, in my view, is a very brutal rape and torture dropped early in the film. Not only is it unsettling to audiences, but it seems quite exploitative both toward the character Lisbeth and the actress Rooney Mara who plays her. If that or the revenge sequence following it were not in the film, it would be an almost perfect celebration of a very prudent and brave woman whom we could all learn from.",
            "review_date": "2014-12-24",
            "source": "rt"
        },
        {
            "content": "Action drama / Action thriller that does let you breathe for one second",
            "review_date": "2014-12-20",
            "source": "rt"
        },
        {
            "content": "Daniel Craig proves he can be someone else besides Bond and Rooney Mara is nothing short of perfect. Drama, suspense, mystery, and a little bit of action and humor make The Girl with the Dragon Tattoo one of the best thrillers of the last two decades.",
            "review_date": "2014-11-27",
            "source": "rt"
        },
        {
            "content": "Good David Fincher flick. Nobody can portray the dark underworld of a murder investigation like David Fincher. Even though this is not as strong as his other movies like \"Se7en\" or \"Panic Room,\" I would still recommend this movie just because I really can't see anybody else, but Fincher directing this movie. The score for the film is so eerie that it almost gives you goose bumps just hearing it. Daniel Craig, who is nice to see doing something else other than the Bond movies, gives a very believe able performance as Michael Blo",
            "review_date": "2014-11-16",
            "source": "rt"
        },
        {
            "content": "Good rendition of the book, though I confess the Foreign Films are a step above the domestic fare.",
            "review_date": "2014-11-15",
            "source": "rt"
        },
        {
            "content": "Faithful adaptation of an excellent book",
            "review_date": "2014-11-11",
            "source": "rt"
        },
        {
            "content": "Remakes these days are usually panned before release and almost sentenced to eternal slander, before even making their release. This is no more true than when recent foriegn films are remade, no more truer than when it was announced that barely after the original remake of steig larsons millenium phenominon was shown in british cinemas, the Americans had green lit a remake. The fury of fans could be heard for months, \"How dare they?\" cried fan boys and girls. Then David Fincher released a red band trailer, with Trent Reznor and Karen O's pounding take on Immigrant Song flashing a barrage of violent and gorgeous images at our eyes. It was hard not to eat our own words. It's hard to judge a remake, especially one released so close to the original. One will always compare constantly and ultimately personal favorite will reside one or the other. But just as the original Girl With The Dragon Tattoo, had a very slow build up but successful time at the box office, it is in my most honest of opinions David Fincher's take is far superior. Disgraced journalist Mikael Blomkvist is forced to step down from his position at well regarded magazine Millenium after he loses a court battle to a very powerful business man called Vernnerstrom. Soon after he is approached by an elderly man called Henrik Vangor. Vangor proposes that Mikael stays at his family estate in order to help solve a murder case of his grand daughter Harriot, that took place in the 60's. Mikael soon falls into trouble and has to recruit the assistant Lisbeth Salander, the hacker who gathered information for Henrik on Mikael. The duo soon find themselves tied up in a family feud, a serial killer and a rapist parole officer. The previous, is just the tip of the iceberg as the film clocks in at a stonking 2 hours and 40 minutes. But unlike the original, this one does not burn slowly, it thunders through, allowing it to tell more of a story and have less computer nonsense on screen at any given time. This gives us more time with the plot and the characters. Fincher also decides to study the relationship between Lisabeth and Mikael in greater detail, which as im led to believe is more faithful to the books. The cast are all top notch, Rooney Mara is perfect as Lisabeth, giving a detached and haunting performance, that ultimately wins our hearts over from the get go, her constant struggle continues to the bitter end and we as the audience cant help but be with her every step of the way. Daniel Craig is the master of under acting and its perfect here, little mannerisms here and there, like how Mikael wears his glasses when he doesnt need them or his inability to use a mac as quick as Lisabeth, really lend well to the character, making him feel like a character rather than a performance. Stellan Skargard also puts in a powerful performance as Harriots Brother, aiding Mikael as best as he can. The most stand out however is Christopher Plummer as Henrik, he has very little screen time, on the grand scheme of things, but his performance gives us the shivers and tugs at the heart strings, as he searches for over 40 years to find his grand daughter, his torture can be felt in his voice, a rare thing for an actor to achieve. The pacing as mentioned, is super slick, for Fincher, quite possibly his best, he continually bombards you with a multitude of visual and audio information as the plot heads like a skud missile towards an enemy base. By this point there is alos no need to say that the visuals are beyond stunning and meticulous, bar the very infrequent CGI shot that lasts no longer that 2 seconds. This film has a whole lot to offer, its rich in story telling, its gorgeous, the music by Trent Reznor again is haunting and gorgeous, the acting is of an extremely high caliber and unlike what came before, it ends in such a way that it is satisfying as a single story, meaning if a sequel never gets made, it will not damage it. There are a few nit picks, Daniel Craig for example seems to be the only one not sporting an accent, but were so engaged throughout we forget about it after 5 minutes. Also the film decides to wander into the second books territory as its end rather than stick firm on where the main focus of the story feels it should end. It works however and what were left with is an excellent crime thriller, that should not be underestimated, even by die hard fans of the original.",
            "review_date": "2014-11-04",
            "source": "rt"
        },
        {
            "content": "This film was extraordinary - the exact kind of gritty, neo-noir crime film I've been waiting for, made even darker by the pulsatingly electronic score by Trent Reznor and Atticus Ross. I went into this film already knowing the entire plot, from spoilers, but it nonetheless kept me enthralled by a masterful rhythm which has all the right tonal shifts in the right places - from mystery, to tension, to horror, to sadness. The casting couldn't have been better... this is truly the adaption that the source material deserves.",
            "review_date": "2014-11-01",
            "source": "rt"
        },
        {
            "content": "Can't help but feel that the lenght here is sometimes too much, but with top-notch suspense and acting performances, it strikes as a worthy blockbuster with some sick cinematography.",
            "review_date": "2014-10-19",
            "source": "rt"
        },
        {
            "content": "Solid performances from Rooney Mara, Daniel Craig, Stellan Skarsgard and Christopher Plummer, great direction from David Fincher, amazing cinematography, editing and music, and a mystery filled with all sorts of twists and turns help the nearly 3 hours fly by really fast. 10/10.",
            "review_date": "2014-10-18",
            "source": "rt"
        },
        {
            "content": "This is an intriguing, on-the-edge thriller that was so carefully adapted from the pages of Stieg Larsson's bestseller.",
            "review_date": "2014-10-15",
            "source": "rt"
        },
        {
            "content": "Best movie of 2011 hands down. Fincher as always brings the sickness and dark side of movies. Mara and Craig did great together. Can't wait to see the next one.",
            "review_date": "2014-10-13",
            "source": "rt"
        },
        {
            "content": "Love the immigration song by Led Zeppelin. Extremely scary rape scene. Creepy movie about the worst kind of sex murderer and Daniel Craig solving the mystery. Saw it with the Carleton Crowd in theatres.",
            "review_date": "2014-10-10",
            "source": "rt"
        },
        {
            "content": "I have not read the books, nor have I seen the original version of the movie.  Therefore, some of my pet peeves about the Girl with the Dragon Tattoo may lie somewhere in the story itself rather than the editing.  Don't get me wrong.  The movie is great.  I immensely look forward to sequels.  Rooney Mara's performance alone is enough to want to see the series continue.  The entire cast is fantastic, but what seemed to bug me most during the movie is the extended amount of time spent on some elements of the story, like her being a ward of the state, but how much time wasn't spent on explaining the backstory re: Daniel Craig's lawsuit and relationship with Robin Penn.  A lot effort was spent building up the need for Christopher Plummer to hire Daniel Craig to solve this mystery, yet very little into connecting Craig and Mara together.  For someone so unsociable, she unnaturally connected quickly with Craig.  Then, when it was all said and done, the story seemed to wrap up too quickly as compared to the build up.  So, while the story was good, the directing was good and the cast was good, the piecing together of the film itself seemed haphazardly done.  Was this editing? Was it the story itself? At 2:34 long, I would have expected a better flow, but nonetheless, my high expectations were met and I look forward to more.",
            "review_date": "2014-10-09",
            "source": "rt"
        },
        {
            "content": "I saw the original trilogy. And I love it. This American version of it its quite good. The director didn't change a lot from the story. That's a nice move in my opinion.",
            "review_date": "2014-10-05",
            "source": "rt"
        },
        {
            "content": "While Fincher's trademark cynicism is noticeably absent, \"The Girl with the Dragon Tattoo\" should prove a reasonable diversion for fans of Fincher's work, even if it's not up to par with, say... Fight Club or the Social Network.",
            "review_date": "2014-10-02",
            "source": "rt"
        },
        {
            "content": "Every time I see a Fincher film I feel as though it's perfect. Maybe not to me, but to him. He doesn't care about the audience because he made a perfect film in his eyes, and I find that really interesting. That being said, this is the perfect thriller.\n\nPessimistic and uncomfortable as it may be, this is an amazing cinematic achievement and potentially Fincher's most underrated work.\n\nHe doesn't try to do the original justice beyond the story, because he's not making that film. He's not making the novel or the Swedish film, he's making something that's entirely his own and you can see that in every single solitary frame of this masterpiece.\n\nFincher makes the kinds of movies that make me want to make movies again. He's a madman, but he's also a complete genius.",
            "review_date": "2014-10-01",
            "source": "rt"
        },
        {
            "content": "Another Dark, grim masterpiece from Fincher, with an amazing performance by Mrs. Mara, beautiful dark visuals and a complex yet engaging plot this is one Mystery you won't want to skip",
            "review_date": "2014-09-29",
            "source": "rt"
        },
        {
            "content": "As we we all know the 2009 version of the The Girl with the Dragon Tattoo is silent but powerful which gives its first success for the Millennium trilogy. On the other hand, Fincher's version is more likely into the detail with deep artistic cinematography and fast paced storytelling thinking you will not appreciate it on some different scenarios. Still the Swedish version has still the heart to own.",
            "review_date": "2014-09-29",
            "source": "rt"
        },
        {
            "content": "A mostly soulless telling of a great modern mystery story. Fincher still has a great eye for staging shots, but here it feels like he is just following a checklist of scenes from the book. The performances are fine all around, though I much prefer Noomi Rapace to Rooney Mara. \n\nThe pacing is also a major issue in this version, as many scenes feel rushed and others just pointless. My other complaint is this version features some scenes that were tweaked for unnecessary shock value. The Swedish film got the point across in the same scenes without dragging them out, but Fincher seems to revel in trying to make the viewers squirm here. Instead, it just rings hollow and self-indulging of the director.\n\nOverall, a decent film. If at all possible though, find the Swedish version and enjoy one of the best modern mysteries on film.",
            "review_date": "2014-09-25",
            "source": "rt"
        },
        {
            "content": "Perhaps I was expecting a bit too much but with all the praise I was expecting greatness and instead what I got was a good film that really never stands out from others of its genre. The Girl with the Dragon Tattoo isn't really memorable and other than some fine acting and plot twists really never lives up to its hype.",
            "review_date": "2014-09-22",
            "source": "rt"
        },
        {
            "content": "Hard hitting suspense thriller by Fincher and unforgettable performance by Rooney mara makes this movie astonishing.",
            "review_date": "2014-09-18",
            "source": "rt"
        },
        {
            "content": "Way better than the Swedish film",
            "review_date": "2014-09-16",
            "source": "rt"
        },
        {
            "content": "Captivating, suspenseful, and powerful, David Fincher succeeds once again with another masterful crime thriller, benefiting from Rooney Mara's excellent job as the titular character.",
            "review_date": "2014-09-13",
            "source": "rt"
        },
        {
            "content": "88%\nWith a bleak tone and a talented cast, David Fincher's adaptation of the Swedish best-seller makes for a stunning watch.",
            "review_date": "2014-09-03",
            "source": "rt"
        },
        {
            "content": "Very well acted, with interesting and boring moments from beginning to end. Not really my cup of tea, but it is good.",
            "review_date": "2014-08-23",
            "source": "rt"
        },
        {
            "content": "Well I don't see what's that great in that movie, I generally think that murder investigations don't belong on the big screen. There are already enough TV shows about that. They have to be really good for my taste to be able to stand their own on the big screen.\nAlso I felt the beginning was rather slow going, just like almost the whole thing.  All in all I've seen better detective movies with more excitement in them.",
            "review_date": "2014-08-21",
            "source": "rt"
        },
        {
            "content": "The drama is gripping, it's very brutal in places, but this is a very good film that deals with murder and mystery. I really liked Daniel Craig in the movie, Rooney Mara was great, and the chemistry between the two was superb.",
            "review_date": "2014-08-19",
            "source": "rt"
        },
        {
            "content": "No way near as good as the Swedish? version!!",
            "review_date": "2014-08-18",
            "source": "rt"
        },
        {
            "content": "Dark, atmospheric, and terrifically acted. This is yet another great crime/mystery film by David Fincher.",
            "review_date": "2014-08-13",
            "source": "rt"
        },
        {
            "content": "well done rooney mara",
            "review_date": "2014-08-04",
            "source": "rt"
        },
        {
            "content": "\"I want you to help me catch a killer of women.\"\n\nThe mastermind David Fincher brings the story of The Girl with the Dragon Tattoo to life thrillingly and provokingly. Rooney Mara and Daniel Craig prove to be an epic duo which the film and story uses smartly. The film can be suspenseful and shocking or mystifying and mind-bending but in the end its all thoroughly entertaining.",
            "review_date": "2014-08-03",
            "source": "rt"
        },
        {
            "content": "Totally missed the essence of the original movie. Good actors can't save it. Watch the original swedish movie, it's still the best.",
            "review_date": "2014-07-31",
            "source": "rt"
        },
        {
            "content": "Dark, brutal, and mysterious, David Fincher's The Girl with the Dragon Tattoo thrills and chills the viewer for the entire runtime while boasting amazing performances, especially from Rooney Mara.",
            "review_date": "2014-07-27",
            "source": "rt"
        },
        {
            "content": "Good performence by the main actors but boring and predictable plot.",
            "review_date": "2014-07-27",
            "source": "rt"
        },
        {
            "content": "I couldn't leave the movie from the begining till the last third of it where the events got so weird and not convincing!?",
            "review_date": "2014-07-22",
            "source": "rt"
        },
        {
            "content": "Dark and thrilling, the Americanized version of the popular novel is a great film.",
            "review_date": "2014-07-17",
            "source": "rt"
        },
        {
            "content": "I so wanted to see Harriett running an Australian ranch.",
            "review_date": "2014-07-15",
            "source": "rt"
        },
        {
            "content": "While there is no doubt that the film is wonderfully directed with style from the great David Fincher, stellar images produced by his cinematographer Jeff Cronenweth, a superlative soundtrack from Reznor and Ross and an Oscar-worthy performance from Rooney Mara, the film is packed with so much dialogue that often I was wondering how the characters were figuring things out themselves. It was this idea that the film began to lose me, and the film lost a potential fifth star.",
            "review_date": "2014-07-11",
            "source": "rt"
        },
        {
            "content": "Our Lord David Fincher has yet to disappoint.",
            "review_date": "2014-07-08",
            "source": "rt"
        },
        {
            "content": "Bon film, trÃ¨s bien rÃ (C)alisÃ (C). Cependant, trÃ¨s complexe. Pour diminuer la complexitÃ (C),  il aurait fallu plus de dÃ (C)tails.  Avec les 2h30 de ce film, il aurait pratiquement fallu 2 parties. Il y a un certain manque de profondeur dans les personnages. Je trouve le choix de scÃ¨nes coupÃ (C)es intÃ (C)ressant!",
            "review_date": "2014-07-06",
            "source": "rt"
        },
        {
            "content": "Good movie but extremely graphic rape scenes.",
            "review_date": "2014-07-03",
            "source": "rt"
        },
        {
            "content": "Although the plot and final reveal are somewhat unclear, The Girl with the Dragon Tattoo, is brilliant.  This is due to fantastic acting, cinematography, music, and wonderful building of drama.  The acting, done by Daniel Craig and Rooney Mara are phenomenal.  The cinematography and music play along beautifully with the story.  There is the sense of madness, throughout the entire movie.  Madness, from Lisbeth, madness from serial killers, madness from an uncertainty of where the plot will go.  I have rarely seen music go so well with film.  The Girl with the Dragon Tattoo is fresh to death.  It's a wonderful, dark, and exhilarating movie.  Seriously go watch it.",
            "review_date": "2014-07-02",
            "source": "rt"
        },
        {
            "content": "Good story, very intense, very sexual.",
            "review_date": "2014-07-01",
            "source": "rt"
        },
        {
            "content": "Disgraced journalist Mikael Blomkvist teams up with a brilliant hacker and loner Lisbeth Salander in order to solve a 40-year-old mystery that has plagued the scion of a powerful family. David Fincher you did it again, You made another dark but brilliant film. the last time I sawed Rooney Mara was in the 2010 remake a nightmare on elm street and she was terrible in that movie but in this film she is fantastic and to be honest I never know she was a great actress, Daniel Craig was also great in this film and so did the other cast.",
            "review_date": "2014-06-30",
            "source": "rt"
        },
        {
            "content": "Good one. The story is very good and complicated, classic R-rated thrilling story. Different experience.",
            "review_date": "2014-06-29",
            "source": "rt"
        },
        {
            "content": "There's a few small changes in this English language remake but it's essentially the same, although not quite as good as the Swedish film version.",
            "review_date": "2014-06-27",
            "source": "rt"
        },
        {
            "content": "Fincher makes some extraordinary decisions with The Girl With the Dragon Tattoo. It's dark, unsettling, disturbing, but all the while entertaining and thoroughly engaging with Rooney Mara acting to perfection.",
            "review_date": "2014-06-17",
            "source": "rt"
        },
        {
            "content": "Great movie. Love the sick twisted ending. Rooney Mara is a great actress. Daniel Craig is awesome. Couldn't had chosen a better cast.",
            "review_date": "2014-06-16",
            "source": "rt"
        },
        {
            "content": "overrated as they come.",
            "review_date": "2014-06-15",
            "source": "rt"
        },
        {
            "content": "A pure whirlwind of a film...hard to keep up with the all, but the pacing was exhilarating, nevertheless, reminiscent of the style of \"Mission Impossible\" (but with a lot more style) It's also an extremely violent, rough film that Lisbeth (Rooney Mara) absolutely steals the focus of. There's also a really incredible dynamic between her and Craig that I found constantly watchable, although (SPOILER)\n....\nSomewhat disappointing in the close of the film...but then again perhaps just a testament to \"The Girl with the Dragon Tattoo\"'s volatility.",
            "review_date": "2014-06-10",
            "source": "rt"
        },
        {
            "content": "Read the book instead.",
            "review_date": "2014-06-05",
            "source": "rt"
        },
        {
            "content": "My Word! Probably the best drama-thriller I've ever seen. The chemistry between Mara and Daniel Craig was palpable. Brilliant, just brilliant!",
            "review_date": "2014-06-02",
            "source": "rt"
        },
        {
            "content": "Fincher has crafted a dark and brutal thriller that does not waste a minute despite an almost three hour run time. Craig, Van Wageningen and Skarsgard are all great on screen, but the film is worth watching for Rooney Mara alone.",
            "review_date": "2014-05-31",
            "source": "rt"
        },
        {
            "content": "David Fincher's certain, specific direction blends perfectly with Rooney Mara's utterly amazing performance as Lisbeth Salander that is both terrifying and mesmerizing, this combination along with a good supporting cast, a brutally honest script, and excellent editing make The Girl with the Dragon Tattoo a rare remake of a foreign remake that blows the original out of the water",
            "review_date": "2014-05-28",
            "source": "rt"
        },
        {
            "content": "I am still yet to see the original film, but what I have seen from this film I have admired (particularly Rooney Mara in the lead).",
            "review_date": "2014-05-28",
            "source": "rt"
        },
        {
            "content": "This is a very dark character drama, or is it a murder mystery thriller? Well, it tries to be both. Daniel Craig plays Mikael Blomkvist, a journalist whose career is starting to fall apart, but he's offered a chance to redeem himself when someone hires him to solve a 40-year-old murder case. At the same time we are introduced to Lisbeth Salander, played by Rooney Mara. Her story is a bit more shady. We know she is a brilliant computer hacker who works outside the law, and she's got some major issues from her past that are making her life difficult now. Eventually the 2 characters meet (although it takes almost half the movie before we reach that point) and they coordinate their efforts to find the killer. However along the way they may find more than they ever wanted about the messed up Vanger family. The pace of the film is very slow. It is loaded with setup shots of people driving to places, people walking from room to room, and often with ominous music in the background. The atmosphere of the film is dark and tense, like you're waiting for someone at any moment to jump out and stab our lead characters. I like that kind of tension, and it suits the murder mystery genre quite well.\n\nDaniel Craig is extremely endearing in the lead. I was pleased that the character felt different from his portrayal of James Bond. This guy wasn't the most suave guy in the room, he made stupid mistakes, he falls down, and he needs help from others. It proves he has range, and it makes you totally get on his side for the rest of the film. On the other side of that coin is Rooney Mara. She is so flat and dull as Lisabeth. It's strange because the things she is doing and the things that happen to her are so intense that I have an emotional reaction, yet I literally read zero emotion from her. I suppose they were going for a strong, silent type but I just wanted something emotional to engage me. Instead it feels like the plot is trying to tell me how to feel, but I'd rather have the character feel that way in order to get me invested in their story. One of the odd things with the cast are the range of accents they decided to use. Craig sticks almost completely with his standard British accent, but many others throw in attempts at Swedish. I'm not familiar enough with the sound of a genuine Swedish accent, so it didn't bother me like an unsuccessful American one might, I just wondered if accents were necessary. No one else in the cast stands out much as particularly strong characters. In fact I frequently lost track of who was who, and how anyone was related to anyone else. I felt like I needed an evidence wall with a family tree similar to Mikael's just to follow the film. Christopher Plummer could have been amazing, but his character wasn't included in enough of the film. I suppose Yorick van Wageningen was appropriately detestable, but that relates more to his actions rather than his performance.\n\nI had a tough time with this movie. When it was a murder mystery/thriller I was incredibly engaged, and I wanted to hang onto that storyline. Sadly, they kept breaking from the movie I would have enjoyed to a character drama that just included too much explicit content for my comfort. I realize that making the audience uncomfortable is part of the plan with this film, because it is supposed to elicit those reactions of anger and disgust. I just prefer films that can accomplish these things in a more subtle fashion. It's probably my conservative sensibilities creeping in, so I might be completely alone in this opinion. Yet, (and I feel like a broken record here) my biggest problem with The Girl with the Dragon Tattoo was simply that it showed things happening to try and elicit a reaction from me, but I'd rather see a reaction in the characters so I can connect with them as realistic people. I'm sure it's just a stylistic choice, and this isn't my preferred style, so I'll stop belaboring that point. My only other complaint would be that the mystery, when you peel away all the intrigue and character drama, is straight out of any hour-long procedural drama. I could anticipate who was the killer early because I've seen episodes of CSI and NCIS. It's a minor complaint, because that doesn't mean this wasn't a very well-executed mystery. By the end I quite enjoyed about half of the movie, but they inserted the other half, so I can't say it's a favorite and I'll probably never watch it again.",
            "review_date": "2014-05-28",
            "source": "rt"
        },
        {
            "content": "David Fincher delivers one of the greatest achievements in cinema. It's truly a rock and roll in your face film noir thriller. The performances by Daniel Craig,Rooney Mara,Christopher Plummer,Stellan Skarsgard are amazing. The music by trent reznor, Atticus Ross is electrifying. The photography by Jeff cronenweth on the Red Epic 5K is beautiful . The script by Steven Zatlin is great. It's based on the best selling novel by steig larsson. And of course the amazing direction by David Fincher. His work ethic is so meticulous. They way he collaborates with the writer. The way he storyboards every film. They way he uses light to set a mood to the story is amazing. In literature the writer is the author. In Cinema the Director is the author. There is no great films. There is only great directors.",
            "review_date": "2014-05-26",
            "source": "rt"
        },
        {
            "content": "David Fincher is my favorite director of all time. Also can I live there?",
            "review_date": "2014-05-26",
            "source": "rt"
        },
        {
            "content": "I was really looking forward to this but was disappointed. Frankly I was bored through much of it. The sex scenes were superfluous, and the attempt at grit or gravitas though shock worked about as well as a commedian relying on the F word to raise a laugh. The main characters worked as neither hero or antihero and I can only assume they were better in the original. The outcome of the Harriet plotline was more predictable than a Miss Marple episode and the clues laid out as obviously as those in Scooby Doo. Dire.",
            "review_date": "2014-05-23",
            "source": "rt"
        },
        {
            "content": "Nuestro amigo David Fincher vuelve a las andadas con esta adaptación americana de la novela y remake de la versión sueca homónimas. Utiliza todos los tópicos del thriller, incluso los suyos propios, para darle un ritmo acorde y dinámico a la historia, bien desarrollada, y un toque de oscuridad y tenebrismo, bastante presente en el tono grisáceo de los colores. Las actuaciones son quizás lo más digno de mención del filme, con un Daniel Craig excelente y secundarios muy correctos. Pero lo mejor no deja de ser la impresionante y espléndida actuación de Rooney Mara, que sabe dotar perfectamente a su personaje, Lisbeth Salander, de la complejidad emocional e incomprensión que tanto le caracterizan. Sinceramente no creo que merezca la pena comparar ambas adaptaciones; las dos tienen su estilo; una hacia un enfoque quizá algo más personal y la otra hacia una presentación de cómo ganarse el título para el thriller, que Fincher ya revolucionó dieciséis años antes de este filme con su única e impactante 'Se7en'. Y aunque ya se pueda disfrutar de lo bien desarrollado de cada aspecto, podría haber añadido un punto extra, más allá de lo que es \"cumplir bien\". Aunque no sea así, no me quejo. En definitiva es un thriller más que entretenido e intrigante, que recomiendo tanto para los fans del thriller como de Fincher.\n\nNota: 7.5/10",
            "review_date": "2014-05-20",
            "source": "rt"
        },
        {
            "content": "A little graphic, a little suspense, and quite the story.  I see why everyone liked the book.  I hope they can get Craig to come back for the next one.",
            "review_date": "2014-05-18",
            "source": "rt"
        },
        {
            "content": "A compelling story that one must pay attention to. If you do what you find is a provocative, interesting story that has Web of intrigue at every corner.  Rooney Mara plays one of the best roles I have seen in some time. She is so convincing in her role as a troubled, yet smart, dedicated hacker. Craig also is great here and they work together to solve a murder mystery from the 1960s. This movie has a lot going on yet it is really worth the watch due strongly to Maras performance.",
            "review_date": "2014-05-15",
            "source": "rt"
        },
        {
            "content": "Really enjoyed this movie.  And it can be watched more than once.  You almost need to take notes at the beginning of the movie though.",
            "review_date": "2014-05-13",
            "source": "rt"
        },
        {
            "content": "Excellent film! Quite violent at times but such a gripping story",
            "review_date": "2014-05-12",
            "source": "rt"
        },
        {
            "content": "I thoroughly enjoyed this movie. I had already read the books, so I knew to expect some really disturbing scenes and they were indeed very disturbing. But I think David Fincher's edgy vision really brought the late Steig Larsson's chauvinist novel to the screen. The covers of Zeppelin in the trailer set the mood and the grainy Instagram-like filter made the whole show depressing. Daniel Craig is a better Blomkvist than a Bond. And Rooney Mara was a better Salander than Noomi Rapace.",
            "review_date": "2014-05-10",
            "source": "rt"
        },
        {
            "content": "Go into the darkness...",
            "review_date": "2014-05-06",
            "source": "rt"
        },
        {
            "content": "A well structured and genuinely thrilling thriller thats not afraid to pull its punches. Theres excellent performances from its leads and a decent mystery at its core. Where it falls down is in its bloated length and overuse of pointless brutality, which was irritating enough to knock off two stars. Plus the rather obvious conclusion.",
            "review_date": "2014-05-05",
            "source": "rt"
        },
        {
            "content": "Most Hollywood remakes are not successful. This is an example of a remake that works on every level. The most captivating character in this movie is Lisbeth Salander, played incredibly well by Rooney Mara.",
            "review_date": "2014-04-26",
            "source": "rt"
        },
        {
            "content": "I just love David fincher movies. This one was well put together. Rooney Mara steals this one. She is one tough girl to say the least",
            "review_date": "2014-04-24",
            "source": "rt"
        },
        {
            "content": "This my most disappointed film of 2011, it's a great set-up that slowly dives into a tense but predictable third act. The villain is underdeveloped and is just evil just for sake because he likes being evil. The only saving grace is a crazy and sexy performance of Rooney Mara.",
            "review_date": "2014-04-19",
            "source": "rt"
        },
        {
            "content": "beside all the violence and the complexity of the characters we cach a  feeling of love, tenderness and human hope for a better future \nit's a beautiful shocking movie full of hates and evil turn up to be a piece of art",
            "review_date": "2014-04-18",
            "source": "rt"
        },
        {
            "content": "I am partial to the Swedish versions, but I did enjoy the take of the book in this film. Not quite as political as the original, albeit a more  personal theme on this film. Looking forward to the next one.",
            "review_date": "2014-04-17",
            "source": "rt"
        },
        {
            "content": "Almost as good as the original movie.",
            "review_date": "2014-04-12",
            "source": "rt"
        },
        {
            "content": "Girl with the Dragon Tattoo is extremely well executed, but after seeing the 2009 version, this movie does not offer much more over the other. Rooney Mara is the one exception to this rule, she is a frightfully faithful representation of a character who has had a troubled past and manages to commit herself (including nudity) entirely to a role. Craig also does a fine performance and Fincher directs a beautifully crafted mystery that is on par with the 2009 version.",
            "review_date": "2014-04-10",
            "source": "rt"
        },
        {
            "content": "85%\nDark, gritty, stylish.",
            "review_date": "2014-04-09",
            "source": "rt"
        },
        {
            "content": "Worthy to be rated a good movie but it is too long and only rides on the fame of it's original predecessor.",
            "review_date": "2014-04-07",
            "source": "rt"
        },
        {
            "content": "An English version of a foreign film that is even better than the original (because I don't have to read subtitles the whole time). Only one word can be used to describe this film, \"Respect\". Respect for the characters, respect for the film, and most importantly respect for the source material. The film follows the material so well that it can even be more disturbing than the novel it is based off of. A definite career high point for everyone involved, from Craig, to Mara, to even Fincher himself. I hope that the lawsuit involved with Stieg Larsson's amazing trilogy subsides so that more can be done with it in the world of film.",
            "review_date": "2014-04-06",
            "source": "rt"
        },
        {
            "content": "Daniel Craig stars alongside a girl--not only sporting a dragon tattoo--but piercings, and a knack for hacking computers with a photo memory. Flick starts off slow, but by halftime you'll be 'tied up' in the action and wonder which of these 2 stars is the real James Bond. Read the book, if nothing else, to assist with the thick accents. If you can tell the Kardashian clan apart you'll have no problem keeping up with the suspects and family dynamics in this thriller. GRADE: A",
            "review_date": "2014-04-04",
            "source": "rt"
        },
        {
            "content": "fun film. strong cast. was pleasantly surprised.",
            "review_date": "2014-03-30",
            "source": "rt"
        },
        {
            "content": "Celkem slun? ud?laná kriminálka - hodn? jmen, zajímavá zápletka, hlavní padouch nebyl jasnej po 15 minut po za?átku. :-)",
            "review_date": "2014-03-28",
            "source": "rt"
        },
        {
            "content": "Good movie! Good adaptation.",
            "review_date": "2014-03-23",
            "source": "rt"
        }
    ]
}