{
    "rating": 2.3,
    "release_date": "2011-10-07",
    "num_reviews": 210,
    "genres": [
        "English"
    ],
    "summary": "A depraved mama's boy (Laurence R. Harvey) goes on a killing and collecting spree to recreate the experiment portrayed in \"The Human Centipede (First Sequence).\"",
    "reviews": [
        {
            "content": "Compared to the mid first movie, this one seemed to throw it out of the park. There wasn't much character development. It genuinely seemed like lazy writing as making Martin and his issues explaining all the unnecessary details so there was no background for it, it was just under the pretense of Martin's issues.",
            "review_date": "2023-04-23",
            "source": "rt"
        },
        {
            "content": "If David Lynch was asked to make a movie about torture porn, it would be this movie. The black and white filming, I feel, toned down the overall vile atmosphere of this movie, creating an almost artistic horror movie.",
            "review_date": "2023-03-18",
            "source": "rt"
        },
        {
            "content": "Esta secuela sin duda supera a su predecesora ofreciendo gran dosis de gore, morbo y asquerosidad. Filmarla en blanco y negro fue buena decisión para que se viera más macabra, ya que la versión en color no perturba tanto y se nota lo obvio que son los efectos especiales. Fue raro que, en vez de ser una continuación directa, sea un film donde el anterior es pura ficción adentro de este. La historia está muy buena por como se centra en la psicología de Martin que se nota que sufrió muchas desgracias al punto de volverse un psicópata. Tiene muchas escenas fuertes y repugnantes que a mí me causaron bastante gracia y las disfrute. No es una película apta para gente sensible y por eso es una espectacular película para los que nos gusta lo mórbido y lo extremo. Mi calificación para esta película es un 10/10.",
            "review_date": "2023-03-15",
            "source": "rt"
        },
        {
            "content": "You know, I watched this movie through a guy explaining it on YouTube and uh.. Nah. This was really gross. It made me rethink why I ever found horror movies enjoyable. There was nothing enjoyable about this. Actors/actresses agreed to do this. They agreed to be put in that situation for what I imagine to be HOURS to get the right take for the movie. There is no way anyone involved with the creation of this movie did not spend years in therapy after this. You are better off not watching this movie or even reading/watching a summary. My life would be much better off with not knowing what happened in any of these 3 movies. Get help Tom Six, seriously. Scrap the Human Caterpillar too, what are you doing my man? Just stop.",
            "review_date": "2023-02-04",
            "source": "rt"
        },
        {
            "content": "Definetely not as good as the original, but it wasn't absolutely awful. I would not reccomend it if your squeamish or don't like human centipede.",
            "review_date": "2022-12-02",
            "source": "rt"
        },
        {
            "content": "Worst movie I’ve ever seen.",
            "review_date": "2022-10-15",
            "source": "rt"
        },
        {
            "content": "Well, at least it's something for people to talk about at therapy. \n\nDid not like the b&w at first but it made more sense as it went on.  This should not be funny, but the fact that the plot is a slightly handicapped guy trying to mimic the first movie that exists as a movie in the context of this movie... it's a little bit funny.  And then his mother finds out what he's doing and it's no more fun and games.  Not a standard average film; it's artistically done, coherent, and somehow... it's not offensive due to there being no verbal insults, genitals in my face, or awkward prolonged sex scenes.",
            "review_date": "2022-08-24",
            "source": "rt"
        },
        {
            "content": "que coisa horrorosa, pior coisa que já assisti",
            "review_date": "2021-10-05",
            "source": "rt"
        },
        {
            "content": "What a disgusting movie, when three people are *ahem* stitched together!",
            "review_date": "2021-09-21",
            "source": "rt"
        },
        {
            "content": "In the first Human Centipede, there was a level of absurdity to the film that almost made it seem like forced hyperbole--like it was SO ridiculous and over the top that it almost became comical.  THIS film, removes almost ALL of that.   THIS film seems to WANT you to think that this could actually happen with some sicko out there--and for that reason it is FAR more disturbing than the first.  The first film was just the palate cleanser--THIS film is the ACTUAL endurance test.  I can also say with certainty that I will never have a reason or inclination to ever watch either film again.",
            "review_date": "2021-07-05",
            "source": "rt"
        },
        {
            "content": "There is a difference between horror and straight up psychopathic dreams. This movie is a dream of a pyscophath in the film and in real life. Tom Six is a sick man. We need to stop supporting these films. They scarring and just plain disturbing. Babies should not be used in such a way in film. I said the same thing for A Serbian Film. Sometimes the human brain should not be explored. Tom Six needs help and lots of it",
            "review_date": "2021-02-17",
            "source": "rt"
        },
        {
            "content": "Film review of Humane Centipede 2 by famous reviewer P.P. Harper : Wow! This one stinks! It was horrific and scary , but also kind of funny. For example, she really did put her butt in his mouth ! Ha ha ! It was pretty good though, but not for a child to watch. Definitely shouldn’t let the child watch! Anyway, this isn’t really a good one, and the children shouldn’t stay far away from this one! Very violent and sexy! Pretty gross. All in all, not for the children to watch! Definitely.",
            "review_date": "2021-02-03",
            "source": "rt"
        },
        {
            "content": "a copy of the first movie but with more gore. we already know what's going to happen to get the human centipede which leaves the movie with almost nothing new, this could've been easily less than an hour",
            "review_date": "2020-11-28",
            "source": "rt"
        },
        {
            "content": "People paid money to see this?",
            "review_date": "2020-10-24",
            "source": "rt"
        },
        {
            "content": "That's a nope from me.",
            "review_date": "2020-10-15",
            "source": "rt"
        },
        {
            "content": "this film is very disturbing and strange",
            "review_date": "2020-10-13",
            "source": "rt"
        },
        {
            "content": "Great movie if you have a craving for the adrenaline that blatantly disturbing, filthy, and disgusting gore can give you. Keep far away from the squeemish and the faint of heart.",
            "review_date": "2020-10-03",
            "source": "rt"
        },
        {
            "content": "When the reviews are overwhelmingly bad over the film being too, \"vile\" you know its a good horror movie. The main character played by laurence Harvey is a very well done character. Hes disgusting and creepy but he plays the part excellently. Its not for the faint of heart as proven by the reviews but for exploitation film lovers its a must watch. Much better then the first Human Centipede and obviously better than the third. The vileness of it is what is to be loved. My review is definitely not in the majority. 8.4",
            "review_date": "2020-06-10",
            "source": "rt"
        },
        {
            "content": "This film is so stupid that is funny. It’s terrible from start to finish, but at least I can laugh at how bad it truly is.",
            "review_date": "2020-06-05",
            "source": "rt"
        },
        {
            "content": "It tries to make light on complicated subject matters, but that commentary dissappears among the overreliance on gore and sickening content that makes the original look like a family movie. It ultimately becomes pretentious and annoying, as it tries and fails to be as iconic as the first one.",
            "review_date": "2020-05-24",
            "source": "rt"
        },
        {
            "content": "Okay ... this movie kinda traumatised me a little. The best word to describe it is DISTURBING. Did I enjoy it? Hmm ... I watched it once and never will again. This movie is beyond anything I've ever seen before. It was hard for me to sit through but that doesn't make it bad. Just be prepared to be horrified and disgusted, which is what it set out to do.",
            "review_date": "2020-04-12",
            "source": "rt"
        },
        {
            "content": "I am ashamed to admit that I sat through this garbage fest. This sequel is so obsessed with being darker, nastier, and more disturbing than the original that it feels gratuitous and unnecessary in every sense. (F)",
            "review_date": "2020-02-19",
            "source": "rt"
        },
        {
            "content": "I can never get back the time wasted watching this.",
            "review_date": "2020-02-06",
            "source": "rt"
        },
        {
            "content": "Wow, this movie was a breath of fresh air in the romance genre, I'm so used to seeing Sylvester Stone in these movies that I'm sad he's gone. I think the cast, consisting of Mia Khalifa, Jason Statham and Rocketman was decently acted. However, Sylvester Stone not being in it is too much to blair witch. But I'm happy he's moved onto the Spy Kids franchise. Man I Jared\n\n- Tim Hortons, 2009.",
            "review_date": "2020-01-17",
            "source": "rt"
        },
        {
            "content": "I loved it, it's super twisted and it's not exactly well shot, but if you are looking for something depraved to pass the time this is the thing to watch... In my personal opinion, best one out of the three.",
            "review_date": "2019-10-28",
            "source": "rt"
        },
        {
            "content": "Don't bother with this one. Watch the episode of South Park where they try and write a shocking book instead, it's more scary",
            "review_date": "2019-10-27",
            "source": "rt"
        },
        {
            "content": "This is in my opinion the best one in the trilogy. The film has a very different tone then the first one. This film has a dark tone to it that I love! And it's overall a darker film then the first one. If you was dissapointed by the first movie that they didn't show much gore in this movie the show everything! I also love how differen't the villain in this film is compare to Dr.Heiter in the first film. In the first film he was a surgeon in the human centipede 2 \nthe villain Martin is the complete opposite and he knows nothing about surgery and he uses hammers and everything.",
            "review_date": "2019-06-19",
            "source": "rt"
        },
        {
            "content": "While the first one has a big amount of inhumane elements to it, this one should make the director have a restraining order. It is so nasty and disturbing. The first one was that, but it was something you might be able to sit through. This one you are not mentally stable if you can sit through it. And also while the first one was pretty well made in my opinion, this one is so silly and obnoxious. ",
            "review_date": "2019-06-18",
            "source": "rt"
        },
        {
            "content": "When you thought the nightmare was over and the mere idea of a human centipede is long gone in your mind. Tom Six comes back with a sequel that will make you squeamish and make you want to take a shower right after the viewing. And just like all horror sequels, you've got to do it 10 times more extreme than the previous one. First, this sequel is useless and unlike the first one doesn't bring something new to the torture porn horror category. Plus, this film really felt like a promotion for the first movie than a sequel. The obscenity was unnecessary and was too vile for my taste. This movie really makes you wonder what are the limits when it comes time to shock the audiences. On the positive side, the performance of Laurence R. Harvey was alright, but honestly the actors are the less of my concern in this picture. What I semi-enjoyed was the midnight movie vibe that Tom Six opted for. To conclude, this sequel offers more than the previous one even though we did not ask for it.",
            "review_date": "2019-06-04",
            "source": "rt"
        },
        {
            "content": "While Harvey gives a fairly solid performance, it is unfortunately not enough to save this try-hard over the top exploitation film, and the shock novelty is spread very thin.",
            "review_date": "2019-03-08",
            "source": "rt"
        },
        {
            "content": "Very messed up. Weird plot",
            "review_date": "2019-02-01",
            "source": "rt"
        },
        {
            "content": "You do wonder what on earth attracted most of the cast to taking part in Tom Six's unremittingly gross sequel to his original relatively restrained horror comedy. There is no doubting he can direct, but to what end? Here, he has good cinematography, a genuinely creepy leading man, and nothing to say, beyond 'what if?'. It's not enough.",
            "review_date": "2018-12-03",
            "source": "rt"
        },
        {
            "content": "If you have questioned whether a film âcould get any worseâ?, you need to look no further than The Human Centipede 2. Tom Six promised us a sickfest sequel and he achieved his mission by giving us something so violently repulsive, you will be reaching for a sick bucket instead of the popcorn. There is no doubt the first Human Centipede was disgusting, but it had a twisted charm and a relatively dark gripping storyline that made it such a rarity. The human centipede two sadly has lost all those aspects, whilst the shock factor and gore fest were raised, everything else has taken a step backwards. \nWe meet Martin, a middle-aged car park attendant who suffers physical, sexual and verbal abuse by all those around him. With the lead role rarely talking and the film set in black and white, that is about as artsy this film gets. Obsessed with the first film and the work of Dr. Heitner, Martin wants to create his own twelve-person Human Centipede. \nWhilst the scenes of mutilation, defecation and rape are beyond unsettling, the fact this movie has little script and a story is why it deserves such low marks",
            "review_date": "2018-11-12",
            "source": "rt"
        },
        {
            "content": "\"The Human Centipede II\" é demasiado sangrento, repugnante e, sejamos sinceros, estúpido...",
            "review_date": "2018-11-04",
            "source": "rt"
        },
        {
            "content": "i dont see the point of this film. no real story, no character development, no meaning, no message , nothing. just pure sadistic violence. movies like this are only inspiration for all the psychos out there who probably copy that in real life some day- and that scares me- thats why filmes like these should be taken from the market and destroyed. it has no good value, anyway i would declare it as scat and torture porn- people who enjoy this should check into a mental hospital or should lock themselfs away for life. there is enough sick stuff going on in the world. i cant understand why such movies even got produced. all people who were involved in this project are mentaly ill.",
            "review_date": "2018-10-08",
            "source": "rt"
        },
        {
            "content": "Su estilo y estetica sobre pasa todo lo bizarro y grotesco de este film, su argumento es patetico y cada decisión del film es una basura,pero su casting, fotografia son bastante interesantes que logran ser positivo ,una propuesta diferente para este cine gore que no tiene mucho que mostrar realmente.",
            "review_date": "2018-08-23",
            "source": "rt"
        },
        {
            "content": "I have never had a movie make me physically ill before. This  was disgusting just for the sake of being disgusting! I could practically smell it through the screen. I would give it zero stars if I could.",
            "review_date": "2018-04-24",
            "source": "rt"
        },
        {
            "content": "One of the worst movies i have ever seen. Other than his obession with the centipede, there is nothing else. The ending is nothing. It just ends.",
            "review_date": "2018-04-24",
            "source": "rt"
        },
        {
            "content": "this movie is a crazy film",
            "review_date": "2018-02-22",
            "source": "rt"
        },
        {
            "content": "Barely even worth half a star. Very gross and lacks any point.",
            "review_date": "2018-01-18",
            "source": "rt"
        },
        {
            "content": "Shock for the sake of shock and fails. This movie has nothing going for it.",
            "review_date": "2017-12-28",
            "source": "rt"
        },
        {
            "content": "Kinda interesting for the first 20 minutes. Then just becomes annoying and boring.",
            "review_date": "2017-11-17",
            "source": "rt"
        },
        {
            "content": "A lot tougher to watch than the original and is a little too bonkers in places, but excellent sound design makes you squirm along with all the victims",
            "review_date": "2017-10-13",
            "source": "rt"
        },
        {
            "content": "Now this is what a disturbing movie looks like, this movie is sick, it's disturbing, and it's not really all that good, I do like the black and white cinematography though.",
            "review_date": "2017-08-20",
            "source": "rt"
        },
        {
            "content": "I gave half a star, although it doesn't deserve any. In a word...REPULSIVE! 0 stars.",
            "review_date": "2017-08-01",
            "source": "rt"
        },
        {
            "content": "Love this film dark, grim, only suffering.",
            "review_date": "2017-05-26",
            "source": "rt"
        },
        {
            "content": "This film in many ways surpasses the original and had a lot of potential. Beautifully shot. Very artsy and moody. But it's complete lack of humanity and over the top depravity is not fit for human consumption.",
            "review_date": "2017-05-07",
            "source": "rt"
        },
        {
            "content": "The original was disgusting and demented and watching it was riveting because it was medically possible. This sequel is more disgusting and twisted and watching it is like watching a train wreck; you watch because it is happening in front of you and you just can't turn away. Still worth watching in a creepy, can't believe this was put on film kind of way.",
            "review_date": "2017-03-24",
            "source": "rt"
        },
        {
            "content": "Una de las peores películas que he visto en toda mi vida. The Human Centipede 2 logra ser mas fuerte y cruda que su primera parte, pero sigue teniendo los mismos errores: Aburrida, ridícula y extremadamente estúpida. The Human Centipede 2 es otro intento de Tom Six por crear una experiencia perturbadora que termina siendo un desastre.",
            "review_date": "2017-01-29",
            "source": "rt"
        },
        {
            "content": "Once again, Tom Six brings an undeniably inspired horror concept, but one with images so gory, shocking, and exploitive, there's little to admire.",
            "review_date": "2016-12-01",
            "source": "rt"
        },
        {
            "content": "worst than the first one. Such a long build up to come to something that isn't worth watching. Plus I wasn't really digging the black and white theme",
            "review_date": "2016-08-05",
            "source": "rt"
        },
        {
            "content": "Terrible. And not just in a fun, campy way. There is literally NO redeeming value to this movie at all. Where the first one at least had a good and interesting performance from Dieter Laser, original story, and surprisingly welcome lack of blood and feces, the second has gore and disgust to the point of just being overwhelming and utterly pointless. Any interest generated by the somewhat unique idea of a horror fan becoming an antagonist is quickly decimated by the terribly conceived characters, annoying black and white lighting, and absolutely pointless gore.\n\nAs an avid horror fan this movie checked NONE of my boxes and I couldn't even finish it.  Unless you're a fan of torture porn, don't waste your time.",
            "review_date": "2016-08-05",
            "source": "rt"
        },
        {
            "content": "Too disgusting for fans of the original and painfully-overwhelmingly bad for critics and audiences/mainstream viewers this sequel doesn't do anything good to the series except add more disgusting snuff type material to its movie",
            "review_date": "2016-06-27",
            "source": "rt"
        },
        {
            "content": "The Human Centipede 2 could just be one of the worst movies ever made! Needlessly excessive with unbelievably graphic violence and disturbing imagery The Human Centipede 2 doesn't really feel like a movie. This film has dreadful acting, direction, writing and technically is very poor and doesn't feel like a proper film, more like a TV one. This film is also extremely boring and all I remember is the violent scenes. This film is incredibly disgusting and violent that it's just sickening to watch. This is just a dreadful film and I never want to have to suffer through watching it again. F",
            "review_date": "2016-05-18",
            "source": "rt"
        },
        {
            "content": "Though not particularly fond of The Human Centipede: First Sequence (2009), my desire to find out just how deep the rabbit hole of Tom Six's sadism went gave me the edge to check out the sequel.\n\nGiven that The Human Centipede: First Sequence set a high standard for sadistic violence and sickening concepts, The Human Centipede II: Full Sequence has a high standard to live up to. Even though the film wasn't a particularly great one, the sequel still needs to be sickening enough to be a worthy follow-up. The value of The Human Centipede: First Sequence was largely the fact that its idea was so ridiculously grotesque that it cried out for cult audiences, and the surrounding controversy made it impossible to miss. As a whole, the idea behind the film was more sickening than its actual execution while its greatest hook was the performance of Dieter Laser. This time there is an antagonist of far less interest who viewers have to embrace while he wanders through his meaningless existence in silence, never saying a word. Blood and gore is just thrown at the viewer repeatedly without much intense build-up which forsakes any potential for narrative value, even though the story never had much of a chance of that in the first place.\nTreading the mistaken ground followed by the first film, The Human Centipede II: Full Sequence ends up with sloppy execution of a potentially sickening concept. Quadrupling the ambitions of the villain Dr Josef Heiter, The Human Centipede II: Full Sequence introduces Martin Lomax. With a far more conventional reason for his insanity, Martin Lomax's edge is driven by the fact that he is a short, mentally challenged, overweight and asthmatic man who was molested by his father and criminalized by his mother. This is Tom Six's idea of characterization, and there's only so long you can tolerate seeing a silent obese man staring at things in a slow-paced black and white film before the once-eerie atmosphere created by the manipulation of silence and colour becomes yet another staple of boredom inducing. Given that the crude gimmick of the first film has been and gone the effect is no longer as innovative, the central hook is gone. And with black and white disguising the practical nature of many scenes, the film is never as brutal as it wants to be which really makes the potential of the experience dull. The film doesn't become much of an exercise in the shock value of blood and gore until close to an hour into the film, and the build-up until then has been far from satisfactory for any real power to come from it. And with The Human Centipede II: Full Sequence failing to offer much in terms of shock value, it fails at the one thing it could have been any good at. Given that the film is in black and white it runs this risk very much from the start, and despite Tom Six's claims that it is meant to create a dark and gritty nature to match the insanity of the protagonist it ultimately restrains the effect of the shock value. It has a very slight touch of visual flair and some good cinematography, but it isn't nearly enough to add any major value.\nOn top of everything, the film is very much a parody of itself. Due to the meta nature of the narrative and Tom Six's intention on emphasizing the concept of copycat crimes, the ridiculous concept of the first film serves as the motivation for the actions of Martin Lomax. The disgusting extent that the story goes to as a means of mocking viewers with its crude violence is seemingly a humourous insult directed at audiences, and given the way Tom Six depicts Martin's nightmares of his father molesting him with the voice-over line \"You're only making daddy's willy harder\" there is clearly a humourous edge in the film. Since many critics of the first film took it so seriously it's rather beneficial that jokes are prevalent in The Human Centipede II: Full Sequence. But I can't ascertain how much social satire is supposed to actually be in the film or certify that I did in fact laugh at any point. It seems as if every line of dialogue is satirical because it all subscribes to the most conventional format of dialogue available to horror cinema and none of it can be taken seriously, but while that seems to intentionally detract from some of the more serious elements of the film I most definitely did not find myself laughing, scared or even all that sickened. Frankly, I was just bored in the case of The Human Centipede II: Full Sequence. And when the film comes to a close with an ending that leaves a frustrating ambiguity to the rest of the events in the story, its the final insult.\nHowever, I will certainly admit that I have respect for the leading performance of Laurence R. Harvey. The man has no shame taking on such a sick and twisted character in The Human Centipede II: Full Sequence, and it's a fairly challenging role. The man has to convey ultimate insanity in almost complete silence, and given the lackluster filmmaking around him it would be easy for him to cater to such standards and simply maintain a blank stare the entire time. But with his directionless gaze, his hunched shoulders and his childish grin, the man is able to create an effectively introverted psychopath. Laurence R. Harvey manages to perfectly capture Martin Lomax, approaching the most sick and twisted scenes with such neutrality or sadistic pleasure that he manages to capture both the disturbing elements of the character and his vulnerability too. Laurence R. Harvey says everything about the character without ever having to utter a single word, and in a circuit of mediocre plot lines and stiff direction he has more success capturing the greatest extent of Tom Six's ambition than the director himself. Laurence R. Harvey is an ideal creep to lead The Human Centipede II: Full Sequence. \nAnd though her role is really small, fans of the first film can rejoice at the presence of Ashlynn Yennie returning to be part of another sick medical experiment.\n\nLaurence R. Harvey delivers an effectively creepy lead performance, but The Human Centipede II: Full Sequence lacks the originality of its predecessor which weakens the potential shock power, and with a slow pace, weak plotting and black and white covering the blood and gore, it's ultimately just a boring experience above anything else.",
            "review_date": "2016-04-25",
            "source": "rt"
        },
        {
            "content": "wow, this sequel crashed hard and fast.  there was no scary, just grossly disturbing and not even in a good way",
            "review_date": "2016-04-10",
            "source": "rt"
        },
        {
            "content": "Have you shit yourself again?\n\nA huge fan of the movie human centipede researches and takes copious notes on if the events in the movie are possible and he discovers it's true.  The fan was sexually abused by his father as a kid, and may be a bit autistic, but he definitely isn't mentally stable.  He works in a parking garage at night and uses this profession as a chance to kidnap victims and begin building his own crude human centipede.\n\n\"Stop them tears.  You're just making daddy's Willie harder.\"\n\nTom Six, director of The Human Centipede 1-3, Honeyz, Gay as Amsterdam, and I Love Dries, delivers Human Centipede II.  The storyline for this picture is entertaining but a bit of a stretch.  The film is shot in an appropriately gritty style that contains a lot of gore and intensity.  The acting is solid and fits the feel of the film perfectly.\n\n\"Shut your fucking mouth you old cunt.\"\n\nThese films are all gross and fairly intense.  They are all on Netflix and I watched the first one about three years ago.  I finally got around to watching this sequel and felt it was a worthwhile addition to the horror genre but far from perfect.  I recommend seeing this once for fans of the genre who can handle the intensity.\n\n\"Your pussy smells gorgeous.\"\n\nGrade: C+",
            "review_date": "2016-03-09",
            "source": "rt"
        },
        {
            "content": "A bigger budget meant more towards film quality & lighting. Unfortunately, it fails on ALL levels, including what looks like a morbidly obese \"Waldo\" from the Hot For Teacher video as your resident maniac. A \"shitty\" movie (pun intended)",
            "review_date": "2016-03-07",
            "source": "rt"
        },
        {
            "content": "Not the worst idea for a sequel as the plot is inventive enough, but the execution of this just as twisted story isn't as good as the first.",
            "review_date": "2016-02-19",
            "source": "rt"
        },
        {
            "content": "And I thought the first one was bad...",
            "review_date": "2016-02-05",
            "source": "rt"
        },
        {
            "content": "I'm really not sure whether this is the worst movie ever made or not but it sure as hell comes close.  The story is vile, the acting abysmal and the idea of any of it is worse than laughable.  Whereas the first was a shocker and was hard to swallow, this looks like it was made to shock but fails miserably on all levels simply thanks to its own incompetence.  Each time you think it couldn't get more inane, it manages it with flying colours.  How anyone was allowed to make this is difficult to understand.  Completely idiotic, terribly constructed, characters you want dead as soon as you meet them and a director so deranged he should be locked away somewhere dark and far from any sort of camera.\nIf you value your sanity then steer clear of this.  If you stomach it for long, you'll wish you hadn't and however many minutes you follow it for, you will never get them back.  It really is your loss.  The half star is just for managing to focus the camera.  While watching this, you'll wonder why they bothered.  It really becomes too annoying to stay with.  Impossible to recommend and I can't do enough to advise against watching it.  Simply awful!  Don't bother!",
            "review_date": "2016-01-20",
            "source": "rt"
        },
        {
            "content": "Tom Six intenta hacer una secuela mucho más horripilante e infernal que la primera parte de su \"The Human Centipede\"... y lo logra.  Las referencias a \"Psycho\", \"Saló: o los 120 dias de Sodoma\" y a \"Eraserhead\" están más que presentes, así como el gore más espantoso que se puedan imaginar, sin importar que la cinta sea a blanco y negro.  El actor Laurence R. Harvey es el asco encarnado en una persona, interpretando a Martin, una especie de Igor y \"Fanboy\" que quiere hacer un cienpiés humano de 12 personas inspirado en la primera película.  \"The Human Centipede II\" es un completo descenso al averno.  Quedan advertidos.",
            "review_date": "2016-01-02",
            "source": "rt"
        },
        {
            "content": "it seems that it has been lost in film making the artistic creativity. Horror movies just go for as fucked up as it can think of and try to make the audience uncomfortable and cue that perverted side in people to see if they will come back for more. there is zero things about this movie that is interesting creative or original so it gets a zero",
            "review_date": "2015-12-15",
            "source": "rt"
        },
        {
            "content": "Horrible mOvie!! WhO has a sick mind tO cOme up with this??",
            "review_date": "2015-12-08",
            "source": "rt"
        },
        {
            "content": "Pros:\n-Bloody and gory\n-Acceptable acting\n-Darker and more disgusting than the first film\n-Acceptable story\n-Disgusting main character\n-Pretty gross\n\nCons:\n-Disgusting main character (yes it's both a pro and a con)\n-Not as unique as the first film\n-Tries too hard to be disturbing in some scenes\n\nConclusion:\nThe Human Centipede 2 is a decent film and an overall improvement over the first film, in my opinion. It's worth a watch, Gorehounds.",
            "review_date": "2015-11-16",
            "source": "rt"
        },
        {
            "content": "The only movie worse than this one is Spring Breakers!  Man, this movie sucked!  Though the first movie was not a masterpiece, the Dr/evil scientist guy was perfect for his role!  And that movie did contain some really sick shit but it kept you wanting to watch.  There was just no substance to this movie, it was lame all the way through.  Skip this one, you'll just waste your time!  3/10, GARBAGE!",
            "review_date": "2015-10-30",
            "source": "rt"
        },
        {
            "content": "I really pushed myself out of my comfort-zone for this one. I remember my ex talking about it when it came out and I was genuinely horrified at the thought of it's content. But a stronger, more objective me sat down after making it through the first sequence and I genuinely thought it was a screwed-up brilliant mess. Horror films rarely leave an impact on me, but the sheer sadistic nature really left a mark on my desensitised soul. I liked the contrasting style of the film to the original as Six goes for a different tone this time around. Thought it had a interesting meta storyline as well; particularly enjoyed Ashlynn Yennie's characterisation of herself.",
            "review_date": "2015-10-28",
            "source": "rt"
        },
        {
            "content": "Goofy,annoying and offensive to its viewrs The Human Centipede 2 fails at everything it was trying to build up.",
            "review_date": "2015-10-21",
            "source": "rt"
        },
        {
            "content": "I'm appalled by this sickening movie. Theirs hardly any story toward the protagonist and the lack of dialogue for the characters is rather annoying in my opinion. I feel that this movie has gone to far and personally should be banned. The pregnant woman is what causes me to rethink about this movie, as i think the labour scene was disgusting and worse then the experiment itself. They should have kept the characters except that woman.",
            "review_date": "2015-09-26",
            "source": "rt"
        },
        {
            "content": "I admire that this film is gory, over the top, and extremely fucked up. Defiantly one of the most fucked up films there is.",
            "review_date": "2015-08-18",
            "source": "rt"
        },
        {
            "content": "If the first Human Centipede is The Hangover, Human Centipede 2 is most certainly The Hangover Part II. It takes the original film, which was gratuitous in its own way, and simply turns it up full, much to the detriment of story and character. This may not be the worst film I've ever seen, but it's probably the hardest to watch. While the first film had at least hints of subtlety, especially in the first half, HC 2 has no such thing. It's vile, disgusting, bloody, graphic, and is completely unashamed and uninhibited in the way it depicts it. In a demonstration of utter conceit, or possibly sheer egotism, the central character in this film is a devoted fan of the first film, watching it over and over like it's his proverbial 'precious', and has the bright idea of taking its premise and extrapolating it, creating a Centipede of 10 victims rather than just 3. It is literally a re-tread of the previous instalment with all sense of scientific discovery and innovation taken out and replaced with as much brutality and bodily fluids as it can fit into its running time. The end result is boring, repetitive, sadistic, and will leave you with the justified belief that you've wasted and hour and a half of your life, and will make you feel that you've just lost a little more faith in humanity.",
            "review_date": "2015-07-30",
            "source": "rt"
        },
        {
            "content": "Tom six needs to give up on s film career, his mind is grossly fucked up and the only thing in this trilogy that's scary is his disgusting mind.",
            "review_date": "2015-07-22",
            "source": "rt"
        },
        {
            "content": "Just endlessly vile for no reason. I need a shower.",
            "review_date": "2015-07-09",
            "source": "rt"
        },
        {
            "content": "Its point is to be scarier and more disgusting than the first and does this film deliver on that? Absolutely. Gagged and cringed most the way through. Wish I would have never ever seen this. And if you are a fan the ending will disappoint you. I was just thankful it ended. Wish I could go back and change clicking play.",
            "review_date": "2015-07-06",
            "source": "rt"
        },
        {
            "content": "Creepy as fuck! Gross and disturbing! Sick, psychotic and metal as fuck! Could you ask for anything more?",
            "review_date": "2015-06-28",
            "source": "rt"
        },
        {
            "content": "There's a difference between entertaining violence, and just plain sick and despicable violence, but director Tom Six is too full of sh** to realize that. I've seen a lot of movies, meaning I've also seen my fair share of depraved ones as well, and never before have I seen such a tasteless, vile, and shallow piece of trash. Yes, Mr. Six does attempt to throw social commentary into the mix, but that just ends up making the movie even more offensive due to the fact it actually believes it's intelligent.This is a man that lives to shock, I understand that, but there are line you shouldn't cross unless you have a good reason.",
            "review_date": "2015-06-08",
            "source": "rt"
        },
        {
            "content": "Grotesquely colourful.",
            "review_date": "2015-05-26",
            "source": "rt"
        },
        {
            "content": "If only I could give this film fewer stars.",
            "review_date": "2015-05-25",
            "source": "rt"
        },
        {
            "content": "That was a terrible movie.  I was only baffled on how hideous the little retarded murderer looked.  Not scary, gross maybe.....",
            "review_date": "2015-05-23",
            "source": "rt"
        },
        {
            "content": "Ugly and disgusting. The black and white filter mirrors it's own filth on how unoriginal and degrading it is.",
            "review_date": "2015-05-23",
            "source": "rt"
        },
        {
            "content": "Although the black and white filming adds atmosphere and Laurence R. Harvey delivers a good performance as the creep Martin, Human centipede 2 loses most of it's ability to shock due to some slack pacing utter annoyance.",
            "review_date": "2015-05-21",
            "source": "rt"
        },
        {
            "content": "How in the hell do they find actors for this kind of worthless crap? I like a good slasher movie but this was scary bad in a very bad way. \"Here is your part in the movie\". \"You will spend the entire shoot with your mouth on someones ass!!\" Don't bother with this even if the first one was intriguing to you!",
            "review_date": "2015-05-16",
            "source": "rt"
        },
        {
            "content": "SWEET HEAVENLY JESUS. Tom Six has no boundaries in making his sequel 1,000,000,000,000 times more vile and disgusting and nauseating and ugly and cruel than the first Human Centipede. Which scene was the most \"entertaining\" for me? Hmm. Let me think. Could it be when the killer masturbates with sand paper? Or when the mother gives birth in a car and then squashes her newborn with the gas pedal? Or when each person in the centipede diarrheas in each other's mouth? Hmm.....",
            "review_date": "2015-04-08",
            "source": "rt"
        },
        {
            "content": "extremely horrific and voilent",
            "review_date": "2015-03-15",
            "source": "rt"
        },
        {
            "content": "Holy crap this movie sucks\n\nI watched the first one all the way through and I enjoyed the originality of it in fact I think I'll go back and give it 2 stars for at the least keeping me watching...\n\nhowever this movie I watched in fast forward... I found absolutely everything in this movie just grotesque and rancid\n\nand I completely turned it off when I got to the (spoiler alert) part when the pregnant lady is trying to run away\n\nshe gets into a car gives birth to the baby and then in a effort to escape crushes the baby's head under the gas pedal...\n\ncome on that's just gross for a shock value and even then I don't think it earned much...\n\nI hate these movies trying to out gore each other is been done and it's lame\n\nI would rather poke myself in the eye with a sharp stock then have to sit through this movie",
            "review_date": "2015-03-06",
            "source": "rt"
        },
        {
            "content": "A MUST - SEE !! It's in black & white for a reason. The main character,  Martin is too gorgeous & his body is way too sexy to be in full color. Check it out, or suck it.",
            "review_date": "2015-02-27",
            "source": "rt"
        },
        {
            "content": "Inspired by his obsession with the original Human Centipede, a disturbed British guy seeks to create an even more grotesque Human Centipede.  Perhaps the series' creators flatter themselves by believing that anybody would be obsessed with the original Human Centipede.  The sequel is little more than an exercise in scatology, with enough blood and bodily functions to make even the strongest stomachs vomit.  It's only accomplishment is the way its mute protagonist can convey his character with facial expressions alone.",
            "review_date": "2015-02-21",
            "source": "rt"
        },
        {
            "content": "This is a real piece of shit do not watch the first one was not to bad this one was I have no idea what this one was cant find the right words do your self a favor don't watch this movie if you watch the first one pretend this one was never made",
            "review_date": "2015-02-19",
            "source": "rt"
        },
        {
            "content": "Sick movie , but i guese we had almost all horror-genres don , so time for something different ...in a couple of years this will be shocking anymore ...and that Martin dude sweating with that fat belly was also not good for my eyes ! SOMDVD",
            "review_date": "2015-02-17",
            "source": "rt"
        },
        {
            "content": "Disgusting and completely unnecessary.",
            "review_date": "2015-02-05",
            "source": "rt"
        },
        {
            "content": "Not sure which is harder to believe, that they made a sequel, or that I actually sat through the whole thing. Haha.",
            "review_date": "2014-12-28",
            "source": "rt"
        },
        {
            "content": "Almost threw up a couple times. So disturbing, so dark, so utterly fucked up and deranged lol. It's a wonder I got through this train wreck. This is really no stars but 1/2 star was mandatory",
            "review_date": "2014-12-20",
            "source": "rt"
        },
        {
            "content": "The Human Centipede II get's only one thing right and that's showing me the true meaning of ugliness and cruel world we live in today. \n\nThe story to this horrible film is about a man becomes obsessed with the Human Centipede film and decides to create his own 12-person centipede to satisfy his twisted sexual desires.\n\nI'm just going to start off by saying that I hate this movie so much and yeah that's how I'm starting off. The movies tone is ugly and watching this movie from start till finish is the worst movie experience I ever had. The main character of the film or the main villain of the story is obsess with the The human Centipede film, and straight away you can see that this guy has no life at all or any good taste when it comes to films. He dose many messed up, grizzly and gruesome stuff that even a movie lover can't stand.\n\nWho enjoys a movie with scenes of: rape, torture, shocking and under use gore, and if you enjoy all that then you're f**ked up!. Now I'm not that kind of person that goes and says \"It's too gory and I'm very angry at that\", My favorite thriller all time that has a lots of gory scenes in it and it doesn't bother me that much and that's the movie Seven, at least that movie give me and us the picture of what this serial killer was doing and how shocking it was that nobody on the face of earth would think of, but the reason it really doesn't work here because the gory is under use to the point were I was about to turn it off because this movie is just torture porn from start till finish.\n\nI didn't like a single thing in this dreadful film making it the worst horror film and the worst movie of 2011.",
            "review_date": "2014-12-10",
            "source": "rt"
        },
        {
            "content": "The Human Centipede II (Full Sequence) Movie Review!\n\nWell for starters, I'll say this; it's more graphic than the original. But that's pretty much all that is original about this film. It's even more odd, questionable, and just plain stupid than the first.\n\nWhere as the first had some form of reason for being, the second is just some pathetic excuse to even exist. It draws out for little to no payment in the end.\n\nThe human centipede of this movie is by far more grotesque and it is harder to stomach. No pun intended. There's a questionable decision as to why this movie went to black and white that I just won't understand.\n\nWhat the fuck is up with a scene near the last ten minutes? Like, it's the worst scene I could probably ever seen in anything. It's beyond stupid and so far wrong into any human compass that I sincerely belief the director of this movie needs to be checked medically.\n\nAnd the worst thing about this movie? It treats the first one as if it was an actual movie in the movie. What the actual hell. Why would you even do such a damn thing.\n\nThis is a 1 out of 10. (.5 stars) Ludicrous.",
            "review_date": "2014-12-09",
            "source": "rt"
        },
        {
            "content": "For being the most disgusting movie I have ever seen is the only reason I'm giving this film three stars. I have only watched it once and will only watch it once. Tim six went way over the top with this one. Where the first one was unique, clever, and actually watchable, this one manages to throw all of that out and just be about \"what can we do next to gross people out\"",
            "review_date": "2014-12-08",
            "source": "rt"
        },
        {
            "content": "(13%) (Review based on 88 minute \"international cut\") This maybe the most ugly movie I have ever seen, which is maybe the whole point, but watching this is still very much like being poked with a dirty toilet brush over and over again. This is a mixture of a grotesque trip into hell that has a real uncomfortable, and at times effective, feel and look, combined with some awful writing, poor acting, and a couple of broken plot points. The guy playing Martin does make for a unique leading role, and there are a few minor scenes that are blackly amusing, but to claim this as a black comedy is really pushing things a little far as it's just too bleak and unpalatable. By the end this has a god-awful sense of pointlessness, and along the way there's some graphic (yet clearly fake) violent torture and some other nastiness to sit through, but nothing to get upset about as it just comes across like it's trying way too hard to be crass and not offering enough in terms of depth, or indeed anything that most non- extreme viewers would actually ever want to see. If you must see it then it's not the worst film ever made, or the most morally backward, but it's nowhere near good enough to recommend.",
            "review_date": "2014-11-30",
            "source": "rt"
        },
        {
            "content": "Loved the first one but this one is just TOO creepy and disgusting. I can't even explain.",
            "review_date": "2014-10-29",
            "source": "rt"
        },
        {
            "content": "This movie is purely pointless.\n\nAll it is is senseless torture. Someone torturing people and having a camera man do the recording. \n\nAt least Saw had a story.. an actual one.\n\nWatch the first one.... Don't remotely bother with this one.",
            "review_date": "2014-10-20",
            "source": "rt"
        },
        {
            "content": "It's a disgusting exercise in poor taste, but that's sort of the point, isn't it? Tom Six directs this movie with a kind of sick satisfaction that is intriguing to watch. I just wish the images he puts on-screen were more bearable. It isn't a good movie by any means, but it's definitely an interesting filmmaking exercise, however tasteless and ugly.",
            "review_date": "2014-10-10",
            "source": "rt"
        },
        {
            "content": "There is really no point at all to this repulsive horror film. The acting is bad, the situations are not believable, and the gore is very extreme, but does nothing to reflect human insanity, it is just gratuitous violence. The final scene is beyond description in how disgusting it is. Lets just say that the sickest part of it is not the blood, it is something else. I have an extremely strong stomach, but I must say, this one made me very queasy! The only thing it has going for it is some creative cinematography. There are many ways the victims in this could have\nescaped, and the chief antagonist is just this very small, plump man with \nasthma. There is just nothing redeeming about this film, unless you enjoy watching people being operated on by rusty tools form a tool-box and with no anesthetic.",
            "review_date": "2014-09-04",
            "source": "rt"
        },
        {
            "content": "A truly awful movie. Probably the most boring movie i've ever watched. There is so much wrong with this movie, that I can't be bothered writing a massive review about it. Instead I will simply tell you that the only good thing about this movie is the performance given by Laurence R. Harvey. In this film he is actually quite scary. So much so that at comic con when I had the chance to meet him I took one look at him and walked in the opposite direction. But then again that probably has something to do with the sick things he does in this movie; to himself as well as other people. I seriously beg you not to watch this movie if you haven't already, even if your a fan of the original.",
            "review_date": "2014-08-27",
            "source": "rt"
        },
        {
            "content": "This movie was really nasty n messed up too",
            "review_date": "2014-08-21",
            "source": "rt"
        },
        {
            "content": "If I could give this movie zero stars, I would. What a waste of 87 minutes. I have no time for plotless shock flicks with nothing to offer besides poorly executed satire.",
            "review_date": "2014-08-15",
            "source": "rt"
        },
        {
            "content": "A great casting choice was made in the lead, giving us an unnerving and truly, deeply disturbing character. This film leaves you uneasy and in awe the entire duration, even if its all too much.",
            "review_date": "2014-07-31",
            "source": "rt"
        },
        {
            "content": "Better than the Boring Original! Still nothing spectacular but def worth watching at least twice!",
            "review_date": "2014-07-28",
            "source": "rt"
        },
        {
            "content": "And that's generous!",
            "review_date": "2014-07-14",
            "source": "rt"
        },
        {
            "content": "Absolute Garbage. Pointless and sickening.",
            "review_date": "2014-07-10",
            "source": "rt"
        },
        {
            "content": "So I've been crazy about horror movies since I was 5 years old. I've seen almost everyone you can think of. I love over the top blood and gore (ex: saw, hostel, I spit on your grave). But this movie is over the top and I have a very strong stomach and this movie has became the most graphic and most gruesome movie I've ever seen. Congrats Tom Six",
            "review_date": "2014-06-24",
            "source": "rt"
        },
        {
            "content": "Tom Six is to filmmaking what the worst case of raging hemorrhoids are to sitting down on a bed of nails. The social commentary here is a bit more clear than whatever could've been found in its predecessor, but who cares? The gore is so off-putting, tasteless and void of any merit, reason, intelligence or artistry that you'll be completely distracted from any commentary Six is trying to sell. I'm all for violence. I love violent films. Give me all the violence in the world, but give it some substance, be it for entertainment or dramatic emphasis. To those wondering, yes, a third one's in the works, and we should be all the more grateful for it. Now, if you excuse me, those captives down in my basement aren't gonna stitch themselves together.\n\nFull review at http://silverscreenfanatic.com/2014/06/09/what-the-hell-were-they-thinking-23/",
            "review_date": "2014-06-21",
            "source": "rt"
        },
        {
            "content": "Tom Six manages to create a disturbing atmosphere using a black and white cinematography and wide angle shots, but this awful sequel drags forever with not enough material to fill 90 minutes and most of it is so vile and sickening that it just overwhelms whatever merits it has.",
            "review_date": "2014-06-10",
            "source": "rt"
        },
        {
            "content": "Mixed feelings on this one, but definitely the most disturbing flick I've seen to date",
            "review_date": "2014-06-09",
            "source": "rt"
        },
        {
            "content": "One asthmatic psycho managed to squeeze our innards while watching.",
            "review_date": "2014-06-01",
            "source": "rt"
        },
        {
            "content": "Ugly, boring, and, overall, a fail to live up to expectations. Its ability to shock and disgust is gone and becomes annoying and aggravating as the film wears on.",
            "review_date": "2014-05-31",
            "source": "rt"
        },
        {
            "content": "I Like The Gore Film.",
            "review_date": "2014-05-25",
            "source": "rt"
        },
        {
            "content": "Not really my thing but there is very little to recommend here.... Whilst the body count increases,  the acting has got worse and I found myself wondering what the point of this flick was. \n\nOverall, a bit of a mess.....",
            "review_date": "2014-05-25",
            "source": "rt"
        },
        {
            "content": "I honestly thought I was going to throw up....this is hardcore & seriously nasty. Don't. Just........Don't",
            "review_date": "2014-05-25",
            "source": "rt"
        },
        {
            "content": "So I heard this movie was more extreme than the first film, so having seen the first film, I watched this film with an empty stomach & high expectations. I think the director skipped shock & aaww, and went straight for sick & hella nasty. The movie had no real plot to speak of just some psycho obsessed fan of the first film, with a disturbing pedophile father memories, a crazy mother & sick fudge packer doctor. The torture screens was disgusting. Too crazy for me. Ass to mouth torture, and making people shit non stop into each others mouths for 10 min was unwatchable!  those scenes literally made me sick. Jacking off with sand paper, and raping someone with barb wire around your dick is disturbing to say the least. I can't unsee what I watched unfortunately.",
            "review_date": "2014-05-17",
            "source": "rt"
        },
        {
            "content": "Just as bad as the first one.",
            "review_date": "2014-05-15",
            "source": "rt"
        },
        {
            "content": "loved it, turned me on",
            "review_date": "2014-04-22",
            "source": "rt"
        },
        {
            "content": "Un n'importe quoi divertissant !",
            "review_date": "2014-04-16",
            "source": "rt"
        },
        {
            "content": "I am a fan of gory and sickening horror - however, this exploitative and purely sadistic film is not enjoyable or watchable. It is overwhelmingly pretentious, and ultimately seems like nothing more than Ted Bundy's wank-fantasy.",
            "review_date": "2014-04-16",
            "source": "rt"
        },
        {
            "content": "too gory for me..... there a lot of SH!T there, I mean, literally.",
            "review_date": "2014-04-09",
            "source": "rt"
        },
        {
            "content": "It is intentional filth.",
            "review_date": "2014-04-08",
            "source": "rt"
        },
        {
            "content": "A horrifying and disgusting experience.",
            "review_date": "2014-04-05",
            "source": "rt"
        },
        {
            "content": "A horrifying and disgusting experience.",
            "review_date": "2014-04-05",
            "source": "rt"
        },
        {
            "content": "SLIGHTLY LESS BORING THAN ORIGINALLY!",
            "review_date": "2014-03-26",
            "source": "rt"
        },
        {
            "content": "This movie, by all accounts, should be avoided. Unless you know what you're getting into and can stomach something that is going for shock value instead of anything of substance. \nThis sequel did make me laugh. However it was only uncomfortably, I realize, that I was seeing something so grotesque and unnecessary. The director said in an interview that people expected the sequel to contain much more of \"the blood and shit.\" You do. Nothing is left to the imagination. \nWhile only less than an hour and a half long, I found myself wondering how much longer this was going to continue. Far too long I found out.",
            "review_date": "2014-03-26",
            "source": "rt"
        },
        {
            "content": "The first human centipede was messed up but it was also genuinely scary and made the audience think. The second however, was just plain gross. The entire movie was gore and shocking images. It's not enjoyably scary or even enjoyably bad like the first. It's just genuinely upsetting and disgusting. It took me two tries to handle it.",
            "review_date": "2014-03-03",
            "source": "rt"
        },
        {
            "content": "Every horror fan has a personal barometer of when a movie has \"gone too far\" and turned into a snuff film. This movie set off my barometer, bypassing the first movie's passing effort as a morbid curiosity and veering straight into idle hatred, including an ending that shows complete contempt for the audience. \"We're just as bad as the people in the movies!\" No, the movie is just as bad as it was created.",
            "review_date": "2014-02-15",
            "source": "rt"
        },
        {
            "content": "awful film. I don't know what they missed out to make this film suitable for the uk but I think they need to be a bit more vigilant in the future. violence for violence sake. not for anyone with a weak stomach",
            "review_date": "2014-02-10",
            "source": "rt"
        },
        {
            "content": "This bizarre and gory sequel to Human Centipede plays like an art-house film. And it must be watched with the mindset of an art film in order to appreciate all the unbelievable sequences that develop from Martin's (or is it Tom Six's?) insanity.",
            "review_date": "2014-02-08",
            "source": "rt"
        },
        {
            "content": "I watched a bit of this on Netflix. What a vile disgusting film. This kind of thing can only negatively effect someones mental health. How this got through to mainstream I will never know. Absolultey VILE and I am no whimp!!",
            "review_date": "2014-02-01",
            "source": "rt"
        },
        {
            "content": "Not much in common with the first film. It's basically a gore fest shot in black and white.",
            "review_date": "2014-01-22",
            "source": "rt"
        },
        {
            "content": "Nasty fucking movie!",
            "review_date": "2014-01-11",
            "source": "rt"
        },
        {
            "content": "This movie is extremely gory, sick-minded, that if you were eating popcorn while watching this trash, you will most likely end up in the same sick mess.",
            "review_date": "2014-01-03",
            "source": "rt"
        },
        {
            "content": "Not for the feint of heart. Again, extremely\nGory and graphic I'm a nurse- not all of this was medically accurate of course. But still written better than first one.",
            "review_date": "2013-12-29",
            "source": "rt"
        },
        {
            "content": "Disclaimer: I have not seen the film in its entirety, so this review could be seen as moot. But I do believe I've seen enough to warrant a review.\n\nSo, the first Human Centipede was undone by its ridiculously labourious pace and stretched out plot. Yes the ideas behind the film were ghastly and sickening, but what could have made an excellent short film turned into a glacially paced, detail-focused film. And while Full Sequence doesn't possess the detailed recounts of Dr Heiter's plans, we have Martin's repetitive forays into capturing his victims. And that's where main problem lies. \n\nAs Full Sequence is exactly everything everyone say it is to be--not for the easily disturbed--none of the truly horrifying sequences got to me. We've recently seen a trend in current films employ the tactics that old-school horror films used, creating a slow, often suspenseful build up to an exciting finale. Full Sequence tries to do this, but the end product is a redundant and tedious 50 minutes of our main antagonist, Martin, waking up, going to work, checking the security cameras, maiming his victims by shooting them, and then hitting them on the head with a crowbar before taping up their wrist and ankles before dropping them off at a warehouse. Now, as intriguing as that sounds, this happens 4 or 5 times for more than half of the film.\n\nThere is a break in this formula in the first act of this tedium, where Martin let's loose on his mother in their kitchen, which, to be honest, was welcomed, in the sense that action had finally picked up. But no, after this scene, Tom Six reverts back to his redundancy and bores the audience without really moving the plot along. Ultimately, this is Six's downfall. The boredom had set in so deeply that by the time the actual stitching and gore had come along, I sat there straight-faced without caring what happened to any of these characters. And unfortunately none of the film could really redeem any of this.\n\nThe film is shot in black and white which adds that \"artsy\" feel to it, and did add to the atmosphere. Every shadow is present, accentuating the darkness of the film and Martin's sinister motives. There are some interesting shots in the film, one in particular is when Martin's victims are sprawled out on the floor squirming and he goes around knocking them on the heads with a crowbar, effectively rendering them immobile. Tom Six has an eye, he just can't tell as story.\n\nInterestingly, Martin does not speak at all--which is probably for the best. But what I found dismaying was the depiction of those with mental health issues. Martin doesn't speak, he squeals, cries, screams, and is reduced to hog-like noises, to match his appearance. Sure, those could be terrifying, but what a way to portray a character who is dealing with psychological trauma and sexual abuse. I could only imagine the dumb shit Six would have had his character spout out if he had actually spoken.\n\nThe bit about the social commentary on fans who divulge too deeply into the cinematic world did carry some weight and shows that Six does have possible insight to the horror genre. But in the end the way he constructed his film, does not support this commentary.\n\nAgain, I haven't seen the entire film, so take this review with a grain of salt, but from what I've seen, Full Sequence's message is completely overshadowed by the repetitive nature of the film, and unfortunate depiction of those dealing with psychological horrors.\n\n1/10",
            "review_date": "2013-12-25",
            "source": "rt"
        },
        {
            "content": "???? ???? ??? ?????? ??? ?? ?????? ??? ???? ??????\n???? ?????.. ?? ??? ????? ??? ???? ????? ??? ?? ???? ?? ??? ?? ?????? ???",
            "review_date": "2013-12-24",
            "source": "rt"
        },
        {
            "content": "Nothing really shocks me. This is just more disturbing and darker than the first. You can tell they are trying hard to make this as messed up as possible. I do appreciate the fact that they add some kind of background story. Definitely sicker then the first.",
            "review_date": "2013-12-16",
            "source": "rt"
        },
        {
            "content": "I wish the first movie had taken as much time being artistically thoughtful as this movie had. The lead role is surprisingly effective for being a mute, and I really liked the incorporation of an actual centipede metaphor, but for a movie that's so \"pretty\" in the sense that every grotesque scene has some actual design in it, it just doesn't have the not-so-charming shock The Human Centipede had... this one is simply meant to make you throw up.",
            "review_date": "2013-12-11",
            "source": "rt"
        },
        {
            "content": "about as enjoyable as watching a real raping. twisted sadistic garbage which i can only imagine is enjoyable to watch by similar mindsets who would like to do such things for real.",
            "review_date": "2013-12-08",
            "source": "rt"
        },
        {
            "content": "More vomit inducing, more depraved, and more twisted than the first. It's also a lot better, thanks to how gorgeous it looks and its gripping characters. I hate myself for liking this.",
            "review_date": "2013-12-08",
            "source": "rt"
        },
        {
            "content": "Is this a good movie? Jesus no, but I sure as hell love it. I love the sadistic violence and pointless gruesome content. Although rather boring at times, THC 2 is worth watching. Just bring a barf bag",
            "review_date": "2013-12-07",
            "source": "rt"
        },
        {
            "content": "After watching the first film and thinking how sick it was especially some of the ideas that director Tom Six came up with i thought this one could not get any worse, how wrong was i. First of all the film is enterily set in black and white, must be for effects with how gross some of the scenes are. Secondly the lead actor a middle aged fat bloke who cannot speak is completely weird and can imagine he is in real life. Thirdly the film itself is so sick i could barely watch at times thinking i was going to be sick. So personally people out there i would stay well clear and find something else to watch",
            "review_date": "2013-12-07",
            "source": "rt"
        },
        {
            "content": "As its predecessor, it is nasty, wll not only nasty, but twiced nasty, twiced sick, and more gory than the first movie, but for a reason that I don't understand, I did enojy the movie, now it has a point, a true horror ovie, too short, I wanted more but what we were given was satisfying, now this is a true centipede.",
            "review_date": "2013-12-05",
            "source": "rt"
        },
        {
            "content": "1 star! \n\nJust as bad as the first one maybe even worse! Some psycho kills his mum and everything and makes a human centipede! It is really gory! Not something I would ever see again!",
            "review_date": "2013-11-26",
            "source": "rt"
        },
        {
            "content": "lots of people I know have said this movie was really bad, but honestly I liked it a lot, very graphic and interesting.",
            "review_date": "2013-11-24",
            "source": "rt"
        },
        {
            "content": "Like a character in a Clive Barker novel: I just had to know. \nThe first one was surprisingly well shot and even in the sequel, the scenes between the out and out gore are suffocatingly cloying but even at x30 I hardly could get through the scenes at the end.\nWould like to see what Tom Six did with a stronger story as he actually has some skills.",
            "review_date": "2013-11-24",
            "source": "rt"
        },
        {
            "content": "fuck me that wee guy martin right creepy wee bam wasnt he. still a bit confused though about the pregnant women and why she killed the baby if accident meant etc. but strange film strange happenings. also why the fuck did the wee weirdo no die in end that wouldve been better.",
            "review_date": "2013-11-23",
            "source": "rt"
        },
        {
            "content": "Well, this is even more disgusting than the first. The black in white somehow makes it even more gross. The storyline isn't quite as interesting, just disturbing.",
            "review_date": "2013-11-16",
            "source": "rt"
        },
        {
            "content": "Yes this movie has revolting and disturbing content, but some people do similar crimes to the ones depicted in this film. The characterization of Martin is brilliant, he truly is odious. A fascinating story which is very well photographed and a captivating artistic piece. I am surprised at such low scores from others.",
            "review_date": "2013-11-16",
            "source": "rt"
        },
        {
            "content": ":/ Barely watchable....I liked it.",
            "review_date": "2013-11-02",
            "source": "rt"
        },
        {
            "content": "The original The Human Centipede was disgusting in its plot, but not very graphic.  This was a redeeming quality, as it left a lot to the imagination, and left room for a plot.  This, the second film, has far less redeeming qualities.  It is graphic, in its violence, surgical scenes and centipedal scenes, and it is very disgusting, and gratuitous.  Plot is basic.\n\nReally nothing to recommend this movie for.  Avoid.",
            "review_date": "2013-10-31",
            "source": "rt"
        },
        {
            "content": "This film definitely ups the ante in terms of gore and straight-up disgusting things, but it's also full of itself and pretentious by trying to make social commentary.  This sequel treats the previous movie as a work of fiction, and the main character is a fat, grotesque slob who is obsessed with it to the point of wanting to recreate the titular \"human centipede\" with 12 people this time instead of three.  Although there are some brief moments where you get a glimpse into this man's life, most of the movie is concerned with him rounding up his victims, which gets tedious after a while.  He has a job in a London parking garage, so when he sees somebody stranded he leaves his post and incapacitates them, usually with a gun and a crowbar.  Very (not) interesting.  Even though his character is almost completely unsympathetic, the way the actor plays him is rather interesting.  Not only is he a fat slob, but he's also got some mommy and daddy issues as well as severe asthma.  He also has a tendency to lick his fingers.  These tics make for some of the more entertaining parts of the movie, because he's pretty inept when it comes to everything else.  When it gets to the finale where he finally puts his \"creation\" together, it's as gross as you'd expect.  At this point, I should mention that the movie is in black and white...mostly.  There's a few splotches of a certain color once he gives all 11 members of his \"centipede\" a laxative.  The reason there's only 11 is because the 12th, a pregnant woman, is knocked unconscious for a while.  This woman manages to escape, resulting in one of the more graphic abortions I've seen on film (probably the only one).  The movie ends shortly thereafter, but with one twist which I won't give away (maybe you can guess...).  Anyway, the movie is probably trying to say something about society's violent tendencies, or maybe about the ridiculousness of taking some violent horror films seriously (like Tom Six's own HUMAN CENTIPEDE).  Whatever the \"message\", it gets lost among the filth and the gore.  My recommendation would be to skip it, unless you're absolutely into this type of movie.",
            "review_date": "2013-10-29",
            "source": "rt"
        },
        {
            "content": "This movie was on in the background but I managed to watch many stupid parts from this film. It's horribly disgusting, I'll give it that. 2/5",
            "review_date": "2013-10-24",
            "source": "rt"
        },
        {
            "content": "I spent an hour and 20 minutes watching this? What the fuck is wrong with me",
            "review_date": "2013-10-21",
            "source": "rt"
        },
        {
            "content": "OMG\n\nHow anyone got paid to make this film or anyone paid to see this shit is beyond me! worst I've ever seen!",
            "review_date": "2013-10-16",
            "source": "rt"
        },
        {
            "content": "Back in 2009 when I first saw The Human Centipede (Sequence 1) I thought that Tom Six would never be able to top his first tri-human piece of art. Boy, was I wrong or what! Who would have thought that a twelve person ass to mouth connection would leave me crying tears of joy all night!! It was really a moving experience that I can't wait to own on DVD and Blu-ray!! Best Movie 2011!!!! 10/5 Star Rating!!!",
            "review_date": "2013-10-15",
            "source": "rt"
        },
        {
            "content": "Holy shit what did I just watch.",
            "review_date": "2013-10-11",
            "source": "rt"
        },
        {
            "content": "Not as bad as I thought it would be. Better than the first one.",
            "review_date": "2013-10-07",
            "source": "rt"
        },
        {
            "content": "Gross and completely sickening!! just plain stupid!!! Why the fuck was I watching this shit!???",
            "review_date": "2013-10-02",
            "source": "rt"
        },
        {
            "content": "the first gore film that broke me",
            "review_date": "2013-09-28",
            "source": "rt"
        },
        {
            "content": "there is simply no reason for this movie to exist",
            "review_date": "2013-09-13",
            "source": "rt"
        },
        {
            "content": "The Human Centipede es de esas peliculas que son tan maravillosamente bizarras y oscuras que llega a fascinar. Cabe resaltar que la cinematografia esta bastante bien llevada a pesar de ser cine independiente y Laurence Harvey para mi fue la pieza esencial para ese laberinto de sangre y gore que nos prepara Tom Six",
            "review_date": "2013-09-07",
            "source": "rt"
        },
        {
            "content": "THC2 is one of the most disturbing, trashy, sexually brutal, violent and pointless movies I've ever seen. There's no artistic view in this, and, Mr. Tom Six (Director/Writer), making it a black & white movie doesn't save it either. It doesn't even make it more impactful or gruesome. It's just a wannabe-artistic add-on. \n\nThat said, I totally get why it has been banned in the UK, because it has to. If the first one was about a mad scientist, the second takes us in the protagonist's P.O.V, and the latter is nothing but a maniac whom is obsessed over the actual movie and the 'Human Centipede' project. If only that was the only problem though... The man isn't just obsessing over the DVD, but sexually aroused by its content. So his goals aren't exactly the same, I let you guess. \n\nOverall, the film contains disgusting scenes of killing, beating, rape, mutilation and of course gore.\nDefinitely one movie you should avoid, even just to save some precious time. it isn't worth 1h28min of your life, believe me.",
            "review_date": "2013-09-02",
            "source": "rt"
        },
        {
            "content": "Ugly, reprehensible flick that loses most of the classic horror elements of its predecessor and triples the perverted obscenities (or obscene perversions). So why one star as opposed to zero? Because there's actually some talent on display here on the part of director Tom Sixx. Perhaps the most disgusting aspect of this gorefest/torture porn geek show is that Sixx and his producers feel this is the best use of his artful eye.",
            "review_date": "2013-08-30",
            "source": "rt"
        },
        {
            "content": "if the fact it's in black and white doesn't put u off the 1st hour will bore you to tears as he's collecting his components of a new human centipede. why's he doing this he watched the 1st damn movie. really that's how they go about this sequel?? \nonce the 1st hours gone and were in gore territory I guess it picks up but in the end what's the damn point to it all??",
            "review_date": "2013-08-30",
            "source": "rt"
        },
        {
            "content": "such a heart warming story about a young trying to overcome his socially awkward nature to blossom into a confident go getter. So much love for the special effects in this, made me feel like i was part of the movie, or at least i wish i could have been.",
            "review_date": "2013-08-28",
            "source": "rt"
        },
        {
            "content": "The film actually left me feeling disgusted at times, which is honestly what I was looking for, after the first film ended up being pretty underwhelming in that respect.  It's obvious that Tom Six had a lot to say about how serial killers are perceived, even if the ideas are often unclear and the third ac becomes tedious.  I also appreciate the film's dark sense of humor.",
            "review_date": "2013-08-26",
            "source": "rt"
        },
        {
            "content": "It was great comedy but it wasn't very scary hence it doesn't quite fit into the horror genre.",
            "review_date": "2013-08-17",
            "source": "rt"
        },
        {
            "content": "This Movie is extremely Violent, Disgusting, and horrible... its all through the mind of the psychopath, the movie seems demonic.. I had to quit watching this it was a little too sickening to me.",
            "review_date": "2013-08-16",
            "source": "rt"
        },
        {
            "content": "The first film was actually decent, but this just goes for shock value. It's disgusting but not in a brilliant way like the first film was, and with the next sequel having a '500 man centipede' i'm not sure i am even going to bother watching.",
            "review_date": "2013-08-10",
            "source": "rt"
        },
        {
            "content": "A repulsive little follow up to the bucket of shit that was Human Centipede, this sequel takes the 90's post modern approach. Our antagonist is inspired by watching Human Centipede. There's no imagination here; mistaking black and white for some sort of artistic skill, Tom Six takes the audience through a poorly shot odyssey of crassness and shock value cruelty. It says nothing, it does nothing. It's just crap.",
            "review_date": "2013-08-07",
            "source": "rt"
        },
        {
            "content": "NEVER EVER EVER EVER EVER WATCH IT. THE MOST DISTURBING THING I HAVE EVER SEEN. IT WAS HORRIBLE.",
            "review_date": "2013-08-03",
            "source": "rt"
        },
        {
            "content": "If any film will make you lose all faith in film as an art form, this is it.",
            "review_date": "2013-08-01",
            "source": "rt"
        },
        {
            "content": "Waste of fucking time. There was too much shitting involved...",
            "review_date": "2013-07-31",
            "source": "rt"
        },
        {
            "content": "This truly is my FAVORITE MOVIE. I always am looking for the most explicit over the top movies I can find, and aside from 'A Serbian Film' this is the most insanely explicit movie you will ever find. All of my senses were completely satisfied. A++ !",
            "review_date": "2013-07-31",
            "source": "rt"
        },
        {
            "content": "This movie is just straight craziness!!",
            "review_date": "2013-07-30",
            "source": "rt"
        },
        {
            "content": "Gorier, stupider, a LOT more boring than the original.",
            "review_date": "2013-07-30",
            "source": "rt"
        },
        {
            "content": "Is this what hell is like?",
            "review_date": "2013-07-23",
            "source": "rt"
        },
        {
            "content": "Never seen, and never want to see.",
            "review_date": "2013-07-21",
            "source": "rt"
        },
        {
            "content": "gnarly nastiness. way worse than the first",
            "review_date": "2013-07-14",
            "source": "rt"
        },
        {
            "content": "THIS IS COMPLETE UGLINESS TO WATCH. I felt completely horrified to see Human Centipede 2. The main character is the creepiest, scariest, horrified, stereotypical, craziest person I have ever seen. That's what happens when you become obsessed with the Human Centipede , you wanna make your own human centipede just like our creepy protagonist, oh wait, antagonist my bad there's no protagonist . This movie should be banned to watch for all ages. The graphic horror isn't enjoyable to watch either, it's just plane wrong in every way. Don't watch this movie cause you will be scared for life.",
            "review_date": "2013-07-09",
            "source": "rt"
        },
        {
            "content": "Well, this movie is a lot of things. It's been a while since a movie shocked me the way this one does. The first was ridiculous, where can it go? Well, meta and grayscale, apparently. \"Reprehensible, dismaying, ugly, dismal, nauseating and an affront to any notion, however remote, of human decency, yet bizarrely artful.\" It's \"sick, disgusting and vile. It's also demonically funny, stylish and ingenious.\" \"The enormous shift between [Six's] first and second film and the technical skill he displays (notably in his superb sound design) suggests he has much to offer beyond the self-imposed limitations of his bum-to-gum oddities.\" The main character is one of the creepiest and most revolting I've seen.",
            "review_date": "2013-07-04",
            "source": "rt"
        },
        {
            "content": "Far from its predecessor, this movie does a real number on you. Perhaps the most diabolical there is. All the sickest things in this wretched world materializes in this movie. You name it, this movie has it.",
            "review_date": "2013-07-02",
            "source": "rt"
        },
        {
            "content": "the most disgusting movie I've ever seen something I will never ever watch again. I don't understand how any of the actors went through with it.",
            "review_date": "2013-07-02",
            "source": "rt"
        },
        {
            "content": "Some films you will only watch once.. This is that kind of film. Perverted and sick. Tom Six is a true provocateur!",
            "review_date": "2013-07-02",
            "source": "rt"
        },
        {
            "content": "While it may be more violent and disturbing than the first one, The Human Centipede 2 is beyond mean spirited and overtly obnoxious in its message and the violence while vicious eventually becomes numbing and even dull. Tom Six needs new ideas if he wants to make a better sequel.",
            "review_date": "2013-06-20",
            "source": "rt"
        },
        {
            "content": "No ver. Do not see. This movie is truly sick, no sense at all. But if your watching this is because you have a sick mind too. I liked it but never compared with the first one. This one is truly sick (Goodies) but.... hell some people like to feel sick sometimes. Beware, its bad but thats not always a bad thing.",
            "review_date": "2013-06-13",
            "source": "rt"
        },
        {
            "content": "It's completely disgusting, 10 times worst than the first sequence. Disturbing",
            "review_date": "2013-06-12",
            "source": "rt"
        },
        {
            "content": "Yeah, it was a sick movie, but I took it with a dose of humor.  Completely implausible, but the ending suggests this was all just a sick fantasy on the part of the \"protagonist\", Martin.",
            "review_date": "2013-06-09",
            "source": "rt"
        },
        {
            "content": "Wow, mostly boring for the first hour, but then sick and disgusting for the rest. It became too outrageously gory for it to be interesting. Weak plot that didn't support the gore. Waste of time.",
            "review_date": "2013-06-05",
            "source": "rt"
        },
        {
            "content": "I am a huge fan of Tom Six's The Human Centipede. Easily the most talked-about horror film of 2010, though perhaps more for the subject matter than the actual movie itself, its concept gained infamy as it spread through the internet like wildfire. But upon my declaration of love for that film, I'm usually greeted with uproar - \"that film is disgusting!\"; \"you absolute weirdo!\" and \"I thought you said you didn't like torture porn?\" are the typical responses.I remain a staunch defender of the original, however; it was a gorgeously shot, artful horror movie that was teeth-grindingly tense. The only crude element was the idea, which Six got around by making an elegant movie, that held punches and was never gratuitous.\n\nThe sequel, however, grabbed any notions of subtlety and catapulted them to oblivion; The Human Centipede II is torture porn, torture porn, torture porn! Everyone knows the story by now - a creepy dude abducts a few unsuspecting people, knocks them out, sews them together ass-to-mouth and observes their suffering. He is inspired by the mad scientist from the first one, and watches the movie on repeat throughout the day (sometimes enjoying it a little too much, if you know what I mean). Working in a car park, he captures around twelve unsuspecting people, ties them up, brings them to a warehouse, strips them down and... You can guess the rest.\n\nWith quadruple the number of victims, The Human Centipede II certainly ups the ante from the original. But that's all it does, and unfortunately it's at the cost of virtually all the factors, including any style, tension and exuberant cinematography demonstrated by the first Human Centipede. There is a tendency among genre movies of this kind (Saw, Hostel etc.) to outdo one another; it's as if there's some kind of hushed competition among these film-makers to determine who exactly can make audiences retch the most. What does Tom Six bring to the table with his latest offering? Pregnant women. Pregnant women at the front of the damn centipede.\n\nIt's shocking for shock's sake alone, and everything just feels so arbitrary. There are people whose heads get bludgeoned to an unrecognisable pulp, the neck of which still squirting blood, as if there was any head left. Children are involved, sexual abuse abounds, severe depression haunts Martin's mother and he even masturbates on screen. The Human Centipede II is the kind of film where most of the actors spend the majority of their time writhing about naked on the concrete floor of some empty warehouse, thinking of their loved ones and just waiting for their death.\n\nThere's no rhyme or reason to the killings - at least Jigsaw from Saw alleges that the unfortunate souls he imprisons are morally corrupt in some way. Martin, on the other hand, abducts an aggressive white couple, a charming black couple, the asshole who lives upstairs, a friendly businessman, a pair of drunk women and a creepy guy with a foot in the child pornography industry. This blending of the good with the bad makes it impossible to understand the madman's motive; yes he is inspired by the first one (so much so, he keeps a scrapbook) but is that all there is? The first film hinted at Six being a talented, clever director, being able to transcend disgusting ideas by making a well-crafted film, devoid of scatological absurdities.\n\nBut that's all we're given here, and the result is boring as hell. Of all things, I hadn't expected to be bored by this movie, but so much of it is taken up by Martin capturing unsuspecting lab rats, leaving them at the pseudo-laboratory, going back home to bed, and repeating the cycle the following day. He utilises the same method of abduction (shooting them, before promptly bashing their heads in with a crowbar) each time, and it just gets so repetitive. This is eighty-eight minutes of duck-taped people wriggling about the floor, and it's really, really dull. The black and white is a small mercy, in that we can't see any colours of the various bodily fluids (until they hit 'the camera', which infuriates me because it's so bloody tacky), but ultimately it only adds to the monotony.\n\nAnother thing that many people appreciated about the first Human Centipede was the alleged 'medical accuracy'; now I don't claim to know anything about medicine, but I do know that its sequel is unrealistic to the point of just being silly. Forget the ludicrous concept for a second - people survive having their heads repeatedly bashed in, and losing impossible amounts of blood. I simply do not believe that Martin's employers couldn't have noticed that strangers were disappearing en masse from their car park and not realised he was the one working the cameras. It just makes no sense, and while the first one was bananas, at least it was somewhat plausible.\n\nIf any praise is to be given to this movie, it must be directed towards Laurence R. Harvey, who plays Martin, purely because he is one of the most unsettling antagonists I've ever seen in a film. Without being outwardly horrifying, it's obvious from his appearance that vast quantities of screws are loose; years of psychological and sexual abuse have resulted in a morbidly obese, balding midget who regularly soils himself and masturbates to human centipedes, all the while being covered in a thin layer of sweat which I could practically smell. He genuinely resembles an insect, with those bug-eyes, which is an interesting comparison given the film's preoccupation with centipedes.\n\nThe first Human Centipede was shot beautifully, and featured an elegance to the simplicity of the storytelling, which was at odds with the screechy, blunt, unashamedly unsubtle standards of 'modern' horror movies. The Human Centipede II, on the other hand, is the exact opposite: loud, obtuse and entirely unnecessary. I wish it'd just sprout wings and fly away...",
            "review_date": "2013-06-05",
            "source": "rt"
        },
        {
            "content": "The Human Centipede II (Full Sequence) (2011) -- [2.0] -- The 'centipede' aspect, somewhat scary in the first film for its 'scientific accuracy,' is out the window here. The sequel features a man creating a 10-person ass-to-mouth creation with just duct tape and staples. I don't care how much duct tape you use to immobilize me -- if you threaten to make me part of a human centipede, I will damn-well find a way to escape. So there goes my suspension of disbelief. But in addition to being silly, \"Centipede II\" is also a supremely ugly film for attempting to make (at all) sympathetic the sexually abused, mentally handicapped character who creates the centipede. So, silly and ugly. Either way you slice it, why the hell would you want to make this movie?",
            "review_date": "2013-05-26",
            "source": "rt"
        },
        {
            "content": "The second installment of Tom Six's trilogy lacked everything the original provided and more. Filmed in black and white, theoretically to induce more violent mental images than were actually being portrayed, was the first step towards the disaster that was this film. Laurence Harvey did do an incredible job of acting without speaking a single word the entire film; however, this definitely does not lead to a good film. Bottom line, stick to the first one and leave it at that.",
            "review_date": "2013-05-21",
            "source": "rt"
        },
        {
            "content": "To quote Ian Malcolm from \"Jurassic Park\":\nThat is one big pile of shit",
            "review_date": "2013-05-17",
            "source": "rt"
        },
        {
            "content": "There is a very strong contrast to Tom Six's first installment of this film. In fact, the approach is rather interesting. In the Human Centipede II, we find that the happenings in the first movie where just that , a movie. Which means, it never happened. Oh but wait, we then meet Martin; a short, pin-head, pop-eyed, down right creepy type of guy. Oh, and did I mention he was mentally challenged? Don't ask me how I know; just say the title of the film. \n\nYes, it gets better. Martin is a parking garage attendant, at a garage that seems to offer very opportune situations for abducting people. Oh, and he's a copy-cat murderer. And yes, you guessed it; he is using the original Human Centipede film as a reference for attaching not 4, but 12 people together ASS TO MOUTH. A human centipede. Or maybe it's just people attached ass to mouth? \n\nEither way, that's as deep as the plot goes. There are no deep profound meanings, no plot twist, no climatic endings. Six seems to be aiming to please fans of gore, with anal incisions, severed nerves, mouths stapled to asses, and consequently- mouths filled with shit.\n\nIn all, the film has been shot in a high contrast stylistic black and white; which was most likely done to take the edge off of the excessive gore. Either way, he has in some ways achieved a very masterful piece of art with the shooting technique. The aforementioned, accompanied by Laurence R. Harvey's creepy and convincing delivery of Martin; makes this film is without doubt one that will stick with you for better or for worse.",
            "review_date": "2013-05-10",
            "source": "rt"
        },
        {
            "content": "Parece que el productor de esta pelicula quizo encontrar una forma de concentrar todo aquello que se encuentra asqueroso para cualquier persona, lo ha logrado.",
            "review_date": "2013-04-27",
            "source": "rt"
        },
        {
            "content": "Although Tom Six displays his variation of style in this film due to the fact it's extremely different from the first, it was too over the top, offensive and disturbing to enjoy. The torture and extreme nature of the film is not justified in any way, shape or form. It is greatly shot, and Tom Six shows his technical brilliance, as well as shooting the film in black and white to give it a creepier atmospheric feeling, but he took it too far with the violence and unnecessary attention to disturbing detail which essentially makes the film a torture porn fest.",
            "review_date": "2013-04-23",
            "source": "rt"
        },
        {
            "content": "While actually quite artistic, Human Centipede 2 ends up becoming way too over the top and actually quite annoying as we close the film.",
            "review_date": "2013-04-14",
            "source": "rt"
        },
        {
            "content": "Ewwwwww had no resolution",
            "review_date": "2013-04-13",
            "source": "rt"
        },
        {
            "content": "Wow,...and you thought the 1st one was bad?!  You've seen NOTHING yet?!  I'm pretty sure this Tom Six guy just wants everyone to know it's \"100% medically accurate\"?!  Whether is actually is or  not?!  It DEFINITELY 100% SUCKED!",
            "review_date": "2013-04-12",
            "source": "rt"
        },
        {
            "content": "I wanted to turn it off, almost as soon as I started watching it - BUT just couldn't. Don't think I could watch it again. It's creepy and sick and twisted and worth at least a try.",
            "review_date": "2013-04-10",
            "source": "rt"
        },
        {
            "content": "I watched this recently and I was disappointed the first 1 was WAY better I don't recommend this movie not scary at all",
            "review_date": "2013-04-07",
            "source": "rt"
        },
        {
            "content": "I personally can't stand the first Human Centipede movie, but I watched this one and I ended up really liking it. I liked the plot and I think the black and white fit the atmosphere of the film.",
            "review_date": "2013-04-03",
            "source": "rt"
        },
        {
            "content": "\"Human Centipede II\" opens with a strong narrative that leaves you wanting more, but it never fully delivers on the grand storytelling scale. Where it does deliver is the shock value. The use of the black and white effect is grotesque at times and completely takes you by surprise with the inventive use of color. It is a lot more captivating than the first one, but it still doesn't live up to it's full potential.",
            "review_date": "2013-04-03",
            "source": "rt"
        },
        {
            "content": "Even more disturbing than the first one.",
            "review_date": "2013-03-30",
            "source": "rt"
        },
        {
            "content": "Disgusting as well as creepy",
            "review_date": "2013-03-29",
            "source": "rt"
        },
        {
            "content": "This horrible sequel to the disturbing yet horror changing 2010 phenomenon isomer gross than terrifying.If you wanna watch it go ahead but for me it's a definite skip.",
            "review_date": "2013-03-28",
            "source": "rt"
        },
        {
            "content": "Some stuff in this film was kind of funny actually. But this film would've been Better if they made the main character talk And if it wasn't in black and white. But this was ok.",
            "review_date": "2013-03-27",
            "source": "rt"
        }
    ]
}