{
    "rating": 9.2,
    "release_date": "2011-01-28",
    "num_reviews": 390,
    "genres": [
        "History",
        "Drama"
    ],
    "summary": "England's Prince Albert (Colin Firth) must ascend the throne as King George VI, but he has a speech impediment. Knowing that the country needs her husband to be able to communicate effectively, Elizabeth (Helena Bonham Carter) hires Lionel Logue (Geoffrey Rush), an Australian actor and speech therapist, to help him overcome his stammer. An extraordinary friendship develops between the two men, as Logue uses unconventional means to teach the monarch how to speak with confidence.",
    "reviews": [
        {
            "content": "The first 20 minutes are a little slow But if you stick with it you'll be glad you watched this film.",
            "review_date": "2023-03-14",
            "source": "rt"
        },
        {
            "content": "this movie sucks because its live action",
            "review_date": "2023-01-27",
            "source": "rt"
        },
        {
            "content": "Solid if definitely formulaic period piece, Geoffrey Rush gave a wonderful  supporting performance and I overall enjoyed it on the whole.",
            "review_date": "2023-01-16",
            "source": "rt"
        },
        {
            "content": "The best acting performance from Colin Firth! With the best movie costumes ever designed!",
            "review_date": "2022-11-26",
            "source": "rt"
        },
        {
            "content": "Although dragging on at times, Tom Cooper's historical drama manages to be thoughtful and interesting with some truly fitting themes and a truly sensational lead performance from Colin Firth.",
            "review_date": "2022-10-15",
            "source": "rt"
        },
        {
            "content": "The King's Speech is an amazing film with great directing, editing, visuals, and performances. If you are someone who is interested in King George VI and the Royal Family, you would without a doubt like this film, even if you aren't interested in them I think you would still enjoy it because it is just a great film. The film manages to make a story of a King struggling to say words into something quite powerful and moving.",
            "review_date": "2022-10-04",
            "source": "rt"
        },
        {
            "content": "A regal masterpiece stuffed with great performances, great sets and great cinematography.",
            "review_date": "2022-09-30",
            "source": "rt"
        },
        {
            "content": "a timeless movie. Personal improvement in a historical backdrop. Highly recommended",
            "review_date": "2022-09-20",
            "source": "rt"
        },
        {
            "content": "One of my all time favourites!",
            "review_date": "2022-09-19",
            "source": "rt"
        },
        {
            "content": "One of Colin Ferrel's best movies. The movie is a bit too serious in tone. I have to imagine these people did have some fun in their lives.",
            "review_date": "2022-08-25",
            "source": "rt"
        },
        {
            "content": "I had a lot to say about The King's Speech but I shortened it up a bit.  Definitely one of the most difficult reviews I have done for a multitude of reasons.\n\nI don't know why I don't like it.\nI don't know why critics like it.\nI don't know why audiences like it.\nI don't know why I scored it what I did. \n\nAbout as entertaining as trying to listen to someone with a speech impediment. \n\nSomehow it keeps attention. Has some re-watch value, but not much.  I can live without more of it.  Yet, there was nothing bad about it.  There was nothing offensive.  My guess is that a lot of people who don't like public speaking identified with it.",
            "review_date": "2022-08-21",
            "source": "rt"
        },
        {
            "content": "This film seems pedigreed for the Academy: a story about the British royals, a period piece, encompassing WWII, a character with a physical ailment he must overcome, class confrontations and an unlikely friendship. And it really happened. Yet thanks to a marvelous cast, witty and heartfelt writing, and sure-handed direction this film emerges as one of 2010's very best films. The movie tips us to its brilliance in the opening scene--a masterfully tense sequence where the stammering Duke of York must make his first speech to the British Empire in 1925 on the radio, which consisted of approximately a fourth of the world's population. The fear perfectly conveyed on Colin Firth's face, the fear and sympathy pouring out of Helena Bonham Carter's loving wife, all aided by director Tom Hooper's gliding camera and crisp editing, results in a heartbreaking moment of terror and hesitation. Firth has always been good, but delivers a true Oscar-worthy performance as the stuttering prince who would be king and lead his country through a key time in Europe's history. Bonham Carter is so warm and caring she reminds us why millions fell in love with the woman who would go on to their Queen Mother. Geoffrey Rush brings a great dose of fun and laughs as the teacher who must help this man overcome his disability, by any means necessary. The film also features wonderful casting flourishes in smaller roles: Guy Pearce as the self-absorbed and cowardly Prince Edward VIII, Michael Gambon as a bluff King George V, Timothy Spall as a wry Winston Churchill, Derek Jacobi as a flustered archbishop. It's a magnificent cast, with not one bad performance. The film is also a triumph of style, with divine period details and cinematography, as Hooper shot this with big lenses that make interiors look overbearing, long and narrow, visually representing the King's psychosis involving his closing throat and fear of inadequacy. Thanks to everyone involved, this is a fascinating, engrossing, emotional and inspiring true story that is worth seeking out for your immense viewing pleasure",
            "review_date": "2022-08-07",
            "source": "rt"
        },
        {
            "content": "One of best movies. It is based on true events and it tells interesting story about unusual frienship.",
            "review_date": "2022-06-24",
            "source": "rt"
        },
        {
            "content": "This ultimate underdog story sees our unsuspecting hero, The King of England, use all his stubbornness and unlimited resources to finally get the help he needs before rejecting it more times than Wallis Simpson was married. \n\nThankfully the underpaid and under-appreciated, Lionel Logue, sticks with the man-child that is King George VI to assist him delivering the speech that will unite all of Britain against the Nazis, proving that if you work hard, stay focused and are THE KING OF ENGLAND, you can do anything you put your mind too.",
            "review_date": "2022-06-23",
            "source": "rt"
        },
        {
            "content": "Exceedingly Great movie! This film is, of course, brilliantly acted with the help of the always versatile Geoffrey rush who gives his best performance since shine.",
            "review_date": "2022-05-24",
            "source": "rt"
        },
        {
            "content": "The emotions and the relatability to this true story lingers in your mind. Brilliant performance by Firth and I will always love HBC she is the best- and strongest rendition of the queen mother. Loved this film",
            "review_date": "2022-01-17",
            "source": "rt"
        },
        {
            "content": "I'm not good at speeches. This movie with great actors according to real events is great.",
            "review_date": "2022-01-09",
            "source": "rt"
        },
        {
            "content": "Colin Firth's performance was incredible.  The movie itself was predictable but well produced and a rousing period drama.  This is a superior historical drama as well as a personal one.",
            "review_date": "2021-12-01",
            "source": "rt"
        },
        {
            "content": "Fantastic cast. Helena Bonham Carter is just flat-out brilliant, as always, she is my favorite working actor right now Amazing story. Glorious costumes and sets.  But I found some of the dialogue during the speech lessons a bit contrived/cliched. Still, I learned much from this movie.",
            "review_date": "2021-09-10",
            "source": "rt"
        },
        {
            "content": "This movie won an academy award for Colin Firth!!!!",
            "review_date": "2021-08-28",
            "source": "rt"
        },
        {
            "content": "Not a big fan of this one.  It's a well made film, but the subject matter borders on royal fandom.   The importance of a figurehead royal overcoming a stutter feels overstated here. The whole movie felt out of touch when taking into account the sacrifices made by the rest of society at the time.",
            "review_date": "2021-07-12",
            "source": "rt"
        },
        {
            "content": "Exceptionally well acted and Colin Firth is so very handsome and deserved his Oscar. Fantastic and worth watching.",
            "review_date": "2021-06-07",
            "source": "rt"
        },
        {
            "content": "Was it the Best Picture in 2010? Neither Rolling Stone nor RogerEbert.com have The King's Speech ranked in their 50 Best Movies of the 2010s. For Ebert's crew, only the Top 25 are ranked, but there are more than 25 in the honorable-mention category and there's no mention of The King's Speech. At all.",
            "review_date": "2021-05-03",
            "source": "rt"
        },
        {
            "content": "What a performance by Colin Firth in this wonderful film and there is a moment in the second act where firth is instructed to just cuss and how come he doesn't stutter when cussing and he just lets a bar-age of cuss words out and you feel for his character in that moment but at the end when he delivers that speech you feel not only did his character overcome such a heart wrenching moment but you feel it with his expression and that big sigh its a must watch",
            "review_date": "2021-04-27",
            "source": "rt"
        },
        {
            "content": "''Golly gosh'', doesn't she Queen Mother look like her daughter Princess Margaret. Its a film that's just like an early episode of the Crown which could be it's sequel.",
            "review_date": "2021-04-05",
            "source": "rt"
        },
        {
            "content": "The premise is simple: Prince Albert (Colin Firth) has a speech impediment and his wife Elizabeth (Helena Bonham Carter) hires speech therapist Lionel Logue (Geoffrey Rush) to provide the future king with therapy to remedy the issue.  Despite dragging a bit in the early stages, Tom Hooper's The King's Speech is an engaging period piece, filled with subtle humor and plenty of dramatic tension.  Hooper's direction is excellent throughout with beautifully framed shots and nicely choreographed steadicam sequences.  If that's not enough, the performances from Firth, Bonham Carter, and Rush are all top notch.",
            "review_date": "2021-03-30",
            "source": "rt"
        },
        {
            "content": "We can say that the film overall is very positive.\nIt presents strong themes such as friendship and self-confidence, to make us\nunderstand that even a character of this magnitude can have common\nproblems and that the only way to deal with them is to be helped by friends\nand family, to mature a new self-awareness.\nAwareness that leads Albert to be a king loved and especially esteemed by\nhis people, that, as we see at the end of the radio speech, welcomes him\ntriumphant outside the gates of Buckingham Palace.",
            "review_date": "2021-03-11",
            "source": "rt"
        },
        {
            "content": "No matter your take on the royal family, Tom Hooper's drama about the first poignant speech launching WW II is entertaining and insightful. Colin Firth and Geoffrey Rush are fantastic in their roles and their chemistry is palpable. Great funny moments pepper what could be a dry boring telling, but it's everything but dull. What comes out is a great story perfectly executed.",
            "review_date": "2021-03-08",
            "source": "rt"
        },
        {
            "content": "This movie never gets old, it's one of the greats with never a dull moment.",
            "review_date": "2021-02-10",
            "source": "rt"
        },
        {
            "content": "It's definitely not a film that is going to have you on the edge of your seat, but it is still a must watch. The greatness of Kings Speech really hangs on Firth's ability to get the audience to believe just how difficult and daunting the simple task of speaking is for him and the effects that can have on one's mental state.",
            "review_date": "2021-02-01",
            "source": "rt"
        },
        {
            "content": "Overall, The King's Speech is a tremendous film about the importance of friendship and being there for anyone. The performances from all involved are outstanding, as you'd expect, but for me Geoffrey Rush as Lionel Logue was my personal favourite. The wit and humour he brought to a serious narrative was different and it was great to watch. The writing also was superb and no surprises that it won Best Original Screenplay for the oscars that respective year. There really aren't any faults with this film, it's certainly one everyone should see. A great film, go treat yourself!\n\nQuote -\"I'm sorry Mrs Johnson, my game, my turf, my rules\" - Lionel\n\nRating - 5/5",
            "review_date": "2021-01-29",
            "source": "rt"
        },
        {
            "content": "The King's Speech is not a bad film, it just feels like it has little of an identity or reason for existing. I don't think the premise is very interesting, the execution could've been better, and the characters, while decently written, are pretty forgettable after awhile.",
            "review_date": "2021-01-19",
            "source": "rt"
        },
        {
            "content": "The film is made with great respect to Royalty. It shows brilliantly the story of a king George VIII. What a sensitive and complicated person he was, but also a very positive one. I feel great admiration for this historical personage. Both main actors are brilliant. No one minute of this film is boring. This film is wonderful example how to make a great movie from one episode of a person's life.",
            "review_date": "2021-01-17",
            "source": "rt"
        },
        {
            "content": "0.61 laughs/min. A masterclass in acting, on top of a well written story of overcoming limitations. The cherry on top is a relatively irreverent portrayal of church and crown.",
            "review_date": "2020-12-31",
            "source": "rt"
        },
        {
            "content": "To make such a production work out as good as it should, only the finest actors are required, and there is perhaps no one better than Geoffrey Rush. With all due respect for lead role holder Colin Firth and Helena Bonham Carter, who both are brilliant and highly credible as King George VI and his Queen Elizabeth, as well as Guy Pearce portraying the abdicating King Edward - but Rush is always outstanding, and in the role as self taught speech defects therapist Lionel Logue, he ones more is able to surpass himself, but again without outshining the other actors, somehow. Never mind that some of the other historical characters, such as Churchill and Archbishop Lang may seem a bit parodic, the basic plot is superbly played out, where the persons are real flesh and blood, despite all the distant etiquette, pomp and splendor or that it's a film about royals and aristocracy. That is also what this story is all about, the true human aspect. It's also rare just to forget the acting and get truly drawn into the play. The whimsical but still serious, and for screenplay about royals, out of the ordinary humoristic wrapping this tale gets brought out in, is simply a joy to watch. Just about everything is top notch and British film making doesn't get much better than this.",
            "review_date": "2020-12-21",
            "source": "rt"
        },
        {
            "content": "ok... im sorry... but this movie is wayyyy overrated. It was so slow. I'm not sure if the plot is movie worthy. It may be inspiring but just didn't seem to have an interesting premise. I don't believe it should've won best picture. I found it boring.",
            "review_date": "2020-12-10",
            "source": "rt"
        },
        {
            "content": "Heartbreaking, humorous, and inspirational, the film succeeds over the true story trappings with its audio/visual mastery, unique direction, and great performances by Firth and Rush.",
            "review_date": "2020-11-18",
            "source": "rt"
        },
        {
            "content": "This is a truly great film. Perfect in every way. This is why we watch movies. Colin Firth is amazing in this role.",
            "review_date": "2020-10-11",
            "source": "rt"
        },
        {
            "content": "Una maravillosa película sobre la superación de un problema de toda la vida con muy buenas interpretaciones por parte de Colin Firth y Geoffrey Rush, es algo irreal y a veces puede que la película puede dar mas de si, pero eso no le quita que sea una espectacular película, aparte con muy buenos diálogos y con un gran diseño",
            "review_date": "2020-10-08",
            "source": "rt"
        },
        {
            "content": "Great story, with excellent performances",
            "review_date": "2020-09-23",
            "source": "rt"
        },
        {
            "content": "A perfect example of old and modern filmmaking mixture. A smooth story with tons of emotion.",
            "review_date": "2020-07-28",
            "source": "rt"
        },
        {
            "content": "The King's Speech follows Prince Albert (Colin Firth) who has a terrible stammer and sees an Australian therapist Lionel Logue (Geoffrey Rush). The two men become best friends and, after Edward VIII's (Guy Pearce) abdication, the new king needs Lionel to help prepare for his famous WWII speech. What I especially love about the movie is that it focuses more on the bond between the two and how they work off each other during their lessons. In fact, during acting class in college, I incorporated some of Lionel's techniques in preparation for reciting lines or getting in character. As for the production design, instead of shooting in a replicated sound stage like so many period dramas, they use constricted Victorian Pullens rooms in Southwark. Aside from invoking the rustic Anglo-Saxon authenticity, it matches Bertie's struggles and insecurities. However, during the radio speech, King George VI becomes more comfortable showing his voice, so the sets are more spacious and less claustrophobic. On top of that, combining the tight and broad rooms together really adds to the friendship between Bertie and Lionel. When they first meet, the teal walls are constrictive, but by the end it's much wider. So, The King's Speech is as much about the main character overcoming his disability as much as the friendship of the King and his tutor. \n\n(4 ½ Penguins out of 5)",
            "review_date": "2020-07-23",
            "source": "rt"
        },
        {
            "content": "The King’s Speech Pros: Good Acting (for the most part) Fine Directing Solid Writing Fantastic Directing Great Editing Superb Set and Costume Design Well-Paced enough Modest Storytelling and explorations of its themes surrounding fear and letting go of the past for the greater good Phenomenal Musical Score Cons: Some of Colin Firth’s acting can feel repetitive at times The story could’ve benefited from having a bit more of an emotional punch to it and slightly less predictability Overall Grade: A- (9/10)",
            "review_date": "2020-07-06",
            "source": "rt"
        },
        {
            "content": "A fantastic movie with great performances from Geoffrey Rush and Colin Firth. Their relationships is what holds the film together. Helena Bonham Carter also deserves praise in a subtle but effective role as the Kings wife. Rush is funny and very clever in his role to help the King. With many witty comments including discussing the problems with smoking. Firth has the emotion and frustration with struggling to speak. He does not fully embrace Rush's ways but fully acknowledges them as an important speech is needed for the war. Watching Firth struggle during the speech means we feel for him and long for him to be able to improve during the film. The film ends as we expect but it still packs a punch. Its beautiful directed and the script is well written. Its funny, dramatic and we feel the pain and how speaking makes you feel alone and very vulnerable. We have the abdication of his brother which puts so much pressure when you are not expected to be king. The film deservedly won many Oscars, Rush i consider unlucky not to win the best supporting Oscar. Its a sad and intelligent movie about an important part of British history,  it is an uplifting movie with one of the best acted films in recent memory with music beautiful playing through the era.",
            "review_date": "2020-06-30",
            "source": "rt"
        },
        {
            "content": "Powerful true story, impeccably acted. A must see for history fanatics, and those who like heartfelt true stories about overcoming adversity.",
            "review_date": "2020-06-15",
            "source": "rt"
        },
        {
            "content": "I have always loved Colin Firth as an actor. In this movie he has outdone himself. A beautiful periodic piece that reminds us of human follies and the strength it takes to learn and move past our own doubts and shadows.",
            "review_date": "2020-06-14",
            "source": "rt"
        },
        {
            "content": "Great lead performances by Firth, Rush, and Carter.",
            "review_date": "2020-05-30",
            "source": "rt"
        },
        {
            "content": "Story/Screenplay: (3.5/5) A true story that is more or less accurate as it pertains to the subject of the story, the King's speech.  Flows easily and maintains interest.\n\nDuration/Tempo: (3.5/5) At 1 hour and 58 minutes, it's a long movie that felt shorter.  Well directed and edited.\n\nCast & Crew: (4.5/5) Colin Firth, Helena Bonham Carter, and Geoffrey Rush were excellent.  The rest of the cast was solid.\n\nSummary: (3.5/5) The cast was excellent, the story was good, and the film didn't feel long.  A thumbs up.",
            "review_date": "2020-05-21",
            "source": "rt"
        },
        {
            "content": "I just love everything about this movie. I came in expecting it to be slow, building up only to the climax of the king's final speech (that is the movie title, after all). But I was pleasantly surprised to find the web of growth and falls of his speech impediment, the complex family relationships, the struggles of the Duke becoming a King and his fluctuating relationship with his speech therapist. All the acting in this movie is outstanding, especially from Colin Firth himself. The cinematography is also subtle, mainly showing Colin in unusual camera angles and framing until the confident, classically framed shot of him at the end to represent his growth. This was a powerful though subtle use of cinematography. Something that goes unnoticed in the film until an almost shocking turnaround in the end. Well done in all ways.",
            "review_date": "2020-05-18",
            "source": "rt"
        },
        {
            "content": "The King's Speech is a deeply moving film. My father was a boy in WWII London, and throughout the film I thought of how his life was so impacted by that time. The scenes are masterful; beautifully shot. This was a time of great sorrow woven through with threads of strength, hope and courage, all skillfully captured in this timeless film. I cannot count the number of times that I have watched it, and each time I am touched again by its treatment of the story and the history.",
            "review_date": "2020-05-10",
            "source": "rt"
        },
        {
            "content": "A \"period piece\" that tells the \"true story\" of how \"King\" George VI's ascension to the throne and overcoming his speech \"impediment\", motivated by a \"strong sense of duty towards his country\", with the help of his \"considerate and loving wife\" and his \"peculiar\" speech therapist. A pure Oscar-bait film! With a huge ensemble cast (who all gave impeccable performances, particularly Colin Firth, Geoffrey Rush and Helena Bonham Carter), a predictable story of highs and lows that's impossible not to know how it ends, and Steadicam shots and fluid camerawork, it's quite clear that Hooper, Seidler and the entire crew embraced this unequivocal fact to the fullest.\n\nThe film barely tries to deviate from the formula and the clichés that are linked to its sub-genre, but that's why it, seemingly conversely, doesn't seem to be a commonplace. This film is simple and that's exactly the reason why it worked very well and why it stands out above the rest of Oscar-bait films. Because this simplicity and unpretentiousness are what gave this film its incredibly genuine warm-heartedness and sheer authenticity. Even King Edward VIII, who said he has been busy \"Kinging\", is a fairly credible character, although Guy Pearce's superb performance has a role to play in making it so. But all in all, The King's Speech is an Oscar-bait done properly.\n\n(9/10)",
            "review_date": "2020-05-05",
            "source": "rt"
        },
        {
            "content": "The acting alone deserves all the awards in the world, it blew my mind away. Colin Fith is the icing on the cake, he is so good in every scene. How I wish hollywood could still be making movies like this these days, atleast once in a while.",
            "review_date": "2020-04-28",
            "source": "rt"
        },
        {
            "content": "I don't know a single person who wasn't given this 5 stars.",
            "review_date": "2020-04-21",
            "source": "rt"
        },
        {
            "content": "I've never been into the royal family's business, yet I think this film showed everybody the pressures of running a country at the brink of war in a very entertaining way.",
            "review_date": "2020-04-19",
            "source": "rt"
        },
        {
            "content": "really loved the film! A great example of a touching relationship, and real-life hardships that are rarely discussed. I definitely would recommend.",
            "review_date": "2020-04-17",
            "source": "rt"
        },
        {
            "content": "Masterfully directed and excellently acted, The King's Speech is an entertaining and moving film.",
            "review_date": "2020-04-14",
            "source": "rt"
        },
        {
            "content": "A fantastic cast, solid acting, some good humour, and the cinematography and soundtrack were pleasant. I don't know the details of the real events but it sounded and looked realistic. It's sad at times but there's a happy ending. This film is definitely worth a watch if you have respect for the genre. It's not an action film so of course some people will find it boring.",
            "review_date": "2020-04-12",
            "source": "rt"
        },
        {
            "content": "Mesmerizing.  Masterful screenplay, performances, awesome cinematography.  Rush was flawless.  Firth demonstrated how he is far far more than merely the beautiful Mr. Darcy.",
            "review_date": "2020-04-12",
            "source": "rt"
        },
        {
            "content": "Boring, inconsequential, why-ever-bother-to-make-a-movie-out-of-nothing pretentiousness. An absolute waste of time, oh wait - same director who did 'Cats' (makes more sense to me now).",
            "review_date": "2020-03-06",
            "source": "rt"
        },
        {
            "content": "Although dragging on at times, Tom Cooper's historical drama manages to be thoughtful and interesting with some truly fitting themes and a truly sensational lead performance from Colin Firth.",
            "review_date": "2020-03-05",
            "source": "rt"
        },
        {
            "content": "This film isn't for everyone.\n\nThe King's Speech is about a reluctant king overcoming his speech impediment to help his country gain the courage to fight Nazi Germany.\n\nThe King's Speech is a story behind an epic moment in time. Look closely and you will see that it's in the same spirit of those too-wild-to-be-true-but-still-true films like Wolf of Wall Street or War Dogs.\n\nSet pieces are true to its era and the musical score blends in with the scenes.\n\nIt will be a bit slow in some parts. It could be a borefest for those seeking action.\n\nBut it's damn enjoyable and motivating. More motivating than those quotepics shared by my friends on Facebook.\n\n5/5. You may have to be a bit of an Anglophile to enjoy this movie.",
            "review_date": "2020-03-05",
            "source": "rt"
        },
        {
            "content": "\"I-da-Aye-I, Luh- lik-liked, theesesis-this, moo-moovuh-movie\" - Colin Firth",
            "review_date": "2020-03-03",
            "source": "rt"
        },
        {
            "content": "The cinematography was nice.",
            "review_date": "2020-03-01",
            "source": "rt"
        },
        {
            "content": "Lead by a powerful and remarkable performance of Colin Firth, ‘The king's speech' is full of wonderful atmospheres with such of great talent behind.",
            "review_date": "2020-02-16",
            "source": "rt"
        },
        {
            "content": "Colin firth is just amazing 💙💙",
            "review_date": "2020-02-07",
            "source": "rt"
        },
        {
            "content": "Firth once again shows us what a good actor he is. This film conveys a simple story of a man who was unlucky enough to be born to a great family, but also suffer from a terrible speech impediment. When you're the King, you kinda do need to speak every now and again. To stir up good spirits. Especally when your country is on the brink of war. How does Bertie get over this great hurdle. He hires a unconventional speech therapist. Lionel. Bertie, as King George VI, would go on to be the figure head for the British Empire through the deadliest war the world had ever seen. Well deserved best picture winner and best actor at the Academy awards. Very Fresh indeed. \n\nLionel Logue: You still stammered on the 'W'.\nKing George VI: Well I had to throw in a few so they knew it was me.",
            "review_date": "2020-02-04",
            "source": "rt"
        },
        {
            "content": "A discreet, aesthetically polished film with amazing acting and great camera work.",
            "review_date": "2020-01-31",
            "source": "rt"
        },
        {
            "content": "Loved Colin Firth in this movie, it's a must to see",
            "review_date": "2020-01-12",
            "source": "rt"
        },
        {
            "content": "A neat script and great performances has The King's Speech be a fine drama",
            "review_date": "2020-01-12",
            "source": "rt"
        },
        {
            "content": "One of the best drama movies of this decade. Extraordinary performances, casting, acting and story. The relationship between characters is the thing that makes this movie so great. Must see.",
            "review_date": "2020-01-11",
            "source": "rt"
        },
        {
            "content": "Left me feeling proud like a dead father watching his son overcome such huge obstacles from the comfort of a floating cloud in the heavens.",
            "review_date": "2020-01-08",
            "source": "rt"
        },
        {
            "content": "Review:\n‘The King's Speech' is a historical-drama film directed by Tom Hooper.\nI first watched this movie in English class when I was in high school. I guess my tastes in movies changed because I remember this being a long and boring movie. While it is a slow burn, the story being told is intriguing enough to keep you invested.\nColin Firth plays the future King George VI who, to cope with a stammer, sees Lionel Logue (Geoffrey Rush), an Australian speech and language therapist. The men become friends as they work together, and after his brother (Guy Pearce) abdicates the throne, the new king relies on Logue to help him make his first wartime radio broadcast on Britain's declaration of war on Germany in 1939.\nEveryone in this movie was on point, but the two leads truly shined and make this movie shine bright. Geoffrey Rush is one of those actors who isn't in a lot on American made films and gets lost in the balance of great actors working today. He was brilliant in this movie. He felt like a man trying to make a living for his family, then an opportunity of a lifetime comes up and he snatches it. Colin Firth does a good job as well. I wasn't held up on the stammering one bit, I thought I was actually watching a man struggling to speech.\nThis is a powerful, funny and deeply moving story, told against the backdrop of a critical juncture in modern history, of the emergence of a deep friendship out of a professional relationship between two men who would otherwise never have socially interacted. It does get a little slow at times and I checked to see how much longer the runtime has until its over. Though the story that's being told is intriguing.\nOverall, the movie is stalked to the brim with great performances. It has a great script and a compelling story to keep you invested even in the slow moments.\n4/5",
            "review_date": "2020-01-02",
            "source": "rt"
        },
        {
            "content": "50%... The Social Network still should've won the Best Picture Academy Award of the 2010 films.",
            "review_date": "2019-11-18",
            "source": "rt"
        },
        {
            "content": "this film has a very strange plot because it seems uninspired and obvious, even ugly, but it's just an impression because from the beginning you see how this film is actually very deep, funny and inspired. it is generally recited very well and the feelings of the people shine a lot. In general it's a beautiful film about a theme where it was hard to invent something not boring",
            "review_date": "2019-11-18",
            "source": "rt"
        },
        {
            "content": "4.5/5.  Excellent acting all around and really unusual and interesting cinematography.",
            "review_date": "2019-11-12",
            "source": "rt"
        },
        {
            "content": "A very good film. Colin Firth and Helena Bonham Carter do very well, but Geoffrey Rush steals the show with an excellent performance.",
            "review_date": "2019-10-01",
            "source": "rt"
        },
        {
            "content": "I thought it was awesome!",
            "review_date": "2019-09-24",
            "source": "rt"
        },
        {
            "content": "Beautifully made and perfectly acted. ",
            "review_date": "2019-09-11",
            "source": "rt"
        },
        {
            "content": "So well acted. You just ached for him to stop stammering. What a great story of perseverance. ",
            "review_date": "2019-09-03",
            "source": "rt"
        },
        {
            "content": "The King's Speech successfully turns one of the most boring subjects one could think of into an incredibly entertaining experience.",
            "review_date": "2019-08-30",
            "source": "rt"
        },
        {
            "content": "Excellent. Firth's vulnerability and agony when speaking is fantastic. Yeah I expected they overdid some things for dramatic purposes. But on its own still a great watch.",
            "review_date": "2019-08-20",
            "source": "rt"
        },
        {
            "content": "I just saw this movie. Very inspirational movie for those who want to speak fluently in public without stuttering.",
            "review_date": "2019-07-18",
            "source": "rt"
        },
        {
            "content": "How does Tom Hooper follow The Damned United? With the King's Speech.",
            "review_date": "2019-07-11",
            "source": "rt"
        },
        {
            "content": "Fantastic movie. Awesome cinematography and a touching story of a friendship that transcends class barriers.   ",
            "review_date": "2019-06-01",
            "source": "rt"
        },
        {
            "content": "Just perfect. A true inspiration to everyone struggling in life",
            "review_date": "2019-05-28",
            "source": "rt"
        },
        {
            "content": "This is one of the biggest products of the Weinstein era of the Academy Awards and marks a turning point in director Tom Hooper's career from interesting director with a focus on unique stories to suffocating â~tasteful' prestige pictures. It is because of the fact that it won Best Picture against the far superior The Social Network (2010) that I truly resent it but as a film it feels like a television production and not something that should have received a wide release in cinemas. Coming into the film I also brought my hatred of the monarchy, particularly the British, which caused me to struggle in my attempts to sympathize for the entitled, self-important hero. I really, really didn't like this film and although it was more watchable than the 4 hours long Dances with Wolves (1990) which I also watched today I may enjoy that film more.\n\nPrince Albert, Colin Firth, who will go on to become King George V, suffers from stammering which he will have to cure as the Royal family takes more of a public role in the lives of the â~commoners'. His supportive wife Elizabeth, Helena Bonham Carter, enlists Australian speech therapist Lionel Logue, Geoffrey Rush, to treat her husband but his unorthodox methods and frank conversational skills put him at odds with \"Bertie.\" When Albert's brother King Edward VIII, Guy Pearce, abdicates from the throne in order to marry Wallis Simpson, Eve Best, who is portrayed as villainous figure here, he must ascend to the position himself. Logue and Bertie become friends as they work to remove his speech impediment and keep the British people happy.\n\nPossibly the most interesting part of the film, to me, was Logue's interest in acting. We see him attend an audition at which he is looked down upon by the theatre members but he valiantly defends his dramatic background even as the disappointment is evident in his eyes. We also see him reenact scenes from various plays to his sons and we understand that these activities bring them all enjoyment. Obviously actors are not doing the most important job in the world but the rejection that they face as they are required to put themselves out there for their job is relatable to all. As a New Zealander the relative condemnation he faces from British nationals who believe themselves to be superior, they are most definitely not, also struck a chord with me. I wanted more focus on this sort of story in the film as seeing people who truly love what they do not give up despite considerable obstacles is wonderful and the few scenes that focus on this were more exciting than anything else in the film.\n\nThe treatment of royalty, as in The Queen (2006), made my blood boil as their haughtiness and poor treatment of those around them despite not being anything special is seen as entertaining and right by the screenwriters. Talk of etiquette and disrespect is peppered throughout as Edward and Wallis, supposedly a prostitute and philanderer according to this film, are seen as traitors to the family. Although the real life figures were truly awful, Nazism is unforgivable, it was not their love or her being divorced that they should be condemned for. All of the obsessing over this sort of thing probably would have had royalists going wild but it left me irked. \n\nThe biggest issue with the film was that I never cared about the main character. He was unsympathetic and dull and Firth's performance did not grab me as it should have for all the acclaim it received. The entire central conceit of the film felt rather silly to me, especially when the film took itself so seriously, to the point that I laughed at moments that were meant to contain dramatic tension. If you can't muster up any real care for the human being that is meant to be the central character of the film then it is not a worthwhile venture.\n\nThis is a film that will suit the Masterpiece Theatre crowd but it is inarguable that The Social Network is a better film and concerns a far more timely figure. This is not worth watching, see The Crown television series instead, because it focuses on the wrong person.",
            "review_date": "2019-05-12",
            "source": "rt"
        },
        {
            "content": "Effortlessly charming and heartwarming. The solid performances by the cast help make a delightful movie.",
            "review_date": "2019-05-10",
            "source": "rt"
        },
        {
            "content": "This movie was a very lovely story of King George VI and Lionel Lough; In the first speech of the movie, you could see the diminishing effect of a speech impediment coming from someone in a role that demands powerful communication skills, the king. Its becomes very easy to fell a connection to His Majesty as the camera focuses on the looks of his querying citizens. The eyes rolling away, the exhausted look in their eyes of having to dredge through his stammering. Seeing the overwhelming support he received from his family, his servants, and his faithful speech therapist are soothing to experience. Linking the audience's insecurities with his own was the king's habit to lash out, yell, curse, and haste objections to anyone's support. No matter how many times he refused to come back or reject his service, the ever-graceful Geoffrey Bush awaited his return patiently. This type of loving support for another to fix an issue that drills down into one's very confidence like a poisoned thorn is one of the biggest points I've cherished from The King's Speech.",
            "review_date": "2019-04-18",
            "source": "rt"
        },
        {
            "content": "A very inspiring story and funny movie",
            "review_date": "2019-03-27",
            "source": "rt"
        },
        {
            "content": "Veramente bello. Istruttivo e esemplare. Voto: 9",
            "review_date": "2019-03-15",
            "source": "rt"
        },
        {
            "content": "my review of this masterpiece on my youtube channel \"Cinematic show - Haya Mustafa\"",
            "review_date": "2019-02-27",
            "source": "rt"
        },
        {
            "content": "Marvelous Oscar worthy performance by Colin Firth ... though you kind of know exactly what will happen (as it is partly based on history), the movie keeps you on the edge with the playful yet sharp dialogue between the actors and the impending wish that the king will get his voice for this next major speech!",
            "review_date": "2019-02-19",
            "source": "rt"
        },
        {
            "content": "The most overrated film of all time. Anyone with any knowledge of the upper and upper middle classes or history of the time won't like it.",
            "review_date": "2019-02-07",
            "source": "rt"
        },
        {
            "content": "An endearing look at the struggles of a monarch.\n\nTom Hooper's historical drama The King's Speech (2010) is a fantastic perspective on the real life verbal melees that King George VI suffered with his whole life as he attempts to overcome his speech impediment stammer. Hooper's direction is a gorgeous recreation of wartime Britain from the death of King George V to King George VI. Hooper's style is sleek and fluid, quickly moving from scene to scene to keep you on edge to feel the pressure that the royals were in during the changeover of kings.\n\nColin Firth is marvelous as the frustrated and distressed monarch King George VI. Firth lends the king a sympathetic persona as you care if this man will rise to the challenge of leading his country into war with Adolf Hitler and Germany through his war speech announcement. The conflict may seem trivial at first, but the fate and morale of England was at stake on his majesty's oratory skills. Firth portrays King George VI as a capable man that lacked the confidence to say what he wanted. Through Firth's remarkable performance we sympathize with a man at odd's with his responsibilities and newfound status. I found Firth's acting gave King George VI a humanistic relatable air in his display of a palpable fury at his own inability to speak clearly. Colin Firth is simply moving in The King's Speech.\n\nSimilarly, Geoffrey Rush is hilarious as the king's Australian speech therapist. His patience, kindness, humor, and understanding give the audience an empathetic viewpoint into the trials of nervousness the monarchy underwent during World War II. Rush is so funny, likable, and endearing that you are with him the whole way through The King's Speech. He is a triumphant portal of sensitivity in the film, who you feel an affinity for always.\n\nLikewise, Helena Bonham Carter is excellent as Elizabeth the Queen Mother. Her caring attitude for her husband's speech impediment is commendable. You like her fiery language and spirited remarks as well as her thoughtful support of King George VI.\n\nOn the other hand, Guy Pearce is loathsome as King Edward VIII. His cruel remarks, bullying, and ignorance towards his brother's feelings comes across as genuinely callous. Pearce knows how to play selfish and repellent when he wants. Pearce captures King Edward VIII's complete disregard for tradition, responsibility, and empathy with a distant aloof presence that is affectionate for his mistress. Pearce is truly one of the greatest actors of his generation.\n\nLastly, Alexandre Desplat's score is a rising symphony of influence and spirit. He rises to the challenge of recalling the past, but brings it to life with swelling strings and soft tones. The score to The King's Speech is classy and sweet all the way through. Desplat's score is particularly effective in creating a sweeping majesty during the entire final speech from King George VI. Desplat is a composer to listen out for in all his future projects.\n\nIn conclusion, The King's Speech is a gripping drama recreating the painful discomfort of King George VI engages you through all the scandal and intrigue.",
            "review_date": "2019-02-06",
            "source": "rt"
        },
        {
            "content": "absolutely brilliant film",
            "review_date": "2019-01-20",
            "source": "rt"
        },
        {
            "content": "Meh, underwhelming. I found it boring.",
            "review_date": "2018-12-16",
            "source": "rt"
        },
        {
            "content": "Hooper's melodrama between the teacher and student is the real on screen romance that we have encountered in years.\n\nThe King's Speech\n\nHooper's melodrama between the teacher and student is the real on screen romance that we have encountered in years. Hooper's wit is on fabricating a conversation compelling enough to be determined as an argument. And it cannot be best described other than a debate. A debate that keeps you on the edge of the seat with inspiring performance, direction, writing and choreography. Yes, choreography. Each sequence is a dance number between these high calibered cast. The camera work is persistently moving along with these characters that creates a ferocious environment within a conversation which a car chase normally does. Seidler's characters are welcomed with open arms by Hooper. His execution is much more impressive than the script itself.\n\nCreating such an intense sequence among such fragile equations that discovering the reality and realizing the intentions that we have been aware of all along, itself gives you the chills. The exhilaration and fear of facing your ghosts residing within you on such a larger scale is a testament to the stakes depicted in here and to project it on the screen is purely a work of a performer and no one else. And Hooper has his ace of hearts up front from the first frame. Firth's devotion and work towards the character stays up till the camera is about to roll and after that just as his character, he sings with flamboyancy.\n\nFirth makes the speech his definition, he prepares on and off screen for it that marks his talent like never before. Rush and Bonham Carter as his supporting cast are splendid on their portrayal of the boost that everyone aspires to have especially at such delicate times. The King's Speech is every bit of Hooper's speech as it is Firth's, merging both of their career's best work, it manages to star royal and elegant.",
            "review_date": "2018-12-04",
            "source": "rt"
        },
        {
            "content": "A beautifully shot masterpiece.",
            "review_date": "2018-11-26",
            "source": "rt"
        },
        {
            "content": "Filmone, commovente ed emozionante dall'inizio alla fine con un Colin Firth che raggiunge vette altissime, fa piangere ma anche ridere, Oscar più che meritato. La regia di Hooper è elegante, equilibrata, regale, mai movimenti di macchina bruschi o veloci, sempre perfetta. Geoffrey Rush è stato bravissimo, così come Helena Bonham Carter. La colonna sonora e la fotografia grandiose, ma la scena è tutta di Firth che è stato magnifico, monumentale, quasi incommentabile, portando sullo schermo un principe (e poi re) fragile e insicuro, che ha paura ma grazie all'amore della moglie e delle figlie e al suo amico Lionel riesce a superare i suoi problemi; bravissimo anche Luca Biagini, il doppiatore di Colin. Ripeto, filmone, bellissimo.",
            "review_date": "2018-11-14",
            "source": "rt"
        },
        {
            "content": "In the film that never got the credit it deserved, and Colin Firth's absolute best performance, King George VI of England battles speech impediment with the help of the stubborn but understanding speech therapist Lionel Logue. In perfect symbiosis, Colin Firth and Geoffrey Rush manage to tell the eye watering story of how life is affected by the little things. One of the best movies I have ever seen.",
            "review_date": "2018-10-29",
            "source": "rt"
        },
        {
            "content": "I don't know why lots of people really complain about this is an R-rated movie or whatever just because Prince Albert uses a lot of swearing in his exercising but there is a reasonable context why he did it. Such a problem aren't a serious while \"The King's Speech\" is a masterfully-crafted so powerful and inspiring movie. The setting of the director told and shot shows more of a thick British history, Colin Firth as a major character who always take us feel sympathies as well as other actors with actresses, and closes with such a magnificent speech. This is like a type of movie, both of pace and content are all very interesting. Not too monotonous even with a simple premise but able to executed brilliantly and a very inspiring film to be used as a reference. This is like a movie that makes you try some of the ways in this film, whether it's for those of you who're stuttering or nervous, it's a movie that has two opposite things.",
            "review_date": "2018-10-09",
            "source": "rt"
        },
        {
            "content": "incredible acting by Colin Firth. You are willing him to succeed on the final speech.",
            "review_date": "2018-09-22",
            "source": "rt"
        },
        {
            "content": "This should have been a boring movie with a nothing premise, but with such a power cast and great heart this happened to be a great drama. The performances and chemistry between actors was fantastic. It didn't feel its length and I enjoyed every scene.",
            "review_date": "2018-09-14",
            "source": "rt"
        },
        {
            "content": "A very gripping and enjoyable film to watch. Colin Firth at his finest and backed by an excellent cast.",
            "review_date": "2018-09-01",
            "source": "rt"
        },
        {
            "content": "Ok so I have to say I went into this movie with very high expectations since I watched it after it won the Oscar for best picture. I expected to see the best picture of the year and instead saw Something that now rests somewhere in my five worst films of all time list. The performances are great; Colin Firth most definitely gives a compelling performance and deserves his Oscar but my goodness is the movie awful. For more than two hours I listened to this man stutter and watched him struggle to overcome it so in the end he can give a speec addressing the nation or whatever. It was literally a painful experience and I honest to god tried to enjoy it but find myself truly baffled itï¿ 1/2(TM)s Oscar win",
            "review_date": "2018-08-27",
            "source": "rt"
        },
        {
            "content": "Entertaing look into the world of being a world leader with a speach impediment.",
            "review_date": "2018-08-16",
            "source": "rt"
        },
        {
            "content": "an enjoyable movie featured with a great acting and amazing cinematography , also well directed make this film rewatchable that make our self more care about history",
            "review_date": "2018-08-15",
            "source": "rt"
        },
        {
            "content": "Tom Hooper's direction tries to steal the show from Colin Firth's performance. Thankfully, he fails.",
            "review_date": "2018-07-29",
            "source": "rt"
        },
        {
            "content": "The King's Speech is wonderful in many senses... the direction, the acting, the cinematography, the story (which actually is based off of true events). Colin Firth and Geoffrey Rush both give powerhouse performances here, and their work alone puts this movie above some of its other period-piece drama peers. It's interesting, well-meaning, and a good example of a film that kids won't be interested in until they're at least 12 years old. Don't expect the easily bored to get into it, but if you just want a nice relaxing movie to see, The King's Speech isn't a terrible option. Watch with plenty of dignity.",
            "review_date": "2018-07-19",
            "source": "rt"
        },
        {
            "content": "A brilliant history lesson and one of the best underdog stories. Acting is superb and writing and directing is a masterclass of filmmaking.",
            "review_date": "2018-07-09",
            "source": "rt"
        },
        {
            "content": "I don't get to see movies like this too often. While the pacing was slow in parts, I felt like it was intentional due to the need to have the viewer \"feel\" King George VI's own slow pace. Otherwise, the acting, script, locations and emotion were flawless. The effort made by the recently-defunct UK Film Council to get this picture made and distributed was Herculean.",
            "review_date": "2018-06-18",
            "source": "rt"
        },
        {
            "content": "Rare it is that a script this strong has such high powered acting talent, a modern classic.",
            "review_date": "2018-06-04",
            "source": "rt"
        },
        {
            "content": "This movie was so good that my son and I didn't notice that our dogs sh*t on the floor in front of us, twice. No other movie has captivated our attention so much that we have forgotten to let our dogs out.",
            "review_date": "2018-06-03",
            "source": "rt"
        },
        {
            "content": "Absolutely brilliant. ",
            "review_date": "2018-04-12",
            "source": "rt"
        },
        {
            "content": "well made movie. truly shows character development. how the king overcame his difficulties. it makes you feel it.",
            "review_date": "2018-03-10",
            "source": "rt"
        },
        {
            "content": "This is great!!!\nhttps://xx1.me/movie/the-kings-speech-2010-yxh/play",
            "review_date": "2018-02-19",
            "source": "rt"
        },
        {
            "content": "Fun movie. Terrific period setting, heartwarming story, and a pair of exquisite performances by Rush and Firth.",
            "review_date": "2017-12-31",
            "source": "rt"
        },
        {
            "content": "Puntaje Original: 7.5\n\nUna historia llena de superación y con una poderosa actuación de Colin Firth y Helena Bonham Carter, convierten a The King's Speech un film que toda persona debe ver.",
            "review_date": "2017-12-18",
            "source": "rt"
        },
        {
            "content": "Perhaps one of the best films of the past few years, A moving performance by Firth gets the audience extremely emotionally invested in something somewhat obscure to many audience members including myself.",
            "review_date": "2017-12-17",
            "source": "rt"
        },
        {
            "content": "After watching this movie, I am confused as to why it received so much recognition. I assume some of its accolades must have been for its set design and production design which were indeed impressive, but past that, the story is bland and unsurprising. The entire movie hinges on the singularly interesting scene in which the King must make a speech during WWII under enormous pressure and not let his stuttering obscure his message. While the idea of the juxtaposition of the gravity of England's situation in the war at the time with the sometimes silly mechanisms by which the King produces fluent speech is indeed interesting, the surrounding two hours of film were so much less so. Each narrative turn the film takes is so routine that it actually began to be surprising, with scenes played out to tired beats (the wife of the speech therapist realizes she is in fact entertaining not some commoner's wife but the queen in her very own living room, the queen recognizes her astonishment and responds with a snappy acknowledgement of the humorous misunderstanding, looks are exchanged as a couple plucky string notes in the sound track tell us that this was a funny scene). The single benefit of this film is that it is one of the more realistic portrayals of a person who stutters, and makes it clear it is not because he is simply nervous or unsure of himself. Colin Firth does well in helping the audience feel the ceaseless frustration and humiliation that this condition can cause. So props for that, but this unfortunately was not enough to carry the story. On the bright side if you need something to watch with the extended family whom you are avoiding talking politics with over the holidays, there is nothing at all controversial in this film, or indeed intriguing enough to spark conversation, so this is a safe one.",
            "review_date": "2017-11-26",
            "source": "rt"
        },
        {
            "content": "'The King's Speech' speaks in more ways than just verbally.",
            "review_date": "2017-11-25",
            "source": "rt"
        },
        {
            "content": "While it may seem tailor-made for awards, it nevertheless is a well-made drama with strong performances from Colin Firth and Geoffrey Rush",
            "review_date": "2017-11-23",
            "source": "rt"
        },
        {
            "content": "Wonderfully casted and directed, Tim Hooper's \"The King's Speech\" is a triumphant tale about a fearful King who suffers from speech impediment, but manages to overcome it thanks from the help an failed actor who teaches him how to overcome his self-doubts. Colin Firth shine as the believable, yet humble King George the Sixth while Geoffrey Rush also tries to steal the show as the witty, yet approachable, Lionel Logue. The script was clean and the cinematography was crisp. An astounding achievement made by the filmmakers. A story that will touch and stay in your hearts forever.",
            "review_date": "2017-11-20",
            "source": "rt"
        },
        {
            "content": "The King's Speech is put together by its outstanding performances from Colin Firth and Geoffrey Rush, who deliver career defining work. ",
            "review_date": "2017-11-16",
            "source": "rt"
        },
        {
            "content": "Great movie with a lot of earned OSCARs.",
            "review_date": "2017-11-06",
            "source": "rt"
        },
        {
            "content": "9/10\nThe king's speech is a well acted dialogue-type character study, Colin Firth shines as king George and has a compelling chemistry with Geoffrey rush character is Lionel Logue",
            "review_date": "2017-09-10",
            "source": "rt"
        },
        {
            "content": "The first time I watched this movie I was watching it on my laptop alone, sitting in my room at home. The second time I watched it was with my mom, and the third time I watched it I watched with both of my parents on a proper television screen. You know a movie's special when you keep getting drawn back to it and when the movie keeps getting better with each subsequent viewing. Oddly enough, people can't seem to stop griping that The King's Speech won Best Picture.\n\nIf I have to spell it out, there are five major Academy Awards handed out each year: (1) Best Picture; (2) Best Director; (3) Best Actor; (4) Best Actress; and (5) either Best Original or Adapted Screenplay. The King's Speech won 4 of those awards, which in itself is no easy feat. Almost nobody would complain at The King's Speech having won Best Director, Best Actor, and Best Original Screenplay. Firth's and Rush's performances were sublime, and Helena Bonham Carter was a strong supporting actress. Given that this film arguably deserved to win 3 of the five major Academy Awards hands down, it just makes sense to me that it also deserved to win Best Picture.\n\nWhy all the complaints then? Most critics of this movie will say because The King's Speech is \"Oscar bait,\" but I don't buy that reasoning. Arguably, every good movie is, in some sense, an Oscar bait, as every good director will try to find new ways to make creative shots and build a storyline that will ultimately be successful. By this standard, the movies There Will Be Blood and No Country for Old Men are also Oscar baits, but hardly anyone complains about them. It seems ridiculous to me to criticize a movie because it was done well. At its core, the work of a director is to be a visual storyteller; accolades like the Academy Awards are simply given to those who succeed at it.\n\nI have my own reservations for The King's Speech. First, the scene where Logue and Bertie start swearing almost uncontrollably seems a bit out of place, as if it was inserted into the movie just for comedic purposes. Second, the scenes where Bertie tells Logue about his hard childhood and where Logue's wife walks into the apartment when the royal family is there seem like cliché feel-good moments. Still, these are merely minor detractions from what I consider to be an otherwise strong film. I've always loved the speech scene with Beethoven's music playing in the background (I adore the whole soundtrack), and, for the most part, I also actually like the cinematography. In whole, the storytelling is effective and is supported by a great cast who gave it their all. Hate me for it, but I can see why The King's Speech won Best Picture.",
            "review_date": "2017-08-30",
            "source": "rt"
        },
        {
            "content": "A beautiful score and an interesting story line carried forward this well-acted period piece.",
            "review_date": "2017-08-20",
            "source": "rt"
        },
        {
            "content": "Colin Firth shows how great of an actor he is in his performance as King George VI. The Kings Speech is a truly inspiring film that shows how capable we are of over coming our fears and over coming expectations set by people including ourselves.",
            "review_date": "2017-07-31",
            "source": "rt"
        },
        {
            "content": "Uniquely showing a different side to monarchs, The King's Speech looks behind the outward appearance of George and tackles serious issues plagued throughout his life brilliantly. With an excellent cast, and a brilliant post-production team, The King's Speech is a wonderfully put-together film.",
            "review_date": "2017-07-05",
            "source": "rt"
        },
        {
            "content": "The King's Speech is a good movie, but that's it, it does not exceed the limit of a video, it has its merits, but when you think about the possibilities and even the possibilities of the cinema, \"the Kings\" does not exceed anything .\n\nIt is all done on a very shallow scale, a video made to satisfy and respond to the orders of those who asked or even to follow the course of the 2000s, which generated a line of biblio-cinematographic achievements on the reigns, especially the English royalty.\nEven the performances follow the same rhythm, Colin Firth is fine, but we know of his ability, honestly here, it was not the time to receive his Oscar as best actor.\n\nGeoffrey Rush goes further, which is the great relief of the film, his good character, can follow a rhythm of his own, but nothing more than something great, and we know that Rush is an excellent actor.\n\nPerhaps this strangeness of being only good is justified by the direction of Tom Hooper, who is more accustomed to television accomplishments, which we can check in \"King ...\", not only because it is a closed script in internal locations, with a lighting Very clear and at the same time very artificial, but mainly for punctuating plans and against plans, a simple work almost lazy that the TV uses to simplify to the maximum and make clear what is talked about and with whom one talks, not opening spaces for Reflections and possibilities.\n\nApart from this the scenarios, especially where we have the presence of the character \"Lionel Logue\", is a clear reference of old age and decomposition that conversely give beauty to the film, however, Hopper (specifically close to the characters seated), abuses in wanting to present Such scenarios with cutouts that even work, but that used too much, tiring and only show that they are there like figurative form of a little explored world.",
            "review_date": "2017-06-10",
            "source": "rt"
        },
        {
            "content": "This movie will capture you. A respectful, wonderful performance and film showcasing a great monarch in a hard time.",
            "review_date": "2017-05-31",
            "source": "rt"
        },
        {
            "content": "Great film! Colin Firth gives possibly his greatest performance ever. Geoffrey Rush is also fantastic. This movie has you engaged from the very beginning in a subject matter that could be boring, that speaks to the great directing from Tom Hooper who did a great job with this movie. A well deserved 4 Oscar wins.",
            "review_date": "2017-05-10",
            "source": "rt"
        },
        {
            "content": "been a while since i seen it, could use a rewatch",
            "review_date": "2017-05-05",
            "source": "rt"
        },
        {
            "content": "Colin Firth arguably gives his best performance in his career in this masterfully directed film, loaded with humour and poignancy.",
            "review_date": "2017-04-30",
            "source": "rt"
        },
        {
            "content": "While watching this movie, it keeps me so interested in the progress of the lead, a real heartwarming movie!",
            "review_date": "2017-04-14",
            "source": "rt"
        },
        {
            "content": "Not too bad for a tv movie. Good acting. If this wasn't some sort of important person, not sure there would be any interest in it. It goes well with the lost prince or the forgotten prince, the story of his brother afflicted with epilepsy. Meh, inbreeding. The royals solved that problem in the last two generations.",
            "review_date": "2017-02-09",
            "source": "rt"
        },
        {
            "content": "Not too bad for a tv movie. Good acting. If this wasn't some sort of important person, not sure there would be any interest in it. It goes well with the lost prince or the forgotten prince, the story of his brother afflicted with epilepsy. Meh, inbreeding. The royals solved that problem in the last two generations.",
            "review_date": "2017-02-09",
            "source": "rt"
        },
        {
            "content": "Great film. Can see why this won the oscar. So well made and Colin firth is amazing in it",
            "review_date": "2017-02-07",
            "source": "rt"
        },
        {
            "content": "Had a good plot and storyline to it. Really liked it!",
            "review_date": "2017-02-01",
            "source": "rt"
        },
        {
            "content": "O Discurso do Rei é um filme ótimo. Consegue tratar da gagueira do Rei George VI e ainda deixar espaço para dramas familiares, problemas políticos e a II Guerra Mundial, envolvendo todos os aspectos sociais e políticos da época. A ambientação é perfeita e vívida, dando quase para sufocar com a neblina carvão de Londres. Geoffrey Rush deu um show e conseguiu trazer alegria para essa história de superação carregada de sentimentos fortes. Colin Firth  fez por merecer o seu Oscar de Melhor Ator e Helena Bonham Carter , nossa eterna Bellatrix, atua com o olhar. Com certeza é um filme para admirar.",
            "review_date": "2017-01-20",
            "source": "rt"
        },
        {
            "content": "A story of how one great man took tremendous fear and personal struggles and found the necessary courage to fight evil in the most critical of times.  The true story alone is enough to make it outstanding, but the acting and all the parts that went into making this movie a work of art bring it to an entirely new level.  Absolutely flawless.",
            "review_date": "2017-01-11",
            "source": "rt"
        },
        {
            "content": "Colin Firth guides the film, with the steady direction of Hooper, with an honest and moving dramatization that results in an entertaining drama.\n\nWhether you're grounded on history or not, the on-screen narrative of the Duke of York (Colin Firth) is still attractive to watch because of Firth He takes the role and makes it his own, portraying a debilitating stammer with a sincere tone. As a result, we see a character that's complex and defeated even when he's at his most secured.\n\nWe also see that supporting character Geoffrey Rush, who plays the Kings \nspeech therapist, is a great blend with Firth. When they share the screen together they are effortless, humorous, and unpretentious. They play the student-teacher relationship well, and it's entertaing to watch the dedicated-teacher-and-challenging-student element unfold.",
            "review_date": "2017-01-05",
            "source": "rt"
        },
        {
            "content": "Deserve to see it twice",
            "review_date": "2016-12-31",
            "source": "rt"
        },
        {
            "content": "A great movie. Loved the acting and the plot due to the plot being based on a true story. Very inspirational and worthy of being Best Picture.",
            "review_date": "2016-12-29",
            "source": "rt"
        },
        {
            "content": "Masterpiece. Firth gives an incredible performance.",
            "review_date": "2016-12-28",
            "source": "rt"
        },
        {
            "content": "Colin Firth is breathtaking in this acclaimed motion picture!",
            "review_date": "2016-12-28",
            "source": "rt"
        },
        {
            "content": "An intimate look into Pre World War 2 & The Events transpired. Colin Firths Performance was probably the best he's had yet.",
            "review_date": "2016-12-18",
            "source": "rt"
        },
        {
            "content": "Excellent top notch movie.",
            "review_date": "2016-10-10",
            "source": "rt"
        },
        {
            "content": "Honestamente al principio no me llamÃ³ la atenciÃ³n, la vine a ver muchos aÃ±os mas tarde, y me arrepiento de no haberla visto a penas saliÃ³, es muy buena, las actuaciones son increÃ­bles Colin Firth es espectacular, pero la que mÃ¡s me sorprendiÃ³ fue Helena Bonham Carter, siento que es uno de sus mejores papeles, es entretenida y hasta chistosa.",
            "review_date": "2016-10-01",
            "source": "rt"
        },
        {
            "content": "This film takes it time to give a very satisfying drama based on the true story. Colin Firth does a great job bringing humanity to a character that I thought was difficult to do. The rest of the cast does a great job, Helena Bonham Carter is great as usual, Guy Pierce was a great addition to the cast, but Geoffrey Rush was the anchor of the film for me. The film puts a lot on the line by relying mostly on the actors performances to make the film, and thankfully they all delivered. The film is genuinely moving and sheds light on an issue that is rarely brought up in film, and handles its material with the utmost professionalism",
            "review_date": "2016-09-21",
            "source": "rt"
        },
        {
            "content": "A lot of people have problems and out fright phobias with public speaking. Now imagine you are the leader of an entire country on the verge of war and not only do you have a fear of public speaking, but a stutter that makes it that much worse!\n\nThat's the problem facing our main character in this movie. He's made King of England after his brother is no longer allowed to be King. It really does a good job of showing the fear of not only making yourself look like a fool, but embarrassing and entire nation. A nation that looks to you for inspiration.\n\nParts do tend to drag though, and it feels a bit repetitive at times. It's not without flaws, and not really deserved of the Oscars it won, considering there were other more deserving films that season, yet it still makes for an inspirational watch and is sure lift a lot of people's spirits by the end.",
            "review_date": "2016-09-19",
            "source": "rt"
        },
        {
            "content": "Fantastic performances lead this seemingly small story.  Really make it a compelling affair.",
            "review_date": "2016-09-15",
            "source": "rt"
        },
        {
            "content": "Even though the time shift's are confusing it's impossible not to be absorbed by this well acted and well written piece. As for it being predictable , it's fucking history!",
            "review_date": "2016-09-11",
            "source": "rt"
        },
        {
            "content": "Best Movie That i Seen in along time",
            "review_date": "2016-09-05",
            "source": "rt"
        },
        {
            "content": "The King's Speech: The tale of England's King George VI (the current Queen Elizabeth's father) and his lifelong struggle to conquer a psychologically-debilitating speech impediment. The story drags on at times but the historical glimpse inside the royal family and Colin Firth's solid performance gives the film a needed boost. B",
            "review_date": "2016-08-22",
            "source": "rt"
        },
        {
            "content": "Absolutely astonishing!",
            "review_date": "2016-08-19",
            "source": "rt"
        },
        {
            "content": "The Kings Speech is a master peace which does not only deliver a touching story, but conveys emotion intensely in everything from its cast's impeccable performance to things like its camera angles.",
            "review_date": "2016-08-17",
            "source": "rt"
        },
        {
            "content": "Gripping characters in a gripping time yet generally a relaxed atmosphere that nevertheless keeps it fresh seeing it time after time.",
            "review_date": "2016-08-08",
            "source": "rt"
        },
        {
            "content": "One of my all-time favourites.",
            "review_date": "2016-08-07",
            "source": "rt"
        },
        {
            "content": "To make a movie about a king's speech impediment engaging and entertaining is very difficult to do, but this movie manages to pull it off.  Colin Firth and Geoffrey Rush are Fantastic!",
            "review_date": "2016-07-18",
            "source": "rt"
        },
        {
            "content": "A solid one-time watch.",
            "review_date": "2016-07-17",
            "source": "rt"
        },
        {
            "content": "Perhaps, the most inspirational film of the decade. A thing of beauty!",
            "review_date": "2016-05-07",
            "source": "rt"
        },
        {
            "content": "This movie was great and the actors are fantastic but i am not going to see it again.",
            "review_date": "2016-05-01",
            "source": "rt"
        },
        {
            "content": "On second viewing, I have to lower that rating from 9.  It's good and classy and everything - the climactic scene packs a pretty good wollop - but the relationship with the speech coach, which is a huge part of it, feels pretty contrived and, in any case, is not electrifying enough to warrant a 9.  So we'll go with 8 out of 10",
            "review_date": "2016-04-23",
            "source": "rt"
        },
        {
            "content": "My favorite movie of all time. Colin's performance goes so well with Geoffrey's. Definitely the one I recommend the most.",
            "review_date": "2016-04-10",
            "source": "rt"
        },
        {
            "content": "Captivating story. Not sure what I like about it the most but it's great to see how 'uncurable' shortcomings can be fixed using unorthodox methods. Applies in life quite often, doesn't it?",
            "review_date": "2016-04-04",
            "source": "rt"
        },
        {
            "content": "A solid royal biopic with a fantastic performance from Geoffrey Rush.",
            "review_date": "2016-03-31",
            "source": "rt"
        },
        {
            "content": "Highly recommend seeing this. Brilliant.",
            "review_date": "2016-03-08",
            "source": "rt"
        },
        {
            "content": "Colin Firth is mainly known for cheesy rom-coms but he sets himself apart in this film. The film is easily one of the best biopics of the last decade.",
            "review_date": "2016-03-07",
            "source": "rt"
        },
        {
            "content": "The dialogue throughout is fun and lightweight. It's extremely watchable for a drama, period piece.",
            "review_date": "2016-02-28",
            "source": "rt"
        },
        {
            "content": "This is a great film that is well-acted, beautifully written, and makes such a character as a king relatable by giving him a friend to talk to. Powerful stuff.",
            "review_date": "2016-02-20",
            "source": "rt"
        },
        {
            "content": "Has less to do with the authencity of King George delivery of the speech, but how he got to speak so brilliant. A Time capsule of events of the hardship of a privileged king, whom has to endure not the travesty of politics of what is occurring around the world with war, but the politics of himself as a true King. When the pressure to speak to a country is our duty but has great amounting pressure, when public speaking of such grandeur with such a disability in speaking was not common. When teaching one to speak has great pressure on its own.\nWhen speaking on the grand stage is for the professionals, masters of the theatre, perfornances, prepped to be this way and a future king whom is forced to do it by royal blood to act in that manner. Some stages are larger then others when your speaking in front of a future king. Getting to the root of the problem we need to establish. whether privileges and treatment we wish to have and not have needs to be established. when getting to the root of the problem deep down is difficult when we are too high on our privileges and right to rule the \"common man\" and don't care. When we are a future king to just want a quick fix to a long lasting problem.\nWe are brought up to follow common rituals, practices, and very traditional to accept unorthodox ways. When the essence of professionalism is ridiculed by a dictator. Suitingly, we just think we can just fit in and make adjustments to easily transition and overcome. We are brought up this way, from tradition and privilege to think it's could be the problem. When we didn't appreciate subtly  to think unsubtly would be preffered. When we doubt professionals practices in comparison to hear ourselves when we speak like an idiot to hearing ourselves speak so smartly and brilliant.\nWhen we not a man of our word, all what comes with royalty, to finding a common ground with common man, and being personal and not business at all. Striding away tradition gradually, but not striding away whom is incharge. When the professionals are told what the problem is, to the professionals accepting common authority. When taking things one step at a time, from a less grandeur stage, to unorthodox practices, improving on one minor issue at a time, not only focusing on the particular issue, but the entirety of the person doing so. Enhancing all quality, clarity, preciseness, and improving one's speech altogether. \nWhen we are not even on the grandest stage compared to others to surcome to so much pressure amongst your own family. When trying to merge such uncommon practices with our royal duty, it would not be tolerated, we do what's best for our country by forcing down our throat the responsibilities and instant grandeur we are not prepared for.\nWhen we could care less about the politics to put pressure on someone, or force them to be something they are not ready for, unprofessional to do so. When we lack confidence from such along time, when our family never saw us or considered us confident enough to uphold such great responsibilities, not even our predecessors.  A strict upbring, a bloodline of predecessors, not much to be open with emotion and opinion, but to follow the royal duty. \nWhen we are just brought up to say \"dont\" to bother to get to the root of the problem. Care more about our image, reputation, status, then other things.\nWhen we don't know what it means to be king and fit the role, head of the establishment (God & Country). \nWhen speech is merely an arrangement of words, and requires deep rooted passion for its essence.\nWhen getting to the root to our disability is borderline unlawful, treason, untraditional to cross, it is the fear we rather avoid.\nWhen times were different back then, when we focused more on word of mouth, then what we actually saw really going on. Fear lingered amongst the politicians, fear & pressure was unavoidable. \nFear of disappointment, fear of not amounting to greatness as the past.\nWhen our speech doesn't remove what little scenes we have, we make due with what we remember, what we heard, saw thus far. The gratitude is all much appreciated, \"curtsy\" is only for those commoners. being gratitous for accepting the task to teach the future king is enough, when others are not gratitous for accepting the royal duty during Tumbling Times.\nWhen fear returns, when there is no confidence is from God. we forget what we have learned. The realization of this disability being uncurable, that it's common in royalty to have an ailment known for throughout the ages. We are dualing between our own preferences vs others. Treated less like a king, but a common man with an ailment full filling a royal duty.  A king is a king, when they have a voice, a loud voice, a voice that rules over the people.\nWhen some voices much louder in hatred, we don't understand. When those whom are in charge, responsible for the safety and well being of the people are leaving, the true test of the king is how we recover and overcome. When what we hear is much more important then what we see to send the message to the people, to have confidence in our country in this time of war. \n* Imagine if people saw the king deliver the speech, would they have confidence in their leaders decision making?\nWhen the moment has come to deliver the speech to the people, when leaders are unconfident this speech would be powerful, spoken briliantly, and represent God & Country. Where great victory comes from, we are sure it comes from great leaders. Where great victory comes from, are the small wars that we are victorious in winning. Where great victory comes from, are the people that rally around the one belief that we will endure, prevail, and overcome this darkest moment in our lifetime. We spread the word, from word of mouth, to others that we will be victorious, because our king is victorious, from his speech to our speech. \nWe make their cause our own, we stare at the one thing that gives us strength, as we have always have, more than words and visuals can ever do for us, it lingers in our heart and mind when we march into the battlefield. Whom do we look at when we are in battle, whom do we look at when we are victorious? For the people we rule, for the royal family we pass down too, those responsible for delivering the facteous victory in battle, and those whom help us along the way become a king with a voice. Go send the word, the king has made it loud and clear, we will prevail. \n\n\"In this grave hour, perhaps the most fateful in our history, I send to every household of my peoples, both at home and overseas, this message, spoken with the same depth of feeling for each one of you as if I were able to cross your threshold and speak to you myself.\nFor the second time in the lives of most of us, we are at war.\nOver and over again, we have tried to find a peaceful way out of the differences between ourselves and those who are now our enemies; but it has been in vain.\nWe have been forced into a conflict, for we are called, with our allies, to meet the challenge of a principle which, if it were to prevail, would be fatal to any civilized order in the world.\nIt is a principle which permits a state, in the selfish pursuit of power, to disregard its treaties and its solemn pledges, which sanctions the use of force or threat of force against the sovereignty and independence of other states.\nSuch a principle, stripped of all disguise, is surely the mere primitive doctrine that might is right, and if this principle were established through the world, the freedom of our own country and of the whole British Commonwealth of nations would be in danger.\nBut far more than this, the peoples of the world would be kept in bondage of fear, and all hopes of settled peace and of the security, of justice and liberty, among nations, would be ended.\nThis is the ultimate issue which confronts us.  For the sake of all that we ourselves hold dear, and of the world order and peace, it is unthinkable that we should refuse to meet the challenge.\nIt is to this high purpose that I now call my people at home, and my peoples across the seas, who will make our cause their own.\nI ask them to stand calm and firm and united in this time of trial.\nThe task will be hard.  There may be dark days ahead, and war can no longer be confined to the battlefield, but we can only do the right as we see the right, and reverently commit our cause to God.  If one and all we keep resolutely faithful to it, ready for whatever service or sacrifice it may demand, then with God's help, we shall prevail.\nMay He bless and keep us all.\"-- (The King's Speech of September 3, 1939).",
            "review_date": "2016-02-17",
            "source": "rt"
        },
        {
            "content": "It's the central performances of this film that make it so wonderful. Although the screenplay is great it's emotions are elicited through the characters not the storytelling and is what makes it so compelling.",
            "review_date": "2016-02-17",
            "source": "rt"
        },
        {
            "content": "The stuttering was a distraction for me from the movie, even though I know it was an integral part.",
            "review_date": "2016-02-12",
            "source": "rt"
        },
        {
            "content": "THE BEST FILM OF 2010!\n\nOriginally written on January 31, 2011--\nFollowing the death of his father, King George V (Michael Gambon), and the scandalous abdication of the throne by his older brother, King Edward VIII (Guy Pearce), \"Bertie\" (Colin Firth), who has struggled with a debilitating speech impediment his entire life, suddenly finds himself crowned as King George VI of England! With his country on the brink of war and in desperate need of a strong leader, his wife Elizabeth (Helena Bonham Carter), the future Queen Mother, arranges for her husband to see an eccentric speech therapist, Lionel Logue (Geoffrey Rush). After a rough start, the two delve into an unorthodox course of treatment and eventually form an unbreakable bond. With the support of Logue, his family, his country, and the English Prime Minister, Winston Churchill (Timothy Spall), the King will overcome his stammer and deliver one of the most incredible radio addresses of all time at a crucial moment in history! You will LOVE the story behind the story of this moment! The Best Film of 2010!",
            "review_date": "2016-02-10",
            "source": "rt"
        },
        {
            "content": "Amazing acting and excellent directing!",
            "review_date": "2016-02-10",
            "source": "rt"
        },
        {
            "content": "A true masterwork of modern cinema laced with exceptional acting and a story which makes for a nearly perfect period piece. One of the best films of the 21st Century by far.",
            "review_date": "2016-02-05",
            "source": "rt"
        },
        {
            "content": "The only minus from this movie is Colin Firth doesn't look alike the original George VI.",
            "review_date": "2016-01-31",
            "source": "rt"
        },
        {
            "content": "i hear this is one of colin firth's best movies. very motivational. for whenever you feel like you are in the dumps and need a burst of inspiration",
            "review_date": "2016-01-25",
            "source": "rt"
        },
        {
            "content": "The King's Speech is a strong, and powerful film, with British heavyweight Colin Firth in its core. It's captivating performances, powerful message, great story, and a wonderful conclusion made The King's Speech one of the best films of 2010.",
            "review_date": "2016-01-18",
            "source": "rt"
        },
        {
            "content": "Probably my favorite of the recent crop of Oscar-baiting biographical movies. Great performances, good movie. Surprisingly funny in a lot of parts.",
            "review_date": "2016-01-01",
            "source": "rt"
        },
        {
            "content": "\"Logue: They're idiots.\nKing George VI: They've all been knighted.\nLogue: Makes it official, then.\"",
            "review_date": "2015-12-30",
            "source": "rt"
        },
        {
            "content": "it really pulls you in and Firth is very believable!",
            "review_date": "2015-12-27",
            "source": "rt"
        },
        {
            "content": "Forgettable period drama and acting vehicle for Colin firth.",
            "review_date": "2015-12-20",
            "source": "rt"
        },
        {
            "content": "extremely well acted. a good film, but not great.",
            "review_date": "2015-12-19",
            "source": "rt"
        },
        {
            "content": "Any discussion about The King's Speech has to start and end with the excellent acting performances of Colin Firth and Geoffrey Rush.  They play such endearing characters and I love everything about their performances, and the relationship formed between their characters.  Even the stuttering, which can be a hard thing to add to an acting role without sounding artificial, was well done.  In fact, after watching the film I was compelled to look up audio recordings of the actual speech delivered by Kind George VI, and Firth really nailed it.  I also loved how they accentuated the intimidating nature of the microphone.  In many ways the villain of this movie is that device and how it will make or break George's reign as King, so they were very clever about making this inanimate object look large and even a bit menacing.  I found the movie extraordinarily heartwarming and was almost brought to tears at one point.  I've never had difficulty speaking in front of people, but I can fully appreciate being overcome with feelings of inadequacy and fear.\n\nAt one point I thought this might become a favorite film and I was going to rate it extremely high, but there was something about the climax that left me wanting more.  I realize there's only so much they could do, because they were attempting to be somewhat historically accurate, but I was hoping for some type of cathartic moment where suddenly they were able to address all the root issues and create a dramatic change for the King.  Again, I understand this isn't what really happened, and it probably is not how it ever works when people are dealing with a speech impediment.  Yet for a movie, it needed an added punch to impact me more deeply.  Perhaps if there was some more dramatic scene or montage that showed how his speeches actually impacted his people, that would have given me the extra \"something special\" I was seeking.  But despite my reservations, the movie did warm my heart and it was brilliantly acted.  I would still recommend it to anyone who's interested.",
            "review_date": "2015-11-30",
            "source": "rt"
        },
        {
            "content": "I just saw this and really enjoyed it.  Really great movie.",
            "review_date": "2015-11-19",
            "source": "rt"
        },
        {
            "content": "Very good acting accompanied with some great film making.",
            "review_date": "2015-11-13",
            "source": "rt"
        },
        {
            "content": "This movie should not have won best picture.  It was a good movie with good acting, but not best picture.  Colin firth was great and it is a good story (but come on best picture!). No way.",
            "review_date": "2015-11-09",
            "source": "rt"
        },
        {
            "content": "With an Outstanding performance from Colin Firth and the supporting cast; The King' Speech is wonderful film that brings to life an incredible story to a perfection.In the end the praise for this movie is justified and rightly rewarded.",
            "review_date": "2015-10-31",
            "source": "rt"
        },
        {
            "content": "A good movie, interesting characters, presumably based on a true story of King George VI of England. The plot is fairly simple, with little depth, but nevertheless engaging. It's about the Prince's (and later, the King's) struggle with stammering, and the man who helps him cope with it. The casting is excellent, and especially Geoffrey rush as Lionel (the speech therapist) is just delightful. It's not a deep, interwoven storyline, but rather just a nice, interesting, and well-acted feel-good movie. Probably not something you'll watch more than once, but still a nice movie.",
            "review_date": "2015-09-21",
            "source": "rt"
        },
        {
            "content": "It's predictable and slow paced, but The King's Speech works as a fascinating historical drama with powerhouse performances and beautiful direction and production design.",
            "review_date": "2015-09-12",
            "source": "rt"
        },
        {
            "content": "* The interaction between Colin Firth and Geoffrey Rush is brilliant, and carries what is quite a slow film. \n* Colin Firth superbly takes you on the journey of Bertie. Dealing with his issues and emotions whilst being thrust unexpectedly in to a position of great responsibility. \n* Felt the film was shot excellently, all scenes had a grand feel to them!",
            "review_date": "2015-09-09",
            "source": "rt"
        },
        {
            "content": "Ideje volt megnézni.. :)",
            "review_date": "2015-09-03",
            "source": "rt"
        },
        {
            "content": "I never thought a historic drama like The King's Speech would keep me on the edge of my seat. Beautiful camera work, spot on acting, and stylish design. A great film that embraces all aspects of filmmaking (both story and behind the scenes) to its fullest and makes us all remember why we all love movies.",
            "review_date": "2015-09-02",
            "source": "rt"
        },
        {
            "content": "a really great film that deserved every accolade it was given",
            "review_date": "2015-08-06",
            "source": "rt"
        },
        {
            "content": "Predictable all the way but the sheer performance turning this to be a crowd pleaser needs to be recognised",
            "review_date": "2015-08-05",
            "source": "rt"
        },
        {
            "content": "What makes the film is the exquisite chemistry between Colin Firth and Geoffrey Rush, both of whom deliver stellar performances.\n\n7,5/10",
            "review_date": "2015-07-28",
            "source": "rt"
        },
        {
            "content": "This was exceptional. Colin Firth at his best. It is such a profoundly heartbreaking and yet inspirational story. There is no action, no adventure, just the tale of one man's struggle to find his voice. A must see.",
            "review_date": "2015-07-21",
            "source": "rt"
        },
        {
            "content": "Dry at times but Colin Firth and Geoffrey Rush were awesome.",
            "review_date": "2015-07-06",
            "source": "rt"
        },
        {
            "content": "Great movie, you really get to know the characters which are portrayed beautifully .",
            "review_date": "2015-07-03",
            "source": "rt"
        },
        {
            "content": "Colin Firth won best lead actor for a REASON!!!!!",
            "review_date": "2015-06-23",
            "source": "rt"
        },
        {
            "content": "The King's Speech is a very interesting drama. The film is based on the true events of a king with speech impediment. The concept is interesting, and the King is expertly portrayed by Colin Firth. The rest of the cast is really excellent. The story is really engaging for the first hour, then slows down for quite some time before reaching a great finale. The writing and directing are great. The movie is quite predictable though. The emotional core of the film is very strong, a bond between Firth and his speech therapist is very well developed over the course of the film. It may be a bit slow, predictable, and not very rewatchable, but this movie is excellently made with great performances. The King's Speech gets 4/5 stars (A-).",
            "review_date": "2015-06-12",
            "source": "rt"
        },
        {
            "content": "Wonders are often lucid, this movie is one. Tom Hooper's presentation is as royal as the characters involved. Seidler's screenplay not only resurrects the history, but also recreates the emotion. This movie is a real challenge in writing dialogues, as the protagonist himself stammers and is the soul entity around whom the entire story is weaved, despite of this lack of broader scope the conversations are sublime and dig deep into the heart through ears. The unusual combination of an extremely royal being to an ultra commoner is really well worked out without dissection of one under the other. Colin Firth lives out the character and one would wonder if he really stuttered. Geoffrey Rush maintains his commoner look throughout the movie despite of the royal neighbourhood constantly emerging. Mr. Rush gives a promising performance by seeming special and also common simultaneously.Cinematography really helps in generating the feel of the royal era. music well supports the plot and intensifies the emotion. Costumes really get the actors into character's skin. Finally, the king's speech is a pure classic with great performances for a great plot.",
            "review_date": "2015-06-08",
            "source": "rt"
        },
        {
            "content": "It was gripping, I was told I had to watch it and reluctantly agreed to. 30 mins later I was hooked. Great Film",
            "review_date": "2015-05-29",
            "source": "rt"
        },
        {
            "content": "one fo my top 22 films",
            "review_date": "2015-05-29",
            "source": "rt"
        },
        {
            "content": "A spectacular true story with one of the best performances ever put to screen from Colin Firth.",
            "review_date": "2015-05-21",
            "source": "rt"
        },
        {
            "content": "Watched it. Finally.\nActing leading by Colin Firth & Geoffrey Rush is remarkable.\nBut I don't find the story nor the narrative is particularly interesting.",
            "review_date": "2015-05-18",
            "source": "rt"
        },
        {
            "content": "It starts out slow and only gets slower, but Colin Firth brings his all to the leading role of this historical character study.",
            "review_date": "2015-05-14",
            "source": "rt"
        },
        {
            "content": "Amazing interpretation of the real life story, great costume design, great music and unbelievable performances.",
            "review_date": "2015-05-11",
            "source": "rt"
        },
        {
            "content": "Well done, but not exceptional.",
            "review_date": "2015-05-08",
            "source": "rt"
        },
        {
            "content": "Great performances by Colin Firth, Geoffrey Rush, and Helena Bonham Carter make this movie a good experience.",
            "review_date": "2015-05-05",
            "source": "rt"
        },
        {
            "content": "Brilliantly directed with decent production. Rush could have single-handedly made this film work by himself but he didn't need to. Interesting strong character arcs within in straight storyline, at times the film was engrossing.",
            "review_date": "2015-04-26",
            "source": "rt"
        },
        {
            "content": "82% on my Tomatometer.",
            "review_date": "2015-04-14",
            "source": "rt"
        },
        {
            "content": "A pretty accurate portrayal of King George VI with the help of Lionel Logue to overcome his speech impediment, as he addresses his nation who is on the brink of war to ensure that Britain will remain strong. One of the most influential moments of British history. This film is great with drama, love as you really feel bad for Bertie (King George VI) in hopes he can overcome his speech impediment. Great movie all around, maybe some historians will argue on how accurate the portrayal was, but its a flawless film as all the characters are like able in their own way. Great film that helps shows that others out there who have the same speech impediment can overcome their adversity and give them a voice. Such an emotional movie",
            "review_date": "2015-04-11",
            "source": "rt"
        },
        {
            "content": "A powerfully moving true story. Colin Firth is excellent.",
            "review_date": "2015-04-10",
            "source": "rt"
        },
        {
            "content": "Even though Colin Firth gives a good enough performance, this is basically a one note film where Colin Firth's character suffers from a speech impediment and tries to find a solution.",
            "review_date": "2015-03-28",
            "source": "rt"
        },
        {
            "content": "Firth and Rush make a important and indispensable duet for this film. Tom Hooper brings us a solid and compelling argument, based on a true story which is carried to the cinema to the perfection, the way in which is made the film is entertaining and original, also helps us to learn something about history. 9/10",
            "review_date": "2015-03-28",
            "source": "rt"
        },
        {
            "content": "Cast members giving performances of their careers. Bonham-Carter and Firth making a right royal pair. Could not have picked a better pair to play the couple. Sublime",
            "review_date": "2015-03-08",
            "source": "rt"
        },
        {
            "content": "An Inspiring Movie. Great Acting.",
            "review_date": "2015-02-26",
            "source": "rt"
        },
        {
            "content": "Brilliant and moving film! Definitely deserved the oscar win! Cinematography is very well done.",
            "review_date": "2015-02-24",
            "source": "rt"
        },
        {
            "content": "This movie made me stand up and cheer bravo!",
            "review_date": "2015-02-22",
            "source": "rt"
        },
        {
            "content": "I admire Colin Firth as never!!! Woww what a movie!!",
            "review_date": "2015-02-22",
            "source": "rt"
        },
        {
            "content": "I was pleasantly surprised by this film. Period pieces can often be unpredictable in their ability to portray the reality of the era. This is even more an issue when the story being told is based on fact. However, this movie did an excellent job on both counts. As a drama, it was very engaging and interesting to learn the tale behind King George VI's speech impediment and how he overcame it in order to lead and encourage his country. A must see for history buffs.",
            "review_date": "2015-02-20",
            "source": "rt"
        },
        {
            "content": "Colin Firth shows the world that he is a stellar actor.",
            "review_date": "2015-02-16",
            "source": "rt"
        },
        {
            "content": "Great performances by the two leads and supporting cast. Anyone can have the odds stacked against them. Even a King. I found this movie inspirational.",
            "review_date": "2015-02-07",
            "source": "rt"
        },
        {
            "content": "Very good movie, Bonham-Carter has never been so good",
            "review_date": "2015-02-07",
            "source": "rt"
        },
        {
            "content": "The King's Speech works, even if as a nice little family film (harsh language aside) about never giving up and always mustering up the courage to seek help when needed.",
            "review_date": "2015-02-05",
            "source": "rt"
        },
        {
            "content": "Fine Performances from Firth and Rush",
            "review_date": "2015-02-02",
            "source": "rt"
        },
        {
            "content": "A great depiction of the psychological problems that cause speech impediments and a how-to sequence by Geoffrey Rush on how to treat them.",
            "review_date": "2015-01-31",
            "source": "rt"
        },
        {
            "content": "When it comes to subject choice in movies, one of the most well-explored areas is royalty, which raises the question, do we really need another one? We've been through everything from butlers to monarchs with results varying from good to terrible. However, The King's Speech is not just another royalty flick. It stands tall among the very strongest of its genre through the strength of its script, direction and especially its performers. \n\nThe King's Speech is the story of King George VI, Bertie (Firth) to his friends, and his ascension to the throne after the death of his father (Gambon) and his brother's (Pearce) abdication. The only problem is his stammer. Bertie can barely blurt out a sentence without st-stuttering through every word. In order to overcome this impediment, his wife (Carter) enlists the help of a slightly unorthodox speech therapist, Lionel Logue (Rush). This may seem a thin premise to hang a film on, but the themes explored with admirable confidence are more than enough to fill two hours with. \n\nThe entire cast, bursting at the seams with talent, put in oscar worthy performances, with the fiery yet burdened Colin Firth incredible as the King, the demure yet commanding Helena Bonham Carter as Queen Elizabeth and the inimitable Geoffery Rush as Lionel Logue. Leading the cast is Firth whose entire career is littered with brilliant performances, and he outdoes himself yet again with a beautifully restrained, utterly human performance which you cannot help but feel for. He also pulls off some welcome flashes of humour and brings on the fire and brimstone with fantastic conviction, all the while maintaining a perfectly imperfect stammer which pervades, but never gets in the way of, his towering performance. And the chemistry which he finds with his co-star Geoffery Rush makes for one of the more believeable and exciting male partnerships in years. Rush's own performance matches Firth's in terms of subtlety and nuance as well as the same level of perfectly judged restraint, yet the two never seem at odds, finding a rhythm with each other in their slowly building friendship which is at times flat out hilarious and at others brilliantly intense. It is an breathtaking display of two top-class actors working seamlessly together. Helena Bonham Carter plays the ever-supporting Queen Elizabeth who, in the hands of a lesser actor, could have turned into a stereotype but is instead a strong, quiet character in her own right. She is able to command a room with a look but also able to guide her husband through some of the hardest days he has had to face, showing a beautiful light and shade in an entirely selfless performance. Guy Pearce, though lacking a lot of the screentime his co-stars are given, makes and incredible impact in every one of his scenes. His slimy Edward is the unofficial villain of the piece and he manages to be spitefully real at every turn. It's one of his finest performances and, in comparison to his co-stars, he barely graces the screen. \n\nThe script which all these performances hang off is a thing of beauty. It manages to combine reality and creativity seamlessly with never a moment devoid of the reality it deserves whilst never missing out on an opportunity for the humour and intensity which the film is strewn with. Unexpectedly, the film also quite a bit of abbraisive language, but the context which it's in means that even the most sensitive of viewers won't be turned off. But its greatest achievement is the very real characters it helps create and the relationships it helps to extend. \n\nTom Hooper nails the direction, despite the tremendous leap forward in terms of content and responsibility. His biggest venture before his latest is 2009's The Damned United, so it's quite a step up in exposure, yet he never seems to show it, taking bold risks with confidence. His use of fisheye lenses is reminiscent of Kubrick and he uses the effect sparingly and effectively. He also pushes the rule of thirds to the extreme, making for some eye-catching shots which are either genius or annoying depending on your point of view. I'm for 'genius' by the way. \n\nBut the greatest part of the movie is the tangible connection created between characters and audience and the pounding in your chest when Bertie takes the microphone or Lionel oversteps his bounds on a morning walk as every part of the film works together in a beautifully restrained piece of filmmaking. \n\nDefining Scene: \nAny scene where Colin Firth and Geoffery Rush are onscreen together. But more specifically the ending speech, conducted by Logue.",
            "review_date": "2015-01-30",
            "source": "rt"
        },
        {
            "content": "Well-made and with a great Geoffrey Rush performance it still manages to be pretty boring. Typical oscar movie: Drama with good acting, that will sink into obscurity.",
            "review_date": "2015-01-29",
            "source": "rt"
        },
        {
            "content": "An excellent Colin Firth and great dialogue boost this period piece above being Oscar bait.",
            "review_date": "2015-01-24",
            "source": "rt"
        },
        {
            "content": "Excellent British film with a tremendous lead performance from Colin Firth.",
            "review_date": "2015-01-24",
            "source": "rt"
        },
        {
            "content": "Correcto film con correctas actuaciones, creo que el Oscar debiò ser para The Social Network.",
            "review_date": "2015-01-20",
            "source": "rt"
        },
        {
            "content": "Great topic for a drama! Stylish thing and beautiful acting, too.",
            "review_date": "2015-01-16",
            "source": "rt"
        },
        {
            "content": "pretty lame but good for a drama. didnt liek that they made a move about King George VI tho, it will insprie copy cat",
            "review_date": "2015-01-06",
            "source": "rt"
        },
        {
            "content": "One of those films where every scene looks like a work of art. Extremely well done, well cast, and well acted. Great script, great film.",
            "review_date": "2014-12-29",
            "source": "rt"
        },
        {
            "content": "Certainly a compelling story, and some fine performances all-around.",
            "review_date": "2014-12-24",
            "source": "rt"
        },
        {
            "content": "After an all-time great summer of terrific movies, \"The King's Speech\" closes out the movie year that is 2010 in compelling fashion. Colin Firth is incredible as a man with a speech impediment who unexpectedly finds himself on the throne of Britain in the face of World War II. With the help of his speech therapist (Geoffrey Rush in an underrated performance) he must find a way to overcome his stammering in order to rally the country and become a strong leader. This is an entertaining and insightful film that absolutely deserves all the praise it has received. \"The King's Speech\" is a great film.",
            "review_date": "2014-12-13",
            "source": "rt"
        },
        {
            "content": "The King's Speech is a movie about England's King George the Sixth,and his speech impediment.Where his country relies on him giving an important speech,the movie becomes a very intricate drama with great performances.",
            "review_date": "2014-12-11",
            "source": "rt"
        },
        {
            "content": "Great character-driven historical drama.",
            "review_date": "2014-12-04",
            "source": "rt"
        },
        {
            "content": "The King's Speech is a wonderful film about a man finding his voice when the world needed to hear it most, but that's only the plot as it may be described at a more superficial level. Deeper themes on friendship, confidence, self-worth, love, respect, and hard work are all highlighted in this touching and powerful instant classic that's sure to speak to every viewer who has ever suffered through any physical, mental, or emotional shortcomings and fought to overcome. Supported by a witty, meaningful, and self-assured script; strong direction; great sets and costuming; seamless performances; and impeccable intangibles; The King's Speech is a complete film, a modern masterpiece with old fashioned sensibilities and a timeless message that's sure to live on for decades to come.",
            "review_date": "2014-12-01",
            "source": "rt"
        },
        {
            "content": "I found it hard to feel sorry for a king. Brilliant acting though.",
            "review_date": "2014-11-29",
            "source": "rt"
        },
        {
            "content": "People has been talking about how much this movie is a masterpiece, and how much Colin Firth gave an amazing performance.That was the first time I ever heard of Colin Firth and never saw his movies, then I was starting to see why from his other films. When I first watched The King's Speech, I fell asleep and didn't get the chance to watch it again. Now I got the time to watch it again, and I can see why people loved this. One of the reason is because of Colin Firth, this is his best performance and does master the stammer well. The movie is very interesting, and I honestly didn't find it predictable. The supporting cast is great in it, it's well shot, and it's well written. It is one of those films that some viewers might get bored, but it is an amazing historical movie that is going to be remembered for a while.",
            "review_date": "2014-11-25",
            "source": "rt"
        },
        {
            "content": "I'm not sure saying the f-word ten times in a row would have worked anywhere else but in the masterful playhouse of Firth and Rush -- magnanimously reminding us what it takes to be kings of the silver screen.",
            "review_date": "2014-11-17",
            "source": "rt"
        },
        {
            "content": "This film is about as compelling as a cardboard box.",
            "review_date": "2014-11-11",
            "source": "rt"
        },
        {
            "content": "I was actually surprised at how good this film turned out. The ending also brought a smile to my face!",
            "review_date": "2014-11-08",
            "source": "rt"
        },
        {
            "content": "Glad it got such overwhelming national attention after starting so small in a handful of theaters.",
            "review_date": "2014-11-07",
            "source": "rt"
        },
        {
            "content": "I don't get to see movies like this too often.  While the pacing was slow in parts, I felt like it was intentional due to the need to have the viewer \"feel\" King George VI's own slow pace.  Otherwise, the acting, script, locations and emotion were flawless.  The effort made by the recently-defunct UK Film Council to get this picture made and distributed was Herculean.",
            "review_date": "2014-10-09",
            "source": "rt"
        },
        {
            "content": "This film has become one of my favourite ones... I'd watch it over and over again!",
            "review_date": "2014-10-08",
            "source": "rt"
        },
        {
            "content": "Done with great artistry and class, The King's Speech has rich history, enough wit and humor, and phenomenal performances",
            "review_date": "2014-09-25",
            "source": "rt"
        },
        {
            "content": "The King's Speech is a movie about England's King George the Sixth,and his speech impediment.Where his country relies on him giving an important speech,the movie becomes a very intricate drama with great performances.",
            "review_date": "2014-09-13",
            "source": "rt"
        },
        {
            "content": "Easily one of the greatest works of art this decade has seen so far while still winning over the hearts of the audience",
            "review_date": "2014-08-27",
            "source": "rt"
        },
        {
            "content": "It's overrated but I still admire it.",
            "review_date": "2014-08-26",
            "source": "rt"
        },
        {
            "content": "Deep inside your voice.",
            "review_date": "2014-08-22",
            "source": "rt"
        },
        {
            "content": "\"Barbossa\" puheenopettajana. Ihan kivasti toimi. Suosittelen.",
            "review_date": "2014-08-19",
            "source": "rt"
        },
        {
            "content": "This movie was super boring and Colin Firths pompous self made it all the worse..must we document every boring thing about the royals? I give this 1 and a half snores",
            "review_date": "2014-08-18",
            "source": "rt"
        },
        {
            "content": "A feel-good British film that shows us that we all have a voice and can overcome our fears of speaking publicly.",
            "review_date": "2014-08-10",
            "source": "rt"
        },
        {
            "content": "Inspiring but very predictable, The king's speech can satisfy both critics and movie-goers.",
            "review_date": "2014-08-07",
            "source": "rt"
        },
        {
            "content": "We always suspected even statesmen at the very top would be only human. This movie shows exactly that in an intimate and touching way.",
            "review_date": "2014-08-02",
            "source": "rt"
        },
        {
            "content": "Good film, good cast. Not a regular watch though.",
            "review_date": "2014-08-01",
            "source": "rt"
        },
        {
            "content": "Wonderful!!! I have to see it again!",
            "review_date": "2014-07-27",
            "source": "rt"
        },
        {
            "content": "muy buena exelentes actuaciones",
            "review_date": "2014-07-26",
            "source": "rt"
        },
        {
            "content": "Firth's and Rush' performances would be remarkable on their own, but they complement each other perfectly, standing out without overshadowing, and making for the cutest onscreen couple since The Notebook. The sharply written script allows for both drama and humor to flourish naturally. And a surprisingly attractive visual style saves the film from falling to the death that so many period dramas face: dullness. Excellent, excellent movie.",
            "review_date": "2014-07-25",
            "source": "rt"
        },
        {
            "content": "A wonderful period drama and human story.",
            "review_date": "2014-07-23",
            "source": "rt"
        },
        {
            "content": "Very deserving of its Best Picture Oscar.",
            "review_date": "2014-07-21",
            "source": "rt"
        },
        {
            "content": "It seems as though historical films never get all of the details right about the actual events. Look up the Wikipedia article on any movie based on a real event and you'll find a section entitled \"historical accuracy\" devoted to tearing apart the work for any liberties taken. Sometimes, these creative choices can be beneficial to the plot. In The Sound of Music, it is very satisfying to watch the Von Trapps climb over the Alps at the end, and it makes for a much better conclusion than watching them board a train as the actual family did in real life. Some changes in these films, however, are taken to appease the filmmaker's agenda, such as when Michael Bay chose to show the Japanese bombing the hospital in Pearl Harbor. Although I feel that changes such as this can be harmful to both the art of film and our society in general, I don't believe that we should discard all historical movies just because of their inaccuracies. No matter what care is put into the filmmaking process, there is no way that all of the facts of an event can be crammed into a two-hour window. With that in mind, I recommend that we sit back and watch these films, overlooking the minor differences between the real story and the fiction, and look instead at the movie's deeper meaning. With that in mind, let's dive into The King's Speech.\n\nIn this 2010 Tom Hooper drama, Colin Firth plays Prince Albert, the Duke of York and the son of King George V. From a very young age, Albert has had a strong stutter in his speech, something that both he as his wife Elizabeth, played by Helena Bonham Carter, are concerned about because of the great amount of public speaking that he has to do. After looking to a number of different sources for a cure, Elizabeth finds a man named Lionel Logue, an Australian speech therapist played by Geoffrey Rush. After an unpleasant first session that ends up yielding Mr. Miyagi-style results, Albert agrees to have regular sessions with Logue, whose methods have a profound effect on the Prince. The two soon become good friends, and Albert looks to Logue as someone to confide in about his personal problems as well as his stammer. As Albert's speech improves, other ares of his life spiral downward as his father's health becomes worse in his old age and his disgraceful brother, David, plans to accede to the throne. Albert approaches a time in his life that will require him to make many hard decisions if he wants to protect both his country and his family's image from his brother's recklessness.\n\nColin Firth won the Academy Award for Best Actor because of this movie, and I personally believe that he was completely deserving of the accolade. Firth's portrayal of the stammering Prince Albert is both convincing and heartbreaking, showing both the difficulties of being a public figure with a speech impediment and the cause of his insecurities. Firth also does a great job showing a character who gradually improves over the course of the film. Although I've never had any sort of speech problem, I can relate to the character of Albert as someone who spends a great deal practicing a certain craft. The scenes of Albert's early sessions that depict him struggling through speech exercises reminded me of the first few years of my guitar playing, in which I had great difficulty with most passages and exercises that I attempted. I also appreciated how he is still not the perfect speaker at the film's conclusion. Practicing your craft takes many years, and it's something that can always be improved upon. I believe that anyone who is involved with an occupation or hobby that requires great practice can relate to Albert's struggle, and Firth's performance is very inspiring to all who are hoping to become skilled individuals.\n\nThe King's Speech was also very unique in the direction and feel of the movie. I've noticed over the past several years that there are more and more films being nominated by the Academy with incredibly dark subject material. The King's Speech is, essentially, a very basic tale about a man overcoming the obstacles in his life and taking hold of his responsibilities. There's no uncomfortable scene of domestic abuse, no gratuitous nudity (or any nudity at all, for that matter), and no bizarre monologues about milkshakes. All of these qualities can still be present in a great film and can be used to enhance the film, but none of them were necessary in The King's Speech. Despite the simplicity of the story, the stylish and masterful direction of the film keeps the plot from feeling stale. There isn't a single wasted scene in the film; every frame is devoted to the lives and struggles of Albert, Logue, and Elizabeth.\n\nAnother thing that I found interesting about this film is that it was rated R for language. However, there were only two scenes that used the sort of language that warrants an R rating, while most R-rated Oscar-nominated dramas contain harsh language throughout the entire running time. This means that the filmmakers found these two scenes so necessary to the plot that they were willing to suffer with the R-rating, a risky choice, as it  is well-known that R-rated films generally don't do as well at the box office as PG and PG-13 flicks.\n\nAs I stated at the beginning of this review, the film isn't completely accurate to the actual historical account of Prince Albert and Logue. The entire timeline of the film is shifted about ten years after the two began their sessions so that Hooper could show both Prince Albert's struggle with his speech and with his brother, as well as the Duke's response to Hitler's conquest of Europe. It is also well-known that it took a much shorter amount of time for Albert's speech to improve than the film suggests, as he was praised for his speech at the Australian Parliament in Canberra in 1927, only seven months after his first session with Logue. However, I believe that these minor changes do not tarnish the overall significance of the film. Despite the deviations between the story presented here and the actual tale of the Duke of York, we are still given a film that enriches our understanding of Prince Albert and that can encourage us to overcome our own shortcomings, as well. This film is solidly on what I'll call the \"Von Trapp Mountain-Climbing\" side of the historical inaccuracy line, and it's a culturally significant work that is both educational and inspiring.",
            "review_date": "2014-07-17",
            "source": "rt"
        },
        {
            "content": "One of the best films of the year.  Firth's performance is Oscar-worthy.",
            "review_date": "2014-07-14",
            "source": "rt"
        },
        {
            "content": "Full of heart, brilliantly acted, and near-flawlessly cast.  The plot is slow-moving, perhaps off-putting to people with limited amounts of attention, but overcoming a speech disorder is no action-adventure film. The pain and fear of a childhood lived under tyranny is plain on Colin Firth's face. Helena Bonham Carter was unrecognizable.  The R rating is absurdly Victorian; the cursing scene is a breakthrough.",
            "review_date": "2014-07-14",
            "source": "rt"
        },
        {
            "content": "Extremely dislike Helena Bonham Carter, her presence just annoys me!",
            "review_date": "2014-07-11",
            "source": "rt"
        },
        {
            "content": "With a tour de force performance from Colin Firth, as well as a stellar supporting performance by Geoffrey Rush, 'The King's Speech' will have you standing and cheering alongside the protagonist by film's end. \n___\ncertainlycinema.com\nfacebook.com/certainlycinema\nInstagram: certainlycinema",
            "review_date": "2014-07-07",
            "source": "rt"
        },
        {
            "content": "A simple story on paper, but as usual the details is in the execution. Great film and acting.",
            "review_date": "2014-07-05",
            "source": "rt"
        },
        {
            "content": "I feel like this is one of those perfect films. Nothing is wrong with it, as far as I can tell.",
            "review_date": "2014-07-04",
            "source": "rt"
        },
        {
            "content": "Colin Firth absolutely positively deserves the Academy Award for this performance of his !! And Geoffrey Rush is super as always.. The movie is much much better than I had expected before I watched.. I strongly recommend it to ones seeking for a fulfilling movie..",
            "review_date": "2014-07-03",
            "source": "rt"
        },
        {
            "content": "Ok, not as good as hyped but worth a watch.",
            "review_date": "2014-07-02",
            "source": "rt"
        },
        {
            "content": "Movies don't get much better than this. Both enjoyable, relatable and moving.",
            "review_date": "2014-07-01",
            "source": "rt"
        },
        {
            "content": "Charming, touching and funny.",
            "review_date": "2014-06-30",
            "source": "rt"
        },
        {
            "content": "very good drama for a lazy sleepy Sunday. good acting 'fair enough' story. a nice story.",
            "review_date": "2014-06-26",
            "source": "rt"
        },
        {
            "content": "The film starts with the scene of the closing ceremony of the empire exhibition. Albert Frederick Arthur George is about to start giving an important speech. As a result, he failed to give a good speech because of a stammering problem. At the speech, he barely speaks fluently, because of the stammers. He has an older brother, so he wasn't supposed to give a speech frequently, but actually, his brother is too irresponsible to take over as King George 5. Therefore, Albert has some time to give a speech. This is the story about Albert and his wife's efforts to get over the stammering to be a dignified loyal family member. After the ceremony, his wife visits one speech pathologist. His name is Mr. Logue, who asked Albert to call him by his first name, Lionel. He is an immigrant from Australia and his way of curing is very particular and a bit weird, so Albert doesn't trust him at first. Eventually, Albert and Lionel gradually become good partners through the therapy. After George 5 dies, his brother was supposed to take over, but he eloped with his American girlfriend, which means Albert would be the King George 6. Albert is unconsciously weak mentally, because of traumatic experiences during his childhood. Those experiences caused his stammer. But at this moment, he has to be strong, to be the King. Albert and Lionel's struggle against the stammer makes the movie quite serious. \n\nThe actors in this film are great. Their performances are just amazing. Especially, I like Lionel's performance. Even though he doesn't really speak his thoughts, he tends to joke a lot. I could see how he really thinks and what he wants to tell by his facial expressions. Albert's acting is really good as well, but it is difficult to catch how he feels and what he thinks by his facial expressions. I know it is on purpose that he uses a poker face, but I wish he acted with more facial expressions. He never changes his face even when he is angry, so I felt he was a little bit scary. This might be one of the film's aims that his poker face makes the audience intimidated.\n\nThis film teaches you how important your style of speaking is. Voice has power to show your thoughts and passions. The film also teaches you that you should not judge people by their looks and background. As Albert and Lionel understood each other through spoken communication, you never know what others really are until you talk with them a lot.",
            "review_date": "2014-06-25",
            "source": "rt"
        },
        {
            "content": "\"The King's speech\" gave us huge confidence.\n by Miyuki Shindo\n \nAre you a good speaker? Do you have to be a good speaker? Sometimes you need good speaking skills when you make a speech or a presentation for business, you ask someone out or you persuade someone to do what you want her/him to do. \"The King's speech\" gives us hope because even the King of England finds it difficult to make good speeches. Though it's difficult to get good speaking skills, everybody may have the chance to learn if they try hard.\n\nBefore WW2, Prince Albert, Duke of York (Colin Firth) made a speech at the 1925 British Empire Exhibition. He is the second son of King George V. However he stammers, so his wife Elizabeth (Helena Bonham Carter) persuades him to visit Lionel Logue (Geoffrey Rush), an Australian speech therapist in London. At first, Prince Albert, who is called \"Bertie,\" doesn't like Lionel's therapy, but Bertie gradually begins to understand that he will becoming King because George V (Michael Gambon) died and (David Guy Pearce) has a lack of responsibility as the next King. He only has to improve his speaking...\n\nBertie is well played by Colin Firth. At the beginning of the film, we can quickly understand his sickness, so he acts as a person who stammers. However, I am unsure about his acting ability because I've never seen a person with this condition before. Michael Gambon as George V is a very nice role because I associate him with a great person since he played Albus Dumbledore in the movie Harry Potter. His posture, tone, volume, speed and statement is great when he makes a speech. He looks confident. \n\nThe scene in which Bertie and Lionel are training speaking is my favorite one. It was done in many places like Lionel's office, and the church. This movie is serious almost all the time, but the scene of practicing is funny and entertaining. This mood makes us enjoy the film more. They often make a speech while singing. That is so interesting for me as though Bertie sometimes says a bad word, which I didn't like so much. Throughout this training, they make a good friendship, so after watching this movie, we felt very comfortable and found this story so beautiful.\n\nThere are two main messages in this movie. One is \"be confident\" or \"overcome the problems and hard tasks, and you are certain to do them well\". Bertie's efforts make me more cheerful and hopeful. I got to think that I have to make more effort with my weaknesses. Another is the importance of friends. Bertie and Lionel often quarrel, but they trust each other. Their friendship would last forever, so this movie is good model of friendship.\n \nEveryone can enjoy watching this movie. There are no shocking or sexual scenes, so you don't have to be afraid. About the contents, these themes are also very simple and they apply to all people. Especially, I recommend this movie for young people because the themes can be a lesson on how to live and to not have regrets. If you get into some trouble or you feel nervous, please watch this movie to be more confident.",
            "review_date": "2014-06-24",
            "source": "rt"
        },
        {
            "content": "Friends ? just being kind\nI've just seen \"The King's Speech\" and would like to give a comment about it. I normally don't watch those kinds of historical movies, but actually, I think it is a good one. \nThis movie is based on King George ?'s life just before WW2. The Duke of York?stammers while he talks. It is a big problem because he is the second son of King George ?, but he has given up being cured. However, his wife, Elizabeth, persuades him to see Lionel Logues who is an Australian speech and language therapist. Their relationship does not go very well at first, but they eventually become great friends. \nI think the cast is great. I especially like Geoffrey Rush who plays Lionel Logue. I think his acting contributes a lot to make the movie very exciting. Also, Guy Pearce who played King Edward ? did a good job to express his foolishness and selfishness. \nI liked the scene where The Duke of York finally accepts Lionel as a friend and calls him \"my friend\". Here, I could see how strong their bond is. I was really happy to see that Lionel's effort to be close to the king finally bears fruit. \n\tFrom this movie, I learned that being a great friend does not always mean being kind. Sometimes, you have to be strict and say or do something harsh to your friends, in order to actually help them. It's not easy and you might be disliked by the one you tried to help. However, you have to be strong and believe that she/he will notice someday that you said/did something strict because you wanted to help him/her. \n\tI think it may seem too difficult for children or teenagers, but adults will definitely like this movie. I recommend this movie to those who are having a social problem. I am sure this movie will remind you of real friends. This movie is really worth watching even though it seems like a sophisticated topic. \n\nFriends ? just being kind\nI've just seen \"The King's Speech\" and would like to give a comment about it. I normally don't watch those kinds of historical movies, but actually, I think it is a good one. \nThis movie is based on King George ?'s life just before WW2. The Duke of York?stammers while he talks. It is a big problem because he is the second son of King George ?, but he has given up being cured. However, his wife, Elizabeth, persuades him to see Lionel Logues who is an Australian speech and language therapist. Their relationship does not go very well at first, but they eventually become great friends. \nI think the cast is great. I especially like Geoffrey Rush who plays Lionel Logue. I think his acting contributes a lot to make the movie very exciting. Also, Guy Pearce who played King Edward ? did a good job to express his foolishness and selfishness. \nI liked the scene where The Duke of York finally accepts Lionel as a friend and calls him \"my friend\". Here, I could see how strong their bond is. I was really happy to see that Lionel's effort to be close to the king finally bears fruit. \n\tFrom this movie, I learned that being a great friend does not always mean being kind. Sometimes, you have to be strict and say or do something harsh to your friends, in order to actually help them. It's not easy and you might be disliked by the one you tried to help. However, you have to be strong and believe that she/he will notice someday that you said/did something strict because you wanted to help him/her. \n\tI think it may seem too difficult for children or teenagers, but adults will definitely like this movie. I recommend this movie to those who are having a social problem. I am sure this movie will remind you of real friends. This movie is really worth watching even though it seems like a sophisticated topic.",
            "review_date": "2014-06-23",
            "source": "rt"
        },
        {
            "content": "'The King's Speech' shows us a very different form of lifestyle, but at the same time, a universal human lifestyle. The main subject of 'The King's Speech,' being the trouble surrounding his stammer, was probably much less familiar in Japan. Actually, I myself had not known this kind of hardship in speaking. 'The King's Speech' is, of course, accepted as a story of one person overcoming difficulty.\nBut, totally, 'Kings' Speech' is, for me, the conflict of one person who wavers between 'public' and 'private' life. And this main problem, of course common with all people, is emphasized by the situation of a man who might have the most important role in the world, in one of the hardest periods of the 20th century. In fact, it is easily shows the contrast between Albert's public side and private side: as one of the royal family and later George ?, and a good husband as much as a good father. \nI think the music in each scene plays one of the biggest roles in this movie's success. Different kinds of music are very effectively used in scenes of home and public. This music accurately depicts Albert's inside state of mind.  \nIt's not directly concerned with the film. But, we, Japanese, are generally regarded as being not great public speakers. It probably derives from stereotypes of Japanese. Actually, many English learners in Japan make efforts to speak like a 'native English speaker.' Such efforts are, for us, similar to public speaking. For example, if I don't know about a word's pronunciation, it prevents me from speaking naturally and fluently. The gap between one's desire and failure in speech reminds me of that. \nI also want to mention how brilliant the actors in this film are, even from a general audience's view. Especially, Helena Bonham Carter seems to have done very good work. Her play in this movie reminds me of her 'normality' in 'A Room with a View.' Her maternal role enables the story to get close to our ordinarily life. For Albert, she and their daughters are a close 'family,' and they do not have the 'stammer' of Albert. \nIt might seem strange now to praise the most awarded movie in 2011. But, this movie has still a huge impact and various appeals which can move me with new aspects, even during my third time watching.",
            "review_date": "2014-06-23",
            "source": "rt"
        },
        {
            "content": "A True Friendship\n\n This movie \"The King's Speech\" reminded me how important true friendships are in our lives. Everyone knows friendship is very important. However, nowadays social media (Facebook, twitter, etc.) has become popular, which can make a bad influence on our ways to communicate, and then we might lack connection with the person. Fortunately, there's a very nice solution to fix it. It's absolutely this movie \"The King's Speech\". I highly recommend it. \n\n?In 1925, Prince Albert of York who was the second of King George VI is this movie's main character. This movie's main place is the United Kingdom, especially London. He has a big role in the Royal Family so he is given a lot of opportunities to make public speeches. The big problem is his stammering which is a speech disorder typified by the involuntary repetition of a sound or sounds. For good or bad, this problem makes the greatest story I have ever known. Albert had struggled to overcome this symptom by trying many things. For instance, even though it's a very funny one, he tried to get his mouth around so many marbles and to read a book aloud. All ways to heal were ineffective before meeting a man who is an Australian man. His name is Lionel Logue who is a speech therapist. This Australian changed Albert's life very much. Finally, Albert got over his stammer and became this amazing King of the United Kingdom. This movie has a very moving story and makes you cry during the last 5 minutes. \n \n This movie's main character, King George V, was played by Colin Firth, who was born in the UK. His acting was so nice during this movie. I love his acting especially when showing his temper tantrums. However, comparing with the real King George VI, he's quite different. \n\n My favorite scene is the last scene of this movie which the King, George VI, made a public speech by telling all British people to prepare for upcoming war against Germany, with support of Lionel. After that, Lionel and the king's relationship became true. This scene made me cry and let me know how important \"true friendship\" is. \n\n Even though I mentioned again and again, what I learned from this movie is how important \"true friendship\" is. Before I entered college, I thought every friendship is very necessary to keep my life happy. Now I have so many more friends than before, however, I don't feel a strong relationships with these friends. Why not? For example, a good friends is someone who I can turn to for advice. I had those kinds of friends because I belonged to a baseball club. Japanese baseball clubs are very strict. This forced me and other members face challenges, however, this also made us become great friends. Many times I can't remember other friends who helped me get over challenges. This movie \"The King's Speech\" reminded me this great memory.\n\n\n\nScale of 1-5\n5",
            "review_date": "2014-06-23",
            "source": "rt"
        },
        {
            "content": "Great. 8.9/10. A-.\n\n\nAlthough it carries some clichÃÂ (C)s, The King's Speech much more than makes fun of it with its beautiful cinematography, effective score, smooth direction, great script,  fantastic production & costume design, and stellar performances.",
            "review_date": "2014-06-20",
            "source": "rt"
        },
        {
            "content": "Rushs performance very overlooked",
            "review_date": "2014-06-16",
            "source": "rt"
        },
        {
            "content": "Must watch movie based on true story of King George V.",
            "review_date": "2014-06-13",
            "source": "rt"
        },
        {
            "content": "Easily one of the most memorable and strongest performance in modern film by Firth. While the story is predictable, it is forgotten with a dramatic style of retelling.",
            "review_date": "2014-06-13",
            "source": "rt"
        },
        {
            "content": "Although predictable, The King's Speech is a stylish and funny period piece drama featuring solid performance from Colin Firth making it worthy of an Academy Award for Best Picture.",
            "review_date": "2014-06-12",
            "source": "rt"
        },
        {
            "content": "Hyped but very, very respectable.",
            "review_date": "2014-06-01",
            "source": "rt"
        },
        {
            "content": "One of the Best movie of Our Time",
            "review_date": "2014-05-28",
            "source": "rt"
        },
        {
            "content": "Admittedly very slow-moving, so not as gripping as I'd hoped, but that made it seem more realistic and true-to-life.  Subtly amusing, extremely well-acted, and absolutely beautiful, from costumes to soundtrack to cinematography all around.  A superbly well-made film.",
            "review_date": "2014-05-23",
            "source": "rt"
        },
        {
            "content": "Sincere and inspiring.",
            "review_date": "2014-05-21",
            "source": "rt"
        },
        {
            "content": "Tom Hooper's brilliantly crafted The King's Speech is an outstanding British period piece, featuring a delightfully witty screenplay, magnificent costumes and mesmerising performances from Geoffrey Rush and Colin Firth.",
            "review_date": "2014-05-19",
            "source": "rt"
        },
        {
            "content": "Powerful, classy, and intelligent. The King's Speech is truly amazing and is brought to life by the wonderful performances by Colin Firth and Geoffrey Rush. I 've always enjoyed true stories and this film is no different it's really amazing and deserved to win the Oscars.",
            "review_date": "2014-05-16",
            "source": "rt"
        },
        {
            "content": "Masterfully acted and directed, The King's Speech is completely deserving of the slew of awards under it's belt.  One of the best period dramas around.",
            "review_date": "2014-05-05",
            "source": "rt"
        },
        {
            "content": "Full of British Brilliance in writing, acting, and cinematography, The King's Speech deserves every award it has received. Colin Firth is especially wonderful in his portrayal of King Geroge VI, bringing him a great  humanization that we don't often see when royalty is portrayed in film. Brilliant all around.",
            "review_date": "2014-04-28",
            "source": "rt"
        },
        {
            "content": "A very witty true story of Albert, Duke of York's, rise to the throne in England while seeing speech therapist, Lionel Logue. The scenes between those two characters are comedic gold (in pounds) with a few, well-placed expletives as bookmarks. All of that leaves the rest of the film as filler, but very watchable. Th... thi.... this... is... %$#@! an.. enjoyable movie. \n\nGrade: A-",
            "review_date": "2014-04-28",
            "source": "rt"
        },
        {
            "content": "Fairly interesting and a bit silly. Watching actors pretend to be the royal family is more entertaining than watching the actual royal family doing anything.",
            "review_date": "2014-04-27",
            "source": "rt"
        },
        {
            "content": "A great film with truly fantastic acting, don't think it deserved best picture though, that should've gone to Inception. Grade A-.",
            "review_date": "2014-04-27",
            "source": "rt"
        },
        {
            "content": "A work of art...Emotional and heartfelt!",
            "review_date": "2014-04-25",
            "source": "rt"
        },
        {
            "content": "An all-time favorite for me, a compelling story of a coach and man finding his voice.",
            "review_date": "2014-04-19",
            "source": "rt"
        },
        {
            "content": "Good acting from Firth.",
            "review_date": "2014-04-16",
            "source": "rt"
        },
        {
            "content": "WOW....WHAT A HORRIBLE MOVIE",
            "review_date": "2014-04-13",
            "source": "rt"
        },
        {
            "content": "I'm generally not a fan of the respectable oscar pick, but the performances in this film are powerful and moving. I was pleasantly surprised to like it so much.",
            "review_date": "2014-04-12",
            "source": "rt"
        },
        {
            "content": "Terrible and undeserving of Best Picture.",
            "review_date": "2014-04-10",
            "source": "rt"
        },
        {
            "content": "one of the greatest performances you will ever see.",
            "review_date": "2014-03-09",
            "source": "rt"
        },
        {
            "content": "2010's recipient of the Academy Award for Best Picture, Tom Hooper's 'The King's Speech,' is an understated film that explores many themes including family, friendship and pride. Using the transfer of power in pre-World War II Great Britain as a backdrop, 'Speech' examines the metamorphosis of George VI as he grows into his role as king following a controversial episode within his royal family, and the lengths he goes to to eradicate an embarrassing stutter in an age of radio. Colin Firth, who won an Oscar for his performance as the aforementioned king, does a respectable job and makes audiences feel for his character due to the issues he deals with, stutter and all. Of course, the focal point of 'Speech' is the king's relationship with Australian speech therapist Lionel Logue (Geoffrey Rush), which undergoes an evolution of its own as the two spar with one another throughout the film. Other acting performances can be considered standouts, including Helena Bonham Carter as Queen Elizabeth (the older one, not the current one). Also admirable is the cinematography - for such a simple film that focuses on content over visual impressiveness, the camera work is very high quality. And then there's the title itself - 'The King's Speech' has a double meaning in that while the film is of course focused on George VI's speech impediment, it also notes the power conveyed in his most trying hour - a speech to the British empire announcing it was at war with Nazi Germany. Hoopers low-budget The King's Speech' may not seem to be the most popular film of the last few years, but history should remember it as a landmark achievement years from now.",
            "review_date": "2014-03-09",
            "source": "rt"
        },
        {
            "content": "Brims with elegance and strangely compelling.",
            "review_date": "2014-03-07",
            "source": "rt"
        },
        {
            "content": "With Firth's believable stutter and great acting, The King's Speech remains one of the best movies in recent years. Just the execution of such a simple idea at the core is amazing, and Director Tom Hooper is to be credited to the fullest for such a noteworthy film.",
            "review_date": "2014-03-04",
            "source": "rt"
        },
        {
            "content": "Una ganadora del Ã?scar que mÃ¡s se puede decir ?",
            "review_date": "2014-03-04",
            "source": "rt"
        },
        {
            "content": "Dramatic and touching. Great performances.",
            "review_date": "2014-03-01",
            "source": "rt"
        },
        {
            "content": "Boring crap. Clear awards bait, and surprisingly it won a lot. I don't understand why, because it is absolutely dull, dreary, bleak and overall fantastically boring.",
            "review_date": "2014-02-22",
            "source": "rt"
        },
        {
            "content": "A brilliant piece of work by David Seildier , The King's Speech is a fantasic piece of drama and performance tied in with excellent screenplay carried out by Colin Firth  , Geoffrey Bush and Helena Carter in a masterful fashion . The setting is perfect' and the entire movie has a strong emotional core throughout its length. A truly \"inspiring\" story and work for everybody",
            "review_date": "2014-02-17",
            "source": "rt"
        },
        {
            "content": "It has got some wonderful acting but apart from that its just a normal drama",
            "review_date": "2014-02-09",
            "source": "rt"
        },
        {
            "content": "en uvanlig film....men veldig bra...",
            "review_date": "2014-02-09",
            "source": "rt"
        },
        {
            "content": "This movie exceeded my expectation. I absolutely loved it.",
            "review_date": "2014-02-05",
            "source": "rt"
        },
        {
            "content": "Great film with excellent acting!",
            "review_date": "2014-02-05",
            "source": "rt"
        },
        {
            "content": "Surprisingly exciting and deep, this one definitely earned its best picture win.",
            "review_date": "2014-02-03",
            "source": "rt"
        },
        {
            "content": "A story of King George VI both inspiring and touching story of how George become a king and the friendship of George and Lionel developed and somehow its a funny movie at some scene. The performance of Colin's is probably one of the best thing in the movie, he really plays stuttered King George really well. Easily one of the best biography ever made!",
            "review_date": "2014-02-01",
            "source": "rt"
        },
        {
            "content": "This story is completely immersing, you ride the tough journey with the protagonist, experience his lowest low and feel is highest highs. In my opinion, a solid movie.",
            "review_date": "2014-01-27",
            "source": "rt"
        },
        {
            "content": "Good movie with good acting.",
            "review_date": "2014-01-25",
            "source": "rt"
        },
        {
            "content": "Never thought I'd say this, but Colin Firth is legitimately amazing in this movie. Moves at a pretty good pace, and a surprising amount of comedy as well. It's super British, but pretty enjoyable.",
            "review_date": "2014-01-12",
            "source": "rt"
        },
        {
            "content": "Wonderful acting performances. A very well directed and inspiring film.",
            "review_date": "2014-01-08",
            "source": "rt"
        },
        {
            "content": "Great chemistry between Firth and Geoffrey Rush. This is an amazing presentation of a linchpin moment of history.",
            "review_date": "2014-01-07",
            "source": "rt"
        },
        {
            "content": "idc. I hate this film.",
            "review_date": "2014-01-07",
            "source": "rt"
        },
        {
            "content": "Some might find it slow but its very affective. Also its packed with undeniable acting.",
            "review_date": "2014-01-06",
            "source": "rt"
        },
        {
            "content": "To get more value out of my ratings, see my rating philosophy (and more) at my RT blog at http://www.rottentomatoes.com/user/1053123/blogs/",
            "review_date": "2014-01-06",
            "source": "rt"
        },
        {
            "content": "A worthy winner of Best Picture. Sentimental but not overly so, it's just quite a charming little story about someone overcoming obstacles to fulfill their potential. Nicely directed, with a little poetic licencing but not too much. Well directed, well acted, good story, what's not to like?",
            "review_date": "2014-01-04",
            "source": "rt"
        },
        {
            "content": "wow ummmn just seen this movie 4 the 1st time n think that this is a brilliant movie 2 watch......its got a good cast of actors/actressess throughout this movie......i think that colin firth, geoffrey rush. helena bonham carter, guy pearce, timothy spall, derek jacobi, jennifer ehle, michael gambon, play good roles/parts throughout this movie.......i think that the director of this drama movie had done a good job of directing this movie because you never know what 2 expect throughout this movie......i think that colin firth was brilliant throughout this movie.....i think that this is a brilliant movie for 2010.......i think that geoffrey rush was brilliant thorughout this movie.......i think that this is such a really well acted/written/directed movie 2 watch as you never know what 2 expect throguhout this movie........i think that this is such a really well acted movie 2 watch......i think that this is such a really powerful drama movie 2 watch....i think that helena bonham carter was brilliant thorughout this movie.......i think that this is such a really well written movie 2 watch its got a great cast throughout this movie.....i think that claire bloom was brilliant thorughout this movie.......i think that this is such a really well written/acted/directed movie 2 watch......its got a great cast throughout this movie.......its got a good soundtrack throughout this movie.....i think that this is such a really powerful drama movie 2 watch its got a great cast throughout this movie.......i think that colin firth was brilliant thorughout this movie as the lead role......i think that this is a brilliant movie for 2010 its got a great cast throguhout this movie......i think that this is such a really powerful drama movie 2 watch its got a great cast throughout this movie.......i think that this is such a really enjoyable movie 2 watch its got a good soundtrack throughout this movie its such a brilliant movie 2 watch its got a great cast throughout this movie.....i think that this is a really well directed movie 2 watch its such a brilliant movie 2 watch its such a great drama movie 2 watch with a great cast throughout this movie its so really well directed movie 2 watch its such a brilliant movie 2 watch with a great cast throguhout this movie its such a brilliant movie 2 watch",
            "review_date": "2014-01-04",
            "source": "rt"
        },
        {
            "content": "Good movie but there were better movies to win best picture than this.",
            "review_date": "2014-01-03",
            "source": "rt"
        },
        {
            "content": "I cannot believe rotten tomatoes gave this the review they did. Of all the events happening during world war 2, this has to be the most insignificant achievement of any man, woman, or child involved in the war. The character played by Colin Firth seems overly self-absorbed and absolutely out of touch with the events of world war 2 and seems to value his minor role over the lives of millions. He seemed ambivalent towards the horrors that occurred during this time, yet seemed to focus all of his time and attention towards a \"speech impediment\" that somehow, in his mind, drastically effected the allied forces and their overall achivements. The speech at the end of this film, which was the pinnacle achievement of Colin Firth's character,  played no part in the resoltion of the war and was an overrated promenade of a marginally important charater in the largest world that the earth has ever known.",
            "review_date": "2014-01-02",
            "source": "rt"
        },
        {
            "content": "The King's Speech is artistically shot, as well as authentically relevant, and filled with fine performances all around.",
            "review_date": "2014-01-01",
            "source": "rt"
        },
        {
            "content": "Many will dismiss it as \"boring\" but The King Speech is a prevalent, very well acted film that's emotionally charged and well directed.",
            "review_date": "2013-12-31",
            "source": "rt"
        },
        {
            "content": "Loved it! Colin Firth was amazing in the role",
            "review_date": "2013-12-30",
            "source": "rt"
        },
        {
            "content": "Colin Firth una sorpresa e Geoffrey Rush una conferma. Ottimo film, bellissime ricostruzioni degli ambienti. Come si dice: \"da vedere\"",
            "review_date": "2013-12-27",
            "source": "rt"
        },
        {
            "content": "A movie about rhetoric, which contain a compelling, nuanced story. The script was well crafted and the cast were equally excellent. Colin Firth had an interesting character development, occasionally overdone on performance. Likewise a very stylish movie that have good class in camera view, scene display and overall design.  On the downside it was struck by mediocre pacing and easy prediction.",
            "review_date": "2013-12-26",
            "source": "rt"
        },
        {
            "content": "true story, and great acting from long ago.",
            "review_date": "2013-12-25",
            "source": "rt"
        },
        {
            "content": "Best Picture...? Seriously...?",
            "review_date": "2013-12-24",
            "source": "rt"
        },
        {
            "content": "It's fantastically well acted, with British thesp Colin Firth giving an immaculate performance that elevates the movie beyond it's predictable trappings.",
            "review_date": "2013-12-22",
            "source": "rt"
        },
        {
            "content": "Grandisima Película!",
            "review_date": "2013-12-13",
            "source": "rt"
        },
        {
            "content": "A beautiful film based on a true story of one man trying to overcome his personal demons. AAW GGN 1001. M",
            "review_date": "2013-12-12",
            "source": "rt"
        },
        {
            "content": "I feel like this film was really overrated. I just didn't get what all the fuss was about. It was ok I guess. I wasn't particularly moved by anything.",
            "review_date": "2013-12-10",
            "source": "rt"
        },
        {
            "content": "Well done! Love Geoffrey Rush.",
            "review_date": "2013-12-08",
            "source": "rt"
        },
        {
            "content": "Masterfully directed and excellently acted, The King's Speech is an entertaining and moving film.",
            "review_date": "2013-12-07",
            "source": "rt"
        },
        {
            "content": "I just liked listening to his stutter.",
            "review_date": "2013-12-01",
            "source": "rt"
        },
        {
            "content": "With a powerful true story, a well-done script written by Oscar-winning screenwriter David Seidler, an amazing cast headed by Oscar winner Colin Firth, Academy Award winner Geoffrey Rush and Oscar nominee Helena Bonham Carter, incredible directing by Oscar-winning director Tom Hooper, and a slow but okay pace and flow, The King's Speech is worth seeing thanks to fantastic performances by its cast and to its interesting historical accuracy.",
            "review_date": "2013-11-29",
            "source": "rt"
        },
        {
            "content": "Overall, Collin Firth executed his role to his utmost. He spoke exactly the same as King George VI did when he was alive. Outstanding film.",
            "review_date": "2013-11-28",
            "source": "rt"
        },
        {
            "content": "As a child, I had mild-dyslexia which is a difficulty in reading fluently with accurate comprehension despite normal or above normal intelligence. It will also cause anyone with it to forget certain phrases and it will make that person stutter when they talk. When I had it, I would say words a little differently. Instead of saying the word \"cozy\" I said \"zocy\" or instead of saying the word sofa, I said \"fosa.\" I would just mix up the letters of certain words around. I would stammer when I speak to others about...whatever. Thankfully, I don't have it anymore. I tried so hard to forget about that life I had when I was just kid. Then I saw the King's Speech...wow. This movie, in away, reminded me a lot of myself. When I started watching this movie, I felt bad for the main character. When I finished watching the movie, I had tears of joy for the main character because he reminded me of myself when I was younger. \n\tThe King's Speech is the true story about King Georgia VI also called Albert Fredrick Arthur George or Bertie for short, which had speech impediment. He would always be made fun of due to his stammering. He was be called B-B-Bertie by his brother. One of his bothers died due to epilepsy. He pretty much had a horrible royal life. So, he seeks helps from a speech therapist, Lionel Logue, who happens to be Australian. He uses all of these interesting methods to help. These two had their differences. They point out that they had their flaws and yet they worked together till the very end. Not only Lionel was Bertie's speech therapist, but his best friend.\n\tThis film made me cry. Not just for reminding me of what I was when I was a child, but of how masterful the film is. The performances were so solid that it makes you believe that you are among the citizens of Britain. Colin Firth and Geoffrey Rush made sure that their roles were believable and they were believable. They had an believable chemistry. They had their laughs, they had their fights, and they made me believe that they weren't going to stay away from each other because of their believable friendship. The setting was also believable as well. I felt that I was actually part of this era. Using the modern looking shots really helped make the believability of this movie work. The director, Tom Hooper, did a wonderful job in making this movie so believable. \n\tI don't remember any movie that reminded me of my dark past like this one did to me. This film was well acted, well filmed, well directed, and really well told. The story of the King's Speech, despite it being based off a true event in history, was just genius. This film, in fact, deserved the amount of awards it earned with it was released. I really hope that there is another soul with a/had a similar issue was impacted by this movie. This film earns a 5/5 star rating from me.Go check this movie out, it is on Netflix, trust me...you won't regret watching this movie at all.",
            "review_date": "2013-11-25",
            "source": "rt"
        },
        {
            "content": "A solid film, if not the Best Picture of the year.",
            "review_date": "2013-11-24",
            "source": "rt"
        },
        {
            "content": "A study in impeccable acting, by Colin Firth. 5/5 And yes, the movie is an uplifting bio-pic set with amazing precision, but man.... Colin Firth. What a performance.",
            "review_date": "2013-11-18",
            "source": "rt"
        },
        {
            "content": "Esta pelÃ­cula es simplemente genial!!! La vi con mi novia y me encanto!!! 200% recomendada!!!",
            "review_date": "2013-11-18",
            "source": "rt"
        },
        {
            "content": "A MAGNIFICENT  PERFORMANCE BY COLIN FIRTH, ALSO ITS AMAZING STORY\nBASED ON LIFE OF THE KING OF ENGLAND GEORGE THE SIXTH UPON THE WW2.",
            "review_date": "2013-11-15",
            "source": "rt"
        },
        {
            "content": "Colin Firth may have given the best performance of all time here.",
            "review_date": "2013-11-14",
            "source": "rt"
        },
        {
            "content": "An awesome movie! I cant believe it took me this long to finally see it!",
            "review_date": "2013-11-08",
            "source": "rt"
        },
        {
            "content": "Within the limits of its middlebrow aspirations, this inspirational formula film about King George VI and his speech therapist delivers the goods. Enjoyable as a kind of upper-class version of Rocky.",
            "review_date": "2013-11-05",
            "source": "rt"
        },
        {
            "content": "based on true story movie. this movie about King Geoge VI father from Queen Elizabeth. outstanding performances by Colin Firth. full of dedication and totality from him made this movie won for Oscar 2011.",
            "review_date": "2013-11-05",
            "source": "rt"
        },
        {
            "content": "La premisa de la que parte no me atraía demasiado y no tenía mucha ganas de verla, pero ahora que la he visto puedo decir que es lo suficientemente entretenida para que merezca la pena ser vista",
            "review_date": "2013-11-02",
            "source": "rt"
        },
        {
            "content": "Un bon film historique avec un Colin Firth excellent.",
            "review_date": "2013-11-01",
            "source": "rt"
        },
        {
            "content": "Colin Firth and Geoffrey Rush are amazing together. What a great movie!",
            "review_date": "2013-10-31",
            "source": "rt"
        },
        {
            "content": "Phenomenal movie. So we'll acted and a great story to boot.   Can't believe it took me this long to see it.",
            "review_date": "2013-10-29",
            "source": "rt"
        },
        {
            "content": "Very well done. Colin Firth did an amazing job. The movie overall, with everything, was done well.",
            "review_date": "2013-10-27",
            "source": "rt"
        },
        {
            "content": "Masterpiece. What else do I need to say?",
            "review_date": "2013-10-26",
            "source": "rt"
        },
        {
            "content": "Beautiful story, great acting by Colin Firth and Helena Bonham Carter, and the comedic additions are perfectly placed.",
            "review_date": "2013-10-26",
            "source": "rt"
        },
        {
            "content": "With great performances all around this film delivers on a...Taboo social stigma,stuttering, and makes it known and also makes for a moving period drama. \nWatching this film I couldn't help but feel...sorry and sad for Berttie. Him having this speech impediment and then having to address the country at a time of great fear must have been horrible for him. I mean think about it. Here is a man that is suppose to be almost the saviour so to speak of his country but how can someone take him serious if he's stuttering his words? It really makes you sad for the king he's trying so hard but just can't do it. That is until he meets Lionel Logue a speech therapist recommended to him by his wife. Reluctant at first to accept his help the King eventually warms up to Lionel's teachings and the two become the best of friends,Bertie even goes so far as to say that he will not do a speech unless Lionel is there,.\nThe film was amazing and FILLED with great performances from Colin ferths haunting but amazing portrayal as the stammering King and Godfrey Rush as the kings speech therapist that as the film progress you actually believe that these two actors are actually the real life people they're portraying. And when they do scenes that look and possibly sound ridiculous on film,IE the scene where they practice the kings \"Jaw movements\" or having him Swear like a sailor to get everything he's frustrated about in his life out there. Is all believable and makes think \"YEAH he probably did that in real life\" \nAs I said the story is simply amazing and really,for me, entertaining and almost sad. Like I said watching the king stutter really makes you feel sorry for him and then to watch his one brother make fun of him,who in turn is really the films only antagonist, makes you really want to say \"YOU BASTARD. Leave him alone.\" during the film. Actually there where times in the film I was actually YELLING at my TV because the brother was so mean and hurtful to his brother. I just couldn't believe it \"THAT'S YOUR ON BROTHER HOW COULD YOU SAY THOSE THINGS TO HIM\" was literally what I yelled at my TV. I've honestly NEVER had that happened to me before while watching a film.\n\nIn closing this film is great it won the academy award in 2010 for best picture and it DEF. Deserved it. I honestly couldn't find any real lows in the film. And applaud the film for tackling a thing like speech impediment the way it did.",
            "review_date": "2013-10-26",
            "source": "rt"
        },
        {
            "content": "The importance of the story, camera skills ... before I say this all actors want to express reverence for. Geoffrey Rush and Helena Bonham Carter's acting is fantastic. And brilliant acting of Colin Firth. Their awe the audience with his performance evokes. Dull story that problem, but only with the actors' performances, the film is worth it. The highest point of the act. Beethoven's Symphony No. 7 harmony, particularly that last scene evokes the ultimate shive.",
            "review_date": "2013-10-22",
            "source": "rt"
        },
        {
            "content": "although it may be a slow movie, the phenomenal acting makes up for it as I can't really find any flaws in the movie, with a little humor and enthralling and entertaining drama,its a great movie",
            "review_date": "2013-10-17",
            "source": "rt"
        },
        {
            "content": "Largely thanks to a brilliant performance from Colin Firth, The King's Speech is an inspiring, heartfelt, amiable drama that, despite being predictable, is able to thoroughly entertain.",
            "review_date": "2013-10-13",
            "source": "rt"
        },
        {
            "content": "A splendid piece of script-writing.",
            "review_date": "2013-10-08",
            "source": "rt"
        },
        {
            "content": "What a wonderful real life based movie, a real peace of art! All actors gave great  performances, specially Colin Firth, Geoffrey Rush, Guy Pearce and Helena Bonham Carter. This movie, well, King George VI story got to me, since we share having speech impediment. Since I was a little kid, I have always had speech impediments,  trouble pronunciating some words. (My first language is spanish. But I feel more comfortable speaking in english). Also I speak with nasal pronunciation. And sometimes my words get tangled, and if I speak fast, probably you won't understand me.  When I speak in english, some people say I sound like Fez from That 70's Show, lol. What helped me control my speech impediments and speak better was theater and it's diction exercises. When I'm acting (I Love Acting) my friends say I sound perfect, like if I didn't have any speech problems. And my brother is a stutterer. So we both know how it feels to have a speech impediment and fear of public speaking. But we both achieved to control it (it's not all gone). I just realized I'm a contradiction. I'm an actor with speech impediment and fear of public speaking. LOL",
            "review_date": "2013-09-29",
            "source": "rt"
        },
        {
            "content": "The subject matter is just so mediocre and the development of the story was so predictable. One may want to share this film with the grandmother next door.",
            "review_date": "2013-09-24",
            "source": "rt"
        },
        {
            "content": "The King's Speech tells the story of King George VI (Colin Firth) overcoming his stutter in order to deliver a speech to the United Kingdom declaring they were going to war with Germany in 1939. To do this he has to work with vocal coach and therapist Lionel Logue (Geoffrey Rush) who pushes George's voice to do what he feels is impossible.\n\nThings I Liked:\n\nColin Firth. Firth plays George and does so remarkably. You really feel as though he himself is fighting the stutter. He does all of the vocal work so naturally and plays the character in a very simple and elegant way. He really carries the film well and gives a remarkable performance.\n\nGeoffrey Rush. Rush plays Lionel Logue, George's vocal coach, in a way that reminds you how good Rush really is. He has a great sense of patience, charm, cleverness, and you again don't get the sense that he is playing a character. He seems so natural and it really makes the work Firth does better with their chemistry.\n\nThe Tone. The film has a some incredibly serious moments but it also has moments of humor that really fit in with the film and make the film better as a result. The movie never gets to the point where you feel it could fall apart and it keeps the movie moving forward, which is good because movies about personal growth can be very stagnant.\n\nThings I Didn't Like:\n\nThe Length. The movie is really slow in points and really long. The movie has a very simple plot and doesn't move very far from the first point to the final point. So the movie has moments that drag and make it feel incredibly long. The plot itself isn't the most interesting overall to begin with so there are points where you really want the movie to move forward when it simply won't.\n\nOverall. Overall the performances carry this movie. Firth and Rush shine and make the movie with their chemistry and their work with the rest of the supporting players. The plot is very simple and the story doesn't go too far in the end so this causes the movie to drag in places and feel longer than in needs to be but the actors really make the movie watchable and the tone of the film uses humor to keep the action much more interesting. It's a very well crafted and well performed movie.",
            "review_date": "2013-09-24",
            "source": "rt"
        },
        {
            "content": "This Film Is Quit Good, But It's Overrated For Me !!",
            "review_date": "2013-09-22",
            "source": "rt"
        },
        {
            "content": "/10\nActing - 9.5\nWriting - 9.5\nDialogue - 9.5\nPlot & Characterization - 9.5\nCinematography & Editing - 9\nSoundtrack/Score & Set Design - 9.5\nHow much I enjoyed it personally - 9",
            "review_date": "2013-09-20",
            "source": "rt"
        },
        {
            "content": "Perfection at 24 fps. Enough said",
            "review_date": "2013-09-17",
            "source": "rt"
        },
        {
            "content": "Slow moving but good story.",
            "review_date": "2013-09-10",
            "source": "rt"
        },
        {
            "content": "A lo mejor en un futuro, cuando vea 'El discurso del rey' en mejores condiciones (hoy me dolía la cabeza), reconsidere mi opinión de que me parece una peli sobrevalorada. Está bien, pero no para tanto. Sobre todo si la comparo con las otras candidatas a mejor película de 2011, ya que al menos cuento 4 o 5 superiores. Eso sí, al César lo que es del César, Colin Firth está genial.",
            "review_date": "2013-09-08",
            "source": "rt"
        },
        {
            "content": "Be forewarned: since this film has already been out for almost three years, this will be a spoiler review, dissecting specific elements of its content.  \n\n        First off, The King's Speech really is one of those films you truly appreciate on a second viewing.  Its impeccable acting, witty writing, and thematic material strongly shine through when you're viewing it for further analysis.  Now, I had a difficult time accepting the film as \"Best Picture Winner\" the first time around because although its story and acting definitely sparked its quality, it wasn't the heavily-hyped movie I fully expected.  However, this time around, as I watched the film, I could spot so many elements that indicated its overall terrific quality in the end.  So, where do we start?  \n\n        Firstly, its most noticeably excellent aspect is the acting as Colin Firth and Geoffrey Rush convey their respective characters exceptionally.  Colin Firth's performance as a flawed, stammering member of royalty caused me to respect the actor that much more.  As his struggle progressed, I could clearly witness the frustration and hopelessness on his face as \"Bertie\" (Colin Firth) attempted to cite plays and various speeches.  His portrayal of a man with a speech impediment was incredibly authentic, and the way he constantly faltered in his conversations and addresses ultimately led to an unforgettable performance that was rightfully granted an Oscar.  Then, there was Geoffrey Rush (Lionel) who took on the role of a charming and clever \"common man.\"  \n\n         In this case, The King's Speech was also able to include astonishingly colorful, distinctive, and likable characters that you simply couldn't cease rooting for.  At first, it might've seemed as if Bertie was yet another wealthy, spoiled jerk, but the relationship between Lionel and this man of royalty essentially commenced in such realistic and believable fashion.  Their argumentative and stubborn relationship proceeds throughout the whole film where at one moment, Bertie feels that he's terribly close to his goal, but then something completely unexpected occurs and the realization of where he still remains leads into another struggle with his mentor.  Once the story concludes, not only is Bertie's family, mentor, and fellow colleagues proud of his accomplishment(s), but the audience can't help but crack a wide smile as well.  What surely causes such a scene is the film's wonderful build-up through its tremendous ability of characters and story development. \n\n          As I've previously mentioned, the script is extraordinarily witty and enthralling.  \"Do you know any jokes?\"  \"...Timing isn't my strong suit.\"  Those two lines, alone, showcase just how pleasant the dialogue can be.  His response is a joke, in and of itself, along with its delayed timing.  In terms of its story and strong, resonant themes, the movie is highly inspirational as well.  The fact that he has a severe speech impediment and is expected to speak in front of millions of people could be one of the scariest activities to partake in, but this shows the viewers that while you're desperately trying to overcome your fears, it basically can't be that bad for there's always someone dealing with something far worse.  Courage is a monumental feat everyone must, with numerous challenges/obstacles, obtain.  This element certainly resonated with me because I, along with many other people, possess (or, at least, once possessed) fears of public speaking to the point of anxiety. \n \n         In addition, there are several, if not more, other themes throughout, such as the questioning of love/marriage vs. duty.  You have Bertie's brother, David, form issues with Parliament and his process of becoming king as he decides to marry a twice-divorced woman by the name of Wallis Simpson, and it's this struggle that continues where David has to permanently choose between his wife and love or the throne itself, and in the end, he sacrifices his duty as a royal member in order to pursue his romantic relationship with his one true love.  Then, there's another fascinating scene where Bertie's two daughters first sight him in his royal clothing, and for a moment, they're bent on approaching him to hug and kiss, but in a split second, they're now hesitant.  Instead, they decide to bow and address their own father as the king, and you see this distance between the daughters and their father as the greatest representation of how far one must go in pursuing their careers- their own duties- if it means compromising extremely significant relationships in the meantime.  \n\n           Another special triumph of the film is its historical accuracy.  You're informed of the coming war as Hitler's rise progresses throughout the story until finally, it all leads to a climax and interconnects with Bertie's arc, requiring him to deliver a speech and conclusively address this current crisis.  You also see important figures like Winston Churchill and Queen Elizabeth appear during the movie's duration.  Now, I'm not a history buff or anything, but from what I've learned of it, the film did justice to Britain's history.\n\n          The King's Speech also contains a great level of authenticity and realism that's usually unseen in inspirational and motivational films.  The movie tries hard to tone down the cheesiness, and it does it fairly well.  For example, instead of going the \"typical Hollywood\" route and have Bertie deliver the speech perfectly at the end- of course depicting his final step in the struggle- he still continues the speech by occasionally stammering or pausing between words, and this largely contributes to the film's overall realism and believability.  In fact, there's a surely grand scene towards the end when Bertie is difficultly delivering his motivational speech; while he's struggling with one gigantic issue (his speech impediment), there's another colossal issue with Britain being on the brink of war, and this is followed with amazing shots of the hard times Britain is about to face with soldiers readying themselves and troubled England awaiting the war while a strong, epic soundtrack complements it.    \n\n          Finally, I'd like to take a minute to mention the cinematography as well.  There's an interesting shot later in the film where Bertie is walking away from Lionel due to a disagreement, and as Bertie walks towards the screen, Lionel can be seen in the back with the fog of the park slowly fading his figure with the camera telling its audience that this soon-to-be king is leaving his one friend behind.  Afterwards, proceeding the scene of Bertie's address to his country, Bertie is seen preparing for the speech in the small room where he'll be speaking, and it shows an extreme close-up of his face as if to show the excessive amount of pressure on him.  It even appears like he can't breathe with the small space he's allowed.  There were several other intriguing shots such as these throughout the film.  There's just so much to say about The King's Speech, but after all's been said and done, although it's a tad predictable, it's still a wondrously-crafted film that definitely carries substantial depth.",
            "review_date": "2013-09-04",
            "source": "rt"
        },
        {
            "content": "Best night of my life.",
            "review_date": "2013-09-04",
            "source": "rt"
        },
        {
            "content": "''Masterpiece.'' One of the Best performance by an actor of 2010. Masterfully directed and Masterfully acted by its cast. It deserves the Best Picture on the 2011 Academy Awards.",
            "review_date": "2013-09-02",
            "source": "rt"
        },
        {
            "content": "Superb performances from everyone. A remarkable film that deserves every award it received.",
            "review_date": "2013-08-31",
            "source": "rt"
        },
        {
            "content": "A good movie. Colin Firth gives a masterful performance.",
            "review_date": "2013-08-24",
            "source": "rt"
        },
        {
            "content": "A lot of people hate me for this, but in all honesty I just found this film bland, and I guess Helena Bonham Carter's Oscar nomination was just a career award because while she's generally a very good actress, she is treated more as an extra here.",
            "review_date": "2013-08-23",
            "source": "rt"
        },
        {
            "content": "The King's Speech is perfect.",
            "review_date": "2013-08-20",
            "source": "rt"
        },
        {
            "content": "Great And Very Interesting Film. One For The Ages.",
            "review_date": "2013-08-19",
            "source": "rt"
        },
        {
            "content": "Colin Firth deserved this Oscar. A great account of the last king of England's handicap that he eventually overcomes.",
            "review_date": "2013-08-15",
            "source": "rt"
        },
        {
            "content": "The Duke Of York hires an unconventional speech therapist when faced with Royal duties in the burgeoning media age to help him with a stammer that prevents his public speaking. The premise behind The King's Speech is a rather dry one and the trailers themselves make it seem to be a cross between The Madness Of King George and Pygmalion, but thanks to some winning performances and an interesting script portraying a behind the scenes window onto recent history it transcends the traditional comedy of manners formula that nearly all British films seem obliged to follow. Colin Firth's portrayal of a man thrust into the public eye by events beyond his control is sublime and it's fascinating to see a snapshot of the man behind a public face completely controlled by propriety and social convention. There's a real warmth in his unlikely friendship with a brewer's son from Australia and the gentle humour and subtle direction makes a very refreshing change from the ADHD firework displays that seem to make up the vast majority of modern cinema. Maybe not the masterpiece its multi-award winning reputation suggests, but a quality cast and sensitive storytelling make for a fine lightly comic and insightful historical character study.",
            "review_date": "2013-08-13",
            "source": "rt"
        },
        {
            "content": "Collin  Firth was sensational and got him the Oscar for this movie which was at times slow but had you rooting for him and his speech disability the whole time.",
            "review_date": "2013-08-11",
            "source": "rt"
        },
        {
            "content": "Geoffrey and Colin and even Helena were outstanding and very believable in all their roles. I laughed, cried and was spellbound by this great film and I wish I had seen this on the big screen. Guy needs a mention too- when he tried to hug his mother after his father, The King died, that was so moving and yet broke my heart too. Worth a watch or 3.",
            "review_date": "2013-08-11",
            "source": "rt"
        }
    ]
}