{
    "rating": 9.0,
    "release_date": "1975-12-17",
    "num_reviews": 110,
    "genres": [
        "Adventure",
        "Action"
    ],
    "summary": "Based on a short story by Rudyard Kipling, this adventure film follows the exploits of Peachy Carnehan (Michael Caine) and Danny Dravot (Sean Connery), English military officers stationed in India. Tired of life as soldiers, the two travel to the isolated land of Kafiristan, where they are ultimately embraced by the people and revered as rulers. After a series of misunderstandings, the natives come to believe that Dravot is a god, but he and Carnehan can't keep up their deception forever.",
    "reviews": [
        {
            "content": "Michael Caine, Sean Connery, and Christopher Plummer. It's a trifecta of silver-haired British actors before most of them had silver hair. \n\nRudyard Kipling hasn't really aged very well as an author, when some of his best-known stories focus on Westerners going out to exotic foreign lands full of simple-minded peoples with a bit of conquering in mind (this is the author of The White Man's Burden, after all), but The Man Who Would Be King is more a testament to the poet's undeniable skill as a storyteller and the spirit of grand adventure that set the imaginations of young boys on fire. A long-simmering project that director John Huston had been after for decades and commonly considered his last great film, the story pairs Connery and Caine as a pair of semi-retired British army regulars with a penchant for grand journeys, less-than-ironclad morals, and great chemistry in their friendship (the film is as much a buddy comedy as anything else); Plummer bookends the film as a fictionalized version of Kipling himself, listening to the story as it is recounted. The pair make a treacherous journey to Kafiristan, an ancient land with a more primitive way of life, and quickly find that their training and rifles plus a convenient prophecy regarding the return of Alexander the Great offer an opportunity for godhood. It's only bad luck and a bit of greed that can undo the good fortune of the conquerors.\n\nBeautifully shot on-location, the film is a marvel of production design that brings to life all the tropes and assumptions about life in England's interpretation of the exotic Orient - primitive cultures, ancient rites, massive treasures, and busy bazaars. Both Connery and Caine commented that it was their favorite film to produce, and that comes through in their performances - both bubbling with energy and the spirit of discovery, which only makes their ultimate fate all the more tragic, particularly given the exceptional depth given to developing the friendship of these not-so-upright men. The execution really does smooth over problems with the source material, even though the story probably wouldn't be touched by a major studio these days thanks to the broad strokes of the story beats; but that's okay, this version is a perfect look at the material through the eyes of a veteran filmmaker that too many had thought was past his prime. (3.5/5)",
            "review_date": "2023-02-11",
            "source": "rt"
        },
        {
            "content": "This is simply of of the best movies I've ever seen.",
            "review_date": "2023-02-07",
            "source": "rt"
        },
        {
            "content": "I've watched it every year, at least once a year since the early 80's. By far, my favorite movie of all time despite the poor sound quality (and is why Michael Caine did not want it released to VHS...almost as bad on DVD). 3 of my all time favorite actors ...well make that 4 because this movie (and subsequently, Ghandi) made me a fan of Saeed Jaffery.\nJohn Huston put on a spectacular tale.\nSeveral years ago, I had a chance to attend a talk given by Christopher Plummer....who clearly didn't appreciate all the attention from his great body of work being given to his one most famous (and least-liked) role -which there's is no need to name here.\nI had read his autobiography, and had hoped to have him sign it after his talk. If I had a chance to, I thought I'd tell him that I think he mixed up the characters of Danny and Peachy in one paragraph - but probably wouldn't. \nWhen it was my turn to have my book signed, he was about to scribble his name, without even looking up at me, until I said The Man Who Would Be King was my favorite movie of all, and how great his acting was. Then he looked up at me and asked for my name, repeating it 3x's after I told him. While writing, he said, \"yes, it was a great movie\" and I replied, \"it still is\".",
            "review_date": "2022-12-23",
            "source": "rt"
        },
        {
            "content": "The greatest 02 hours: and 09 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-08-04",
            "source": "rt"
        },
        {
            "content": "If you are a Freemason, you need to watch this one!",
            "review_date": "2022-02-08",
            "source": "rt"
        },
        {
            "content": "This movie is such a great adventure film! One of Michael Caine's best!",
            "review_date": "2021-11-11",
            "source": "rt"
        },
        {
            "content": "One of the best movies of all time.  That is all.  Perfect",
            "review_date": "2021-08-28",
            "source": "rt"
        },
        {
            "content": "Classic John Huston epic!\n\nJohn Huston's epic adventure-comedy The Man Who Would Be King (1975) is an all timer with a grand scale and intimate dramatic performances. John Huston seems to revisit his Treasure of the Sierra Madre days with this old adventure classic, while clearly influencing Dreamworks for their delightful adventure-comedy musical The Road to El-Dorado beat for beat. \n\nFrom the man who reinvented the film noir genre as well as the adventure genre, The Man Who Would Be King is a splendidly entertaining picture with scores of extras and massive sets. The camels, goats, and mules are outnumbered by all the Moroccan actors in the vast deserts there as Huston filmed a believable odyssey through Afghanistan. I think John Huston's screenplay is brilliant and strikingly adapts Rudyard Kipling's original story, while conveying his parable theme of greed destroying men without morals.\n\nSean Connery is very funny as this stout Scottish conman Daniel Dravot, especially alongside the ever hilarious and engaging Englishman Michael Caine as Peachy Carnehan. Their chemistry has perfect comedic timing and a natural charm. You are so engrossed by their banter and comradery, that you're always in on their devious scheme to rip off an entire nation. You always know and acknowledge that these two lead actors are the villains of the story and the innocent civilians suffer because of them. \n\nChristopher Plummer's stunning portrayal of Rudyard Kipling is neat as he cheerily opens the picture with freemasonry and an intrigued curiosity over Caine's narration. It's Plummer's horrified and astounded face of shock in the end that seals the deal and ensures The Man Who Would Be King is forever an impactful classic.\n\nSaeed Jaffrey is excellent and very funny as the translator Billy Fish, who loyally fights alongside Sean Connery and Michael Caine. Notably, Michael Caine's real life wife Shakira Caine portrays the Afghani beauty Roxanne. She doesn't get much to say, but her character is surely important.\n\nIn conclusion, John Huston directed his massive adventure feature The Man Who Would Be King with a reverence for the sacred and a joy in the irreverent. His good humor and stark morality frames the film with stellar filmmaking, while Connery and Caine delight you.",
            "review_date": "2021-06-24",
            "source": "rt"
        },
        {
            "content": "A classic and an all time favourite. They really don't make them like this any more.",
            "review_date": "2021-06-16",
            "source": "rt"
        },
        {
            "content": "I just don't understand why other people enjoy this movie. The characters are trash white colonialists, the script is bad, the acting was medicore?, the representations of other cultures weird/predictable and it is SO LONG. SO. LONG.",
            "review_date": "2021-06-13",
            "source": "rt"
        },
        {
            "content": "They had me at Caine and Connery so the stirring cinematography that highlights the natural beauty of the landscapes was just an added bonus.\n\nI was unfamiliar with the Kipling work so had zero expectations coming in and at first was confused at what felt slightly like a celebration of imperialism. There were times when the dialogue even made me laugh, even though I wasn't sure if it was intended to. Once I got deeper into the film I began to appreciate it more as I realized where we were headed and the important message Kipling was conveying.",
            "review_date": "2021-06-11",
            "source": "rt"
        },
        {
            "content": "Probably the best movie the pair of them ever made. Still makes me laugh to this day. 3 of them sadly departed (  saeed_jaffrey inclusive ), but this will be their testimony. Interesting fact : the character \"Roxanne\" was Lady Shakira Caine who caught the eye of \"Danny\" in the movie.",
            "review_date": "2021-03-05",
            "source": "rt"
        },
        {
            "content": "Entertaining film by John Huston with great performances by Sean Connery, Michael Caine, and Christopher Plummer",
            "review_date": "2021-02-11",
            "source": "rt"
        },
        {
            "content": "Its a long film but worth it. The actual underlying story is really good although I have no idea how close it it so the book. Great on location filming. Sean and Michael work well together.",
            "review_date": "2021-02-02",
            "source": "rt"
        },
        {
            "content": "Easily one of Huston's best movies. I tend to think the narrative sort of lulls you into thinking it is a certain kind of 19th century swashbuckling adventure, only to wind up as a cautionary tale. The story ends horribly for the two central characters because of course it does.",
            "review_date": "2021-01-21",
            "source": "rt"
        },
        {
            "content": "The late Sean Connery, Michael Caine, and Christopher Plummer.\nBased on the 1888 novella by Rudyard Kipling directed by one of Hollywood's most celebrated filmmakers, John Huston and nominated for 4 Oscars.\nA strange looking man appears at Rudyard Kipling's office and tells the tale of the man who would be king via flashback.\nTwo men, Carnehan and Dravot are military officers in India, they've become sick of their statuses. Thanks to Rudyard Kipling corresponding to a newspaper he grants them a map to leave and it provides the movie's symbolism.\nOne day they both stumble upon a village in Kafiristan who mistake them for kings. They decide to play along since it's the less-stressful role than what they're normally doing, it's a new land of opportunity so to speak to enjoy the worship, the wealth, the hospitality.\nThey even teach the natives to fight to fend off their enemies but how long can they keep up the illusion? It gets to a point where one of them is believed to be a god before it gets out of hand; certain things to abide by such as not making love to a woman or not accepting any more hospitalities until all enemies are crushed.\nThis is actually a nice buddy adventure movie; two of the best actors of their generation in an exotic part of the world interacting with one another naturally.\nConnery in particular isn't afraid to get down and dirty for this particular war, he reveled playing the occasional anti hero. With this he's a not so bright, morally flawed individual and the conviction he has being a higher authority has a deep voice. He assumes his mantle as one of the great rulers of the past taking the deity role literally. \nHe and Caine bring an amount of amused cynicism with charisma. \nThe characters laugh at the messes they make since nothing else matters.\nBoth these men are under the impression that they can find a kingdom not yet touched by civilization which can be easily taken over.\nThe movie tells the story of bad men held accountable to the indigenous people they encounter, it's not that you hate these two for what they're doing you're actually enjoying their misfortune given their self-ascribed superiority and racist attitudes.\nEverything from power, greed, war, false worship, and manifest destiny of entitled Europeans while lampooning the superiority of British colonialism. \nNo one man can be king, no single government can rule, would you rather follow a god or blind luck?, is the ruling more important than the friendship?\nSome might take the ending as fake feminism considering how it plays out but it's still tragic nonetheless.\nTwo of the classiest actors around strengthen the plot making a wild ride, a simple script that works, you feel the dangerous trek of their journey across the mountain peaks and glaciers, and it shows the gravity of a con of how long it can go for. Some ominous foreshadowing at the beginning too that ties it all back. \nEven individuals like these two can have weaknesses leading to their downfalls but they can still have each other.\nOne of Connery and Caine's finer outings.",
            "review_date": "2020-12-18",
            "source": "rt"
        },
        {
            "content": "Whilst Connery plays King, the real star of the show is Caine. Some of the dry one liners are superb. It's a comic, thriller epic and it's brilliantly put together. Pretty much of its time but also a great little boys own adventure that swings from the absurd to the hilarious. One for Kipling to enjoy.",
            "review_date": "2020-09-07",
            "source": "rt"
        },
        {
            "content": "One of the best adventure movies ever made, with the wonderful combo of Sean Connery and Michael Caine and a story by Kipling. How could you go wrong?",
            "review_date": "2020-04-03",
            "source": "rt"
        },
        {
            "content": "Sean Connery and Michael Caine star in excellent adventure drama set in Afghanistan. Worth seeing again, these actors were in their prime.",
            "review_date": "2020-01-29",
            "source": "rt"
        },
        {
            "content": "A must watch if you enjoy mega movies.  Can't say much without spoiling. Wide screen and surround sound if available is the way to go.  See for yourself.  Huston at his best.   (believe I know a VC winner from that time.  got lost somewhere)  Final music says it all.  A classic with romantic (sic) history for all.  Leave it there and love this pic",
            "review_date": "2020-01-07",
            "source": "rt"
        },
        {
            "content": "This is a very British film. And I like it. Good acting as expected from Sir Michael Cain and Sean Connery. These men should be Kings. They are two soldiers who have done alot... now they want a piece of there own. They've earned it. It's an underrated classic. Give it a watch.",
            "review_date": "2019-12-02",
            "source": "rt"
        },
        {
            "content": "A fun, comedic, adventure movie with two great performances by the legendary Michael Caine and Sean Connery. A must watch for any fan of the pair or if you just want to see a quality adventure film.",
            "review_date": "2019-10-04",
            "source": "rt"
        },
        {
            "content": "Alas, poor Kipling.  Poor England.    Many of Kipling's stories were racist, brutal, and imperialistic, and this is one of the worst by  today's  politically correct standards.    The scene where the Indian scribe is thrown off of a moving train comes to mind.   Parental guidance is suggested.    Still, if you want to understand the values and attitudes that created European imperialism, this is a damned good movie.",
            "review_date": "2019-09-28",
            "source": "rt"
        },
        {
            "content": "The best, GREATEST epic movie ever made!",
            "review_date": "2019-02-01",
            "source": "rt"
        },
        {
            "content": "If you have'nt seen this watch it now.",
            "review_date": "2019-01-28",
            "source": "rt"
        },
        {
            "content": "The acting is what elevates The Man Who Would Be King into something greater than it would be otherwise. Michael Caine and Sean Connery are charming guys, and their portrayal of these two con artists is endearing despite their conniving personalities. It gets you rooting for them despite the fact that they are constantly taking advantage of the people around them. However, because of their personalities and their track record, I clung onto a false assumption that at some point it would be revealed that the entire story was just deception for Kipling and they were tricking him again. It colored my view of the film a little, but didn’t change how effective it was at showing the adventure of these two men. Also, since I mentioned him, it’s worth pointing out that the amazing Christopher Plummer is also in this film in a minor role as Rudyard Kipling. Of course, he elevates this from being a minor part with his few scenes, and makes me wish he was in the film more. I don’t know if this movie would be as successful without the awesome cast, because they bring a lot to the story. At times I struggled with the motivations in The Man Who Would Be King. It seemed to be such a simple plan, but misguided choices plagued the entire thing. Sean Connery’s character in particular takes an abrupt turn that didn’t fit with the personality they established. If it had been a gradual shift for him then I would understand, but the opportunity to take a massive reward and leave came a bit too early so the decision to stay felt out of place. That doesn’t change how well this film presents the drama, because I was engaged in the story. It didn’t quite hit me on an emotional level, possibly because I was still riding on false assumptions, but I thought it was a good film. It did feel similar to some other films I’ve seen in the past. I assume those would all be copycats, though, since Kipling wrote the story in the late 1800s. The Man Who Would Be King is a solid adventure film, and one that I’d gladly watch again, but with some elements of the ending it was a bit less satisfying than I would like, so I don’t know if I’ll seek it out.",
            "review_date": "2019-01-09",
            "source": "rt"
        },
        {
            "content": "A fantastic adventure film that tingles your inner Anglophile and sense of 19th century adventuring! Led by two of the best old school british actors in Sean Connery and Michael Caine and led by the steady direction of John Huston, this is an all time classic!",
            "review_date": "2018-12-01",
            "source": "rt"
        },
        {
            "content": "Enjoyable romp with humour, action and adventure. Caine and Connery make a charismatic pair.",
            "review_date": "2018-11-18",
            "source": "rt"
        },
        {
            "content": "Nice examination of the way of men in history, with elements of satire and action. Two great actors unfold before us delightful characters entangled in the familiar story of civilized men taking advantage of savages. John Houston is a bit nostalgic, at least that's how I felt, about the more adventurous and courage past, the days of the British empire, not without mocking it, but he does it in an intelligent way, showing the follies of all sides.",
            "review_date": "2018-10-02",
            "source": "rt"
        },
        {
            "content": "Hands down without fail my favourite film of all time",
            "review_date": "2018-04-02",
            "source": "rt"
        },
        {
            "content": "Two scrappy if amoral Brit Adventurers decide to carve out a bit of the third world for themselves (just as they've seen nations, particularly their own, do). They don't make 'em like this anymore, and hence the love this work generates, while it's stars, connery and caine, both sort of embody the last of the era they portray. The story, if slight, is played with heart. And Pith helmets.",
            "review_date": "2018-03-21",
            "source": "rt"
        },
        {
            "content": "As one who is familiar with India its history and military traditions, this is a great portrayal of  past life and times.!",
            "review_date": "2018-01-14",
            "source": "rt"
        },
        {
            "content": "Really amazing to see just how alive and busy that part of India is. So much going on, really bustling city. I didn't even recognize Plummer when I first saw him. He's young in this movie. Already, I'm wondering what the hell happened to Caine's character for him to get all fucked up like that. Masonic symbols, interesting. I find parts of the Indian culture fascinating. Like how raw and chaotic they live in some places. How they can fit an extra hundred group of passengers on the roof of the train when that's so dangerous. Michael Caine's accent is so fucking heavy. God damn. \n\nReally charming to see Michael Caine and Sean Connery together acting like there jokesters. I do have to say, this movie has some jaw dropping locations in India and along the Middle East. Quite a treacherous journey those two went through, but they were prepared. When the preachers passed by right before they were about to fight, that was funny. Pretty crazy how lucky they've gotten with all the predicaments they got themselves into. \n\nWow, he really let the whole being a god/kin thing get to his head. He's ignoring all these signs that are going on around him. Bad things are going to start to happen. It's so chaotic. All the women crying and moaning making weird animalistic noises. In the end they both resorted to committing two sins. One was obsessed with power and the other with greed. In the end, none of them got what they were seeking. That must be so hard to watch your friend dying before your eyes and you can't do anything but just watch. Pretty dark towards the end. Being crucified and all and walking around the desert and mountains with your best friends head in a bag. Christopher Plummer's expression at the end says it all.\n\nThis turned out to be a pretty funny movie. There's a lot of moments in this movie that can be used for sampling in songs, kind of like what Bonobo did. Really great movie with wonderful landscapes and beautiful views of a country I've never heard of. \n\nI'd watch again.",
            "review_date": "2018-01-05",
            "source": "rt"
        },
        {
            "content": "this film was really fun to watch. sean connery is one of the greats",
            "review_date": "2017-11-17",
            "source": "rt"
        },
        {
            "content": "Two self-righteous imperialists cheating, lying and cleansing \"savages\" in their own native land for the emperors glory and heroism.......not much changed in this century either.",
            "review_date": "2017-11-02",
            "source": "rt"
        },
        {
            "content": "Despite being somewhat of a cinephile's wet dream (John Huston, Michael Caine, Sean Connery, Christopher Plummer: together!), The Man Who Would Be King suffers from a highly improvable script, but has an auteuristic beauty that sets it apart from Huston's other films.",
            "review_date": "2017-07-02",
            "source": "rt"
        },
        {
            "content": "Great old fashioned adventure that came in the wrong decade. But thank God it did. Connery and Caine are great. My only reservation comes in some of the storytelling. Caine's accent is so thick at the start that it's hard to decipher exactly what's what. The brief second of the stolen watch at the beginning is so fleeting, it doesnt convey what's happening. Some moments are too comical when it should have stayed dramatic. And what I mean by the wrong decade....this grand adventure would have been far better in classic Hollywood days. I keep picturing how wonderful Cary Grant would have been Peachy, and young James Mason as the forceful crazy Daniel Dravitt. \nBut anyway, the 70's were pretty dry on this sort of thing, and Huston has done a great job. Unforgetable haunting ending. Great flick.",
            "review_date": "2017-05-02",
            "source": "rt"
        },
        {
            "content": "Outstanding movie overall.  The people that don't like it are the ones that need an action movie to keep their attention.",
            "review_date": "2017-03-27",
            "source": "rt"
        },
        {
            "content": "An epic tale of two British soldiers' rise and fall from power in a foreign land.",
            "review_date": "2017-03-04",
            "source": "rt"
        },
        {
            "content": "Huston, Connery and Caine at the apex of their game. An old-fashioned big screen spectacle, with scenes on par with Lawrence of Arabia in scope. When you see the wide pan shot of the marching armies, it's incredible to think these were real people, instead of CGI FX.  A story you can watch over and over, picking up new things with each viewing, and never a wasted second of screen time.",
            "review_date": "2016-12-17",
            "source": "rt"
        },
        {
            "content": "Sean Connery and Michael Caine play a pair of razor-sharp scoundrels, scamming their way through an east Asian joyride during the twilight of the 19th century. On a thoroughly unpredictable adventure, the duo constantly converts lemon to lemonade as they meander from a publisher's office in India to a fictional holy land in the desert. There, intending to conquer a few villages and live the high life, the stakes suddenly spike as they find themselves anointed saviors, kings and (eventually) gods. Connery and Caine, good friends away from the screen, bubble with chemistry throughout. Their relationship is essential, and that obvious bond lifts an already-ambitious screenplay into something greater than the sum of its parts. When viewed with contemporary eyes, the pace is a little slow, akin to similar films of the era, but that deliberate tempo reaps unique rewards. By lingering in the atmosphere and dutifully setting the stage, director John Huston expertly depicts the vast cultural differences between our conniving, almost-modern Brits and the ancient ways of life still at play in turn-of-the-century Asia. A fine example of old-style filmmaking, loaded with snappy humor, surprising plot turns, high stakes and creeping peril.",
            "review_date": "2016-11-23",
            "source": "rt"
        },
        {
            "content": "Simply one of my favourite films of all time, since long before who I knew who John Huston was. It's a beautifully shot film with a compelling story and a brilliant rapport between two perfectly cast stars at the height of their powers (as well as great supporting performance by Christopher Plummer). Looking back, you can see the themes common to so many John Huston films - old fashioned rugged masculinity, obsession, and the corrupting power of riches. It follows Kipling's story quite faithfully and is therefore unabashedly orientalist, representing the worldview of its Victorian British characters (and of its author). It's probably not a film that would get made today, but taken on its own terms, it's a wonderful film.",
            "review_date": "2016-08-10",
            "source": "rt"
        },
        {
            "content": "I had planned on reading the popular book from Kipling but then I stumbled onto the movie. There are many classic adventure books that, after soaring to literary heights, plummeted when daft hands got hold of them and turned them into muddled unimpressive films. But when John Huston gets his hands on something, it will be impressive. However, I won't fawn over this film like the critics have. This epic is more haunting (at its best) and near ridiculous, in most respects, than memorable and moving. It is wrapped nicely though with grand sets, hundreds if not thousands of extras, and everything needed for an adventure; war, treasure, an ancient city, and two bumbling comics with a talent for disruption on a national scale. While I don't consider this a masterpiece, I wanted to watch it because where else do you get to see Michael Caine and Sean Connery fumbling around with swords, costumes, and conquest. I think Huston saw the potential for the grandeur of Kipling's tale but for me, 40 years after its release, there's not much in it that leaves an impression. It isn't a film for modern audiences but a more patient one. It has humor but it also suffers from implausibility and at the end of the day, who cares what happens in this superstitious remote part of the world. Hate to say it, but indifference is what happened. Reflecting, I do see pride becomes the villain and reconciliation is only possible after the truth is set free. While a solid adaptation, it isn't up there with my favorite epics but actually closer to the bottom half of large scale extravaganza that doesn't really leave you with anything.",
            "review_date": "2016-04-17",
            "source": "rt"
        },
        {
            "content": "Great acting, moving and cool characters.",
            "review_date": "2016-02-09",
            "source": "rt"
        },
        {
            "content": "Classic story of adventure that still holds up today, with great acting.",
            "review_date": "2015-11-21",
            "source": "rt"
        },
        {
            "content": "A fascinating story adapted into a mostly well-written screenplay (aside from some holes in the end), as well as perfect lead actors but also some silly film-making choices, make this con-man adventure comedy a minor classic.",
            "review_date": "2015-11-16",
            "source": "rt"
        },
        {
            "content": "Good movie, kinda funny.  Oh!  Michael Caine.  This fantastic movie has a young Michael Caine.  He's an awesome actor, but also hot.  Very hot.",
            "review_date": "2015-11-07",
            "source": "rt"
        },
        {
            "content": "My dad suggested we watch this together. It was a very interesting movie. It didn't conform to the predictable story line, and left me feeling a bit morose, but the cultural exploration and the spirit of the adventurer were depicted well.",
            "review_date": "2015-09-29",
            "source": "rt"
        },
        {
            "content": "Looking at some of the bad reviews of this film, I would say that this is one film that rewards repeated viewings.",
            "review_date": "2015-09-26",
            "source": "rt"
        },
        {
            "content": "Witting dialogue and fine direction with some great battle scenes. It serves to be both a great comedy and adventure film.",
            "review_date": "2015-09-18",
            "source": "rt"
        },
        {
            "content": "Classic action, Kipling story, Connery and Caine.  Superb",
            "review_date": "2015-09-02",
            "source": "rt"
        },
        {
            "content": "Two rogues at they're very best.  Outstanding.",
            "review_date": "2015-07-03",
            "source": "rt"
        },
        {
            "content": "one of my top 22 films",
            "review_date": "2015-05-29",
            "source": "rt"
        },
        {
            "content": "La pelicula de aventuras por excelencia.",
            "review_date": "2015-01-20",
            "source": "rt"
        },
        {
            "content": "Though huge in scope and scenery was vast, it dragged too much and is dated.  Charmimg and lucky con-men weren't charming or lucky enough.",
            "review_date": "2014-10-10",
            "source": "rt"
        },
        {
            "content": "Sunday afternoon. :-)",
            "review_date": "2014-05-04",
            "source": "rt"
        },
        {
            "content": "A cinematic masterpiece",
            "review_date": "2014-04-20",
            "source": "rt"
        },
        {
            "content": "Stick with it - it's great.",
            "review_date": "2014-04-16",
            "source": "rt"
        },
        {
            "content": "First watched this movie at the age of twelve and ran that VHS tape ragged. A wonderful and exciting adventure!",
            "review_date": "2014-03-21",
            "source": "rt"
        },
        {
            "content": "Two classic actors, and a classic director (Maltese Falcon, Sierra Madre) turn Kipling's 19th century legend into a strange colonial comedy. Dated, and too long.",
            "review_date": "2014-03-06",
            "source": "rt"
        },
        {
            "content": "The first half of this movie is more of a road trip film but the last half is where it gets really good. I love the premis and its great seeing Connery and Caine together. Really interesting commentary on power and hero worship.",
            "review_date": "2014-03-05",
            "source": "rt"
        },
        {
            "content": "A fascinating drama following the two Adventurers set in the exotic locations of Kafiristan is a very much watchable film. Saeed Jaffrey as a young Gurkha soldier looks quite charming.",
            "review_date": "2014-02-09",
            "source": "rt"
        },
        {
            "content": "only the best buddy movie ever made.. they have nothing but a dream and a plan. Be  adventerous.Take chances, get a stake, just go do something. If you do not like this movie, you probably do not like food!",
            "review_date": "2014-01-19",
            "source": "rt"
        },
        {
            "content": "The Man Who Would Be King has great cinematography and production design, but it is nonetheless a total bore of a film with story and characters as interesting as watching paint dry and Michael Caine ruins the film with his annoying and ridiculous overacting. Tedious rather than escapist, it is a disappointment for director John Huston.",
            "review_date": "2013-12-10",
            "source": "rt"
        },
        {
            "content": "Sean Connery and Michael Caine, what more can you ask for?",
            "review_date": "2013-11-10",
            "source": "rt"
        },
        {
            "content": "Generally entertaining picture in which two non-commissioned officers named Danial Dravot (Sean Connery) and Peachy Carnehan (Michael Caine) set off to conquer a kingdom in India. They originally meet a newspaper columnist Rudyard Kipling (Christopher Plummer) who was to join their adventures but loses them by the train. It's not really an in depth movie, but more just fun and full of colours (as many people would coin this as \"escapist\" which is truthfully a term I don't like using because it sounds derogatory). Connery and Caine, who I believe are friends in life, work very well together, and the scenery footage is incredible. I also like how the story is told in flashback, as Kipling is approached by Carnehan to how the journey with Dravot had turned out. It is a little long though, but overall it was a good experience.",
            "review_date": "2013-11-10",
            "source": "rt"
        },
        {
            "content": "The credits of \"The Man Who Would Be King\" say it all: John Huston, film's equivalent of a great landscape painter, directed; Sean Connery, Michael Caine, and Christopher Plummer, a triumvirate of actors more British (and maybe more famous) than the Queen, starred; the script was adapted from a story by Rudyard Kipling, the scribe laureate of the Pax Brittanica.  Not since \"Lawrence of Arabia\" (1962) had an entry in the de facto genre of British Empire Adventure been so well-shot, well-acted, and well-written.  The story is straightforward, at times even predictable, but this is not the same as being simplistic or unedifying.  It is a morality tale, and the moral is... there are perhaps different morals to glean from it, depending on which point of view you take.  There is the viewpoint of Michael Caine's Peachy, a con man with a seemingly nihilistic view of life who would, however, never abandon a friend or break a contract.  There is Sean Connery's Danny, brave and fair-minded but with perhaps more ambition than sense.  And there is Rudyard Kipling himself, played by Plummer behind mustache and makeup that make him a near dead-ringer for the writer, who is envisioned here as a level-headed observer of spectacular people, events, and places who knows how not to go too far.  The joy of the tale is in seeing these personalities play out the inevitable outcome of a mad trek into the Asian hinterland, and then pondering the political, religious, cultural, and historical messages that have been artfully and entertainingly conveyed.",
            "review_date": "2013-11-02",
            "source": "rt"
        },
        {
            "content": "Cracking film, made even better by the pairing of Connery and Caine - superb chemistry. Check it out if you ever get the chance.",
            "review_date": "2013-10-16",
            "source": "rt"
        },
        {
            "content": "An uproariously funny film, exemplary in its intelligence. Great acting, big-scale action and a wild plot.",
            "review_date": "2013-10-08",
            "source": "rt"
        },
        {
            "content": "Definiteley in my personal top 5 movies of all time :)",
            "review_date": "2013-09-18",
            "source": "rt"
        },
        {
            "content": "Easily my favorite movie of all time, based on one of my favorite of Kipling's works. I could use phrases like \"Feel good romp\" or \"good old fashioned colonial racism\", but yeah... That's not me...\n\nIt's a good movie, and one well worth seeing.",
            "review_date": "2013-08-17",
            "source": "rt"
        },
        {
            "content": "Quite possible one of the best British films ever made. Michael Caine and Sean Connery at the peak of their powers, provide a masterclass that seems so elusive to modern day cinema. A gripping tale just simply engages your mind in ways that only the works of Kippling can. A must watch. 10/10",
            "review_date": "2013-08-14",
            "source": "rt"
        },
        {
            "content": "A great movie for a young man.  I rated it 5 stars out of respect for my love of this movie when I saw it on my 13th birthday.",
            "review_date": "2013-08-03",
            "source": "rt"
        },
        {
            "content": "I flat out thought this movie was super boring. It started off great with Caine doing his thing on a train, and then Connery comes in doing this out of place hokey acting, and the film then got really boring from there on.\n\nI could just never take Connery seriously and then in the middle his character becomes a douche thinking he really is a God after a few things happen out of luck really.\n\nMan stretches of people talking in foreign languages with zero subtitles was an awful choice.\n\nI did think the ending was enjoyable given what I didn't like before that!",
            "review_date": "2013-04-11",
            "source": "rt"
        },
        {
            "content": "classic Connery and Caine!",
            "review_date": "2013-03-25",
            "source": "rt"
        },
        {
            "content": "One of the worst movies I have ever had to watch for school. That may have been because I was so bored the entirety of the film - all two hours of it.",
            "review_date": "2013-03-04",
            "source": "rt"
        },
        {
            "content": "Lord, I saw this years ago... But seriously, this is a masterpiece for all the right reasons. Classic story, great great cast. Superb film. A must see before you die.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "A fun comedy/adventure from the 1970s.  Connery is as great as always.",
            "review_date": "2013-01-12",
            "source": "rt"
        },
        {
            "content": "A great film set in the heyday of British colonialism that ends in a very dark place via a surprisingly lighthearted journey. The film is a good old-fashioned adventure story at its heart, with Caine and Connery as two roguish ex-army types seeking to become stinking rich by setting themselves up as kings in Kafiristan. Despite their amorality, the pair are quite charming and it is fun to watch them succeed, especially since we are not witnesses to the harm their actions will cause. There's even a strange nobility in their arrogance. The film makes a very clever decision here to have us see the pride and wonder of the British Empire before taking us on a tour of its dark side. By the time things turn bad, you're enough on their side to sympathize with them, even though their predicament is their own damned fault.\n\nThe music is excellent too, based around an old British army march given an orchestral airing.",
            "review_date": "2013-01-04",
            "source": "rt"
        },
        {
            "content": "Connery and Caine, are great.  Fabulous movie!",
            "review_date": "2013-01-01",
            "source": "rt"
        },
        {
            "content": "if there is a better buddy action movie than this, i've not seen it. the casting director deserves extra kudos for bringing caine and connery together. further, how underated was john huston - as good of a film pedigree you will ever find, a superb bit of film making. before indiana jones, there was tmwwbk.",
            "review_date": "2012-10-13",
            "source": "rt"
        },
        {
            "content": "Revisited on BRD.\n\nFrom a story written in 1888, retold here in 1975, one might wonder how much & what kind of comedy was originally intended?  Has 21st century tech ( and recent history ) driven this film further into caricature ? Regardless, Caine and Connery make a fine pair of rounders.\n\nSaeed Jaffrey as Billy Fish is a delight - little wonder Jaffrey has appeared in a gazillion movies.",
            "review_date": "2012-09-15",
            "source": "rt"
        },
        {
            "content": "Great film. A little dated and could surely do with a remake.",
            "review_date": "2012-09-03",
            "source": "rt"
        },
        {
            "content": "Usually, I would consider a title like that to be pretty cool, but really, it kind of diluted my interest in the film, because it doesn't really seem all that well thought-out. I can see the book's author, Rudyard Kipling, sitting around, trying to think of a title he finally thinks to himself, \"Hm, let's see, it's a period piece about a man... who would be king; oh, pip-pip cheerio and all that crumpet, I do believe I've got it!\" I think that it's safe to presume that he said something along those stereotypical lines, because the film alone is British as all get-out. Granted, it's directed by an American, but it's John Huston, and he was hardly shy of flaunting his English roots, so you better believe that this film is British something fierce, as if the cast wasn't enough evidence, because we're talking about Sean Connery, Michael Caine, as well as, of course, Christopher Plummer as Kipling himself. Yeah, Chris Plummer wishes he was British, and thank goodness for that, because in order to be more like the Brits, he learned to pull off flawless faux accents, and that's amazing when you consider that he's an Ameri-oh, wait, he's Canadian, so nevermind. A lot of Canadians have a flat accent, much like Americans, and yet, everyone from an accented country seems to forget that and only call out Americans as the people who can't usually do other accents well, though that might just be because Canada's got Chris Plummer on its side, and he makes for a pretty strong argument, because he managed to pull off Rudyard Kipling, and that's pretty darn English, as made clear by much of his work, including this film's source material. Hey, say what you will about the, well, still admittedly pretty cool title, but I'm betting that short story sure made for a good read, though the film, on the other hand, while reasonably worth watching, isn't exactly all that consistently thrilling of adventure film.\r\n\r\nThe earlier acts of the film are limp something fierce, dragging along with a dry atmosphere and even a considerable bit of quietness that taints the film with a degree of dullness, the sting of which goes worsened by the simple fact that very little happens in that first act. The film fails to open terribly strong and just kind of limps out, but just when you succumb and fear that the film will descend to underwhelmingness, the film, well, just enters second act, and that's about it. The film perhaps picks up at the body, though if it does, then it really doesn't pick up all that much, dismissing enough limpness to keep from getting dull, yet sustaining much of the limpness that tainted the first act and plagues most of this final product. Little happens throughout long periods of this film, and after a while, it's easy to become disengaged, as the film's breaking from its consistently dry and somewhat bland tone is an event that doesn't occur as often as it should, and such tonal consistency is not only problematic because there's not much bite to the tone to begin with, but because the film's running a mostly straight line of tone leaves narrative structure to take damage the film to not always pick up when it should. Now, the film never falls too far when it limps out and isn't likely to at some point along the way, as the film does, in fact, pick up slowly but surely, until by the final act, we're facing an actually genuinely good film, yet that's too little too late, as the remainder of the film fails to hit as hard as it should have, because John Huston fails to do that could have saved this film from underwhelmingness: provide enough depth. This film is definately an adventure piece, and after a while, it becomes something of an epic, though that's almost all in concept, as Huston's directorial execution doesn't quite provide enough tonal sweep or depth to really milk this film for all its worth, and with Huston instead further diluting intrigue through slowness and limited tonal dynamicity, the final product comes out not quite what it should have been. However, what ultimately emerges is nevertheless an enjoyable film that may not be able to consistently sustain your attention, let alone full investment, but provides enough of what you want to get you by, particularly if you're looking for a production fit for the epic that this film should have been more like.\r\n\r\nThe film is not exactly heavily produced, though its production value remains reasonably hefty in quantity, as well as fairly impressive in quality, reconstructing this time period with grand yet delicate authenticity, while keeping dynamic in design concepts for you to feel the progression of this adventure, maybe even to the point of feeling some of the epic sweep that John Huston needed to deliver more of. What certainly provides a degree of epic sweep is Oswald Morris' photography, which has dated in several areas, yet remains grand and lively with a broad scope that captures this environment and brings it to life, particularly during the scarce yet worthwhile battle sequences. The film is certainly impressive on a technical level, and while those technical values have dated to a certain extent, they carry this film quite a long ways, while the man who keeps this film going the rest of the way is Rudyard Kipling, who really has crafted a fascinating and lively story that I'm sure must make for a pretty good read, as it does make for a pretty good concept for this film. John Huston's and Gladys Hill's execution of the concept, however, doesn't entirely do it justice, yet neither does it betray the concept entirely, as Huston and Hill do provide a screenplay that is flawed, yet generally well-structured, with some snappy dialogue, lively set pieces and charming characterization, and with his directorial execution, Huston makes many missteps, yet still does an adequate job for the story to charm, while the lead performers fire on all cylinders when it comes to delivering on charm. Sure, Christopher Plummer charms as the legendary Rudyard Kipling during the few times he's present, but this is Sean Connery's and Michael Caine's show, and you better believe that our legeneray charmers of British leads let you know for sure that this is literally Sean Connery's and Michael Caine's show, because they are playing themselves, as they always do, which is just the way I like it. Connery and Caine deliver on distinct, firecracker charisma that defines the Daniel Dravot and Peachy Carnehan characters as, well, Connery and Caine, respectively, but also as down-to-earth, yet still strong and unique enough for them to be bought as people who would find themselves in such grand situations as the ones portrayed in this interesting story. Connery and Caine charm by their own rights, and as a duo, they're sensational, boasting electric chemistry that defines the definitive comradery between our two leads and does the most in carrying this film, something that I wish had more than just the charm of its leads, worthiness of its source material, quality of its technical value and inspired occasions in writing and direction to keep it going, yet is still nevertheless kept going enough for you to walk away, maybe not terribly satisfied, but still with more reasonably fond memories than disappointments.\r\n\r\nBottom line, the film has its occasions of being dull, yet is consistent in being rather bland, as it is slowly, if not limply told, with limited tonal dynamicity, overlong periods of filler and, worst of all, not enough depth or sweep to sustain your complete attention, let alone full investment, thus leaving this final product to fall from its throne of potential satisfaction, yet never fall too far from grace, boasting clever production designs and sweeping photography, as well as a strong story concept that is generally well-structured by John Huston's and Gladys Hill's screenplay, as well as occasionally well-executed by John Huston's direction, but mostly brought to life by the sparkling charisma and chemistry between leads Sean Connery and Michael Caine, who do the most in making \"The Man Who Would Be King\" an enjoyable adventure opus that's reasonably worth sticking with.\r\n\r\n2.5/5 - Fair",
            "review_date": "2012-09-01",
            "source": "rt"
        },
        {
            "content": "************************************************************************. Need I say more?",
            "review_date": "2012-08-30",
            "source": "rt"
        },
        {
            "content": "This definitely ranks among John Huston's greatest work, but I would not consider it to be his best movie (\"The Maltese Falcon\" would probably deserve this honor). \"The Man Who Would Be King\" is nonetheless a highly entertaining tale of friendship and loyalty that manages to stand the test of time.",
            "review_date": "2012-08-07",
            "source": "rt"
        },
        {
            "content": "Personally I didn't think much of this while watching. For me, it was kind of hard to pay attention because I thought it was pretty boring, and your always trying to find the plot. Well really, the plot doesn't come until the end. And after watching more than half of the movie this movie becomes something else. It stops becoming boring and really ends up being one of the greatest stories ever told. I love Michael Caine, and Michael Caine in this is outstanding. One of his best films. A lot of people think that Connery was the main character, but really it is Caine. Such a wonderful movie.",
            "review_date": "2012-07-28",
            "source": "rt"
        },
        {
            "content": "Sean Connery. Michael Caine. Same movie. Need I say more?",
            "review_date": "2012-07-25",
            "source": "rt"
        },
        {
            "content": "This John Huston's epic adventure movie leaves a mark on your mind. Even if you don't like it!",
            "review_date": "2012-07-16",
            "source": "rt"
        },
        {
            "content": "Peachy Carnehan: \"Keep looking at me. It helps to keep my soul from flying off.\"",
            "review_date": "2012-07-11",
            "source": "rt"
        },
        {
            "content": "A rousing adventure tale done in the way they don't make 'em like anymore.  Great chemistry between the two leads and a lot of action and fun. An epic that, despite the ending, isn't dour.",
            "review_date": "2012-06-17",
            "source": "rt"
        },
        {
            "content": "Caine and Connery defining the balls",
            "review_date": "2012-05-26",
            "source": "rt"
        },
        {
            "content": "An old fashioned adventure based on a Rudyard Kipling yarn, this late achievement by director John Huston feels a bit dated in its implicit imperialism, but is saved by exotic settings and the interaction between British superstars Michael Caine and Sean Connery.",
            "review_date": "2012-04-25",
            "source": "rt"
        },
        {
            "content": "a great adventure with a mournful ending.",
            "review_date": "2012-04-22",
            "source": "rt"
        },
        {
            "content": "A totally awesome adventure yarn, complete with comedy, war, ancient history, and general British arrogance. I can see how Frost and Pegg were influenced by this.",
            "review_date": "2012-04-20",
            "source": "rt"
        },
        {
            "content": "I borrowed this movie from the library years ago never even heard of it but wow what a story. 2 guys (Connery and Caine) set out to build an army and during a battle a arrow becomes lodged in a bandoleer strapped across Connery's chest. This soon leads to the locals thinking he is the reincarnation of Alexander the Great. Don't want to give away everything. See this movie",
            "review_date": "2012-04-09",
            "source": "rt"
        },
        {
            "content": "The Man Who Would Be King tells the story of two men out to seek their fortunes as they go into a small village and build themselves up as people of importance in order to start their own nation. This is a film that I had been hearing about for a long time from various people that it was just a fantastic movie and one that doesn't get much attention these days. While I agree it's certainly underrated and not talked about, I wouldn't call it a masterpiece. The film definitely has some merit to it, but I do have to say that I was sort of bored for the first half hour or so. Things take so long to set up in a story a little over two hours long that you just want it to get there already. There's no real conflict character-wise until the third-act, which is a bit off-putting. Sean Connery and Michael Caine give good performances, of course, but the story is very uneven to me. I liked it, but I can't say that I'd recommend it without mentioning some of its faults.",
            "review_date": "2012-03-31",
            "source": "rt"
        },
        {
            "content": "An amazing movie that started off slow, but picked up pace!",
            "review_date": "2012-03-18",
            "source": "rt"
        },
        {
            "content": "Back when a buddy picture meant more than potty humor. Michael Caine and Sean Connery are perfect as swashbuckling knuckleheads who believe they can, with the aid of 20 rifles and their own military training, take over a country. Admittedly, it's a country no one has heard of (Kafiristan), but what ensues is engrossing, exciting, and most of all: fun. In the hands of master adapter John Huston, Rudyard Kipling's short story blossoms into a great adventure that does not disappoint.",
            "review_date": "2012-03-17",
            "source": "rt"
        },
        {
            "content": "Now, the problem is, how to divide five Afghans from three mules and have two Englishmen left over.",
            "review_date": "2012-03-08",
            "source": "rt"
        },
        {
            "content": "Good cast and a great location shoot but I found it to be be boorish and slow-moving",
            "review_date": "2012-03-04",
            "source": "rt"
        },
        {
            "content": "The Man Who Would Be King tells the story of two men out to seek their fortunes as they go into a small village and build themselves up as people of importance in order to start their own nation. This is a film that I had been hearing about for a long time from various people that it was just a fantastic movie and one that doesn't get much attention these days. While I agree it's certainly underrated and not talked about, I wouldn't call it a masterpiece. The film definitely has some merit to it, but I do have to say that I was sort of bored for the first half hour or so. Things take so long to set up in a story a little over two hours long that you just want it to get there already. There's no real conflict character-wise until the third-act, which is a bit off-putting. Sean Connery and Michael Caine give good performances, of course, but the story is very uneven to me. I liked it, but I can't say that I'd recommend it without mentioning some of its faults.",
            "review_date": "2012-02-21",
            "source": "rt"
        },
        {
            "content": "Una aventura de cuando el cine era de verdad inmenso. John Huston se luce.",
            "review_date": "2012-01-30",
            "source": "rt"
        },
        {
            "content": "This is an old-school Hollywood epic with two trickster lead characters; it's halfway between a buddy comedy and Lawrence of Arabia. It's a fairly faithful adaptation of the Rudyard Kipling story, though I think it's a bit lighter in tone than the story. More than anything though, it's a good opportunity to watch two of everybody's favorite actors beside each other at a young-ish age.\n\nThe story follows a couple of ne'er-do-well British soldiers (Sean Connery and Michael Caine) in the 19th century who decide to march from India into the unknown lands of Kafiristan and set themselves up as kings, seemingly just for the jolly good fun of it. The main action is framed by one of them telling the story of their adventures to a journalist named Rudyard Kipling (Christopher Plummer).\n\nThe main reason to watch this movie, of course, is to see Sean Connery and Michael Caine travel and bicker and take over a country. This was made in 1975, so Connery was already beyond most of his Bond movies (except for Never Say Never Again, that one that kind of doesn't count), and here he is in his full Scottish-accented, mutton-chopped glory. His performance is quite funny, even if his character is rather morally questionable. The same goes for Caine: his character is more ethical and aware of reality than Connery's, but only slightly. It's really fun to watch these two together. Christopher Plummer is fine as Kipling, but he mostly is just there to witness the other two.\n\nThe movie was directed by the legendary John Huston, and plays like a bigger-budget version of his The Treasure of the Sierra Madre. There are a good number of sweeping vistas and mysterious ancient cities to be seen, which lends it the somewhat Lawrence of Arabia vibe. Some of the big crowd scenes have just an unbelievably large number of extras. This is one of those action movies that was more exciting at the time than it would be for today's jaded audiences, though that's no fault of the movie's. And of course the way the movie treats a couple of white guys taking over a bunch of benighted brown natives is less than politically correct, though the movie doesn't seem 100% uncomplicatedly imperialist. Still, it's a big and likable movie.",
            "review_date": "2012-01-28",
            "source": "rt"
        },
        {
            "content": "First off I'm a Sean Connery & Michael Caine fan.  One of the best movies and neither received an Oscar for it.",
            "review_date": "2012-01-19",
            "source": "rt"
        },
        {
            "content": "Quite entertaining. You knew that the ruse was going to be up at some point and it was interesting to see how it all unravels. John Huston loved making it eh? Well he should. This was the cockney Caine era and he is wonderful as the only one who truly knows Connery's mortality.",
            "review_date": "2012-01-13",
            "source": "rt"
        },
        {
            "content": "The flim The Man Who Would Be King is a amazing thirlling flim staring sean connery and michael caine as two former sodliers turned rouges looking for weatlh and one them gets well turned king but really i can't say much after that since it would spoil it so go see it now",
            "review_date": "2012-01-04",
            "source": "rt"
        },
        {
            "content": "Another one I should have seen ages ago. A Cockney and a Scot signing a contract to become the kings of remote region in central Asia. What's the worst that could happen? An adventure movie the way it should be...",
            "review_date": "2011-12-28",
            "source": "rt"
        },
        {
            "content": "Can't beat this one!",
            "review_date": "2011-12-28",
            "source": "rt"
        },
        {
            "content": "Caine and Connery defining the balls",
            "review_date": "2011-12-15",
            "source": "rt"
        }
    ]
}