{
    "rating": 8.8,
    "release_date": "1947-05-26",
    "num_reviews": 130,
    "genres": [
        "English"
    ],
    "summary": "A group of Anglican nuns, led by Sister Clodagh (Deborah Kerr), are sent to a mountain in the Himalayas. The climate in the region is hostile and the nuns are housed in an odd old palace. They work to establish a school and a hospital, but slowly their focus shifts. Sister Ruth (Kathleen Byron) falls for a government worker, Mr. Dean (David Farrar), and begins to question her vow of celibacy. As Sister Ruth obsesses over Mr. Dean, Sister Clodagh becomes immersed in her own memories of love.",
    "reviews": [
        {
            "content": "LOL, the funniest 01 hour: and 40 minutes ever!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2023-02-25",
            "source": "rt"
        },
        {
            "content": "I liked the Red Shoes more from Powell, but this physiological drama is ahead of its time and another hallmark of British made technicolor. It's just beautiful to look at but the theme is problematic and abstract.",
            "review_date": "2023-02-04",
            "source": "rt"
        },
        {
            "content": "While it's lovely to look at, you can't help but get the feeling that Michael Powell and Emeric Pressburger's Black Narcissus is more style than it is substance.  Set in the Himalayas, a group of nuns is dispatched to a decrepit palace high in the mountains in order to establish a convent to provide aid to the local inhabitants.  The majority of the film consists of the sisters interacting with the locals, while the last act, which feels like it's tacked on, becomes a sordid melodrama revolving around unrequited love and lost faith.  While the cinematography and sets are beautiful, the movie feels as though it falters as the result of uninteresting characters and a lack of any cohesive story.  As eye candy, it is great.  As an engaging film, it falls a bit short.",
            "review_date": "2022-04-06",
            "source": "rt"
        },
        {
            "content": "Stunningly photographed (by the great Jack Cardiff), and with astonishing production design that completely disguises that the whole movie was shot in England and on Pinewood soundstages, this strange and haunting study of repressed sexuality and madness among a group of nuns newly relocated to a mountain top monastery, almost defies categorisation. At times it plays like a travelogue, a romance, a domestic drama, but as it proceeds it becomes more and more unsettling. The wind blows, the bell chimes, and Brian Easdale's haunting score tightens the tension. Excellent performances from Deborah Kerr, David Farrar and Kathleen Byron.",
            "review_date": "2022-02-02",
            "source": "rt"
        },
        {
            "content": "I am subtracting a point for the use of brownface. Why is it even necessary? It is a glaring mistake, in my opinion. The rest of the movie is perfect. I loved the use of matte paintings, miniature sets, lighting design, acting performances, and so on. For those who want a fresh interpretation of the story, I would recommend the 2020 mini-series. It stars Gemma Arterton in the leading role.",
            "review_date": "2022-01-07",
            "source": "rt"
        },
        {
            "content": "Great thriller that delves deep into the psyche of the characters. Still fresh after 70 years.",
            "review_date": "2021-12-11",
            "source": "rt"
        },
        {
            "content": "One of the Archer's masterpieces. Junge's artwork, the location photography (in an English garden!), the direction and Kerr's performance combine to produce a majestic work of genius. Impossible to categorize. One of the most compelling book adaptations in British cinema along with Great Expectations, from the excellent Godden original. A reminder of how great British cinema was. Repays repeated viewing.",
            "review_date": "2021-12-01",
            "source": "rt"
        },
        {
            "content": "Black Narcissus is a deceivingly beautiful film with masterful storytelling rhetoric as well as cinematography, both working in tandem to create constant unrest in tension building with seemingly no cadence even in the ending. \n\nThe cinematography provokes a rather smooth experience, almost like a silky, misty texture with moderately-pace rhythmic montages. Not only in that the shots are timely to convey this, but each frame also uses compositional transition to lead the eyes effortlessly through the movie. During a sequence, movement would be introduced from outside the frame; either moving in from the sides, from the foreground or background. The few abrupt montages are purposefully used in the climatic sequences. I personally highly appreciate this sort of artful constraints. \n\nShots usually contain the entire body of the actors; mostly in the middle ground; rhetorically similar to the exotic drawings in the bathhouse. With only a few over-the-shoulder shots (unlike in Citizen Kane), the viewing experience is analogous to that of a painting, creating a sort of experience where the viewer would seem to be floating most of the time. There are a few outliers that I found interesting. First are the few tilted camera shots that would induce disorientation to emote unsettlement and urgency. Second is the one and only use of First-Person shot (when Sister Ruth collapses); in this brief second we can almost connect to Ruth's feverish rage.\n\nThe selective use of dramatic lighting is also something to be cherished. Throughout the film, most of the time the lighting is homogenous, again adding to the misty effect. The only time chiaroscuro is used is to capture Ruth's madness, or in a few frame in the peeking sequence (1:15 - 1:18). This not only heightens the angst evoked by the shots but also give Ruth so much character as the \"antagonist\" of the film. \n\nWhile cinematograph provides a rather smooth viewing experience turning the attention onto the story, the story is one full of contrasts. A few themes like Christianity vs. Hinduism, colonist vs. native, the sacred vs. the profane comes to mind; but personally Chasity and sex predominates as the story reveals layers of characters' story hinting at strong sexual desire and sexual release. The viewer is left high strung throughout the film; it is only until the goodbye scene do the viewer receive but a subtle contact between Sister Clodaugh and Dean in the hand-holding scene, where Clo almost hesitates to let go of Dean's hand, only to be followed by Dean's longing stare in the departure. \n\nOverall the viewing experience is one I did not expect to love and find so enticing. I can appreciate why Scorsese would describe this as an \"erotic\" film. But I find that in a sense it's a not erotic because it contains explicitly erotic scenes (like we have seen in La Coquille et le Clergyman and Un Chien Andalou), but rather implicit sub-texts in the imageries, dialogues, and thoughts of the characters. It is precisely the lack of an erotic scene that leaves the audience longing, and in that longing is the erotica Scorsese's mentions.",
            "review_date": "2021-11-03",
            "source": "rt"
        },
        {
            "content": "I appreciate the fine acting from the Nuns and the cinematography is great BUT the story is meh. Not that much actually happens. Its far better than the recent BBC TV series of the book which makes me wonder why they bothered, but there is simply not enough in the film. I have no idea if the book contains far more or this is it. If this is it, its too little. Sorry, this may be considered a classic, its just not a classic to me.",
            "review_date": "2021-09-23",
            "source": "rt"
        },
        {
            "content": "Amazing to look at, and technically brilliant. However, it feels dated in its content and cultural depictions and portrayals, and the story just didn’t grab me. I can appreciate it but I didn’t love it.",
            "review_date": "2021-01-13",
            "source": "rt"
        },
        {
            "content": "Loved it. Atmospheric. Intense.\nAnd sexy. Even taking place in a nunnery in Nepal.",
            "review_date": "2021-01-10",
            "source": "rt"
        },
        {
            "content": "Who would have thought a bunch if nuns stuck up a mountain would make such a great movie? Everything about this film is great, astonishing colours, hard to believe it was filmed in Pinewood. Everything has already been said about it but what l particularly like is it's economy. No scene (and there are many) outstays its welcome. Not a word is wasted and every detail propels the narrative. Masterly.",
            "review_date": "2020-12-28",
            "source": "rt"
        },
        {
            "content": "this film scores a perfect 10 for me. One of the best classic British films ever made Michael Powell and Emeric Pressburger.\nDeborah Kerr give an flawless performance as an Anglican nun who is sent to India  to establish a school and hospital in the old Raja palace high up in the mountains. Her devotion to her duty and her passion in undermined by the arrival of hunky rugged British local dressed in shorts and an open shirt who appeals to the sexual desires of the nuns. Naturally a hard rain will fall in a battle between repesed sexual desire and devotion.\nthis film has spectacular special effects. to recreate the views of a giant chasm beneath the palace a 40 foot glass sheet was erected into studio onto which was painted in matte the surrounding scenery. simple but as good a modern special effects and outstanding for its day. The final scene of the rain is one of the best ending of a film, so subtle yet symbolic.",
            "review_date": "2020-11-01",
            "source": "rt"
        },
        {
            "content": "\"Sexual education is eroding good, traditional Christian values!\" Black Narcissus deserves recognition for two distinct elements - its early willingness to explore sexuality and promiscuity (particularly through the lens of a conservative sect), and its incredible technical sophistication for the time. The colors are sharp and intense, even if they flutter at the periphery of the frame, a phenomenon particularly noticeable in the lighter palettes, but that can hardly be considered a major fault when compared to the visual quality of the film's contemporaries. I think presenting sexuality (rather than romance) as an integral part of the human experience may be granting the film a bit too much credit, though consideration must be given to the identification of weaknesses in the supposedly pure monastic life, the human element (and the individualized ' shortcomings' of each sister), and even the culture clash between the well-intentioned but unfamiliarized English and the conservative but functionally knowledgeable local population. (4/5)",
            "review_date": "2020-09-07",
            "source": "rt"
        },
        {
            "content": "A strikingly beautiful psychological drama that could just easily be a horror movie.",
            "review_date": "2020-06-10",
            "source": "rt"
        },
        {
            "content": "A very nuanced and sensual film, just what you would expect from Powell, he's always subtle and straightforward at the same time. There's no need to ramble about technical side of the film, it's perfect, and the film itself probably can be called a masterpiece and a must watch.",
            "review_date": "2020-06-02",
            "source": "rt"
        },
        {
            "content": "Black Narcissus is a 1947 British psychological drama film written, produced, and directed by Michael Powell and Emeric Pressburger 🍿 \n\nMeh, it passed the time. \nSort of. 😕\n\nA STORY OF EXQUISITE YEARNING IN A STRANGE AND BEAUTIFUL LAND.\n TOWERING OVER THE SCREEN ... \nAS THE MOUNTAINS THAT SAW IT HAPPEN.",
            "review_date": "2020-05-04",
            "source": "rt"
        },
        {
            "content": "Nothing going on. A classic only because it's ancient. Has not aged well.",
            "review_date": "2020-04-13",
            "source": "rt"
        },
        {
            "content": "Overacted, and contextually confused. The movie takes odd leaps of logic with characters whose actions are overblown for their situations. The dialogue is poorly written and meander, rarely advancing the plot.",
            "review_date": "2020-02-19",
            "source": "rt"
        },
        {
            "content": "Wasn't much of a story",
            "review_date": "2020-01-20",
            "source": "rt"
        },
        {
            "content": "This film was almost good.",
            "review_date": "2018-11-06",
            "source": "rt"
        },
        {
            "content": "More hysteria than substance ",
            "review_date": "2018-09-12",
            "source": "rt"
        },
        {
            "content": "I didn't feel the tension the film was trying to - and perhaps 70 years ago did - employ",
            "review_date": "2018-08-05",
            "source": "rt"
        },
        {
            "content": "I had the strangest feeling that I was missing something as I watched Black Narcissus. It tells the story of some nuns that open a convent in a Himalayan village, but trouble starts brewing. I wish I could tell you what was causing all of this chaos, but I have no idea. Is it ghosts? Is it some kind of corrupting force of the native religions? Is it fresh air? Is it sexual temptation from the one white guy that hangs around? I was stymied as I watched one person after another go nuts, having intense dreams, and begging to leave without a reason that I could discern. Then there was this native prince who was attending their school, and he was falling for a native girl who is a prostitute or something. I wasn’t sure what that had to do with anything else that was happening. Oh yeah, and there was this old guy in the mountains who just meditated all the time. What does all of this mean? Why is all this happening? Am I dreaming too? The standout for me in Black Narcissus is the acting. While I might not have any comprehension of why events are playing out this way, I can gather how I’m supposed to feel because the cast are doing a brilliant job. Deborah Kerr leads the way with a dramatic performance that is full of emotion. You can feel her compassion, fear, determination, and despair equally. David Farrar is like a steady rock in the film, because he is the one who seems the most aware of his surroundings and what is happening. Without him coming in with some occasional exposition Black Narcissus would have lost me even more. The other actresses who played nuns also did well, but it was Kathleen Byron who swooped in during the third act and stole the show. She was downright terrifying. As for the cast of natives, let’s just say if people cared about whitewashing and cultural appropriation back in the 1940s movies would have been made a lot different. Black Narcissus is also a visually stunning film. They built some great sets that contrasted the two religions that were vying for control of the region. I loved all the elaborate decorations, and the bold use of color. That color also came to play in many of the costumes, showing the flashy array of colors worn by the natives and the more monochrome style of the nuns. The director and cinematographer also worked together well to make full use of shadows and light to increase the drama of certain scenes, particularly the climax. I only wish I had formed a more emotional connection to the events that were transpiring. Because it all struck me as confusing, I wasn’t buying into the plot and came close to not even caring. The compelling actors and the way the story was presented made me care about what would happen to the characters, but I still didn’t know how to feel by the end. Black Narcissus is a strange film that has a lot of great component pieces, but they didn’t come together as a solid whole for me.",
            "review_date": "2018-05-30",
            "source": "rt"
        },
        {
            "content": "This British masterpiece utilises grand Technicolour cinematography and great setting (despite the Indian settlement being filmed in studio instead of on actual location).\nDeborah Kerr is most suited to the role of Sister Clodagh who, after years of living a romantic life, ends up leading a group of nuns with different traits in a somewhat cursed settlement. Among the group is Sister Philippa (Flora Robson), who acts as a motherly kind of figure; and Sister Ruth (Kathleen Byron), who behaves in a very rogue manner which has climatic consequences.\nJean Simmons, despite playing a whitewashed role, is effective in portraying Kanchi, a rogue resident girl who ends up falling for Dilip Rai (Sabu).\nTo understand the full meanings behind these characters, give this film a watch and you will gain a clear understanding why this film has its mark on British cinema. Because having done so myself, I have learnt how such masterpiece can still value to this day.",
            "review_date": "2018-05-23",
            "source": "rt"
        },
        {
            "content": "I watched this again for the umpteenth time recently and still got something new from it. What struck me was the conversation between Sister Clodagh (Kerr) and Dilip Rai (Sabu) with the painted cruciifix dividing them in the background and the erotic nature of how Kanchi (Simmons) approaches Dilip Rai when he's supposed to be beating her - did the censors miss that one?\n\nThe film starts with Clodagh walking brusquely past one of her students (who will \"continue the lesson\")  back in Calcutta, and ends with her offering her hand to Mr Dean (Farrar) submissively palm upwards. Mr Dean takes her hand by placing his palm under hers in one of the tenderest moments in cinema: Sister Clodagh does not snatch it away as the experience has made her \"nicer\".\n\nI've always been puzzled by why the American version cuts out Clodagh's memories of her earlier life in Ireland. She could not \"hide the mountain\".",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "A wonderful film, the cast was so we chosen, and the story is so interesting. The twists and turns it takes will send you in a wild ride. You get attached to the characters and wonder through the exotic story in the beautiful setting.",
            "review_date": "2018-02-04",
            "source": "rt"
        },
        {
            "content": "Byron & Simmons shine as the bad girls in this lavish studio film. You may need to be a student of cinematography to appreciate why this won an Oscar in that category, the muted Technicolor just doesn't seem to be groundbreaking in any other aspects of camera work. \n\nAs far as the script, this is a cautionary tale of what might happen to any that try to do a job under difficult & remote circumstances. After some point we must all be just a little human.",
            "review_date": "2018-02-04",
            "source": "rt"
        },
        {
            "content": "Maybe more 4.5 stars due to some small character cliches, but otherwise this has terrific originality. The movie starts off looking fairly standard, another boring old triumph of the human spirit gig, but don't worry. That's not where we're headed. I agree with other posters about the cinematography, quite good. Would love to see it on the big screen.",
            "review_date": "2017-11-10",
            "source": "rt"
        },
        {
            "content": "I'm trying to watch all things Deborah Kerr, because she's just amazing, so this was another movie to check off the list. The painted backdrops are pretty awesome, it's hard to believe this was filmed in a studio. Kerr and cast are great, and the last 15 minutes are actually pretty terrifying.",
            "review_date": "2017-08-01",
            "source": "rt"
        },
        {
            "content": "A dark look into human inner beings.  And some very frightening scenes.  Unusual, but excellent",
            "review_date": "2017-07-10",
            "source": "rt"
        },
        {
            "content": "Black Narcissus is a gorgeously shot movie, which is to be expected by Powell and Pressburger. With it's beautiful and isolated filming locations and all of the wonderful Indian-dyed colors, this movie is really like looking at a painting that moves.\n\nThere's this dark undertone throughout the movie that's very subtle atmospheric and eerie. Then it fully shows itself at the end within one of the characters in the movie. Very interesting how they built the tension and anticipation.\n\nThe important thing this movie shows is that no matter how faithful you are to a religion or what you believe in, we're all human in the end and evil can find it's way into any and all of us - even nuns lol.\n\nWonderful movie with stunning visuals and in gorgeous technicolor.\n\n\nI love how exciting the music is during the opening credits. Getting us ready for all the beauty of the Himalayas. That's going to be interesting. A group of Christian nuns are going to make a refuge for the locals of Mopu whom seem to be Buddhist. \nWhether or not the set pieces are real or models, it doesn't matter, everything looks beautiful!\n\nThis movies a good depiction of one religion moving in and trying to take over another one. Religious gentrification in a way. It seems like it's a convent of oppression rather than a convent of nuns. Not so much for the people they're helping but towards themselves. The girls joined the convent and it seems like fun and good times went out the window. Pleasure is a thing of the past for them, which is unfortunate because pleasure is the thing that keeps us humans sane. \n\nOmg it's almost terrifying the way Sister Ruth looks when she gets all crazy eyed talking to the head sister about Mr. Dean. The way they did her make up and the way the lighting looked was perfect. They made her look like she was going crazy. Crazy for cock! Lol. That's sexual repression for ya, kids! Lol. \n\nThe technicolor and all the different set pieces and lighting look gorgeous. The use of creepy atmosphere and ambient lighting was incredible at the end.",
            "review_date": "2017-05-02",
            "source": "rt"
        },
        {
            "content": "Atmospheric and chilling - but ultimately lavish.",
            "review_date": "2017-04-14",
            "source": "rt"
        },
        {
            "content": "This is a gorgeous film.  The palace turned nunnery in the remote Himalayas is created mostly in Pinewood Studios, and it's a glorious example of how deliberate artifice can create it's own kind of authenticity.  The carefully designed and controlled visual scheme of this film creates it's own world that is true to the story being told.  Ironically, the story is largely about how you cannot control every aspect of your world through force of will.  This film would be the best film made by just about any director, and it's a true testament to Powell & Pressburger's artistry that they made at least two films better than it.",
            "review_date": "2016-12-31",
            "source": "rt"
        },
        {
            "content": "Technicolor is the best color, goes with the matte painting backgrounds especially well.",
            "review_date": "2016-12-13",
            "source": "rt"
        },
        {
            "content": "Gloriously colourful (almost lurid, and at times almost gothic), this 1947 classic is teeming with sexual and racial subtext and has stunning set design.",
            "review_date": "2016-10-02",
            "source": "rt"
        },
        {
            "content": "Can you combine religion, psychological thrill and redemption? Well this movie can, and it didn't hold back anything with it's morale, questioning characters and perfect backdrop for a place where anyone can go mad.",
            "review_date": "2016-10-01",
            "source": "rt"
        },
        {
            "content": "Narciso Negro trata de desejo e culpa de forma metafórica e com uma beleza impressionante.",
            "review_date": "2016-07-21",
            "source": "rt"
        },
        {
            "content": "Absolutely one of the most spectacular films ever! The sense of torpor, repression and lust that just seems to ooze off the screen! The lushness of the cinematography! All the actors give top notch performances, but special credit has to go to Kathleen Byron's Sister Ruth - a tour de force performance!",
            "review_date": "2016-05-08",
            "source": "rt"
        },
        {
            "content": "The gorgeous backdrops have an ethereal, enticing quality, which are made all the more ominous as the characters are enticed from purity to temptation.",
            "review_date": "2016-04-24",
            "source": "rt"
        },
        {
            "content": "It is odd, enthralling and spooky - an inviting and captivating movie that doesn't have many peers. Well done.",
            "review_date": "2016-03-17",
            "source": "rt"
        },
        {
            "content": "The sumptuous visuals blend seamlessly with the plot's themes of sexual repression and desire. How Kathleen Byron didn't become an instant star after her wild and unpredictable performance in this film is something of a mystery to me.",
            "review_date": "2016-02-12",
            "source": "rt"
        },
        {
            "content": "Five nuns found a convent in the alluring mountains of Calcutta, only to be swayed and destroyed by the magical and erotic atmosphere. Never has a movie been so uncomfortably sexy.",
            "review_date": "2015-12-14",
            "source": "rt"
        },
        {
            "content": "Magnificently gloriously overwrought. I was totally entranced.As was Kit. Many thanks for the recommend Ana Hendy.",
            "review_date": "2015-08-12",
            "source": "rt"
        },
        {
            "content": "Only the visual visionary dream team of Powell and Pressburger could've made a film so aesthetically striking that Technicolor's then CEO claimed it was the best utilization of their process. P&P's borderline-insane efforts for artistic perfection in Black Narcissus was rewarded with censorships by a studio that feared exposing nuns to temptation would invoke controversy. The sexual and sacrilegious undertones, now hilariously subtle by today's standards, have since faded and brought to light what a brilliant marriage of style and substance Black Narcissus truly is. The plot concerns a group of nuns setting up convent in the Himalayas as they toil against the endless wind and native drumming on the outside and the lusty forces on the inside, but it's the imagery that make this film essential. This is visual storytelling at its most astonishing, with an enrapturing elegiac atmosphere that seems to possess the whole film, and the most emotional rainstorm in history acting as the fitting denouement.",
            "review_date": "2015-08-05",
            "source": "rt"
        },
        {
            "content": "This film tries way too hard to dramatize a situation that I do not find that dramatic in the first place: a nun's struggle to suppress her sexual desires. At least that's one of the two things in this film that can pass as dramatic: that and the natives of the village struggling with a sickness that is going around.\n\nThe climax of the film has nothing to do with the latter, and is heavily invested in the idea that one of the nuns is choosing to leave this group of nuns because she can't suppress her sexuality. I say good for her, making her own decisions. Why does she NEED to stay, why must the other Sisters feel obligated to \"save\" her? Maybe that is just my view on religion though - I never liked the idea of imposing your religious beliefs or practices on others since religion is a faith, not a certainty.\n\nThe rest of the movie is extremely slow, focusing on the Sisters' process of creating a school for the children of the community they visit. This film looks good aesthetically, but it tries too much to dramatize something that I do not find dramatic.",
            "review_date": "2015-07-26",
            "source": "rt"
        },
        {
            "content": "Much of the madness comes from suggestion and subtlety. Some of the most beautiful colour photography I've ever seen. Brownface is outdated but mostly harmless.",
            "review_date": "2015-07-20",
            "source": "rt"
        },
        {
            "content": "1947 religious film production based on the 1939 novel by Elmur Godden. A new nunnery in the Himalayan mountains is set up. The emotional effect the isolated school has on the nuns is explored.\nThe film is shot in glorious Technicolor and features lavush colour photography.\nMade many years before Sister Act this film shows that even nuns have frustrations!\nThe acting looks a little dated but the film has aged well apart from this.\nFlashbacks to previous love affairs of the  Sister Superior is shown.\nAnother nun, Sister Ruth has a mental breakdown and seems to become ever more jealous of the Sister Superior emminating in the films ending.",
            "review_date": "2015-07-12",
            "source": "rt"
        },
        {
            "content": "Largely uninteresting.  Pretty.  Kind of worth it for everything with Kathleen Byron!",
            "review_date": "2015-05-30",
            "source": "rt"
        },
        {
            "content": "Powell and Pressburger are fast becoming some of my favorite directors. There films just have this sense of being so ahead of there time it's impeccable. The movie is basically nunsploitation before that was a thing. It's weird, beautifully shot, balls out, and downright creepy at times.",
            "review_date": "2015-02-06",
            "source": "rt"
        },
        {
            "content": "Extraña historia sobre un grupo de monjas recluidas en un castilllo en el Himalaya, tiene una grandiosa fotografía y buenas actuaciones especialmente Mrs Kerr",
            "review_date": "2015-01-21",
            "source": "rt"
        },
        {
            "content": "It is rather slow and lacks focus at first, but Black Narcissus is another remarkable film from the directors of magnificent The Red Shoes thanks to solid acting, great imagery and thrilling ending, but most of all thanks to truly groundbreaking Technicolor which is lush and artistic and intriguing story and approach which is relevant, sexual, erotic and way ahead of its time. It is a flawed, but also innovative and quite honestly one of a kind experience.",
            "review_date": "2014-08-25",
            "source": "rt"
        },
        {
            "content": "The first thing Powell and Pressburger fans tend to note is the intelligence of the script, and the lush cinematography of Powell's Cinematographer, Jack Cardiff. I think what's most moving about Black Narcissus specifically, though, is the central theme of the unexpected visit of iterations of yourself that you'd sooner forget. It's the iteration of a self that was much more vulnerable, naive, and hopeful for the ambiguity of the future. \n\nThe Nuns of the newly appointed St. Faith, a convent established in an old Indian brothel placed high in the Himalayas, become all too entranced by the ecstasy of the environment around them: high in altitude, and ancient. It's both of these things that first distract the nuns from their everyday tasks, before sinking into a deeply existential crisis that have them question their oneness with God, even though the very thought is never outwardly spoken. \n\nThe most dramatic example, of course, is Sister Ruth (in a furious performance delivered by Kathleen Byron) whose transformation from a troubled nun into a bitter, hyper-sexual and murderous woman underline the nature of the work of God: suppression. Suppression of the past, suppression of desire, and suppression of sex. It reminds us that our facades can only hold out for so long until our real selves force their way out of isolation, destroying the image we try to make of ourselves and revealing our darkest secrets. \n\nIt might be easy to liken the actions of these nuns to the English colonies in India; attempting to \"whitewash\" the cultural landscape with Catholicism in the film might be a less-than-subtle acknowledgement to the attempted assimilation of the Indian nation to English culture. \n\nEventually, after so much suppression, the culture will push back against its oppressors to break down the facade, only to reveal what it was originally. \n\nThis is a beautiful film with a deeply psychological and intelligent story. Deborah Kerr is brutal and cold as the Sister Superior Clodagh, all in the attempt to hold herself up as a serious woman of God, rather than a jilted twenty-something who buried her heartbreak under a lifetime of armor. This flick is practically perfect.",
            "review_date": "2014-02-28",
            "source": "rt"
        },
        {
            "content": "Another pure brilliance from the great writing/directing team. Beautifully shot and acted and such a menacing scary ending. An erotic masterpiece.",
            "review_date": "2014-02-23",
            "source": "rt"
        },
        {
            "content": "Beautiful photography, make-up, and a good story. It feels however too dated for me. The dialogues, the acting, the locations, even the make-up (Western people with painted skin to look foreign.....) are not realistic enough for someone used to modern standards. It's still an important piece in the history of the Cinema, and therefore the 4 stars.",
            "review_date": "2013-11-29",
            "source": "rt"
        },
        {
            "content": "A Powell-Pressburger collaboration recounts a quintet of nuns, running a convent in the exotic Himalayas mountainside, they teach lessons to native children, attend to the sick, plant vegetables, but their inner conviction is slowly eroding in the sequestered environment, in particular the restrained sexuality has been awaken by a male interloper, then madness and bedlam start to riot. \n\nThe most conspicuous feat of this 1947 Technicolor film is its remarkable cinematography (intense closeups, picturesque wide angles, tonal flashback shots etc.) and the art direction (the entire setting is built on studio lot yet it still can blow your mind away by its plainly stunning beauty), deservingly it won 2 Oscars in these categories, but shockingly, the film is shunned in all other competitions.\n\nAdopted from Rumor Godden's novel, the film bears plenty of effort to underline the ethnic and religious disparities, although hiring Jean Simmons as an indigenous maiden without a single line but crudely emphasizing her sensuality and materialism is a cheap shot betrays the supremacy beneath the benefactor's benevolent smokescreen. Surely it is a UK production, unfortunately it is so scarce that an outsider can break out of the tunnel vision which hobbles one's full comprehension of another culture or lifestyle, even as acute and astute as team Powell-Pressburger. \n\nA young Deborah Kerr brings about a broad range of capacities to endow Sister Clodaph with the contradicting personae which challenges her belief in a dire situation, her self-restraint battles with her yen towards a macho worldly man Mr. Dean (Farrar), a high-caliber rendition superbly counteracts Byron's Sister Ruth, a demented and vindictive soul can set the world on fire, Byron's explosive menace is spot-on and spine-thrilling, while both her and Kerr's images sport secular costumes are illuminating the screen leaving indelible glamour. Farrar's rustic countenance and rugged roughness makes him an apt choice for the sexual object and Sabu, whose effeminate manners could also spark controversy with his underdeveloped sub-plot. \n\nBLACK NARCISSUS, by any criterion, is an unanimous and momentous accomplishment in the film history, it is a concisely-designed psycho-drama and a nod to its vertiginous climax - a heartfelt cliffhanger in its literal meaning.",
            "review_date": "2013-09-22",
            "source": "rt"
        },
        {
            "content": "Odd little psychodrama, but compelling nonetheless. Nuns on a mountain, hostile natives, God vs Sin, and the magnificent Deborah Kerr, who I'm fast becoming a fan of. Once again the Powell and Pressburger magic is all there, and despite the age the sets, backdrops and everything else feels completely authentic and is suitably impressive. Stunning cinematography, doubly impressive because it was studio-faked, most of it. Despite all this magic, however, it's still a definite acquired taste that not everyone is going to enjoy. However, it remains strikingly modern- perhaps unsurprisingly given the directors. In anyone else's hands this could be campy and creaky but this film remains resolutely engaging.",
            "review_date": "2013-09-21",
            "source": "rt"
        },
        {
            "content": "I have to make this admission that I've never seen any of the Powell & Pressburger films on the pretense that these were beautifully shot boring movies; and after seeing Narcissus for the first time, I'm happy to report that not only is this one of the most beautifully shot films I ever seen, but also one of the most expressive and inventive melodramas ever committed to the art of filmmaking. I mean, there were some scenes in this film where I was genuinely floored by the beautiful cinematography and the impressive production design!",
            "review_date": "2013-07-29",
            "source": "rt"
        },
        {
            "content": "One of the best movies ever made, no doubt.",
            "review_date": "2013-07-25",
            "source": "rt"
        },
        {
            "content": "Black Narcissus is considered by Powell the most erotic film he has ever made.  Even though this film has (nearly) no nudity at all, the underlying sexual tension is woven throughout the film.  it is a struggle for the nuns between faithfulness and the desires of the flesh.  it is a good story that shows us the struggle that we face daily between faith and flesh.",
            "review_date": "2013-07-09",
            "source": "rt"
        },
        {
            "content": "saw it last night and it's 15 hours later and i'm still thinking about it. Beautiful film and a great unrequited love story of two people trying to put their disappointments behind them by never letting themselves be vulnerable again. Whether you join the convent or just give yourself up to an exotic land and all it's sensuality, no one ever really escapes the experiences that make them who they are.",
            "review_date": "2013-05-23",
            "source": "rt"
        },
        {
            "content": "\"Black Narcissus\" es una extraña pelicula. El subtexto se filtra de manera poco sutil y su inicio convencional se transforma radicalmente bajo su linea de erotismo, locura y superstición. La historia se enfoca en un grupo de monjas dedicadas a adaptar un monasterio en los Himalayas en una escuela y hospital, a pesar de no contar con experiencia ni un entendimiento claro de la gente que vive en los alrededores. \n\"Black Narcissus\" es visualmente espectacular (bajo el glorioso proceso Technicolor) y cuenta con estupendas actuaciones (especialmente de Deborak Kerr). A pesar de ser inconsistente con su trama, es una fascinante pelicula.",
            "review_date": "2013-05-22",
            "source": "rt"
        },
        {
            "content": "The setting becomes a character in itself, as Black Narcissus is a remarkably well shot film that holds up very well. The story itself is unique as nuns try to start a school and hospital at the top of a mountain where their worthiness of being nuns will be tested by a provocative drunk outsider.",
            "review_date": "2013-04-16",
            "source": "rt"
        },
        {
            "content": "A true classic from start to finish....",
            "review_date": "2013-03-16",
            "source": "rt"
        },
        {
            "content": "A very powerful film that stands the test of time. Visually orgasmic, superb performances. This is a very unusual piece of cinema with an exciting and memorable conclusion. It will intoxicate the viewer with its mood, like the scent of the flower after which this film was named. A masterwork from Powell and Pressburger.",
            "review_date": "2013-03-01",
            "source": "rt"
        },
        {
            "content": "It's pretty to look at and builds to an admittedly tense climax, the way to get to that point is chock full of unengaging, meandering melodrama, and Black Narcissus ultimately collapses under the weight of such monotony.",
            "review_date": "2013-02-27",
            "source": "rt"
        },
        {
            "content": "Quite a well made movie with an interesting story and plot. Especially impressive considering it was actually made in 1947 for its brave story and cinematography(studio).",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "Ahead of its time in depicting the descent of nuns into the carnal within a strange and isolated environment. It probably was treated as a forbidden film at the time. The strong imagery still makes an impact today.",
            "review_date": "2013-01-30",
            "source": "rt"
        },
        {
            "content": "I wasn't sure if I was going to like this at first, but the sound of the wind blowing in the Himalayas kept me hooked enough from the beginning to persist with it, and by the middle of the film, I was really enjoying the script, and by the end fully understood its place in the top 100 British films!",
            "review_date": "2013-01-09",
            "source": "rt"
        },
        {
            "content": "A breathlessly sensual film, even now highly provocative. The deconstruction of Western pretensions and blind imperialism as Deborah Kerr's order of nuns succumb to the atmosphere is startling enough, but the fact that it came out just before the collapse of the British Empire is nothing short of mind boggling. Kerr holds it all together, but Kathleen Byron is terrifying and unforgettable, and Jean Simmons and Sabu (in essentially cameos) are particularly memorable. Just like THE RED SHOES, its sheer beauty seduces you instantly... but the underlying tensions are rising to the surface, and the crash, once it comes, can't be stopped. A masterwork.",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "An atmospheric epic about relgious strength, temptation, culture clash, and over coming former identities, Black Narcissus is an ambitous drama that is well acted and visually stunning.",
            "review_date": "2012-12-28",
            "source": "rt"
        },
        {
            "content": "In rugged outback In-juh, a handful of pious British nuns lean to their work amongst the sweaty, heathen native hordes, only the climate, the people, the atmosphere, and A MAN, all combine to insidiously fragment the constitutions of these seeking only the Lord's good work.  Surprisingly filmed entirely in England in lustrous Technicolor, this adds little to the coliseum of opinion that going native is ultimately maddening, but does make for riveting entertainment nonetheless.  Simmons and Sabu simmer showing subtle, subordinate, savage seduction.",
            "review_date": "2012-11-26",
            "source": "rt"
        },
        {
            "content": "A truly sensational film from one of my favorite English Directing Duo Michael Powell & Emmerich Pressburger.\n\nThe story of Nuns trying to implement change in a village in the Himalayas and their personal & physical struggles doing it. This is a gorgeously shot, and like their other films the most stunning use of technicolor in film, the colors are so vibrant & lasting.\n\nThe story starts so strong but looses steam a bit mid to end of film, but the craftsmanship of this film is second to none.",
            "review_date": "2012-11-14",
            "source": "rt"
        },
        {
            "content": "Beautifully shot and with stellar art direction, this film certainly passes the eye test. Unfortunately, it's bland bordering on boring. From Hollywood's harmless Leave It To Beaver era, it's just way to saccharine for me. It harkens back to days of yore when men didn't swear and preferred to wear their pants up around their nipples.",
            "review_date": "2012-11-12",
            "source": "rt"
        },
        {
            "content": "Oscar-winning cinematographer Jack Cardiff's deliriously iridescent lensing of Himalayan landscapes evokes intoxicating exoticism and eroticism in Michael Powell and Emeric Pressburger's Technicolour masterwork about a convent of troubled nuns and their unavailing religious mission.",
            "review_date": "2012-11-10",
            "source": "rt"
        },
        {
            "content": "A perennial favorite, now with extra detail and more appropriate technicolor on blu-ray. The Archers, Powell and Pressburger, score a bullseye with this adaptation of Rumer Godden's tale of nuns transplanted to the Himalayas.  Of course, they slowly go crazy, due to culture shock, altitude, what have you.  Beautiful to watch and full of the heightened emotions that seem so extreme in these otherwise repressed Brits. There are a few glimpses of the attitudes of the times (toward the \"primitive\" locals) but generally these beliefs can be attributed to the characters not the filmmakers. This is a must see (for art direction alone!).",
            "review_date": "2012-10-24",
            "source": "rt"
        },
        {
            "content": "The visual aspect of \"Black Narcissus\" is definitely what makes it such a memorable, extraordinary experience. Incredible cinematography done by Jack Cardiff paired with colorful, bizarre production design and beautiful mountainous backdrops are without a doubt what the film will be remembered for, while its story and characters are somewhat forgettable. \"Black Narcissus\" is also dated and a little hokey, but it's so visually impressive that I can't not recommend it.",
            "review_date": "2012-10-23",
            "source": "rt"
        },
        {
            "content": "As someone who hated \"The Red Shoes,\" finding it to be grotesque where it should have been exhilarating, I was very pleasantly caught off guard by this film. I have always liked Deborah Kerr, so I knew there would be at least something pleasant in the film for me, but I was not prepared for how much I enjoyed the use of color, made even more extraordinary by the fact that the film was made in 1947, when color cinematography was still in its infancy. The great Jack Cardiff's work helps make this movie a near-masterpiece.\n\nI only call it a \"near-masterpiece\" since there are some of the usual European colonial attitudes, including the use of English Jean Simmons in quasi-blackface, that generally kick me out of these kinds of stories. But overall the film is beautiful, and quite moving in its portrayal of women whose lives have left them little choice but to persevere in demanding and often unrewarding work, and to find what dignity they can in that choice. The sexual hysteria of the previously-unknown-to-me Kathleen Byron was a nice extra, especially when she comes storming out of the chapel with that red dress and her hair all askew. Yikes!",
            "review_date": "2012-10-08",
            "source": "rt"
        },
        {
            "content": "This came across as slightly odd, but still exploited the religious and sexual tension.",
            "review_date": "2012-09-29",
            "source": "rt"
        },
        {
            "content": "Sure, \"Black Narcissus\" has wonderful colors, lighting and cinematography. But the story? Not much beyond its initial premise (nuns in the Himalayas), a stock \"scoundrel\" character and, eventually, one crazy nun who seems totally implausible. Mere visuals shouldn't be enough to establish this film as a major classic.",
            "review_date": "2012-09-19",
            "source": "rt"
        },
        {
            "content": "Man, I bet half you suckas don't even know what it's about.",
            "review_date": "2012-09-12",
            "source": "rt"
        },
        {
            "content": "Quite an amazing film - especially considering it was filmed in a studio 65 years ago using painted backdrops to represent the panoramic Himalayas.  Even the topic is refreshing - not all goes according to plan even for nuns.",
            "review_date": "2012-09-04",
            "source": "rt"
        },
        {
            "content": "BLACK NARCISSUS (1947) \nviewed on 20/9/04 (Mon)\n\nIt is more of an accomplishment in cinematography. The story is so-so. The acting not bad. The atmosphere will best for a horror story, which in this movie, it isn't. But come to think about it, all things else will most likely fade in comparison to the bold colours and cinematography. Now, I do not really like movies without a truly good story but I like this one. It will be a very pleasant viewing experience if you watch this very late at night. Don't know. Just think it will be perfect. \n\nRating: B",
            "review_date": "2012-09-03",
            "source": "rt"
        },
        {
            "content": "one of my all time favourite movies still has the power to whisk me away to the mountains of tibet even though it was all shot on the studio backlot!",
            "review_date": "2012-09-02",
            "source": "rt"
        },
        {
            "content": "It's striking to me that no part of \"Black Narcissus\" was shot on location; undoubtedly one of most refreshingly, visually evocative pictures I've seen, especially considering it was made in Technicolor and released in 1947 by The Archers:  Powell and Pressburger. The story concerns five nuns who are sent to the Himalayas to \"civilize\" the local people, build a school and hospital, with one of nuns being mentally unstable. Deborah Kerr stars as Sister Clodagh; she is the head of the convent and delivers an unflinching performance! There are quite a few dissolve shots, but one I most admired was when Sister Clodagh remembers a day at the sea with her ex-lover, as the shot concludes the two faces of Kerr melt into each other to create a mesmerizing affect. \"Black Narcissus\" seems to be more cherished because of its visual achievements, but I would argue that story itself is just as important. There are other major characters involved, including two men. I'm not fully sure what language Indians speak in the Himalayas, but I am guessing it's Hindi. Unless there is some language I was not aware of, the language used as Hindi appeared to be made up; I had no idea what they were saying, which is understandable considering the time it was made. The main setback of the movie is its climax involving the two nuns, which doesn't make much of an impression after the extraordinary suspense. This is one of Martin Scorsese's favorite films, happy to say I was not disappointed. I thoroughly enjoyed it and consider it one of the best films of the 1940s; very good, if not great.",
            "review_date": "2012-08-29",
            "source": "rt"
        },
        {
            "content": "Potent filmmaking. Each scene is alive with color, or lack thereof, and every shot is like a line in a poem. Every little thing matters. Where does duty end and life begin? Is there any escape from a cloistered life? Is sexuality madness, or is it madness to be celibate? Many questions, many emotions, all beautifully expressed here. All I can say is, keep thee from this nunnery. \n\nFavorite scene: When Sister Ruth (donning her seductive look) opens the door to Sister Clodagh ringing the bell over the windy valley and reciting Hail Mary, almost whispering it. Ruth's pale face and reddened eyes, the cinematography, the rising music, the incessant bell toll--burned in my memory. \"Never send to know for whom the bell tolls; it tolls for thee.\"",
            "review_date": "2012-08-16",
            "source": "rt"
        },
        {
            "content": "This movie is a work of art.  Visually stunning.  Thank god for Martin Scorsese or I would have never seen it.",
            "review_date": "2012-08-15",
            "source": "rt"
        },
        {
            "content": "This movie was a hysterical (both definitions work) depiction of nuns in the Himalayans.  Women going mad, men swaggering in to save the day, exotic royal generals and absurdly funny natives make this film yet another classic racist sexist depiction of American values in the 1940's.  The only reason I gave it two stars was because of how hillarious it was.  We've come a long way...phew!",
            "review_date": "2012-08-13",
            "source": "rt"
        },
        {
            "content": "Excellent cinematography, and coloured photography, made all the more impressive since the film was primarily shot on a set. Great direction by Powell and Pressburger. That aside, everything else is secondary. The visual look was really the only GREAT quality in the film, for me. Story, music, acting, etc. were all average.",
            "review_date": "2012-08-13",
            "source": "rt"
        },
        {
            "content": "A remarkable and beautifully shot melodrama from Powell and Pressburger.",
            "review_date": "2012-08-12",
            "source": "rt"
        },
        {
            "content": "I have to admit, I feel pretty embarrassed about my lack of appreciation for Black Narcissus. I really loved The Red Shoes and Peeping Tom, but this one was quite boring to me. It's easily one of the most beautifully shot classic films I have ever seen, but something just never grabbed me. I was never hooked. On one hand I loved the way Powell and Pressburger decided to tell the story about nuns in a way that shows them as human. They have their own temptations and a life before they entered the way of life. Also, even though they are all nuns who dress the same and hold the same beliefs, they are also unique individuals. Before this film, I'm sure these things were quite rare. It was probably a new way of thinking. I also loved the way they went into the memory of Sister Clodagh. The transitions were always smooth because there would be some kind of connection to an object or something said that would make her remember. I wanted to know exactly what made Sister Clodagh decide to become a nun if she was once in love. He story is truly sad and at the same time very human. She loved the same man for a long time and he decided to take a job and not bring her along with him. In order to handle the blow she decided to show that it wouldn't affect her, and becoming a nun must have been her way of doing so. So the basic story goes that there's a palace on top of a hill that's above a valley that's home to many poor people and the palace has been offered to the nuns by a general. Sister Clodagh goes up there to become the Sister Superior and run the new place. She's sent with Sisters Phillipa, Honey, Briony, and Ruth. When they arrive they meet Mr. Dean who doesn't really care much about them. So many people have come and gone so he doesn't expect them to stay. Mr. Dean reminds Sister Clodagh of her past life and relationship, and also stirs up jealousy within Sister Ruth, who already has a jealous rage underneath for not being chosen as the Sister Superior. These sisters all deal with secular problems like adjusting to life and remembering their pasts. On paper it sounds pretty good, but like I said before, I was never fully gripped. And it just made me dislike it more when the big moment is when Sister Ruth goes mad and tries to kill Sister Clodagh. It just seemed like a typical movie thing to do. If they are all up there, why not have some big murder climax? This just felt out of place. I guess I was expecting something more with it being from Powell and Pressburger. They have always done a good job of making me invested in the story and characters before. This time around I found things I liked, but just never really felt much. Perhaps one day I will see why I'm wrong, or someone can tell me what they liked so much about it, but as of now I must say that I'm not too impressed.",
            "review_date": "2012-08-08",
            "source": "rt"
        },
        {
            "content": "All manner of shenanigans is taking place on a hilltop convent, not least some rather splendid drama.",
            "review_date": "2012-08-01",
            "source": "rt"
        },
        {
            "content": "Unnerving and bizarre.  1001 movies to see before you die.",
            "review_date": "2012-07-03",
            "source": "rt"
        },
        {
            "content": "Often noted for its bold visuals, vibrant sets, and alluring screenplay-- 'Black Narcissus' stands out as one of the best English films ever made. And you do not want to miss Byron's performance as sister Ruth; she is exceptional. \r\n\r\n8.4/10",
            "review_date": "2012-06-22",
            "source": "rt"
        },
        {
            "content": "Powerful, erotic drama, thanks to a first-rate cast and Powell's superb direction.  The real star, though, is Jack Cardiff's brilliant cinematography and Alfred Junge's art direction, that manage to create a mystical version of India, despite having shot completely on a studio in England.  The kind of classic you just don't see much of anymore.",
            "review_date": "2012-06-18",
            "source": "rt"
        },
        {
            "content": "Among the many, many things that are wonderful about this film, I believe it's jack Cardiff's technicolor photography that steals the show and leaves the greatest impression in ones mind. It's dream like, hypnotic, hazy, and just brilliant!",
            "review_date": "2012-06-01",
            "source": "rt"
        },
        {
            "content": "Nuns on a mountain?  Heck yes!  Glorious technicolor mountains (colored in with pastel chalks, according to IMDB) where a veritable fortress hides in the Himalayas.  The sisters are sent there to administer medicine to the local population (although the local population is highly superstitious of them).  The only friend they have waiting there for them is Mr. Dean (David Farrar), assistant to the General.  Ironically, this \"palace\" was originally built to house the original General's many wives (and now it houses the brides of Christ).  It's not long before the isolation begins playing at the minds of the nuns and they begin to have doubts of faith.  \n\nThe technicolor illusions created in this film were said to be inspired by the dutch painter Johannes Vermeer, and the amazingly vivid and colorful backdrops are almost worth the price of admission alone.  The film is practically a painting come to life.  The story of the nuns is amusing and sometimes frightening and directed with a real flair by writers/directors Michael Powell and Emeric Pressburger.  It is deservedly one of the top films of it's decade.",
            "review_date": "2012-05-16",
            "source": "rt"
        },
        {
            "content": "Nuns on a mountain?  Heck yes!  Glorious technicolor mountains (colored in with pastel chalks, according to IMDB) where a veritable fortress hides in the Himalayas.  The sisters are sent there to administer medicine to the local population (although the local population is highly superstitious of them).  The only friend they have waiting there for them is Mr. Dean (David Farrar), assistant to the General.  Ironically, this \"palace\" was originally built to house the original General's many wives (and now it houses the brides of Christ).  It's not long before the isolation begins playing at the minds of the nuns and they begin to have doubts of faith.  \r\n\r\nThe technicolor illusions created in this film were said to be inspired by the dutch painter Johannes Vermeer, and the amazingly vivid and colorful backdrops are almost worth the price of admission alone.  The film is practically a painting come to life.  The story of the nuns is amusing and sometimes frightening and directed with a real flair by writers/directors Michael Powell and Emeric Pressburger.  It is deservedly one of the top films of it's decade.",
            "review_date": "2012-05-16",
            "source": "rt"
        },
        {
            "content": "Another masterwork from Powell and Pressburger, but more importantly, Jack Cardiff (director of photography).  Again, bathed in color with the three strip Technicolor process, it's a marvel even by today's standards.  I'm becoming a big fan of this duo of filmmakers.  They have impressed and entertained me immensely so far.",
            "review_date": "2012-03-31",
            "source": "rt"
        },
        {
            "content": "Visually a work of art. The scenic shots of the landscape look like beautiful picturesque paintings; a deep contrast to the twisted, gripping finale... a clever approach that makes the unfolding of events seem all the more shocking and unexpected.",
            "review_date": "2012-03-17",
            "source": "rt"
        },
        {
            "content": "Sex. Sex. Sex. Sex. Sex. Sex. Nuns. Sex. Sex. Sex. Sex. Sex. Sex. Sex.\r\n\r\nI cannot forgive the righteous contempt for faith, but I can watch this Powell/Pressburger on infinite repeat and admire the magnificent colors and, above all, the sex. Hitchcock once said that he wished one could play a love scene from across the room. He mused that the only way it could be done was through stripping. Strange, because surely Hitch would have seen BLACK NARCISSUS and witnessed the brutal repression, so potent that the screen should be sweating.\r\n\r\nBy sticking one hawt male into a colony of helpless nuns, we watch them struggle (and, in some cases, succumb) with forbidden senses. The color, composition and lighting lend to an intense modernity. In fact, the color is almost certainly heightened to encourage the emotional density, the hidden arousal. Tight tight tight close-ups emphasize changing ideologies and suggestive glances, especially in a remarkable display of rapid triangle editing. Fades and flashbacks are inserted into prayer, furthering the theme of repressed sexuality and its destruction of faith, if we weren't already sure of it.\r\n\r\nBLACK NARCISSUS is a shallow narrative. The characters have unclear motivations other than needing some pleasure and women are depicted as pathetic, incapable of mastering their own desires. But the film has become an infinitely intriguing study of sexual liberation in the presence of faith and what repression just might do to the weak mind of women.\r\n\r\n69.696969",
            "review_date": "2012-03-10",
            "source": "rt"
        },
        {
            "content": "Sex. Sex. Sex. Sex. Sex. Sex. Nuns. Sex. Sex. Sex. Sex. Sex. Sex. Sex.\n\nI cannot forgive the righteous contempt for faith, but I can watch this Powell/Pressburger on infinite repeat and admire the magnificent colors and, above all, the sex. Hitchcock once said that he wished one could play a love scene from across the room. He mused that the only way it could be done was through stripping. Strange, because surely Hitch would have seen BLACK NARCISSUS and witnessed the brutal repression, so potent that the screen should be sweating.\n\nBy sticking one hawt male into a colony of helpless nuns, we watch them struggle (and, in some cases, succumb) with forbidden senses. The color, composition and lighting lend to an intense modernity. In fact, the color is almost certainly heightened to encourage the emotional density, the hidden arousal. Tight tight tight close-ups emphasize changing ideologies and suggestive glances, especially in a remarkable display of rapid triangle editing. Fades and flashbacks are inserted into prayer, furthering the theme of repressed sexuality and its destruction of faith, if we weren't already sure of it.\n\nBLACK NARCISSUS is a shallow narrative. The characters have unclear motivations other than needing some pleasure and women are depicted as pathetic, incapable of mastering their own desires. But the film has become an infinitely intriguing study of sexual liberation in the presence of faith and what repression just might do to the weak mind of women.",
            "review_date": "2012-03-07",
            "source": "rt"
        },
        {
            "content": "Although the movie is a little long and has a weird subject matter, the color cinematography by legend Jack Cardiff, the performance of Deborah Kerr and some unintentional funny moments make this a good watch.",
            "review_date": "2012-03-04",
            "source": "rt"
        },
        {
            "content": "Powell, Pressburger, and Cardiff deliver one of the most visually stunning pictures ever made. Unfortunately the story doesn't hold up as well, being very slow and melodramatic.",
            "review_date": "2012-03-03",
            "source": "rt"
        },
        {
            "content": "Five nuns start a convent in a remote countryside in India.  Along the way, they face internal and external pressures.  Once again, the writer-director team of Michael Powell and Emeric Pressburger scored a bull-eye with this picture.  The movie boasts some of the most breathtaking color cinematography and production design in the history of cinema.  The movie won Oscars for Jack Cardiff's cinematography and Alfred Junge's sets.  Fascinating and chilling...",
            "review_date": "2012-02-06",
            "source": "rt"
        },
        {
            "content": "You will never see such danger created in a studio as you will see in Michael Powell and Emeric Pressburger's Black Narcissus. The vertigo inducing set design is almost matched by Deborah Kerr's brilliant, and at times, maniacal performance.",
            "review_date": "2012-02-02",
            "source": "rt"
        },
        {
            "content": "Beautifully conveys the faded glory of the palace and the atmospheric isolation of the location, in the cunning artifice of studio filming. Sadly the story is nonsense, with the apparent working title of Why Are Bloody Women So Hysterical?",
            "review_date": "2012-02-02",
            "source": "rt"
        },
        {
            "content": "Black Narcissus is an incredibly beautiful and erotic film about 5 missionary nuns who start a new convent in a former palace in a remote village in the Himalayas.  Narcissus is a very sensual and surreal film; like The Red Shoes it uses the Technicolor, the cameras and the music to enhance the exotic surroundings to impart dreamlike quality, showing the dizzying heights of the Himalayas, even though the movie was filmed in Wales, and subtle shots of naked Hindu goddesses in sultry poses and a belly dance tease by a young Indian girl.  Jack Cardiff and his team really deserved the awards for cinematography and art direction.  As with all the Michael Powell and Emeric Pressburger movies Iâ(TM)ve seen (four now), the writing is very well done and you immediately know what it is they are trying to say and this story is about female desire and what repression of those desires does to them.  These stoic, fastidious nuns are met with blissfully exotic surroundings, clean water, constant wind, exotic smells and men; old forgotten memories and desires start flooding back and it makes one nun plant an entire vegetable garden full of flowers and another have a lapse of faith.  They can usually turn the surroundings off and concentrate on work but this place is different and you actually get a sense of how different.  Kathleen Byron stands out as Sister Ruth; her performance is very intense and outspoken; she is visibly on the verge the whole time but itâ(TM)s subtle.  David Farrar, as Mr. Dean, the British agent in the village, is perfect for this movie.  He is tall, dark and handsome and the sparks fly every time heâ(TM)s onscreen.  The rest of the cast all give great performances and you know that the actors were all chosen very carefully and are believable.  The title, Black Narcissus, is very fitting because it refers to cologne worn by a character, and the movie reminds me of smelling cologne; the way it brings a memory like a mist.  This is what those sisters experience and the amount of work and innovation that went in to conveying that to the viewer is why Powell and Pressburger were two of the best filmmakers of their day and their influence is seen even today.",
            "review_date": "2012-01-30",
            "source": "rt"
        },
        {
            "content": "I appreciate controversy as much as the next man, but not being in my 70's can't appreciate it in this day and age really. Without that, it's a fairly dull film. What film about nuns on a mountain in the himalayas wouldn't be?",
            "review_date": "2012-01-08",
            "source": "rt"
        },
        {
            "content": "Powell & Pressburger show off their visual storytelling with their melodrama Black Narcissus.  Deborah Kerr eviscerates the frame with her performance as the head nun at a hospital in the Himalayas.  Black Narcissus is par for the course for Powell & Pressburger.  In other words ... it's bloody brilliant.",
            "review_date": "2012-01-07",
            "source": "rt"
        },
        {
            "content": "I'm on a quest this year (2012) to see all of Jack Cardiff's films. Cardoff was cinematographer for this film. The film, is a marvel since it was NOT shot on location. What early cinema did with painted glass (matte paintings) is wonderful.  Amazing  cinematography! I suggest that if this is your first Jack Cardiff film, you should watch the free documentary on YouTube about Cardoff.  You will appreciate what you are seeing much more. (http://www.youtube.com/watch?v=_7dQ5W9NMLA&feature=related). This picture has exceptional photography and a good solid story line. Great film.",
            "review_date": "2012-01-05",
            "source": "rt"
        },
        {
            "content": "One of the archer's classics, and a very well deserved 100%.",
            "review_date": "2011-12-13",
            "source": "rt"
        },
        {
            "content": "Nuns, the Himalayas and sexual tension has low budget exploitation written all over it and shouldn't be anywhere near as gripping as it is. I must admit that I have seen little to none of Powell and Pressburgers work before now but after this I shall make a conscious effort to seek out more of their work.",
            "review_date": "2011-12-06",
            "source": "rt"
        },
        {
            "content": "A group of British nuns in a remote but picturesque Tibetan mission struggle with repression and temptation, and all in glorious technicolor. Some of the acting may seem a little overwrought by contemporary standards, but the portrayal of ascetics fighting to batten down the hatches of their desires in a sensuous and exotic environment ring true, even if the object of those desires, bare-chested and shorty shorts wearing David Farrar as Our Man in Tibet, provokes occasional inappropriate laughter.",
            "review_date": "2011-11-11",
            "source": "rt"
        },
        {
            "content": "British nuns in a convent far up in the Himalaya mountains succuming to madness. Powell and Pressburger's colorful technicolor film is one that brings the audience into the uncomfortable downward spiral way up in the high altitudes, with gorgeously made setpieces(!) built in Pinewood. That's right, nothing was shot in India, believe it or not. Magical, and sometimes frightening.",
            "review_date": "2011-11-07",
            "source": "rt"
        },
        {
            "content": "Black Narcissus is a beautiful and spellbinding film. It is about five nuns opening a convent in the Himalayas. Deborah Kerr and Sabu give excellent performances. The screenplay is well written. Michael Powell and Emeric Pressburger did a great job directing this movie. I enjoyed watching this motion picture because of the setting and captivating story. Black Narcissus is a must see.",
            "review_date": "2011-11-04",
            "source": "rt"
        },
        {
            "content": "The film has great cinematography, but it's dragged down by over-dramatic and poorly mixed soundtrack music. Actually, it's hyper-dramatic...really quite embarrassingly excessive at some points, and merely a nuisance at others.\r\n\r\nThe acting ranges from brilliant (Deborah Kerr, David Farrar, Flora Robson) to good (everyone else). Kathleen Byron's performance was more caricature than convincing as the psychotic nun Sister Ruth, although most of that can be laid at the director's feet.\r\n\r\nIt's not uncommon to find glowing praise for the technical accomplishments in this movie, which apparently account for at least some its reputation as a \"classic\". Maybe so, but none of that can save the film from its worst fault: the story. \r\n\r\nI judge a movie by the way it makes me feel when it's over, or by whether it inspires me, or elevates me, or tickles me, or fascinates me, or stimulates me to think about things I've not considered before. Black Narcissus does none of that. It's actually quite a dark and depressing story. In the end, it turns out to be a big fat bummer, and all of the films strengths can't redeem that fatal flaw.",
            "review_date": "2011-11-02",
            "source": "rt"
        },
        {
            "content": "Visually gorgeous and pretty damn creepy for the 40s! You would never know it was all shot in England... really fantastic set. Slow start- but who cares, it's so great looking- but the freaky ending more than makes up for it.",
            "review_date": "2011-11-01",
            "source": "rt"
        },
        {
            "content": "melodramatic and beautifully shot from beginning to end.",
            "review_date": "2011-10-20",
            "source": "rt"
        },
        {
            "content": "After watching \"The Red Shoes\", I felt compelled to explore a bit further the visionary filmmaking team of Michael Powell and Emeric Pressburger. Their collaboration produced some of the best British movies of the 1940's in the glorious days of Technicolor. \nBlack Narcissus is yet another wonder to behold, featuring breathtaking scenes of the Himalayas, and exquisite photography all along, in a classic melodrama with gothic horror undertones , about a group of Anglican nuns fighting with the sensuality of the environment, the ferocity of the elements, and their own repressed memories and desires. The suspenseful climax is a lesson in the art of filmmaking.",
            "review_date": "2011-10-13",
            "source": "rt"
        },
        {
            "content": "You know what I'd like for Christmas? Not in a real sense - I'm happy with cash this year, and if you want to contribute, drop me a line & I'll give you my PO Box details. I mean in a \"things in movies which haven't been invented yet\" kind of sense. I'd like one of those 3D virtual reality sunbed things from \"Minority Report\", and I'd use it to watch old Powell & Pressburger extravanganzas.\r\n\r\nI\"d stick on \"Black Narcissus\" and stand around in an ancient pleasure palace, looking dishy and trying to keep my trousers on, while getting lusted after by two hot nuns, then come out with a ravishing technicolour tan.\r\n\r\nIf you haven't seen \"Black Narcissus\" before, I suppose that introduction might make it sound more appealing than the standard blurb - a band of Anglican nuns are dispatched to an outpost deep in the Himalayas to set up a school and hospital for the natives.\r\n\r\nThe woman in charge is Sister Clodagh (Deborah Kerr), a stern and ambitious Sister Superior. She wants the post, although her Mother Superior has doubts about her ability. The location for this new convent is an ancient palace, which many years before used to house a harem. More recently, a group of monks also attempted to inhabit the lonely palace, perched far above the villages and forest on a sheer cliff face.\r\n\r\nThe sisters' contact in the area is a British agent, Mr Dean (David Farrar), is a dishy if rather irreverent presence. He singles out Sister Clodagh with his suggestive and innuendo-laden comments, and his arrogance and lack of respect soon gets her hot under the habit.\r\n\r\nThe old palace, with it's erotic paintings and peculiar atmosphere, soon has a queer effect on the nuns, most notably Clodagh, and the poorly Sister Ruth (Kathleen Byron), who develops a fierce attraction to the brash Mr Dean.\r\n\r\nIt soon turns out that Clodagh isn't as cold and pious as she first seems, and perhaps it's the mountain air, but her mind starts to wander during prayer, and she also secretly starts to feel a bit giddy about the British agent.\r\n\r\nMeanwhile, the natives aren't too keen on visiting the nuns for either their education or their welfare - it is revealed the local General is paying the villagers to visit. Dean also lumbers them with a local piece of jailbait, Kanchi (Jean Simmons) in the hope the influence of the nuns will be beneficial to her, and more likely, to stop her mooning around his house making eyes at him.\r\n\r\nAll this comes to a crescendo when Sister Ruth, who turns out to be mentally frail as well as physically, throws herself at Mr Dean. She is disgraced, and begins a descent into murderous insanity...\r\n\r\n\"Black Narcissus\" is one of a hat trick of technicolour masterpieces by Michael Powell and Emeric Pressburger, along with \"A Matter of Life and Death\" and \"The Red Shoes\". All three are elevated by Jack Cardiff's sumptuous cinematography, and curiously for films almost universally regarded as masterpieces, all three are far from perfect.\r\n\r\n\"A Matter of Life and Death\" (1946), a fantastical and warm hearted romance about a young WWII pilot who bails out of his craft without a parachute and survives, only to be summoned to heaven on the basis of a celestial clerical error, is virtually flawless until the final courtroom scene, which degenerates into a Brits vs Yanks sermon.\r\n\r\n\"The Red Shoes\" , the tale of a talented ballerina who is destined to suffer the same fate as the character she portrays in the ballet of the same name, is rather stiff and old fashioned until it's stunning ballet sequence - then everything is forgotten and it becomes the best thing you've ever seen.\r\n\r\n\"Black Narcissus\" suffers from some rather muddled characterization, and it's not always clear who's who or what their motives are. Clodagh and Ruth are initially quite difficult to tell apart on first viewing, because both actresses are facially quite similar when smothered by a nun's habit, with only their faces showing.\r\n\r\nBut it hangs together more as a narrative, because it's not as top- or bottom-heavy as the other two. And it's perhaps an easier watch for modern audiences because although it is variously described as an adventure, or a romance, or a melodrama, the thing it resembles most in structure is a horror movie.\r\n\r\nThere's the old haunted house on the hill, although it's never explicitly made clear whether Mopu is actually haunted, or whether it's one of those places people bring their own ghosts.\r\n\r\nThere is the story of the monks, whose previous attempt to inhabit the palace ended in failure - this is a classic touch of foreshadowing most familiar to fans of horror films. Think of the story of Grady, the axe murdering former caretaker of the Overlook in \"The Shining\"; the derelict spaceship full of eggs in \"Alien\"; or the Norwegian base in \"The Thing\" - bad things have happened in this place, so chances are, bad things are going to happen again...\r\n\r\nSister Ruth's final, desperate, unhinged pursuit of Dean and Sister Clodagh resemble something out of a 80's or 90's psycho-thriller, and the final reel is full of suspense as Clodagh is stalked by the her murderous, unwitting rival in love.\r\n\r\nAlso adding to the tension is the tangible erotic charge, which is largely thanks to Jack Cardiff's sublime cinematography, particularly the use of colour and shade.\r\n\r\nWhen we first see Clodagh, it is in close up - a pale white face in a ghostly white habit, harsh eyes and tight white lips. Our first blast of colour is on our first visit to the palace - a room filled with empty gilded cages, and a first glimpse of the General, resplendent in silks, preening himself by a mirror in a bright blue room.\r\n\r\nLater, as passions grow wilder, the reds come into play - most startlingly on formerly white lips - and as the film builds to its conclusion, the nuns' habits seemed almost stained with the colour.\r\n\r\nA subplot involving Kanchi falling romantically for a young prince doesn't really add much, apart from more eroticism - on Kanchi's first time alone in the palace, she is seen dancing sensually by herself; she spends most of her time crawling around on hands and knees trying to get the prince to notice her. And in one unfortunate moment, she appears to be moving in to give him a blowjob.\r\n\r\nThis can't have been by accident, given how meticulous and gifted filmmakers the people involved were - but, they had oral sex back in 1947, so they must have realized it looked like the prince was going to get lucky in that scene.\r\n\r\nAside from a few of these duff moments, \"Black Narcissus\" is thoroughly absorbing and at times transcendent, mainly due to the miraculous work of Cardiff and the production team. Some moments and images in \"Black Narcissus\" are indelibly imprinted on my mind - most notably Sister Clodagh's walk across the windswept courtyard of the palace to ring out the noon bell on the cliff's edge for the first time.\r\n\r\nIt's an old one, but they truly don't make films like this any more - the atmosphere of lush exoticism is thick in every frame, and the ingenious model work and matte paintings create the palace as an almost hyper-real setting for the drama.\r\n\r\nAnd because they don't make 'em like this anymore, you deserve to watch it on the biggest screen possible...perhaps invite some close friends round and have a naked \"Black Narcissus\" party.\r\n\r\nOr instead, until they finally invent \"Minority Report\"-style 3D virtual reality sunbeds, perhaps you could petition your nearest IMAX cinema to give you a private screening of this classic? That would be the perfect way to see it...\r\n\r\n(First posted on Ciao! as Midwinter)",
            "review_date": "2011-10-08",
            "source": "rt"
        },
        {
            "content": "Great cinematography, OK story.",
            "review_date": "2011-10-02",
            "source": "rt"
        },
        {
            "content": "Five missionary nuns (Kerr, Robson, Byron, Laird, and Furse) are sent by Mother Superior to set up a convent in the Himalayas. Kerr's character Sister Clodagh is set in charge, but the weather and the lifestyles that the people around them set each and every one of them to question their religion. \"Black Narcissus\" is one of the most important films the directing team of Michael Powell and Emeric Pressburger who changed filmmaking completely. Before they came around, audiences in America though drama meant, \"Poor Bette Davis is having a bad time!\" or \"Why would Greta Garbo's husband leave her?\" But when Powell and Pressburger came along with \"The Life and Death of Colonel Blimp\" and \"A Matter of Life and Death\" people were shocked that movies could actually have meaning! \"Black Narcissus\" has a serious plot, and though it doesn't have much of a message to it like an Ingmar Bergman movie might, it achieves many factors that no other directors could do, by using the rich, Academy Award winning Technicolor cinematography (the best I've ever seen) to achieve emotion, and of course they use the excellent actors to their fullest, especially the under-appreciated Kathleen Byron. In many ways this is a perfect film, and every single thing done is something that most filmmakers yearn to do, but Powell and Pressburger did it every time. But little did audiences know that something more was coming along with \"The Red Shoes\"... \"Black Narcissus\" is an excellent drama is just as impressive as it is entertaining. Highly recommended.",
            "review_date": "2011-10-01",
            "source": "rt"
        },
        {
            "content": "Amazing...from the sets to the colors to the performances, this film is very much a quiet creeper. The elements begin to take their toll on the sisters as they struggle to tame the land, the natives and themselves.",
            "review_date": "2011-09-30",
            "source": "rt"
        },
        {
            "content": "This is my fourth dir. Michale Powell's film I've seen; Red Shoes, the tales of Hoffmann n peeping Tom. He hasn't disappoint me yet. Like his other films, visuals n colors r amazing! It's little boring n slow in the beginning, but once the conflict becomes clear n the characters start to evolve, it totally absorbs ur full attention. Good characters and great acting. Although I wasn't little fan of David farrar. His custom makes him looks alike a clown; couldn't take him seriously. The story is good, it's typical love triangle, but with very interesting subtext; crash of culture, temptations n sins, etc.  If u haven't seen it, I recommend u to watch this at least once.",
            "review_date": "2011-09-30",
            "source": "rt"
        },
        {
            "content": "Fantastic art direction/set design/makeup but boring story.",
            "review_date": "2011-09-28",
            "source": "rt"
        },
        {
            "content": "Amazing Technicolor photography kept me interested through dramatic performances that have not stood the test of time spectacularly well.. As with \"The Red s\nShoes\", it feels like 10-15 minutes of amazing timeless cinema wrapped up in a 2 hour melodrama where everyone looks a bit the same.",
            "review_date": "2011-09-07",
            "source": "rt"
        },
        {
            "content": "Eye fucked and mind fucked at the same time.",
            "review_date": "2011-09-04",
            "source": "rt"
        },
        {
            "content": "Black Narcissus is as erotic and suspenseful as any of today's psychological thrillers.The color photography is powerful. One of the most beautifully composed color films in Technicolor. It is astonishing that this was all achieved without leaving the suburbs of London.",
            "review_date": "2011-08-12",
            "source": "rt"
        },
        {
            "content": "Certainly the most fantastic of their many acclaimed films from the 1940s, Michael Powell and Emeric Pressberger's \"Black Narcissus\" captivates by virtue of its exquisite pictorial externalization of the story's mood. The magnificently photographed setting â\" a decaying palace atop a perpetually windy Himalayan peak â\" vividly mirrors the gusty suppressed emotions of the characters. The film examines the futility of imperialism and the age-old conflict between religious headiness versus carnal desire.",
            "review_date": "2011-07-19",
            "source": "rt"
        }
    ]
}