{
  "title": "Billy Elliot",
  "rating": 7.4,
  "release_date": "2000-10-13",
  "genre": [
    "Drama",
    "Comedy",
    "Music"
  ],
  "summary": "The life of 11-year old Billy Elliot (Bell), a coal miner's son in Northern England, is forever changed one day when he stumbles upon a ballet class during his weekly boxing lesson.  (Universal Focus)",
  "critic_reviews": [
    "People who see it may feel like dancing out of the theater afterward. Go for it.",
    "Strikes a delicate balance of comedy and pathos with an uplifting final act that delivers a resoundingly satisfying emotional payoff.",
    "You'd be hard-pressed to find a purer expression of rapture in a film this year than the one that opens Billy Elliot.",
    "Best of all, Billy (Jamie Bell) is that rarity in a film distributed by Hollywood: a real boy, confused at 11 about almost everything.",
    "It's not just a movie about an underdog who fights the odds, it's about following one's heart -- despite the obstacles.",
    "Director Stephen Daldry gets it right.",
    "By setting this intimate conflict against a wider social drama, Daldry makes his portrait of a dancer all the more compelling.",
    "An exhilarating, funny and deeply sad story of growing pains that works on two levels; it's a feel-good story that quietly undermines the notion of gain without loss.",
    "A surprisingly wise and funny meditation on the nature of what it truly means to be a man.",
    "A delicate balance of fantasy and realism, caricature and character study that isn't driven primarily by its plot or even the development of its protagonist.",
    "You'll feel moved and uplifted after watching this well-written, funny movie.",
    "Anchors its melodramatic formula in tough, heartfelt realism.",
    "Can be as howlingly funny as it is touching.",
    "Trumpets the worthwhile message that ballet is just as manly and athletic as any other masculine activity - and maybe a touch more so, if you have to defy an uncomprehending community in order to pursue it.",
    "As much parable and fantasy as it is realistic.",
    "Good, colorful fun, and by virtue of its emphasis on escape through individual initiative rather than class solidarity, more likely to succeed with American audience.s",
    "Even as the director, Stephen Daldry, places his star front and center, he doesn't know how to highlight him.",
    "There's too much miserable reality and not a lot of transcendent dance, and the director, Stephen Daldry, doesn't cover the action from enough angles.",
    "In its determination to overdo sure-fire material, Billy Elliot becomes as impossible to wholeheartedly embrace as it is to completely reject.",
    "There's actually a lot going on in this little movie, and first-time feature director Stephen Daldry, turning his talents from the theater, handles all of it deftly.",
    "It orders you to love it. It demands love, which is the best way not to get it."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Fantastically acted, wonderfully entertaining, funny and just sad enough to make it heartwarming enough to make it one of my favorite movies. I give this movie a great 92%.",
      "review_date": "2012-02-08"
    },
    {
      "review_title": null,
      "content": "\"Billy Elliot\" as another reviewer already said, improves with each watching. Jamie Bell gives a performance of a lifetime. Julie Walters does a terrific job as well. Excellent movie.",
      "review_date": "2011-11-24"
    },
    {
      "review_title": null,
      "content": "Compelling and funny at sporadic intervals. Otherwise pretty by-the-numbers. Would have given this three or four points if not for Jamie Bell's performance. I got the impression that the film got away with its maudlin sentimentality, Compelling and funny at sporadic intervals. Otherwise pretty by-the-numbers. Would have given this three or four points if not for Jamie Bell's performance. I got the impression that the film got away with its maudlin sentimentality, cynically constructed melodrama and banal use of montage to the soundtrack of played-to-death British rock \"anthems\" on the back of it being set in County Durham where of course people talk and act so differently. As a resident of the area myself and having been born in the town that this film was set, I resent that the makers of this film made no attempt to give audiences from elsewhere any idea of what it feels like to live here.",
      "review_date": "2006-07-23"
    },
    {
      "review_title": null,
      "content": "\"A young boy in a poor mining community in Northern England, wants to learn ballet, to which he seems a natural at, despite his disapproving father who feels that ballet is un-manly.\" Now, doesn't that sound like the hokiest premise ever?\"A young boy in a poor mining community in Northern England, wants to learn ballet, to which he seems a natural at, despite his disapproving father who feels that ballet is un-manly.\" Now, doesn't that sound like the hokiest premise ever? But, you'd be surprised.",
      "review_date": "2011-08-25"
    },
    {
      "review_title": null,
      "content": "Beautiful, uplifting, warm, emotive. Many positive adjectives for a film that is aging just right. The story is compelling and different from what we are used to. Of course the big star and what makes the film a total winner is the childBeautiful, uplifting, warm, emotive. Many positive adjectives for a film that is aging just right. The story is compelling and different from what we are used to. Of course the big star and what makes the film a total winner is the child actor (and adult actor nowadays, not with that much shine compared to this role in his younger years). Impressive acting by him, especially the dancing scenes. The supporting cast could have been better, although his teacher is a great character and the actress too. Great soundtrack too.",
      "review_date": "2015-04-20"
    },
    {
      "review_title": null,
      "content": "Cried along with the boy and his family. Movies that recreate real emotions and try to make them as close as possible to the movie, are always worth watching. Suffering, loving - that's a durable platform to step on.",
      "review_date": "2019-01-16"
    },
    {
      "review_title": null,
      "content": "Alors, ça se passe dans l'Angleterre des années 80, celle des mineurs en grève et le gamin de 11 piges se découvre une passion pour la danse classique. Evidemment, le gamin a perdu sa maman, le grand frère est un connard et le papa en a grosAlors, ça se passe dans l'Angleterre des années 80, celle des mineurs en grève et le gamin de 11 piges se découvre une passion pour la danse classique. Evidemment, le gamin a perdu sa maman, le grand frère est un connard et le papa en a gros sur la patate. Et puis, dans ce milieu viril de mineurs, la danse, c'est pas trop leur truc, vous voyez. Ce serait plutôt la bière et la boxe en fait.On est en plein dans le film social, pétri de bonnes intentions très naïves, d'optimisme béat et de tolérance : peace and love mes frères, heal the world et patati et patata. Bon, j'anticipe un peu puisque Michael Jackson n'était pas encore blanc à cette époque mais vous voyez l'idée. D'ailleurs, ils ne passent pas vraiment \"Heal the world\" mais la musique locale faisandée des années 80 aux paroles aigries et vindicatives : bref, de la soupe ringarde mais passons.Pendant tout le film, le petit Billy répète qu'il n'est pas pédé parce qu'il veut faire de la danse et que tous les danseurs ne sont pas des pédales et c'est tout-à-fait vrai. Mais tout de même, les danseurs, c'est comme les coiffeurs, je crois que le métier prédispose, statistiquement parlant bien entendu. Se dédouaner ainsi régulièrement et lourdement, cache je crois une certaine inquiétude dans le film.Naturellement, passé la première heure, on devine aisément comment tout cela va se terminer : tout simplement avec de la guimauve et un angélisme merveilleux à faire mourir de honte n'importe quel production Disney. C'est tellement lourdingue que le temps semble bien long mais ils en rajoutent encore plusieurs couches au cas où...Oui, on a bien compris le message social : élevez-vous, travailleurs, dépassez le carcan de votre classe : vous aussi, vous pourrez aller danser en collants, **** chaussons et bien maquillés sur du Tchaïkovsky ! filles ou garçons d'ailleurs, LBGT compris(e), cela va sans dire.En dehors cela dit de tout jugement de valeur et de coiffeur, je pense que le ballet est la chose la plus ridicule que l'on puisse voir : ces gesticulations affectées sont grotesques et c'est un argument que le père (et la famille) aurait pu expliquer tranquillement au jeune ado en perte de répères.Il reste un film qui peut se laisser regarder à dose homéopathique mais pas trop longtemps d'affilée, car l'agenda socialo-benêt porte singulièrement sur les nerfs.",
      "review_date": "2017-12-28"
    },
    {
      "review_title": null,
      "content": "Really beautiful film. Bell and Waters are simply superb.",
      "review_date": "2007-01-03"
    },
    {
      "review_title": null,
      "content": "great story, great dancing. although not as good as the musical in London",
      "review_date": "2006-01-22"
    },
    {
      "review_title": null,
      "content": "No one on earth can deny the high quality of dramedy of the tiny dancer who reach his dreams despite the opposition of his father. Even the OST has own charm. For watch over and over.",
      "review_date": "2019-04-07"
    },
    {
      "review_title": null,
      "content": "The plot pace is quite fast, in as much as Billys clear interest in dancing and choreography via ballet is brought to light within the first twenty minutes. The film is set in the economically bleak period of the 1984 miners strike, a harshThe plot pace is quite fast, in as much as Billys clear interest in dancing and choreography via ballet is brought to light within the first twenty minutes. The film is set in the economically bleak period of the 1984 miners strike, a harsh time for the north of England, where this film is set. Thematically this film covers gender stereotypes, cross dressing and other taboos, or what certainly were at the time, plus the social class system perhaps. More symbolically perhaps, this film deals with determination, (self) identity and expression. Although I was familiar with the main story, I found there to be a few plot twists that I wasn't aware of and which (thus) took me by surprise. I thought its quite a good film from a 'beating the odds' sort of perspective, although no doubt for some it'll seem a bit too obvious and/or sentimental, which I guess comes down to your personal taste in films and the like.The film features an eclectic soundtrack, consisting of both 1970s and 1980s chart hits, including T. Rex 'I Love To Boogie' and 'Children Of The Revolution',   'London Calling' by The Clash and 'Town Called Malice' by The Jam. There also numerous classical orchestral pieces. I liked the fact that the tracks were quite uplifting and optimistic in tone, compared to the bleak setting, as both the local community are clearly in turmoil but moreso the Elliot family in general struggling to get through, having to attempt to move on from Billys mothers tragic passing. I felt there was an uplifting element to it.It may seem (the film in general, this is not strictly referring to the soundtrack) perhaps a little simplistic but I felt the balance between optimism and pessimism, the mix of good and bad did seem believably realistic. It had a bit of a 'Hollywood' feel to it, (particularly at the end I suppose) in as much as it being the tale of an underdog wanting to succeed in being allowed to express himself in the way he feels most comfortable and to heck with how others judge him but I did feel that the way the the local community and perhaps more importantly his closest family members, reacted to his new found 'hobby', seemed fairly plausible to me anyway.I found myself feeling quite concerned for the various characters, due to their bleak circumstances. Some scenes are quite emotional and I must say that the cast did a stellar job in giving very powerful performances, most noteably of course Jamie Bell, who plays the title character Billy, Julie Walters, who plays the ballet/dance teacher (both of which won numerous awards for their roles) and Gary Lewis, who plays Billys dad. Billys dads response in certain scenes and at certain points I found to be quite touching and I felt that overall the film was both entertaining and engrossing. Some scenes are quite tense and I felt keen throughout to find out what the outcome would be. Its not an especially long film, which is always a plus side in my book, with it having a running time of approximately 1 hour 45 minutes.Content wise, there is strong language and moderate violence present in this film, plus sex references and partial nudity but nothing too graphic. Yes, I'd recommend this film. It features some poignant dialogue with some very tense and emotional scenes, a good soundtrack, memorable performances and covering a number of important social themes/issues.",
      "review_date": "2021-11-20"
    }
  ],
  "num_reviews": 32
}