{
  "title": "Book of Shadows: Blair Witch 2",
  "rating": 3.3,
  "release_date": "2000-10-27",
  "genre": [
    "Mystery",
    "Thriller",
    "Horror",
    "Crime"
  ],
  "summary": "Students at a Boston college become fasinated by the missing filmmakers, so they decide to go into the same woods and find out what really happened. They pitch a tent for the night and terrifying things start to happen. When they try to escape the woods, they realize something is following behind them.",
  "critic_reviews": [
    "It's a muddled, sometimes-atmospheric effort.",
    "A flat, heebie jeebies thriller.",
    "A clever if muddled collection of riffs on the \"Blair Witch\" juggernaut, dressed up with intellectual pretensions by Joe Berlinger, who directed this film with a chortling zest.",
    "It never actually coalesces into a movie.",
    "The assault is against our ears, as the soundtrack pours forth a stream of thrash and Goth music.",
    "The characters are boring, the violence generic, the suspense nonexistent.",
    "Can't scare up a decent plot.",
    "While not entirely successful, at least deserves points for creativity.",
    "Downright awful.",
    "We're only a little spooked, only a little amused and, by extension, only a little entertained.",
    "It doesn't have the imagination or daring to make a full turn to self-parody.",
    "Admirers of \"The Blair Witch Project\" are going to be left high and dry.",
    "There's nothing scarier than a group of hormone-crazed 20-somethings, but this sequel isn't much more than a footnote of a footnote.",
    "Lordy, what a stinker.",
    "A straight exploitation story.",
    "Filled with all manner of tawdry tricks.",
    "It's just another bad horror film with inadequate young actors chased around a big house by something.",
    "Disappointing in every aspect.",
    "A schizoid monster slapped together by uneasy bedfellows.",
    "Guaranteed to inspire many more belly laughs than it does actual shivers. Boo, scary? I think not.",
    "Doomed to be inconsequential and forgettable.",
    "Worse than dull. It's parasitic."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "terrible. absolutely terrible. almost NOTHING to do with the original. the original was a great film, and if you saw it and loved it, steer clear of this abomination. bad acting, pointless storyline, STUPIDITY that surrounds the plot...it allterrible. absolutely terrible. almost NOTHING to do with the original. the original was a great film, and if you saw it and loved it, steer clear of this abomination. bad acting, pointless storyline, STUPIDITY that surrounds the plot...it all adds up to make, lets face it, a pretty crappy film. the end is not explained; the characters are just taken to jail, without a hint at what actually happened??get the original writers directors and producers back for a REAL sequel please.",
      "review_date": "2010-08-16"
    },
    {
      "review_title": null,
      "content": "A terrible movie. I hated every second of it. Don't watch it, it's that simple.",
      "review_date": "2007-05-09"
    },
    {
      "review_title": null,
      "content": "I think the director got bored with this \"new project\" and asked his teenage son to direct it or something, i mean, i did NOT get it, there were these twenty year old people having sex in the middle of the woods, maybe cause there's I think the director got bored with this \"new project\" and asked his teenage son to direct it or something, i mean, i did NOT get it, there were these twenty year old people having sex in the middle of the woods, maybe cause there's nothing also to do, then they wake up the next day not knowing what happened to them, it has nothing to do with the blair witch at all, ugh! what a waste of movie rental money, i should have rented something more worthwhile. i kinda feel sorry for the cast members, this move probably ruined their acting careers...",
      "review_date": "2007-07-02"
    },
    {
      "review_title": null,
      "content": "Blair Witch 2 is a massive improvement from the original. It feels almost completely different, but in a good way. It's not a good film, but compared to the original, it will seem like one of the best films you've ever seen!",
      "review_date": "2014-02-07"
    },
    {
      "review_title": null,
      "content": "I personally think that The Blair Witch 2 Book Of Shadows, Was AMAZING! Incredible acting and Incredible storyline,HIGHLY RECOMMENDED.I have watched it over and over and over again so many times now it's so good.",
      "review_date": "2011-10-11"
    },
    {
      "review_title": null,
      "content": "La secuela que nadie pidió, que nadie quiso ver y que la inmensa mayoría de los que la vieron detestaron. Cero recomendable, si no la has visto, te recomiendo que veas cualquier cosa antes de detenerte a pensar en si ver o no esta basura.",
      "review_date": "2020-12-03"
    },
    {
      "review_title": null,
      "content": "Following the release of The Blair Witch Project in 1999, the town of Burkittsville, Maryland was overrun with tourists who had seen the movie and wanted to visit locations from it. Or were maybe just hoping for a Blair Witch sighting.Following the release of The Blair Witch Project in 1999, the town of Burkittsville, Maryland was overrun with tourists who had seen the movie and wanted to visit locations from it. Or were maybe just hoping for a Blair Witch sighting. Because it's not like the characters in that movie died or anything. That's the basis for this odd meta-sequel that does away with the found-footage approach in favor of a more traditional film-going experience.Putting the two films side-by-side it would be impossible to tell this was meant to be a follow-up if didn't constantly reference it's predecessor by name every so often. Cameras still play a big role, but we're not watching the action through them. Instead they are used as a nod to the first movie, another attempt to convince us that all of this really happened, and as a method of delivering a twist ending that most will probably see coming. The approach and setting are totally different, but things play out in basically the same manner. As the strange events the characters experience begin to get more sinister the paranoia and frustration set in causing them to become distrustful of one another.There are attempts at social commentary about mass hysteria and people's perceived perceptions on reality, but the movie isn't really smart or scary enough to have true depth. It's mostly just the character's seeing stuff that isn't there when they turn around and an ending that poses the question of whether or not they were actually afflicted by something supernatural or were just a bunch of nutcases. The bad acting doesn't help.While I'm not quite sure I liked it, I was certainly never bored. It's got that early 2000's cheese (a Marilyn Manson song plays during the opening credits) that's perfect for an October horror marathon. The movie is worth watching just because it exists and is such a bizarre way of turning The Blair Witch Project from a standalone horror film into a franchise. As mediocre and much less enjoyable as the Adam Wingard title was, you can't say it didn't resemble the first movie. This is something almost entirely different and it's interesting because of that.",
      "review_date": "2018-10-18"
    },
    {
      "review_title": null,
      "content": "A complete insult to the original movie. The firt Blair Witch was terrifying, because it felt so realistic and you never see what is beyond the darkness. Blair Witch 2 is also terrifying, because it has taken the name of one of the (in myA complete insult to the original movie. The firt Blair Witch was terrifying, because it felt so realistic and you never see what is beyond the darkness. Blair Witch 2 is also terrifying, because it has taken the name of one of the (in my opinion) best horror films ever and made it into a painful, pointless, and downright braindead mockery. This movie is horrible.",
      "review_date": "2012-06-15"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nNo matter how many horror movies sequel starting to get all dried up, you bet that I won't have to buy tickets to see a s**t pile doo-doo that is THE Ed Wood of bad movie sequels, Book of Shadows: Blair Witch 2. Whoever's responsible for this monstrosity should be really ashamed of themselves (either Artison or Lionsgate) not even knowing what the movie is about. I did see the first Blair Wifch Project movie and it really scared the \"s**t out of me.\" It doesn't have real actors, it's not based on a true story, it just set a wave of a new standard genre called Paranormal and that ushers in a slew of low-budget but well-made films like The Exorcism of Emily Rose and the aforemention Paranormal Activity series. One year later, throw in a new sequel but with a shameless new director wanting to scare audiences even more. Boy, this movie does not even scare me at one bit. But in this case, the critics are right. This movie is bad. I mean which horror sequel is donned the worst. This or Halloween Resurrection or A Nightmare on Elm Street V? You make the call. I decided to skip this Blair Witch sequel that nobody wanted. The acting is so bad, even Adam Sandler should've made his own horror movie of awfullness. The story is pointless, there's no chemistry, everything is terrible. Reboot anyone? I do. I can honestly say that Blair Witch 2 is nothing more than a dumpster fire of a sequel.",
      "review_date": "2016-06-20"
    },
    {
      "review_title": null,
      "content": "It's a deeply flawed movie. The premise was tolerable, as was the cast but the whole thing was just poorly executed. The editing was really sloppy, the movie was way too long and the characters were just stereotypes that were hard to like. ItIt's a deeply flawed movie. The premise was tolerable, as was the cast but the whole thing was just poorly executed. The editing was really sloppy, the movie was way too long and the characters were just stereotypes that were hard to like. It turned the franchise from one of suspense to one of weak attempts at humour. It's a shame.",
      "review_date": "2020-01-08"
    },
    {
      "review_title": null,
      "content": "Alex 0 terrible. absolutely terrible. almost NOTHING to do with the original. the original was a great film, and if you saw it and loved it, steer clear of this abomination. bad acting, pointless storyline, STUPIDITY that surrounds theAlex 0 terrible. absolutely terrible. almost NOTHING to do with the original. the original was a great film, and if you saw it and loved it, steer clear of this abomination. bad acting, pointless storyline, STUPIDITY that surrounds the plot...it all adds up to make, lets face it, a pretty crappy film. the end is not explained; the characters are just taken to jail, without a hint at what actually happened?? get the original writers directors and producers back for a REAL sequel please.",
      "review_date": "2012-02-11"
    },
    {
      "review_title": null,
      "content": "There is not enough action and at the end most of the scenes i was like what?!The acting was pretty good and the dead scenes were amazing.The only thing i absolutely don't like with that movie is the action,there is not enough of it.",
      "review_date": "2014-06-08"
    },
    {
      "review_title": null,
      "content": "It doesn´t deserve an 10 out of 10 but i just had so much fun that i can´t let this rating be so low",
      "review_date": "2021-12-01"
    },
    {
      "review_title": null,
      "content": "Blair Witch 2, while trying to bring something interesting (though too cliché), remains a bad joke.",
      "review_date": "2020-11-16"
    },
    {
      "review_title": null,
      "content": "There is no doubt that \"Blair Witch Project\" was a gigantic commercial and critical success, and that it was more than fair, because the movie is really good. Unfortunately, this sequel is all that the original is not. I mean, it's a movieThere is no doubt that \"Blair Witch Project\" was a gigantic commercial and critical success, and that it was more than fair, because the movie is really good. Unfortunately, this sequel is all that the original is not. I mean, it's a movie that shouldn't even have been made, because it's really bad, very weak. Comparing both movies is almost like comparing a golden nugget to a bunch of crap.This movie tries everything it can to stick to the first movie and capture something that allows it to work and make a similar success. It is not a \"found footage\" movie, as was the first, but tries to continue the previous story, with a team of amateur and young filmmakers looking for information about what happened there, and the chaos to settle as the supernatural begins to mess with the mind of each of them. I can't say that the movie is a complete disaster… it starts very slowly, it takes a long time to capture our interest, but it gradually improves from the middle on and gives us a relatively well-made ending, that does not scare minimally, but at least, It makes us intrigued.I don't think it's worth it to highlight any name in the cast. None of the actors really did a good job, the characters are tiring and poorly designed, unable to capture our sympathy or truly deserve our attention. I was simply waiting to see them die all.At the technical level, the film is not remarkable either. Cinematography is weak, the film has the whole appearance and style of a very cheap movie B, the scenarios are not really interesting and there are no production values ​​that are worth highlighting.",
      "review_date": "2022-05-08"
    },
    {
      "review_title": null,
      "content": "Very bad sequel. The previous film had its charm because of the footage. Not so here and the film is shot on classic camera angles. Moreover, when it comes to some camera shots, they have a kind of blue filter, which in my opinion just spoilsVery bad sequel. The previous film had its charm because of the footage. Not so here and the film is shot on classic camera angles. Moreover, when it comes to some camera shots, they have a kind of blue filter, which in my opinion just spoils it. The music is also rather inappropriate in places, in my opinion. As far as the plot is concerned, it's kind of... weird. On the one hand, it had its good moments, but unlike the last episode, where I was like \"WOW, that was something\" after the ending. I was like, \"What the hell?\" In my eyes, a completely unnecessary sequel that I recommend avoiding, and I don't recommend the movie itself.",
      "review_date": "2021-12-27"
    }
  ],
  "num_reviews": 38
}