{
    "rating": 9.4,
    "release_date": "2005-06-15",
    "num_reviews": 650,
    "genres": [
        "Action",
        "Fantasy",
        "Adventure"
    ],
    "summary": "A young Bruce Wayne (Christian Bale) travels to the Far East, where he's trained in the martial arts by Henri Ducard (Liam Neeson), a member of the mysterious League of Shadows. When Ducard reveals the League's true purpose -- the complete destruction of Gotham City -- Wayne returns to Gotham intent on cleaning up the city without resorting to murder. With the help of Alfred (Michael Caine), his loyal butler, and Lucius Fox (Morgan Freeman), a tech expert at Wayne Enterprises, Batman is born.",
    "reviews": [
        {
            "content": "Chills and glee... not things that movies often deliver, but Batman Begins does on both counts (for me, mostly the \"tumbler\" Batmobile reveal and sequences). With an incredible cast, a strong script, and Nolan's incredible direction, this film takes the Batman franchise out of the comic book genre and into that rare territory where excellent craft and blockbuster action are rolled into one. Nolan exchanges the theatrical sets of the Burton films for spectacular real-world locations to great effect. Likewise, Zimmer's score sets a different tone than Elfman's, but it fits perfectly with Nolan's motif and is just as iconic. The attention to detail in this movie is really delightful for Batman fans (all the way down to the secret piano keys that open the entrance to the bat cave) and the few divergences from Batman canon (like the expanded role of Lucius Fox) are so fitting that no one can object. There are a few moments where the studio's fingerprints are visible (some overly expository dialogue, attempts to invoke the aesthetic of previous films in the Narrows, etc.) but for the most part, Nolan will have you believing that Batman is for real.",
            "review_date": "2023-04-24",
            "source": "rt"
        },
        {
            "content": "Christopher Nolan's Batman Begins is my favorite superhero origin film of all time. Batman is a classic character and Christopher Nolan managed to bring a new side and perspective on the character with Christian Bale being brilliantly cast. One of the highs of the film is its attention to detail and realism. The film takes a grounded approach to the superhero genre, showing the practicality of Batman's gadgets and the humanity of his skills. Even if you don't like the superhero genre this is one of the \"Must Watch\" films from the genre. It won't work for everyone but where it does fall into some superhero tropes it's still different than quite a lot of different audiences can enjoy this. While this Trilogy of films don't make you think as much as his others, I think he delivers on his signature cinematography and world building. All of this creates the definitive Batman origin story. 9/10",
            "review_date": "2023-04-24",
            "source": "rt"
        },
        {
            "content": "Best origin to batman in a while and gives a more slow story that really makes batman a interesting piece.",
            "review_date": "2023-04-23",
            "source": "rt"
        },
        {
            "content": "Great Batman movie. Christian Bale is by far the best Batman. 4.5/5",
            "review_date": "2023-04-21",
            "source": "rt"
        },
        {
            "content": "Good movie, but not really re-watchable. Also he lets ras al ghul die, Even tho he's supposed to save the city without killing.",
            "review_date": "2023-04-17",
            "source": "rt"
        },
        {
            "content": "The greatest 02 hours: and 20 minutes ever!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2023-04-13",
            "source": "rt"
        },
        {
            "content": "Siendo nuevo en el mundo de DC, con esta película entendí porque Batman es una de las eminencias de los superhéroes, y ahora entiendo de donde su nombre y el de la \"baticueva\".",
            "review_date": "2023-04-09",
            "source": "rt"
        },
        {
            "content": "Una buena película para empezar la trilogía",
            "review_date": "2023-04-04",
            "source": "rt"
        },
        {
            "content": "Christopher Nolan nos entrega un excelente origen de batman y trasfondo para bruce Wayne que paso por un mundo mas bajo ,me encanto como se adapto la liga de las sombras ,como vemos el entrenamiento fundamentado a bruce Wayne ,Liam Nesson como Ra´s al Ghul me parece perfecto que da esa vibra de maestro del mal ,la acción en el filme es medidamente acertada ,el ritmo ,cámara y fotografía de gran altura ,oscura pero muy entretenida con un guion bien escrito eso es Batman Inicia .",
            "review_date": "2023-04-02",
            "source": "rt"
        },
        {
            "content": "I overall think that this is a great movie and it sets up the BatBale/Dark Knight trilogy very well I'm very pressed by this movie and it deserve more love and admiration than it has. Action, I think that the action in this movie is amazing who ever made the action did it very freak'in well. Acting, I think that the acting in this movie is a straight perfect/10/10 Christian Bale, Liam Neeson, Michael Caine, Gary Oldman they all did a wonderful and amazing job they nailed it. CGI, in my opinion I'm not sure about anyone else but I think that the CGI was perfect. Villain, I liked Ra's but I think that Liam Neeson should have played a good guy instead of the villain. Writing is great near perfect no doubt about it. Story/Plot I think that there was a good plot twist with Ducard becoming the villain. Casting, I think that the casting is absolutely amazing no doubt about it Christian Bale & Liam Neeson have such a good history with movies like Christian Bale was in American Psycho and Liam Neeson was in Star Wars Episode 1. Characters are perfect without a doubt. Mystery, I liked the mystery I think that the mystery should have been a bit better. Ending, I think that the ending is one of the best parts of the movie I really love this ending definitely one of the greatest endings in the 00's.",
            "review_date": "2023-03-28",
            "source": "rt"
        },
        {
            "content": "A very solid realistic reinvention of the myth.",
            "review_date": "2023-03-09",
            "source": "rt"
        },
        {
            "content": "An amazing start to a awesome trilogy bale is still my favourite batman of all time",
            "review_date": "2023-03-09",
            "source": "rt"
        },
        {
            "content": "Ra's is a great villain and the movie as a whole is a ton of fun.",
            "review_date": "2023-03-09",
            "source": "rt"
        },
        {
            "content": "Finally, after the previous 2 outings of the caped crusader, the Batman franchise is back on track. Having been a big comic collector over the years and a long time fan of the Dark Knight, I was especially disappointed by 'Forever' and 'Batman and Robin'. To me, these film lost the essence of what drives Bruce Wayne to do what he does and turned Batman into more of a pop star than misunderstood hero.\n\nThankfully though, Nolan has gone back to the roots of the character, portraying a confused and angry Bruce Wayne, who ultimately rises to become Gotham's greatest champion. Don't expect to see loads of shots of Batman in this film though. It is the story of Wayne and focuses mainly on his years of training and preparation for becoming Batman. You are almost teased throughout the first half of the movie, waiting to see the excellent Christian Bale in the costume, as it keeps holding back to keep you in anticipation. When Batman does finally turn up on screen, it is well worth the wait. In my opinion, Bale was born for this role and for the first time when watching a Batman film, I enjoyed the scenes of Wayne being Wayne as much as Wayne being Batman.\n\nOne of the strongest features of the film, is the way that it manges to suck you in believe that a 'Batman' could be a reality one day. The technology is current, with no use of silly OTT weapons and gadgets, again making the film work by today's standards. Plus, we are not allowed to forget that Batman is still just a man under the costume and there are times when he gets a bit of a kicking and shows that he can be vulnerable too, something we sometimes forget when watching a superhero flick. Gone too, are the silly villains!!! Jack Nicholson was the perfect Joker but from there it went downhill. Thankfully, in this movie the bad guys are actually fairly 'normal' and manage to be menacing at the same time.\n\nWhich finally brings me to the cast. I always had high expectations for this film when the cast was announced. Let's face it, what a line up! Christian Bale, Michael Caine, Morgan Freeman, Gary Oldman, Liam Neeson, Katy Holmes, Ken Watanabe and Tom Wilkinson are not to be sniffed at. Even an old favourite of mine makes an appearance: Rutger Hauer! Awesome. Actors of this calibre would never have gotten involved in this project if they didn't have faith in Christoper Nolan's talents and thankfully they took the leap...\n\nFor the comic book fans out there, waiting to see this movie, let me assure you that you won't be upset. Imagine the darkness of the 'A Death In The Family' and the 'Year One' story lines. I have never met a fan of Batman who didn't love these books. Well, this is the kind of Batman you can expect from Bale: Dark, brooding and tortured by his past, yet the hero we have come to love. For those of you who are not comic fans, then just look forward to seeing how Batman should be. This film is a credit to Bob Kane's original vision and a testament to all the talented artists and writers who keep the legend of the Dark Knight alive in the comic books today....\n\nThank you Mr. Nolan and thank you Mr. Bale. In fact thanks to everyone who worked on this film. Batman finally Begins from here....",
            "review_date": "2023-03-02",
            "source": "rt"
        },
        {
            "content": "Even with Christopher Nolan's abstract story and heavy copy of Batman's costume from the original 1989 film, Batman Begins delivers quite the expectation for a live-action Batman film that has not been seen by the audience for 8 years. Christian Bale's seriousness as a dark, scary bat-based vigilante gives a serious feel similar to that of the 1989 film; opposed to Batman Forever and Batman & Robin. Cillian Murphy's role as the Scarecrow is stomach-churning to audiences in a good way. Liam Neeson's role as Henri Ducard gives a plot twist and the end of the movie.",
            "review_date": "2023-02-26",
            "source": "rt"
        },
        {
            "content": "After the awful Batman & Robin film from 1997 I shook my head when I saw the trailer for this film while in a theater in 2005 thinking oh no not another one this is terrible. \n\nWith no intent to see it I kept hearing how great it was and in it's 6th week I finally went to see it. It completely blew me away. Never did I expect to see a serious drama version of Batman. I kept getting surprised and surprised at how they portrayed everything in the film from the characters to the city it was all realistic. \n\nThis movie changed the comic book film  genre forever and it should've won best picture. I was already giving it 10 out of 10 before the last rooftop scene with Batman and Gordon which gave me chills when Batman flipped over that card. Absolutely amazing film.",
            "review_date": "2023-02-25",
            "source": "rt"
        },
        {
            "content": "It's an origin story that is able to succeed in every way, despite everyone knowing how Batman becomes Batman. It is exciting, and still showcases Christopher Nolan's abilities",
            "review_date": "2023-02-24",
            "source": "rt"
        },
        {
            "content": "An interesting expansion on the Batman origin story.",
            "review_date": "2023-02-22",
            "source": "rt"
        },
        {
            "content": "Absolutely amazing start to an incredible series. The flashbacks at the beginning of the movie showing Bruce's younger years were very effective at building up his character, which Christian Bale did an incredible job at portraying. The final fight scene on the train was great and Ra's Al Ghul was the right villain for the movie by perfectly showcasing why Batman is a hero and what separates him from villains.",
            "review_date": "2023-02-18",
            "source": "rt"
        },
        {
            "content": "ta ai um filme que eu não lembro, mas confio no Bale aakakak",
            "review_date": "2023-02-10",
            "source": "rt"
        },
        {
            "content": "This is by far the best, most accurate to the source material's tone, Batman solo film ever made. The origin is fantastic, the score is phenomenal, the world is rich. Nolan brought Batman back with a vengeance, Gotham here is beautiful",
            "review_date": "2023-01-28",
            "source": "rt"
        },
        {
            "content": "Sublime, no pudo haber mejor inicio",
            "review_date": "2023-01-25",
            "source": "rt"
        },
        {
            "content": "Batman begins gives a decent origin story and a enjoyable action movie all in one place.",
            "review_date": "2023-01-21",
            "source": "rt"
        },
        {
            "content": "Great start to the trilogy with good villains, awesome characters and a great Batman!",
            "review_date": "2023-01-17",
            "source": "rt"
        },
        {
            "content": "One of the best Batmans, funny, lot stunts are real. Driven",
            "review_date": "2023-01-04",
            "source": "rt"
        },
        {
            "content": "not usally a fan of origin stories but this one was great.\nvery jam packed story with mutliple plot points at once",
            "review_date": "2023-01-01",
            "source": "rt"
        },
        {
            "content": "The start of Christopher Nolan's trilogy. It is awesome.",
            "review_date": "2022-12-20",
            "source": "rt"
        },
        {
            "content": "Great start to the series and great acting",
            "review_date": "2022-12-11",
            "source": "rt"
        },
        {
            "content": "It was a nice change to see for a batman series of movies that were going down hill. This movie was ok but at least it's not as bad as the ones that were being made before this.",
            "review_date": "2022-12-10",
            "source": "rt"
        },
        {
            "content": "Excellent origin story. I think it's a little out of character that he leaves Ra Al Gaul to die but other then that great movie.",
            "review_date": "2022-12-04",
            "source": "rt"
        },
        {
            "content": "Nolan's portrayal of the dark, gritty, hopeless image of Gotham gives the birth of Batman extra meaning, to fight injustice in a city of helplessness. Whilst the cinematography does its job and takes the film onto a whole new level.",
            "review_date": "2022-11-29",
            "source": "rt"
        },
        {
            "content": "An All Time Classic. The only real flaw here is the acting is Good but not phenomenal. Katie Holmes is the weakest thing in the film and just doesn't have the same level of charisma as everyone else and really had no chemistry with Bale. Bale himself was very good but when he was Batman it felt off sometimes as if he was trying too hard and it wasn't as natural as when he was Bruce Wayne. Morgan Freeman & Gary Oldman were the best actors. Liam Neeson was good also but didn't have a real intimidating presence. The cinematography is excellent with great dreary set designs, tons of practical effects, and a good looking bat suit and car. The camera work is flawless also. The music, editing and pacing are all excellent. I will say that I did disagree with the way it just threw us into Bruce Wayne's life mid way into becoming Batman was questionable, it easily make up for that 20 minutes in but I still would've put that more at the start. The pacing ramps up in the second half and really rewards you for staying for over an hour before the villain storyline happens. It can feel bloated at times but it doesn't matter because of how well done the second half is editing, cinematography and pacing wise. This is the template for all other Super hero origin stories that came after it and elevated the genre in ways not seen since 1978. Despite some minor flaws this is still a film anyone should see. Highly recommended along with its sequel right after!",
            "review_date": "2022-11-26",
            "source": "rt"
        },
        {
            "content": "Good movie, enjoyable",
            "review_date": "2022-11-19",
            "source": "rt"
        },
        {
            "content": "Love it.............",
            "review_date": "2022-11-18",
            "source": "rt"
        },
        {
            "content": "If I could give it a 3.75 I would. Worst of the trilogy, but I loved Ras. Origin is retold well, it's still a Batman origin story though.",
            "review_date": "2022-11-16",
            "source": "rt"
        },
        {
            "content": "No flaws but still not perfect",
            "review_date": "2022-11-12",
            "source": "rt"
        },
        {
            "content": "Batman Begins is oftentimes overshadowed by the masterpiece of The Dark Knight. While I don't feel that this is the best film in the trilogy (because The Dark Knight is untouchable), Batman Begins is still one of the best superhero origin stories of all time. Coming off the catastrophe of Batman and Robin, this film took a necessary step back and reinvented the superhero genre in the process. It did what no other Batman movie had done before and took the time to get to know Bruce Wayne before introducing Batman (The audience doesn't even see Batman in full costume until an hour into the film). While it might be slow at times, the creeping pace reinforced the idea that this version of Batman would be done the right way. Batman Begins is not a comic book or a cartoon, but a real-life adaptation of the caped crusader.",
            "review_date": "2022-11-11",
            "source": "rt"
        },
        {
            "content": "The weakest of the trilogy, but still a solid superhero movie. I wish the villain was more interesting.",
            "review_date": "2022-11-07",
            "source": "rt"
        },
        {
            "content": "The first superhero film to be dark, exciting and action-packed.",
            "review_date": "2022-11-03",
            "source": "rt"
        },
        {
            "content": "Even before the movie could start, when the logos come up, just that sound alone already gives goosebumps.\nThis is a great Superhero movie that isn't typical like the the other superhero movies. How Bruce Wayne becomes Batman isn't just something they do quickly, almost half the movie is just on Bruce Wayne with such a solid story that isn't over the top, it's quite gritty and raw. Even though alot of the cinematography is amazing, there is alot of shots that is quite dark and has alot of grain adding to the scenes making it looks more realistic. There isn't much bright colours at all but everything fits perfect to the story. \nThe actors was absolutely more than perfect, every actor portrayed their roles so well. You can see Christian Bale's mouth from a mile away and the way he talks, how does Rachel not...? Can she not...? Nevermind! The score was absolutely amazing, it never overshadowed the moments, but really enhanced it, like when he first became Batman, when he fought Scarecrow and when he was going after Ras Al Ghul, the score really amped up the excitement. I think that story stays true to its name \"begins\" because it's not all about Batman it's also about Bruce Wayne becoming Batman with such a solid story. \nThis was the beginning of the greatest Trilogy, with solid cinematography that has dark colours and an absolute perfect score, Story and characters, it's obvious why it's one of the greatest superhero movies.",
            "review_date": "2022-10-24",
            "source": "rt"
        },
        {
            "content": "Batman Begins is a phenomenal film that set the benchmark for all Batman movies to come. It's a multi-layered film that isn't as much about the action as it is about Bruce Wayne's journey to becoming the caped crusader. There are two important themes in Batman begins fear and justice.",
            "review_date": "2022-10-18",
            "source": "rt"
        },
        {
            "content": "মাস্টারpiece movie...",
            "review_date": "2022-10-16",
            "source": "rt"
        },
        {
            "content": "masterpiece no doubt",
            "review_date": "2022-10-16",
            "source": "rt"
        },
        {
            "content": "It’s better than any of the previous Batman movies, but I can’t help but feel like it gets slightly cheesy in parts. Still though, it’s a good movie and part of a great trilogy.",
            "review_date": "2022-10-15",
            "source": "rt"
        },
        {
            "content": "Who Thought there is A future of Batman after the failure of Batman and Robin.. Batman Begins is mark To be a Cult classic and One of the best Superhero Origin Stort Movie. Bale as Batman Must Seem Weird But he still nailed It, but His Bruce Wayne Version is next level threat..JUST LOVED HIS BRUCE WAYNE VERSION!..Nolan Understand Bruce Wayne more than Batman so well..the Music, Villains, Story,Characters all are perfect..Just a Perfection From Nolan",
            "review_date": "2022-10-15",
            "source": "rt"
        },
        {
            "content": "masterpiece...Pure masterpiece",
            "review_date": "2022-10-15",
            "source": "rt"
        },
        {
            "content": "Batman Begins is a movie with many fantastic elements. The characters, action and suspense are all things to be commended. However, the complex story and the fast pace of the movie make it a film not for everyone. Nonetheless, it is a movie that has stood the test of time so far and will be remembered for years to come.",
            "review_date": "2022-10-15",
            "source": "rt"
        },
        {
            "content": "BATMAN BEGINS IS WHERE DC TOOK THEIR STEP FORWARD, BY ADDING AN ECCENTRIC cHRISTOPHER nOLAN INTO THE DIRECTOR SEAT AND HAVING cHRISTIAN bALE PORTRAY OUR QUINT-ESSENTIAL SUPERHERO IN A MOVIE, RIDDLED WITH BRILLIANT ACTION, AWESOME VISUALS AND UNIQUE MOMENTS. oNLY PROBLEM, IT DOES DRAG ON QUITE A BIT.",
            "review_date": "2022-10-05",
            "source": "rt"
        },
        {
            "content": "Best superhero movie i have ever watched. After watching this I'm thinking Marvel really need to step up their game",
            "review_date": "2022-10-04",
            "source": "rt"
        },
        {
            "content": "I absolutely love the Christopher Nolan Batman trilogy. Christian Bale played a great Bruce Wayne and Batman. Katie Holmes was great in this movie.",
            "review_date": "2022-09-30",
            "source": "rt"
        },
        {
            "content": "The scores is perfect, the cast is perfect, the acting is perfect, the plot is perfect, strong foundation, strong beginning of a masterpiece to be written in film cinema history",
            "review_date": "2022-09-30",
            "source": "rt"
        },
        {
            "content": "Amazing first movie ",
            "review_date": "2022-09-29",
            "source": "rt"
        },
        {
            "content": "Loved it all .. The best movie where all away e and Batman facets have been deeply developed .. Wheee the issues of a huge city and its critical society are disclosures, where good and evil make their moves walking on the razor blades of difficult choices and incredible challenges .. loved it all .. thank you Christoper Nolan for yet another amazing movie and thank you Christian Bale for your intense, enchanting and spotless performance 😍🌸💙",
            "review_date": "2022-09-13",
            "source": "rt"
        },
        {
            "content": "Incredible Batman movie. Introduction into both worlds of Bruce Wayne. \n\nExceptional film, made even better by the music of Hans Zimmer.",
            "review_date": "2022-09-11",
            "source": "rt"
        },
        {
            "content": "Lo e this movie watched it more than once over years and still a classic",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "Easily the best of the trilogy. The greatest Batman movie ever made.",
            "review_date": "2022-08-20",
            "source": "rt"
        },
        {
            "content": "| Ratings Categories |\n{Characters (8.5/10) ; Cinematography (9.5/10) ; Plot (9/10) ; Acting (9/10) ; Pacing (10/10) = 92%}\"",
            "review_date": "2022-08-18",
            "source": "rt"
        },
        {
            "content": "\"The CPR of a franchise.\"\n\nWith this film, Christopher Nolan in many ways reset and defined what a comic book film could and should be. Along the lines of \"Mask of the Phantasm\", it takes a more grounded, realistic approach toward the Caped Crusader, while still feeling somewhat like a comic. Featuring solid casting, special and practical effects, visuals and themes, and a shift put in by Hans Zimmer and James Newton Howard for the score, it serves as potentially the best origin story to a hero which in a sense, changed the industry. \"You can kill a vigilante, but you can't kill a symbol.\"",
            "review_date": "2022-08-18",
            "source": "rt"
        },
        {
            "content": "the start is slow with some action but the ending is amazing",
            "review_date": "2022-08-17",
            "source": "rt"
        },
        {
            "content": "If you needed to wash away the memory of the past few Batman films (Batman Forever and Batman & Robin), this is the perfect pivot to a more serious and violent Bruce Wayne. I always found the way that Nolan shot this movie to be fascinating for the origins and beginnings of Batman. The casting was spot on - I will say, I was slightly disappointed we did not get more of Cillian Murphy as Dr. Crane (Scarecrow). The Katie Holmes casting as Rachel Dawes didn't work out long term either but hey, you aren't going to win them all. Clearly, the most important casting choice they had to nail (besides Michael Caine as Alfred, ha) was Bale as Bruce Wayne and he was phenomenal.",
            "review_date": "2022-08-09",
            "source": "rt"
        },
        {
            "content": "Patrick Bateman in an alternate universe, fights crime and Saves the city in a Bat-suit.... AWSOME!!",
            "review_date": "2022-08-04",
            "source": "rt"
        },
        {
            "content": "I remember really enjoying this movie and thinking it was quite good when it initially came out. I rewatched it for the first time in a while a few weeks back and was quite surprised at how... bad it was. Well, I should say, at how bad the editing in this movie was. Case in point, multiple characters explain no less than three times that if the train gets to Wayne tower, the city's water supply will vaporize. It was comical watching how many times they flashed to the old guys in the tower looking concerned. \n\nThere's a really interesting movie here, but they just kind of failed to bring it all together. It's actually quite jarring to watch after seeing how Dr. Strange used a damn near identical plot and it was far more effective. (And I'm not trying to turn this into a Marvel vs. DC thing... I really don't care who likes what, and I've never read any comics, period. Don't rope me into that nonsense.)",
            "review_date": "2022-07-28",
            "source": "rt"
        },
        {
            "content": "I watched this more than a month ago idk why the rating never logged. But I really enjoyed this film. The pacing is so efficient. The looming specter of fear over everything--from Falcone's grip on the city to how Batman seeks to instill that same dread into criminals--is well executed and certainly initiated the foray into strong thematic explorations of Gotham that Nolan truly mastered in The Dark Knight. Liam Neeson is a great antagonist (challenging Bruce morally and philosophically in addition to the physical/mental stuff that comes with any bad guy with evil plans), Michael Caine is pitch perfect, Gary Oldman is too, and the relationship with childhood best friend Rachel does work really well. I was impressed with how much this holds up.",
            "review_date": "2022-07-26",
            "source": "rt"
        },
        {
            "content": "A solid movie, but nothing groundbreaking. The villain and his story are mediocre at best, and the first half of the movie is somewhat slow and unimpressive as Bruce builds up to becoming Batman. Once he returns to Gotham it does pick up and there’s some good stuff to be entertained by, but it never rises to the status of an elite movie despite having a very good cast who mostly gave excellent performances. Good movie, but could’ve been better.",
            "review_date": "2022-07-26",
            "source": "rt"
        },
        {
            "content": "This is my personal opinion, please don't take my comments to heart, reader discretion is recommended. In itself the quality, the production and the performance of the actors is quite good the truth. Besides the action that unfolds in the film is spectacular to my taste, but what ruins the film in my opinion is the plot or story of the film which is quite absurd and stupid. Also note that although Liam Neeson for me is a great actor and I really like how he performs in his films and how he acts, here his performance is totally out of place, confusing, absurd, stupid and unnecessary, so in short I do not mind his performance, but rather the character he plays and the scenes in which he appears, completely ruins the film to my taste especially in almost at the end of the film. Christian Bale for me is a very attractive man and I think he plays the role of Batman well, so I consider that my rating on the film would have been better if only Bale's performance was taken into account eliminating Liam Neeson completely, although the film itself did not convince me to please me completely. But I consider that it is worth watching and enjoying as a family, so in summary I would say that this word left me with a bittersweet or semi-bitter taste. It is neither so good nor so bad for me, but I consider that it is more of a bad film than a good one.",
            "review_date": "2022-07-25",
            "source": "rt"
        },
        {
            "content": "My rating for the film is a 8.7/10",
            "review_date": "2022-07-24",
            "source": "rt"
        },
        {
            "content": "Christopher Nolan's realistic, emotionally grounded reboot of the Dark Knight myth suffers from a lack of a sense of fun and mystery--too much about Batman is given away, taking away some of his enigmatic nature. The actors are what make this watchable. Christian Bale is the best actor to play the part (my favorite Batman is still Michael Keaton) and Nolan populates the supporting roles with reliable faces--Oscar winners Michael Caine and Morgan Freeman, Gary Oldman, Liam Neeson, Ken Watanabe, Cillian Murphy, Tom Wilkinson, and even Rutger Hauer for good measure. Katie Holmes is the only weak link. The action is impressively staged, if not always coherent or exhilarating, with a train ending stolen right up from under Sam Raimi's nose from 'Spider-Man 2'. Decent revival of the franchise, has the right epic feel, but let's hope the next one will be more fun and thrilling, and less explanatory",
            "review_date": "2022-07-19",
            "source": "rt"
        },
        {
            "content": "awe fully predictable, what a stupid movie. Marvel is better",
            "review_date": "2022-07-18",
            "source": "rt"
        },
        {
            "content": "Begins brings the Night to life again",
            "review_date": "2022-07-17",
            "source": "rt"
        },
        {
            "content": "A fantastic origin movie for this batman trilogy. Everyone here performs very well, especially Cillian Murphy's Scarecrow.",
            "review_date": "2022-07-15",
            "source": "rt"
        },
        {
            "content": "An amazing start to one of the best trilogies ever!",
            "review_date": "2022-07-14",
            "source": "rt"
        },
        {
            "content": "Batman Begins is one of Christopher Nolan's finest works. His dark, realistic take on Batman (played here by Christian Bale) redefiend the franchise, Liam Neeson's Ra's al Ghul is compelling, and an incredible supporting cast bolsters this origin story up. However, some poorly-shot action scenes detract from the movie. Also, the long time spent on Batman's childhood and training make the first hour of the movie feel slow and bogged-down. However, the array of iconic villains and the character arc of Bruce make Batman Begins a must-see.",
            "review_date": "2022-07-07",
            "source": "rt"
        },
        {
            "content": "Very good movie I gotta say, it serves as a good origin story of Bruce Wayne and embracing the superhero Batman. The actors performed great, the story is amazing, and Christopher Nolan knows how to make a thrilling superhero movie. Wasn't a big fan of Scarecrow though, but I enjoyed the rest of the film. It's the start of one of the most iconic trilogies of cinema history.",
            "review_date": "2022-06-23",
            "source": "rt"
        },
        {
            "content": "83/100 -------------",
            "review_date": "2022-06-21",
            "source": "rt"
        },
        {
            "content": "An engaging kickoff for the Dark Knight trilogy with Christan Bale, who is just the right person for the protagonist and who goes well with the tone of the movie. It is more than enough to convince the sequels will be worth to watch as well.",
            "review_date": "2022-06-11",
            "source": "rt"
        },
        {
            "content": "Batman Begins is the definitive origin story. If you love origin stories and impactful character arcs (and also like superheroes), this might be one of your favorite films of all time. Christopher Nolan took this fan favorite superhero and gave him a darker and grittier story and it feels right. Also, Alfred is absolutely fantastic throughout this film. What a man. The only criticism I can give this film is the beginning is actually quite rushed. Four minutes in and you're already at a definitive plot point. The tone is awesome, the score is awesome, and the movie is fresh and awesome.",
            "review_date": "2022-05-23",
            "source": "rt"
        },
        {
            "content": "Absolutely brilliant!",
            "review_date": "2022-05-21",
            "source": "rt"
        },
        {
            "content": "A fantastic depiction of Batman's beginnings. With stunning words and facial expressions, Liam Neeson and Christian Bale steal the show. Rachel, Holmes' character, nicely bridges the gap between Bruce Wayne and Batman. Two thumbs up for a fresh spin on a well-known Batman film.",
            "review_date": "2022-05-11",
            "source": "rt"
        },
        {
            "content": "Dissapointed me a lot. Good build up story but not really that interesting",
            "review_date": "2022-04-30",
            "source": "rt"
        },
        {
            "content": "I thought Robert Pattinson was great he's so reliable in twilight.",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "Why didn't Nolan use more of the dirty and gritty Gotham?",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "Acho um bom inicio pro batman so não e masterpiece pq alguma coisaan me agradam a voz do batman e as cenas de luta acho bem mais ou menos pra um filme do batman onde ele bater em pessoas eu queria ver cenas de luta mais coregrafadas",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "an epic way to start a great trilogy. From Bale and Caine to Neeson's villainous character, batman begins is a excellent film that i would recommend for all to watch",
            "review_date": "2022-04-27",
            "source": "rt"
        },
        {
            "content": "That was Easily Fun Started",
            "review_date": "2022-04-22",
            "source": "rt"
        },
        {
            "content": "Though I personally feel this was the least appealing title in the Dark Knight Trilogy, that DEFINITELY does not mean its a bad movie. It was the beginning of Batman's comeback (after the disaster of 1997) Though creative, I also thought it odd that they would use a tank instead of an actual car. And Cillian Murphy, hoo boy, did he deliver the Scarecrow in flying colors (though he could probably use more screen time).",
            "review_date": "2022-04-19",
            "source": "rt"
        },
        {
            "content": "Great start to an excellent trilogy. For those attempting to watch the whole series, this movie seems like a mild drag, especially compared to the thrillers that follow this. But it presents Batman's storyline in a very effective manner and has a great story. This movie sets up a fantastic trilogy absolutely worth watching.",
            "review_date": "2022-04-19",
            "source": "rt"
        },
        {
            "content": "A great start to the dark knight trilogy with brilliant villains such as Scarecrow and Ra's al Ghul. Some good plot twists and at the time of release, the best Batman film. Brilliant.",
            "review_date": "2022-04-17",
            "source": "rt"
        },
        {
            "content": "A decent installment but I just don't like Christian Bale (like at all). I also hated the Batmobile and the overall vibe was so serious (like get over yourself, you're a superhero film; have some fun).",
            "review_date": "2022-04-10",
            "source": "rt"
        },
        {
            "content": "THAT ONE LINE STRIKES ME THE MOST IS \"I'M DEADPOOL\" wait wrong movie franchise",
            "review_date": "2022-04-07",
            "source": "rt"
        },
        {
            "content": "I was very hyped (2022) to watch this at home. I heard awesome rumours of how epic it was and that Scarecrow was awesome. I really enjoyed this movie, though Scarecrow was cheap. But very good still.",
            "review_date": "2022-04-06",
            "source": "rt"
        },
        {
            "content": "Best Batman Movie. Best Batman Villain. Best Batman Actor. Good Backstory. Just amazing and magnificent overall.",
            "review_date": "2022-04-02",
            "source": "rt"
        },
        {
            "content": "Dark, Gritty and Heavy. Batman Begins revives the Franchise with great directing by Christopher Nolan and wonderful new cast with Christian Bale as the Cape Crusader.",
            "review_date": "2022-04-01",
            "source": "rt"
        },
        {
            "content": "great startup to the dark knight",
            "review_date": "2022-03-31",
            "source": "rt"
        },
        {
            "content": "Overly reverent church service for passionless comic geeks. First half with Bruce in training is mostly solid but the moment he becomes Batman, the movie degenerates into a cartoon that takes itself far too seriously.",
            "review_date": "2022-03-23",
            "source": "rt"
        },
        {
            "content": "Best movie ever created in terms of character development. You will never see a movie do so well",
            "review_date": "2022-03-22",
            "source": "rt"
        },
        {
            "content": "First of, I love Nolans Batman trilogy.\n\nBut, wtf is the beginning of the movie? Why does everything that has to do with reflection, spirituality and self collection have to start with random asian people with swords that make ninja sounds. Like who is that old Japanese fuck? How is he relevant, except the fact that he has to represent the stereotypes of martial arts? Why cant Bruce Wayne just thrive of of his anxiety and motivation to defeat the bad and learn shit with his recourses?\n\nSecond of, why does every young Billionaire has to be a sexist Playboy ? This dude lost his parents when he was like 10 and probably went to home school his entire life. Dude should be a fucking virgin in real life. How does he turn out to be a charming handsome billionaire that every European girl wants to fuck ???  (Alfred must be a good love advisor I guess ?)\n\nOther then that, I love the soft complexity of the movie, I love Bales devoted acting, Gothams scenery was designed and colorgraded beautifully, Zimmers music in this is one masterpiece. There so much in this movie that shows love of filmmakeing by all parties included, but theres also just so much that just drops this movie into the abyss of yet another \"historical\" superhero movie for me.",
            "review_date": "2022-03-21",
            "source": "rt"
        },
        {
            "content": "Christopher Nolan's Batman's reign champion - Writting this after seeing Batman 2022 - which was eh.",
            "review_date": "2022-03-20",
            "source": "rt"
        },
        {
            "content": "It's not one of the greatest superhero movies, but this film is a masterpiece, period.",
            "review_date": "2022-03-20",
            "source": "rt"
        },
        {
            "content": "Superb. The realism and great explanation of his back story as well as giving him more personality really did wonders. 10/10",
            "review_date": "2022-03-16",
            "source": "rt"
        },
        {
            "content": "Best Batman origin movie",
            "review_date": "2022-03-14",
            "source": "rt"
        },
        {
            "content": "Far and away the best origin story every told. Not only was this the beginning of the trilogy, but an entirely new level of superhero cinema. ",
            "review_date": "2022-03-13",
            "source": "rt"
        },
        {
            "content": "A must watch beginning to the best Batman movies",
            "review_date": "2022-03-11",
            "source": "rt"
        },
        {
            "content": "After the unabashed, incoherent mess that was Joel Schumacher's 'Batman & Robin' - AKA, the film that killed the franchise - the Caped Crusader seemed hopelessly irredeemable. Thankfully, 'Batman Begins' more than capably manages to wipe away any remaining memories of Schumacher's ultra-stylized and ludicrously ostentatious interpretation of the Dark Knight. Nolan's realistic, somber, and pitch-black reinvention of the Batman legend crackles with a fierce and unrelenting intensity. 'Begins' breathed precious life back into the Batman mythos and gave a new generation of movie-goers a far more sophisticated and intelligent take on the legend of the Caped Crusader.",
            "review_date": "2022-03-10",
            "source": "rt"
        },
        {
            "content": "Ok batman origin movie not as good as dark night and the batman",
            "review_date": "2022-03-10",
            "source": "rt"
        },
        {
            "content": "The benchmark of all superhero movies created by one of the greatest screenwriter and directors our time, Christopher Nolan.",
            "review_date": "2022-03-09",
            "source": "rt"
        },
        {
            "content": "Best Batman trilogy ever.",
            "review_date": "2022-03-09",
            "source": "rt"
        },
        {
            "content": "Fantastic Film. From the score to Bruce Wayne becoming batman and learning to find himself in the world. Learning what real hunger, pain, and fear feels like. Coming back to his city to save it. Loved Alfred, Lucius, and the supporting cast - a realistic take on how a dark billionaire would become a vigilante. I enjoyed him figuring out how to live as both Batman and Bruce Wayne, did an excellent job as both.",
            "review_date": "2022-03-08",
            "source": "rt"
        },
        {
            "content": "The best Batman film adaptation",
            "review_date": "2022-03-08",
            "source": "rt"
        },
        {
            "content": "Batman Begins trás uma releitura nos cinemas, de um Batman mais articulado à tecnologias, um Bruce Wayne que se apresenta a Gotham como um fanfarrão da noite.\no Diretor Christopher Nolan trouxe seu olhar a uma nova Gotham até o momento nunca caracterizada desta forma no cinema, com referencias de HQs como Batman: O Longo dia das Bruxas.",
            "review_date": "2022-03-07",
            "source": "rt"
        },
        {
            "content": "It was a good start off to a Batman movie trilogy and origin story. Christian Bale was an alright batman in this.",
            "review_date": "2022-03-07",
            "source": "rt"
        },
        {
            "content": "Amazing film. Much better than The Batman.",
            "review_date": "2022-03-07",
            "source": "rt"
        },
        {
            "content": "This show was already amazing to me. But after watching the disappointment of the new 2022 one, this really sets the bar lower. I love the story, the actors, the cinematography. The way batman is portraid is amazing. I dont get how people can even think of the new batman as remotely good after seeing this.",
            "review_date": "2022-03-07",
            "source": "rt"
        },
        {
            "content": "Very nicely done! Great characters and story. Dialogue was a tad bit cringe-worthy at times, but I thought this was a really great movie. An amazing cinematic experience.",
            "review_date": "2022-03-07",
            "source": "rt"
        },
        {
            "content": "Everything you could want in a batman movie",
            "review_date": "2022-03-06",
            "source": "rt"
        },
        {
            "content": "1st- Hate the batmobile. 2nd- Christian Bales Batman is great, he is dark, gloomy and intelligent and an amazing fighter, but his Bruce Wayne is terrible, he just feels like a Tony Stark when Bruce is suppose to be majorly different. Ras and Scarecrow together is just an amazing experience and perfectly casted. Story is great and just keeps you intrigued .",
            "review_date": "2022-03-06",
            "source": "rt"
        },
        {
            "content": "It's pretty good movie. One of the best origin story movie of batman. Acting of Christian bale was top notch. Overall it is a good movie",
            "review_date": "2022-03-05",
            "source": "rt"
        },
        {
            "content": "amazing, didnt like this scarecrow tho",
            "review_date": "2022-03-05",
            "source": "rt"
        },
        {
            "content": "Brilliant start to the trilogy, some brilliant casting, acting and story line, can defiantly see that is a new type of film for Christopher Nolan, but it was a really strong film, with nothing massively wrong about it",
            "review_date": "2022-03-05",
            "source": "rt"
        },
        {
            "content": "Don't worry, the flagship superhero trilogy has not passed me by without a trace. It's just that I saw the films at such a young age that I had almost completely forgotten about them until this rewatch. Given that the Caped Crusader is my all-time favourite superhero alongside Spiderman, and because the new The Batman (which I'll be watching soon) brings him back into the spotlight, I've ventured back and let Christopher Nolan's three-parter pull me back into the Gotham maelstrom.\n\nIt starts with Bruce Wayne's childhood and the origin story of his alter ego. Christian Bale took on the role of the troubled billionaire's son as a relatively blank slate in Hollywood at the time. What might not have made much sense back then turned out to be an absolute stroke of genius in retrospect. Bale brings everything that makes Batman and Bruce Wayne: the strong physique, the arrogant image to the outside world and the heroic appearance of the avenger under the mask. It is especially the human moments in which Bale shines like no other Batman actor. The film deliberately takes a lot of time to portray Bruce's childhood and the associated trauma in detail. This may seem too long-winded for many, but for me it helps enormously to get to know the human side of this dark superhero better. Because that's what has always set Batman apart from the other world saviours: His inner insecurities and the gift of not putting too much of a stamp on his good deeds. I particularly enjoy Bruce when he can show an honest, sometimes humorous side of himself with his closest allies. This includes the heartfelt dialogues with his loyal companion Alfred (fantastically portrayed by Michael Caine), the fiddling with the infamous Batman equipment with his right-hand man Lucius Fox (Morgan Freeman as he lives and breathes) and the friendship with his childhood friend and great love Rachel Dawes (Katie Holmes). Besides Batman, the heart of the film is Gary Oldman's good-cop Jim Gordon. He and Batman, despite their anonymity, share a fervent drive for justice and order. The antitheses to the two are Cillian Murphy as the manipulative psychiatrist Dr. Crane aka Scarecrow and Liam Neeson as Bruce Wayne's mentor Henri Ducard. Murphy plays this villain with all his charisma, Neeson remains largely pale as Batman's central antagonist.\n\nThis latter problem ultimately prevents me from enjoying Batman Begins in its full favour. The film builds up the iconic hero's origin story at the ideal pace and it also succeeds in transitioning from a trained, highly skilled fighter to a raging avenger against Gotham's evil. In the last third, however, the events come to a head too quickly, the twist works, but is not forced enough in the further course and the realism that had been continuous up to that point falls victim to pure action. Nevertheless, with Batman Begins Nolan succeeded in making the Batman film that gives Bruce Wayne the best character study. He also manages to introduce the corrupt and dirty Gotham in its brilliant violence and to make the scruples of this city palatable to us. Without this grandiose establishment of the Batman phenomenon, I would have resented Nolan's subsequent abandonment of realism a lot more.",
            "review_date": "2022-03-05",
            "source": "rt"
        },
        {
            "content": "Christopher Nolan, and Christian Bale craft the greatest superhero origin movie of all time.  Also the best deconstruction of this titular hero ever.  Which includes the very source material in the comics, which never truly addresses the origin of Bruce Wayne to Batman in it's entirety.  Bale gives a great dimensional, layered performance carrying the dramatic weight of the film.  The star studded cast round the movie out with great castings such as Gary Oldman, Morgan Freeman, Michael Caine, Cillian Murphy and Liam Neeson.  Hans Zimmer and James Newton Howard redefine this new Batman with a triumphant score as well.  Only weaker aspect of the film is Katie Holmes.  But all in all, the movie that invented the concept of the franchise reboot, that other franchises such as James Bond shortly followed suit.",
            "review_date": "2022-03-04",
            "source": "rt"
        },
        {
            "content": "A superhero film without the CGI garbage and with great shots. Very refreshing.",
            "review_date": "2022-03-04",
            "source": "rt"
        },
        {
            "content": "A great start to a great trilogy",
            "review_date": "2022-03-03",
            "source": "rt"
        },
        {
            "content": "This is my second favorite Batman film. I feel like everything in this movie is just about perfect.\n\nRating - Great",
            "review_date": "2022-03-03",
            "source": "rt"
        },
        {
            "content": "Batman Begins reintroduces the caped crusader to a new generation with smart writing and and dark tone that never goes overboard. ",
            "review_date": "2022-03-03",
            "source": "rt"
        },
        {
            "content": "I will give credit where it is due this is THE reason for the past 20 years of superhero films Batman Begins revolutionized the movie industry",
            "review_date": "2022-03-02",
            "source": "rt"
        },
        {
            "content": "This film successfully shows two different sides of the personality, Bruce Wayne, the playboy and the mysterious Batman, with very natural actor acting",
            "review_date": "2022-03-02",
            "source": "rt"
        },
        {
            "content": "This is easy, either a tie or even better than the first Batman movie. The sequels to Batman really went downhill fast. This prequel is well-thought out, is paced well, great action, FANTASTIC Batmobile and cleanly executed special effects. Watching Batman evolve his techniques and assemble hi-tech gear as well as develop the BatCave a bit was interesting. The main character for Batman handles his role well. The only thing I found logically awkward was the existence and modus operandi of a shadowgroup of embittered & ruthless warriors who helped \"evil\" cities destroy themselves via the shadowgroup's \"setting up\" environments for self-destruction. Thus these \"good guys\" actually are addled automatons of \"righteous\" indignation. Oh please . . . So, Batman, once trained by them, rejects their logic and thus fights mafioso-types, petty criminals and low-life types as well as the elusive, all-wise shadowgroup. Granted, this is comic-book logic, so if you accept comic-book worldviews then Batman Begins was a perfect movie. Recommended!",
            "review_date": "2022-03-02",
            "source": "rt"
        },
        {
            "content": "Batman Begins is the 2nd best Batman film with the 2nd best Batman. My one problem with the film is that Scarecrow is not the villain. Still a good film",
            "review_date": "2022-02-28",
            "source": "rt"
        },
        {
            "content": "it's a great movie and one of the biggest upgrades in history from the atrocious film called batman and robin ruining every character while this film does everything so well and the story is incredible only thing is scarecrow and he was good but could have easily been better but it's a great movie",
            "review_date": "2022-02-28",
            "source": "rt"
        },
        {
            "content": "While I think Tim Burton's Batman has a unique and distinct place in American filmmaking this movie does a great job of treating the genre with a serious and exciting face.   Christopher Nolan's complex and multi-layered origin story is distinct from Burton's, but to some degree could never have happened where it not for Burton and Keaton.  Christian Bale is superb as the conflicted and somewhat morose crimefighter.   Liam Neeson, Katie Holmes, and Gary Oldman take a serious approach to their characters and to the subject matter.  This one is exciting and visceral.  More adult than any of its predecessors and much less comic book like in its execution.   It worse very well.  Although the second installment in this trilogy was hailed as the best I still am fondest of this one and had this not been executed so precisely the remaining two may never have happened.",
            "review_date": "2022-02-28",
            "source": "rt"
        },
        {
            "content": "Great film from Nolan but i wish it focused more on batman actually being batman instead of just a man who punches.",
            "review_date": "2022-02-28",
            "source": "rt"
        },
        {
            "content": "It was good and everyone performs well, do think it could have been faster paced for a superhero flick",
            "review_date": "2022-02-25",
            "source": "rt"
        },
        {
            "content": "My only criticism of this otherwise brilliant movie is that it is a little too long. But it is an extremely good film, that along with the original Batman could very well be the best of the Batman films(thought perhaps just lacking the original film's sophistication). People may find this blasphemy, but I did prefer this over The Dark Knight, but that was still very good. Christopher Nolan's Batman Begins is stylish, dark and gritty, pretty much what Batman should be. I have seen complaints that the film \"contradicts\" the 1989 film. Perhaps so, but what I can say in the film's defence is that Batman Begins is sort of a very loose prequel to the original movies.\n\nVisually, Batman Begins looks absolutely incredible! It could very well be the most beautiful visually of the Batman films, with beautiful cinematography and a simply dazzling view of Gotham City itself. Another asset I appreciated was that the music score didn't overpower the action, in fact it gave some atmospheric flavour to it. As much as Danny Elfman's scores were outstanding and definitely memorable, Hans Zimmer and James Newton Howard do a great job with the score.\n\nThe script is taut and well-written with lines that really make you think along with some occasional offbeat humour, the plot isn't convoluted or predictable but original, the film moves briskly(the second half was marginally better in terms of pacing to the first half though but that is in no way a flaw) and the action is explosive particularly the climax and the bat-mobile car-chase. Also Christopher Nolan's direction is excellent.\n\nThe acting, aside from the visuals is what drives the film. Christian Bale is for me the best Batman since Michael Keaton. In the role of Batman he is suitably dark and brooding, like Batman should be, and as Bruce Wayne, he is dashing, handsome and ambitious. Katie Holmes actually surprised me and in a good way. She wasn't bland or annoying, I actually found her sympathetic and surprisingly good. Liam Neeson is also very good, though he has been better, while Michael Caine is perfect as Alfred. Cillian Murphy, Tom Wilkinson and the excellent, underrated Gary Oldman are also solid in their roles, while Morgan Freeman is wonderful as always.\n\nOverall, a brilliant film that is visually stunning, gripping and atmospheric. 9.5/10 Bethany Cox",
            "review_date": "2022-02-24",
            "source": "rt"
        },
        {
            "content": "There was way too much music.  :-)  And the dialogue didn't seem realistic.",
            "review_date": "2022-02-20",
            "source": "rt"
        },
        {
            "content": "es muy buena película justo lo que necesitaba Batman después de la mala película Batman y Robin, Batman inicia  es una película muy recomendable y disfrutable",
            "review_date": "2022-02-15",
            "source": "rt"
        },
        {
            "content": "Perfection. As a movie lover and Batman fan, this one is always a delight to watch.",
            "review_date": "2022-02-13",
            "source": "rt"
        },
        {
            "content": "Following the release of \"Batman and Robin\", Warner Bros. seriously needed to redefine the character. Enter Christopher Nolan: at the time, a consistent and up and coming filmmaker, Nolan planted the early seeds of his legacy as a box office juggernaut, with this reimagined interpretation of the Batman mythos, grounded in the roots of realism. Nolan implemented and integrated his style of nonlinear narrative and film noir, which conducted an extensive character analysis of the character, Bruce Wayne. He explores Wayne's new found duality and persona with such gravitas and Oscar-worthy drama that you don't really miss the presence of the Batman. Nolan's greatest triumph is that he wrote a compelling story about Bruce Wayne and his relation to the Batman. Not just, the Batman. With strong performances from Christian Bale, Michael Caine, Liam Neeson and Cillian Murphy, Batman Begins easily claims the title of the greatest genre origin story.",
            "review_date": "2022-02-11",
            "source": "rt"
        },
        {
            "content": "Boring clichéd stuff with a poor plot, and too long.",
            "review_date": "2022-02-11",
            "source": "rt"
        },
        {
            "content": "Batman Begins is a competent superhero movie, but one which is understandably overshadowed by its illustrious sequel. The key issue is Batman Begins' supporting characters - while Scarecrow and Ra's al Ghul make a decent villainous duo, they lack the depth of Two-Face and Joker. As The Dark Knight's antagonists and their complicated, twisted motivations are key to that film's greatness, this explains why Batman Begins was comparatively overlooked outside the comic book community.",
            "review_date": "2022-02-09",
            "source": "rt"
        },
        {
            "content": "Muy buena lo que mas me gusto fue la actuación de bale las escenas de acción alfred y como hicieron todo lo del traje lo que me quedo a deber fue el villano",
            "review_date": "2022-02-08",
            "source": "rt"
        },
        {
            "content": "that was a great start to a great trilogy",
            "review_date": "2022-01-24",
            "source": "rt"
        },
        {
            "content": "A great start for Batman! It's definitely the best Caped Crusader origin movie. Featuring an incredible story, fantastic actors and a chilling soundtrack.",
            "review_date": "2022-01-20",
            "source": "rt"
        },
        {
            "content": "As the title says, it is the beginning of Batman. They really let you get to know Batman with all his flaws and talents. The movie is dark: Gotham and the psychological drama of Bruce creates that dark impression very well.",
            "review_date": "2022-01-11",
            "source": "rt"
        },
        {
            "content": "The best origin Superhero movie of all time! Batman Begins creates a new interpretation  of Batman that is done amazingly. The movie has a great story and a powerful story of getting back on your feet and becoming the idea of fear. Batman has found himself and the villains in the movie are done spectacularly with great characterization. The film delivers a great message and is one of my favourite films of all time!",
            "review_date": "2022-01-08",
            "source": "rt"
        },
        {
            "content": "A fantastic origin story along with a tremendous cast makes this one of the best origin story superhero movies ever.",
            "review_date": "2021-12-24",
            "source": "rt"
        },
        {
            "content": "It's a good film, but not a great film. \nHas some dodgy sets and some less than convincing storyline, but Bail was great and the action was exciting but I felt the villains were not used as much as they could have.",
            "review_date": "2021-12-23",
            "source": "rt"
        },
        {
            "content": "Thoughtful origin story for one of the most beloved heroes in the DC universe.",
            "review_date": "2021-12-23",
            "source": "rt"
        },
        {
            "content": "Great setup for the Nolan Batman trilogy. Good character development and action scenes. Overall very good. Only ding is no iconic scene(s) that truly great superhero films have.",
            "review_date": "2021-12-23",
            "source": "rt"
        },
        {
            "content": "This movie has an interesting premise.Nolan tries to capture the world of superheroes into realism and that did not work out for me quite well, this movie tries to capture the essence of the supernaturality with realism is not a good blend. u cannot tell the story of Batman and try to explain everything in a sensible way but this movie is really a good movie as a movie",
            "review_date": "2021-12-20",
            "source": "rt"
        },
        {
            "content": "Dark, gloomy, and an incredible introduction to the world that Christopher Nolan created.",
            "review_date": "2021-12-19",
            "source": "rt"
        },
        {
            "content": "A great beginning to the story of batman action packed with a more grounded take on the bats rogues gallery an enjoyable and exciting movie from start to finish with an great batman portrayed by Christian Bale",
            "review_date": "2021-12-17",
            "source": "rt"
        },
        {
            "content": "Nolan's first Batman film, \"Batman Begins,\" takes the franchise in a much darker, though much welcome, direction compared to previous installments which just felt significantly goofier. The villain(s) are done fantastically, and Christian Bale's Batman proves to be one of the best to have ever been released. The entire film is astounding, and once again proves the masterful craft of Nolan. My main issue with the movie is that it sometimes doesn't feel as epic as it probably intends to. However, in the end, I really did love this movie and it was definitely a great beginning to a great trilogy.",
            "review_date": "2021-12-16",
            "source": "rt"
        },
        {
            "content": "No other superhero movie even begins to cover the amount of reality and grit that this film (and series) does. It should've been a crime for anyone to make a Batman movie for at least a decade after this one because it deserves that much respect.",
            "review_date": "2021-12-13",
            "source": "rt"
        },
        {
            "content": "Good origin story to the character and a must see for a batman fan.",
            "review_date": "2021-12-12",
            "source": "rt"
        },
        {
            "content": "Great introduction to a new series of this character. I loved Nolan showed the creation of the character and brough realism to this universe.",
            "review_date": "2021-12-12",
            "source": "rt"
        },
        {
            "content": "The film was a great reboot of batman franchise. Christian Bale was absolutely perfect as batman. The supporting cast was great. The dialogues and  action was also fantastic. The only flaw is that the pace for the 1st half was slow.",
            "review_date": "2021-12-07",
            "source": "rt"
        },
        {
            "content": "Batman Begins has an excellent script that is flawless, but Nolan fails at points like very cut action scenes and very long runtime because of stuffy flashbangs. (8/10)",
            "review_date": "2021-12-03",
            "source": "rt"
        },
        {
            "content": "Pretentious misery for people who like comic book movies but have very tiny penis's and can't just admit it, so everyone has to be joyless dark misery.",
            "review_date": "2021-11-21",
            "source": "rt"
        },
        {
            "content": "the only excuse for a comic book super hero movie.",
            "review_date": "2021-11-20",
            "source": "rt"
        },
        {
            "content": "This more serious entry into the Batman movie franchise does a good job with creating complex characters in a realistic Gotham City. Christian Bale is hands-down the most convincing Bruce Wayne in the franchise. \nI'd recommend watching with subtitles if you really want to understand the plot.",
            "review_date": "2021-11-15",
            "source": "rt"
        },
        {
            "content": "A great start to the best superhero trilogy ever made. I can say without a doubt that the sequels are better, but in reality that is a very good thing. Bale does well in his opening as The Batman and he only gets better as the trilogy continues.",
            "review_date": "2021-11-10",
            "source": "rt"
        },
        {
            "content": "An amazing ride. Highly recommend watching this movie. And it's just the beginning of an amazing trilogy. 5/5",
            "review_date": "2021-11-06",
            "source": "rt"
        },
        {
            "content": "Good movie, good Batman",
            "review_date": "2021-11-05",
            "source": "rt"
        },
        {
            "content": "Easily the best Batman movie.  A good contender for the best super hero origin let alone best SUPER HERO movie of all time.  Any complaints I have ever heard about this movie all stem from discrepancies with the comic book version of the character.   I wish there was a real sequel (not the god awful two follow-up movies we actually got.)",
            "review_date": "2021-11-05",
            "source": "rt"
        },
        {
            "content": "In my opinion one of the best origin stories of all time. Bale was born to play the Dark Knight. It is an amazing watch.",
            "review_date": "2021-11-04",
            "source": "rt"
        },
        {
            "content": "I'm a late bloomer to this movie which is strange considering The Dark Knight is my favorite movie. But having watched it I really enjoyed it. One of the better origin story movies I've ever seen. The acting was great, the score was awesome, the action scenes were fun. Just an awesome and well done movie. Christopher Nolan might be my favorite director because any movie I've seen him direct I've really liked. Great movie",
            "review_date": "2021-10-31",
            "source": "rt"
        },
        {
            "content": "Thank you Christopher Nolan for bringing Batman back from the dead! This movie is absolutely brilliant from start to finish. The evolution of this interpretation of Batman is done perfectly to a T. are there is a minor pacing issues towards the middle of the phone but it's only for a moment. The rest of this film is absolutely fantastic and I can watch this movie over and over.",
            "review_date": "2021-10-27",
            "source": "rt"
        },
        {
            "content": "The start of the best movie hero trilogy ever",
            "review_date": "2021-10-19",
            "source": "rt"
        },
        {
            "content": "Great film. Sets the backstory and the scene for the trilogy. Gripping and exciting.",
            "review_date": "2021-10-16",
            "source": "rt"
        },
        {
            "content": "The start of the best superhero movies of all time, you won't see such a dark reality story with great plot and many talented top-notch actors, Christian bale proves to be the best Batman up to date.",
            "review_date": "2021-10-15",
            "source": "rt"
        },
        {
            "content": "The first half of this film is fantastic, but it loses its magic in the second half. \n\nA-(Quality) 85%(Entertainment)",
            "review_date": "2021-10-15",
            "source": "rt"
        },
        {
            "content": "Unreal film, Christian Bale is easily the best Batman",
            "review_date": "2021-10-10",
            "source": "rt"
        },
        {
            "content": "Good, but over rated. I've attempted watching this movie several times over the years, and every time it's the same result: too long, becomes boring, I lose interest and forget a lot of it. I love the joker in this, one of the best to do it. Won't try again to watch it.",
            "review_date": "2021-10-06",
            "source": "rt"
        },
        {
            "content": "After a string of bad Batman movies, this is a breath of fresh air.",
            "review_date": "2021-10-04",
            "source": "rt"
        },
        {
            "content": "Christian Bale gives an action packed performance as Batman in this insanely well plotted out Nolan film. With perfect set pieces as well as excellent role filling, Batman Begins is guaranteed to be a top 10 hero film for years to come.",
            "review_date": "2021-09-28",
            "source": "rt"
        },
        {
            "content": "Awesome movie and cast.",
            "review_date": "2021-09-27",
            "source": "rt"
        },
        {
            "content": "It is out of substance and dark, however it is just like the origins of the character. 6/10",
            "review_date": "2021-09-23",
            "source": "rt"
        },
        {
            "content": "Scarecrow lives up to his name tumbler is pretty awesome good start to the dceu",
            "review_date": "2021-09-04",
            "source": "rt"
        },
        {
            "content": "A good start to the Christopher Nolan trilogy. 7.5/10",
            "review_date": "2021-09-02",
            "source": "rt"
        },
        {
            "content": "I LOVED this movie. Christian Bale is the perfect Batman ",
            "review_date": "2021-08-30",
            "source": "rt"
        },
        {
            "content": "Batman Begins is slow to develop, but it also takes far greater care of its characters than just about any superhero movie. It does this at the price of a great villain, perhaps the only flaw of the movie. But the sacrifice pays off.",
            "review_date": "2021-08-18",
            "source": "rt"
        },
        {
            "content": "An awesome re-boot of Batman who everybody loves!!!!",
            "review_date": "2021-08-18",
            "source": "rt"
        },
        {
            "content": "The best of its genre. The best Batman origin story to date. Excellent cast, directing, story and cinematography.",
            "review_date": "2021-08-15",
            "source": "rt"
        },
        {
            "content": "Batman Begins is an amazing Batman movie, and is totally different than all before it. It has stellar cast who are brilliantly cast in their roles. Christian Bale brings a certain edge to Batman in this darker tone that allows for him to full embody the character. He also plays Batman as Bruce's true identity and that the Bruce Wayne persona is the fake which is accurate to the comics. Scarecrow is great in this movie, but he is very underused towards the end and had a lot more potential. It was really awesome to finally see Ra's Al Ghul in live action form as he has been a big part of Batman's origin in the comics. It's also refreshing to see a Bruce Wayne who gets gadgets from someone else, instead of making them all himself. Overall this is a great Batman movie, and recommend it to all super hero fans.",
            "review_date": "2021-08-10",
            "source": "rt"
        },
        {
            "content": "90/100 one of the best starts",
            "review_date": "2021-08-09",
            "source": "rt"
        },
        {
            "content": "This movie isn't The Dark Knight, but I think that some people hold the other Christian Bale Batman movies to the ridiculously high standard of the second in the trilogy. Trying to forget about Dark Knight, I decided to revisit the two other Batman movies and to my surprise they weren't actually that bad. In fact, both were pretty good, not perfect but still pretty darn good. Perfect example: the one that started it all, 2005's Batman Begins.\n\nThe movie features Bruce Wayne's life in sometimes excruciatingly long detail. Remember when he became a ninja and almost joined the League Of Shadows under an obviously evil guy Ducard? No? It happened. Or where little Bruce Wayne falls in a well and is attacked by bats, making them his greatest fear even well into his adulthood? Still no? Well ok. I've never read a Batman comic before so I don't know how accurate this \"gritty and realistic\" take really is but this movie had to walk so Dark Knight could run.\n\nAnd yes, Katie Holmes gives the infamous wooden performance as Rachel Dawes but I believe part of that is because of the writing. They give her some of the most pretentious and melodramatic writing it makes me nauseous. They got better when it came to Dark Knight, also replacing Holmes with Maggie Gyllenhaal helped too. With that aside, a lot of the movie is really good. It has an incredible supporting cast including Morgan Freeman and Michael Caine. And I need to take a minute to praise the one performance that nobody seems to mention: Cillian Murphy as Jonathan Crane/The Scarecrow. Dang! His decent into madness is horrific to watch, even if it is reduced to only being a subplot. I genuinely wish I could've seen more of him.\n\nOverall, the movie isn't as bad as many people say it is. In fact, it's pretty darn good! Is it Dark Knight good? No. But this is a Batman movie definitely worth a watch (especially when compared to the previous and horrendous \"Batman and Robin\")",
            "review_date": "2021-08-09",
            "source": "rt"
        },
        {
            "content": "This is a great movie with great directing but the entire movie is just Batman becoming Batman. Also Scarecrow who is a major villain seemed very minor. I get that a little because he wasn't the main villain but it bothers me that the main villain was Ra's Al Ghul who doesn't really interest me as a character. Other than that this movie is excellent.",
            "review_date": "2021-08-02",
            "source": "rt"
        },
        {
            "content": "I liked it. It was fun and the acting was good. It was a good way to start out the trilogy.",
            "review_date": "2021-08-01",
            "source": "rt"
        },
        {
            "content": "Batman begins does the Dark Knight justice in the first installment of the trilogy. The worst movie out of the 3 in my opinion but by-far the most important in terms of story development. Its always exciting to see how a director tackles famous super hero origins as they have been done before plenty of times on the big screen and/or television. Christopher Nolan's natural ability to tell stories paired with Hans ZImmer's fantastic score (which is one of the best scores in a super hero movie period) speaks louder than most modern block buster movies do. A true classic that gives any comic book fan chills.",
            "review_date": "2021-07-25",
            "source": "rt"
        },
        {
            "content": "Batman Begins is a new look at the world of Batman but in the mind of Christopher Nolan, this Bruce Wayne has more background than the 90s, his evolution as a character and as Batman are very well raised, Batman takes time to appear but that does not matter since before they have to tell us that I led Bruce to be Batman everything that led to having his rules when it came to doing good, not like in the version of Tim Burton where Batman and Bruce are not so much background and no longer They present as a night watchman, Rache I think is one of the problems of the film that although we have her as a character that helps Bruce not to be a murderer, she is still another character in the story that does not have much relevance in Lucius Fox is an interesting character and gives us a little more clarification of how Bruce gets his artifacts and the truth is a charismatic character, the villain is also something to applaud but at the same time something to criticize since he is something mu and wasted we have two The Scarecrow and Ra's al Chul while one is a little developed and another is more it is a bit complicated to know who the main villain is, in conclusion Batman Begins is a great new vision of the character by a great visionary",
            "review_date": "2021-07-24",
            "source": "rt"
        },
        {
            "content": "Best trilogy of all time if you ask me.",
            "review_date": "2021-07-24",
            "source": "rt"
        },
        {
            "content": "Il primo atto della strepitosa trilogia diretta da Nolan, funziona perfettamente nel gettare le fondamenta per i capitoli successivi, scavando nell'infanzia e nella psiche del protagonista Bruce Wayne, e raccontando tutto ciò che precedette la trasformazione in Batman e le sue prime fasi.\nCiò che invece funziona leggermente meno bene è il finale, con l'antagonista Liam Neeson che riappare solo per pochi minuti prima della battaglia finale senza grandi contenuti.\nComunque era chiaro fin da subito l'obiettivo di sacrificare parte della trama legata solo al primo atto, per dare più solidità alla trilogia completa; obiettivo perfettamente riuscito.",
            "review_date": "2021-07-15",
            "source": "rt"
        },
        {
            "content": "It is a good start to the fantastic Nolan trilogy and shouldn't be completely overshadowed by the dark Knight",
            "review_date": "2021-07-10",
            "source": "rt"
        },
        {
            "content": "A movie that was part of my childhood! A title that gives more maturity to the story of the Dark Knight, with a satisfactory origin even with the disagreements of the original comic book work, Christian Bale is absolutely perfect as the Bat. Detail for the costume: the best I've seen in all live-action movies! A villain already known and very well presented. Great work!",
            "review_date": "2021-07-05",
            "source": "rt"
        },
        {
            "content": "A good movie, but pretty forgetable. Aside from Scarcrow and Batman, there are not very memorable characters",
            "review_date": "2021-06-29",
            "source": "rt"
        },
        {
            "content": "The best way to begin a trilogy.\n\nBatman has always been a dark character, and Nolan did an excellent job of rebooting him. Instead of a typical superhero film, he delves into this aspect of filmmaking. The acting, as well as the themes and writing, are excellent.\n\nPersonally, Batman Begins has earned its place as one of the greatest film trilogies of all time.",
            "review_date": "2021-06-28",
            "source": "rt"
        },
        {
            "content": "Amazing batman origin story",
            "review_date": "2021-06-27",
            "source": "rt"
        },
        {
            "content": "Christopher Nolan's \"Batman Begins\" shows us exactly how Bruce Wayne (Christian Bale) transforms into the caped crusader we all know and love, Batman. Admittedly like many others, even though this is the first entry in the Dark Knight Trilogy, I watched it is as my last one, and that is due to me not even knowing of it's existence, which is thanks to it being heavily overshadowed by the critically acclaimed sequel, \"The Dark Knight.\"\n\nBatman Begins has a simple plot to follow full of twists. A young Bruce Wayne travels to the Far East, where he's trained in the martial arts by Henri Ducard (Liam Neeson), a member of the mysterious League of Shadows. Ducard later reveals the true purpose of the League, the complete destruction of Gotham City as they feel it is an unjust cesspool full of criminals that is too far gone to be saved and must be cleansed to preserve their duty and for justice and balance to be restored. Bruce does not agree with the League's morals and returns to Gotham on his own determined to clean up the crime-ridden and corrupted city without resorting to murder. With the help of his loyal butler Alfred (Michael Caine) and Lucius Fox (Morgan Freeman), a tech expert at Wayne Enterprises, Batman is born.\n\nThe number one takeaway from this film that I did not experience as much in any other Batman movie, was that it really makes you care and feel compassion towards Bruce Wayne himself, not the masked vigilante he disguises himself as. The real Bruce is tragic, realistic, relatable, quite unstable, and frankly doesn't know what his purpose is or what he should be doing with himself. This is the origin story, and you get to first hand see the traumatic events that turned him into the lonely, guilt ridden bitter man you see today. His feelings and actions are completely justified, and I've gained a lot of respect for the character.\n\nNow this is a dark, gritty and mature film clearly made for adult fans, do not expect the colorful, campy comic book styled \"Joel Schumacher\" treatment here, this is going to get real, real fast. I can and do appreciate the attempt to not be a generic superhero film and head towards the crime drama genre, and don't get me wrong it's a great movie, but there a few issues that keep it from being perfect movie status like the sequel in my books. It was maybe a bit too serious for it's own good, and ends up being so focused on becoming an art piece that it almost stops being fun. Primary antagonist Ra's al Ghul is great, but secondary villain Dr. Crane a.k.a. Scarecrow (Cillian Murphy) has an apparent lack of quality visual effects and proper screen time. The long run time was not wasted, but they probably did not need to include so many side characters, world building and lore into what could have been a quicker, neat, well done origin story.\n\nOverall I liked and can get behind Batman Begins, I do not think it's the best in the \"Dark Knight Trilogy,\" but it's a top quality film on it's own accord especially if I stop comparing too much. This film delivers a uniquely cold, cruel, and memorable experience that will make you see and appreciate Bruce Wayne and his Batman persona from a completely new perspective.",
            "review_date": "2021-06-23",
            "source": "rt"
        },
        {
            "content": "I am really hyped to see the next two films of the trilogy. Honestly, superheroes is not something that I am attracted to but Nolan made me want to explore this side of filmmaking. The character of Bruce Wayne ( Batman) was so perfectly developed. We had all his background. It was normal and we could understood why he became batman. Paired with great music and epic scenes, this Batman movie was so refreshing and incredibly fun to watch. The dialogues where surprising for a Nolan movie. Indeed, I often find Nolan's film's dialogues a bit to cliché and not complete, but they were perfect and some lines were awesome. It is a pure golden film because of the epic scenes, music, acting, script and characters development ( not just batman, everyone (Dr. Crane and Ra's Al Ghul) ). But still, it was nothing to break walls. 95% I'd say.",
            "review_date": "2021-06-21",
            "source": "rt"
        },
        {
            "content": "Despite not being a massive Batman fan, I actually really enjoyed this. Well done",
            "review_date": "2021-06-21",
            "source": "rt"
        },
        {
            "content": "This is a well crafted origin story from mastermind Christopher Nolan, and his first outing into the world of the masked vigilante crime fighter. This has aged quite well, with a visually impressive, high production value and well directed vision. It has a sense of realism that was mostly unheard of in comic book films at the time and the story, characters and set pieces, reflected this. Complimentary to Nolan's vision is the perfect casting, with Bale and Caine as notable stars. \nIt does struggle a bit with its identity, with a third act and villain that doesn't quite blend that well with the realism of other story aspects. It is also surprisingly poorly edited in action sequences, with fights being cut quickly and hard to see, something that is improved in later films.\n7.5/10",
            "review_date": "2021-06-18",
            "source": "rt"
        },
        {
            "content": "Full of jokes, action, & drama!!!!!!!!!!!!!!!! LOL",
            "review_date": "2021-06-13",
            "source": "rt"
        },
        {
            "content": "My favorite DC character, can't be any better",
            "review_date": "2021-06-12",
            "source": "rt"
        },
        {
            "content": "My least favorite Batman movie of all time. The next two movies are better.",
            "review_date": "2021-06-12",
            "source": "rt"
        },
        {
            "content": "Christopher Nolan reinvented the Batman name in a way that would change cinema forever. Every origin story after this would somehow copy this film. Nolan makes for a fun, interesting origin story about the caped crusader. The acting is brilliant, the themes and writing is brilliant, and this film set up one of the greatest trilogies ever.",
            "review_date": "2021-06-12",
            "source": "rt"
        },
        {
            "content": "Other than the garbage fight scenes, Batman Begins is absolutely incredible. Christian Bale was absolutely perfect as Batman and he has such great chemistry with Gary Oldman's James Gordon and Michael Caine's Alfred and the design of Gotham in this movie is brilliant. It truly feels like a disgusting criminal underground and this is the perfect Batman origin story as Bruce struggles for revenge against his parents and it's so emotional and thought provoking. It also has some really fun action like the rooftop car chase and of course, Hans Zimmer's score is quite brilliant.   It doesn't get enough credit honestly. Sad it's overshadowed by The Dark Knight",
            "review_date": "2021-06-11",
            "source": "rt"
        },
        {
            "content": "The start of the best live action Batman series.",
            "review_date": "2021-06-09",
            "source": "rt"
        },
        {
            "content": "its a great origin story. but it has some terrible fight scenes with shaky cam. dark knight is better. but this one also good. still don't like the voice of bale,  but its very inspiring in terms of how Bruce Wayne's personality was developed in this movie. good movie with some flaws that's all",
            "review_date": "2021-06-06",
            "source": "rt"
        },
        {
            "content": "A good revival to a dead franchise.",
            "review_date": "2021-06-04",
            "source": "rt"
        },
        {
            "content": "Definitely in the Top 5 of Best Comic Book Movies for me, although it it isn't as loved as its sequel, it is pretty close, worth seeing, love that it's a trilogy but it could've been a solo Film and it's legacy is legendary to me",
            "review_date": "2021-05-30",
            "source": "rt"
        },
        {
            "content": "91/100. Sure, ‘The Dark Knight' gets all the praise in the Nolan Batman trilogy but don't sleep on the movie that set the tone for the future of the character. Upon a recent rewatch, all movie fans, not just comic book movie fans, should watch this film.",
            "review_date": "2021-05-26",
            "source": "rt"
        },
        {
            "content": "Jeff Barnes \n5/25/21 \n\n\nBatman Begins Review\n\tBatman Begins gives depth to the origins of the superhero Batman with its story and cinematography, and so does Christian Bale with his performance. It also does this well through other characters, and with action and special effects. In Batman Begins Batman fights crime in Gotham city after being trained by his mentor Ducard \n\tBatman Begins gives insight and darkness to Batman and Bruce Wayne. It defines who Bruce Wayne is and his story. Bruce Wayne lives an authentically dark life as his vigilante alter ego Batman. Wayne's life becomes shadowy in a metaphorical way. He lives in a corrupt city with criminals, a mob boss, and a mad psychiatrist, he becomes part of a group known as The League of Shadows. His life also becomes dark in a physical way especially when he decides to live in a dark world as Batman. The city Bruce Wayne lives in, Gotham, is genuinely dark especially at night as seen through Wally Pfister's brilliant cinematography. Bruce Wayne decides to join a ninja group known as The League of Shadows who dress in black. There's a tank or car that Wayne drives that he wants to be black and when he dresses up as his alter ego Batman he dresses in black.   Perhaps the reason Bruce Wayne becomes so fixated with the color black is because he's lived a cloudy life with having seen bats in a cave, having seen his parents killed, and with living in a very physically black and corrupt city.\n\tChristian Bale makes Bruce Wayne become very alive. He turns Wayne into a precisely distorted and puzzled man after his parents die. Bruce Wayne ends up looking very determined yet also very afraid. The last thing he wants to do is the wrong thing especially after the criminal Joe Chill killed his parents. He particularly looks this way when he's meeting The League of Shadows for the first time, when he's about to murder Joe Chil, and when he throws the gun, he was about to use to murder Joe Chill within the ocean. \n\tThe film deals with fear because Bruce Wayne has dealt with fear throughout his life. He has experiences with Bats and being traumatized with his experience of watching his parents murdered in front of him. One of the villains in Batman Begins is Scarecrow who brings out fear in people with using a hallucinogenic drug and this is all done with wonderful special effects. \n\tBatman Begins also defines Batman because Bruce Wayne realizes that the city, he lives in is full of crime and he wants to physically fight crime. When Bruce Wayne joins The League of Shadows, he learns combat skills. \n\tBruce Wayne really wants to change the city and world he lives in like his father Thomas Wayne did in a similar way through his wealth. He fights crime as his vigilante alter ego Batman. There are many people in the film who guide Bruce Wayne in his quest to become Batman. Ducard with giving him combat skills, and Lucius Fox with introducing him to new technology and equipment. Bruce's butler Alfred helps him set up everything to become Batman. \n\tBatman Begins gives creation to Batman and to the story of Batman and it does so in a very proper manner.",
            "review_date": "2021-05-25",
            "source": "rt"
        },
        {
            "content": "Batman Begins - 9/10. You might be thinking, how is this film underrated? Granted, The Dark Knight trilogy is one of the greatest film trilogies in cinema history. The way Christopher Nolan took the character of Batman and evolved him into a fleshed out protagonist who goes through an incredible character arc is still amazing to think about. Before and after Batman Begins released, many directors have tried to replicate a journey like this, with many not succeeding. But in comparison to the attention and praise that the eventual sequels The Dark Knight and The Dark Knight Rises got, Begins falls just a little short, but still fairly close. It's not forgotten, but kind of unfairly overshadowed by the other two films. When Nolan decided to humanize the character and try to make Batman realistic enough to fit in the real world, it was a tall task indeed. The movie is interesting for how it focuses a lot on Bruce Wayne, rather than Batman. We see a broken and lost man who decides to transform himself into an ideal and symbol that would seek justice for Gotham. The theme of recovery and identity are analyzed throughout the duration of the film. Nolan wants us to really understand the man before he becomes a myth. Christian Bale gives us glimpses of how his portrayal of the characters would help define how a performer should take on superhero roles. We see the growth in this film, which gets defined in the next two movies. And I believe that is the reason why Begins doesn't get as much attention as the other two films. The other two films have loads of Batman sequences, whereas this film was made to help give the introduction. The magnitude of this movie is still felt today however: countless productions try to reboot their franchises in a similar tonality as this movie. But what all those films usually lack or don't understand is that it's not the brand that people connect with, it's the message. In this case, Nolan helped deliver a hero that was very human. That's why this movie and eventual trilogy are beloved. I miss Nolan directing Batman movies. Maybe one day, he will return with a great story for a fourth inclusion in the series!",
            "review_date": "2021-05-18",
            "source": "rt"
        },
        {
            "content": "Well, at least Batman fanboys got what they wanted.\nDialogue has all the subtlety of a sledgehammer and is delivered in the most melodramatic way possible.  Take a drink every time the word \"fear\" or variation of it is said. Direction is average at best, shoddy at worst.",
            "review_date": "2021-05-17",
            "source": "rt"
        },
        {
            "content": "A strong start to the reboot of Batman. The darkness in this film is unsettling, which is done very well. The action scenes in this film aren't as strong as the sequels though.",
            "review_date": "2021-05-15",
            "source": "rt"
        },
        {
            "content": "A good origin story and good beginning to a great superhero trilogy. Some moments are a bit comically dramatic. And the whole microwave thing completely falls apart if you examine it at all. And the whole idea that Bruce's father would have been some exceptionally altruistic billionaire who miraculously cared for the lower class and genuinely cared about making the city better above all else is asinine. But you have to suspend some realism for these kinds of films. It's a good watch. But the 2nd and 3rd movies take the trilogy to a new level.",
            "review_date": "2021-05-08",
            "source": "rt"
        },
        {
            "content": "Storyline was great, character development was good, and the intensity was on par. The only problem I had was the shaky cam action scenes. It’s the worst thing to have ever happened to actions films in general. ",
            "review_date": "2021-05-07",
            "source": "rt"
        },
        {
            "content": "This film offers viewers a small insight into the world of Christopher Nolan's clever storytelling and how he rebooted a thought to be dead franchise. This film shows batman at a point where he can be taken seriously and watching this film we forget it's a superhero movie, from beginning to end this film is fantastic. Unlike other superhero movies it never seems to drop its story or realism in the final third, it simply gets better with a outstanding cast and great director.",
            "review_date": "2021-05-07",
            "source": "rt"
        },
        {
            "content": "Great acting, great origin, etc., but without the depth of other Batman films.",
            "review_date": "2021-04-30",
            "source": "rt"
        },
        {
            "content": "Christopher Nolan understands and creates the best version of batman ever made giving this character the best origin story.",
            "review_date": "2021-04-29",
            "source": "rt"
        },
        {
            "content": "Batman Begins was the second Batman movie I watched after Batman v Superman. I didn't know what to expect from it. I just wanted to watch The Dark Knight and I had heard that it was a sequel to this movie, so I had to see this first in order to have some \"actual\" good time. Instead I ended up really liking this one. This is the kind of movie I'd call something that defined the cinema of the mid 2000s. And it's definitely for all the good reasons.\n\nThe movie begins with Bruce Wayne being in prison and then being recruited by The League of Assassins to become one of them. Normally I hate the idea that movies use by beginning at some random event and then giving exposition of the past. It happens everywhere - Sonic the Hedgehog, Megamind, Birds of Prey, Man of Steel, it happens in so many places. But I won't complain about that, considering that none of the movies I can think of came before this. So let's just say it was a new idea back then.\n\nThe way Bruce Wayne comes back and realises he can't do anything to the bad guys because they know he has a lot to lose and so takes the mantle so that they fear the same thing as him was very exciting. It's one of the key moments of this movie I always look forward to whenever I watch this movie. I really like how he slowly transforms into Batman, initially beginning with just a regular costume and then slowly upgrading his suit, weapons and finally his Batmobile.\n\nI didn't know anything about any Batman villain other than Joker, Deathstroke, Harley Quinn and Killer Croc. So the villains of this movie namely Ra's al Ghul and Scarecrow were completely new to me. Whatever they'd have done with these characters, I'd have accepted it all like a blank slate. And they really did them perfectly. Ra's wanted Batman to kill, while Scarecrow wanted to instill fear in all the residents of Gotham. Both of these motives are characteristics that define Batman - someone who will instill fear in the midsn of all the criminals but will never kill. Though that's one problem in this movie since he kills a lot - first the fake Ra's, then the League of Assassins in the burning building, then a cop in a police car and finally Ra's himself (his no kill rule includes saving people so saying that he didn't save him is a debunked excuse).\n\nThe movie has aged pretty poorly in terms of video quality. It is very grainy and the colours are also very dull which can easily get mixed if watched on a new TV. This is really weird because Superman Returns came out just a year later but its video quality is absolutely perfect in spite of being made by the same company. It needs to be remastered to 4K using AI upscaling and added more colour variations so that it is fit to be watched. Once that happens, I'd really be willing to watch it again.",
            "review_date": "2021-04-28",
            "source": "rt"
        },
        {
            "content": "We should always thank Christopher Nolan for bringing this dead Cinematic franchise back to life.",
            "review_date": "2021-04-22",
            "source": "rt"
        },
        {
            "content": "He is one of the most popular comic book characters of all time. There have been multiple stories of him through different types of medium. Many people have continued to share his legacy. BATMAN BEGINS is one of those stories. It shares many common values, from its mysterious origins, to the birth of a hero. It also brings in a ton of action and suspense that will make you hang on for dear life.",
            "review_date": "2021-04-16",
            "source": "rt"
        },
        {
            "content": "es una gran pelicula tratando los inicios de un superheroe",
            "review_date": "2021-04-13",
            "source": "rt"
        },
        {
            "content": "I loved this movie, hell I loved all the dark knight trilogy! The action, the acting, the EVERYTHING. I wish I could watch this again without knowing what happens.",
            "review_date": "2021-04-10",
            "source": "rt"
        },
        {
            "content": "Perfection for the Dark knight",
            "review_date": "2021-04-10",
            "source": "rt"
        },
        {
            "content": "One of the best trilogies of all time.",
            "review_date": "2021-04-10",
            "source": "rt"
        },
        {
            "content": "Christopher Nolan captured the true essence of the batman in this origin film. Showcasing the batman as a figure in the shadows and darkness. The cinematography throughout along with excellent scores would be the beginning of revitalizing the DC universe and an excellent trilogy.",
            "review_date": "2021-04-08",
            "source": "rt"
        },
        {
            "content": "a hell of a movie!\nUnderrated honestly. Feels a little out of place with the others in the trilogy but not much",
            "review_date": "2021-04-08",
            "source": "rt"
        },
        {
            "content": "Batman Begins is the movie that saved Batman and made the character great again. Batman Begins is not only the movie that changed comic book films but it also changed the film industry. Batman Begins is one of my favorite movies and it's kinda hard not to like this movie because it's destined to be a classic of the superhero genre.",
            "review_date": "2021-04-07",
            "source": "rt"
        },
        {
            "content": "The idea of a dark and gritty Batman film was a risky move, but I'm so glad they did it. This is an excellent movie that perfectly shows the origin story of Bruce Wayne. The acting is phenomenal and I'd highly recommend watching it.",
            "review_date": "2021-04-01",
            "source": "rt"
        },
        {
            "content": "This is the film that most convincingly tells Batman's origin story.",
            "review_date": "2021-03-25",
            "source": "rt"
        },
        {
            "content": "It had everything you would of wanted in a Batman movie, from it's sinister undertone to the blinding fighting scenes which you would expect when fighting batman, he is apart of the shadows, the darkness - it was a great 'origin' story that stayed true to the cause of batman.\n\nWith the visuals and atmosphere hitting the mark of what Gotham is and should be, it explored Gotham if not 100% accurately - While as the DK series is GREAT, it did have it's lacklusting visuals that made it not feel like Gotham - which in fact, Batman begins was successful with. \n\nBringing the aspect of it being less mythical (in terms of Ra's al Ghul being more of tricks and deception rather than ever-lasting) it brought a realistic tone onto the movie which worked amazingly. \n\nThe soundtracks of the movie complimented every scene that it took part of and made scenes even more sinister that it actually was, this movie mastered the darkness of batman - This is his moment, he becomes apart of the darkness, embraces it and the movie shown this extremely well. \n\nI could not think of a moment where this film was let down, Ok ok ok let's not be biased here - I would of preferred to of seen Ra's al Ghul the main plot (he was but he went down quite quick) I would of hopped he had more screen time than scarecrow - scarecrow was shown great here, In the comics he's much more... extreme in terms of visuals - if it's in the comics or games. I would of liked to see more visual disturbances from him, more horror - I wanted to understand why his victims would go into a psychotic break, men who had no prior mental illnesses. \n\n10/10.",
            "review_date": "2021-03-24",
            "source": "rt"
        },
        {
            "content": "The best Batman origin movie ever. It will be hard to top this Batman origin movie, everything about it is just amazing. Thanks mister Nolan and his team.",
            "review_date": "2021-03-23",
            "source": "rt"
        },
        {
            "content": "Um dos melhores filmes de origem na minha opinião !  Excelente trilogia .",
            "review_date": "2021-03-22",
            "source": "rt"
        },
        {
            "content": "Great reboot of Batman and as of this writing the launch of the best live-action Batman franchise to date. It does get a little old having to retell Batman's origin story, but if you are going to burden yourself with retelling what everyone knows, this is the way to do it.",
            "review_date": "2021-03-20",
            "source": "rt"
        },
        {
            "content": "A great origin story",
            "review_date": "2021-03-19",
            "source": "rt"
        },
        {
            "content": "The first movie in the Dark Knight trilogy and my least favourite.\n\nBatman Begins was a huge improvement over the awful Batman films from the mid 90s. Christopher Nolan brought a more realistic and darker Bruce Wayne to our screens.\n\nA solid start to the trilogy.",
            "review_date": "2021-03-15",
            "source": "rt"
        },
        {
            "content": "I always thought the Dark Knight was the greatest of the Christopher Nolan Batmen, but I am now having second thoughts after revisiting Batman Begins this past weekend. The difference I now draw between the two are their subtleties. The Dark Knight has the most iconic villains of all time in Heath Ledger's Joker, who is memorable precisely because of his flamboyance and theatrics. But the villain in Batman Begins is as illusory as the shadow ninjas it is composed of, and the villain of Batman Begins blends in with its surroundings of modern society. Much like Thanos from the MCU, the villains make some compelling arguments about good and evil - and their primary goals are to rid the world of evil. But it requires strength of character to resist evil means to achieve a \"good\" end. \n\nBatman Begins requires multiple rewatches - I caught more information during this round than I had ever remembered before. You need to pay more attention during this movie than the Dark Knight, but you will be rewarded for the effort.",
            "review_date": "2021-03-08",
            "source": "rt"
        },
        {
            "content": "Such a clean, intense, and complex film. It takes itself very seriously, but doesn't go overboard. Christopher Nolan was the perfect choice for this trilogy.",
            "review_date": "2021-03-08",
            "source": "rt"
        },
        {
            "content": "A very good movie, an excellent start to a great franchise. (4.5) Stars",
            "review_date": "2021-03-07",
            "source": "rt"
        },
        {
            "content": "Awesome Batman movie.",
            "review_date": "2021-03-06",
            "source": "rt"
        },
        {
            "content": "Testing Testing testing",
            "review_date": "2021-02-22",
            "source": "rt"
        },
        {
            "content": "Es mi favorita de la trilogía, me la he visto un montón de veces.",
            "review_date": "2021-02-22",
            "source": "rt"
        },
        {
            "content": "I had not seen this movie in 10 years, because I remembered not really liking it the first time, but man did I enjoy watching it just now in 2021.  I wouldn't say that it has good dialog, but it does have a lot of great lines.  The practical effects have aged incredibly well, too.  It just does such an amazing job of establishing a comic book world that isn't so much realistic as it is believable, which is something the Marvel movies never achieved for me.  I give it an A - Make a point to go see this movie",
            "review_date": "2021-02-20",
            "source": "rt"
        },
        {
            "content": "Something worse than Katie holmes-Katie holmes, in a batman movie- or any superhero movie for that-with all her superhero counterparts equally sucking, of her time- Margot Robbie, Scarlett and Amy Adams-the worst-and every boring male, to fill their overgrown, balloon 🎈 inflated suits-ben, George and the newest and greatest-Robert pattinson -snoozing even the coolest book 📚- comic book heros-brining English to the outside and not in -\"I can stand that cover but there's too much colour -it's making my eyes hurt, seizure?\"\nFeminists and smart girls 👓 alike, brining a new name to the word independent and cool \"That's that other doll right? The action-hero? The one who wears glasses and writes? Or is that takes pics? Oh well, w/e, I mean  she had a boyfriend, if she could get her nose 👃 out of the book?\" Or- \n\"I'm done playing house, out with the kitchen, in with the, librarian glasses 👓? She's cute right, I could make it work, if I hike the skirt, and my pay. 😉 \"\nAre comics even books, I mean there's a lots pictures, I could go for that? -good job America, creating real role models and shoes to fit in -the bombshell character in all books- losing pages and clothes all at the same time, it's a super strength. \n\nBatman is getting worse- along with, Spider-Man and every other endearing role in super, hammer hitting hulk style strength, the men-more prim and propor - than the centre fold -the real dames, the model- cat 🐱 walk.",
            "review_date": "2021-02-20",
            "source": "rt"
        },
        {
            "content": "This is a great film it teaches to win from fear great story and action. Superb film you will love to watch",
            "review_date": "2021-02-20",
            "source": "rt"
        },
        {
            "content": "I really like this movie.",
            "review_date": "2021-02-17",
            "source": "rt"
        },
        {
            "content": "I watched this before I had my kids, and loved it. I figured that my kids were finally old enough to see it, and they loved it too. Christian Bale gives a nice performance, as well as Michael Caine, and Liam Neeson. Dark, and brooding. But the film might be scary for younger folk, and deals with gangsters and drugs, so might be a movie for ages 12+.",
            "review_date": "2021-02-16",
            "source": "rt"
        },
        {
            "content": "I saw this in the theater when it came out and I watched it again last night and I'm happy to say that it really holds up. Fantastic superhero movie.",
            "review_date": "2021-01-31",
            "source": "rt"
        },
        {
            "content": "my favourite of the dark Knight trilogy. the origin story is one of the best I've ever seen, I love Liam Neeson as the villain and overall an excellent cast. Nolan's not the best at shooting action scenes though.",
            "review_date": "2021-01-28",
            "source": "rt"
        },
        {
            "content": "Why do we fall? To sit on the couch, grab some popcorn, and watch this awesome, darker, cooler reset to the Batman saga!",
            "review_date": "2021-01-27",
            "source": "rt"
        },
        {
            "content": "One of the best superhero movies. This movie made me fall in love with Batman. This movie got Batman right and it not only made me care about Batman but it made me care about Bruce Wayne. The villains in this film were great Scarecrow and Ras al Gul. Love the colouring and style of this film . And had a great soundtrack.",
            "review_date": "2021-01-24",
            "source": "rt"
        },
        {
            "content": "Batman Begins boasts a great cast (minus Katie Holmes) and a very well crafted story and action. It isn't quite the groundbreaker that its sequel The Dark Knight was, but it is a really good movie nonetheless.",
            "review_date": "2021-01-17",
            "source": "rt"
        },
        {
            "content": "Slightly awkward attempt by Nolan to combine some \"intellectual\" content with a superhero movie. The result is a slow start during which quite a lot of metaphysical guff is spoken (much of it by Liam Neeson). Things pick up a bit when Batman appears, and the action is generally well filmed. The plot is daft though, and the script is mixed. Gets an extra star for having Katie Holmes in it.",
            "review_date": "2021-01-17",
            "source": "rt"
        },
        {
            "content": "Super good and Nolan takes the movie to a different level. Loved the scarecrow and loved Christian Bale as Batman.",
            "review_date": "2021-01-17",
            "source": "rt"
        },
        {
            "content": "One of the best origin story movies there is. Christopher Nolan brought his brilliance as a filmmaker and as a writer to the superhero genre and reinvented it.",
            "review_date": "2021-01-16",
            "source": "rt"
        },
        {
            "content": "An impressive superhero movie that manages to be both new and refreshing (relative to its time of release) while paying homage to the characters it adapts. The cast is impressive across the board, with Michael Caine, Morgan Freeman, Bale, Oldman, and Holmes doing a great job. Cillian Murphy does a stand out job as Scarecrow as well. At times, the movie struggled with the limitations of its writers and time. The depiction of \"ninjas\" within the weirdly orientalised cult of Ra's Al Ghul does not hold up to scrutiny, and people of color are handled strangely throughout the film. The caricature of the fake Ra's Al Ghul as an Asian monk-type figure was jarring, feeling like it leaned into misleading stereotypes for the purpose of a bait-and-switch that felt both predictable and insensitive. What seemed to be the single Black cast member, Fox, was relegated to a minor supporting role, while the only woman in Gotham, Rachel Dawes, did very little except scream in fear and comfort a stray child. Overlooking Christopher Nolan's general issues with representation and diversity, the film is a solid, action-filled movie with excitement, danger, and grittiness. I can see why it is such a cult classic, but I also wish its problems were more genuinely acknowledged as things to improve upon in the future.",
            "review_date": "2021-01-16",
            "source": "rt"
        },
        {
            "content": "It is a seminal movie which set the tone for superhero film-making.",
            "review_date": "2021-01-12",
            "source": "rt"
        },
        {
            "content": "Best movie so exciting",
            "review_date": "2021-01-11",
            "source": "rt"
        },
        {
            "content": "Exciting, thrilling, amazing",
            "review_date": "2021-01-04",
            "source": "rt"
        },
        {
            "content": "Just a solid action movie. It's touching and thrill-inducing at the same time. Complete with a fantastic soundtrack, it's a perfect film, in my opinion.",
            "review_date": "2020-12-31",
            "source": "rt"
        },
        {
            "content": "This movie made me fall in love with Batman and it also made me care about both Bruce Wayne / Batman . The soundtrack and the story in this film ins a masterpiece",
            "review_date": "2020-12-30",
            "source": "rt"
        },
        {
            "content": "Batman Begins is the best batman origin film ever made. The whole movie is very well-paced, and Albert is such an amazing character, as he feels like Bruce's second father in a way, which I really dig. As for the villains, I liked Scarecrow, but didn't really care for Ra's al Ghul (after all, he didn't return until the end of the movie, so it's hard to criticize on his character when they're not really present throughout the film). Overall, Batman Begins is a great origin story and a great film for any batman and/or superhero fan.",
            "review_date": "2020-12-29",
            "source": "rt"
        },
        {
            "content": "Great all around movie. Batman done well. Superb training montage. Liam Neeson gives a great performance.",
            "review_date": "2020-12-24",
            "source": "rt"
        },
        {
            "content": "Easily one of the best superhero movies of all-time. Nolan does an amazing job with it, by focusing not only on Bruce Wayne and his parents' deaths but also on Bruce Wayne's fear. It feels good to learn how the world works with Bruce Wayne.",
            "review_date": "2020-12-24",
            "source": "rt"
        },
        {
            "content": "A sufficient beginning to the Dark Knight Nolan trilogy",
            "review_date": "2020-12-23",
            "source": "rt"
        },
        {
            "content": "El regreso del caballero oscuro, buena trama, buenos personajes, buenos actores. Se puede ver varias veces y no cansa.",
            "review_date": "2020-12-22",
            "source": "rt"
        },
        {
            "content": "Honestly, this formula was perfected by Marvel as evidenced by their major successes. However, the thing that this movie has that the Marvel movies don't, is a lasting quality. This movie stands time and is a textbook example for origin superhero films.",
            "review_date": "2020-12-21",
            "source": "rt"
        },
        {
            "content": "great beginning for a great franchise.",
            "review_date": "2020-12-21",
            "source": "rt"
        },
        {
            "content": "Great characterization of Gotham and its inhabitants create a strong beginning for superhero cinema's most defining trilogy.",
            "review_date": "2020-12-18",
            "source": "rt"
        },
        {
            "content": "an Incredible film, with one of the best origin stories, In addition to having great villains and an excellent soundtrack, the cast here is very good too, my only criticism goes to the action scenes, which are not good, but even thus, this does not detract from the genius of this work.",
            "review_date": "2020-12-15",
            "source": "rt"
        },
        {
            "content": "Chris Nolan saved Batman!",
            "review_date": "2020-12-11",
            "source": "rt"
        },
        {
            "content": "Incredible origin story to one of the best superhero trilogies ever",
            "review_date": "2020-12-08",
            "source": "rt"
        },
        {
            "content": "Christian Bale gives the performance of his career in the three Batman movies. Complex and intelligent acting set against an appropriately gloomy Gotham.",
            "review_date": "2020-11-20",
            "source": "rt"
        },
        {
            "content": "Though slow in places, this film is a classic.",
            "review_date": "2020-11-19",
            "source": "rt"
        },
        {
            "content": "It is a story that we heard so many times, but still a very good introduction movie in one of the most relevant trilogies of all time. BATMAN BEGINS 7.5",
            "review_date": "2020-11-12",
            "source": "rt"
        },
        {
            "content": "my favorite part was watching it with my two bestfriends.... honestly i can’t pick my favorite part i loved this movie, i love all batman, and joker movies",
            "review_date": "2020-11-11",
            "source": "rt"
        },
        {
            "content": "loved this Batman. Christian Bale is awesome!!!",
            "review_date": "2020-11-11",
            "source": "rt"
        },
        {
            "content": "I liked batman Begins mainly because it started a trilogy that would change forever the super-hero standards, and appllied a dark, yet interesting point of view to the most famous super-hero of all time. It has action, a strong script and, the chance to witness the birth of the dark knight.",
            "review_date": "2020-11-09",
            "source": "rt"
        },
        {
            "content": "A very good Batman film that did a great job at thoroughly showing Batman's origin, having a unique cast, Christian Bale making a worthy Batman/Bruce Wayne, and nice direction from Christopher Nolan.",
            "review_date": "2020-11-05",
            "source": "rt"
        },
        {
            "content": "What an excellent film. I've always loved this movie and without this one we wouldn't have the other two. Huge fan and I am will re-watch this movie over and over again. It has some of my favorite lines in any movie ever!",
            "review_date": "2020-11-04",
            "source": "rt"
        },
        {
            "content": "One of the best superhero origin stories ever made. There are some really good Batman moments where he does things fitting of the character from the comics. Christian Bale is good and the supporting cast is strong, and the whole thing is great from start to finish.",
            "review_date": "2020-10-27",
            "source": "rt"
        },
        {
            "content": "Batman Begins showed us what super hero movies should be, yet \"every\" single movie after the Dark Knight series failed miserably, Avengers, Black Panther, Superman are embarrassing to watch after watching the Dark Knight Trilogy.\n\nChristian Bale is an acting God and Director Christopher Nolan is Jesus Christ.",
            "review_date": "2020-10-25",
            "source": "rt"
        },
        {
            "content": "Christian Bale kills it the start of our amazing trilogy",
            "review_date": "2020-10-25",
            "source": "rt"
        },
        {
            "content": "A noble trek through the seething crowds & blustering forests provides ground to a boding warrior, a sore prisoner and the suspensions that surround. It sustains it's just by enveloping man-made havoc, granting a dimension & the preeminent peril of a lone man's beginning.",
            "review_date": "2020-10-22",
            "source": "rt"
        },
        {
            "content": "Brilliant start to the Batman franchise for Christopher Nolan. Christian Bale is for sure the best Batman and Bruce Wayne there is. Also, Liam Neeson is an awesome bad guy.",
            "review_date": "2020-10-15",
            "source": "rt"
        },
        {
            "content": "good start sadly the other 2 are regular and bad",
            "review_date": "2020-10-14",
            "source": "rt"
        },
        {
            "content": "it was the most fantastic batman origin I have seen. the effects were so realistic and th plot was a twist recommended to those who want to watch it.",
            "review_date": "2020-10-09",
            "source": "rt"
        },
        {
            "content": "My favorite dc movie",
            "review_date": "2020-10-08",
            "source": "rt"
        },
        {
            "content": "As a huge batman fan I really enjoyed this movie. The costume and action is good and Scarecrow looks awesome. I think Ra's al Ghul could of been a bit more true to the comics but apart from that I thought the movie was great and a good start to the trilogy.",
            "review_date": "2020-10-02",
            "source": "rt"
        },
        {
            "content": "I love the first half and origin story in Batman Begins. But as the movie goes on it loses steam and gets downright silly by the end.",
            "review_date": "2020-09-28",
            "source": "rt"
        },
        {
            "content": "This movie is a great beginning for an awsome franchise.",
            "review_date": "2020-09-28",
            "source": "rt"
        },
        {
            "content": "Un gran inicio para un personaje tan importante como lo es Batman. Con un objetivo claro.  Y con muy buenas escenas de acción.\nPero el punto mas debil es el villano. La verdad daba para mucho más. Pero siento que lo desperdicieron un poco. Y ese romamce que tenia con Rachel no me convencio del todo, en ocasiones lo senti un poco forzado para tener un impulso para lograr su objetivo.  Ya que no era muy importante en esta pelicula.",
            "review_date": "2020-09-27",
            "source": "rt"
        },
        {
            "content": "A pretty solid beginning for my personal favourite Batman. Christian Bale is one of my favourite actors and he did a good job playing Bruce Wayne and portraying the struggle and build up to him getting all his tech and eventually wearing the suit. Scarecrow was an intimidating villain both with and without the mask. I appreciate how this movie came full circle towards the end by tying to events near the beginning of the film and revealing the full picture of the overall plot going down in Gotham. A good solid movie just not quite an \"amazing\" one.",
            "review_date": "2020-09-26",
            "source": "rt"
        },
        {
            "content": "***SPOILERS ALERT***\n\nThe first of the trilogy of the Batman series is a reviver of the DC comics superhero movie franchise. The movie is not merely a superhero movie, but also a movie reflecting the quest of social justice in people's hearts.\nYoung boy Bruce Wayne is a member of the prestigious Wayne family and is raised with the tender care of his parents in uptown Gotham City, a city full of crimes and injustice. Amid social inequality and darkness, Bruce is nurtured to be a morally good man and the heir of an enterprise worth billions of dollars. One day, while he is playing tag with his friend Rachel in his mansion, he falls into a dark pit filled with bats. After that, bats become his nightmare and greatest fear. After a while, unexpectedly and tragically, Bruce's parents are robbed and shot by a thug in an alley while the family is travelling home after attending an opera. Young Bruce loses two of the dearest people in his life. He seeks revenge. He even considers killing the mugger who has gunned down his parents. After being enlightened by his childhood friend Rachel, however, he changes his mind about avenging his parents. Instead, he chooses the path of pursuing justice. \nHe travels around the world to learn the ways of the world in order to cleanse his mind and find ways to become stronger. He meets Ra's al Ghul, a master, who later trains him in martial arts and most importantly to master his fears. Bruce finishes his training after a few years and comes back to Gotham in surprise of many. He dresses up in disguise of a bat to combat gangsters in secret and eventually takes down the mob boss, who controls the city in a dirty fashion. While tackling social injustice, Bruce discovers a conspiracy of the destruction of Gotham initiated by his master Ra's al Ghul. With the help of his allies, he stops Ra's al Ghul from destroying the city. This marks the beginning of the legend of the Batman.\nScenes in the movie are mostly shot in a dark environment, depicting the darkness associated with the way of life of citizens in Gotham. There is also a stark contrast between the clean, rich uptown and the dark, loathsome slums. These settings are more or less reflecting the reality which we are living in. \nThe wicked use fear, including the fear of fighting against the unrighteous authority, to seize control of the public and accomplishes their own pleasures in pursuit of self-aggrandizement. The movie suggests an idea of conquering fears in life to allow us to see a clearer picture of both our lives and society. One can live a more fruitful life and find a greater cause after fear is conquered, as Bruce conquered his fears to be able to fight more powerfully and for a higher cause. He even uses his fear as costume and weapons.\nThere is also a line mentioned quite a few times by Bruce and Rachel – \"But it's not who you are underneath, it's what you do that defines you.\" It seems to suggest our role in society is not the reason that define us but our actions. In the movie, policemen are corrupted and help criminals rather than upholding the laws. In this case, it seems like the supposedly righteous policemen are evil. What we do illustrates what we think and who we are, not our social status. The moral messages are strongly delivered in the film.\nIn general, the storyline is clear and simple to understand. Actors did a sensational job in bringing a sense of reality even in a superhero fictional movie. Christopher Nolan is THE director, a master in high-quality, audience-capturing productions. The idea of basing the whole movie on a dark theme allows Batman to stand out even more, as he works in darkness to bring Gotham toward light. Not only a protector of Gotham, he is the hope of Gotham. However, that being said, the lighting of the movie is dim, and some fighting scenes are not as impressive as what Marvel fans would expect, so it might be boring occasionally for some audiences. Overall, this movie deserves a 4.5 out of 5 stars in my opinion.",
            "review_date": "2020-09-25",
            "source": "rt"
        },
        {
            "content": "The best of the three! Bringing a modern touch to the gothic Gotham city with outstanding performances and eye-sucking immersive action.",
            "review_date": "2020-09-22",
            "source": "rt"
        },
        {
            "content": "If for no other reason, this film deserves a HIGH rating for being the first blockbuster Batman film to come after the awful wreck titled B*tm*n  *nd R*b*n (cuss words in my house, except for my mom who mostly likes it for George Clooney). Even besides that, Batman Begins is a great film that surprisingly decides to show Wayne's journey from kid to Batman, instead of glazing over it in a few vague flashbacks, or just simply starting him out as Batman. It's Batman meets Christopher Nolan. It doesn't get much better than that.",
            "review_date": "2020-09-21",
            "source": "rt"
        },
        {
            "content": "Badman begins on a slow note, but is still a decent watch.",
            "review_date": "2020-09-20",
            "source": "rt"
        },
        {
            "content": "One of the very best batman movies of all time better than the Michael Keaton movie's and i love Morgan freeman",
            "review_date": "2020-09-19",
            "source": "rt"
        },
        {
            "content": "Really good start to this exciting trilogy. This has a good plot but the long build up to becoming Batman is a little slow for me but still a really great film.",
            "review_date": "2020-09-16",
            "source": "rt"
        },
        {
            "content": "Batman Begins manages to make a character like Batman seem so grounded and realistic like never before. This movie is a great start to the Nolan trilogy, and a very good movie on its own, but that doesn't mean it doesn't have its flaws. For example, something I always didn't really enjoy in here were the combat scenes. The fight scenes areall filmed out of focus in a way, and it uses a bit of shaky cam, which is almost never a good idea. But I kina understand why he would do that; because Bale was stuck in a stiff suit the entire time and that definitely has affected the way he pulls them off. But that's about it. The rest is just what you'd expect a Batman movie to be, but also pretty different. This is probably the third time I've seen this movie, and it's still pretty rewatchable. Batman Begins is a great start to Nolan's Dark Knight trilogy, but also a pretty good movie on its own right.",
            "review_date": "2020-09-08",
            "source": "rt"
        },
        {
            "content": "The caped crusader rises again. Christopher Nolan embarks on his new Batman trilogy starting with Batman begins. With Christian Bale in the lead role as Bruce Wayne we now discover the backstory and future of the franchise. Starting off this film is absolutely breathtaking and action packed. The whole dynamic that Bale and Nolan created together really outshines Batman films in previous years. The darker tone and more serious drama like film gives us a clear focus into Bruce Wayne’s character and development turning into the Batman. Everything about this film from a superhero standpoint is across-the-board perfection. At this point in time this was the landmark for how superhero movies should be told going forward. The cast consisting of Morgan Freeman Michael Caine and Gary Oldman also deliver amazing performances in the supporting roles. The score by Hans Zimmer still to this day deliver some of the most epic superhero themes of all time. At the point when this film was released it was not made clear that it would be a trilogy but after the undeniable success of Batman Begins, it’s hard not to keep this train of perfection moving along. ",
            "review_date": "2020-09-07",
            "source": "rt"
        },
        {
            "content": "This movie is SO underrated. It needs more attention.",
            "review_date": "2020-09-04",
            "source": "rt"
        },
        {
            "content": "I rated this film a 3.5/5 because it is a good film, even awesome. However, it took a while to really get into the film and that's something I don't like in a film. Bruce Wayne when he was a young boy is a witness to his parents' death, gets jailed and then trained by Ducard as a member of the League of Shadows. When he realises their true intention is to destroy Gotham City he resorts to a non-violent approach of clearing the city. His butler Alfred and Lucius Fox help him develop into his new identity of Batman. This film is difficult to compare to others I have watched as Christian Bale is a unique direction but moreover, half the film I struggled to get into it then the second half I was obsessed.",
            "review_date": "2020-09-03",
            "source": "rt"
        },
        {
            "content": "Amazing movie. The only thing is that you have to expect a slower paced movie, but one that is fascinating and enjoyable the whole way through. It is everything amazing and adult about Batman in some of the comics, and it is a great Nolan movie. Try not to look at it as a Batman film though, just let the director (Christopher Nolan) tell his story, one that happens to be about Batman. All of the actors are amazing, but Christian Bale easily is the best actor in the film IMO, and with all of the great actors, that is saying a lot. Although, his Batman voice can be slightly cringe. Otherwise, this is a very good start to the trilogy, even if many overlook it due to its sequels.",
            "review_date": "2020-08-31",
            "source": "rt"
        },
        {
            "content": "The film that would create the ultimate template for a comic book origin story. Many have tried since; none have succeeded on the level of Nolan with Batman Begins.",
            "review_date": "2020-08-30",
            "source": "rt"
        },
        {
            "content": "Too slow. Batman doesn't show up until half way through. The villians are uninteresting and their evil plan is pointless. Character development is shallow and the action feels hollow as a result.",
            "review_date": "2020-08-30",
            "source": "rt"
        },
        {
            "content": "I thought this film was awesome. It is one of my favorite Christopher Nolan films and he is one of my favorite directors of all time.",
            "review_date": "2020-08-28",
            "source": "rt"
        },
        {
            "content": "Batman Begins: Dark, overrated, and unsatisfyingly dull. Batman Begins would showcase many of the worst aspects of Christopher Nolan going foward; unable to do genres that have intelligence and one-noted characters that would plauge his films.",
            "review_date": "2020-08-27",
            "source": "rt"
        },
        {
            "content": "Batman Begins is the Batman origin story that everyone wanted. Nolan makes Gotham as dark as ever, keeping the comics in mind. Bale perfect as the bat! Fingers crossed the upcoming edition pays close attention.",
            "review_date": "2020-08-26",
            "source": "rt"
        },
        {
            "content": "Great first movie, to build up story for the other two, while keeping some for itself.",
            "review_date": "2020-08-26",
            "source": "rt"
        },
        {
            "content": "Great movie! Such great action,characters,and acting make it an a+ film for me.",
            "review_date": "2020-08-24",
            "source": "rt"
        },
        {
            "content": "As far as Batman goes, best origin story.",
            "review_date": "2020-08-17",
            "source": "rt"
        },
        {
            "content": "Nolan es el director que hacia falta para devolverle la vida a Batman en el cine.",
            "review_date": "2020-08-10",
            "source": "rt"
        },
        {
            "content": "Batman Begins is the movie about the story of Batman's life. With Christian Bale, Katie Holmes, Liam Neeson, Gary Oldman, Micheal Caine and Morgan Freeman were in the movie. 9/10 good, not for kids.",
            "review_date": "2020-08-09",
            "source": "rt"
        },
        {
            "content": "This movie is a great start to the franchise, the story is great, but what I can't completely convince is the villain, apart from that, the movie is great.",
            "review_date": "2020-08-04",
            "source": "rt"
        },
        {
            "content": "The beginning of an incredible journey with a fantastic adaption of the Batman. Well-written characters with relatable motivations.",
            "review_date": "2020-08-02",
            "source": "rt"
        },
        {
            "content": "Itu amazing and so meanful of the film. Batman begins became DC comic best film and best superhero movie",
            "review_date": "2020-08-01",
            "source": "rt"
        },
        {
            "content": "Nolan sabe muito bem como desenvolver um personagem.\n\nBatman é um herói com um passado sombrio, mas a pegada do Nolan é diferente e vai mais a fundo ainda. Demonstrando muito bem que Bruce é um humano, e indo além do esperado, entregando uma trilogia que tem algo a dizer, e não é algo feliz como geralmente esperamos.\n\nO desenvolvimento inicial funciona bem. As cenas de treinamento, o seu relacionamento com a família, seu traumas de infância e como eles reverberam ate o então presente. \n\nAs cenas de ação são um pouco confusas.  A câmera balança demasiadamente, com um zoom que pode até enjoar algumas pessoas, fora que não passa a sensação que o Batman é bom de porrada. Porém o longa brilha muito em outros aspectos, como OST, fotografia, roteiro, diálogos etc.",
            "review_date": "2020-07-30",
            "source": "rt"
        },
        {
            "content": "A stunning origins story for a truly iconic superhero character! With smart direction and talented performances all around, this first film in a sensational trilogy really lets the batmobile (or tumbler) hit the exciting ground-running!",
            "review_date": "2020-07-30",
            "source": "rt"
        },
        {
            "content": "The first film in the the Dark Knight trilogy benefits from the best Batman origin story along with solid performances and Christopher Nolans solid direction.",
            "review_date": "2020-07-25",
            "source": "rt"
        },
        {
            "content": "Batman Begins: - Pretty Good Acting - Great Directing - Nice Use Of Practical Effects - Interesting Characters - Decently Paced - Fine Villain - Good Sound Design - Amazing Casting - Strong Writing - Passable Cinematography Cons: - Some of the editing (particularly during the action scenes) is bad Overall Grade: A (9.5/10)",
            "review_date": "2020-07-22",
            "source": "rt"
        },
        {
            "content": "Skip this movie. Just watched the second and third one. Waste of time. The only reason I somewhat enjoyed this movie is because the villian is Liam HugeCock. All hail the magic conch.",
            "review_date": "2020-07-21",
            "source": "rt"
        },
        {
            "content": "[⭐️84%]\n\nChristopher Nolan takes a property who's name has been tarnished from the infamous Batman Forever (1995) and Batman & Robin (1997) due to its campy elements, and reboots the Batman name into its most grounded and grittiest at the time of its release. As much of a superhero film it is, that doesn't feel like the main focus, Batman Begins (2005) smartly combines its corrupt elements as well as politics to make it feel more real than your usual comic book adaptation.\n\nBatman Begins (2005) is up there with displaying some of the best transitions of a character into a superhero. It touches upon many small details in creating the Batman suit and gadgets which other comic book movies seem to gloss over. With this it continues to expand that realistic feeling which makes it so thrilling.\n\nWhere in previous Batman movies it has always contained fun and quirkiness, there has rarely been that suspense built, but thanks to Christopher Nolan's wonderful filmmaking ability, Batman Begins (2005) is both dark, suspenseful and also tells a fascinating story with weight to\nIt.",
            "review_date": "2020-07-20",
            "source": "rt"
        },
        {
            "content": "After many years of training, Bruce Wayne returns to Gotham as the Batman to stop the continuous corruption of his city.\n\nThis film is incredibly well made and really showed that with enough talent comic book movies can be as good as any other film. Christopher Nolan is a film making genius and this movie again shows his talent. Technically this film is flawless, incredible cinematography and music that make every scene mesmerizing. This movie dives into the evolution of Bruce Wayne and makes us want to care about the guy behind the mask. Nolan is able to give us a fun superhero movie without sacrificing the development and story depth, which makes for an amazing film.\n\nChristian Bale leads a star studded cast including the likes of Michael Cane, Liam Neeson, Morgan Freeman, Gary Oldman, Katie Holmes, Cillian Murphy. Across the board perfect and each character is given enough screen time to show their talent.\n\nThe action scenes are also very well done. In particular the dock scene where we see Falcones (Tom Wilkinson) men receiving a shipments is very well done and adds in some nice horror elements.\n\nOverall this film is more than just a comic book movie. Nolan gives us a well written story while also providing us with some quality action scenes which makes Batman Begins another great Nolan film.\n\n9.5/10",
            "review_date": "2020-07-17",
            "source": "rt"
        },
        {
            "content": "One of the greatest Film's Ever Made Truly Fantastic Take On Batman 😎✌🏻",
            "review_date": "2020-07-11",
            "source": "rt"
        },
        {
            "content": "Putting Christopher Nolan on the map, Batman Begins is one of the best Batman movies of all time, and it isn't hard to see why. Nolan's style truly begins to shine in this movie, still, it's a shame that he will likely always be known for this, as it certainly isn't Nolan's best. Batman Begins' biggest strength is easily in the story, the first two acts of the film focus heavily on building the world, and there is little action. Although Superhero movies all about origin stories are almost always following the same structure, Batman Begins falls in a gray area. It came out far before this stereotypical origin story for superhero movies started, and it doesn't even truly follow that formulaic method. That being said, the final act is weak, but it is understandable when put into context of the sequel. As mentioned, the character building is part of what makes this movie shine, still, I often felt as if certain performances were forgettable, but, what do you expect from a movie like this? Typically, I expect a lot less, but this movie is definitely one that is enjoyable. Even though a lot of it is quite abstract, the overall realism of physics (usually) and the characters bring it down to earth. This sense of realism is accompanied by the dark and gritty visuals, using the color scheme that is used, the devolution of Gotham is clearly illustrated, still, watching this on a laptop, I did squint a few times. Batman Begins is probably up there as one of the best superhero movies of all time, and it makes sense. But, truly, that's what it is, a Superhero movie. The way that everything is paced is far from unique, a lot of this stuff had been done before, but, Christopher Nolan, single handed, reinvented Batman with this movie. Still, I did feel that some of the performances were stiff and that there were parts of it that were very generic.",
            "review_date": "2020-07-04",
            "source": "rt"
        },
        {
            "content": "A good starter to the series with good acting, a good villain, great directing, and a silly finale.",
            "review_date": "2020-07-02",
            "source": "rt"
        },
        {
            "content": "Christopher Nolan's Batman trilogy began here with this look at the origins of the character, featuring Christian Bale as the title character, Gary Oldman as Gordon, Michael Caine as Alfred and Morgan Freeman as Lucas Fox. Terrific casting in this one, as this film is the first Batman film to really focus on the title character rather than the villains and Bale's performance draws you in. The rest of the cast is also good with Liam Neeson and Cillian Murphy as the bad guys here. Katie Holmes is a bit miscast as an ADA but the film is still one of the better films in the series.",
            "review_date": "2020-06-30",
            "source": "rt"
        },
        {
            "content": "The greatest comic book film of all time. A fantastic cast, powerful story, and beautiful direction. It is absolutely fantastic.",
            "review_date": "2020-06-26",
            "source": "rt"
        },
        {
            "content": "One of the best origin movies ever ",
            "review_date": "2020-06-21",
            "source": "rt"
        },
        {
            "content": "Awesome movie! One of Christopher Nolan's best movies and he is one of my favorite directors of all time.",
            "review_date": "2020-06-20",
            "source": "rt"
        },
        {
            "content": "Ages like fine wine!",
            "review_date": "2020-06-16",
            "source": "rt"
        },
        {
            "content": "Batman Begins is an incredible start to the Dark Knight trilogy. Watching Bruce Wayne become Batman is such an incredible experience and Christian Bale really makes Wayne his character. The Scarecrow and Liam Neesons's Henry Ducard  provides for some amazing first antagonists for Batman, along with a set of excellent supporting characters and cast. The action is well crafted, the plot is amazing and Christopher Nolan continues to prove why he is one of the best directors to date.",
            "review_date": "2020-06-13",
            "source": "rt"
        },
        {
            "content": "#BatmanBegins #MovieReview: 10/10\n\nPros:\n\nChristian Bale\n\nMichael Caine\n\nThe entire cast/performances\n\nBest reboot of all time?\n\nAwesome score\n\nScarecrow\n\nIntense action scenes\n\nCharacter development of Bruce Wayne\n\nRealistic for a comic book movie\n\nNolan's direction\n\nCons:\n\nN/A",
            "review_date": "2020-06-11",
            "source": "rt"
        },
        {
            "content": "Een betere introductie voor een superheld krijg je niet. Nolan geeft zijn Batman een duidelijk motief om slechteriken te bestrijden, en Bale voegt de daad bij het woord. Ook door de rest van de geweldige cast wordt sterk geacteerd. Laat het maar aan Hans Zimmer over om ook de soundtrack van een episch niveau te maken.",
            "review_date": "2020-06-08",
            "source": "rt"
        },
        {
            "content": "Not as good as the follow-up, but still very good. It introduces us to the character in a very fun and compelling way. Christopher Nolan just knows how to make a movie, and he proves that with this great franchise.",
            "review_date": "2020-06-03",
            "source": "rt"
        },
        {
            "content": "Great films and a great start to Nolans trilogy...Really captures the darkness of gotham and empowers batman where I feel in Justice league he is slightly portrayed as weak...Bale is the best Batman for me backed up here by a solid Katie Holmes Liam Neeson & Michael Caine...the story line is good and it allows for the rest of the trilogy to develop...excellent film",
            "review_date": "2020-06-02",
            "source": "rt"
        },
        {
            "content": "batman's backstory blends with truly beautiful action scenes and a more than intriguing plot in this beautiful film by Nolan",
            "review_date": "2020-06-02",
            "source": "rt"
        },
        {
            "content": "Batman Begins is a new kind of superhero movie. An all-star cast and masterful directing help Christopher Nolan's start to the Dark Knight Trilogy gain it's immersive storytelling and deep mythology. Christian Bale gives Bruce Wayne a well-performed character study on why he would become a grim figure who fights crooks over and over and over again. Wayne isn't the only batty one though. Cillian Murphy's comic-accurate yet very disturbing acting as the Scarecrow is sure to give you the chills. A one-of-the-kind reboot that shocks and amazes you, Batman has gone a long way from surfing competitions with the Joker.",
            "review_date": "2020-06-01",
            "source": "rt"
        },
        {
            "content": "This is the movie that made people go, \"Wow, Batman can be good again?!\" and I can see why. While I love the story, the character's interactions, and how dark and brooding it is (since that's what Batman is supposed to be), I just wish the action could have been better, as in this movie it's pretty sloppy. But is this movie still great? Of course, I will always love this film.",
            "review_date": "2020-05-30",
            "source": "rt"
        },
        {
            "content": "Exciting and tight! Great introduction for the dark knight. While the acting is fine, the action is amazing. Making this a fine first installment in the dark knight trilogy!",
            "review_date": "2020-05-24",
            "source": "rt"
        },
        {
            "content": "As far as first entries go, you couldn't ask for much better. This movie redefined Batman for a new generation, and it largely hit all the marks. Christian Bale is great as both Bruce Wayne and Batman. Michael Caine is an EXCELLENT choice for Alfred! As a comic book enthusiast, I was a little upset with the combination of Ducard and Ra's, but I can appreciate the attempted fake-out by the filmmaker of the \"friend turned foe\" at the end. I also love Cillian Murphy as Scarecrow. He truly embodies Dr. Crane and plays the role to a tee. All in all, it was time for Batman to embrace being a DARK Knight after having some pretty campy portrayals in the 90s. He finally felt like the character the comics created.\nMy one complaint is a complaint I have with most Batman origin movies, and that is the attempted connection of the Wayne's murder to the main villain. Let Joe Chill just be another nameless/faceless bad guy! Batman doesn't have to have some personal vendetta that traces back to that one incident for the villain to mean something. Ra's Al Ghul is menacing enough, especially had they really played up the immortality card. Still, I love this movie and love how it still holds up 15 years later!",
            "review_date": "2020-05-14",
            "source": "rt"
        },
        {
            "content": "A stark, grim and brilliantly realized starting point for the best super hero trilogy in movie history. Christopher Nolan captures the very of essence of Batman and sets the benchmark for all others in the genre.",
            "review_date": "2020-05-13",
            "source": "rt"
        },
        {
            "content": "a great origin story.",
            "review_date": "2020-05-08",
            "source": "rt"
        },
        {
            "content": "An amazing start to the Christopher Nolan Batman trilogy",
            "review_date": "2020-05-08",
            "source": "rt"
        },
        {
            "content": "I don't think most the world knew who Christian Bale was before he became Batman. This is a strong origin  movie to a great trilogy. A movie you can watch over and over. No one never thought Batman could bounce back after Schumacher gave us his take on the bat. No one never thought Burton Batman would be outshined.",
            "review_date": "2020-05-07",
            "source": "rt"
        },
        {
            "content": "harika öttesiydi :)..............................",
            "review_date": "2020-05-07",
            "source": "rt"
        },
        {
            "content": "It is impossible to take Batman Begins as seriously as it takes itself. Christian Bale's deep and scratchy Batman voice is laughable and removes any slight bit of tension from the scenes he uses it in. The fight sequences are unrealistic due to Batman's apparent weightlessness and inability to move his neck in his mask. The backstory of his fear of bats is neither convincing as a reason he'd run around dressed up as a bat nor interesting and the explanation for why his suit looks the way it does doesn't make it any less silly. The mechanics of his bat mobile are good for some laughs too, as the seat slowly goes up and down for no obvious reason in the middle of the chase sequences. The supporting cast don't come out looking much better than Bale. Michael Caine as Alfred gives a dull performance, Gary Oldman plays it too goofy to be believable as an experienced cop, and Morgan Freeman is unnecessary, playing another Alfred but with a warehouse of convenient army equipment. The overall plot is nonsensical: some crazy plan to create hysteria with gas from a microwave or something. The CGI used to show the effects of the gas is more bizarre than scary and the executor of this plan, Cillian Murphy's Scarecrow, is one of the least threatening villains on film. Like many movies of the time, Batman Begins feels the need to tack on an unnecessary twist towards the end, creating confusion around the motivations of Liam Neeson's character who trains Batman to be a warrior. The mountain training scenes are an interesting addition and a welcome departure from the cityscapes common in superhero movies but they never amount to much thanks to an uninspired script and flat characters. In the end, the film's biggest flaw is that it believes it's presenting thoughtful and important ideas about society and morals when really it's just using that pretension as a thin layer of disguise for a less than average superhero action movie.",
            "review_date": "2020-05-01",
            "source": "rt"
        },
        {
            "content": "One word: underrated. This movie does a perfect job of setting the origin story for Batman and is often overlooked because of its sequel's genius. The story is gripping and attaches you to the characters and is a perfect start for Christopher Nolan's trilogy.",
            "review_date": "2020-04-29",
            "source": "rt"
        },
        {
            "content": "It's a decent origin story of Batman which conjures up a dark mood but I think I would have preferred it to be more punchy and have stronger villains.",
            "review_date": "2020-04-29",
            "source": "rt"
        },
        {
            "content": "Originally I went into this movie pretty skeptical. Although I like the cast and crew involved, nothing about it filled me with optimism. What ended up on film though, is arguably the greatest comic book film ever made, to this day. It PERFECTLY captures the essence of Batman in a classy, sophisticated way that's more realistic than you could ever imagine these characters can be. Not to mention how tremendous they are with the fan service here. This isn't the reboot we needed, but it's the one deserved.",
            "review_date": "2020-04-28",
            "source": "rt"
        },
        {
            "content": "Perfect Batman movie. Nuff said. ",
            "review_date": "2020-04-25",
            "source": "rt"
        },
        {
            "content": "The beginning of greatness. Unless the Tom Holland and Jon Watts Spider-Man films release another fantastic film, the Christopher Nolan Batman movies will probably always be my favorite trilogy of all-time. This movie is a fantastic introduction to Christian Bale as the Dark Knight, and the origin story isn't painful to sit through. Not to mention, the Scarecrow is haunting and wonderful. I love this movie, and it deserves to be rated higher than it is.",
            "review_date": "2020-04-24",
            "source": "rt"
        },
        {
            "content": "Batman begins is one of the best superhero movie ever .This film fixed the mistake of what Batman and Robin did and rebooted this film into a master piece. They finally got Batman right and Christian bale is the best live action version of Batman that we got .",
            "review_date": "2020-04-23",
            "source": "rt"
        },
        {
            "content": "One of the best superhero movies of all time",
            "review_date": "2020-04-16",
            "source": "rt"
        },
        {
            "content": "Best superhero origin film ever made",
            "review_date": "2020-04-13",
            "source": "rt"
        },
        {
            "content": "This movie is just amazing with an amazing story and really well developed characters in this movie. Also, Batman/Bruce Wayne (Christian Bale) is amazing playing the role of Batman he gives a brilliant performance and you really do feel bad for his character throughout the start of the movie and even more into the movie. The fights which Batman has throughout this movie are pretty good and most of them hold up pretty well for a 2005 movie I must say, theres the odd bit of cgi which doesn't hold up during a later fight but apart from that they're pretty fun to watch. Bruce Wayne and Alfred (Michael Caine) have some really good chemistry with each other when they're on set together which is really good. Finally, Scarecrow (Cillian Murphy) is a really good villain in this movie some of the effects can be quite mixed in my opinion, some of them are quite good and some of them are quite outdated. Almost forgetting to mention, Henri Ducard (Liam Neeson) he's also really good in this movie and to be totally honest most of the actors/actress do an amazing job in this movie. Overall, it's an amazing action packed movie with some brilliant fight scenes with an amazing story and characters, worth the watch.",
            "review_date": "2020-04-10",
            "source": "rt"
        },
        {
            "content": "Amazing. Finally a great BATMAN! Bale will always be BATMAN!!!!",
            "review_date": "2020-04-09",
            "source": "rt"
        },
        {
            "content": "Christian Bale is easily the best choice for this dark and character driven Batman origin story. Great movie and great way to start the series and lead into the Dark Knight. With the exception of Katie Holmes, this was a very well acted movie as well.",
            "review_date": "2020-04-06",
            "source": "rt"
        },
        {
            "content": "This was a good superhero movie.",
            "review_date": "2020-04-04",
            "source": "rt"
        },
        {
            "content": "A movie that inspired me with its soundtrack and quotes. Superb work by Nolan in accomplishing such well-developed characters and perfecting the rise of Bruce Wayne.",
            "review_date": "2020-04-03",
            "source": "rt"
        },
        {
            "content": "Christopher Nolan starts off an epic an epic trilogy in an epic way. Great origin story. Beautifully written. The pacing was perfect. The acting was great. And the third act really made this movie 10 times better",
            "review_date": "2020-03-28",
            "source": "rt"
        },
        {
            "content": "The greatest Batman film ever made.\n\nChristopher Nolan's noir Batman Begins (2005) is not only my personal favorite Batman film, but a phenomenal, fresh take on one of the most beloved superheroes ever created. Nolan understands the brooding heart of Bruce Wayne and the strivance for justice that drives his character to use his billions in inheritance to fight crime in his corrupt city of Gotham. Batman Begins is 140 minutes of deep character diving and pure adrenaline action as Batman fights organized crime within Gotham only to uncover an even more sinister plot against the home he's trying to find salvation for with some hope. \n\nI love how you get Batman's origin story quickly and with careful class, then we are thrust right into a detective story as Batman must foil the mob corrupting Gotham. Nolan's writing is heartfelt and serious for all the Bruce Wayne drama to inspire him to become a better man so that he does not lose his moral way during his quest to bring Gotham justice.. His words for Batman provide confidence, certainty, and a coolness unique to his gritty take on Batman all while remaining a kind hero selflessly trying to save lives. Nolan's script is quite funny with excellent jokes as well as so sweet for all romance drama between Bruce and Rachel. He covers so much ground in a single movie that Batman Begins is still impressive. Nolan's writing takes heavy inspiration from DC Comics author Jeph Loeb's Batman crime comics for the caped crusader like The Long Halloween, so you can see the noir influence. \n\nNolan's direction is all smoke, fog, and bats for an eerie atmosphere for his Batman feature. Batman Begins is like the black and white sequence in Memento meets the fog chase from Insomnia for an entire picture of dark noir aesthetics making Nolan's choice of Chicago as the backdrop for his Gotham ideal. The production design fashions Chicago into a dismal, dirty, impoverished city of hopeless prospects. I appreciate their reliance on mini models, practical effects, and creative lighting that ensures Batman Begins will remain timeless for audiences forevermore.\n\nNolan's direction is so striking in vision and execution. Everything looks slick with Wally Pfister's cinematography finding gorgeous dim lighting for caves and city streets alike. I adore the shot of the Batcave revealed by the waterfall as well as the wide shot of the bats surrounding Batman as his signal called them to cover his daring escape. The bat CGI is still excellent and realistic too! Pfister's camerawork for Batman Begins is not only beautiful, but exciting for all the guerrilla warfare Batman wages on crime in the darkness. Lee Smith's editing is gentle and smooth for all the Bruce Wayne development scenes, meanwhile his combat cuts are frenetic and intense for a breathtaking style.\n\nHans Zimmer and James Newton Howard's score for Batman Begins is intense with enthralling symphonic runs of pounding noise. There is beauty to their bleak arrangements and serene passages, but Batman's brooding persona fits their exciting and memorable theme music for the dark knight all too well. Their exhilarating score fits Nolan's all black everything noir aesthetic and Batman's intricate fight choreography perfectly. Even the costume and make-up departments kill it by creating a new contemporary look for the Batsuit as blackened tactical gear for a realistic effect to Nolan's Batman Begins.\n\nChristian Bale is truly wonderful as the conflicted and anguished Bruce Wayne. He gets Wayne's sorrows, regrets, desires, frustration, rage, intensity, and kindness as well as Batman's gloom, dour persona. I think Bale is not appreciated enough as the definitive take on the caped crusader to me. I love his performance as the growing Bruce Wayne into the mature gentleman we know and love. \n\nSimilarly, Michael Caine is fantastic as Bruce Wayne's English gentleman butler and father figure Alfred Pennyworth. His advice, encouragement, jokes, banter, and critiques are invaluable to Batman's character. Caine plays Alfred with such emotion that I'm always moved by him here. I cannot imagine anyone else as James Gordon other than Gary Oldman now thanks to his steadfast, just, and gentle performance as the iconic lawman.\n\nKatie Holmes is gorgeous in Batman Begins and adorable as Bale's love interest and DA Rachel Dawes. Bale and Holmes have an intimate chemistry that's natural and tender. You genuinely want them to end up together. I still believe Holmes is the superior Rachel compared to Maggie in The Dark Knight as Holmes gives Rachel convictions and heart that help mold Bruce Wayne. She's so likable as Rachel. It's a shame she didn't get to be in The Dark Knight.\n\nLiam Neeson is phenomenal and cool as the devious Ra's al Ghul. His imposing stature, calm demeanor, piercing glare, and serious gravitas provide Ghul with a fearsome presence and malicious intent. Neeson is really memorable as Batman's most refined villain with a mystique that befits Ra's al Ghul. Likewise, Cillian Murphy is haunting as the insane psychiatrist antagonist Dr. Stephen Crane also known as Scarecrow. He is charming with his lovely blue eyes and pleasant manner, then suddenly alarming as the actually scary Scarecrow in Batman Begins.\n\nAdditionally, Batman Begins features a massive amount of fine supporting roles and cameos. Namely, Morgan Freeman as the helpful and amiable Lucius Fox. Tom Wilkinson is frightening as the mob boss Carmine Falcone unlike any other role he has played. Rutger Hauer is absolutely despicable as the greedy William Earle. Mark Boone Junior, fresh off of Nolan's Memento, is perfectly cast as the corrupt cop and rude slob Arnold Flass. Ken Watanabe is resolute as the decoy Ra's al Ghul. Linus Roache is affectionate and kind as the greatest film Thomas Wayne we've ever gotten. Sara Stewart is beautiful and nice as Martha Wayne too. Jeremy Theobald, back from Nolan's directorial debut Following, cameos as the Water Department technician. Jack Gleeson, before being the contemptible Joffrey on Game of Thrones, is the most adorable little boy that believes in Batman. Even Christopher Nolan's uncle, John Nolan, cameos as Fredericks on the Wayne Enterprises Board.\n\nIn all, Nolan makes the most of the amazing Batman material and outstanding cast to craft a Batman feature film for the ages.",
            "review_date": "2020-03-27",
            "source": "rt"
        },
        {
            "content": "A great movie, but a little hard to follow sometimes. ",
            "review_date": "2020-03-25",
            "source": "rt"
        },
        {
            "content": "Often thought of more as the prequel to the greatest superhero movie ever made, than in the context of a stand alone film, Nolan's debut into the Gotham universe offers more than enough for Batman Begins to stand on it's own merit. Oldman and Caine are perfectly cast but it is the Batman character that provides the perfect backdrop for the exploration of fear undertaken by Nolan here as he expertly sets the table, allowing for the future installments development and near flawless execution. 8.5/10",
            "review_date": "2020-03-25",
            "source": "rt"
        },
        {
            "content": "Probably one of my favorite movies Its action-packed and has the greatest balance of fear, action, and excitement.",
            "review_date": "2020-03-25",
            "source": "rt"
        },
        {
            "content": "The film that got Batman right. Christopher Nolan's start of the Dark Knight trilogy was the best way to kickstart Batman again. Christian Bale will forever remained timeless as Batman. Some of the best supporting cast in film, an awesome chase sequence with the Batmobile, Liam Neeson is a great and memorable villain. Does right what the Burton/Schumacher films lacked.",
            "review_date": "2020-03-24",
            "source": "rt"
        },
        {
            "content": "A beautiful movie with wonderful screenplay and story",
            "review_date": "2020-03-23",
            "source": "rt"
        },
        {
            "content": "A classic Batman movie that never gets old",
            "review_date": "2020-03-23",
            "source": "rt"
        },
        {
            "content": "A pleasing return to form from the Batman franchise with a gritty and realistic look, impressive visual effects, solid action and compelling characters.",
            "review_date": "2020-03-22",
            "source": "rt"
        },
        {
            "content": "O início da melhor trilogia de filmes de heróis da história do cinema começou de forma perfeita com Batman Begins, trazendo Christian Bale como o Batman, e uma narrativa de origem incrível, design de armadura totalmente pesado e fascinante, Batman Begins é uma obra de arte!",
            "review_date": "2020-03-19",
            "source": "rt"
        },
        {
            "content": "brilliant back story of the dark knight",
            "review_date": "2020-03-01",
            "source": "rt"
        },
        {
            "content": "This Batman movie was very good. Christian Bale, Michael Caine, Morgan Freeman, Gary Oldman, Katie Holmes, and Liam Neeson did a spectacular job in this movie. The plot of the movie was very good. It's about how Bruce Wayne became Batman. The action scenes were awesome and it even had a twist to it near the end. The Tumbler, Batman's car, was very cool.  Whether you're a Batman fan or not, you'll love this movie.",
            "review_date": "2020-02-27",
            "source": "rt"
        },
        {
            "content": "Really loved the character building of Bruce Wayne, the League of Assassins and their motivations to do something so cliche as destroy a city, the supporting cast, the great performances, the theme of fear and how to use it and conquer it, the music, and so much about this movie. Does it have its flaws? Yup. Is it still my favorite comic book movie? Yup. Incredible film by Nolan",
            "review_date": "2020-02-26",
            "source": "rt"
        },
        {
            "content": "A brilliant and dark comic book adaptation, combined with Nolan's direction, the script he co-wrote with Goyer, the performances of the cast, Zimmer and Howard's score, Pfister's cinematography, Smith's editing, Crowley's production design, the set decoration by Ford, Hodgson, Smith and Wakefield, Hemming's costume design, action sequences, sound design and visual effects, Batman Begins is a brilliant beginning to a new take on the world's greatest detective!!!",
            "review_date": "2020-02-24",
            "source": "rt"
        },
        {
            "content": "The perfect grounded origin story that Batman deserved. Gary Oldman Gordon is good too. And the plot about Joe Chill who killed Bruce parents.",
            "review_date": "2020-02-22",
            "source": "rt"
        },
        {
            "content": "Ahead of its time and paved the way for all super hero movies",
            "review_date": "2020-02-21",
            "source": "rt"
        },
        {
            "content": "I still can't believe this movie was made in 2005. It escaped the campiness that had ruled over superhero movies, and it still holds up today. The Dark Knight is better, but simply because of the joker in that movie, so I can't flaw this movie as it has a villain less known and entertaining through ras al ghul, even though his use is perfect too. Nevertheless, I'm glad the joker wasn't part of the origin. As I can't fault this movie, I just have to name my favourite bits. Christian Bale as Batman, the look of Gotham City, the shots (especially the panning one off batman standing on top of a building) and the music (well done Zimmer and Newton-Howard, you should both get married). 5 stars, well deserved Nolan.",
            "review_date": "2020-02-19",
            "source": "rt"
        },
        {
            "content": "One of the best origin movies ever made. Christopher Nolan took Batman in a new direction and it worked very well. Making this into a darker version of the character is brilliant to watch. Christian Bale is the best Batman.",
            "review_date": "2020-02-19",
            "source": "rt"
        },
        {
            "content": "By the time we see Wayne don the cowl we've seen him as a man who has learned to quell revenge. He has learned the value of anonymity to hide his identity and to protect his friends, that a symbol has nothing to lose and that his fear can be turned against his enemies. When batman appears he has learned his limits, he doesn't execute, he is a trained martial artist, and he knows the difference between petty and serious crime and criminals. It's really a clever tableau that builds over non-linear clever editing and rich development of this team around Wayne until he is, detective skills notwithstanding, the Batman we know from many comics with clever amalgams of comic stories built in well. \n\nHallmarks of a growing Nolan are present: Those rich landscapes and the quick editing, in Nolan-traditional non linear style. Here he is cutting his teeth on cutting in to scenes late and exiting out fast. The score is brilliant, there's few themes, but it's truly a rich tapestry of mood. \n\nThere are lots of little pleasing quirks; The way Gordon does his best to connect to the recently orphaned Wayne with his sweet, earnest face in what is a very sad moment. Bale is a sweet goofy Wayne when he shows us his real side - but his masks get in the way, and he's a man stalled in development flipping between masks.\n\nLots of minor villains make sense instead of the usual clutter of big villains. They support each other well even though they rarely overlap on screen which works tremendously, in fact they each take an act of the film which keeps them grounded, hidden and effective. \n\nThe foundation of Begins is still Goyer though. And that means it's got a broad, cheesy base and it contains cliche and obvious beats - but for a reboot these are restrained and reasonably pleasant when reigned in by Nolan. As with all Goyer, all of his good scripts are annotated by the good directors. (See Blade 2 and this for good, and Man of Steel or Blade Trinity for the bad.)\n\nSo the fight scenes are disorientating and ugly and in many ways I think the film will age badly in general, and Bale looks completely silly in the Batman outfit. But it's brisk, ingenious, bold and it knew itself when it came out. It's got flourishes of creativity and a gravitas that keeps it alive. \n\nAlso Bruce Wayne says he doesn't execute people and then he blows up the entire monastery and kills loads of them. Hah.",
            "review_date": "2020-02-18",
            "source": "rt"
        },
        {
            "content": "What the F*** is Bale doing to batman",
            "review_date": "2020-02-17",
            "source": "rt"
        },
        {
            "content": "Best trilogy of all time!",
            "review_date": "2020-02-16",
            "source": "rt"
        },
        {
            "content": "Batman Begins (5 out of 5 stars). Batman Begins is a great start and origin story for Batman which not only delivered DCs superhero but built an emotional depth with Bruce Wayne. Christopher Nolan’s direction is awesome. The film started out moving around with the storyline from an older Bruce Wayne being lost in a world of crime. Meeting Liam Neeson’s character that takes him to a temple to trained for combat. To flashing back in his earlier years, losing his parents to wanting to go after the mobster that took his family away. The plot is well written and developed. The villain Scarecrow played by Cillian Murphy was great. There is a twist in there that surprises with another villain which was awesome. The action sequences are close up with the fight scenes but brutal. And has a batmobile car chase that was exciting. And a climax with Batman fighting against the bad guys and a fight with the villain on a train was awesome. Christian Bale is great as the ionic character. The cast ensemble is great. The cinematography, music score, and script are mesmerizing. Batman Begins is an awesome superhero movie that revives Batman with a well told origin story and a developed story. ",
            "review_date": "2020-02-13",
            "source": "rt"
        },
        {
            "content": "Boring movie. I don't understand what's so popular about this movie and it sucks but hey, that's just my unpopular opinion",
            "review_date": "2020-02-13",
            "source": "rt"
        },
        {
            "content": "A brilliant movie full of great performances",
            "review_date": "2020-02-13",
            "source": "rt"
        },
        {
            "content": "Everything that you wanted from a batman series was delivered in this movie. It's just sad it was only given one sequel.",
            "review_date": "2020-02-11",
            "source": "rt"
        },
        {
            "content": "A very good movie. A nice start to a triology",
            "review_date": "2020-02-11",
            "source": "rt"
        },
        {
            "content": "People love yo say that it's just a batman origin story, but it's so much more, it's wise, complicated and has a great theme.",
            "review_date": "2020-02-11",
            "source": "rt"
        },
        {
            "content": "Nolan's Batman movies are getting progressively more grounded, with the first entry in the trilogy being the only one with some really comic booky elements. We can argue all day about Ra' Al Ghul being caucasian, which is a fair criticism, but either way, Begins is a great beginning to the series.",
            "review_date": "2020-02-07",
            "source": "rt"
        },
        {
            "content": "It's an epic introduction to the trilogy!",
            "review_date": "2020-02-06",
            "source": "rt"
        },
        {
            "content": "The great actor from christian bale made the movie great all time",
            "review_date": "2020-02-04",
            "source": "rt"
        },
        {
            "content": "Easily the best overall movie and in the Nolan trilogy.",
            "review_date": "2020-02-01",
            "source": "rt"
        },
        {
            "content": "A nice introduction to Batman with good acting, enjoyable action sequences, and amazing music. The CGI and special effects are decent and the plot is fine. Not as good as The Dark Knight but better than The Dark Knight Rises.",
            "review_date": "2020-01-29",
            "source": "rt"
        },
        {
            "content": "Nolan's film taps into the psychological and scientific aspects of Batman and the world that surrounds him. The film gives us a realistic understanding of why a billionaire dresses up as a bat and fights criminals. Bale's performance as both Bruce and Batman is probably one of the best, while the performances by Michael Caine, Morgan Freeman, and Gary Oldman are perfect for the world Nolan has created. The film makes you see comic book characters and films in a different way and makes it seem like all this can actually exist in our world.",
            "review_date": "2020-01-20",
            "source": "rt"
        },
        {
            "content": "Excellent movie. Good thing Christopher Nolan rebooted Batman and made a proper movie with a good cast. Christian Bale is amazing as the caped crusader and Cillian Murphy is just brilliant as Scarecrow. Ignore the past Batman’s except Tim Burton’s and watch this. ",
            "review_date": "2020-01-19",
            "source": "rt"
        },
        {
            "content": "Maybe the most well made superhero origin film ever made. Yet to be topped.",
            "review_date": "2020-01-16",
            "source": "rt"
        },
        {
            "content": "The quintessential superhero origin movie, Batman Begins marks a spectacular introduction into the franchise for Christopher Nolan and his cast and crew.  No other Batman film has ever delved as deep into the inner psychological workings of Batman as a character.",
            "review_date": "2020-01-16",
            "source": "rt"
        },
        {
            "content": "Good introduction into the trilogy. Must see.",
            "review_date": "2020-01-15",
            "source": "rt"
        },
        {
            "content": "The perfect batman origin movie, sadly overshadowed by the second one.",
            "review_date": "2020-01-13",
            "source": "rt"
        },
        {
            "content": "I absolutely love this film.  It's dark and brooding like a Batman film should be, but it's also a joy to see Bruce Wayne overcome his weaknesses and triumph as Gotham's super hero.  It's a super hero film.  It's not just some film based on a wacky comic book.  Batman is and always has been a SUPER HERO.  That means good against evil.  Spoiler: The good guy wins (psst: It's Batman!)  Not too thriled with THE DARK KNIGHT, although it isn't a half bad movie really.  The 3rd installment ties it all together beautifully, although one does get the impression the series was cut short by the realism of it all.  Bruce Wayne doesn't take the cape & cowl until he's in his late 20's and it's a little unrealistic to have some 50++ year old guy fighting crime like he's some kind of...bat man.",
            "review_date": "2020-01-12",
            "source": "rt"
        },
        {
            "content": "Pros: \nI think that Christopher Nolan made the best origin story we will ever see with Batman and Batman Begins is my second favorite Batman movie right behind the Dark Knight. I think I like this movie so much because we get to see Batman train and creat all of his gadgets. I think the concept of overcoming fear was executed perfectly. I think that Christain Bale it the best Batman. I think the villain of Ra's Al Ghul and Scarecrow are great. I do not know how you could not enjoy this movie. I have nothing negative to say about this movie.\n\nI'm going to give Batman Begins an A+",
            "review_date": "2020-01-10",
            "source": "rt"
        },
        {
            "content": "With Batman Begins, Nolan did for superhero movies what Moore did for the comics. An up-to-date, more adult take on this classic character launched a new phase in storytelling that validated a previously derided genre.",
            "review_date": "2020-01-08",
            "source": "rt"
        },
        {
            "content": "DC started to rise their empire",
            "review_date": "2020-01-06",
            "source": "rt"
        },
        {
            "content": "Would you like to see my mask?",
            "review_date": "2020-01-05",
            "source": "rt"
        },
        {
            "content": "Solid Movie. Nolan is powerful behind the camera, all the actors involved are really good.",
            "review_date": "2020-01-02",
            "source": "rt"
        },
        {
            "content": "Orphan is trained as a fighter by a mystical guru, then spends a couple of hours running and jumping about. Tiresome. It gets one point as Joffrey is in it. ",
            "review_date": "2019-12-29",
            "source": "rt"
        },
        {
            "content": "When i was a child, i wish that some times  ther will be a batman movie that Show  me my Vision of me childhood hero. Chris Nolan made it.",
            "review_date": "2019-12-25",
            "source": "rt"
        },
        {
            "content": "The Batman origin story that we've been waiting for!",
            "review_date": "2019-12-25",
            "source": "rt"
        },
        {
            "content": "The greatest live action batman story ever told!",
            "review_date": "2019-12-24",
            "source": "rt"
        },
        {
            "content": "A great Batman film, definitely worth the watch.",
            "review_date": "2019-12-24",
            "source": "rt"
        },
        {
            "content": "Perfect origin story. Ending makes me cry every time.",
            "review_date": "2019-12-22",
            "source": "rt"
        },
        {
            "content": "Coming off Batman and Robin I was expecting this movie to be garbage but dear god was I wrong. Obviously the weakest movie of the Dark Knight trilogy this movie is still fun and is held in high regards for a good reason. Sadly this movie only grossed 373 million dollars. I feel like that number should be up to 500 million but I can understand why people didn't want too see this coming off of batman and robin but dear god were we surprised",
            "review_date": "2019-12-22",
            "source": "rt"
        },
        {
            "content": "Although not quite as refined as the epic sequels that would eventually follow it, Batman Begins is still a riveting journey powered by a downright phenomenal Christian Bale performance, if slow at times.",
            "review_date": "2019-12-21",
            "source": "rt"
        },
        {
            "content": "The Dark Knight may be a better movie. Though Batman Begins is a better Batman movie.",
            "review_date": "2019-12-21",
            "source": "rt"
        },
        {
            "content": "Batman Begins started Christopher Nolan's Trilogy, And started it perfectly. Christian Bale as Batman was the perfect choice, It dives deeper into Bruce Wayne's pain of his parents death. It is a remarkable set up for Batman.",
            "review_date": "2019-12-19",
            "source": "rt"
        },
        {
            "content": "A nice return for Batman",
            "review_date": "2019-12-19",
            "source": "rt"
        },
        {
            "content": "This movie saved the DC comics Batman with help of Christopher Nolan, it shows the origins of the batman with stunning scenes",
            "review_date": "2019-12-10",
            "source": "rt"
        },
        {
            "content": "This was the first batman movie that i see it,i was kid when i see it and now i love it",
            "review_date": "2019-11-30",
            "source": "rt"
        },
        {
            "content": "O começo de uma trilogia clássica, assim deveria ser os filmes da DC, sempre sombrios!",
            "review_date": "2019-11-28",
            "source": "rt"
        },
        {
            "content": "After the disappointing 1997 Batman movie, Batman returns with a bang, with the best looking Gotham at its time of release. Batman Begins starts the Christopher Nolan trilogy in a very impactful way, by the end of the film the audience is excited for what will happen in the following films. Christian Bale gives a great performance as both Bruce Wayne and Batman which we have not seen yet. A overlooked part of the film is the amazing score by Hans Zimmer. The supporting cast is star studded with excellent performances from Gary Oldman, Cillian Murphy, Morgan Freeman, Liam Neeson and Michael Caine, but of course, we expected great performances from these. The villain also helped make this film, especially Scarecrow who was effective in causing fear. There are some moments we're the CGI looks very poor, specifically when Gary Oldman drives the Tumbler over the bridge. Batman's voice is also very poor, it sounds awful. The visuals of his suit also looks poor however it was his first version of the suit.",
            "review_date": "2019-11-27",
            "source": "rt"
        },
        {
            "content": "I watched this after the Joker(2019). The first thought comes to my mind is \"DC's movie did make progress lol\". To be honest, this movie is extremely boring for me, though the director is Nolan. Some of the plots are childish, for example, when the scarecrow poisoned the batman, I thought it would be a difficulty which may contribute to the growth of the batman arc, but then it was solved by Lucius Fox. I thought \"r u kidding me?\" I felt that all the barriers are not real threaten to batman, so it is just a super hero story and I can't see how the batman suffered from the experience. How batman experienced crime and grew were described like a MV with few scenes. All the characters are simple, just like kindergarten comic books. And the values in the movie is funny, elitism and idealism. Rachel is like the character for a web romance novel, when meeting the CEO she is firm and persistent.\nAnyway, this movie might be significant in 2005, when I was 6. But for me, this is not what I expected.",
            "review_date": "2019-11-26",
            "source": "rt"
        },
        {
            "content": "Just an amazing movie. All time favourite.",
            "review_date": "2019-11-21",
            "source": "rt"
        },
        {
            "content": "Incredible. The movie is very well structured the twists are good and batmans origin is well written. Standout performances from Michael Caine and Christian Bale. Ras als ghul has interesting motives and the cinematography is very nice.",
            "review_date": "2019-11-07",
            "source": "rt"
        },
        {
            "content": "One of the greatest superhero movies ever made and origin stories.  Christopher Nolan and Hans Zimmer set the standard for all comic books movies made from 2005-Present.  This flick was jam-packed with some serious acting talent: Bale, Liam Neeson, Michael Caine, Cillian Murphy, Rutger Hauer, Morgan Freeman, Gary Oldman.  I rated it slightly better than The Dark Knight.",
            "review_date": "2019-11-06",
            "source": "rt"
        },
        {
            "content": "This is my second favorite batman (Not Joker) Film of all time third DC. Its a must see trilogy with a wonderful BEGINNING.",
            "review_date": "2019-10-29",
            "source": "rt"
        },
        {
            "content": "Batman is another one of those films you have to ask 'which one is that again?'  Like Spiderman, there seem to be too many.  A fair bit better than the campy Batman and Robin films from the 90s, but probably not as good as Dark Knight or even the Bane one.  There is a fair bit of cartoonish noir, from the subway system to the tenements - which was thankfully toned down after this film.\nThat said, it is a well shot and well acted origin set up film with a decent amount of action but not over the top. The story is ever so slightly bordering on cheesy, but they reel in back enough to make me want to follow what is going on.  There is no one baddie (which is usually a bad sign), but that didn't really hurt the story, because Bruce was going to generically 'fight the corruption' to save the city.",
            "review_date": "2019-10-28",
            "source": "rt"
        },
        {
            "content": "Gripping, tragic, and action packed. This is the best Batman backstory to date.",
            "review_date": "2019-10-28",
            "source": "rt"
        },
        {
            "content": "Exceptional a definite must watch!! ",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "I thought this was one of the best superhero movies I've ever seen",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "Christian Bale is very good. Action is amazing. Cinematography is ok. Antagonist was Bad, irritant. Good as Origin Story. Dark Knight is better, and Rises Is a little bit worse.",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "Amazing movie, fantastic retelling of Batman's origin.",
            "review_date": "2019-10-23",
            "source": "rt"
        },
        {
            "content": "Gotta get on dvd and bluray",
            "review_date": "2019-10-23",
            "source": "rt"
        },
        {
            "content": "Batman Begins has saved the Batman franchise. It was well made, has a great cast and will always keep you wanting more! All actors are at their best and prove to us that Nolan can make movies! If you haven't watched it yet, put down your device and watch it immediately! ",
            "review_date": "2019-10-22",
            "source": "rt"
        },
        {
            "content": "The bats were the best part",
            "review_date": "2019-10-17",
            "source": "rt"
        },
        {
            "content": "Christian bale was great ",
            "review_date": "2019-10-17",
            "source": "rt"
        },
        {
            "content": "Dark and gritty in batman matches him PERFECTLY WHAT A MOVIE WITH INSANE PLOT TWIST and Horror music\n",
            "review_date": "2019-10-15",
            "source": "rt"
        },
        {
            "content": "This has to be the best Batman movie that I have ever seen in my life. ",
            "review_date": "2019-10-14",
            "source": "rt"
        },
        {
            "content": "A true character study, filled with cinematic beauty.",
            "review_date": "2019-10-14",
            "source": "rt"
        },
        {
            "content": "It's not who I am underneath, but what I do, that defines me",
            "review_date": "2019-10-13",
            "source": "rt"
        },
        {
            "content": "A terrific Batman origin story, with bags of atmosphere, action, and striking visuals. Christian Bale was made for the part. Hans Zimmer provides the soundtrack. What more can I say? A classic of the genre.",
            "review_date": "2019-10-11",
            "source": "rt"
        },
        {
            "content": "I did enjoy this Batman begins but the movie had few issues. What I did like is the choice of actors they picked to star in this movie also I thought The storyline was on point and flowed rather nicely . They wanted to make a more grittier series then the first four they came out in the 90's and I believe they pulled it off. Now for the villains while I did like the fact that they picked two that have never made it to the big screen  yet i thought Scarcrow was okay but not a good pick for the first movie in a new series,but Ra's al Ghul was a very good choice so in a way it evens out.I also feel like Batman calling the bats in that one scene was way over the top plus he did to much gliding/flying for me and the Bat mobile looking like a monster truck was hard to get by. The movie is good but I just feel like it should have been better.",
            "review_date": "2019-10-11",
            "source": "rt"
        },
        {
            "content": "Great movie with a previously unexplored background of Bruce Wayne's training to become the Batman. With two of Batman's greatest foes in Scarecrow and Ra's Al Ghul, it hits all the right notes for a classic.",
            "review_date": "2019-10-09",
            "source": "rt"
        },
        {
            "content": "Incrivelmente bem executado , obra que marca o início da incrível  triologia dark Knight , um elenco com peso que executou grandiosamente seus devidos papéis , o início de uma nova era começa aqui.",
            "review_date": "2019-10-07",
            "source": "rt"
        },
        {
            "content": "Amazing how the worst of this series is the first but it still is a way above average movie.\n94%",
            "review_date": "2019-10-07",
            "source": "rt"
        },
        {
            "content": "The beginning of a very well directed triology, with excellent cast, I have already seen it 4 times and it is always the same reaction ... it is not a masterpiece like the second .. but it is responsible for being what the gentleman of night I needed",
            "review_date": "2019-10-06",
            "source": "rt"
        },
        {
            "content": "One of the best origin stories.  ",
            "review_date": "2019-10-05",
            "source": "rt"
        },
        {
            "content": "The defining origin story for the Dark Knight.",
            "review_date": "2019-10-04",
            "source": "rt"
        },
        {
            "content": "A good movie, though numerous plot-holes and inconsistant muddled writing stop it from being a great one.",
            "review_date": "2019-10-04",
            "source": "rt"
        },
        {
            "content": "If I had watched this back in 2005, I'm 100% sure it would be a 3.5 or a 4 star movie for me, buttttt. Even with keeping in mind the fact that this movie came out 15 years ago, it still has major problems. The editing was one of the worst I've ever seen in the hundreds of movies I've watched, it was nothing short of a bismol. I understand the need of having this be a 2 and a half hour movie, it has a lot that needs to happen, but in my opinion they wasted too much time on flashbacks that were mostly unnecessary and badly executed as well as contained some training scenes that didn't fit into the whole Gotham theme to me. And whilst on the subject, Gotham itself (noted many times in the comics as the darkest, buiggest shit hole of a place after Bludhaven) was faaaaar to bright. Compared to the grand job Tim Burton did in his Batman movies, this seriously lacks. The buiggest problem I had with this movie was the comic book inaccuracy. It seems like they did a halfazsed job when it comes to staying true to the comics, in many occurrences, mainly in the flashbacks, ex. The killer of Bruce's parents getting caught.",
            "review_date": "2019-10-01",
            "source": "rt"
        },
        {
            "content": "The Dark Knight Trilogy never failed me. Thank you, Christopher Nolan. I respect you.",
            "review_date": "2019-09-20",
            "source": "rt"
        },
        {
            "content": "Batman Begins was quite an exceptional movie. Even though it had so many story lines with it, it was quite an excellent movie. It tried to make us understand what it takes to become Batman and it doesn't let up. Mostly everything was right on point. Not really a bad point in this as it's comprehendingly excellent. ",
            "review_date": "2019-09-18",
            "source": "rt"
        },
        {
            "content": "An amazing start to possibly the best trilogy I've ever seen",
            "review_date": "2019-09-12",
            "source": "rt"
        },
        {
            "content": "A classic and grounded take on the character of Batman.",
            "review_date": "2019-09-06",
            "source": "rt"
        },
        {
            "content": "The perfect beginnig of a hero.",
            "review_date": "2019-09-05",
            "source": "rt"
        },
        {
            "content": "For me, the film acts as the definitive origin story for Batman on film. The gradual buildup to becoming Batman is satisfying and feels earned. A great cast of characters help make the story feel alive and believable. Overall, a great start to the trilogy.",
            "review_date": "2019-08-31",
            "source": "rt"
        },
        {
            "content": "A raw 12 round boxing match, that is engaging throughout the night.\n\nBatman Begins\n\nChristopher Nolan, as reported, plans to take over the DC universe to get funded for his larger than life films like Inception and Interstellar. But this plan itself is packed with an enormous amount of love for this caped crusader. And exerting that love by going through his homework through and through, you can easily see Nolan swooping in every fanboy moment on the screen. And as much as the film goes to an incredible amount of length just to punch you with that awe gasping scene, the plot moves swift, smooth and for once linearly. The plot is textbook origin tale of Bruce Wayne discovering the inner Batman in him.\n\nJoining Nolan on script writing is David S. Goyer, a familiar face in the gothic comic world whose, as reported, lofty plot devices are grounded with signature writing style by him. And this screenplay is often considered to be a literary example for the newcomers in screenwriting, since it, despite being dipped in superhero world, treats its characters like a crime drama genre, the punches doesn't come off empty, but in bleak honesty and in black(!)\n\nFor a film that easily runs over 3 hours- or it definitely looks like it- the editing deserves a mention for its sharpness that is elevated by a whisky cinematography and exhilarating background score. Nolan has been upfront about staging Batman as a horror rather than a beloved superhero with everything sunny in the background. And that is why the themes and storylines adapted from the comic books deals with the same messy head-spinning images. There are some gruesome special effects in here that will not be seen later in the trilogy. This visual storytelling treat is something that will later in Nolan's filmography is going to expand and even take over the cinematic life of its own; you can see the hints here, how Nolan and Batman Begins.",
            "review_date": "2019-08-25",
            "source": "rt"
        },
        {
            "content": "In my opinion this is the best start to any superhero trilogy.",
            "review_date": "2019-08-19",
            "source": "rt"
        },
        {
            "content": "This movie as an essential watch if you are a fan of batman, superheroes, or just love to watch good movies. I think that this was an incredible starting point for a rebooted Batman Franchise and it is a really well written and executed origin story of the caped crusader we all know and love. It took it's time to set up all of the characters and it does so in a masterful way that never bores you no matter how many times you watch this movie. It explores Bruce Wayne's childhood and the tragedy that occurred, and it takes us to when he trained to become a member of the league of shadows, we also witness Bruce re-entering society and trying to overcome his troubled past. Christian Bale has a name for himself thanks to his work in American Psycho which is probably what earned him the role of Batman, and he was even better here than in that movie, because he gave an unexpectedly strong performance and genuinely made me care all about Bruce Wayne in a powerful and emotional way that had never been done before. Liam Neeson gave it his all in this movie as well and I can really understand where he was coming from as a villain. My personal favorite actor in this movie, just a tinch more than Bale, is Cillian Murphy as Scarecrow. He was so quiet and creepy, he seemed like someone who would haunt your dreams as child, he was also quite menacing as Scarecrow as well and the effects of the fear toxins were displayed thoroughly and it looked great. Gary Oldman as Jim Gordon was amazing as well and gave you the perspective of the corrupt government through the eyes of a good cop who wants to change the city, he was really good and adequately fleshed out as well. Other actors include Morgan Freeman, Michael Caine, Ken Watanabe, and Katie Holmes who all gave good performances, particularly Cane who is my favorite version of Alfred. The main reason this movie is so good and is able to have a good plot with good characters is because it is dark and gritty and is more violent and risk-taking than most other superhero movies, it wasn't afraid to tell a good and dark story in detail with violence and some horror in it, and that is what I admire about it the most, it wasn't all a big joke like Schumacher's movies, it took itself seriously and gave us a very compelling story that revolves around Bruce Wayne and his tragic childhood. This is a must watch and is one of my favorite superhero movies, and it is my favorite origin story movie as well.      ",
            "review_date": "2019-08-17",
            "source": "rt"
        },
        {
            "content": "I was struggling to stay awake throughout this film. If you like boring movies, you will love Batman Begins.",
            "review_date": "2019-08-17",
            "source": "rt"
        },
        {
            "content": "Brooding and dark, but also exciting and smart, Batman Begins is a film that understands the essence of one of the definitive superheroes.",
            "review_date": "2019-08-16",
            "source": "rt"
        },
        {
            "content": "Batman begins is one of my all time favorite ",
            "review_date": "2019-08-14",
            "source": "rt"
        },
        {
            "content": "Much needed reboot. This is the Batman movie fans wanted and never got (until now).",
            "review_date": "2019-08-12",
            "source": "rt"
        },
        {
            "content": "Batman Begins is one of the best super heroe movies ever made, is this movie Nolan not only tells you the origin of this character,it also humanizes him. This movie is more the journey of a man's self-encounter than the origin of a super hero, for me Christian Bale is the best Batman, but unfortunately the movie is not perfect, it has problems like, the Bruce Wayne's parents decide to go down the worst alley they see or Alfred beats a super trained ninja with a simple blow of a golf club, but all right in conclusion the movie is great but not perfect.",
            "review_date": "2019-08-07",
            "source": "rt"
        },
        {
            "content": "This was way ahead of its time. Still better than endgame.",
            "review_date": "2019-08-05",
            "source": "rt"
        },
        {
            "content": "Batman begins is nothing short of fantastic. Christian Bale will always be the best Batman he is absolutely flawless in this film. Liam Neeson gives one of his best performances ever as Henri Ducard. the movie is dark, scary full of action and totally captivating on every level. it keeps you engaged the entire time and its one of the best superhero movies ever. the training scenes in this film are great and the life of Bruce Wayne is told masterfully. my only issue with movie is Rachel Dawes who sticks out as a sore thumb but other than that this movie is pretty much flawless.",
            "review_date": "2019-08-04",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies!!!! Loved it",
            "review_date": "2019-08-03",
            "source": "rt"
        },
        {
            "content": "The best batman film.  what. fight me.",
            "review_date": "2019-07-31",
            "source": "rt"
        },
        {
            "content": "nice christian bale is awesome ",
            "review_date": "2019-07-26",
            "source": "rt"
        },
        {
            "content": "Batman Begins is A very dark and stunning movie, Just the way a DC film should be, However, While Batman was too busy running through Gotham and saving Folks, The story to this movie Had a lot of twists, Pretty much so where they should of kept it for the Dark Knight. (The sequel to this film) Grade: B-",
            "review_date": "2019-07-22",
            "source": "rt"
        },
        {
            "content": "Christopher Nolan gives an us a very serious and deep take on what should be a goofy comic book premise.",
            "review_date": "2019-07-21",
            "source": "rt"
        },
        {
            "content": "Batman rises from the grave that Joel Schmaucher dug to bring a film that brings him back on top.",
            "review_date": "2019-07-19",
            "source": "rt"
        },
        {
            "content": "Pretty good but I was more more into the original Batman movie",
            "review_date": "2019-07-19",
            "source": "rt"
        },
        {
            "content": "Amazing! The beginning of one of the greatest trilogies in film history as well as comicbook adaptation. It is and it's not a comicbook movie at the same time. An intriguing journey into a young Bruce Wayne, and Batman's year one.",
            "review_date": "2019-07-16",
            "source": "rt"
        },
        {
            "content": "2nd best of the 3 part series. Rating:92",
            "review_date": "2019-07-15",
            "source": "rt"
        },
        {
            "content": "Great movie.2nd best of the 3 part series in my opinion.\nRating:92",
            "review_date": "2019-07-15",
            "source": "rt"
        },
        {
            "content": "Christopher Nolan did a good job with this Batman flick. But their are some major problems with this movie.",
            "review_date": "2019-07-14",
            "source": "rt"
        },
        {
            "content": "Had low expectations, but this movie blew me away. I also thought the story was going to be very linear, but I was clearly wrong.",
            "review_date": "2019-07-14",
            "source": "rt"
        },
        {
            "content": "The beginning of the greatest Batman film franchise ever made, and perhaps the greatest DC film franchise ever made. Every actor is perfect in their role. Most Batman films forget or ignore that Alfred Pennyworth is a huge part of Bruce Wayne's life, and this film does a great job characterizing Alfred and making his character as effectual as he should be. Batman Begins is a dour, neo-noir take on the superhero film, and is amazing in every way.",
            "review_date": "2019-07-11",
            "source": "rt"
        },
        {
            "content": "Batman may have come back to the big screen in a much darker way, which absolutely fits with Christopher Nolan's direction!",
            "review_date": "2019-07-08",
            "source": "rt"
        },
        {
            "content": "Not that great, but at least not boring. \n\nMy score would be 6.7/10",
            "review_date": "2019-07-04",
            "source": "rt"
        },
        {
            "content": "A good start to the Dark knight trilogy",
            "review_date": "2019-07-02",
            "source": "rt"
        },
        {
            "content": "This is an extremely well shot, well acted, and well put togehther movie, that is very entertaining. ",
            "review_date": "2019-07-01",
            "source": "rt"
        },
        {
            "content": "Batman begins is a all time spectacular comic book film ",
            "review_date": "2019-06-29",
            "source": "rt"
        },
        {
            "content": "Very smart and a perfect entertainment for all types of tastes ",
            "review_date": "2019-06-27",
            "source": "rt"
        },
        {
            "content": "Начало великой трилогии !",
            "review_date": "2019-06-24",
            "source": "rt"
        },
        {
            "content": "Its a decent origin story of Batman which conjures up a dark mood but I think I would have preferred it to be more punchy and have stronger villains.",
            "review_date": "2019-06-24",
            "source": "rt"
        },
        {
            "content": "I can't think of many things wrong with this movie except minor geeky complaints such as Batman's Cape looking off to me or the Ra's mix up with Liam Neeson and Ken Watanabe. Otherwise damn near perfect.",
            "review_date": "2019-06-22",
            "source": "rt"
        },
        {
            "content": "I realy enjoyed this movie. It's is my least favorite Nolan trilogy movie it still was amazing. I did have a little problem with scarecrow. I'm fine with him not being the main villian but I wish he had a better role. But I liked all of the performances. I really think this was a good start to the Nolan trilogy.",
            "review_date": "2019-06-19",
            "source": "rt"
        },
        {
            "content": "I rewatched this again for the nth time, but this time after watching the Gotham tv series, and there were quite a few easter eggs and names that were dropped that I didn't catch the first time. Christopher Nolan really started a masterpiece with this movie and I am quite glad it started off one of the best trilogies till date (beat by perhaps only LOTR). ",
            "review_date": "2019-06-19",
            "source": "rt"
        },
        {
            "content": "Batman Begins is an impressive reboot of the repulsive Batman and Robin. Christopher Nolan takes the directing reins of Batman and gives us action!",
            "review_date": "2019-06-18",
            "source": "rt"
        },
        {
            "content": "After an era full of camp, the Batman is dark once more, though this time in a more realistic world. The blockbuster furthers the legend's origin story by taking him all over the world, fighting against crime family's with lethal drugs and a formidable league of shadows.",
            "review_date": "2019-06-17",
            "source": "rt"
        },
        {
            "content": "The best Batman movie ever made. ",
            "review_date": "2019-06-16",
            "source": "rt"
        },
        {
            "content": "This movie does have one of the worst plot holes of all time as far as how the villain's plan practically works. But, it's a movie. And a really good origin story that's actually about Batman instead of being about all the villains. Imagine that! A Batman movie about Batman!",
            "review_date": "2019-06-10",
            "source": "rt"
        },
        {
            "content": "Start Of One Of The Best Trilogies All Time!!!!!",
            "review_date": "2019-06-08",
            "source": "rt"
        },
        {
            "content": "best batman ever. great origin story. good action. like ras al gul alot. I loved the journey of Bruce Wayne to batman ",
            "review_date": "2019-06-05",
            "source": "rt"
        },
        {
            "content": "Great cast, great characters, we learn how Batman is created and why Bruce Wayne is broken and find away to be Gothams hero they don't deserve or want.",
            "review_date": "2019-06-03",
            "source": "rt"
        },
        {
            "content": "This is a gritty Batman. Origin stories are difficult to pull off and I think it is done great. The villain is not a very concrete single body but takes more of the sort of form that a bad guy of a detective show would take. The plan is both convoluted and impactful, it really presents a challenge to our hero. The starting origins are, in my opinion, somewhat overdone and the relationships he builds are meh. I truly think that this movie is the perfect setup for the rest of the Dark Knight series and think that it provides the most concise origin story & superhero plot in one movie.",
            "review_date": "2019-06-02",
            "source": "rt"
        },
        {
            "content": "How can anyone not see just how bad this film is? The whole thing is one big contrived mess that really stretches any and all logic beyond reason. Like any Nolan movie this one doesn’t care about story, just so long as you can get a cool looking shot. ",
            "review_date": "2019-05-27",
            "source": "rt"
        },
        {
            "content": "christian bale is best batman",
            "review_date": "2019-05-22",
            "source": "rt"
        },
        {
            "content": "Excelente adaptacion de batman dirigida por un director demasiado detallista",
            "review_date": "2019-05-19",
            "source": "rt"
        },
        {
            "content": "the worst Christopher Nolan Batman movie but still good",
            "review_date": "2019-05-19",
            "source": "rt"
        },
        {
            "content": "Batman Begins was a good origins story. Bale was pretty good as Batman. I thought that Miller played Scarecrow well. The running time was a bit long. It took a little while for the action to pick up but I still enjoyed the film.",
            "review_date": "2019-05-17",
            "source": "rt"
        },
        {
            "content": "In an era where the MCU is praised for his formulaic movies, watching Batman begins is a breath of fresh air. It is better than any superhero movie of this decade ( i have not watched the dark knight rises). I want this review to do justice to the film yet I can not find words to describe how beautiful and well crafted this picture is.",
            "review_date": "2019-05-09",
            "source": "rt"
        },
        {
            "content": "In a time where comic book movies were complete jokes, in comes Christopher Nolan to create the first comic book movie masterpiece. Batman Begins is the definitive Batman origin story. This has some of the best exposition ever put to film with how they build up Batman.\n\nChristian Bale's performance, I feel, gets too much backlash. Yeah, he has a gravelly voice (especially in the sequels), but I feel like people didn't get it. Don't get me wrong, I'll joke about it any day, but it makes sense as to why he has that voice. With Michael Keaton, he still sounded like Michael Keaton when he was Batman. Even the legendary Kevin Conroy (with his Batman from the Arkham games being my favorite Batman EVER) still sounds like Kevin Conroy when he was Batman.\n\nWhen Christian Bale plays Batman, he does something that no Batman before him did: make his voice unrecognizable. Think about it, he does not sound like Christian Bale when he's playing Batman, he sounds like someone else. If Batman's goal is to make his voice unrecognizable, then he fully succeeded.",
            "review_date": "2019-05-04",
            "source": "rt"
        },
        {
            "content": "Some parts are rather slow but the rest is an action packed blast!",
            "review_date": "2019-04-30",
            "source": "rt"
        },
        {
            "content": "The movie started with Bruce at 8 years old exposed to his deepest fear, which is bats, then the sequence of movie continues with an enjoyable and interrelated scenes.\n\nWhen Alfred ask Bruce, while he was preparing batman costume, \"why bats ?\", Bruce said \"bats frighten me, it's time my enemies shared my dread\". and these words indicate that Bruce face his deepest fear (bats) and now he is fearless.\n\nit is a good movie, you should watch it before dark knight because there are some related scenes, which make Dark Knight more masterpiece than it is.",
            "review_date": "2019-04-29",
            "source": "rt"
        },
        {
            "content": "Fantastic way to start a story but it lacks characters development and a better villain.",
            "review_date": "2019-04-26",
            "source": "rt"
        },
        {
            "content": "A good Batman movie!",
            "review_date": "2019-04-23",
            "source": "rt"
        },
        {
            "content": "Wasn't sure going in but walked away counting the months till the sequel.",
            "review_date": "2019-04-23",
            "source": "rt"
        },
        {
            "content": "A great beginning to a great Trilogy. The villain Scarecrow is set up perfectly and makes a great main bad guy. Ra's Al Gul's involvement kind of side tracks the main villain and the strange twists involved is very weird but still an overall good film.",
            "review_date": "2019-04-18",
            "source": "rt"
        },
        {
            "content": "I have to say, one of the best batman movies ever. It's intelligent and solidly acted.",
            "review_date": "2019-04-10",
            "source": "rt"
        },
        {
            "content": "They finally got Batman right.  This is the first time since Michael Keaton played the role that someone else has been able to fill his shoes.  Sure, Bale sounds ridiculous with that voice he uses but everything else is amazing.  The origin story was quick and to the point, his training to become Batman was exciting and entertaining.  And finally his battles against Falcone, the Scarecrow and the League of Shadows were amazing.  Christopher Nolan took this to a dark place and treated it with the respect it deserves.  His direction is so sure and on point, there's hardly any scenes that don't captivate you.  This is a must watch for any fan of action or superhero movies.",
            "review_date": "2019-04-02",
            "source": "rt"
        },
        {
            "content": "The Dark Knight is good but I prefer this masterpiece.",
            "review_date": "2019-03-27",
            "source": "rt"
        },
        {
            "content": "Batman is such a badass and Liam Neeson as Ras Al Ghul is amazing",
            "review_date": "2019-03-24",
            "source": "rt"
        },
        {
            "content": "Batman is such a badass and Liam Neeson as Ras Al Ghul is amazing.",
            "review_date": "2019-03-23",
            "source": "rt"
        },
        {
            "content": "It was the best movie of all time.",
            "review_date": "2019-03-22",
            "source": "rt"
        },
        {
            "content": "Good Introduction Of Christian Bale’s Batman ",
            "review_date": "2019-03-20",
            "source": "rt"
        },
        {
            "content": "Batman begins is the first film in the dark knight trilogy directed by Christopher Nolan. Really good acting especially Christian Bale as Bruce Wayne/Batman. Really good characters some of the best from comic books and films. Very good cinematography with some really good shots. Very good settings like Gotham. Really good set design and props like the Tumbler. Very good costume design with the bat suit. Very good style with the colour scheme to the lighting. Very good practical effects. Very good special effects. Very good action that is directed really well. Very good sound design. Really good and quotable dialogue. Very good editing. Very good music one of the best superhero soundtracks. Really good origin story one of the best in cinema. Very good comedy especially with Alfred. Really good atmosphere especially when Bruce is Batman. The film is also really enjoyable. One of the biggest praises of this film is that they take Batman's origin and put it to film extremely well. Over all I give it a 9/10 - so close\n\nOne of the best superhero films",
            "review_date": "2019-03-17",
            "source": "rt"
        },
        {
            "content": "Batman wasn’t beyond saving after that disastrous Batman and Robin movie, and Christopher Nolan is the hero Batman needed and deserved.",
            "review_date": "2019-03-17",
            "source": "rt"
        },
        {
            "content": "Nolan is amazing!! Such a great way to introduce the Batman! ",
            "review_date": "2019-03-16",
            "source": "rt"
        },
        {
            "content": "I think the Tim Burton movies are better but this is still fantastic.",
            "review_date": "2019-03-12",
            "source": "rt"
        },
        {
            "content": "Great movie. Great intro for the character. Reboot was needed after Batman and Robin",
            "review_date": "2019-03-09",
            "source": "rt"
        },
        {
            "content": "Fantastic Batman movie. Christian Bale makes for an excellent Batman and fills out the suit very nicely. I love this adaptaion however itï¿ 1/2(TM)s not perfect. The scarecrow was a great villain and the tease at the end got me super exited for what was to come and in many ways I think there some elements of the film that outshine even its predecessor The Dark Knight.",
            "review_date": "2019-03-08",
            "source": "rt"
        },
        {
            "content": "Very good Batman prequel movie with good action sequences and great plot, sets probably one of the best movie trilogies in history: The Dark Knight",
            "review_date": "2019-03-05",
            "source": "rt"
        },
        {
            "content": "This is the best griddy reboot ever put to film i love it alot.",
            "review_date": "2019-03-03",
            "source": "rt"
        },
        {
            "content": "Great movie not just a great comic book origin story, the greatest",
            "review_date": "2019-02-27",
            "source": "rt"
        },
        {
            "content": "La mejor pelÃ­cula de HÃ (C)roes que he visto.",
            "review_date": "2019-02-27",
            "source": "rt"
        },
        {
            "content": "a first step to greatness",
            "review_date": "2019-02-26",
            "source": "rt"
        },
        {
            "content": "It gives us a NEW kind of Batman, but at the same time the classic Batman we all love. Not great C.G.I., but gives us a better look at the life that both Bruce Wayne(batmanï¿ 1/2 1/2(TM)s secret identity) and Batman share together.",
            "review_date": "2019-02-25",
            "source": "rt"
        },
        {
            "content": "The sleeper hit that quietly revolutionized modern comic movies.",
            "review_date": "2019-02-19",
            "source": "rt"
        },
        {
            "content": "Christopher Nolan would change how we perceive comic book films forever with Batman Begins. A dark, intelligent film filled with intrigue and exellent characters played by an outstanding cast.",
            "review_date": "2019-02-14",
            "source": "rt"
        },
        {
            "content": "Batman Begins works as standout superhero film, and a character drama.",
            "review_date": "2019-02-10",
            "source": "rt"
        },
        {
            "content": "With a Talented Cast and well rounded performance by Christian Bale , and a plot that shapes it all together. Batman Begins is a well deserved masterpiece.",
            "review_date": "2019-02-09",
            "source": "rt"
        },
        {
            "content": "My favorite movieï 1/4?",
            "review_date": "2019-02-03",
            "source": "rt"
        },
        {
            "content": "I have seen many film in my short life... I surely can't get bored watching this over and over again.",
            "review_date": "2019-01-28",
            "source": "rt"
        },
        {
            "content": "Now, this is a Batman movie.",
            "review_date": "2019-01-27",
            "source": "rt"
        },
        {
            "content": "Along with a great story, well done characters, and Batman (of course), Batman Begins is one of the best Batman films ever.",
            "review_date": "2019-01-27",
            "source": "rt"
        },
        {
            "content": "Batman Begins showed us my Batman is the greatest superhero ever.",
            "review_date": "2019-01-25",
            "source": "rt"
        },
        {
            "content": "One of the best superhero movies of all time. This take on Batman is dark but the narrative is great with a mastermind villain. This might be up there with the Dark Knight and is still to date one of the best trilogys ever created. Nolan proves he can make any sort of film no matter the genre.",
            "review_date": "2019-01-19",
            "source": "rt"
        },
        {
            "content": "Its good - a real world take on Batman.",
            "review_date": "2019-01-17",
            "source": "rt"
        },
        {
            "content": "The Best superhero origin movie out there ! GREATEST COMEBACK EVER !",
            "review_date": "2019-01-17",
            "source": "rt"
        },
        {
            "content": "truley an underrated film! a fantastical 2nd act and you feel satisfaction when it concludes.",
            "review_date": "2019-01-15",
            "source": "rt"
        },
        {
            "content": "Dark and gritty, perfect atmosphere for this movie and a comeback for the caped crusader after Batman and Robin",
            "review_date": "2019-01-08",
            "source": "rt"
        },
        {
            "content": "Achei o comeÃ§o do filme um tanto quanto confuso, jÃ¡ que ele passa rapidamente por diferentes momentos da vida do Bruce Wayne. Entretanto, apÃ³s esse inÃ­cio, o filme consegue retratar muito bem a cidade de Gotham e o prÃ³prio Batman de um modo Ãºnico, bem sombrio, fazendo com que todos os demais elementos do filme contribuam para tal.",
            "review_date": "2019-01-05",
            "source": "rt"
        },
        {
            "content": "Batman Begins was so boring compared to other batman movies.",
            "review_date": "2019-01-04",
            "source": "rt"
        },
        {
            "content": "The best Batman live action film made!",
            "review_date": "2019-01-03",
            "source": "rt"
        },
        {
            "content": "A perfect super hero movie. Perfect script, character development is solid. Arguable one of the best musical scores of all time. Highly underrated.",
            "review_date": "2018-12-31",
            "source": "rt"
        },
        {
            "content": "Christopher Nolan succeeds at making a working origin story that captivates the whole essence of Batman. Contrasting the campy fest of the Raimi Spider-Man trilogy started in 2002, this movie correctly differentiate itself by embracing much darker tones and philosophy.",
            "review_date": "2018-12-28",
            "source": "rt"
        },
        {
            "content": "This is what Batman needed. After the crap pile known as Batman and Robin, Batman needed a resurrection and Christopher Nolan pulled it off. Christian Bale knocks it out of the park as Bruce Wayne and Batman, and Liam Neeson is amazing as Ra’s Al Ghul. My only major complaint is that the action at times was shot with too many quick cuts for my liking and the choreography could be unimpressive at times. Other than that this movie is still awesome and it’s remained one of the best origin stories for a superhero ever. ",
            "review_date": "2018-12-27",
            "source": "rt"
        },
        {
            "content": "This is an amazing, an absolutely amazing film. With Batman Begins, director Christopher Nolan has gone back to basics, jettisoning both the silliness of the TV incarnation and the gothic and fetishist elements of the '90s version. This is a hard-core, down-and-gritty origin story - the tale of, as one might reasonably expect, how Batman begins. It isn't intended as a \"prequel\" to the 1989 film - not only is Gotham City a completely different place, but key events of the Batman chronology are re-spun. Batman Begins is designed as the start of a new life, a reboot for the franchise. In the process, Nolan has not only crafted the best Batman movie, but arguably the second-best motion picture superhero narrative. Christian Bale is very good as Batman and Bruce Wayne and although many people have criticized the rough coarse voice, I found it to be apt for the style and vision of this film. (Nolan leaves his mark on the Superhero genre).",
            "review_date": "2018-12-16",
            "source": "rt"
        },
        {
            "content": "Batman begins is a better than fine beginning chapter that resets what many thought of the character and other superheroes movies for years to come.",
            "review_date": "2018-12-13",
            "source": "rt"
        },
        {
            "content": "This dark and broody movie isn't just the start of the best superhero film trilogy,  but is the start of the greatest film trilogy ever made.",
            "review_date": "2018-12-08",
            "source": "rt"
        },
        {
            "content": "I'M BATMAN! Christopher nolan's first outing with the caped crusader is the worst one in the trilogy, but is still a brilliant a superhero movie. Batman Begins stars Christian Bale, Rachel Holmes, Liam Neeson,Gary Oldman and Michael Caine. It has an engaging plot and was the best superhero movie when it came out. It has brilliant acting and was a real game changer for superhero movies because most of the other ones were trash. After training with his mentor, Batman begins his fight to free crime-ridden Gotham City from corruption.  Christian Bale's first outing of the Caped Crusader was his worst performance in the trilogy, and really showed us Bruce Wayne's origin story and how he became Batman.  Liam Neeson had a brilliant villain Ducard who is a brilliant villain that was brought to life by Christopher. \n\n I really enjoyed this movie, I don't think it had any plot holes in it and had great visual effects for it's time. I thought the action scenes were really well acted and the camera shots were on the mark. My only problem with this movie was that Katie Holmes wasn't as good as Maggie Gyllenhaal (I think this was a good change). This is the darkest film in Nolan's trilogy, but other than that a brilliant superhero movie I love.  I would recommend to Batman Fans and Marvel fans who think that DC movies are trash because before I watch this film I didn't like DC movies but the reviews made me watch and I ended up absolutely loving it. Recommend rating 12 for moderate violence, some scenes of horror and threat.\n\nGrade A+",
            "review_date": "2018-12-04",
            "source": "rt"
        },
        {
            "content": "A Phenomenal Batman origin movie. Christopher Nolan's work shines.\n I'll give it \n         - 91%",
            "review_date": "2018-12-01",
            "source": "rt"
        },
        {
            "content": "Tem alguns problemas por ser um filme de origem, mas ï¿ 1/2 1/2 1/2 (C) extremamente relevante cinematograficamente.",
            "review_date": "2018-11-26",
            "source": "rt"
        },
        {
            "content": "A reboot of Batman that brings a new light to the character from the vision of Christopher Nolan that has a great origin story and character",
            "review_date": "2018-11-22",
            "source": "rt"
        },
        {
            "content": "Wonderful origin story with great acting, awesome villains and action scenes. Scarecrow feels underused tho.",
            "review_date": "2018-11-19",
            "source": "rt"
        },
        {
            "content": "While it may not be as perfect as its sequel, it is still one near-perfect, solid film. Christopher Nolan, nailed it as always. In my opinion, Christian Bale's performance is also very underrated.",
            "review_date": "2018-11-19",
            "source": "rt"
        },
        {
            "content": "Although Batman Begins gets overshadowed by the other movies in the Dark Knight franchise, Batman Begins is still a very entertaining movie.",
            "review_date": "2018-11-17",
            "source": "rt"
        },
        {
            "content": "\"Batman Begins\" is a good movie, yet or DC movies keeps failing.",
            "review_date": "2018-11-16",
            "source": "rt"
        },
        {
            "content": "Nolan brought back many’s favorite character with ferocity, yet smartly. He made you care for this character again in a deeper way that no one has ever tried before. He also gave the characters, quite possibly, the best on screen presence than anyone ever has. ",
            "review_date": "2018-11-16",
            "source": "rt"
        },
        {
            "content": "Really good reboot. I enjoy watching this movie. Christian Bale is great playing Batman. This movie was really well made.",
            "review_date": "2018-11-02",
            "source": "rt"
        },
        {
            "content": "The perfect superhero origin story, and a perfect start of a franchise. Christopher Nolan once again proves his place in modern filmmaking.",
            "review_date": "2018-11-01",
            "source": "rt"
        },
        {
            "content": "Great start to a newer Batman trilogy",
            "review_date": "2018-10-22",
            "source": "rt"
        },
        {
            "content": "Pretty good  but not as realistic as I  think Nolan was going for.",
            "review_date": "2018-10-20",
            "source": "rt"
        },
        {
            "content": "Very good movie. I like the Scarecrow character. Batman and Gordon's talk at the end got me hyped for the next film.",
            "review_date": "2018-10-13",
            "source": "rt"
        },
        {
            "content": "The first chapter in one of the greatest movie trilogies of all time.",
            "review_date": "2018-10-12",
            "source": "rt"
        },
        {
            "content": "A new kind of superhero movie. Unlike the older batman movies, this one is a more serious approach paired with great actors and a stellar score. If you like a well produced movie, you will have much fun watching this, even if you are not a big fan of the comics.",
            "review_date": "2018-10-08",
            "source": "rt"
        },
        {
            "content": "The best Batman film hands down. Batman is at his most badass and that's saying a lot since he's, ya know, Batman.",
            "review_date": "2018-10-01",
            "source": "rt"
        },
        {
            "content": "Great movie! Love the story, great cinematography, awesome characters! And it's batman!",
            "review_date": "2018-09-27",
            "source": "rt"
        },
        {
            "content": "An underrated entry. Incredible.",
            "review_date": "2018-09-24",
            "source": "rt"
        },
        {
            "content": "Amazing start to one of the greatest trilogies of all time.",
            "review_date": "2018-09-19",
            "source": "rt"
        },
        {
            "content": "La trilogia di Nolan inizia con un film di alta fattura, realizzato benissimo e con degli interpreti di grande spessore. Christian Bale come Batman funziona tantissimo, così come Micheal Caine come Alfred. Non ho apprezzato molto invece Katie Holmes, tantomeno la sua doppiatrice, voce insopportabile. Il villain, interpretato da Liam Neeson, non mi è piaciuto semplicemente per il fatto che non adoro le associazioni criminali asiatiche come cattivi di film di supereroi; insomma si tratta solo di un parere soggettivo. Le musiche sono azzeccatissime e la fotografia è ottima. Da non dimenticare il grande Morgan Freeman come Lucius Fox e Gary Oldman come James Gordon, due attoroni che apprezzo tantissimo. Mi è piaciuto come è stato trattato il passato di Bruce e tutto ciò che lo circonda. Gran bel film.",
            "review_date": "2018-09-15",
            "source": "rt"
        },
        {
            "content": "If I could sum up Batman Begins in one word, it would be AWESOME!! While I loved the first Michael Keaton Batman from 1989 because of its splendid acting and amazing storytelling, Begins somehow manages to one-up Batman in many levels. The story is fantastic; very dark, but very exciting. The Scarecrow was super scary, and Christian Bale was an amazing Batman. I really look forward to seeing The Dark Knight. Batman Begins so far is my favorite Batman film.",
            "review_date": "2018-09-05",
            "source": "rt"
        },
        {
            "content": "Solid casting/acting. Movie is a little slow in the beginning. Interesting villain choice. Overall, a good movie that keeps you into it and keeps you excited.",
            "review_date": "2018-08-22",
            "source": "rt"
        },
        {
            "content": "Christopher Nolan's retelling of the Batman story is a paradigm shift for the character and for superhero adaptations as a whole.",
            "review_date": "2018-08-11",
            "source": "rt"
        },
        {
            "content": "The Batman movie that made Batman cool again after Batman & Robin threw the franchise into the trash. Christopher Nolan repaired the damage done by Joel Schumacher. Christian Bale does a great job being the Caped Crusader and does the character justice. A-",
            "review_date": "2018-08-08",
            "source": "rt"
        },
        {
            "content": "Everything you want from a Batman origin.",
            "review_date": "2018-07-28",
            "source": "rt"
        },
        {
            "content": "I love it!!!! So MUCH!!!",
            "review_date": "2018-07-25",
            "source": "rt"
        },
        {
            "content": "Batman Begins is not a movie of the mythical Batman, it is much more than that",
            "review_date": "2018-07-23",
            "source": "rt"
        },
        {
            "content": "A well-paced and inspiring origin story that was made to feel grounded with a fair amount of realism.",
            "review_date": "2018-07-22",
            "source": "rt"
        },
        {
            "content": "This is a really good movie to start out the trilogy. Full of action and story, you gotta see it if you haven't already.",
            "review_date": "2018-07-19",
            "source": "rt"
        },
        {
            "content": "I just re-watched it after ten years. It's so much better than Snyder's crap. It's brilliantly filmed and written.",
            "review_date": "2018-07-13",
            "source": "rt"
        },
        {
            "content": "Batman Begins was a brilliant way to open the trilogy showing how Bruce Wayne's parents died when he was young, how he became petrified of bats and how he became one of the best loved heroes Batman. The villain(Played by Liam Neeson) was a good villain because he was the person who trained Wayne at the beginning But overall an amazing film that i would highly recommend. Rating A+",
            "review_date": "2018-07-04",
            "source": "rt"
        },
        {
            "content": "Perfect film. Beginning to the greatest trilogy of all time.",
            "review_date": "2018-07-01",
            "source": "rt"
        },
        {
            "content": "Close to perfect in almost every aspect.  A film you can watch anywhere anytime.",
            "review_date": "2018-06-26",
            "source": "rt"
        },
        {
            "content": "Christopher Nolan's Batman Begins is one of the great appreciation for superhero movies. It resurrects the dead of Batman franchise before that and become one of the influent films to all superhero movies. A character that describes the original Batman character such as dark, gloomy, and fantastic. Christian Bale as Batman is one of the memorable, along with Liam Neeson as an antagonist. Gary Oldman as well, one of the roles that will also always be remembered in this series. Michael Caine is also like that. This is an example of how the superhero movie works, no need to use excessive CGI and less overkill.",
            "review_date": "2018-06-23",
            "source": "rt"
        },
        {
            "content": "Great return to Batman. Nolan's vision maintains a solid action, drama, theme driven narrative, even if he often tends to tell rather than show via important one-liners.",
            "review_date": "2018-06-22",
            "source": "rt"
        },
        {
            "content": "The beginning was bland and boring.it has gotten better through the film but I got bored half way",
            "review_date": "2018-06-04",
            "source": "rt"
        },
        {
            "content": "a OUTSTANDING start to a RELAUNCH of batman character on the big screen.",
            "review_date": "2018-05-31",
            "source": "rt"
        },
        {
            "content": "So you are probably wondering how did Bruce Wayne become Batman well here it is for you. Hay just ok",
            "review_date": "2018-05-25",
            "source": "rt"
        },
        {
            "content": "This movie was awesome A 95%",
            "review_date": "2018-05-23",
            "source": "rt"
        },
        {
            "content": "A truly exceptional film to change Batman from cartoony and comic character to more of a realistic approach. While Batman Begins features some unrealistic aspects, the characters and the stakes of the film is amazingly done. Highlights of the film include Christian Bale's take on the brooding superhero, Cillian Murphy's wonderous portrayal as The Scarecrow - and the payoff of a lovely scripted and memorable film that kicks off a truly epic trilogy.",
            "review_date": "2018-05-21",
            "source": "rt"
        },
        {
            "content": "A strong start to a trilogy.Really good origin story.Liam Neeson is electrifying.",
            "review_date": "2018-05-16",
            "source": "rt"
        },
        {
            "content": "A brilliant introduction to the Batman saga that almost rewrites the character in spectacular fashion. Nolan brings the realness back from the Burton era while introducing him into a modern setting.\n\nChristian Bale sinks his teeth into the role and we get the best Bruce Wayne/Batman we have had on the big screen. The gadgets all seem realistic and Bale's performance in Both roles anchors the character in a believable setting.\n\nVery well directed and a terrific supporting cast all add up to the best Batman movie since the 80s!",
            "review_date": "2018-05-10",
            "source": "rt"
        },
        {
            "content": "Not as good as TDK but better than TDKR still a solid Batflick, at least Batman's costume doesn't have nipples. ",
            "review_date": "2018-05-03",
            "source": "rt"
        },
        {
            "content": "After batman and robin utterly destroyed any chance the old series of batman films had of continuing, this reboot truly redeemed batman's film career and showed us that there were still many more possibilities for batman on the big screen. This film delves into the origins of batman, and how he became the feared protector of gotham we all know and love, and it hits all the right notes. The actors all do a great job, the plot is engaging, and the movie nails the dark and serious tone that I think suits batman best. Combine this was some really suspenseful action, and some amazing lines, and this is a really good superhero movie! Its not the best one of its kind (though that could be a bit of bias speaking seeing as I'm not the biggest DC fan), but its still really good! And this movie gets extra brownie points for spawning my favorite batman movie, the dark knight.",
            "review_date": "2018-04-16",
            "source": "rt"
        },
        {
            "content": "It's an all around fantastic film and deserves a better score than 84",
            "review_date": "2018-04-12",
            "source": "rt"
        },
        {
            "content": "\"Writer and Director Christopher Nolan starts off with \"Batman Begins\" as the first entry in the cinema-shaping trilogy.\"",
            "review_date": "2018-04-05",
            "source": "rt"
        },
        {
            "content": "An epic entry into The Dark Knight Trilogy, and a movie that transcends the superhero genre to a more serious nature. A respected and tenacious entry to the super hero genre that makes it a whole lot easier for regular movie goers to enjoy comic book films.",
            "review_date": "2018-04-02",
            "source": "rt"
        },
        {
            "content": "This definitely saved Batman from the era of Batman Forever and Batman & Robin. This darker and more gritty take on Batman definitely worked and changed what comic book movies could be. The performances and writing is superb but the score could possible be the best thing about it. \n10/10",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "Good/Ok movie overall.",
            "review_date": "2018-03-28",
            "source": "rt"
        },
        {
            "content": "Without being the great thing of its successors, Begins is an intriguing beginning of Batman that opened the expectations towards the panorama to which later the director would be in charge. It has hints of suspense and drama that make it a peculiar superheroic film that gathers enough condiments from a classic thriller.",
            "review_date": "2018-03-27",
            "source": "rt"
        },
        {
            "content": "Overall, this film serves as a great origin story and first battle for the caped crusader. Although the villain wasn't very inciting, I still quite enjoyed the film. I rate the film a 7.5/10",
            "review_date": "2018-03-25",
            "source": "rt"
        },
        {
            "content": "Gripping, intense and Christian Bale is a show stopper. \"Batman Begins\" is a amazing uplift, to a dying series.",
            "review_date": "2018-03-24",
            "source": "rt"
        },
        {
            "content": "Christopher Nolan's first film in the batman franchise is an incredible thrill ride that does a fantastic job kicking off the trilogy. The plot is a bit predictable, but the performances from Oldman, Bale, Neeson, and Freeman propel this movie to the top of the superhero genre.",
            "review_date": "2018-03-22",
            "source": "rt"
        },
        {
            "content": "One Of The Best Batman Movies",
            "review_date": "2018-03-10",
            "source": "rt"
        },
        {
            "content": "a good superhero origins story. actually sticks to material at some extent.",
            "review_date": "2018-03-09",
            "source": "rt"
        },
        {
            "content": "BATMAN BEGINS IS WHERE DC TOOK THEIR STEP FORWARD, BY ADDING AN ECCENTRIC cHRISTOPHER nOLAN  INTO THE DIRECTOR SEAT AND HAVING cHRISTIAN bALE PORTRAY OUR QUINT-ESSENTIAL SUPERHERO IN A MOVIE, RIDDLED WITH BRILLIANT ACTION, AWESOME VISUALS AND UNIQUE MOMENTS. oNLY PROBLEM, IT DOES DRAG ON QUITE A BIT.",
            "review_date": "2018-03-07",
            "source": "rt"
        },
        {
            "content": "I don't really like the Nolan Batman trilogy, but this is the one I dislike the least.  In fact, I kind of like it, even though I'm still kind of annoyed by it.  It's the one that's most atmospheric in tone, and the realistic tone of the latter films is one aesthetic touch I really dislike.  Cillian Murphy's Scarecrow is the best villain in this series ... it's just too bad we get so little of him and so much Ra's Al Ghul, the least interesting villain in the series.  (Doesn't that name seem to be referring to an Al Ghul that belongs to Ra?)  This one has the disadvantage of spending over an hour without Batman even appearing for the first time.  Superhero origin films are really dreary.  The Batman suit in these films is appallingly ugly.",
            "review_date": "2018-02-28",
            "source": "rt"
        },
        {
            "content": "Batman begins is a solid first entry into the trilogy. The villain is pretty weak, and the story takes a while to get going, but Nolan nails the mature tone Batman was always supposed to have and Christian Bale gives a great performance too. While past Batman movies more just foucesed on Batman fighting bad guys Batman Begins dives into Bruce Wayne’s intentions and reasonings for becoming Batman. This allowed the viewer to get more of a backstory on Batman and deepened my enjoyment of the film. Overall, Batman Begins is a great start to the trilogy and does a great job taking a mature approach of telling the backstory of Batman.",
            "review_date": "2018-02-25",
            "source": "rt"
        },
        {
            "content": "A very strong beginning to the Dark Knight trilogy. Christian Bale does a real good job portraying his character of Bruce Wayne/ Batman. It has a lot of excitement and really adds some depth to this character. I don't have any huge complaints. Parts of it were slow and the villains here are average. They aren't bad, but not great either. It is overall a very solid start",
            "review_date": "2018-02-21",
            "source": "rt"
        },
        {
            "content": "Very refreshing take on Batman after Joel Schumacher.",
            "review_date": "2018-02-20",
            "source": "rt"
        },
        {
            "content": "Probably the best origin film ever made!",
            "review_date": "2018-02-20",
            "source": "rt"
        },
        {
            "content": "This is so Dark, But its a Exciting Flim. its a great start to the Dark knight movies, and smart flim to make",
            "review_date": "2018-02-15",
            "source": "rt"
        },
        {
            "content": "A solid introduction to Nolan's renowned trilogy. \n\nThe origins of the Caped Crusader of Gotham City are finally brought to the big screen in this new adaptation of the perennially popular comic-book series. The young Bruce Wayne (Gus Lewis) leads a privileged life as the son of wealthy, philanthropist parents, both of whom stress their commitment to improving the lives of the citizens of crime-ridden Gotham City. After his mother and father are murdered by a mugger, however, Wayne grows into an impudent young man (Christian Bale), full of rage and bent on retribution. After seven years away from Gotham, Wayne returns, determined to bring peace and safety back to the city. With the help of his faithful manservant, Alfred Pennyworth (Michael Caine), and Lucius Fox (Morgan Freeman), a scientist at his late father's corporation, Wayne develops a secret identity as Batman, a masked fighter for justice.\n\nIn today's present, there's more than a couple reiterations of Batman. Which one's the best one? Well there are certainly better made ones but in the end, that's up to opinions. In my opinion, this is definitely my favorite version of Batman for many different reasons. \n\nOne reason why I love this version of Batman so much is because of the portrayal of Batman. Whether or not you like Christian Bale (which I do), this is certainly the most well-rounded version of Batman that we have today. His portrayal of Bruce Wayne, a billionaire genius who's giving up his reputation in order to keep Batman a hero, is spot on. His physicality and mannerism works great for Batman, a man with strong morals and initiative. His morals and his desires are what makes him human, relatable, and bad-ass. Everything from his suit and his performance, it's all great. \n\nThe overall story is a little ill-paced and messy in this film. It moves around pretty quickly and I feel like it's never really clear where we are in the story. It's pretty sudden and in your face that Bruce Wayne is disappeared training, along with all the characters in the story. The League of Shadows is never a clearly established union and everything else kind of tumbles under that. The story is interesting on its own and Scarecrow is a fantastic, horror-esk villain, but it never keeps up a steady pace. For a film with a long runtime, I feel like it could've been better utilized. \n\nIn the end, this beginning film was a little bit muddled by its pacing and its story elements, but it's still entertaining. It still looks solid for a film shot in 2005 and the action is entertaining, it's just not the best superhero film ever. It's a little convoluted at times, but it's still a great start.",
            "review_date": "2018-02-10",
            "source": "rt"
        },
        {
            "content": "Title: Batman Begins\nStory/Writing/Message/Plot:\t3\nCharacter/Acting:\t\t3\nMusic/Sound:\t\t\t3\nCinematography/Editing:\t2\nAge/Originality:\t\t\t2\nTotal:\t\t\t14/25",
            "review_date": "2018-02-06",
            "source": "rt"
        },
        {
            "content": "..It's not who I am underneath... but what I *do*... that defines me. I Like seeing the story or history that create the Hero, how he got to be good at what he does. This version gave a taste of that. Thank You.",
            "review_date": "2018-02-04",
            "source": "rt"
        },
        {
            "content": "violent but well-done",
            "review_date": "2018-02-04",
            "source": "rt"
        },
        {
            "content": "This slow yet intriguing film sets the stage for two phenomenal sequels in this Batman trilogy that modernized the character of the rich superhero vigilante.",
            "review_date": "2018-02-03",
            "source": "rt"
        },
        {
            "content": "I grew up as a Marvel comics fan. Not because I didn't like DC. I was just to poor to afford reading both. So I know those characters much better. Saying that, this is probably my favorite comic book movie. Not only is the action great, but the story is wonderful.",
            "review_date": "2018-02-02",
            "source": "rt"
        },
        {
            "content": "Uggghhhh sappy garbage.... Batman Forever was better than this... hell Batman and Robin was better than this. At least those were fun this though... is just boring and a sad attempt to turn a bland comic book hero into a serious movie. It can be done but this is not the way.",
            "review_date": "2018-02-02",
            "source": "rt"
        },
        {
            "content": "The first one out of the trilogy is my least favorite. I still liked it. I don’t have much to say about this one. ",
            "review_date": "2018-01-27",
            "source": "rt"
        },
        {
            "content": "The best superhero origin story. Plot moves along at a good pace and Bruce Wayne's gadgets, capes and cowls seem to have a point to why they exist.\nYou'll notice that the third act doesn't end with some hard-to-believe alien attack or city falling from the sky. This movie was made before Marvel's influence was felt on DC characters.",
            "review_date": "2018-01-27",
            "source": "rt"
        },
        {
            "content": "Good restart to the Batman saga, but the worst one Nolan made.",
            "review_date": "2018-01-19",
            "source": "rt"
        },
        {
            "content": "Amazing. Breathtaking. A movie that keeps you on the edge of your seat the entire time. I didn’t grow up reading the Batman comics nor have I seen any other Batman movie, but this series is what defines Batman for me. The cast was simply outstanding. I seriously loved each character. I loved the darkness, I loved the bad guys, I loved how Bruce could just do whatever he wanted with all the money he had, and I just loved the weapons and the car and the gadgets. And if that was not enough, the music will blow you away as well. Plus the way they set it up for the Joker in the second movie? I’m watching it right away!",
            "review_date": "2018-01-13",
            "source": "rt"
        },
        {
            "content": "Batman begins I would consider an origin story of how he became Batman and why he did save people it is a good movie",
            "review_date": "2018-01-09",
            "source": "rt"
        },
        {
            "content": "Nolan directs the definitive Batman, this is a superb relaunch of this new Dark Knight trilogy that sets the Batman standard and will likely be unsurpassed.  Christian Bale is the best Batman to come on to the screen, and this is the first batman movie to come the closest to getting Batman right. This is an engrossing film with great action, and great affects and a great evil scheme. Nolan has placed a great stamp on the Batman franchise, Morgan Freeman, adds a great character and there is a good story to go with it. The movie is filmed in Chicago, so great choice of location, and the city is transformed into Gotham city in a very effective way. This is the beginning of what may be an outstanding series.",
            "review_date": "2018-01-04",
            "source": "rt"
        },
        {
            "content": "The second best of the Dark Knight trilogy. The best Batman origin story to date.",
            "review_date": "2018-01-01",
            "source": "rt"
        },
        {
            "content": "Batman Begins is an excellent movie about how Batman became Batman with an amazing story and great performances. Christopher Nolan makes a perfect beginning to a phenomenal superhero series and gives the audience an exciting and definitive movie!",
            "review_date": "2017-12-31",
            "source": "rt"
        },
        {
            "content": "The most true to Batman of all the Nolan films.",
            "review_date": "2017-12-28",
            "source": "rt"
        },
        {
            "content": "Still the best Batman film to date.Some might argue The Dark Knight is better and in many ways it is. However I've always found this the more interesting film to rewatch.",
            "review_date": "2017-12-27",
            "source": "rt"
        },
        {
            "content": "This is the gold standard of Batman reboots. Christopher Nolan's magnum opus. Inception and Interstellar are, in fact, child's play compared to this storytelling. It is a subtle victory when a film brings you on a satisfying character journey. If you're looking for a great superhero film then look no further than what is directly in front of you. Maybe my favorite superhero film. Stellar filmmaking execution at its finest. Batman's actions speak louder than words and this film speaks at 24 frames per second.",
            "review_date": "2017-12-23",
            "source": "rt"
        },
        {
            "content": "Great reboot of Batman after the terrible Batman & Robin. Great casting, story and feel. Really cool suit and action scenes. Solid moments of humour throughout.",
            "review_date": "2017-12-22",
            "source": "rt"
        },
        {
            "content": "A brilliant take on Batman that forever changes the comic book genre and gives it a weight and importance it never had before. It's a real movie. A great movie. It just happens to be about Batman.",
            "review_date": "2017-12-20",
            "source": "rt"
        },
        {
            "content": "Best Batman movie since Batman Returns. Also the big comeback of Batman after the disappointing movie of Batman & Robin. This tells us Batman's origins and it was great. This is an awesome start to the Dark Knight Trilogy.",
            "review_date": "2017-12-18",
            "source": "rt"
        },
        {
            "content": "Puntaje Original: 7.5\n\nOscura y épica, con una gran historia y complejos personajes.",
            "review_date": "2017-12-17",
            "source": "rt"
        },
        {
            "content": "Batman Begins is an origin story that enjoys being a origin story. Like here's a good movie about a guy who becomes a superhero instead of it being a superhero movie that has the origins crammed into the first 45 minutes then rushing to the boss fight in the last 45 minutes. Ra's Al Darkman rescues some American Psycho from prison so he can go to a house full of ninjas and get trained by the only other white guy for hundreds of miles. After he burns down the ninja house Bruce Wayne goes back to Gotham where he enlists two old Academy Award winners and some young cop who was only nominated for an Academy Award, so he can go all Patrick Bateman on the Scarecrow for drugging his plain Jane underdeveloped lady friend, that you won't realize has been replaced until halfway through the sequel by a different blank faced lady.",
            "review_date": "2017-12-06",
            "source": "rt"
        },
        {
            "content": "Great superhero movie.",
            "review_date": "2017-12-03",
            "source": "rt"
        },
        {
            "content": "An exciting start for the perfect batman trilogy.",
            "review_date": "2017-11-28",
            "source": "rt"
        },
        {
            "content": "Despite the incredulous exceptionalism of the Wayne family’s philanthropic exploits, Batman Begins remains in my book as the best superhero origins film.",
            "review_date": "2017-11-27",
            "source": "rt"
        },
        {
            "content": "A great origins movie. It tells perfectly how Bruce becomes Batman and his training with Rash's Al Ghul. Also, Liam Neeson played a very good role on this character and Jonathan Crane (Scarecrow) wasn't bad at all, but could've been better.",
            "review_date": "2017-11-26",
            "source": "rt"
        },
        {
            "content": "A dark and realistic take on Batman that I love.",
            "review_date": "2017-11-25",
            "source": "rt"
        },
        {
            "content": "Batman Begins is a well told story of the origin of Bruce Wayne/Batman (Christian Bale). It covers a lot of the same ground as Michael Keaton's original Batman, but goes much further in depth in many factors of his creation. It goes into great detail about subjects such as how he got his costume, what exactly it is. Same goes with the Batmobile. We also find out why he chose to be bat-like.\n\nOne of the more interesting aspects here is how it shows Bruce's father, Thomas Wayne (Linus Roache), and how he molded Bruce's life and instilled good judgment within him, a point which is misunderstood about him by most people he comes in contact with. Thomas, too, teaches Bruce valuable lesson, such as \"We fall so we can learn to pick ourselves up\". This is pretty close to the theme of the movie or motto Bruce Wayne lives by. The resemblance of the father & son is pretty good, too.\n\nI also thoroughly enjoyed the training Bruce Wayne endured becoming \"invincible\". Bruce is trained by Ducard (Liam Neeson) in many ways like a ninja (The concept of Batman IS similar to a ninja). He is taught many valuable lessons in this temple and is shown no mercy. Eventually, we even see his first real enemy as a superhero/vigilante.\n\nAlthough I am not positive as to how true to the comic book this movie is, I am sure it took a few liberties, as did Spider-Man. Most of the small examples I have noticed are for the better and make for a good story. The Batmobile is more believable as an expensive armored vehicle that the military would not spend the money on than a juiced up Corvette (or whatever that was). Same with the Batsuit.\n\nKatie Holmes is excellent as Rachel Dawes, a D.A. who is not afraid to go after the big villains in court. Also worthy of mentioning is Michael Caine as Alfred the butler. I do not believe they could have found a better man for that role, although I could not get the image of Caine as Austin Powers' dad out of my head when he was on screen.\n\nFinally, in my opinion, Christian Bale makes a much better Batman than the three recent previous ones in Michael Keaton, Val Kilmer and George Clooney. Something about him makes Batman darker and more mysterious. Hopefully, DC Comics and movies have learned from their mistakes and we will not have to worry about Batman picking up a sidekick in this newest installment of the Batman series. 9/10Christopher Nolan (and cast) have pulled off what I hadn't dared to dream - a Batman every bit as good as Burton/Keaton's vision - and eradicated the camp, feverish memories of Clooney, Kilmer and (cough..) O'Donnell.\n\nThe story is as good an origin story as you'll find - covering all the major (true-to-the-comic) events, and not wasting ages on them. We see Wayne's all-important training period (previously ignored), and his connection to the Tibetan shadow-ninja clan led by Ra's Al Ghul. We see Bruce come up with ideas for his symbol, his costume, his gadgets, his car, his cave - IT ALL FITS SO PERFECTLY.\n\nThat's not all - Liam Neeson is perfect (as ever, when Lucas isn't writing his lines), Batman's first mad nemesis (the Scarecrow) is genuinely frightening; with some outstandingly scary 'fear' effects.. Gary Oldman looks just like a young Commissioner Gordon (and doesn't dominate), Morgan Freeman and Rutger Hauer give solid heavyweight support to the boardroom machinations at Wayne Enterprizes. I love Michael Gough(?) but Michael Caine is great as Alfred. It's only Katie Holmes who didn't ring true for me - not because of her performance, but simply because she looks all of 15 years old (sorry Katie). I am always blown away by Christian Bale, and this is no exception.\n\nThe fights are great, the Bat-gadgets all there, the car is amazing, the plot is thorough and exciting, Gotham looks great, Batman really is frightening & menacing (and lethal!).. And the scenes with the bats themselves FINALLY get across the idea of how scary they can be.\n\nThere is some humour, but it's fairly dry. The soundtrack, like all the best original soundtracks, is excellent - you hardly know it's there, but the emotions of the scene are enhanced and boosted. For the most part this is a serious Batman film, with plenty for long-time fans. This NEW Batman is one I'd like to see again. Bravo Mr Nolan, bravo.Finally, after the previous 2 outings of the caped crusader, the Batman franchise is back on track. Having been a big comic collector over the years and a long time fan of the Dark Knight, I was especially disappointed by 'Forever' and 'Batman and Robin'. To me, these film lost the essence of what drives Bruce Wayne to do what he does and turned Batman into more of a pop star than misunderstood hero.\n\nThankfully though, Nolan has gone back to the roots of the character, portraying a confused and angry Bruce Wayne, who ultimately rises to become Gotham's greatest champion. Don't expect to see loads of shots of Batman in this film though. It is the story of Wayne and focuses mainly on his years of training and preparation for becoming Batman. You are almost teased throughout the first half of the movie, waiting to see the excellent Christian Bale in the costume, as it keeps holding back to keep you in anticipation. When Batman does finally turn up on screen, it is well worth the wait. In my opinion, Bale was born for this role and for the first time when watching a Batman film, I enjoyed the scenes of Wayne being Wayne as much as Wayne being Batman.\n\nOne of the strongest features of the film, is the way that it manges to suck you in believe that a 'Batman' could be a reality one day. The technology is current, with no use of silly OTT weapons and gadgets, again making the film work by today's standards. Plus, we are not allowed to forget that Batman is still just a man under the costume and there are times when he gets a bit of a kicking and shows that he can be vulnerable too, something we sometimes forget when watching a superhero flick. Gone too, are the silly villains!!! Jack Nicholson was the perfect Joker but from there it went downhill. Thankfully, in this movie the bad guys are actually fairly 'normal' and manage to be menacing at the same time.\n\nWhich finally brings me to the cast. I always had high expectations for this film when the cast was announced. Let's face it, what a line up! Christian Bale, Michael Caine, Morgan Freeman, Gary Oldman, Liam Neeson, Katy Holmes, Ken Watanabe and Tom Wilkinson are not to be sniffed at. Even an old favourite of mine makes an appearance: Rutger Hauer! Awesome. Actors of this calibre would never have gotten involved in this project if they didn't have faith in Christoper Nolan's talents and thankfully they took the leap...\n\nFor the comic book fans out there, waiting to see this movie, let me assure you that you won't be upset. Imagine the darkness of the 'A Death In The Family' and the 'Year One' story lines. I have never met a fan of Batman who didn't love these books. Well, this is the kind of Batman you can expect from Bale: Dark, brooding and tortured by his past, yet the hero we have come to love. For those of you who are not comic fans, then just look forward to seeing how Batman should be. This film is a credit to Bob Kane's original vision and a testament to all the talented artists and writers who keep the legend of the Dark Knight alive in the comic books today....\n\nThank you Mr. Nolan and thank you Mr. Bale. In fact thanks to everyone who worked on this film. Batman finally Begins from here....\nIt sickened me in the past to see the Batman movie franchise slowly digging it's way to an early grave. After the quality Tim Burton films, the series pretty much went down the toilet, beginning a horrifically campy age of 'Bat credit-cards' and an armored Arnold Schwarzenegger tossing cringe-worthy puns at a Batman who seemed to be trying not to be embarrassed by the fact that his costume had nipples. So what could Warner Brothers producers hope to do to resurrect the franchise? Pretend it never happened, and start the whole series over again with a talented director, compelling story and capable cast. \n\nEnter Christopher Nolan, the mastermind behind 2000's 'Momento', widely praised as one of the most innovative films of the decade. As director/co- screenwriter, Nolan creates a richly dark, atmospheric world for Batman to inhabit, similar to that of the Burton films, but less cartoony. The film's screenplay, written by Nolan and David S. Goyer is quality stuff, it's true that some of the dialog exchanges can seem kind of contrived, particularly between Wayne and Liam Neeson's character, Ducard, but it sounds so classy you tend not to care. \n\nNolan also puts a lot of trust in his audiences to stay put while the first hour of the film comprehensively explores Bruce Wayne's backstory, with no cape donning and few fight sequences. Nevertheless, the pace never slows, and the story is so unexpected and fascinating (who would have expected a Batman film to begin in a prison in Tibet? only Nolan could pull it off!) there's little chance of us losing interest. And this way, we really get a sense of who Bruce Wayne is, a trait none of the past movies were able to capture, including the Burton films. We see what drives him, what leads him to become this iconic crime fighter, and the reasoning behind the mask.\n\nOf course, to help the audience get under Bruce Wayne's skin, it doesn't hurt to have such a talented lead as Christian Bale. Bale has been emerging as one of the most talented actors of his generation, and he brings that talent to a peak here, playing the darkest of all superheroes. If you were to break down the role of Batman/Bruce Wayne, you would find that it is essentially three characters: Wayne as Batman, behind the mask; Wayne's public facade as the billionaire playboy; and the real, brooding Bruce Wayne. Bale plays all three of the characters to absolute perfection, and molds them together well enough to make it clear to show they are still the same person. He has been given tons of accolades for his performance already, and needless to say, he deserves every one.\n\nAnd the sheer quality of the supporting cast is mind-boggling, if for the number of big names only. It's very hard to find a weak spot in the incredibly strong array of performances here, but if one had to be found, it would have to be Katie Holmes. It's not that she gives a bad performance, on the contrary, but just she seems too young to be convincing as a district attorney. For me, Michael Gough will always be the definitive Alfred, but Michael Caine does an excellent job of taking over the role, giving a very strong (and often funny) performance. Liam Neeson is sheer class as Ducard, Wayne's mysterious mentor, as is Morgan Freeman as Lucius Fox, Wayne's arms manufacturer and provider of the Batman gear. It's wonderful to see the incredibly talented and much underrated Gary Oldman as Sgt. Gordon, the only decent cop in Gotham, and he truly makes the role his own. Even cult favorite Rutger Hauer makes an appearance as Richard Earle, the ambitious head of Wayne Enterprises. And (surprise surprise!) the villains are also actually menacing for once, as opposed to cartoony and corny. Cillian Murphy just about walks away with the show as the truly chilling Scarecrow (the sequences involving his 'fear gas' are surprisingly frightening) Ken Watanabe is mysterious and creepy as guild leader Ra's Al Ghul and Tom Wilkinson is very convincing as Carmine Falcone, head of the Gotham city mob. \n\nNolan's knack for realism also comes as a breath of fresh air in this age of CGI bloated blockbusters - there are next to no computer generated shots in the movie, even a sequence with Batman standing on top of a high building staring down at the city was filmed with a stuntman. And it really works, the Batmobile actually interacts with it's environment, and looks so much better real than computer generated. But don't think that the film will come across as too serious and stuffy because of Nolan's realism - true, Gotham seems too dark and dirty to come across as a fantasy world, but Batman Begins retains that unmistakable sense of fun that seems to only be present in comic book movies. We jeer and fear the villains, and cheer the hero as he lays his life on the line to vanquish evil and save the city. And that is how it should be. There's even a surprising twist near the end, which is doubly surprising because it actually comes as a shock. What's not to love here?\n\n(and, further cudos to director Nolan for finally managing to make a swarm of bats actually frightening for once)\n\nOverall, I'd have to label Batman Begins 'The must see movie of the summer' - it's a well written, authoritatively directed, impeccably acted (especially by Bale's powerhouse lead performance and Cillian Murphy's sickly menacing Scarecrow) and very high quality production. Indeed, most other summer blockbusters could learn a thing or two from Batman Begins. If the Batman franchise died under it's own gaudiness years ago, let us rejoice this glorious rebirth - Batman truly does begin here.",
            "review_date": "2017-11-24",
            "source": "rt"
        },
        {
            "content": "I'm not wearing hockey pads",
            "review_date": "2017-11-23",
            "source": "rt"
        },
        {
            "content": "One of the best frigging movies of all time. A great story that will forever change the way I look at superheroes. It's a great film that was a game changer when it comes to comic book movies.",
            "review_date": "2017-11-22",
            "source": "rt"
        },
        {
            "content": "Was utterly blow away by this film when I first seen it on opening day in 2005, great film. It still holds up incredibly well. While I loved Memento and liked Insomnia a lot too I didn't know what to think when I heard Chris Nolan would e doing a new Batman movie. Almost as soon as I seen the first trailer I was intrigued and from the moment I sat down to watch it my fears were squashed. Best superhero origin movie ever, even to this day.",
            "review_date": "2017-11-21",
            "source": "rt"
        },
        {
            "content": "Thrilling with doses of disengagement.",
            "review_date": "2017-11-19",
            "source": "rt"
        }
    ]
}