{
    "rating": 2.1,
    "release_date": "2005-02-04",
    "num_reviews": 30,
    "genres": [
        "Horror",
        "Mystery&thriller"
    ],
    "summary": "As a young boy, Tim (Aaron Murphy) witnesses the horrifying event of his father (Charles Mesure) being dragged away by the boogeyman. Despite the reassurances of his mother (Lucy Lawless) that the boogeyman is not real, he is never the same afterward. Years later, Tim (Barry Watson) manages to create a normal life for himself -- though he lives without closets and keeps his mattress on the floor. But when he learns of his mother's death, Tim must return home to face his childhood trauma.",
    "reviews": [
        {
            "content": "It could have been a great psychological thriller but it's bogged down by mediocre writing and terrible CGI at the end",
            "review_date": "2022-10-15",
            "source": "rt"
        },
        {
            "content": "I liked it! It is rather low in production value, but there are some nice ideas and good horror in it!",
            "review_date": "2022-05-16",
            "source": "rt"
        },
        {
            "content": "Wow. I'm so glad I didn't read the reviews before watching this movie, or I would not have even bothered to watch. I actually thought it was pretty good. I've seen all the clichés that horror movies have to offer - the shadowy figure in the background or running past in the foreground, and of course Boogeyman had those things. But there are some truly bizarre and unexpected things, (SPOILER)\nsuch as Tim going into a wardrobe in a motel and then coming out of the haunted one in his bedroom in the old house, two seconds later. I liked the special effects too, even if it was a rollercoaster ride of CGI madness. The boogeyman didn't look too much the same all the time; it morphed and raced around enough to deceive and confuse the eye. I also liked Barry Watson as Tim. He gave a sensitive performance, reacting to his demon tormentor as any ordinary person would, vulnerable and terrified, yet forcing himself to be brave to try and protect his friends.\nI don't watch horror movies for violence. I like monsters. This movie delivered that, for me.",
            "review_date": "2022-05-05",
            "source": "rt"
        },
        {
            "content": "So much POTENTIAL!! But it decides to waste it entirely on some cheep thrills and lazy writing. Way-to go. Although I do have a sore spot for that mid 2000s asthetic.",
            "review_date": "2022-01-07",
            "source": "rt"
        },
        {
            "content": "It's not the best supernatural movie, but it's not bad either.  The Boogeyman cannot get you in daylight but he relentlessly chases after you at night or when you have no light anywhere!!!",
            "review_date": "2021-12-29",
            "source": "rt"
        },
        {
            "content": "Thought this was going to be better due to the title, oh no",
            "review_date": "2021-06-04",
            "source": "rt"
        },
        {
            "content": "Your typical B+ horror movie. A good scary movie for little kids who believe in the Boogeyman. For adults, your typical run of the mill horror films.",
            "review_date": "2021-01-19",
            "source": "rt"
        },
        {
            "content": "I wish I could give this a 0 but unfortunately I can't.\nCan't believe I wasted my time watching this movie.\nTh movie makes absolutely zero sense. The plot could be good but the director did a terrible job with it. There where no jump scares or any scary scenes for a matter of fact. There was a ton of frantic waving of the camera and a bunch of random and pointless teleportations.\nIt should be reclassified as a kids film and be used as motivation for overcoming your fears. But labelling it as a horror movie is just doing injustice to all the great horror movies and the hole horror film genre. I think any horror film enthusiasts would agree that this is just pure disrespectful.\nPlease for the love of life don't waste your time watching this movie.",
            "review_date": "2020-09-06",
            "source": "rt"
        },
        {
            "content": "There is not one single new idea in the entire film, nor is there much of a script.",
            "review_date": "2020-06-26",
            "source": "rt"
        },
        {
            "content": "Good spooky effects, good jump scares but we watched the deleted scenes and many should have been left in for storyline and good scares. Main problem? No background or storyline on what the Boogeyman is, why he strikes, just left me let down scratching my head",
            "review_date": "2020-05-03",
            "source": "rt"
        },
        {
            "content": "I had to watch this several times before I got what it was about. Not because it was confusing but because the plot meandered and gave us cheap jump scares and nothing else. My interest waned many times and I tuned out. If I watched it again it would be like watching an all new movie.",
            "review_date": "2020-02-10",
            "source": "rt"
        },
        {
            "content": "The boogeyman is a good movie everybody should watch it",
            "review_date": "2019-10-01",
            "source": "rt"
        },
        {
            "content": "Hmm...was this suppose to be scary?\n\n",
            "review_date": "2019-08-24",
            "source": "rt"
        },
        {
            "content": "I didn't really understand the meaning of this movie because it doesn't have it, the scenes don't make sense until the end and anyway they don't buy much, the film is weird and inconsistent because everyone sees this monster but to defeat it our protagonist had to destroy a series  of suggestions that made him imagine as a child and this does not make much sense, another nonsense thing is that the monster kidnaps children but in the end he just wants to take the protagonist",
            "review_date": "2019-08-02",
            "source": "rt"
        },
        {
            "content": "lost my erection immediately",
            "review_date": "2019-04-27",
            "source": "rt"
        },
        {
            "content": "Despite being visually appealing from time to time, \"Boogeyman\" fails to deliver anything to its genre and doesn't even lives up to the lowest expectations.",
            "review_date": "2018-09-11",
            "source": "rt"
        },
        {
            "content": "Cool movie that really freaked me out, i was trying to watch the 1980 boogeyman but i saw this instead",
            "review_date": "2017-12-30",
            "source": "rt"
        },
        {
            "content": "it's okay the sequels are better though",
            "review_date": "2016-11-23",
            "source": "rt"
        },
        {
            "content": "Not really scary at all. The director uses his camera in an attempt to fill in the holes left by a vacant narrative. There's not much story here other than a man tries to face his fears after an encounter with the boogeyman when he was young leaves him traumatized, he does this by revisiting his old home after his mother dies. It almost feels like the movie makers here realize that they haven't got much to work with so they try to create what tension, and scares, they can by having people walk around really slowly, and reaching for door knobs really slowly, until the ultimate final confrontation with a terrible looking CGI boogeyman. Watch once, and forget about it.",
            "review_date": "2016-11-01",
            "source": "rt"
        },
        {
            "content": "Boogeyman sets up the spooky atmosphere with a classic haunted-house setting and psychological tension, but if you're looking for a definitive study of our culture's paranoia with the self-titled enigma, there's plenty of superior alternatives.",
            "review_date": "2016-10-30",
            "source": "rt"
        },
        {
            "content": "Em algum momento parece que vai ficar interessante, mas... não.",
            "review_date": "2016-09-28",
            "source": "rt"
        },
        {
            "content": "The concept is creepy, but the deliverance is not there. Lacked originality, and there were only one creepy scene. The rest was boring. Weak performances and no suspense.",
            "review_date": "2016-06-10",
            "source": "rt"
        },
        {
            "content": "Am I the only one who thinks that Barry Watson looks like Skeet Ulrich/Billy Loomis from Scream in this movie? I know that this movie has a generic, unoriginal storyline, and  it wont have you wanting to see it five more times, but someone had to make a movie about it. And hey, at least it wasn't The Apparition. \nBottom line is, I liked this movie! There I said it. ð~",
            "review_date": "2016-04-17",
            "source": "rt"
        },
        {
            "content": "Not too bad but terribly cliche. Has some weird directorial decisions like messy jump cuts and some unneccessarily long sequences. \n\nIf you're looking for a scary movie from the early 2000s, I suggest Wrong Turn, Jeepers Creepers or Texas Chainsaw Massacre. They're scarier than this.",
            "review_date": "2015-11-16",
            "source": "rt"
        },
        {
            "content": "The horror is with the viewer having to watch this crap.",
            "review_date": "2015-08-10",
            "source": "rt"
        },
        {
            "content": "Boogeyman is not remotely scary. Like, AT ALL. The scares are loud and obnoxiously filmed with a shaky camera.",
            "review_date": "2015-06-22",
            "source": "rt"
        },
        {
            "content": "Although it's been so long since I watched it, i do remember walking out, which I rarely do.",
            "review_date": "2015-03-08",
            "source": "rt"
        },
        {
            "content": "This film is just beyond stupidity and it is really pitiful to watch",
            "review_date": "2015-02-20",
            "source": "rt"
        },
        {
            "content": "Okay.  Not particularly good, but not terrible either.  This film is just kind of confusing at times.",
            "review_date": "2015-02-03",
            "source": "rt"
        },
        {
            "content": "Muy buena movie!!! Se nota que si se puede hacer pelis de miedo aunque no tengas un gran presupuesto.",
            "review_date": "2015-01-27",
            "source": "rt"
        }
    ]
}