{
    "rating": 8.2,
    "release_date": "2005-12-09",
    "num_reviews": 190,
    "genres": [
        "Romance",
        "Drama",
        "Lgbtq+"
    ],
    "summary": "In 1963, rodeo cowboy Jack Twist (Jake Gyllenhaal) and ranch hand Ennis Del Mar (Heath Ledger) are hired by rancher Joe Aguirre (Randy Quaid) as sheep herders in Wyoming. One night on Brokeback Mountain, Jack makes a drunken pass at Ennis that is eventually reciprocated. Though Ennis marries his longtime sweetheart, Alma (Michelle Williams), and Jack marries a fellow rodeo rider (Anne Hathaway), the two men keep up their tortured and sporadic affair over the course of 20 years.",
    "reviews": [
        {
            "content": "It seems like the movie had a clear agenda, but despite this, it was extremely entertaining.",
            "review_date": "2023-04-24",
            "source": "rt"
        },
        {
            "content": "Ah, Brokeback Mountain. Been wanting to review this for a long time. It is not only a good movie, it is not only queer, it does not only have Jake fucking Gyllenhaal, it is the best movie. It has a flawless plot, flawless actors, flawless soundtrack, and everything is so good and perfect everyone should watch this movie it is the ideal form of media lets start a cult",
            "review_date": "2023-03-31",
            "source": "rt"
        },
        {
            "content": "I cried so hard. I love this movie.",
            "review_date": "2023-02-09",
            "source": "rt"
        },
        {
            "content": "Most depressing movie I have ever seen.  I'm a gay may and found this typical.  Gay men can't find happiness?  GOD'S OWN COUNTRY is way better.",
            "review_date": "2023-01-27",
            "source": "rt"
        },
        {
            "content": "This isn't typically my kind of movie with the subject matter that it explored and it did feel pretty slow at certain times, however it was still made with quality and was well acted by everyone. The death of Jack was handled very powerfully with how it cut over to the guys beating him and the ending in Ennis's trailer was quite powerful as well given the two main characters' relationship. It got much better when there was more interpersonal drama within their own families when they were separated as well as when they were together that last time too. This movie, while slightly flawed, shows how powerful bonds of romance and love can be between anybody in life!",
            "review_date": "2023-01-15",
            "source": "rt"
        },
        {
            "content": "It is a very beautiful film with great drama and romance. The biggest issue with the movie is the first 30 minutes being incredibly slow with no context. It can make it very hard to watch for a first viewing but in retrospect it is one of the better parts of the film.",
            "review_date": "2023-01-12",
            "source": "rt"
        },
        {
            "content": "Simply superb.  One of the best movies of the past 20 years.  Extremely powerful on many emotional levels.  Superbly acted.",
            "review_date": "2023-01-10",
            "source": "rt"
        },
        {
            "content": "I was crying and talking like a cowboy at the end of this movie.",
            "review_date": "2023-01-04",
            "source": "rt"
        },
        {
            "content": "This is one of the most important movies in the history of film and it lived up to all the expectations. Brokeback Mountain is the kinda movie that tells a story, that hasnt been tolded in any shape or form before, because it couldnt be told before. Brokeback Mountain leans on the performances in the movie and they are one of the best of all time. The relationship between Heath Ledger and Jake Gyllenhaal their characters are the best thing of the movie, without them the movie would not have been so powerful in any shape or form. Michelle Williams is so good in this movie as well and with those 3 performances, you have an incredible ansemble. The message of this movie is, still nowadays, one that isnt naturally speaking in a lot of countries and cultures and that after more then 17 years that this movie came out. The nature is a charater on its own in this movie, Brokeback Mountain feels like the only place where everyone truly is happy with their life, but a place you cant stay for a long time to truly get happy. The screenplay of this movie is fenemonal, the cinematography is raw and beautiful and the editing is to perfection. Brokeback Mountain hit me good and will hit me for a long time to go.",
            "review_date": "2023-01-03",
            "source": "rt"
        },
        {
            "content": "Sinceramente, este filme é espetacular! A atuação de Jake Gyllenhaal e principalmente a de Heath Ledger são impecáveis. Confesso que não assisto muitos filmes de romance, mas este, este drama/romance me fez repensar bem sobre esses gêneros. A direção do cineasta Ang Lee diz muito sobre o sucesso que o filme tem.",
            "review_date": "2022-12-22",
            "source": "rt"
        },
        {
            "content": "Absolutely wonderful, but heartbreaking movie. A truly superb movie with a musical score approaching perfection. To this day, I cannot hear the music without tearing up. Hedger and Gyllenhaal give award-winning performances and Ang Lee richly deserves his Academy Award as did the musical score. The state of Wyoming owes an award to the cinematographer for showing the state at its most appealing. A terrific love story not to be missed regardless of your sexual orientation.",
            "review_date": "2022-11-28",
            "source": "rt"
        },
        {
            "content": "The best movie ever made! With the best acting ever by an ensemble, including the best acting performances from Heath Ledger and Jake Gyllenhaal! Plus, the best directing from Ang Lee! Also, the best movie screenplay ever adapted! As well as the best movie score ever composed! Not to mention the best movie song ever sung: A Love That Will Never Grow Old! And the best cinematography ever done in a movie!",
            "review_date": "2022-11-26",
            "source": "rt"
        },
        {
            "content": "Anne Hathaway deserves an Oscar for the phone call scene",
            "review_date": "2022-11-14",
            "source": "rt"
        },
        {
            "content": "One of the most beautiful films of all time. A once in a lifetime experience",
            "review_date": "2022-10-14",
            "source": "rt"
        },
        {
            "content": "A classic. Top-notch casting. Heartbreaking story.",
            "review_date": "2022-10-10",
            "source": "rt"
        },
        {
            "content": "So much has already been said about this film, the performances, Jake & Heath of course, the story, direction, cinematography, etc... But to me, the full impact of heartbreak & devastation is revealed by Michelle Williams' character, Alma. A genius literary work & a celluloid classic.",
            "review_date": "2022-09-29",
            "source": "rt"
        },
        {
            "content": "This is a beautiful movie",
            "review_date": "2022-09-17",
            "source": "rt"
        },
        {
            "content": "Emocionante do início ao fim!",
            "review_date": "2022-09-13",
            "source": "rt"
        },
        {
            "content": "This film is achingly beautiful.  The acting from Ledger, Gyllenhaall, Williams and Hathaway is inspired.  Added to this, the wonderful cinematography from Ang Lee.  After watching this movie, I felt like I had been given a gut punch.  It is deeply moving.",
            "review_date": "2022-09-11",
            "source": "rt"
        },
        {
            "content": "Very touching yet heartbreaking.\nBeautiful love story and give us a closer look at the queer scene at that time.",
            "review_date": "2022-09-04",
            "source": "rt"
        },
        {
            "content": "First time watching, thought it was an enjoyable story that was impactful",
            "review_date": "2022-08-25",
            "source": "rt"
        },
        {
            "content": "One of the most important movies to ever be made.",
            "review_date": "2022-08-21",
            "source": "rt"
        },
        {
            "content": "Brokeback Mountain was, hands down, the best film I've ever watched. I had the esteemed privilege of seeing Jake Gyllenhaal and Heath Ledger's ass cheeks. The realism was outstanding. This film was truly a game changing movie for me. I saw it with my friends after one too many shots of tequila and then I re-watched it with a hang over the next morning. I nearly cried at the end when Ennis was aggressively sniffing Jack \"Nasty\" Twist's jacket. Brokeback Mountain has one of my favorite lines in any film I've watched: \"You don't go up there to fish\" (Alma Beers 2005).",
            "review_date": "2022-08-12",
            "source": "rt"
        },
        {
            "content": "Rarely is a love story presented with such tenderness, warts and all. It simply lays out the plot and allows the characters to grow without rushing. The movie contains several incredibly moving moments, particularly those involving Ennis's relationship with his wife and daughters. I keep thinking about certain parts of that relationship over and over. It's beautifully balanced, and the conclusion is executed flawlessly. Heath Ledger is as intelligent as many claim.",
            "review_date": "2022-08-06",
            "source": "rt"
        },
        {
            "content": "Not just one of the best LGBTQ+ stories in film, but outright one of the best love stories in film. I'm still upset many people don't recognize how great this film is because it's the \"gay cowboy movie\". It's phenomenal in every single way.",
            "review_date": "2022-07-14",
            "source": "rt"
        },
        {
            "content": "A great film with superb performances, beautiful writing, and a gentle, simplistic direction that makes this one of the most memorable screen romances",
            "review_date": "2022-07-14",
            "source": "rt"
        },
        {
            "content": "Hay que ser francos y reconocer lo obvio: \"Brokeback Mountain\" (2005) merecía el premio Óscar de Mejor Película y no lo gano (al menos eso opino yo). Si el cautivador elenco encabezado por Heath Ledger y Jake Gyllenhaal no basta, \"Brokeback Mountain\" (2005) también va acompañada de una banda sonora armoniosa de tema country por parte de Gustavo Santaolalla y un aire western hacen de la película algo increíble. Es un drama cómico y romántico que aborda los temas de relación LGBTQ+ con sinceridad y respeto mientras hace un recorrido por las épocas en las que este aspecto aún se veía como un tabú. A la cinematografía y los paisajes los considere bellos y dignos de gozo, por no mencionar las vibrantes actuaciones centrales de Ledger y Gyllenhaal, además el final es muy emotivo. Gran opción para ver en el mes del orgullo gay y por favor no pasen por alto una película tan hermosa.",
            "review_date": "2022-06-26",
            "source": "rt"
        },
        {
            "content": "Incredible acting from Gyllenhall and Ledger is what really makes this movie. The plot sort of just happens but helps to create a beautiful, haunting atmosphere, which is definitely helped by the brilliant score.",
            "review_date": "2022-06-17",
            "source": "rt"
        },
        {
            "content": "Increíble me encanta esta película muy  conmovedora me hubiera gustado un final \nfeliz",
            "review_date": "2022-05-28",
            "source": "rt"
        },
        {
            "content": "Watched it at least 50 times. Great film.",
            "review_date": "2022-05-11",
            "source": "rt"
        },
        {
            "content": "one of the manliest movies i've ever seen",
            "review_date": "2022-05-08",
            "source": "rt"
        },
        {
            "content": "Gorgeous cinematography coupled with a wonderfully tender score made Brokeback Mountain an arresting audio-visual experience. But the film isn't just undeniably cinematic, but also deep and emotionally powerful as well as complex. Its central romance is one that is both grounded in reality and also constituting instantly iconic movie magic. Jake Gyllenhaal was incredible here, but it is Heath Ledger who delivered his career-best, pitch-perfect performance. The minimalist dialogue, subtle exploration of its themes and extraordinary directing from Ang Lee made this movie a masterful exercise at timeless storytelling. Consequently, Brokeback Mountain truly is one of the greatest films of all time.",
            "review_date": "2022-05-07",
            "source": "rt"
        },
        {
            "content": "honestly the best movie of all time when u think about it",
            "review_date": "2022-05-01",
            "source": "rt"
        },
        {
            "content": "The movie has a moving tale to tell to those who are willing to listen. Powerful performances all across the board, \"Brokeback Mountain\" will by the end have moved mountains within your own heart.",
            "review_date": "2022-04-26",
            "source": "rt"
        },
        {
            "content": "I really love this sad story.",
            "review_date": "2022-04-16",
            "source": "rt"
        },
        {
            "content": "WITH \"BROKEBACK MOUNTAIN,\" Ang Lee presents himself as a symbolist, a minimalist, and a lot more.\n\nBased on Annie Proulx's Pulitzer-winning work, \"Brokeback Mountain\" is an apt label for Lee's masterpiece on how the lives of two cowboys—the tight-lipped Ennis del Mar and the rodeo-loving Jack Twist—are made meaningful and even tragic by their summer experience in the wild. In Brokeback Mountain, the two cowboys have their own Walden experience, or epiphanies—something that they will hold on to for the rest of their lives—but that later turns out to be against social conventions, a dilemma to resolve that it makes tragic heroes out of them.\n\nAS A SYMBOLIST, Ang Lee shows so much by concealing many things. Ennis del Mar's restrained affectation for his friend Jack Twist with whom he shares a steamy summer in 1963 predominantly figures in the end as tragedy.\n\nA plethora of symbols prevails in the masterpiece. First, the sheep being tended by the two cowboys are the juxtaposition for Ennis del Mar, one whose restraint and silence seems the most deafening to all the other characters. The meekness of the sheep being tended by the two main characters delineates Ennis' inability to articulate his own preference, living in an otherwise homophobic society. Like the sheep feasted on by the obscure [the unseen social ridicule] wolves, Ennis del Mar confines himself to avoid the stigma from his outward relationship with another man.\n\nSecond, the bloodied clothes—Ennis's long-sleeved shirts and Jack's denim jacket—spells the boys' distinctive bonding. When Ennis finds the clothes in Jack's room after his death—with Jack's denim covering Ennis's shirt—the viewer is told that Jack has indeed nurtured their friendship and union. Towards the end of the movie, after Ennis gets to know of Jack's fate through his wife Lorraine, Ennis's shirt is already covering Jack's clothes. The living already treasures the memory of the dead. Such cinematic contrivance affords us these symbols of male love and concern.\n\nAlso, the movie's title itself spells the polar tendencies and realities of the two main characters. While \"Brokeback\" spells their aggressive, masculine tendencies, \"mountain\" articulates their softer and more feminine sides, as they [get to] love each other.\n\n\"Brokeback\" perhaps sounds contrived as it accounts for the harsh cowboy life that the Ennis and Jack encounter in the Wyoming ranch. The jobs they took on themselves literally \"break\" their backs. Yet, something else in the ranch does other things to them.\n\nOn the other hand, \"mountain\" speaks the providence of nature—in the way the camera portrays nature scenes as real-life postcards of lush vegetation, open fields and pristine panoramas of sky and water.\n\nWhile their ranch work entails \"breaking their backs\" literally, the entire backdrop where they were makes them gentle to themselves.\n\nAS A MINIMALIST, the Asian sensibility of Ang Lee surfaces in the film's sparse dialogues and its use of panoramic postcards-like shots. Lee's camera pans out to the poetic and the restrained.\n\nThe film zooms in on the ‘corked' anger and restraint in Ennis del Mar. Ennis del Mar's interesting character later turns out to be the more repressed, the wayward character who needs more redemption just because he cannot fully articulate himself—he thus becomes the disadvantaged protagonist, he is the tragic hero.\n\nLee's angles delineate well the characters. Ennis del Mar's displays the vacillation of a typical human being. While seeking to desire something else, he chooses to do otherwise. He then suffers greatly from not being able to articulate his feelings and aspirations which can get him something good.\n\nEnnis del Mar sustains his inarticulateness through his murky relations with other characters. While he sustains himself as a father to Alma Jr., ironically he has already contradicted himself when he divorces his wife Alma.\n\nWhile he maintains clandestine relations with his \"fishing\" friend Jack Twist, he suffers greatly from the inability to sustain any sensible one with a serious one. And while Ennis seeks to be conscious of social ridicule all the while—disregarding Jack's suggestion on cohabitation, he eventually suffers from the pain of it all when Jack finally gives it a go, and leaves him all alone.\n\nWhen Jack Twist dies towards the end of the story, the dilemma of the protagonists is never resolved. The film then becomes an elegy for the death of love between two males—which—to society—means the death of the self simply because it cannot be, or can it?\n\nLee presents the audience the widest open spaces for introspection. When he captures the sprawling blue skyline and open waters and streams and fields, he tells them this is how wide the possibilities in the world are—where he lives, where everyone can etch their own notions on morality [or the lack of it].\n\nWith this, Lee presents to the audience the option to etch his own notion of right and wrong, his own sense of morality.\n\nLee presents wide, open spaces as he presents options for the human being to take a stand and articulate his convictions. While Jack Twist freely etches his own spectrum of colors in the open pages of Ennis' life, he is also easy and free to wheeze all these away. But everything he must have done was hinged on self-conviction, despite its not being grounded by the proper sense of right and wrong.\n\nMeanwhile, the driftwood personality of Jack is clear to go against Ennis's sense of self, which later translates to a dilemma that shall challenge him from one moment onwards.\n\nThe film is brimming with binary opposites. And these are made clear when Jack Twist's life rifts from that of Ennis del Mar whose sensibility is all restraint and uncertainty.\n\nNow acclaimed by a number of award-giving bodies, Ang Lee's \"Brokeback Mountain\" will certainly break the back of the moralists, despite the [degree of] sexual liberation prevalent in this country.\n\nThe film featuring boys loving boys is certainly a big \"no-no\"—something scowled upon by traditional social conventions in this only predominantly Catholic country in Asia.\n\nBut as lovelorn boys coming of age, characters Jack Twist and Ennis del Mar might hardly gain the ire of any viewer since they present two sincere characters whose dilemma of pursuing their preferences intersects harshly with social conventions.\n\nTogether they achieve sense of fulfillment—they fly like angels without wings. They become messengers of their own truths, speaking much of the reality that pervades among us.",
            "review_date": "2022-04-16",
            "source": "rt"
        },
        {
            "content": "Everyone has a Brokeback Mountain in their hearts, a dream that will never come true.",
            "review_date": "2022-04-02",
            "source": "rt"
        },
        {
            "content": "I was completely mesmerised by Brokeback Mountain. It is such a beautiful and poignant film, that also benefits from being gorgeously shot and adeptly acted and directed. The film does move slowly of course, but I personally think that Brokeback Mountain was deliberately paced like that(I said very similar things about 2001 and The Godfather too, they are constantly criticised for being boring yet both had their reasons for being paced like that). The slow pacing allowed us to empathise with the characters more, and that paid off, because the characterisations are superb. As are the beautifully written and thought-provoking screenplay and gentle scoring. Ang Lee's direction is the best it's been here I feel, while the cinematography and scenery are simply breathtaking. The acting is excellent. Heath Ledger I think gives his best performance here(sorry Dark Knight fans, I loved him there, but he was beyond amazing here), while Jake Gyllanhaal is very believable, and Michelle Williams is heart-wrenching. Also Brokeback Mountain is quite emotionally affecting, it really makes you think and the sheer beauty of the visuals, acting and story are enough to make me cry, and I was in pieces after the ending. In conclusion, a mesmerising film. 10/10 Bethany Cox",
            "review_date": "2022-04-01",
            "source": "rt"
        },
        {
            "content": "If not for the very slow start, I would have given this a perfect rating. I've never seen such movie that hurt me so much as this does.",
            "review_date": "2022-03-17",
            "source": "rt"
        },
        {
            "content": "It felt very pure and like I was witnessing a unique love-story. A sort of Romeo and Juliet star-crossed lovers whom actually never got to be together. The ending was very emotional and well acted.",
            "review_date": "2022-03-15",
            "source": "rt"
        },
        {
            "content": "Should have been called 'Bareback Mountain'. The plot was not very believable, there were lots of slow, uneventful scenes, and the stupidity of the characters cannot be overstated. For example, the two main characters immediately kissed each other for ~15-20 seconds right in front of the door to the house with the wife inside, who promptly emerged. That and the frequency of outings and lack of talk should have led to some serious questioning and a much sooner divorce. There also wasn't a balance between the two main characters, the children could have played more of a role, and all the fighting was silly. However, the acting was solid, the cinematography and visual effects were pleasant, the sets/props/costumes looked the part, and the soundtrack was catchy.",
            "review_date": "2022-03-01",
            "source": "rt"
        },
        {
            "content": "One the most overrated films in this century. Why it was so interesting or sensational as late as 2005 is simply a mystery, or then maybe not. It shouldn't be provocative to anyone, in any sense, other than for being tedious and dull, but still it got attention as if the sexual liberty movement ending in the 1980's came back to have another bite. Perhaps it was how the positive critical response went hand in hand with some absurdly negative reactions from the Catholic Church and political conservatives, that made a snowball effect. This instantly lead to more media attention, and a debate that just had to grow to a box office success. Many more went to see what the fuzz was all about, and it further became political correct to give it good reviews and ratings, like some kind fashion, no matter what. Speaking of sheep, the issue with men having a romantic and sexual relationship in a film drama, even among cowboyish sheepherders, should really not be any immensly big deal in the new millennium, regardless of what the religious fanatics said. Other than that, the cinematography is nice with picturesque nature scenes combined with quite good acting performances, including innocent sex scenes and long sequences with no dialogue, generally nothing more than an average TV drama. Controversial? Absolutely not!",
            "review_date": "2022-01-22",
            "source": "rt"
        },
        {
            "content": "Brokeback Mountain (2005), directed by Ang Lee. (95/100)\n\nBrokeback Mountain is a movie that tells the story of two men in their 20s that fall in love with each other. The action takes place in the west of the US in the 1960s.\n\nThe acting from Jake and Heath was phenomenal and totally Oscar worthy, and Michelle Williams was also brutal. Anne Hathaway tough more subtle also portraid Jack's wife in a really great way.\n\nThe cinematography contrasted beautifully with the sense of claustrophobia that we always felt from Ennis and Jack relationship. The empty and melancholic eyes paired with the amazing landscape shots were enough to make a tough man cry.\n\nThe dialogue, tough simple, was unique and beautiful. The fact that they never really say \"Love you\" to each other helps humanizing the story and showing that true love is actually much more than words. True love is having to travel 14 hours every time you want to see your loved one, true love is when it hurts because you haven't seen that person in a really long time.\n\nObviously the directing is also brilliant and Ang Lee really does an incredible job in taking this story to the big screens.\n\nThe way this movies plays with toxic masculinity and constantly makes us question ''what it is to be a man?'' is just admirable and it is to be praised the way the music, the acting, the cinematography all combined together creating deep simbolisms and beautifull realistic scenes.\n\nThis movie is a masterpiece and it deserves all the praise. I feel like its way more than a movie about two gay cowboys that have to hide the love that they have for each other. It's a realistic study about humankind, acceptance and a beautiful and heartbreaking love story.",
            "review_date": "2021-12-12",
            "source": "rt"
        },
        {
            "content": "I think the movie is quite deep. I felt different after watching it. I also enjoyed a lot the setting of the film.",
            "review_date": "2021-11-12",
            "source": "rt"
        },
        {
            "content": "Tender, warmful and subtle, but also frustrating (in the good way). A powerful love story surrounded by the fear, violence and stigmas of masculinity. Tender but also truly heart-breaking, leaving this melancholia sensation for days after watching the film.",
            "review_date": "2021-09-30",
            "source": "rt"
        },
        {
            "content": "I mean it's pretty gay isn't it…not a bad film but weirdly the central romance feels far too inauthentic to rouse the emotions. Instead it's the dynamics of the other family parts that is most emotionally wrought.",
            "review_date": "2021-09-19",
            "source": "rt"
        },
        {
            "content": "4.5/5.  A heartbreaking tale that I didn't want to end.  The characters are so rich, complex, and interesting that I wanted more of the film.",
            "review_date": "2021-09-19",
            "source": "rt"
        },
        {
            "content": "Must see. Greatest love story ever.",
            "review_date": "2021-09-07",
            "source": "rt"
        },
        {
            "content": "Film çok güzel, duygulandım. Kendimi onların yerine koymamı sağladı ve canım acıdı hakketen..",
            "review_date": "2021-09-06",
            "source": "rt"
        },
        {
            "content": "Love this! The romance, and the characters is so intense all this. But, the movie sometimes is slowly and (sometimes) tired. But, in the final product is a really good film.",
            "review_date": "2021-09-04",
            "source": "rt"
        },
        {
            "content": "A very interesting love story and concept, explored in a heartfelt way.",
            "review_date": "2021-09-01",
            "source": "rt"
        },
        {
            "content": "For me, this is the crunch of pragmatism and quixoticism banging up against each other….. in life, love, work, family - everything.  \nLucky is the one who finds that place of reconciliation.\nCrucify me, but ultimately \"gay\" problems are still human problems and vice versa.  Nobody has a lock or an out on life and relational problems, no matter what SJW want us to believe, whatever the platform.  \nBeautifully done.  I thought the scenery, pacing, everything was in sync and cohesive, not a note out of place.  \nAnd how Heath Ledger brought so much gravitas at such a young age?  Or maybe youthful energy and desire is required to gain this kind of momentum.  \nAnd of course, English and Aussie actors always seem to do better at western and southern accents than yankees (looking at you, Anne Hathaway).\nWell-done.",
            "review_date": "2021-08-31",
            "source": "rt"
        },
        {
            "content": "Love it! what a great love story in times that were not as tolerant as those days.",
            "review_date": "2021-08-21",
            "source": "rt"
        },
        {
            "content": "Love both these actors....the cinematography in this move was spectacular....having said that the rest of the movie just sucked. Like we get it they were gay...and if you wanna watch them beat you over the head with that fact the entire movie this movie is for you...i dont believe it told a very compelling story. Not for me.",
            "review_date": "2021-07-29",
            "source": "rt"
        },
        {
            "content": "An incredible movie capable of conveying an intense and powerful love. Absolute outstanding performance by the two actors.",
            "review_date": "2021-07-16",
            "source": "rt"
        },
        {
            "content": "One of the best movies of all time.",
            "review_date": "2021-07-12",
            "source": "rt"
        },
        {
            "content": "Ang Lee affronta in maniera piuttosto esplicita un argomento che in pochi si sono spinti a trattare.\nLo fa scegliendo due attori meravigliosi e facendogli girare intorno attrici di spessore che però fungono praticamente solo da contorno.\nIntenso e molto introspettivo, \"Brokeback Mountain\" racconta di una storia di amore proibita che suo malgrado finisce per diventare tossica e per consumarne i protagonisti.\nLa fotografia di sfondo è buona, così come la musica che è ottima.\nCiò che colpisce maggiormente è il modo in cui entrambi i protagonisti riescono ad esprimere chiaramente i loro sentimenti, la loro repressione e le loro paure; portando ad un finale veramente triste e malinconico.",
            "review_date": "2021-07-01",
            "source": "rt"
        },
        {
            "content": "Probably a very important movie especially for an American audience. The story strikes a good balance between happiness and tragedy. It rings very true despite being fiction and there is some clear critique of American society at play for what it means to be gay and how gay people are treated. The overall production level is very high the movie has great cinematography, acting, and score.",
            "review_date": "2021-06-27",
            "source": "rt"
        },
        {
            "content": "One of the greatest movies ever made.",
            "review_date": "2021-06-15",
            "source": "rt"
        },
        {
            "content": "This film was absolutely gorgeous visually, which provides an illuminating contrast to the dark and lonely torment faced by each of the main characters when apart. Ledger, Gyllenhaal, and Williams give A+ performances and really kept me fully engaged where the plot was lacking.\n\nI recognize watching this for the first time in 2021 is thankfully a much different experience than this would have been when it was released. Credit to Ang Lee for choosing to retell this story when he did.",
            "review_date": "2021-06-11",
            "source": "rt"
        },
        {
            "content": "Good and groundbreaking but I would have preferred if one of the lead actors was actually openly gay. I still liked it though.",
            "review_date": "2021-06-07",
            "source": "rt"
        },
        {
            "content": "Was happy to see some representation but I thought this movie was really dry. The story just wasn't engaging enough for me and it looked like it was directed by a film student.",
            "review_date": "2021-06-06",
            "source": "rt"
        },
        {
            "content": "a realistic gay classic which leaves watchers feeling heartbroken at the end. the plot is gorgeous, and most importantly, it's beautiful acting and cinematography.",
            "review_date": "2021-05-27",
            "source": "rt"
        },
        {
            "content": "Es una película cautivadora; con una trama conmovedora, excelentes actuaciones y bellos escenarios en la montaña; es una atrapante y bonita historia de amor.",
            "review_date": "2021-05-23",
            "source": "rt"
        },
        {
            "content": "A wonderfully acted movie with a beautiful, yet tragic love story to tell. Ledger and Gyllenhaal were indeed as good as hyped and I thought this was great.",
            "review_date": "2021-05-11",
            "source": "rt"
        },
        {
            "content": "#Jakeisnotabottom team",
            "review_date": "2021-05-06",
            "source": "rt"
        },
        {
            "content": "An instant classic of a gay human experience shared between two men, \"Brokeback Mountain\" will break your heart and leave you reflecting for days. Through gripping performances and a non-politicized script, the film captures a truly tragic love story that will continue to age gracefully in cinematic history. Compelling, devastating, and hopelessly romantic in all facets, \"Brokeback Mountain\" is unforgettable.",
            "review_date": "2021-05-03",
            "source": "rt"
        },
        {
            "content": "A beautiful, sad love story.",
            "review_date": "2021-04-10",
            "source": "rt"
        },
        {
            "content": "Gorgeous opening shot of the mountains and the sun just peaking over the top of the mountains, wow. Wyoming looks majestic. So interesting to see how primal Ennis and Jack are being in the wilderness with nothing but they're guns and some provisions. Seeing all those sheep being herded up the mountain range sure was a sight to behold. \n\nSo awkward the whole sex scene. It's like they were trying to hold back but they couldn't. I guess it gets pretty lonely out on the range lol. Interesting how the one sheep got eaten, its insides all torn up. The sheep represents virginity and innocence, the opposite of sin. Jesus also herded sheep. The sheep dying is a metaphor for the sin that was committed by Ennis and Jack. More so from Ennis since he seems to be the more innocent and good one. What a complicated and difficult relationship they have. It's almost like they can't stand to be apart from one another but know how fucked things would get if people knew about them.\n\nJesus Christ, Anne Hathaway is such a catch. Damn! Rodeo grew some balls and told Laureen's dad who's boss finally lol. Wow that scene where Ennis' ex-wife confronts him about Jack and the fake fishing trips was so intense. Insanely good acting. \n\nSmartly written and adapted with some very eye-catching cinematography. A hard hitting romance drama full of real and sobering themes. Powerfully acted, filled with interesting characters that develop over time. Watching this, I feel like anyone can relate to it in some way or on some level, even if you're not gay. This movie's kind of like a bittersweet sort of thing. It's not overly sad and depressing nor is it overly happy and joyous. It just tells it how it is, with honesty. In a simplistic sense, it is quite the beautiful and honest love story. It also serves as a character study on humanity, highlighting how broken and flawed we can be no matter how good or bad we have it in life and in our upbringings. Amazingly powerful movie, I'd watch it again.",
            "review_date": "2021-04-01",
            "source": "rt"
        },
        {
            "content": "The cast was great and I liked the setting of the film, but wasn't a fan of this film. Not because of the homosexuality but because the story was ridiculous.",
            "review_date": "2021-03-24",
            "source": "rt"
        },
        {
            "content": "Sad movie.  Well acted, beautiful scenery as when did the Wyoming Big Horns move to  Alberta?",
            "review_date": "2021-03-18",
            "source": "rt"
        },
        {
            "content": "RATING: A-  Director: Ang Lee \nBrokeback Mountain is the beautiful tale of an unlikely romance story.  The late Heath Ledger is incredible as are Jake Gyllenhaal and Olivia Williams. The Screenplay is great and the Cinematography produces some astonishing pictures.  Ang Lee won rightfully Best Director at the Academy Awards. The film really combines the normal aspects of Romantic films with much drama and gets really sad at some points. Everyone should see this!",
            "review_date": "2021-03-10",
            "source": "rt"
        },
        {
            "content": "there are SO many famous faces in this movie! i didn't realize that before i watched it. i thought Anne Hathaway stuck out like a sore thumb, but Anna Farris fit in quite well... honestly a pretty good movie. would've been better without Hathaway.",
            "review_date": "2021-03-06",
            "source": "rt"
        },
        {
            "content": "The strangest, yet funniest, drama!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2021-02-24",
            "source": "rt"
        },
        {
            "content": "Deep story of love and repressed life.  One of my all time favorite movies.",
            "review_date": "2021-02-23",
            "source": "rt"
        },
        {
            "content": "The movie was deserving of its Oscar with the stellar cast of Heath Ledger, Jake Gyllenhaal, Anne Hathaway, and Michelle Williams. I liked the simplicity of the story and how the transition was smooth with the love and the difficulties of maintaining the love. The chemistry between Ledger and Gyllenhaal was surprising and for their roles, they had taken a bold approach towards this sensitive topic. One of the top Oscar films to date.",
            "review_date": "2021-02-20",
            "source": "rt"
        },
        {
            "content": "This 2005 romantic film is the acclaimed masterpiece of Taiwanese director Ang Lee. Brokeback Mountain was the loser of arguably the most controversial Oscar decision of all time when it was defeated by Crash in the Best Picture race. The shock was deep because this film told the heartbreaking story of same-sex lovers Ennis and Jack, finally addressing the taboo subject of homosexuality in Hollywood at the time.\n\nHeath Ledger (Ennis) and Jake Gyllenhaal (Jack) embody the two protagonists in their breakthrough roles. The now deceased Ledger and Gyllenhaal were very good friends in real life, which visibly benefits their chemistry in the film. As individuals, they could hardly be more different. On the one hand, there is the introverted and taciturn cowboy Ennis, who gets to know himself better through his relationship with Jack, which he doesn't always like. He finds it difficult to show feelings and to fully engage with his co-cowboy. Jack, on the other hand, is a slightly eccentric rodeo rider, but also highly sensitive. He knows what he wants from the start and tries to make this clear to Ennis. However, his insecurity gets in the way of Jack's happiness, which is why his further path is rocky. Every time Ledger and Gyllenhaal share the screen together, there is a subtle but exuberant mood, laced with big emotions, feelings of happiness and a lot of frustration. The two give their all in these highly complex roles and deliver enormously human and passionate performances. In their separate, different lives, they are joined by strong female supporting roles. Michelle Williams as Ennis' wife Alma and Anne Hathaway as Jack's lover Laureen are also victims of a love that doesn't want to be, where Williams in particular acts very vulnerably.\n\nIn addition to the performances, Ang Lee's grandiose direction deserves special mention. Brokeback Mountain inspires with beautiful landscape images from the mountains that reflect the emotional worlds of the protagonists. When they return to the Brokebacks together, everything is colourful and idyllic, while in their private lives in the city, much seems dark and dreary. This arty component puts its stamp on the film and sends important messages. The score is also beautiful and gives you constant goosebumps. As artistic and real as Brokeback Mountain is, it is definitely not light fare. The story of two men who love each other more than anything, but are prevented from doing so by society, is hard to watch. The ending is more than borderline. The closeness to reality is both the great strength and weakness of Brokeback Mountain. The brutality towards animals is also exaggerated, even if it was a sad matter of course in the world of cowboys. However, if you love films that do something to you, this is the one.",
            "review_date": "2021-02-19",
            "source": "rt"
        },
        {
            "content": "Using its cinematography to catch our attention, we enter into some deep topics about homosexuality. The two main characters are immersed in problems related to the outside world and their true feelings. We know the difficult situation they're going through. About the performances, there's no much to say, they are undeniably outstanding. What I was not completely happy with was the duration of the film, because it added subplots that made the movie too long, although they might have been necessary.",
            "review_date": "2021-02-15",
            "source": "rt"
        },
        {
            "content": "The passing of time is one of the many aspects of this film that is accomplished with extreme poise.",
            "review_date": "2021-02-15",
            "source": "rt"
        },
        {
            "content": "A magnificent journey through life inside wonderful landscapes with stellar performances by the leading actors.",
            "review_date": "2021-02-14",
            "source": "rt"
        },
        {
            "content": "This movie is so famous that i thought it will be great... and nope. Principally because this movie talks more about this two guys pretending to be straight than actually the love story between the two of them, still, the end was pretty good and shocking.",
            "review_date": "2021-02-11",
            "source": "rt"
        },
        {
            "content": "Good direction by Ang Lee with a great performance by Heath Ledger",
            "review_date": "2021-02-07",
            "source": "rt"
        },
        {
            "content": "Great score, great cinematography, great story, beautiful movie.",
            "review_date": "2021-02-02",
            "source": "rt"
        },
        {
            "content": "I went into Brokeback Mountain with a couple of assumptions - 1) that the film I filed in my head as the \"gay cowboy movie\" that my conservative parents wouldn't give any airtime to was old school 1800s cowboys, and 2) that it followed a relatively traditional forbidden love storyline and ended up as a critical darling because it happened to include a gay storyline. I was proven wrong on both counts. Brokeback Mountain gave hints initially of just being an adaptation of a conventional romance novel, but ended up being so much more; the film is a terribly morose take on repression, dishonesty, passion, and social norms that manages to hit you hardest with brief moments that punctuate a consistent, morose tone (the result of a univeral repression?), whether they be happy or devastating. What's more, the film doesn't let the most prominent aspect of its storyline (the homosexual relationship between the protagonists) define the film. Both Ennis and Jack have their own very human flaws that draw them into conflict just as often as the nature of their romance (if not more so), and these conflicts are critical features of the narrative. Ledger, Gyllenhaal, and Williams with her particularly unfortunate role are each fantastic. The fact that Crash took Best Picture in a year that this film was in competition is a miscarriage of justice, and that's not only because Crash is god-awful. Just an odd phenomenon - the male actors at virtually every level of importance in this film ended up becoming far more prominent than their female counterparts, with Ledger, Gyllenhaal, and even Harbour receiving much higher profile future roles than the then-popular Hathaway, Faris, and Mara; Williams is the only one to really buck this trend. (4.5/5)",
            "review_date": "2021-01-26",
            "source": "rt"
        },
        {
            "content": "I finally watched Brokeback Mountain and it's was the most beautiful, touching, and heartbreaking movie I have ever watched. Heath Ledger and Jake Gyllenhaal performances were astounding, they gave such beautiful, emotionally powerful, and deep performances and their chemistry was extraordinary just so beautiful and natural; two of the best performances I have ever seen and some of the best chemistry I have seen between co-stars. Michelle Williams, Anne Hathaway, Linda Cardellini, and Anna Faris gave outstanding supporting performances. The writing was exceptional, the story and screenplay were just so beautifully heartbreaking. The character development of Ennis Del Mar, Jack Twist, and Alma Beers Del Mar was phenomenal. The cinematography was gorgeous. The costumes were stupendous especially ones wore by Jake Gyllenhaal, Heath Ledger, Michelle Williams, Anne Hathaway, Anna Faris, and David Harbour. The makeup and hairstyling was spectacular especially on Heath Ledger, Anne Hathaway, Jake Gyllenhaal, Michelle Williams, Anna Faris, Linda Cardellini, David Harbour, and Kate Mara. The music was remarkable. Brokeback Mountain is an A+ movie and one of my top 10 favorite movies I have ever seen.",
            "review_date": "2021-01-25",
            "source": "rt"
        },
        {
            "content": "Brokeback Mountain slowly draws itself out and builds with care only for the rug to be ripped from below. With Ledger's and Gyllenhaal's performances, it'll make for a depressing but thoughtful ride.",
            "review_date": "2021-01-24",
            "source": "rt"
        },
        {
            "content": "A heartbreaking but incredibly touching portrait of two men who develop romantic feelings for one another while working a job as sheep herders in the Brokeback Mountains of Wyoming. The nature of their relationship clearly depicts what isn't socially acceptable at the time as it relates to homosexuality. We see the emotional struggle that each of these characters endure throughout the film as they try to live in a world that doesn't except their true selves. The chemistry demonstrated on screen between Heath Ledger and Jake Gyllenhaal is really solid as you can tell that these two men love and care for each other. The internal conflicts that each character faces is also demonstrated very nicely through each actor's performance. The direction and cinematography is beautiful and the screenplay is spectacular. Out of all the great performances Gyllenhaal really stood out to me as he had some truly powerful moments in this film. Although this film is a bit of a lengthy slow burn it definitely earns its runtime.",
            "review_date": "2021-01-17",
            "source": "rt"
        },
        {
            "content": "Ang Lee's \"Brokeback Mountain\" is a tremendous and impactful love story that demands to be felt. This movie kept me engaged throughout and all of the performances were exceptionally good. Jake Gyllenhaal and Heath Ledger both did an outstanding job in this movie and the characters they created felt real. This movie has a strong central tragedy but it also includes many sad moments for the supporting characters as well. All together it packs an emotional powerhouse. This movie takes its mature subjects very seriously and is a captivating drama. This is a movie that will continue to stick with me because of its deeply saddening final moments. Overall, this is an unforgettable movie that is one of the most beautiful and heartbreaking stories in all of cinema.",
            "review_date": "2021-01-11",
            "source": "rt"
        },
        {
            "content": "Devastatingly brilliant. A movie that I will never forget and that shows the power of true love.",
            "review_date": "2021-01-11",
            "source": "rt"
        },
        {
            "content": "This movie is heavy. Profound. It will haunt you.",
            "review_date": "2020-12-29",
            "source": "rt"
        },
        {
            "content": "One of the best films I've ever watched on this topic. The only sad part is the ending, which surprises us with an option not very favorable to our hearts",
            "review_date": "2020-12-26",
            "source": "rt"
        },
        {
            "content": "This movie has a special place in my heart! I've rewatched it so many times. I love it so much.",
            "review_date": "2020-12-19",
            "source": "rt"
        },
        {
            "content": "I thought it was a bit overrated, but its still a great film. A bit slow all throughout. The performances from Heath and Jake is amazing. Takes a lot to accept things roles. Such a tragic story.",
            "review_date": "2020-12-10",
            "source": "rt"
        },
        {
            "content": "An emotionally powerful and poignant romance movie that's helped by its strong performances, Ang Lee's sensitive direction, and the emotionally resonant screenplay.",
            "review_date": "2020-12-10",
            "source": "rt"
        },
        {
            "content": "Love is truly a force of nature\ndirector Ang Lee presents an uncommon but universal love story featuring Jake Gylenhaal, Heath Ledger, Anne Hathaway, Michelle Williams, Kate Mara, Linda Cardellini, and Randy Quaid\nthis was one of the earliest movies in the 2000's to present a homosexual relationship breaking ground for the LGBTQ community \nset during the 1960's in Wyoming it focuses on two men, Jack and Ennis looking for work as sheep herders\nwhen they both camp in the mountainside feelings start to stir up between both of them and they begin a unexpected romance with each other\nafter it's over they resort back to what's considered a normal life; yet they find it frustrating to be true to themselves denying their mutual affection for one another as well as repressing their desires\ntrue they both marry women and have children but can they truly be their authentic selves especially in a part of the world that persecutes people like them? after all it's a love story trapped in a hostile, unforgiving time\nsocietal repression and internal repression can hurt both ways \nAng Lee presents a story of tolerance but also unquestionable acceptance\nboth of these men are more angry at themselves that they can't act on what they really want so it makes sense they get frustrated at certain points \nit's true too that society today with the culture shift stops gays from revealing themselves as far as secrets, lies, and trauma not to mention it addresses the dangers of the lifestyle \nthe movie itself still opened up a lot of viewers minds on the topic and is still considered the quintessential queer movie for many but it also works as far as mainstream audiences are concerned \nit's still about forbidden love regardless of sexual orientation that anyone can identify with\nsometimes we wish we could quit, not everyone knows what it's like to be kept in the dark and not live freely as we choose, we can only put up the illusion for so long until it eats away at us\ndespite not winning the Best Picture Oscar when it came out the film soars because of the committed performances of its leads, the fantastic naturesque vibe, and the heavy, stirring emotions it evokes \nit's a love story yes it just so happens to be about two men and it's brilliantly told\nI was amazed how much I enjoyed a lot",
            "review_date": "2020-12-10",
            "source": "rt"
        },
        {
            "content": "Beautiful movie!\nThis movie taught me many things that I had never thought",
            "review_date": "2020-12-06",
            "source": "rt"
        },
        {
            "content": "An amazing movie about homosexuals that I have enjoyed watching a lot. Not a single movie opens homosexual people problems in 20th century like this one, besides \"The Imitation Game\" and \"A Single Man\", but out of all these movies, this one is the best. Heath Ledger plays fantastically and his role of a man struggling with his sexual identity is portrayed beautifully and I believe he is the one responsible for this film's success, as I didn't see as much work put into a role even from Jake Gyllenhaal. There is amazing aesthetic and wonderful decorations, which make good for a feeling of era. All the female actresses are also playing their best, especially Anne Hathaway, who does a great job. This movie has a huge moral, which by now might be a little banal, but when this movie was released it was superb and unique and actually opened people's eyes about gay people and their feelings, as there are still a lot of homophobia going around the world. The entire movie has a sad tone with some unexpected twists, some of which even made me cringe because I felt for the characters. I believe that this movie could have stayed the best LGBTQ related movie of all time if \"Call Me By Your Name\" never came out, which was even better than this one. To conclude, this film is a must-watch, but I didn't find it legendary, as it was spoken about, although it has amazing scenes and leaves you with a mixture of feelings in the end, a strong 8/10, which makes for a great drama movie.",
            "review_date": "2020-11-16",
            "source": "rt"
        },
        {
            "content": "Pretty good movie starring heath ledger and Jake Gyllenhaal and directed by the wonderful Ang Lee. For some reason I couldn't get behind this movie. At some points I felt bored but then I felt really engaged. I need to see this movie one more time to give my real review.",
            "review_date": "2020-09-30",
            "source": "rt"
        },
        {
            "content": "This could have been an incredible film; should be 5 stars. This could have been an absolutely historic moment in filmmaking- it could have been a harrowing, gut-wrenching tale of love and loss and secrets and prejudice. But, how you gonna make a visceral love story about 2 cowboys and not show dick? Not even side peen. It's tragic. The filmmakers were so close to perfection for a lot of the 🎥 run time, but they completely fumbled the ball and ended with a disaster.",
            "review_date": "2020-09-04",
            "source": "rt"
        },
        {
            "content": "A daring look at homosexual relationships filmed without contrivance and filled with contemporary filmmaking choices.  The film's pacing allows us to naturally know these characters and as such, their heartbreaks leave a lasting impact on us too.",
            "review_date": "2020-08-08",
            "source": "rt"
        },
        {
            "content": "It's quite difficult to get through for all the right reasons, but it so deserves the recognition it should've won during the time of progression just kicking in.",
            "review_date": "2020-08-05",
            "source": "rt"
        },
        {
            "content": "Acting and directing in this movie is exceptionally spot-on. Emotions and the flow of the story are well conveyed. Everything in this is remarkable.",
            "review_date": "2020-08-04",
            "source": "rt"
        },
        {
            "content": "\"Jack, I swear.\"\nBroke-back mountain tells the story of two men, falling into forbidden love, in the early 60's and carry's the story through a 20 year period.\n\nBroke-back is a well thought out masterpiece, the acting is phenomenal, the story is superb, the scenery and soundtrack is perfect. I watched this movie for the first time last night, basically going in blind witch I suggest everyone who has heard of this movie should, I only knew that it was a love story about two men. after my viewing I was brought to uncontrollable tears. I was so invested in the characters, Jake and Heath did amazing work here, their chemistry was of the charts, everything was brought to life in such a terrific way that I really felt as if I was in this world with them. As a member of the LGBT this story really hits home, this movie never through around gay stereotypes, just two men falling in love in a world that is so hateful, that you have a target over your head if anyone found out. \"Jack, I swear.\" honesty brings me to tears thinking about it, something so simple but with so much meaning and symbolism. Well I swear I will never forget about this movie and I hope one day I can show my own kids this movie, and they show their kids, this film will carry on for generations and will never be forgotten.",
            "review_date": "2020-07-30",
            "source": "rt"
        },
        {
            "content": "Superb acting. Their intimate moments were deliberately restrained but that's understandable given that it was 2007 and attitudes have progressed leaps and bounds even from then. Last half of the film was maybe a bit rushed.",
            "review_date": "2020-07-29",
            "source": "rt"
        },
        {
            "content": "beyond its expetations, i loved how it was so much more than a sensual story about two lovers facing the difficulties of their times, but it was sentimentally harsh, pure and felt real, developing each important feature as slowly and calmly as it needed to be done.",
            "review_date": "2020-07-01",
            "source": "rt"
        },
        {
            "content": "It was just ok for me. I appreciate that they had an inclusive cowboy film, but besides that and the performances I didn't think it had anything going for it.",
            "review_date": "2020-06-26",
            "source": "rt"
        },
        {
            "content": "From a book that barely gets near 100 pages this 3 hour picture is a masterpiece.",
            "review_date": "2020-06-15",
            "source": "rt"
        },
        {
            "content": "Tender, sad, sweet.  Some likely wonder, \"What's the fuss?\" But we old enough to know, some  walked a path longing for satisfaction they felt was out of reach. Touching display here.",
            "review_date": "2020-06-13",
            "source": "rt"
        },
        {
            "content": "so fresh: absolute must see",
            "review_date": "2020-06-12",
            "source": "rt"
        },
        {
            "content": "One of the best love stories ever told, 'Brokeback Mountain' provides us with some of the best work from all involved.  If you're not reduced to a pile of drool in those last few moments you may be an alien!!  Final Score: 10/10",
            "review_date": "2020-05-19",
            "source": "rt"
        },
        {
            "content": "A beautifully filmed, expertly written and brilliantly directed modern western with an LGBT romance at its core. It's a heartbreaking and emotionally resonant love story with outstanding lead performances from Heath Ledger and Jake Gyllenhaal.",
            "review_date": "2020-05-14",
            "source": "rt"
        },
        {
            "content": "movie with a wonderful script",
            "review_date": "2020-04-23",
            "source": "rt"
        },
        {
            "content": "Uma verdadeira obra prima do cinema, bem provido de atuações que são invejáveis (Heath e Jake sabem como envolver o público com os seus respectivos personagens, sem falar na atuação impecável da Michelle Williams) além de ter um roteiro e uma trilha sonora magníficos, Ang Lee acertou em cheio nesse filme que sem dúvidas marcou muita gente!",
            "review_date": "2020-04-20",
            "source": "rt"
        },
        {
            "content": "Some of the scenery is very nice to look at. Lots of acting talent. It's an interesting story but the story drags on a bit too much. I think it could have been like 30 mins shorter. The theme of the movie is an important one to consider but it wasn't the most entertaining movie to watch.",
            "review_date": "2020-04-09",
            "source": "rt"
        },
        {
            "content": "Brokeback Mountain is a complete film. Beautifully shot, perfectly written, a subtlety brilliant score, and it handled a taboo topic with such a gentle, loving hand.",
            "review_date": "2020-04-08",
            "source": "rt"
        },
        {
            "content": "Great love story. Jake has never looked so handsome. One of the most beautiful couples in movies.",
            "review_date": "2020-03-29",
            "source": "rt"
        },
        {
            "content": "One of the best LGBT movie👌💯",
            "review_date": "2020-03-24",
            "source": "rt"
        },
        {
            "content": "this movie WILL BREAK your HEART if you ever underestimate the sheer power of film watch this, you will be left with strong emotion in your heart. this movie portrays a great deal of sadness among the triumph of love and represents the longing for it. Jake and Heath 2 straight men will captivate you with this beautifully painful story. now if you are reading this, I'm sure you're like why would i want to watch such a sad movie? because it's also rich in love and happiness. i would recommend this movie to anyone with eyes 11/10 must watch",
            "review_date": "2020-03-18",
            "source": "rt"
        },
        {
            "content": "Great movie however my score goes down for me me as they didn't explore the sexuality one step at a time, for two supposedly none queer guys doing going against social norms, they got into it a bit too wuickly after only a bit of whisky. The movie continued to be consistantly heartfelt and that was good but I don't think this is how a first time gay encounter would go, there would be more progression steering them that way and more questioning that reality. If they had the scene where the boss catches them wrestling looking through his binoculars before the actual sex scene, then that would have been atleast a small progression into what would become their relationship. Great movie however deffinately a classic.",
            "review_date": "2020-02-21",
            "source": "rt"
        },
        {
            "content": "\"I wish I could quit you\" in gay cowboy voice. My friends and I used to put this on in the background of our parties every weekend for 3 months back in high school",
            "review_date": "2020-01-20",
            "source": "rt"
        },
        {
            "content": "A master director at the top of his game, combined with gorgeous cinematography and award-caliber performances, match with a beautiful and heartbreaking script to bring to life one of the best romantic dramas of the 21st century.",
            "review_date": "2020-01-16",
            "source": "rt"
        },
        {
            "content": "I didn't watch this when it first came out because I didn't think, as a women, I would like it.  Sine then I have watched it 3 times and bought the DVD.  It is the most romantic love story I have ever seen.  I cry every time,  It should have been the Best Picture.",
            "review_date": "2019-12-27",
            "source": "rt"
        },
        {
            "content": "A realistic story starting  in the 60's and going on of 2 rural men in USA who find themselves in homosexual love with each other and continue an affair for many years past their 1st co-worker encounters on brokeback mountain. Putting major strain on their current marriage's and families. Has a pretty sad ending. If you're into this kind of gay  forbidden love drama thing you may like it. Can get draggy at parts.",
            "review_date": "2019-12-07",
            "source": "rt"
        },
        {
            "content": "Generally sick of soft porn",
            "review_date": "2019-12-04",
            "source": "rt"
        },
        {
            "content": "Best movie I have watched in my life. My favourite movie of all time. Watch it and it will be proven.",
            "review_date": "2019-11-16",
            "source": "rt"
        },
        {
            "content": "In one of the most controversial upsets of all time the laughable race relations parable Crash (2005) won the Best Picture Academy Award over the acclaimed romantic drama that would serve as one of the first mainstream representations of homosexual love on screen. I was outraged, having seen both of the films, that the markedly lesser production triumphed as it was sad that they could not pick up on a film that would develop so much cultural cache over the following years. While 2005 was a weak year for film overall this movie was fully deserving of it's nomination and I would have less vitriol for the 2005 Best Picture lineup had this film been honored.\n\nCowboys Jack Twist, Jake Gyllenhaal, and Ennis Del Mar, Heath Ledger, fall in love in 1963 while herding sheep together. They separate for four years after they finish herding the sheep as Del Mar is uncomfortable about engaging in a homosexual relationship due to a traumatic event he witnessed as a child. The men reconnect four years later and pretend to be fishing several times a year so that they can meet up and sleep together. Del Mar marries longtime girlfriend Alma Beers, Michelle Williams, who discovers their affair and later divorces her husband to marry the more attentive Monroe, Scott Michael Campbell. Twist marries the wealthy Lureen Newsome, Anne Hathaway, while having trysts with male prostitutes in Mexico. The two grow frustrated with the state of their relationship as Twist wants them to be together on a more permanent basis while Del Mar remains emotionally conflicted. After Twist's death Del Mar comes to terms with his own feelings and is able to mourn the loss of the love of his life.\n\nBy today's standards, just fourteen years later, the film's portrayal of gay love, almost sexless and emotionally torturous, seems rather conservative but at the time this was groundbreaking stuff. Sure, all of this content had been covered before in independent and foreign films but for the masses this was the first real exposure to a film of this sort from a respected director and a talented cast. I was struck by the fact that while the film is squeamish about addressing the physical elements of the relationship between the two men it does not shy away from broaching the topic of bisexuality. We see that Del Mar in some way enjoys sleeping with women but that emotionally only Twist can fulfill him while Twist is most likely homosexual as his sexual relationship with Lureen is fraught. In the age of there being a million different sexual orientations that people can identify themselves as the film appears remarkably forward thinking.\n\nThe movie also benefits from some very strong performances from it's two leads who are able to convey intense emotional turmoil through gazes and small gestures instead of long monologues. These are men who do not speak like the metropolitan, classy characters who would usually be the focus of a Hollywood romance and having them speak that way would take us out of the situation. We feel their pain in the silence and Gyllenhaal in particular excels at expressing latent desire in the early moments of the film with his desperate attempts to connect to his lover later in the film seeming all the more powerful for it. Williams and Hathaway also do great things with smaller parts as Hathaway in particular makes her part more than it appears on the stage. The fragility hiding behind her confident, wealthy façade is revealed when she asks Twist whether she is \"Too fast\" and Hathaway gets the frustration of a woman who has been told to be a certain way her entire life perfectly. While I can see why Williams earned the Academy Award nomination, she gives the showier performance, I think that Hathaway was more deserving of recognition.\n\nPeople are right to be upset about this film not winning Best Picture because it is a beautiful piece of filmmaking despite some of the limitations it places on the relationship it depicts. People are still watching and enjoying this film fourteen years later which is a testament to it's power. After all, Good Night, and Good Luck (2005) is hardly a staple on television nowadays.",
            "review_date": "2019-10-11",
            "source": "rt"
        },
        {
            "content": "It was such a moving love story!!!",
            "review_date": "2019-10-06",
            "source": "rt"
        },
        {
            "content": "In a story, there must be something the author wants to convey. Annie Proulx wrote Brokeback Mountain with a realistic approach to the forbidden relationship between two cowboys. Every detail of the meeting until the emergence of chemistry is explained neatly.\n\nAng Lee embodies Brokeback Mountain in a charming cinematography. A longshot of a scene on Mount Brokeback is beautifully presented, then combined with a drama between two cowboys, Jack Twist (Jake Gyllenhaal) and Ennis Del Mar (Heath Ledger).\n\nBrokeback Mountain presents beautiful stories and visuals, then combines them with beautiful scoring, giving a drama story with all its problems strongly. Beautiful drama view",
            "review_date": "2019-09-27",
            "source": "rt"
        },
        {
            "content": "Visually amazing. Perfectly acted. Great film.",
            "review_date": "2019-09-18",
            "source": "rt"
        },
        {
            "content": "This movie focuses on dilemmas from the seventies that are still issues today. Ang Lee masterfully directs the brilliant talents of Heath Ledger and Jake Gyllenhaal who play these roles wit stunning conviction. This movie feels real and will not relent on you as it pounds you to the ground with heartbreaking scene after heartbreaking scene. This movie is an emotional roller coaster that will leave you hanging on for dear life.",
            "review_date": "2019-09-12",
            "source": "rt"
        },
        {
            "content": "sad man. this is what unrequited love looks and feel like. i dont want it.",
            "review_date": "2019-07-28",
            "source": "rt"
        },
        {
            "content": "A realistic way of representing a gay love story, even today, in a society that doesn,t accept it. Moreover is brilliantly acted,, whit a bitter ending One of my favorite movies of all time",
            "review_date": "2019-07-21",
            "source": "rt"
        },
        {
            "content": "It left me with so many emotions. and of course a heartbreak. ",
            "review_date": "2019-06-20",
            "source": "rt"
        },
        {
            "content": "An honest to god masterpiece of the romance genre, every moment pregnant with longing and loss.",
            "review_date": "2019-05-25",
            "source": "rt"
        },
        {
            "content": "absolutely love this movie!",
            "review_date": "2019-05-04",
            "source": "rt"
        },
        {
            "content": "ABSOLUTELY LOVED IT SUCH AN AMAZING MOVIE ONE OF MY FAVORITE MOVIES OF ALL TIME DEFINITELY RECOMMEND 🥰😍😘❤️👏👏👏👏",
            "review_date": "2019-02-27",
            "source": "rt"
        },
        {
            "content": "An inspired effort to depict the conflict of homosexuality in 1960's America.",
            "review_date": "2019-02-17",
            "source": "rt"
        },
        {
            "content": "I'm ashamed to admit, but i tool me 14 years to see this movie. I thought the movie was superb. I believe I'm an intelligent gay man; I say this because most wanted to see more than what was shown. I think that the only thing I yearned for was someone saying I love you. I understand that it was hinted, but that .would have just over the moon. The movie was very real to me because I had friends in the same predicament.  One who loves hard and the other who is terrified of giving that much love back. While watching the end of the movie,  where \"you know who\" dies, I kept asking myself was he murdered; then I read some opinions on it. Some were spot on, but the other's were crap. If you want to see a movie where the love is there, but nothing and something can be done about it, I highly recommend Brokeback Mountain.",
            "review_date": "2019-02-05",
            "source": "rt"
        },
        {
            "content": "A beautiful romance story within a tragically misunderstood film.\n\nAng Lee's Brokeback Mountain (2005) is a stunning tale of forbidden love brought to life by two of the greatest actors ever. Heath Ledger's perfect accent and gravelly voice tremble with an inner turmoil over his feelings in one of Heath's best performances. Jake Gyllenhaal is outstanding as the sensitive gay lover wishing for a better, open, and honest love life like he deserves. Both Ledger and Gyllenhaal deliver incredibly subtle and nuanced portrayals that I found deeply moving. Brokeback Mountain is a romantic tragedy and gripping drama for any audience to appreciate. \n\nLee's direction is awe inspiring from the gorgeous natural scenery to his clever framing of these two lovers. His recreation of an older era and its biases is impressive on its own, but Lee breathes a passion for filmmaking with every shot. Take any frame of Brokeback Mountain and you will see a perfect image. Lee's tender and affectionate hand gives the camera a respectful and understanding perspective for the lead's homosexual encounters. Lee's direction is immaculate and thoughtful leading to pensive sequences of honest dialogue from Larry McMurty and Diana Ossana's touching script.\n\nBrokeback Mountain is as much a journey of self discovery as it is a lens into the lives of two Southern men and their respective areas. Lee shines a light on homophobia and ignorance with a scathing critique of intolerance. As much as Lee uses Brokeback Mountain to show support for the homosexual community and a decent sympathy for the hurt spouses of the characters. Brokeback Mountain is well balanced between the sweet and uncertain romance and the tumultuous domestic life dramatic tension.\n\nI adored Michelle Williams in Brokeback Mountain as much as the dual leading men. She is so expressive and heartbreaking with all her choices. She uses a visual pain to display a hurt knowledge her character possesses without ever having to say what she knows out loud. Williams gives a powerful performance and one of her most poignant as an actress.\n\nOverall, Brokeback Mountain is misunderstood as a film. It does not deserve to be written off as the \"gay cowboy movie,\" but should be appreciated for its careful plotting and brave depiction of gay love on a deeper level. You really come to understand how these two men feel and how they feelings hurt those around them, while making themselves miserable for being away from one another. The moving acting from Heath Ledger and Jake Gyllenhaal are two for the ages!",
            "review_date": "2019-01-28",
            "source": "rt"
        },
        {
            "content": "Completely average to me, standard love/affair story of a forbidden love of some kind that doesn't have the desired happy ending.",
            "review_date": "2019-01-23",
            "source": "rt"
        },
        {
            "content": "Heartbreakingly beautiful story of two men who fall in love, fight their feelings because they know what devastating consequences those feelings could bring, but still can't \"quit\" each other. This movie showed same-sex love Is as Powerful as heterosexual love, and it showed queer characters as fully realized human beings (instead of hollywood's Usual two-dimensional gay/lesbian/bisexual/transgender stereotypes). A movie masterpiece!",
            "review_date": "2019-01-14",
            "source": "rt"
        },
        {
            "content": "One of the best gay movie to me, just perfect!",
            "review_date": "2019-01-05",
            "source": "rt"
        },
        {
            "content": "Great untraditional romance. Good acting. I just dont like over-paid movie critics liking it because it is \"against the norm\". If the movie is \"too normal\", no matter the cast or content, critics always hate it. Its another way for people in this society to \"declare themselves 'different'\". Everybody is always trying to be unique. Its sad, really. If you are really being yourself there is no competiontion, because if you are really being yourself than you are unique. Food for thought.",
            "review_date": "2019-01-05",
            "source": "rt"
        },
        {
            "content": "wow this movie sucked",
            "review_date": "2018-12-17",
            "source": "rt"
        },
        {
            "content": "I’ve heard so much about Brokeback Mountain since it came out, because it was in the cultural zeitgeist to such a level that you couldn’t avoid hearing about it. So I had a lot of expectations when I sat down to watch it. I expected it to be bold about presenting the homosexuality of its characters, I expected it to have some powerful acting performances, and I expected it to have the line “I wish I knew how to quit you.” What I never expected in a million years was that I would find it so boring. Yes, it is a movie that gives an honest and heartfelt presentation of two men who love each other in a time when that love was forbidden. But that’s about all it does. The plot is no more involved than that, and moves at a frustratingly slow pace. I wanted things to happen, but the movie wanted me to wait for another 30 minutes before the next thing would happen. I couldn’t believe how many years were passing by in the story, and yet these are the moments we needed to stop and see? There were so many stops along the way that felt pointless or superfluous. Also, the attempt to show the aging of the actors was atrocious. I almost started to laugh out loud when Kate Mara showed up and was supposed to be Ledger’s daughter even though she clearly is around the same age as him. One thing that doesn’t help with my boredom was the fact that the dialogue is sparse throughout so much of Brokeback Mountain. There are a lot of silent moments, and when people talk there’s a lot of mumbling (particularly from Heath Ledger.) But aside from the delivery of some of the accents, I thought the acting was solid. The cast is stacked with some of the best actors working today, and they all deliver as best they can with this dialogue. But, there was one big problem...I didn’t feel any chemistry between Ledger and Gyllenhaal. The delivery of the dialogue and certain scenes when they were apart convinced me they were in love with someone, but their interactions together never sold me on the fact that they were in love with each other. I also started to get annoyed with the illogical way people acted in the film. For a time and place where everyone is painfully aware of how bigoted and intolerant people are of homosexuality, I cannot comprehend how careless characters are in this film about flaunting it. This was a relatively minor issue for me, because at least at those moments they were doing something. I have to reiterate that, more than anything, I was completely bored by Brokeback Mountain. It’s a subject that I find compelling, but I need more plot to make it work for me.",
            "review_date": "2018-11-06",
            "source": "rt"
        },
        {
            "content": "Heartbreaking, emotionally packed and very well acted, directed and scripted. This movie is very much worth watching.",
            "review_date": "2018-10-27",
            "source": "rt"
        },
        {
            "content": "At the last breathe, \"Brokeback Mountain\" is a gay cowboy movie according to people who described it as. It's not about gay or whatever is that but you feel sympathy from the character, an empathy to be a real human being instead of assessing people from certain ethnicities or groups. It's an emotional, uplifting, and powerful movie about two men. A film that tries to show how to be a part of nature so that we can love someone whether from any class or gender. With Rodrigo Prieto as the cinematographer who shows the visual beauty of this film and Ang Lee as the director, it's a movie of true feeling whether you see it from any aspect. Actors and actresses who perform with full performance, the music that impresses like country and western, \"Brokeback Mountain\" has at least one of the powerful characters in it because that's what has its effects along with other plots.",
            "review_date": "2018-10-21",
            "source": "rt"
        },
        {
            "content": "The film is basically an emotional rollercoaster and goes as slowly as a 30 year old horse, despite that it has a world of stories only told by emotions, that constantly threaten our beloved characters we learn so much about in the silence.",
            "review_date": "2018-10-20",
            "source": "rt"
        },
        {
            "content": "this is one of my all time favorites, but I take umbrage at the fact that it's dubbed a love story.  hollywood has once again created a tragic story and called it a romance! there's nothing romantic about this ending.  but, is this worth viewing, yes! i have watched this unconventional movie multiple times for the insane chemistry between heath and jake.",
            "review_date": "2018-10-08",
            "source": "rt"
        },
        {
            "content": "Pretty good movie starring heath ledger and Jake Gyllenhaal and directed by the wonderful Ang Lee. For some reason I couldn't get behind this movie. At some points I felt bored but then I felt really engaged. I need to see this movie one more time to give my real review.",
            "review_date": "2018-08-24",
            "source": "rt"
        },
        {
            "content": "A beautiful movie. The plot is captivating from beginning to end, it's powerful enough, emotional and amazing, showing us the relationship between two bisexuals cowboys, with also some satire on the anti gay American society in the 1960s. And of course, both Heath Ledger and Jake Gyllenhaal deliver excellent performances, there character chemistry is very moving, and the filming landscapes are also very beautiful. When ever there's a film with Gyllenhaal in it, you can expect it to be great. And this film is undeniably one of his best, no wonder it won an Academy award. It's an outstanding pic and will definitely become a classic later on. Recommended !!",
            "review_date": "2018-07-29",
            "source": "rt"
        },
        {
            "content": "The most perfect gay film of ALL time... How a fan, I miss the Heath Ledger talent on tv all the time and this will be forever..",
            "review_date": "2018-07-25",
            "source": "rt"
        },
        {
            "content": "A true romance classic no matter what your sexuality.",
            "review_date": "2018-07-20",
            "source": "rt"
        },
        {
            "content": "one of the best romances , beautiful and painful .",
            "review_date": "2018-07-03",
            "source": "rt"
        },
        {
            "content": "Bellissima e toccante storia d'amore che esce dagli schemi e senza esagerare racconta una vicenda nuova a diversa. Senza considerare piccoli rari momenti, il film mantiene un tono molto sobrio e pacato, accompagnato da bellissime inquadrature e una colonna sonora essenziale e poetica. Il tocco leggero di Ang Lee fa sentire ancora la sua presenza, trattando il difficile argomento con una delicatezza che solo lui riesce a raggiungere. Senza nulla togliere agli aspetti tecnici i reali protagonisti sono ovviamente i due personaggi principali, sorretti da interpretazioni ottime e da una storia che coinvolge per il suo ritmo serrato. Il finale amaro chiude alla perfezione un'esperienza intensa che commuove con facilità.",
            "review_date": "2018-05-11",
            "source": "rt"
        },
        {
            "content": "The year 2005 is officially called \"the year that gave us the only best movie there is\" because of brokeback mountain",
            "review_date": "2018-03-31",
            "source": "rt"
        },
        {
            "content": "It's a tragedy.  It's a love story.  It's a tragic love story.  Of course it is, because it is about two cowboys in the 1960s who have a passionate affair one summer alone on the titular mountain in Wyoming.  The affair itself with its beautifully filmed scenic backdrop is delicately handled by director Ang Lee (but not without some visceral moments); however, it is the decades long aftermath that is really the focus of the picture.  Heath Ledger gives a truly exceptional performance as Ennis Del Mar, a man of few words but with strong and deep emotions restrained inside him. Jake Gyllenhaal is Jack Twist, a rodeo bull-rider, who seems weaker than Del Mar but more willing to take risks for love, despite society's prejudice.  After their initial time together, life takes them into the conventional roles for men in that decade - husband (to Michelle Williams and Anne Hathaway, respectively) and father (to two girls and one boy, respectively).  The screenplay (by Larry McMurtry and Dianna Ossana from a story by Annie Proulx) conveys the pain that both men feel in these relationships that do not offer them true love.  And the consequences play out much as you can expect, sadly.  Although this is an expensive prestige picture, and perhaps too safe and polished at times, the acting (particularly by Ledger) contributes to a moving (and crushing) feature that reminds us how far (and yet sometimes not so far) we have come in our journey as a society.",
            "review_date": "2018-03-14",
            "source": "rt"
        },
        {
            "content": "Although slowly paced, Brokeback Mountain is a very sorrowful love story with a very tragic ending. ",
            "review_date": "2018-02-25",
            "source": "rt"
        },
        {
            "content": "Brokeback Mountain is an absolute masterpiece of a film. It not only leaves a lasting personal attachment with the characters but it includes beautiful cinematography that gives the audience a sense of awe and wonder. Yet sadly, this treasured film has been characterized as nothing but the \"gay cowboy movie\". This label is not only homophobic and ignorant, but it summarizes only a small portion of what the purpose and plot of the film is. Even the great Heath Ledger found this to be true when he said \"people are very quick in life to label things that make them uncomfortable\" and that it \"transcends a label\". He continues to say that the films purpose of the film is to show to how heterosexual and homosexual relationships are just the way two human souls love each other and that love is strong and pure no matter which gender they are. I found this to be extremely true that the theme of Brokeback Mountain is beyond sexuality which seems to surprise most viewers. Ang Lee did a perfect job showing the audience that any form of love is deserving of marriage and who are we to decide whether two human and adult people should or should not be together.",
            "review_date": "2018-02-15",
            "source": "rt"
        },
        {
            "content": "i wish i knew how to quit you..\n\nBrokeback Mountain\n\nIt works on a mild score like a musical theatre filled with drama, cheat and decisive that sets up these two flawed yet loved lead characters projected by the master Ang Lee.",
            "review_date": "2018-01-13",
            "source": "rt"
        },
        {
            "content": "Depressing but well-done. Well worth the watch for Ledger and Williams' performances alone, but this one will be a one-time viewing for me. It's ultimately about empty people, and it successfully left me feeling empty too.",
            "review_date": "2018-01-01",
            "source": "rt"
        },
        {
            "content": "The two main guys have so much chemistry. This movie is beautifully shot as well.",
            "review_date": "2017-12-20",
            "source": "rt"
        },
        {
            "content": "A depressingly sad and very well-told love story between two people who didn't know how to love each other in a very cruel and judgemental world.",
            "review_date": "2017-12-01",
            "source": "rt"
        },
        {
            "content": "Wonderful actings, moving story, well accomplished plot twist, and absolute non of the usual lgbt cliches, its completely fascinating.",
            "review_date": "2017-10-25",
            "source": "rt"
        },
        {
            "content": "The pacing at times slows down to a crawl. I never felt the story really got anywhere. Some of the acting was subpar. Yes, I'm looking at you, Jake Gyllenhaal and Anne Hathaway.\n\nBut perhaps I'm being unfair in comparing all the other actors to Heath Ledger. I was only familiar with Ledger from his lightweight movies so I had no expectations from him going into this film. My mind was totally blown away by his performance. His acting was so beautiful and natural. For instance at the end of the film he's playing a man old enough to have a teenage daughter. In any other Hollywood movie they would have slapped a grey wig on him and painted some wrinkles on his face. Here he just ACTED old and I totally bought it. \n\nIf I had to recommend this film to anyone it would be solely for Heath Ledger's performance. This is the role he should have gotten an Academy Award for, not The Dark Knight.",
            "review_date": "2017-09-14",
            "source": "rt"
        },
        {
            "content": "Thanks Ang Lee, thank you for telling us one of the most beautiful forbidden love stories of all time. As some said in the 2017 documentary \"I Am Heath Ledger\", \"it was unthinkable having a story about two gay cowboys before \"Brokeback Mounain\"\". An epic and touching story about love and the imporatnce of not contradicting our feelings. Heath Ledger and Jake Gyllenhaal shined in their respectives roles, this movie couldn't be better, it is a perfect movie and it deserved to be considered one of Ang Lee's best works.",
            "review_date": "2017-09-03",
            "source": "rt"
        },
        {
            "content": "Both Heath Ledger and Jake Gyllenhaal give incredible performances in this heartbreaking tale of two gay lovers and their wanting to be with each other",
            "review_date": "2017-08-23",
            "source": "rt"
        },
        {
            "content": "I really don't get it. I was bored to death throughout this movie.",
            "review_date": "2017-08-03",
            "source": "rt"
        },
        {
            "content": "It is the 1st movie in my personal TOP 10 favorite movies. It was so warm and emotional. It had been a long time since I cried in a movie. If I ever had the time and the chance, I would DEFINETELY watch it again.",
            "review_date": "2017-07-01",
            "source": "rt"
        },
        {
            "content": "The story of a forbidden and secretive relationship between two cowboys, and their lives over the years. An excellent story that has the best elements for a well-deserved Academy Award best picture... Unfortunately it did not came to be, but barely. Crash is not that good and this is one of the best romance films of all time, and the best LGBT film in recent years.",
            "review_date": "2017-06-25",
            "source": "rt"
        },
        {
            "content": "A very powerful film about love. Jake Gyllenhaal's character wants to be with the person he loves and he doesn't care what anyone else thinks. Heath Ledgers character is also in love, but he is the other side, he doesn't want anyone to know he is gay which fills his life full of regret.",
            "review_date": "2017-06-20",
            "source": "rt"
        },
        {
            "content": "a brave film with good performances that leaves you depressed at the end these mens whole lives were wasted living a lie to fit into what society deems the correct way to live its just a waste",
            "review_date": "2017-06-06",
            "source": "rt"
        },
        {
            "content": "great movie to beat your meat to",
            "review_date": "2017-03-15",
            "source": "rt"
        },
        {
            "content": "Superb.  We need more films like this!",
            "review_date": "2017-03-12",
            "source": "rt"
        },
        {
            "content": "This was a film I have thought about watching for some time, but often decided not to. I was not impressed or disappointed. I was not touched or disgusted. It was simply interesting, and slow paced. The emotions run deep. The drama is a bit strong at times. But the acting was brilliant throughout.",
            "review_date": "2017-03-09",
            "source": "rt"
        },
        {
            "content": "Pretty tragic love story.  Excellently played by the cast all around.  Still though, I find it harder to completely sympathize with these guys over their wives.",
            "review_date": "2017-02-28",
            "source": "rt"
        },
        {
            "content": "\"a beautiful journey with outstanding performances.\"",
            "review_date": "2017-02-28",
            "source": "rt"
        },
        {
            "content": "Cant stand this film i just didn't feel sorry for any of them",
            "review_date": "2017-02-27",
            "source": "rt"
        },
        {
            "content": "Yep, you knew youd find me here. Words cant describe this film to me its my muse, I love you richard",
            "review_date": "2017-02-09",
            "source": "rt"
        },
        {
            "content": "For all its technical subtlety, this is a film with zero human subtlety. Everything is shoved - ever so gently - in your face to make sure that you no chance to have  (God forbid) your own ideas and interpretation. You will feel the love and the heartbreak, but it feels planned and calculated to within an inch of insulting.",
            "review_date": "2017-02-05",
            "source": "rt"
        },
        {
            "content": "Why do you need to see this movie?\n1-Ang Lee\n2-Ang Lee\n3-Ang Lee",
            "review_date": "2016-12-28",
            "source": "rt"
        },
        {
            "content": "Brokeback Mountain can drag at times like most Westerns and romantic dramas, but its heartfelt story combines with Ang Lee's direction and its two leads make this an absorbing and memorable love story.",
            "review_date": "2016-12-20",
            "source": "rt"
        },
        {
            "content": "The chemistry between Gyllenhaal and Ledger, as well as their characters, was phenomenal. I absolutely loved how well the story played out. Everyone played their roles quite well (as expected from an Ang Lee film), and the climactic scene was an absolute thrill. I don't watch a lot of movies, but I'm glad I watched this one.",
            "review_date": "2016-11-07",
            "source": "rt"
        },
        {
            "content": "Well if there isn't a more diverse director than Ang Lee, maybe the only director who's films vary more would be Richard Linklater, (A Scanner Darkly, Boyhood, Dazed and Confused, School of Rock) or the late great Stanley Kubrick, (The Shining, 2001: A Space Odyssey, Full Metal Jacket). After the overblown, over serious mess of Hulk, Ang Lee has a go at another incredibly serious and incredibly worthy effort in Brokeback Mountain, just on a much lower budget. This time instead of subverting the action comic book movie Ang Lee has a go at subverting the equally serious and bravado filled genre of the western. Y'know I want Ang Lee to go off and make a stoner comedy. See how he likes that. \n\nBased on the eponymous short story by Annie Proulx, Brokeback Mountain follows the forbidden love of two gay cowboys and how they have to suppress their love in order to live. It stars Jake Gyllenhaal, (Donnie Darko, Nightcrawler, Zodiac) and Heath Leger, (The Dark Knight, 10 Things I Hate About You) as the gay cowboys amid a fine supporting cast that includes Anne Hathaway, Kate Mara, and David Harbour. It was actually quite entertaining to see people who have since gone on to bigger and better roles and think 'oh that went on to do that thing, like House of Cards,  Stranger Things, and um... Fantastic Four'. \n\nThe real star of this film though is Ang Lee. His auterial fingers are all over this one. It's got the same trade mark sort of natural beauty and landscape poetry that we saw in things like Life of Pi and Crouching Tiger, Hidden Dragon, and it's got the kind of worthy, sedentary pace we've come to expect from him, as well as the sort of outsider's eye to american genres that he's shown in other works. Aside from that it's clearly a very technically minded and stylish film, and technically it is very well made. Ang Lee wanted to show off and he did, but in a way that's also the problem. There is a degree of detachment to this film that stops you getting really emotionally involved. Watching it, I feel one removed from what's happening on screen in front of me. Now, to take a film like Drive, that's a film with a plot that wouldn't necessarily have you emotionally involved, but the high professionals sheen and style serves to get you involved. Whereas I feel in this film the high style of it only served to detach me from a story that I would otherwise naturally be emotionally involved in. It is a very involving story, and I did feel for the characters, (Heath Leger in the leading role truly shines in a very understated performance, died too young), but at the same time I felt like an outsider looking in, very much like Ang Lee himself is, instead of being truly into the story. There's something about how wiggy is is, something about the performances in some roles that doesn't quite gel. I would have preferred Ang Lee to focus on the essentials that convince you of the world instead of how to capture a nice shot, or the hair and make up for the period setting. \n\nI feel like now I need to talk about Jake Gyllenhaal. His has this underlying creepiness, this sort of gaunt visage that he played perfectly in Nightcrawler, but here, he's kind of miscast as the live wire romantic of the couple. He comes across as disingenuous and his liveliness is honestly more irritating because he just doesn't make it seem natural.\n\nIn the end Brokeback Mountain is a very solid film, but it lacks the emotional involvement to elevate it to something great.",
            "review_date": "2016-11-03",
            "source": "rt"
        },
        {
            "content": "This is the best 2005 could produce? Then it certainly deserved best picture. Nothing against gays, but this was a tolerable performance of a gay couple separated by responsibility to others.",
            "review_date": "2016-10-08",
            "source": "rt"
        },
        {
            "content": "A terrific film.  Both Heath Ledger and Jake Gyllenhaal were fantastic.  I thought this was Heath Ledger's best acting spot (didn't are for his Joker portrayal).  The ending was sad since Jake's character died and the two of them couldn't live happily ever after with each other.",
            "review_date": "2016-07-31",
            "source": "rt"
        },
        {
            "content": "It's fabulous baby!!! Hahaha no homo",
            "review_date": "2016-07-25",
            "source": "rt"
        },
        {
            "content": "The cowboy aspect I wasn't all into and it took me almost an hour to really be invested in this movie but the back half is so incredible and in the end I was appreciative of the film as a whole and it really covers some topics that I've never seen on screen before and moved me deeply.",
            "review_date": "2016-07-25",
            "source": "rt"
        },
        {
            "content": "This movie was great more for characterization and choice in characters rather than plot. It is slow but the detailed scenes (like art to an artist) and crafted raw passion between two men make it up. I see GBLT movies, and the directors usually find (on purpose or not) a male stereotypical looking \"feminine\" woman \nto balance the other person who is stereotypically male. I guess to save face that there should be male and female roles even in homosexual relationships. In Brokeback Mountain, I did not see this at all. These men did not have anything that I would say is bias as with other homosexual oriented media. The only thing that was a little off was the \"moon in the sky\" and references to sin. Though that is so little compared to the characters and their acting. \n\nThis is a movie more for the art than anything else. A film lover or one that has a passion for film making through the artist eyes would find appreciation in this movie. Others not so much since it doesn't build up to the plot to lighten the effect of the first erotic scene. That, and I think the erotic scene may put a raw impression on the future intimacy scenes. \n\nAgain, characterization, art, and attention to detail was perfect. \n\nI recommend it for anyone who can see passed media's perspective on homosexual relationships.",
            "review_date": "2016-07-23",
            "source": "rt"
        },
        {
            "content": "Gret movie they have a beutiful relationship a powerful message i can stand behind lol :)!",
            "review_date": "2016-06-09",
            "source": "rt"
        }
    ]
}