{
    "rating": 7.4,
    "release_date": "2005-11-18",
    "num_reviews": 569,
    "genres": [
        "Fantasy",
        "Adventure"
    ],
    "summary": "The fourth movie in the Harry Potter franchise sees Harry (Daniel Radcliffe) returning for his fourth year at Hogwarts School of Witchcraft and Wizardry, along with his friends, Ron (Rupert Grint) and Hermione (Emma Watson). There is an upcoming tournament between the three major schools of magic, with one participant selected from each school by the Goblet of Fire. When Harry's name is drawn, even though he is not eligible and is a fourth player, he must compete in the dangerous contest.",
    "reviews": [
        {
            "content": "This is the first film in the series that started to pique my interest. But, I still remain unmoved by Harry Potter. The movie is fine, but nothing special.",
            "review_date": "2023-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The emotion and magic really stand out in this film; these elements give the movie more than just flames, but a full-blown fire.",
            "review_date": "2023-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest 02 hours: and 37 minutes ever!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2023-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As magical as this movie is, \"Harry Potter and the Goblet of Fire\" seems incredible at first, but reading the book shows how poorly this movie was adapted.",
            "review_date": "2023-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am really liking this franchise, so many good things to talk about!",
            "review_date": "2023-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its enjoyable, but a lot of it was completely made up for the film and doesn't make much sense",
            "review_date": "2023-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter and the goblet of fire is a very good moovie , it's my favorite moovie on the world. The realisator is Mike Newell and the leads actors are : Daniel Radclife ( harry potter ) , Ruper grint ( Ron weasley) and Emma Watson ( Hermione Granger ) . It was released the 30 november 2005. It s the story of harry potter who gone to hogward for his 4th year and it s the year where there is the goblet of fire . He is too young to participate and he don t want to because it s really dangerous. But no one know why but harry potter was registered to participate. In my opinion the actors are very good  when we see the moovie we really think that we are at hogward because the acting is so good. When we see the film we feel that the actors really lives at hogward. The soundtrack is really good it s all my childhood . The costume look like they really exist , that the hogward's magic really exist , it's the costume's power and the cinematographie let us fell that we are really to hogward ,  it's magic. The theme is wizard , not everyone can like it because it is a very special theme that not everyone can like. But the positive point is that you can escape the real world to go to a magic one whereas it is hard  to stop dreaming after the moovie. In my opinion it's the best moovie you can see in your whole life if you like fantastic moovies. I really recommand pepole to see these movie.",
            "review_date": "2023-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good film Hermione just built different and Ron kinda dumb though. Harry that dude just needs a haircut. But the best baby Voldemort without a nose best CGI ever!!",
            "review_date": "2023-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Goblet of Fire could improve. It is probably the 2nd lowest movie in my list of the HP franchise. But the visuals are a treat and watching the Triwizard Tournament is definitely amazing, the characters also start to mature and each movie turns darker and darker as it goes to the last one. And this is the first HP movie with a PG-13 rating. Mike Newell does a decent job in making this movie and could improve in the directory view. But nevertheless the golden trio always shine.",
            "review_date": "2023-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am a huge fan of Harry Potter and I was really looking forward to the release of the film because it was one of my favorite books! \nThe film shows the competition where 3 rival schools of magic take part to get a Triwizard Cup. Harry is chosen as a representative from Hogwarts and has to face lots of difficulties on his way to the Cup🏆🔥\nThis is a really gripping and exciting film - I have never watched anything like it  before. The ending is really surprising - I definitely wasn't expecting it. The plot is fast-paced and full of action and mysterious scenes. A lot of new evil characters appeared in this part. All of them were absolutely different but well-developed and interesting. What's more I really enjoyed the special effects. They were unbelievable.😍😍😍😍😄😁😁😁🤪🤪🤪🤩🤩🤩💕💕\nI would highly recommend this film to anyone who enjoys fantasy and adventure stories. I believe it is a great film and it is definitely the best in the trilogy. My rating is 100000/10🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆",
            "review_date": "2023-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not my favorite but still decent",
            "review_date": "2023-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Goblet of Fire is the best movie in the franchise with the movie being entertaining and the characters maturing",
            "review_date": "2023-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "my fav one. i could watch this on loop for the next 20 years and never get bored of it",
            "review_date": "2023-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter and the Goblet of Fire is my favorite book in the franchise. For that reason, am I a little bit hard on this film? Probably. \n\nThere is a lot of subject material to get through in this movie (37 chapters compared to 17, 18 and 22 in the first three films respectively) and it shows. The film is incredibly fast paced and a little jumpy. While the Triwizard Tournament is exciting, the quiet moments with the core 3 are lacking.\n\nThat being said, this is still a Harry Potter movie, and I could watch these films on a loop. The story is full of misdirection, exhilarating stakes and one of the best finales in the franchise. I find myself bawling my eyes out during/after the graveyard every time. \n\nThis movie raises the stakes and brings the world of Harry Potter to the next level. I love Harry's response to Hermione's question, \"Everything's going to change now, isn't it?\" He, like the audience, knows that there is no turning back now.\n\nBest Character: Fred and George Weasley\nBest Scene: The Graveyard\nBest Quote: \"Dark and difficult times lie ahead. Soon we must all face the choice between what is right and what is easy.\" - Albus Dumbledore\nBest Piece of Score: Harry in Winter\n\nAdditional Note: I needed more Sirius. \nAdditional Note 2: Dumbledore is so frustrating in this movie. He is aggressive, brash and not the calming force that he is supposed to be. He finally calms down in the dormitory scene, but for the most part, I found myself missing Richard Harris.",
            "review_date": "2023-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's ok. A great time passer but not well compared to the book",
            "review_date": "2023-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Harry Potter and the Goblet of Fire\" finally sets the franchise in motion with the dark lord's return, and the plot is less convoluted than its predecessors. However, it arguably relies too heavily on its climax.",
            "review_date": "2023-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fourth film makes a cinematic and graphical leap that separates it from the first 3. The ending and new characters introduced make this one of the best in the series.",
            "review_date": "2023-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter and the Goblet of Fire is an absolute spectacle. I am a huge sucker for tournaments in films and this hit every single note for me; intensity, stakes, creativity, it is all there.\n\nOur main cast is doing some of the best acting of the series, Daniel Radcliffe really raises his performance up a notch and establishes himself as the lead of the franchise. His acting is refined and mature and he does an excellent job portraying his emotions with not only his line delivery but his facial expressions and body language. He really broke through here and it was a joy to see. Rupert Grint and Emma Watson were great, but they had a slight decrease in screentime and really were sidelined during this film. The introduction of Robert Pattinson as Cedric Diggory brings an interesting dynamic to the story, as Harry Potter has somewhat of an older brother figure to contend with. The relationship and chemistry between the two builds and brings some emotionally heavy scenes throughout.\n\nThere is constant action in this film; from the opening scenes of the Quidditch World Cup to the multiple rounds of the Tri-Wizard Tournament, there is always something happening, and it helps create a very steady pace throughout. Not only is there action, but there is also fantastic character development. All of our characters really start to come into their own through the struggles they all face throughout the film. Harry is the best he's ever been, and the new faces are great on screen. Alastor Moody is mysterious and quirky and is a great mentor to Harry.\n\nBut the greatest thing about this film is the sinster introduction of Lord Voldemort. His presence was lurking in the background of the entire series, but here he is reborn in a horrifying way. Ralph Feinnes is superb in his only 6 minutes of screen time, but it is enough to leave a lasting impression. The ending is perfect and sets the tone of the franchise going forward.\n\nWhile the cinematography and tone might be better in Prisoner of Azkaban, I cannot deny that this movie is better in almost every other aspect, which is why it gets a slight nod.\n\nScore: 89%\nVerdict: Excellent",
            "review_date": "2023-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With lots of action packed, eventful, dark and mysterious scenes, this movie is easily one of the best from the franchise.",
            "review_date": "2023-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun, slightly more dark ride where we see all that Harry Potter has to offer.",
            "review_date": "2022-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie. Disappointing what was left out from the books. Should have been two movies but still a great and entertaining watch ",
            "review_date": "2022-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They ruined the best book in the series. Worst HP adapation ever.",
            "review_date": "2022-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fourth Harry Potter film is the best yet. The main actors are now performing consistently well. This is a much darker film than the three that preceded it. For me, this film was well paced and the directing was significantly better than the previous film. \n\nThe music used in this film is noticeably less good than the previous movies and it was only when writing this that I wondered if was composed by someone other than John Williams - indeed it was, by Patrick Doyle. Having just finished watching the film, I cannot say that I recall a single piece of music from the film.\n\nThe graveyard scene, the film's climax, was not as strong as it could have been, but is clearly important in setting the stage for events in the movies that follow.  All in all, a highly recommended watch.",
            "review_date": "2022-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ago It was fine until Cedric died.It had me crying. But after Cedric died it was exciting.",
            "review_date": "2022-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Movie Is Good Without 1492 Pictures.",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was fine until Cedric died.It had me crying. But after Cedric died it was exciting.",
            "review_date": "2022-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While I think the overall writing and directing is a step down from the previous movie, Goblet of Fire still get a lot of points for having more spectacle and a strong finale. Unfortunately, there is a lot of uninteresting teenage drama taking up the runtime, and while the tournament is largely entertaining, it comes at the cost of most of the established characters being sidelined.",
            "review_date": "2022-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is what the first 3 movies built up to, voldemort returning was very well done, the triwizard tournament was great. Overall i just think its a great movie.",
            "review_date": "2022-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Taking the series into a more mature and adolescent direction, Goblet of Fire makes the main trio much more socialized, adding distinct effects, memorable and well-crafted action and momentum further complements this movie's success, while also first showing Ralph Fiennes' iconic villain in body for the first time, adding up to a much more darker and exciting second half of the series.",
            "review_date": "2022-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It’s a classic and the first time you get to see Lorr Voldmart",
            "review_date": "2022-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie and definitely the best in the trilogy",
            "review_date": "2022-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"| Ratings Categories |\n{Characters (7/10) ; Cinematography (6.5/10) ; Plot (7.5/10) ; Acting (6/10) ; Pacing (8/10) = 70%}\"",
            "review_date": "2022-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing, beautiful, show stopping, incredible, should sue these movies more often",
            "review_date": "2022-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not one for the purists.  So Harry Potter (Daniel Radcliffe) has returned to Hogwarts for the fourth year of his wizarding education.  This year, the school is hosting the Triwizard Tournament, which is a dangerous and prestigious competition.  Two other visiting schools have champions to offer, but when Harry gets unexpectedly chosen as Hogwarts' unprecedented second champion, something must be amiss.  Now I have always regarded Goblet of Fire as my favorite book and least favorite movie.  I remember griping about how much the movie left out in comparison to the source material, and as I make my way back through this series, I tried to approach this movie with more of an open mind.  Well, years may have passed, but I still feel exactly the same way.  Now I'm not here to air grievances for these movies failing to include every plot point in the book.  On the contrary.  The third movie is probably my favorite of the entire series, and it leaves a lot of action on the pages, but it is all for the benefit of story flow.  I will even commend Goblet of Fire for cutting the entire house elf subplot, as you could only do that thread justice if you had a television format of storytelling.  What I will complain about is the choice to make cuts that come close to making this story not make narrative sense.  I'm not exaggerating much when I say that they get through the opening ten chapters of this story in about ten minutes.  It puts such a tight restraint on any potential flow this movie could build, and I don't feel like scenes in this are given any room to breathe.  The book takes its time to let situations unfold naturally, but this movie always feels like it is in a rush to get on to the next big moment.  Because of this, every character feels like they are trying to hastily progress the plot, and you stop buying that they are acting there in the moment.  It's almost as if the makers of this are reliant on the fact that you've read the book, so you are therefore willing to accept the shorthand this movie has to offer.  I am here to tell you that is poor filmmaking and storytelling.  Despite having many objections on how this got handled, this movie is not without its moments.  I think the scenes involving the dragons are pretty cool, and even though the CGI is a bit dated at this point, it is still put together in an exciting fashion.  I also think the teenage melodrama actually works more than it doesn't.  These are real fights that kids would have at this age, and the actors do a good job of selling it.  This movie feels like a bare minimum effort in comparison to the other films, and I think this book would work far better as a mini-series.",
            "review_date": "2022-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I do like the characters more and more. I read the book and after reading the book I watched the movie. In the movie was not what you expected. Also the film was too long for me. Pure because the new characters and story I gave it a 4*",
            "review_date": "2022-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My rating for the film is a 8.0/10",
            "review_date": "2022-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fabulous movie! The story perfectly presented a well-crafted plan for the arrival of one of the most impactful moments in the franchise.",
            "review_date": "2022-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was a good movie but harry's haircut is weird",
            "review_date": "2022-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One minute, you are entranced with a touch of magic and sorcery. The next minute, you come face to face with a dragon, mermaids, and many scary creatures that come your way. HARRY POTTER AND THE GOBLET OF FIRE is one of the scariest entries in the franchise, but it puts up a brave face when it comes to being involved in a tournament you can never escape from. What surprises me the most is that as Harry and his friends start to become adults, so many possibilities open up, and this film proves it.",
            "review_date": "2022-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was a real dissapointment, compared to the other films. The film itself was really nice, but it did not follow the books AT ALLLLL!! It was like the plot took a vacation to make up island.  This film deserves a 12/20.",
            "review_date": "2022-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry is maturing, and so is this series. Terrific execution from director Mike Newell, who manages that tricky balance of spectacular action and the charming comedic moments. Fun from beginning to end, the cast is really evolving and the progressing darkness is intriguing",
            "review_date": "2022-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You thought Harry Potter 3 was good, Harry Potter 4 is better in every way possible (other than the haircuts.) My only problem is a few charicters aren't fleshed out.",
            "review_date": "2022-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it. Just wish they added more details into the movie from the book.",
            "review_date": "2022-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I dont get why people hate this movie so much. I loved it. Voldemort's return was perfect. The battle between Harry and Voldemort was awesome. The Tri Wizard tour dement was a great storyline. I think people are just mad because some of the stuff in the book was not there. But what do you expect from a book that big.",
            "review_date": "2022-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This isn't my favorite but I still like it",
            "review_date": "2022-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's no way you can't like Harry Potter",
            "review_date": "2022-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best installments of the series. Way better than the 3rd movie which had terrible pacing.",
            "review_date": "2022-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter and the Goblet of Fire features an interesting set up, great action and finally introduces the main conflict and sets the tone for the rest of the series.",
            "review_date": "2022-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This for me is where the franchise really stepped it up...the main characters aren't just kids anymore and this allows the story to mature also",
            "review_date": "2022-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lots of great stuff in this film and is also the first of the darker movies, that Graveyard scene alone is amazing. However, quite a disappointment compared to its book counterpart but that's what happens when you have a director who didn't read it",
            "review_date": "2022-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 4th movie in, Goblet does not spend a lot of time trying to explain anything. In fact, for being 2.5 hours long, it speeds along so quickly that minor details and plot points get lost in the mix. The overarching story is fine and there are a few decent moments. The movie's best strength is its portrayal of teenage awkwardness - much more closely portraying teenage angst, love, and ambition than most movies in the teen genre. The fantasy elements are all there, just jumbled together in a CGI mess. Not the best Harry film and not the worst.",
            "review_date": "2022-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "He who must not be named Returns. Goblet of Fire shows the cast maturing but it doesn't double down on the great story telling and powerful performance.",
            "review_date": "2022-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "in my top 3 because it's easy to watch but ain't the most interesting one tho",
            "review_date": "2022-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I absolutely loved this movie",
            "review_date": "2022-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cannot find fault with the movie",
            "review_date": "2022-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter and the Goblet of Fire is awesome. The story is the best from every sector. considered perfect The start of the battle, adventure, action that has come into play due to the fact that in this sector Hogwarts has organized a Triwizard tournament. Tourmemt and other magic schools are also participating. Each school will send a representative to compete in this magic tournament. The age of the participants must be at least 17 years old, although Harry is not yet. Reached the criteria, but he accidentally entered the competition. This creates a lot of turmoil because the life expectancy line that Dumbledore, Head Professor of Horgwarts, has a dash. There's no way a child under 17 can deceive, causing the whole school to think that Harry lied that he wasn't doing it, and Harry's best friend Ron became jealous because he thought Harry wanted to be a hero. That's a really crazy idea for me. It frustrates me a lot with Ron's stupidity, but it's understandable because it's Ron Lol, and it leaves Harry out of nowhere. I'm so sad.  Ron is seriously bipolar in this regard.\n\tI liked this part because I saw the development of the relationship of the 3 friends, the different stages they had to prepare. It gave me a lot of excitement, such as the amazing battle between Harry and the dragon. He fights with excitement. And the scene where you have to open the underwater crystal ball in order to hear the hint to understand because it's a hint from the mermaids that make it on land to not understand. It was a scene that was truly unthinkable. seeing many wonderful things The creatures in the magical world that I had imagined while reading. The effect is done very well. Many characters appear in this installment a lot or even Harry has used what he learned to compete. It's amazing how he remembered what he had learned, Lol.\n\tThe movie puts more pressure on the viewers with the final mission that viewers like me watch and become uncomfortable instead. because everyone was led into the maze There aren't any demons here, but what we do find is the fear in our minds of going in the unknown and unfamiliar places. Suffocation and the scene clashing with the resurrected Lord Voldemort. He was really scary but he killed my Cedric which was way too easy. The effects of this movie never really disappoint. Every scene is great, amazing blend of magic, horror, humor and comedy and it's extremely entertaining and darker than the previous films.\n\tIt's not a perfect movie. A lot of things were rushed and skipping the good ones made me still prefer the book. but for the time 157 minutes watched I'm not disappointed at all It's a very good time. I will definitely continue to watch it every year, I believe that. I recommend.",
            "review_date": "2022-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect Sequel\nHarry Potter film so far. Although it was long, it did not drag on. It had a nice, tight feel to it. It progressed from scene to scene with a smoothness that i find to be lacking in many movies adapted from books. The acting has noticeably improved from the first three, and the more adult feel to this one really drew me in. Perhaps the most interesting aspect of this movie was the fact that it felt like a mix of genres. This episode contains loads of adventures and action and it is such deeply riveting and emotional ; beside , still have bombastic special effects and several images have you on the edge of your seat , including an amazing array of technical bizarre creatures , a breathtaking combat between Harry and a dragon , a rescue from sea deep of his friends and an exciting battle between Harry and the Dark Lord and his henchmen , the Death Eaters. The picture displays stimulating action set pieces illuminating the full-blown adventures , blending wizardry , witchcraft , horror , humor and being extremely amusing and enjoyable . Darkest even than previous chapters ; it is more thrilling ,more dramatic , more touching and more exciting. Finally, I would like to recommend this movie for everyone to try and see. Everyone can see the friendship of their friends or even the love and sacrifice of parents or people who love us. A fight against injustice that everyone believes must be overcome with Harry as their only hope. The courage of a boy who must fight evil. By inside, he is afraid,  but with courage and encouragement and support from those around you  It gave him the strength to fight that darkness.",
            "review_date": "2022-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked this film very much. It is much darker than the previous outings, but not as faithful to the source material. The only thing I didn't like so much about the book, was the subplot about Hermione trying to help house elves. It was cute, but interfered too much with the dark overtones of the narratives. The film looks dazzling, especially the ballroom scene. Speaking of that scene, I adored that dress that Hermione was wearing, Emma Watson looked unrecognisable in that scene.Also the music by Patrick Doyle this time was beautiful. I don't think it's as dark as the book, and I wasn't too keen on some of the casting. Roger Lloyd Pack and David Tennant were fine in their roles as the Crouches, but their characters were changed significantly. I did wish they made Crouch's disappearance more mysterious, instead of giving it away, ruining the suspense that was quite compelling up to that scene. I am not too keen on Michael Gambon's Dumbledore, I just don't remember Dumbledore being violent as they made him. As I've said already, I much prefer Richard Harris as the character. I am also on the fence about Mad Eye Moody. Brendan Gleeson is a very talented actor, evident in films like In Bruges and The General. He looked the part, but his voice wasn't exactly what I had in mind for Moody. I have listened to the audio tapes by Stephen Fry, and I imagine Moody's voice as low and gravelly. Although Gleeson mostly succeeded with his role, I personally think he tried too hard. My brother also noted that he didn't like the execution of the three tasks. I didn't like the third task, and the other two were fine. I did think on a positive note that Ralph Fiennes as Voldemort was suitably scary, and with the exception of Dumbledore everyone else was well done. All in all, a flawed but quite engrossing film, that doesn't quite live up to the darkness of the book. 8/10 Bethany Cox",
            "review_date": "2022-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I never thought to be the person to say that the book was better than the movie, but here I am. I understand that time is limited when I comes to movies, but there is also a point where they leave out too many key details or rush the storyline too much. IMO the key moments that happened in the book was unfortunately toned down significantly. The movie as a whole felt like a fast highlight reel rather. If this rating wasn't about the storyline I'd give this movie 5 stars for the immersive wizard world. Production was on point 10/10!",
            "review_date": "2022-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Throughout most of my years watching Harry Potter, I've always considered Goblet of Fire to be one of, if not, my least favorite of the entire franchise. The tone is all over the place, the pacing is too slow, and the attempts at relatability just end up being more cringeworthy than anything because the film has no idea whether it wants to be a dark turn for the franchise or just another school adventure for Harry and the gang.\nAnd yet, at the same time, I still found myself actively returning to this movie time and time again on its own, outside of binges of the entire franchise. The characters are all still likable, the wizarding world itself is still just as imaginative as ever, and when the movie wants to go dark, it's brutal, eerie, and really memorable. \nI'm very conflicted! I think it's objectively bad, but I still enjoy it, faults and all. I guess that's what some may call a guilty pleasure.",
            "review_date": "2022-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible world-building, immersive storytelling, and great performances from the cast make this franchise fresh and amazingly entertaining even on its fourth installment.",
            "review_date": "2022-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is better than the third movie and the movie has a amazing story but sometimes the story gets messed up and the appearance of voldemort is scary and enjoyable this movie is enjoyable watch this movie",
            "review_date": "2022-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked everything!!!!!! It was awesome!!!",
            "review_date": "2022-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "absolutely amazing from start to finish! I truly felt like I was watching the movie for the first time again!",
            "review_date": "2022-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a real thriller. The darkness and excitement throughout the whole movie is something we didn't see in the previous movies. That makes this movie really great.",
            "review_date": "2022-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can touch you now!",
            "review_date": "2022-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As this film signifies a darker turn in the series, we see the characters begin maturing physically, emotionally, and even romantically. This broader scope of the world creates a deeper connection for the audience. With the continuation of great characters, as well as the introduction of new ones, we fall in love with these characters and begin understanding their goals. While John Williams is one of the greatest music writers in modern history, Patrick Doyle is a great successor! (Shoutout to Jeff Rawle, who plays such a small role, but creates one of the most moving and memorable moments in the series).",
            "review_date": "2022-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just another epic Harry Potter Adventure... these movies are amazing. They never get old as we do.",
            "review_date": "2021-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favourite Harry Potter movie.",
            "review_date": "2021-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The characters and the plot mature, which gives it the life it needs to thrive in the second half of the series, making it a fantastic film.",
            "review_date": "2021-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow! I loved this movie.",
            "review_date": "2021-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everyone's so sexy with long hair in this movie",
            "review_date": "2021-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lot of the good stuff from the book didn't make it through, so I'm a little disappointed. I at least want to see the Bulgaria quidditch match, but oh well.",
            "review_date": "2021-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After making three movies, the makers now understand what to do to make a great movie. That resulted in being my favorite Harry Potter movie. The acting is great, especially by Rubert Grint (Ron) and Brendan Gleeson (Alastor Moody). Also the plot is great, where we see Voldemort becoming 'human'. \nAbsolute Must See!\nPS: One thing I don't get is why all the boys (Harry, Ron, Fred, Gearge, Nevil et cetera) have long hair.",
            "review_date": "2021-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great Harry Potter movie!\nOne thing I always admire about the Harry Potter movies is how they not only focus on the main plot, but also have time to show other, world building things. I feel like they perfected that in this movie, unlike in the first movie which was waayyy too much world building and not enough plot.\nAs always, the twist at the end is top notch.\nI love the setup and implications for the future - like they say in the movie, everything will be different from now on!",
            "review_date": "2021-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is an interesting film but a bit slow at times, with parts that you feel a disconnect if you have not read the books.\nThe good thing is that it is already darker than the previous ones, giving us scenarios and an atmosphere more in line with what is coming and what is happening in the magical world.",
            "review_date": "2021-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are a lot of neat concepts on display in this movie, and as such, it's a real shame that more aren't done with them.  This movie is 157 minutes long, and only the last 10 minutes actually amounted to anything.  The rest of it is a self-contained story that has very little in the ways of actual plot, and the big reveal at the end ultimately negates half of what came before, as it turns out that a good chunk of it was a ruse (but not in the ultra-satisfying way as something like Hot Fuzz or the first Saw).  Throw in the fact that the movie is also darker and murkier than the other entries, before and since, and the very mediocre performance by Robert Pattinson (already one of the most over-valued people in the industry).  The mystery element involving David Tennant's character, Harry Crouch Junior, is really the only thing of real interest beyond the end, but it never actually amounts to anything either, as the audience already knows that he's evil, and once he's found out, his story ends literally seconds later..  All in all, the movie isn't 'bad' by any means - it's just almost entirely meaningless in the grand scheme of things, and honestly, it's just self-indulgence that this movie was a solid hour longer than it needed to be.",
            "review_date": "2021-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ooo, I get what's going on.",
            "review_date": "2021-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Always great to see harry potter in the theater",
            "review_date": "2021-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Goblet of Fire is a dark novel, so it's only fitting that this film adaptation is darker than the previous three. And despite there being a different director, it is comparable in quality to the Prisoner of Azkaban; it's a really good film. Because of the fact the novel is like 600 pages long, there's a lot that had to be left out. That being said, it's ultimately a great success, and the acting is superb. Ralph Fiennes is the perfect Voldemort!",
            "review_date": "2021-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Goblet Of Fire introduces more action, dialogue, and moments we will treasure.",
            "review_date": "2021-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "90/100 idk why some people disliked this movie, is the first appearance of voldemort",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful, absolutely wonderful. I've only just started rewatching this series of movies however this one may be my favorite out of all of them. Absolutely a must watch.",
            "review_date": "2021-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although it fails in the search of the real spirit of the saga \"The Goblet of Fire\" is for me the best Potter's Movie. 9/10",
            "review_date": "2021-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was bored at the beginning, laughed so hard at the ball scene, and almost cried at the end.",
            "review_date": "2021-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "why are they british",
            "review_date": "2021-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty much like a teen movie, but it has his nice moments",
            "review_date": "2021-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a ton of fun, however the book is immensley better - imo this already amazing film could have been even better.",
            "review_date": "2021-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Imperio… Crucio… Avada Kadavra… now time to go to Azkaban.\n\nSo there's more than one wizard school. The plot is about the Triwizard tournament, where each school's representative battled for the glory. But somehow Potter was chosen as the fourth contestant, and we have ourselves a fun and intense story.\n\nI was surprised and happy that I wasn't bored through another two and a half hours of this franchise. This is the first one that kept my interest throughout. Again, there were more unique wizard stuff that further expanded the universe. This was always fun to watch, and this movie still kept that tradition going.\n\nThe first half actually was teen drama where the students went to a ball. The romance was more prominent, and even became naughty in some scenes.  What drove the plot was the tournament, and the looming danger that hid beneath it throughout the runtime.\n\nWhen the imminent doom hit at around the last round of the tournament, the movie became vastly more intense. For the first time, I felt that Harry's life was in actual danger. \n\nAs for problems, the runtime was still a tad bit long. Also, some of the rounds in the tournament were pretty weak an could have been more fun.\n\nOverall, this movie is where the main story actually starts. 9/10",
            "review_date": "2021-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As the characters' maturity develops further in this chapter, the plot involves something akin to The Hunger Games and gives us a first introduction worthy of Lord Voldemort.",
            "review_date": "2021-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie. I think its predecessor was better, but still, great movie all aroud and the whole story just explodes. Crucial movie.",
            "review_date": "2021-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much more painful to watch than any other, but for the right reasons. The introduction to the stage of life where romance, dances, school competition, and general teenage angst and cringe, holds up surprisingly well. Additionally, I'd argue that this film improves and modifies a significant aspect from the book that weighed it down significantly (Barty Crouch Jr's role), to that of being much more coherent and comprehensive.",
            "review_date": "2021-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, original, & romantic!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2021-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For me this is the weakest movie. On it's own this is a great movie and you won't get bored at all, but the rest of the franchise delivers more magic.",
            "review_date": "2021-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The darkness has been turned up a few notches. Great sequel. ",
            "review_date": "2021-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Newell really did the worst job on this concept. He ruined the story that J. K. made and didnt even read the book to make it fine and whole for us fans. He wanted only to surpass Alfonso Cuaron. The original fans understand this but the ones that has seen only the films dont. 3 stars only because its Harry Potter. For the selfish director 1 star is far more than enough.",
            "review_date": "2021-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 4th year, a lot darker than the first three, and the actors are getting older. I love it!!!",
            "review_date": "2021-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The four entrie in the saga and where they just f****.\nThis movies doesn't respect is source material like the first three but if you never read the book then you probably gonna enjoy a lot.",
            "review_date": "2021-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This has to be the most fun and rewatchable Harry Potter film ever made! There are some sequences in this movie where it can get partially annoying, but everything else in this movie makes up for it. Even though this is my least favorite Harry Potter book made, I'm glad that they didn't include every last detail from the book, like Dobby being in this movie (because I don't really like him). Want to watch Harry Potter and a fun movie combined? Look no further than this one! My overall opinion: 9/10.",
            "review_date": "2021-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "hint: snape kills dumbledore",
            "review_date": "2021-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Newell did more things right here than Cuaron did with the third movie and it's not even close. He makes the most out of the lengthy runtime here by excising a lot of the subplots in the novel in an extremely successful way as it allowed more time to be spent on the climactic finale than had been allotted in any of the previous 3 movies. There was more interaction between the characters and a highly appreciable increase in comedy. The actors had grown up quite a lot and were doing better in each iteration at showing their acting range, with Hermione a particular highlight in this one. Doyle acquitted himself remarkably well, with his film score on par with Williams's previous three and the CGI had improved drastically even with only a year's time passing. Best of all was the source material itself as the underdog sports genre is probably my #1 favorite and the finale here is probably the best in the entire series, both the graveyard part and the quasi-epilogue reveal. I think Cuaron misunderstood the intended audience for these as his priorities seemed rooted solely in quality filmmaking instead of entertaining a mostly-teenaged audience, a concept Newell is apparently an expert at. The only criticism I have is that I think they could've found a few minutes to devote to the Quidditch World Cup instead of skipping the entire thing as that was one of the best chapters in the book!",
            "review_date": "2021-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter And The Goblet Of Fire goes so far off the source material it ends being an agonizing experience. I found myself saying \"What about that? Why was that left out?\" The film would have been way better if they made it a direct adaptation of the book. It still isn't a bad film, it is still very well made with great acting and action. The CGI is also great. Anyways skip it if you read the book, watch it if you haven't.",
            "review_date": "2021-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Almost nothing like the book",
            "review_date": "2021-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The non-so magical review from a muggle.\n\n Harry Potter and the Goblet of Fire is a fantasy/adventure film directed by Mike Newell. It is based on J.K.Rowling's novel which was written in 2000 and carries the same name as the novel. It was released on November 23, 2005. It is as well the fourth part in the Harry Potter film series.\nLast Christmas, I saw this film and it was definitely one to remember. Just like past Harry Potter films this one didn't fail to amuse me. You could tell that this was filmed on a big-budget compared to the previous films of the series. To my mind I think this one offers a lot more than fantasy or adventure, it also gives you a lot of headspace to imagination. This piece of art surely left me astonished and filled with questions, wanting to watch the next part. \n\nAs for the plot of Harry Potter and the Goblet of Fire, it includes the three main characters to be grown up, as they enter their fourth year of the School of Wizardry and Witchcraft: Hogwarts. It holds a fair amount of violence, since Harry Potter, the main character has to enter the prestigious Triwizard Tournament as a minor and face some dreadful challenges along the way of becoming a champion. Throughout the film, new characters came to light. Some added a romantic aspect to the film, whereas others did not. For the 14-year-old Harry Potter, he endures pressure a normal teenager cannot handle to confront his biggest nightmare. With the help of his dearest friends, Hermione and Ron, he doesn't fail to succeed in the period of the tournament. After all, this is the year students prepare for the Yule Ball and dare to ask female students as their date to the ball. Yet, the charming part of the film quickly ends there, as Harry Potter will live up to his title as ‘The Boy Who Lived'. \nThe Harry Potter series is known to leave every person astounded who is into fiction and/or fantasy. As for me, it was always a surprising experience watching through these films, as you notice the characters growing up from a young child to an adult. There is no doubt that J.K. Rowling is by far one of the most influential writers in our century. Not only, did she write several successful books but stands as a role model for young children and women. With the apparent cliffhanger at the end of the first film, it will leave you wanting more and you will end up watching the next films that follows up on the previous one. \nPersonally, I am a lover of anything fictional, which is obvious why I am a fan of Harry Potter. Behind the success of these series, I suppose that watchers admire the films as they are not predicable as much as you think it would be. For instance, in this film, it gets quite dark quickly once you watch Harry get involved into life-or-death situations. Another example, is that Harry experiences tons of emotions in this film. As he goes through happy moments with his friends, he goes through the same amount of unknown moments and feelings. However, I must say that this is perhaps the most significant Harry Potter film so far. Mainly because, while I was watching this part of the series it felt like a mix of genres. Also, another example to why this film doesn't have a sole boring moment since it will keep introducing new characters throughout. For the Triwizard Tournament I mentioned earlier, there will be a ton of new, yet interesting characters added who bring a value to these films, which also was an enjoyable aspect. Lastly, this film was not excessively long but definitely long enough to tell the story. But there is one negative detail, that the films don't fully cover every single detail like the books do. So if you want to have a full understanding experience, I suggest you to also read the books so that you don't miss out on other details. \n\nClearly, this masterpiece will be a hard one to forget, as it will stick to you for a longer time. It is not something that you will be able to forget soon, as it so famous. I would recommend this film to anyone who might be interest in fantasy and fictional characters. Furthermore, it is important to watch them in chronological order, since every film leaves a cliffhanger at the end which follows up on the next one. Lastly, I hope you get lost into the imagination of the magical world of Harry Potter, just like I did.",
            "review_date": "2021-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very beautiful Movie. The action is amazing, however it does leave a lot out from the original book. Some of the characters look shaggier than they did before. The ending battle was intense and fantastic.",
            "review_date": "2021-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is undoubtedly a gem, it has a plot that is too entertaining and interesting at the same time and that captivates a lot for people to see these films, Cedric's introduction was good, I liked his participation in the saga, but his death, the character did not give much more. Something that this tape owed me was a better participation of Ron, since the appearance of Voldemort and Cedric totally overshadowed him, and they also made his character a bit like a crybaby and gossip, and I did not like that much.",
            "review_date": "2021-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Summary: \n\tThis movie marks an important cornerstone in the development of the Harry Potter universe with the return of the Dark Lord Voldemort. It is set in Hogwarts during the fourth year of school, when the Triwizard Tournament takes place. It is a traditionally a competition between the three prominent schools of magic including Hogwarts, Durmstrang and Beauxbatons. Prior to the competition, the Goblet of Fire selects three students from each school to participate in the contest. Harry is unexpectedly selected and forced to enter the competition by the Goblet of Fire with three other students even though he never put his in the cup and he is also underage. Later, it is found out that one of the Voldemort's underlings cast an advanced spell on the Goblet to deceive it of Harry's age. During the first three rounds of the contest, Harry and the other students have to complete many difficult tasks such as rescuing underwater and fighting dragons. The climax of this movie comes when the four students compete to get out of the maze, the last round of the contest. However, Voldemort, still in his feeble from between dead and alive, and his underlings are in there waiting for the four, eventually killing Cedric from Hogwarts. Harry, after that, is capture, and his blood extracted and used to rebuild Voldemort into a strong physical form. Harry then duels against the Dark Lord for his life. He barely escapes Voldemort and eventually brings Cedric's body back to campus with the knowledge that Voldemort has returned.\n\nAnalysis: \n\tThe important turn of events in this movie heralds major change development of the storyline and the journey of Harry Potter as the main hero in this series. Harry is now no longer inherently safe from Voldemort like before when Harry's blood was has the magic against the Dark Lord. Now, both share the same blood as he used his Voldemort used Harry's blood to revive himself. Harry no longer is protected and now susceptible. He is now more representative of real-life heroes, who actually have vulnerabilities, not inherently indestructible by enemies as Harry used to be earlier in the series. \n\tThis sharing of blood between Harry and Voldemort is also symbolistic of the struggles that real-life heroes have. It is like a connection across the dichotomy of good and evil, signaling the heroes also have their own evil side that they struggle against. \n\tFurthermore, when Harry's friend Ron turns against him, it further depicts Harry as a misunderstood hero. Ron estranged himself from Harry because Ron thinks that Harry intentionally enters himself into the contest for fame. However, later in the movie, Ron actually helps Harry to get through one of the dangerous rounds of the contest where the four students had to compete underwater. Ron's actions actually saved Harry's life. This part of the stories highlights the resilience of true friendship. No matter how significant the misunderstanding is, true friends will still help each other when in need and resolve the problem between them.\n\tThen when the four enter the last round of the tournament, the maze, Cedric encounters a minion of Voldemort, he is murdered by the killing curse. Then, Harry is captured by the other underlings of Voldemort. His arm is cut, and his blood collected to revive Voldemort. Harry has to duel against him for his life. He almost loses against the newly rejuvenated and strengthened Dark Lord. However, the souls of Harry's loved ones who were murdered by Voldemort appear from Voldemort's wand and give Harry's time to get to the Portkey to escape the maze. This scene demonstrates the theme of love's triumph over hate and evil. \n\nCritique: \n\tI love this movie and the whole Harry Potter series as a whole. There are, nonetheless, certain details that I think can be improved upon. The first one is rather a minor detail. It is when Dumbledore finds out the Goblet of Fire has chosen Harry as the fourth selectee to enter the tournament. The book says that Dumbledore ‘calmly' asks Harry if he actually put his name into the Goblet. However, the corresponding scene in the movie portraits Dumbledore's asking as aggressive and intimidating when he grabs Harry's arms and shakes them while questioning him. This minor detail, although does not affect the structural integrity of the storyline, somehow momentarily breaks the usual portrayal of Dumbledore as a gathered and calm man without serving any significant purpose. \n\tThe second detail is when Harry is forced to enter the Tournament. J.K Rowling here could have better explained why it is that way, because the audience may have questions such as the following: Why is an underage forced to enter such a perilous contest even when he does not want to? Or Why can't/doesn't the administration do anything to keep Harry from the having to enter? Explanations to these questions can further strengthen the integral structure of the storyline. \n\tOverall, despite these small details that may be improved, I still give the movie 5 out of 5 stars.",
            "review_date": "2021-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic film totally worth your time. I a unique but definitely as in harry potter series it's really nice",
            "review_date": "2021-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not that big on technology as a whole, but IMO this film was a turning point for the franchise when it comes to special effects, it was beautifully done. As for the plot, we get to see students from other countries, learn that not only British people are magical and it's very good entertainment. I just have one question though: what's with the haircuts?",
            "review_date": "2021-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The darkest film of the franchise.",
            "review_date": "2021-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the bonus actors that they've included here like David Tennant and Robert Pattinson. the Tournament stuff can get boring at times but the Climactic showdown at the end in the graveyard was pretty Epic.",
            "review_date": "2021-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the darkest and greatest entry into the Harry Potter series yet. Bringing amazing action sequences, a lovely ball and the highly anticipated return of lord voldemort.",
            "review_date": "2021-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie with great moments, acting, and a dark undertone that makes everything suspenseful. One of my favorite Harry Potter films!!",
            "review_date": "2021-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie and some great actors but the only thing I have wrong with this film and all the other harry potter films is it misses detail that are in the book.",
            "review_date": "2021-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely the best of the 8 Harry Potter movies because it has the most epic plot and suspense",
            "review_date": "2021-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not everything works in the right direction - Watson is strangely over the top and the Yule Ball doesn't show much of the fun that the actors seemed to have during the production - but overall the film manages to evocate the atmosphere of the book: a year of budding romances, colourful side characters (especially the wonderfully hateful Skeeter, courtesy of Miranda Richardson), impressive trials of magic and special effects, all before the event horizon marked by the last act.",
            "review_date": "2021-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Year 4 sees Harry Potter return to Hogwarts and endure something never before done by a wizard of his age. The Triwizard tournament sees students from three different schools compete in a series of dangerous competitions in order to achieve eternal glory. When Harry's name appear from the the cup he must enter the tournament and compete in these dangerous events all while dealing with new aspects of his personal life.\n\nThis film sees the original cast return and all give great performances across the board. Danielle Radcliffe has one extremely good scene when he returns with Cedrics body, he really showed what he can do as an actor in that scene. We get a couple of key new additions in Cedric Diggory played by Robert Pattinson as well as Mad Eye Moody played by Brendan Gleason. But as we find out by the end of the film Mad Eye was actually Barty Crouch played by David Tennant. That really was extremely obvious, they do a really poor job hiding throughout the film and guessed it pretty early on. \n\nThe storytelling is extremely well done and wastes no time throughout the film, giving us an extremely fast paced film. It jumps right in with Harry and the gang heading to the quidditch World Cup, where death eaters appear and terrorize the event. Directly after that the film begins setting up the personal relationships between these characters and than it jumps right into the tournament. \n\nOur characters are entering a point in their life when puberty is beginning. This means that our characters begin to have feelings for one another while also dealing with some tension. This tension comes in the form of Ron, Ron is a jerk in this film and honestly just a really unlikeable character. I understand that these kids are going through a time in their lives when these situations can happen but Ron just completely changed. \n\nThe tone balance in this film was really off at times. They made this film a lot darker than the first three which makes sense considering that they are showing how dangerous this wizarding world can be, but that tone leaked into a lot of character scenes and just made it feel weird. Hermonie legitimately never looks happy and Ron is completely different. It made for some strange character scenes that didn't feel right.\n\nThe tournament was a lot of fun and shows us aspects of the wizarding world we hadn't seen before. Each trial is really fun and does a good job of showing the type of person Harry is. It shows how Harry is just this run of the mill kid that wants a normal life. It also shows how caring and heroic Harry is.\n\nFinally I have to talk about Voldemort played by Ralph Fiennes. This is are first real look at the dark lord and my oh my is he menacing. He is a good mix of psychotic and haunting as we see him toy with Harry but then become extremely intimidating right after. That entire sequence in the graveyard is great.\n\nOverall The Goblet of Fire is a great film. With a great cast, fun scenes and great storytelling, this film has a lot to enjoy. But in addition to that we get a really strange take on Ron's character as well as some weird tone balancing that make the film darker than it needed to be. \n\n8/10",
            "review_date": "2021-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like this one because is light but it is also darker and we get to see more magic and get to see little bit more people from other  house the new characters and story plot fits really will. And it's some thing New.",
            "review_date": "2020-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OK, this one is very hard to watch as someone who read the books first. GoF is my favorite book in the series, and they just left so much out that its kinda tough to view this film from an unbias standpoint. Overall, the entire film is a downgrade from the previous. The lighting is more generic, as is the cinematography ... which leads to a less visually pleasing film. The introduction of the slight gray filter starts, and it always pisses me off when they suck the color out of such a vibrant world to try and convey a more grim tone when the narrative itself should support that. Alot of moments feel more mechanical and kinda ubrupt due to a lack of buildup and context. Harry seems alot more passive with Ron and Hermione, but then out of nowhere gets frustrated with them. Dumbledore isn't Dumbledore in this one, just a heads up. Sorry to get all negative, here are the positives! Voldemort's *ahem* was amazing and well done, as were all 3 trials! \n\nIt sounds like I hate this film ... but I dont, I just think its a step down from nearly every aspect of the last. Still pretty good, but disappointing.",
            "review_date": "2020-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the bests in my opinion",
            "review_date": "2020-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you're only going to watch one Harry Potter movie... wait... why just one?  Okay, if you're going to watch just two Harry Potter movies, they'd be Harry Potter and the Prisoner of Azkaban and this one...",
            "review_date": "2020-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Goblet of Fire may not be the most thought-provoking nor emotionally powerful film of the franchise, but succeeds immensely as a thoroughly entertaining --- albeit singular --- blockbuster that boasts transcendent visuals, eye-popping action, some unexpected twists and the longly anticipated return of you-know-who --- he's back b*tches!\nIroh's grade: B-",
            "review_date": "2020-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For some reason, this one only gets a 4.5/5 star rating from me. The 4th movie I think just doesn't feel the same as some of the others. The Triwizard Tournament is really cool, and so is Voldemort in his human form, but movie 4 just feels a bit \"off\" to me.",
            "review_date": "2020-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fourth Harry Potter film is a big accomplishment in terms of drama in this series, with the darker moments blending in better with the lighter ones. Updated effects, better characters, and shocking twists make this one of many great chapters in the Harry Potter series.",
            "review_date": "2020-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is spectacular. I LOVE all the challenges and the groundbreaking magic. It really get's your heart pumping. Will he survive or not?",
            "review_date": "2020-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another absolute banger. The Harry Potter films are a lot like wine, they only get better with age. Everything that was good from the previous films are still here with the additions of more crisp and grownup storytelling. Finer acting and CGI make for a more well rounded cinematic experience.",
            "review_date": "2020-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Goblet of Fire continues to flesh out the world of Harry Potter, while making some big moves in the overall story of Voldemort's ongoing machinations. Much of this movie returns to a lighter, more adventurous feel of the first two films. The Triwizard tournament games are thrilling, exciting, and suspenseful - the scenes in between the games are mostly fun and humorous. Goblet features the first of \"teenage drama\" between the main characters, and as a consequence we get limited time with our three heroes interacting/working together. Although they reunite by the end of the movie, you can't help but feel you missed something as the first three films focus closely on Harry, Ron, and Hermione together, and this one does not. Most of this movie is focused on the spectacle of the games, rather than moving the overarching good vs evil storyline forward. It makes up for this with an intense final 20 minutes featuring the biggest event in the series thus far- the return of Voldemort. Goblet of Fire feels like the last movie that maintains some sense of innocent fun, as the ending propels the story forward into the confrontation with Voldemort.",
            "review_date": "2020-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes when following the book it was nicely done BUT it is Wrong to skip scenes (the Riddle House history, the beginning) and characters (Winky the house-elf) from what is arguably the best book of the series.",
            "review_date": "2020-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Special Effects: 1,0/Sound Effects: 1,0/Acting: 1,0/Story: 2,0",
            "review_date": "2020-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the turning point in the Harry Potter series. Like the school dances, this is a time for growing up. In the Harry Potter world, growing up means taking on not only life-changing responsibilities, but facing up to tasks that are life-risking.",
            "review_date": "2020-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So good on the big screen.  While there are parts from the book missing (obviously this has to happen) they do such a good job telling the story.  It's fun to see the kids grow up before your eyes. The only reason it gets 4 stars is because of the screen where Dunbeldore yells and pushes Harry.  They got that DEAD WRONG. Love these movies so much!",
            "review_date": "2020-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is awesome and is my favorite film in the franchise so far. The movie is fast paced, the visuals look amazing, and the story is great. The whole ending sequence was great and has me excited to watch more.",
            "review_date": "2020-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Welp,that movie is rotten,and let us fans down(anyway I don't recommend but the sad thing is you have to watch this one to understand others)",
            "review_date": "2020-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More dark and complex, Goblit of Fire is another fantastic fourth entry that continues to honor the source material of J.K Rowling. Ralph Fiennes as Voldemort is sensationally evil whilst the teenage awkwardness and angst is at an all-time high and portrayed with great delight, charm and earnestness. The Tri-Wizard Tournament tasks' were vast and as immersive as they were described by Rowling in her book. The ballroom dances were magical and beautiful. Seeing the addition of the other wizarding schools come to Hogwarts and come to life with all of the competitive schools of witchcraft and wizardry was incredible and fabulously-grand to behold as this wizarding world gets ever more expanded going forward. Dumbledore says to Harry that darker and more difficult times lie ahead and indeed they do.",
            "review_date": "2020-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it, good bad guys, great good guys, periodic changing perceptions.  Very exciting with plenty of tension.....then released.",
            "review_date": "2020-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I must say I am extremely sick of this movie, though not for conventional reasons. Nine reels is a lot to put together and screening a three hour movie can be exhausting, especially when you're trying to write several term papers during the same week it is coming out. You see, I am a projectionist and getting this movie ready for a midnight show was part of my job. I realize that the fact that I was paid $14.50/hr to watch this movie on Wednesday night might give rise to feelings of jealousy among some, but I am currently wishing I could manage to get more than five hours of sleep sometime soon.\n\nAll that said I must say this was by far the greatest Harry Potter film so far. Although it was long, it did not drag on. It had a nice, tight feel to it. It progressed from scene to scene with a smoothness that I find to be lacking in many movies adapted from books. The acting has noticeably improved from the first three, and the more adult feel to this one really drew me in. Perhaps the most interesting aspect of this movie was the fact that it felt like a mix of genres. It had an epic feel to it. After all it is about good v. evil and battling the dark wizards, etc. This movie,however, also felt like a high school movie. It had the issues of coming of age, which makes sense as the characters begin to mature. Ultimately it came off a lot more loyal to the book in theme than I think the last one did. (The first two, while loyal, I found to be relatively campy and childish.)\n\nThis movie, like many, does have its shortfalls. I believe that Dumbledore was portrayed as a little too intense, like an old Al Pacino. Instead of the benevolent, kind, and good-humored old man I have always loved in the books. As someone that has read the books, I must say another shortfall is that this movie banks on familiarity with the story. Having read the books, I found it very easy to follow, but I could understand how one who has not read the books may feel a bit lost, as some important information was left out and some back-story was left mostly unexplained.\n\nAll in all I would say this is definitely the best movie in this series so far, and if the next three are on par with this one then I would be content.",
            "review_date": "2020-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1.5 stars for how good the ending is. The rest of the movie is awful. Why do they host a tournament in where the students almost die. There is seemingly no reason to host these games. That's not me nitpicking it's a huge question ",
            "review_date": "2020-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Year 4 begins and In This story we have the big Set Up for the rest of the franchise. This film is full of action set pieces from Dragons, Mazes & Underwater sequences. All are beautifully crafted and epic. This is also the first film where we get our characters finally embarrassing adulthood with dating which is played so innocent and accurately. Once again the final act here has massive reveals that change the future of the franchise. What this film does lack is that the script comes off a bit bland at times, if we didn’t truly care for these characters the words on the page would feel a bit empty.",
            "review_date": "2020-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is so underrated",
            "review_date": "2020-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter and the Goblet of Fire, has intense action scenes, nicely crafted set pieces, and the Visuals are awesome. The Cast all work together nicely, and the contest itself is a complete thrill ride. The only problem is that I wish we could see more of what is going on in Hogwarts, and what Harry and his friends are learning, and what their struggles are. So 7/10, it is not a good adaption, but it's a good movie.",
            "review_date": "2020-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay, so compared to the book this movie is dog doo. But, if I judge it just as a movie, I think it's good. It gets a pass for me in a lot of areas I could critique just because it's really funny and it's really entertaining. It also gets a few notches up for be because of Rob Pattinson. Again, if you're a big fan of the book, you probably won't like it. However, as a movie alone I like it.",
            "review_date": "2020-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This fourth Harry Potter movie was just as great as the third movie. Daniel Radcliffe, Emma Watson, Rupert Grint, Robert Pattinson, Tom Felton, Alan Rickman, Michael Gambon, and the rest of the cast did a fantastic job in this movie. The plot of the movie was intense, dramatic, and entertaining. If you haven't seen this movie yet, check it out after you've seen the first three movies. You'll find it one of the best Harry Potter movies of them all.",
            "review_date": "2020-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The setting ist most interesting when its not made the center of the entire plot.",
            "review_date": "2020-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the third one, but still a great entry into the Harry Potter franchise. It does have some pacing issues though, especially in the first act.",
            "review_date": "2020-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What's not to like, it's Harry Potter!",
            "review_date": "2020-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The special effects and action at its finest and even the most adventurous and blended with a hint of the coming-of-age genre to it",
            "review_date": "2020-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great film, but a bit hobbled between its better siblings. The lessons learned by Prisoner of Azkaban are left in its wake as Goblet of Fire walks back some of its uniqueness and creativity in favor of Hollywood fluff. The film remains eternally fun and unique as it explores its tournament arc. But the direction of the film is the heart of the issue here, as it seems to be confused about whether to represent its aging protagonists as tweens or young adults. However, one cannot fault the iconic scenes of the source material brought to life. Very fun, but ultimately weaker than its peers.",
            "review_date": "2020-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Year 4: Daaaaannng!!!! I never knew that a tournament like this would be intense. HARRY POTTER AND THE GOBLET OF FIRE is another fantastic chapter to J.K. Rowling's wonderful adventures of the most popular wizard in the world.",
            "review_date": "2020-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't think this film was as good as the first three films in the \"Harry Potter\" series, but it was still a pretty good sequel. I enjoyed it. It had some good parts in this film.",
            "review_date": "2020-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Me and my family loved watching this on the big screen again. I think this new generation needs to be introduced to these amazing movies!",
            "review_date": "2020-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a decent sequel/book adaption, but it has a lot of characters and sub-plots that never follow up to anything or are shafted out of the story for no reason.  It also leaves a few plot holes in a few places. The acting and vfx is good, but still far from perfect",
            "review_date": "2020-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A condensed story that feels more like a teaser for what's to come.",
            "review_date": "2020-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a well-done thriller movie with the three tasks done really well (the only problem is with the first task being a little too drawn out). The problem with this film is that some of the added material takes away from important series material like the significance of the Dark Mark and the Death Eaters. Also, a lot of the mysteries were ruined that made the book really and I found that to be disappointing.",
            "review_date": "2020-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slightly worse than the previous, but still an amazing movie.",
            "review_date": "2020-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whilst still as lovable as it's predecessors, Harry Potter and the Goblet of fire seems like a silly attempt at creating an high school drama and not as a fun fantasy adventure.",
            "review_date": "2020-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Has some solid moments, but ultimately doesn't do enough with the maze sequence, not capitalizing enough on the potential to have some great magical beasts for the characters to fight.",
            "review_date": "2020-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A damn fine addition to the franchise, this film changes the entire future course of the franchise. It also happens to be the darkest of the first four Harry Potter films, this is also, personally, one of my favorites as well.  As you watch these films years and years later, you start to realize most of the popular YA franchises wouldn't exist without this franchise, with this film showing many of these aspects many YA books/films use as plot devices.  A must see for genre fans and people who just enjoy good and fun storytelling",
            "review_date": "2020-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the third installment but still very entertaining and smart where it counts. Although the stepped up action sequences and set pieces might turn this HP film in the direction of over the top summer flare, when it need not be.",
            "review_date": "2020-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is when the Harry Potter franchise gets deeper, more mature and more relatable.",
            "review_date": "2020-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Potentially the most exciting story in the Harry Potter series due to it's focus on the dangerous and exhilarating Triwizard Tournament. However, the movie gets bogged down by a randomly inserted dance scene as well as manufactured tension between our three heroes.",
            "review_date": "2020-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The narrative and characters mature, and the filmmakers try to emulate Cuarón's style in the best way. It ultimately results in a complex and engaging storyline with solid performances and thrilling visuals.",
            "review_date": "2020-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a depressing fourth installment in the series. This still does a good job of capturing the creepiness of Lord Voldemort coming back into the big screen to show off his dark powers in the next!",
            "review_date": "2020-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "if you have read the book then you know it is bad because where is winky where is dobby where is the quidditch world",
            "review_date": "2020-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best in the series with an added darkness that worked to build tension and add to the maturity.",
            "review_date": "2020-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film wasn't as great as the first 3 films in the \"Harry Potter\" series, but it was still a pretty good sequel. I enjoyed it. It had some good parts in this film.",
            "review_date": "2020-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter and the Goblet of Fire, directed by Mike Newell, is one of the most entertaining installments of the saga, but had a tough time finding it's place. Right off the bat, I didn't like the idea of him directing this film because, he was too lazy to watch the other Harry Potter films, or to even read The Goblet of Fire. Mike Newell brings his own style to the film, which is completely fine, but his execution fell short, feeling like he was working against the former directors, instead of working with them.\n\nMike Newell finds a way to incorporate a few decent ideas, with a handful of entertaining sequences, and great stakes, but the film as a whole, feels unconnected, with a lot of unnecessary filler, and subplots, that doesn't offer a whole lot to the film or saga, and could've easily been cut to develop more important events. On more than a few occasions, Newell started to craft a decent idea, and then he'll bail on it, and it became quite annoying. The pacing moves pretty fast through everything, leaving some things underdeveloped, and not that interesting, at times. The tones of the film play along the same lines as Prisoner of Azkaban, but turning up the darkness and comedy a level or two. The tones were fine for the most part, but Newell wanted this to be more of a comedy than all the others, and it feels forceful at times.\n\nAlthough this is still a story-based narrative, the characters had a lot to do. There was some nice moments from our returning supportive characters, while there was great tention from our three returning leads. There was a lot of nice maturing aspects to our leads, but it throws off the focus of the film, making it feel like two different films at times. Although there were some decent character moments with our returning characters, the abundance of new additions were almost completely disposable! There were a select few that belong in the narrative, but eighty percent of them have about two lines of dialogue, being utterly underutilized.\n\nThe screenplay by Steve Kloves had a lot of standout moments! He incorporated a lot of mature themes and messages, beautifully delivered by the cast! The issues with the screenplay, is the inconsistencies, and imbalances, due to an overstuffed narrative.\n\nThe production of this film looks great! The creative team used a lot of beautifully detailed set pieces, to really make the scenes pop! The cinematography looks fantastic, utilizing a lot of blues and greens, to really set the tone.\n\nThe Goblet of Fire really brings the magic element to new heights! With there being so many memorable action and magic sequences, the creative team still managed to balance it well, so it doesn't over saturate the message and themes they were going for. The effects also look phenomenal, still holding up til this day! It's a pleasure to be able to witness the big steps they take with each film, and seeing them come into their own.\n\nOverall, if I had a favorites list, Goblet of Fire is definitely in my top 3, but due to a lot inconsistencies, it's hard not to keep this one out of the bottom three.",
            "review_date": "2020-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "#HarryPotterAndTheGobletOfFire #MovieReview: 8.5/10\n\nPros:White heavy check mark\n\n•Tri-Wizard Tournament\n\n•\"Teen\" elements handled well\n\n•Perfect final act\n\n•Fleshes out Harry Potter's youth\n\n•Emotional ending\n\n•Alastor Moody\n\nCons:Cross mark\n\n•Ron is too annoying\n\n•Twist ending doesn't make sense",
            "review_date": "2020-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The cast and acting in this film is really good. This the the first real change in the series to make it much darker and it works.",
            "review_date": "2020-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Middle part is a bit boring but early and ending was awesome",
            "review_date": "2020-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another on-par installment in the franchise, Goblet of Fire exceeds in introducing the main villain of the Harry Potter series.",
            "review_date": "2020-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like to call this film, Harry Potter and the Runaway Barber because it's distracting how shaggy everyone's hair is, but this film is still a good continuation of the series. This a solid script that was adapted from one of the longest books in the series, Steve Kloves seems to have really put some thought into it because it made take a one movie break. As many people have pointed out, this series and the characters are all growing, learning, and maturing as they rediscover themselves and this film handles the awkwardness of teenagers pretty well and finds ways to relate this magical world to real-life which I found to be thoughtful filmmaking. Robert Pattinson makes his big-screen debut with a performance that shows he has potential, it's just a shame it was wasted on Twilight. Brendan Gleeson was very good as the ever-eccentric Moody, he gave some good comedy relief and had a such a character twist there at the end. The tri-wizard tournament itself was very intense and felt like it had consequences, it affects our hero and causes him to grow up real fast. The graveyard duel is awesome, it is very dark but that's what this film needed, Voldemort return is very menacing and he is shown as a major threat from the very beginning which sets the stakes really high and a great actor like Ralph Fiennes just elevates that to a level of great villainy that his reputation from the last films foretells. It is painfully clear to me that both Rupert Grint and Emma Watson are both better actors than Daniel Radcliffe, I just didn't get emotionally invested with his performance like it wanted me to. There are a few too many exposition dumps and Radcliffe's performance was a little shotty to me sometimes, John Williams score is sorely missed, this film also needed to be about 10-15 minutes longer than it is because it feels like there are a few chunks of the story missing, they needed to include other characters such as Ludo Bagman. Despite the issues, I actually enjoyed re-watching this film more than I thought I would, it is entertaining enough, most of the performances were great, the character building was well done once again, and the ending is very dark and ominous, it eludes to a future with Voldemort ruling in terror and it is a set up for the direction that the last half of movies go. This is about as good as Chamber of Secrets for me and I can't wait to re-watch it again someday soon.",
            "review_date": "2020-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can really see the actors' age into their roles well. The beginning part of the movie was a funny teen movie while the last bit brought us back to the world of Harry Potter. It was perfectly balanced and the movies are starting to become more mature and dark. I great addition to the series!",
            "review_date": "2020-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The wizard tournament may not be the best plot but the way they set up Voldemort's return is surprising and shocking. Some parts can be disappointing because I believe that Newell ruined the mystery of it all, but as everybody knows a film adaptation cannot carbon copy the book, so I don't think thats a big deal.",
            "review_date": "2020-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "densely epic, the franchise has become something cold and gloomy, and that refers to the characters in the future",
            "review_date": "2020-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed the books, i enjoyed the movies !!! First fight with Voldemort (oops i forgot that we're supposed not to say his name :) )",
            "review_date": "2020-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i liked this movie because. althoug it is differtent in some aspects from the book, i liked the fact that Harry has to endure that everything and everyone turns against him. And with the odds against him, he succeds every challenge, not only in the tournament but in his life.  Its the book and movie that marks the end of childhood for Harry.",
            "review_date": "2020-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a film in and of itself it's pretty good, however as part of a series, with established characters and, furthermore, rather comprehensive and detailed source material, it is by far the weakest of the franchise, and it all falls down to the director; Mike Newell was not a good choice to direct this film, and whilst visually everything about the film is wonderful, his seeming indifference towards the source material was extremely noticeable by way of far too many liberties being taken; certain characters were completely reimagined, and others (pretty important ones at that) were omitted completely, though screenwriter Steve Kloves should also shoulder some of the blame for that. Additionally irrelevant plot details were given undue attention, whereas those perhaps most important were rewritten or just omitted due to having directed all of the attention in the wrong areas. Of course it would have helped a great deal if Newell had actually read the book with any degree of care and attention, as he admitted he had not prior to starting production, but in particular Dumbledore's character assassination is one thing that I, along with millions of other HP fans, will never forgive director Newell. When you adapt written word to the screen, big or small, you MUST pay due respect to that source material, otherwise you are simply displaying apathy towards the fans, and essentially presenting the notion that you think that you're above the author in some way, and that is the big mistake director Mike Newell made in this film. It isn't all doom and gloom though, performances al around (even from Gambon) were very strong, Miranda Richardson as Rita Skeeter is absolutely sensational, and Brendan Gleeson as Moody was another perfect cast. The narrative is far too episodic comparative to the fluidity of the previous three films, however as stated earlier the visual effects, the dragon in particular, were utterly fabulous. From an objective point of view, this is a good film, however in consideration of how much it strayed from the source material, and as a fan of said books, it falls flat in comparison with most of the other entries in the series.",
            "review_date": "2020-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everything to enjoy, although it feels a bit crammed",
            "review_date": "2020-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the Harry Potter movie that will change everything moving forward. I loved the book more, but this is not a bad take on it. It will have plenty of adventure in it that the franchise is known for. Harry Potter is threaten with his greatest challenge yet. The cast is wonderful in this movie and it helps even more to have the talents of Robert Pattinson in this one. The story may not be the best Potter has but this film is fun, and more beautiful to look at.",
            "review_date": "2020-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(SPOILERS!!!!) The movie most UNLIKE the books, in my opinion. Although it suffers on that front, Goblet of Fire brings us into the world of the Triwizard tournament. Cho Chang and Cedric Diggory are introduced (even though they are quidditch players in Azkaban the book), who are amazing characters. Voldemort comes back with more backstory as well. The foreign schools are a little odd since they aren't gender-specific. And where is Dobby? Where's the Quidditch world cup?  Where's S.P.E.W? (it's ok that they didn't put it in imo) And as a last point, HARRY DID YA PUT YA NAME INTO THA GOBLET OF FIYAH?",
            "review_date": "2020-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though it isn't really faithful to the book, it still is my favorite Harry Potter movie.",
            "review_date": "2020-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A CLASSIC!!! not the best movie of the series, but definitely high up there.",
            "review_date": "2020-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Harry Potter movie where they all had long hair and everyone had awkward love scenes.\n\nDisclaimer: I never grew up on the Harry Potter series nor have I read the books. So my review may be biased.\n\nGiven the source material and worldbuilding, this movie could have been much better. We are introduced to many new things in this movie like the quidditch world cup, a cool tournament, and Voldemort. Yet this film focuses too much on flash instead of substance.\n\nThere are some undeniably cool scenes, but they make no sense once revisited upon second thought. How are the death eaters able to attack a WORLD tournament so easily, especially when EVERYONE is armed with a potentially lethal weapon? How come we haven't been introduced to other schools before and how come we never hear from them again? Also, why TF should anyone care about Cedric? He has never been introduced to the series before.\n\nI appreciate that this film is the first of the series to receive a PG-13 rating and has darker themes than previous movies. Yet, the love stops there. It felt more like a self-service for fanboys/girls and nothing more. This film by itself cannot be a good standalone movie.\n\nAnd don't get me started on the awkward \"love\" scenes that this film tries to incorporate in it. Felt forced and was bleugh.\n\n1.5/5. Some good moments. Some cool new things to add to the Potterverse. Introduction of the long-awaited antagonist. But nothing much else outside of that.",
            "review_date": "2020-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've defended this movie so many times because I don't the changes they made was a bad thing and some of the changes were necessary to create a well paced movie. Some say this movie is badly directed and badly written but I think its one of the best directed and written Harry Potter movies. I will admit that it's badly adapted but I don't think they were trying to be accurate to the source material and that's completely fine in my book.",
            "review_date": "2020-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If the Harry Potter series was an original series with no books, Goblet of Fire would be one of the best but it is a book adaptation and I feel like that is how this movie should be critiqued as well as all the HP movies  and they kind of messed up on it but this movie is still amazing: the build-up for the Quidditch World Cup, the riot at the world cup, Voldemort's return, 2nd task, Cedric's death and memorial, Mad-Eye Moody and Voldemort's portrayal, the Yule Ball, learning more about the wizarding world, these were all amazing parts of the movie and the CGI is really impressive and I do love the darkness and sense of comedy in this movie but there are a good number of cons: they cut out the entire Quidditch World Cup mach, Michael Gambon's portayal of Gryffindor was too angry and nothing compared to the Dumbledore in the books, they overextended the 1st task and made it too unrealistic; they messed up the 3rd task and took out all the magical creatures and the transitions were horrible in this movie and the first 20 minuted with the Quidditch World Cup and Riot felt so rushed and Newell spent way too much time with the Yule Ball instead of the more interesting aspects of the book. This movie is still great but I just don't think Mike Newell was the best director for this movie as he read none of the books or watched any of the movies.\nOverall: 7.5/10 (B)",
            "review_date": "2020-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely amazing. The best of the entire franchise.",
            "review_date": "2020-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cracking up the fear factor yet again. That's a thumbs up from me. Seeing the villain after hes been built up for the last 3 films was a moment to behold. The emotion hit hard in this one. A great installment for sure. As the characters start to mature new problems arise and the actors are maturing along with them. The special effects have been ramped up this time and it works\nThe music is yet again very good. \nAll in all, definitely reccomend.",
            "review_date": "2020-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie of all time for sure",
            "review_date": "2020-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A relatable teen journey surrounded by darkness.\n\nMike Newell's coming of age dark fantasy feature Harry Potter and the Goblet of Fire (2005) is a startling sober and bleak picture about Harry finally having to mature. Newell's direction is neat with many creative visual choices for the dark action, but he also leans in too much into teen romance-comedy tropes too much during the ballroom dance sequence as well as the love triangles. Goblet of Fire feels a bit long, clocking in at 157 minutes, with steady pacing from editor Mick Audsley. All the teen romance drama bits slow down this picture a great deal as it all seems paltry compared to the looming threat of violence. Goblet of Fire is exciting and endearing, so I can forgive its faults.\n\nJ. K. Rowling's writing is excellent for how she weaves a wizard tournament around the impending arrival of Harry Potter's main villain, played by a scene stealing Ralph Fiennes. He nails the creepy malice and sudden violent potential of Lord Voldemort. \n\nRoger Pratt's cinematography is beautiful during the water segments, horror bits, as well as all the teen drama, but his wide shots during dragon fight is awkward and misses the action. I wish shaky camera shots would go away as they ruin some moments early on, but many wide shots are striking the first port key teleportation or the dance. \n\nPatrick Doyle composes a fine, but forgettable score that doesn't compare to John Williams iconic Harry Potter music. Jany Temime and David Crossman's costumes are beautiful and playful, especially for the French witches arriving at Hogwarts.\n\nDaniel Radcliffe is excellent as a torn Harry Potter between the girls he likes and winning a contest he never entered. Rupert Grint is obnoxious as Ron Weasley in Goblet of Fire as his jealousy of Harry feels vaguely out of character and only could be the result of Rowling wanting his character to age into an angsty teenager. Emma Watson is devastating as a hurt Hermione Granger with her sort of toxic crush on Ron. Her dramatic acting during the ball is excellent and it's nice to see her so encouraging of Harry throughout this whole film.\n\nMichael Gambon plays Albus Dumbledore so strangely in Harry Potter and the Goblet of Fire. His shouting at Harry once he realizes Harry's name was put into the Goblet of Fire feels very out of character. He doesn't feel as warm or kind as Richard Harris' Dumbledore at all. I like many of his unique choices, but not so much this time around. \n\nAlan Rickman is funny and cool as Snape, but still gets little to do. Robbie Coltrane is very funny flirting with Frances de la Tour. Brendan Gleeson is outright amazing as Mad Eye Moody. He transforms his whole appearance, with help from Eithné Fennel and Belinda Hodson's make-up, into a fearsome and fun character. His walking changes to limping as he puts a sneer on his face and is very expressive with what he's given. Gary Oldman gets a cameo as Sirius Black and that's about it. Robert Pattison is excellent as the kind and brave Cedric Diggory. Jeff Rawle delivers an amazing display of grief at the end of Goblet of Fire that you just have to see!\n\nClémence Poésy is stunning as the graceful and poise Fleur Delacour. Stanislav Yanevski is forgettable as Victor Krum. Miranda Richardson is very funny and memorable as the annoying tabloid witch Rita Skeeter.\n\nMaggie Smith is really fun to watch as Minerva McGonagall as usual. Geraldine Sommerville is nice to see again as Lily Potter alongside Adrian Rawlins' James Potter. Tom Felton gets next to nothing to do as Draco Malfoy this time, whereas Jason Isaacs is excellent again as the arrogant Lucius Malfoy. Timothy Spall is fantastic as Wormtail. David Tennant is excellent and memorable as Barty Crouch Junior. James and Oliver Phelps are hilarious as Fred and George Weasley.\n\nI loved seeing Bonnie Wright again as Ginny Weasley because she's so cute and sweet. I wish she got more screen time with Daniel Radcliffe to build their relationship together as Ginny and Harry, but I digress. I like Katie Leung as Cho Chang, but I fail to see the point of having Cho be the love interest when they could have used Goblet of Fire as the first film to really develop Ginny and Harry's relationship naturally.\n\nIn all, Harry Potter and the Goblet of Fire is an excellent coming of age movie for teenagers and a thrilling dark fantasy picture for entire families to enjoy.",
            "review_date": "2020-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The storyline jumps around. At one point Harry Potter is trying to survive a wizard tournament, the next minute he is trying to survive prom night (PROM NIGHT???) and then the next minute he is facing Lord Voldemort who should have come in sooner.",
            "review_date": "2020-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie so much. It's a special side of the Harry Potter world that's so different from the rest of the films, and it really does shine. One of my absolute favorites!",
            "review_date": "2020-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cuaron's direction sustains the franchise through major narrative developments, and is ultimately paired with major improvements in visual effects. Solidifies the unique interpretation of the source material that would come to define the film series for the remainder of the franchise. (3.5/5)",
            "review_date": "2020-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter and the Gobble of the Last Thanksgiving Dinner was TOO long of a movie! Edward Cullen had a rough life before Twilight and that's a fact!",
            "review_date": "2020-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite of the series so far. I actually cried at the end. This movie hit all the emotions!",
            "review_date": "2020-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really like Harry Potter and the goblet of fire, the especial effects,mainly the maze scene .This movie is my favorite of the saga,the meimaid scene  its perfect and the cast is really good, principally Emma Watson she is incredible  and the dragon scene is awesome.",
            "review_date": "2020-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot is full of mystery and magic, the soundtrack is beatuful, the characters are very good. The film is of a magic boy, he goes to Hogwarts and  he has two best friend Rony and Hermione.They have a lot of adventures. This film is about a championship betwen 4 schools.in the end .....",
            "review_date": "2020-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although a fantastic film, I do not believe it's live up quite to its predecessor, this film is definitely not better than the Prisoner of Azkaban, and although I hate to say it, it's purely made, it's a very loose adaption to the book, in fact, it almost feels like the only thing accurate is the title, but if you don't compare it with the book, you find a wildly entertaining film, that has a massive, just crazy, just out the roof ending, I don't love it as much as the third one, but man is it great",
            "review_date": "2020-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter and the Goblet of Fire\nis the worst movie in the harry potter francise while I personally think the book is one of the nicest it is such a shame that this movie is not so good if you compare it to the book, the biggest reason behind that Mike Newell not even took the time to read the book that hes gonna make a film about Harry potter and the Gobled of Fire is not a bad film but not a good Harry Potter film",
            "review_date": "2020-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Goblet of Fire has a much darker tone and introduces Voldemort in his full form which is terrifying (even without a nose!). The Triwizard Tournament is a really fun and great concept and executed just as well. However, it loses a lot of charm from the book and some of the directions the characters are taken in are terrible (looking at you, Dumbledore.).",
            "review_date": "2020-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too much plot cuts due to fit for length of film, ironically JK Rowling put too much content in novel!\nYule ball dress design were very muggle, not fantastic at all",
            "review_date": "2020-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think they should have made it a little bit more like the book, but the effects, story and acting are still good.",
            "review_date": "2020-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, I don't know yet what I think about Harry Potter: and the Goblet Of Fire but if I had to rank it from 1 to 5 stars I would give it 3 or 2 stars.",
            "review_date": "2020-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great film in the franchise",
            "review_date": "2020-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was a great transition to what was going to happen in the future, and when the series started to get darker.",
            "review_date": "2020-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter and the Goblet of Fire is a game filled movie of trying to win the Goblet of Fire which keeps your attention throughout the whole movie ending with a powerful and emotional scene exciting you for whats to come in the future.",
            "review_date": "2020-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A stunning and compellingly dark installment, combined with Newell's direction, Kloves' script, the performances of the cast, Doyle's score, Pratt's cinematography, Audsley's editing, Craig's production design, McMillan's set decoration, Temime's costume design, action sequences, sound design and visual effects - Goblet Of Fire makes a compelling case as one of the darkest and most visually stunning installments in the saga of Harry Potter.",
            "review_date": "2020-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably my least favourite Harry Potter film, but it's still great",
            "review_date": "2020-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best ever like ahh definitely got to watch",
            "review_date": "2020-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Recently gave a chance to this franchise because of my daughter. This movie was worth watching, with a fun story and lovable characters",
            "review_date": "2020-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The Goblet of Fire\" is overly disappointing as there is so much potential with such a poor execution and sense of direction with not enough to sell you on the 'darkness' of this film, 4/10.",
            "review_date": "2020-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Goblet Of Fire is some peoples favorite........It still is BORING!!!!!!! I HATE Harry Potter.",
            "review_date": "2019-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While being a very good film the film also shows the dark side of Harry Potter and shows us the films after this are going to get darker and darker as time goes on mean that more death and more seeing pot Voldemort which is a good thing but this film didn't do a good job of introducing his character again.",
            "review_date": "2019-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe the worst Harry Potter's movie",
            "review_date": "2019-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "in my opinion the best HP movie! but it still not 10/10\nmore like 8,5/10 but still good.",
            "review_date": "2019-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Out of the seven original Harry Potter stories, \"Goblet of Fire\" is probably the most screenwriter-friendly one due to its focus on one big event that is split into various episodes, which eventually lead to a dramatic finale. So overall, I feel that up to that point (and in fact up to and including \"Half-Blood-Prince\") it is the film that worked best in its own respect without having to rely too much on the popularity of the novel it was based upon.",
            "review_date": "2019-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolutely perfect movie; a complex plot that advances the story arc greatly, coupled with great graphics.  An all-round entertaining experience - although young kids will likely be scared.",
            "review_date": "2019-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Harry Potter film joint with, Chamber of Secrets and Prisoner of Azkaban.\nIs very well paced.\nHas so many good moments, including all the triwizard tournament scenes. \nThe graveyard scene is all one of the biggest moments in the Harry Potter films.\nIs a very emotional film, especially what happens to Cedric Diggory.",
            "review_date": "2019-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best of the Harry Potter franchise.",
            "review_date": "2019-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Major Turing point in the HP Franchise, this is the one where the dark tone become the front runner in the remaining films after this one, including the music. My main issue with this film, as with most HP films, it does drag on in places that I've come to accept those moments now. I know everyone's main issue with this film is that the infamous Dumbledore line \"did u put your name in the goblet\"? Was shouted at Harry while in the book it was meant to be said calmly. As coming from my favourite book, that moment was a bit wired to see, but the more I watch this film, the more that scene doesn't bother me. I love the whole tri-wizard tournament, definitely the best parts of the film by a mile.... but what lets it down for me is the acting from Emma Watson, it seems abit off and when comparing to the other films, this is probably her weakest performance overall.  ",
            "review_date": "2019-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dark, daunting, and full of action, Harry Potter and The Goblet of Fire competes for the best film in the series. It's characters and emotions are bold, as are the dark themes shown on screen.",
            "review_date": "2019-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "with 8 films in the main series, it is amazing how good each of the films turned out to be.  Although this film doesn't hit every plot point from the books, the points it does hit, it does very well.",
            "review_date": "2019-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "my second favourite film in the series its incredible.",
            "review_date": "2019-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that's better than the book? Harry Potter and The Goblet of Fire was a much better film than book. ",
            "review_date": "2019-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie! The cast is just perfect in this franchise. So much magic and fun in this movie. A lot of comedy and mystery in this one. ",
            "review_date": "2019-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The main characters are maturing, and the filmmakers are likewise improving on their craft; vibrant special effects and assured performances add up to what is the most complex yet of the Harry Potter films.",
            "review_date": "2019-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the most beautiful chapters of the film, full of feeling and with a very beautiful realization",
            "review_date": "2019-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is, without a doubt, my favorite Harry Potter film. It is action-packed, thrilling, and visually stunning. It's great to see other schools of magic come to Hogwarts, and the Triwizard Tournament is awesome. Each task of the tournament is provides some fantastic action, and is unique in its own way. This film is also so extremely well-paced, as it makes 2 hours and 37 minutes fly by. Of course, the film's highlight is the return of Lord Voldemort. This scene is chilling and very re-watchable, not to mention that Ralph Fiennes nails it as Voldemort. Also, David Tennant is a scene stealer as Barty Crouch Jr. Best dialogue in the movie - Voldemort: \"Welcome my friends. Thirteen years it's been, and, yet, you stand before me as if it were only yesterday.\" A+ 100/100",
            "review_date": "2019-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Adds a little more complexity to the franchise. It is more enjoyable if you've read the book, but don't think for a second that you won't be entertained.",
            "review_date": "2019-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another change in director, and another interesting atmospheric change: only this time, it is for worse. Most of the new actors are okay, except Brendan Gleeson, who is amazing as Mad-Eye Moody. Gambon continues to do a great job as Dumbledore. Still good, but probably the worst Harry Potter movie, in my opinion.",
            "review_date": "2019-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another one if the best in the franchise one of my favorites.",
            "review_date": "2019-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That's so funny! I love Harry Potter series!",
            "review_date": "2019-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More darker and mature that the Harry Potter films suddenly became a series for teens.",
            "review_date": "2019-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite of the Harry Potter series, both movie and book",
            "review_date": "2019-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter and the Goblet of Fire is a fun and entertaining movie just before the saga starts to get serious.",
            "review_date": "2019-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter and the Goblet of Fire makes one of the driest books into an exciting and dark film, filled with great acting and incredible special effects.",
            "review_date": "2019-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter and the goblet the fire is the third movie of the series \"Harry Potter\" The films is fantasy and action. The films shows how the main actors are Harry and his friends Rony and Hermione. They live in their school. The films is very nice. The director was inpired the by the book of J.K Rowling",
            "review_date": "2019-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best one so far of the first 4",
            "review_date": "2019-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a great movie with romantic side to it but still holds the main part of the film. great movie to watch with friends or family but beware ones you watch this one your griped.",
            "review_date": "2019-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really loved this series, up until this movie. It was quite difficult with Cedric Diggory. Harry had won the Triwizard cup, and it looks like they've murdered Cedric. Hogwarts had a lot less sporting attitude after. Do you think Harry would have bested Peter Pettigrew alone?",
            "review_date": "2019-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most true movie to the root source",
            "review_date": "2019-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it miss so many things, it felt so wrong\n4/10- Anton R. Skovborg",
            "review_date": "2019-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter And The Goblet of Fire is another incredible edition to the Harry Potter franchise/ As the characters are maturing and Voldemort is coming closer and closer, it becomes more and more intense. With great performances from the whole cast, a great story and screenplay and incredible visuals, it's everything Harry Potter fans will like!",
            "review_date": "2019-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lord Voldemort is one charismatic maggot. The fourth HP movie captures the spirit of the first half of the original eight movies, while taking more risks that pave the way for its ambitious future. Hagrid and Maxime are so freaking cute together and I loved seeing the dragon less cool only than Smaug and Saphira take flight but not as much as Barty displaying the Unforgivable Curses or Harry and Voldemort locking magic beams like they're playing tug-of-war or mimicking Obi-Wan and Count Dooku's lightsaber lock in \"Attack of the Clones\". Mike Newell clearly understood the characters even if he didn't get the plot and it really shows for better and worse and let's face it the novel is like 700 pages long. It's a pity they couldn't do this with \"Half-Blood Prince\". Plus this is the movie that made me think the series was finally starting to make sense and you can enjoy it without being a total nerd.",
            "review_date": "2019-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Themes are more darker for Harry Potter & his friends!",
            "review_date": "2019-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty much an underrated movie ",
            "review_date": "2019-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That was in poor taste.\nPoorly made film and clearly the worst of the series.",
            "review_date": "2019-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great book crammed into a movie that simply isn't long enough to contain all of the details. It's passable and a valiant attempt.",
            "review_date": "2019-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this movie but still need improve.",
            "review_date": "2019-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is OK for young kids, but I've never understood what grown adults get out of this? ",
            "review_date": "2019-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another strong edition, this time with the tri-tournament taking centre stage.Some good moments, with the cast and characters getting to that awkward teenage age, which is portrayed well.",
            "review_date": "2019-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun movie with some great action, but way too long.",
            "review_date": "2019-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Half the book is missing but what is here is fine.",
            "review_date": "2019-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the more lacking films in the series- The book did not translate well to the film here and the character's ackwardness stands out. At this point world building kind of falls off and it's a trope of random events strung together. C+",
            "review_date": "2019-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another long movie in the Harry Potter series that could have done without a couple scenes. But overall, the the plot was the most entertaining thus far and added another level to the saga. (77%)",
            "review_date": "2019-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring, boring, boring...exept the last 15 minutes",
            "review_date": "2019-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "New effects and older actors bring this entry in the series to life",
            "review_date": "2019-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had so much fin watching this franchise I bought reproductions of all there wands!",
            "review_date": "2018-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Quidditch World Cup could've been featured more, same with the maze. The cringey freeze frame at the end is horrendous, as well as Daniel and Rupert's hair styles.",
            "review_date": "2018-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my 2nd favorite Harry Potter movie and one of my favorite movies of all time. I love how well-developed the characters have become and how mature the characters are now. The writing, story, plot, and screenplay were fantastic. The acting performances from the cast were stupendous especially Daniel Radcliffe, Emma Watson, Rupert Grint, Brendan Gleeson, Michael Gambon, Maggie Smith, Miranda Richardson, Robert Pattinson, and Ralph Fiennes. The visual effects were spectacularly done especially the dragons, during the underwater scenes, during the maze scenes, and the fight between Harry and Voldemort. The scenery and sets were fantastic in this movie. The costumes were amazing in this movie especially during the Yule Ball. Also the music and film score in this movie was great. An A+ movie.",
            "review_date": "2018-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great movie and score. ",
            "review_date": "2018-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an amazing movie. I have it at home and I watch it a lot. I really want all the Harry Potter movies.",
            "review_date": "2018-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Harry Potter and the Goblet of Fire\" gives its audience the same charm and wonderful storytelling fans have come to expect, while providing higher stakes at the same time.",
            "review_date": "2018-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The First Potter movie to approach the darker tone...And while the latter movies get phenomenal at it and realize how to do it, the main crew in this one matured too much too quickly, that they just come off as dicks..Still got some great effects though.\n I'll give it \n         - 67%",
            "review_date": "2018-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my favorite movie ever",
            "review_date": "2018-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's much to enjoy here among the melodramatic and slightly corny feast of colours, action, and eccentric performances. The Triwizard Tournament does give the movie a bit of an episodic feel, and it suffers in comparison to the fantastic previous entry, but it has the darkest and most intense ending to a Harry Potter film yet.",
            "review_date": "2018-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Goblet of Fire does a good job of continuing to get out of the childish ways of first 3 films, and finally starts to set up what promises a thrilling ride until the end of the series. Much like the book, the film basically lays the groundwork to establish how Harry and the gang will have to grow against a new and daunting evil, as well as develop new characters that will help them along the way. A good watch, through and through.",
            "review_date": "2018-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My personal favourite film of the Harry Potters. Loved the speech given etc. Super acting ð~?",
            "review_date": "2018-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie, it was the first long book I think they did alright cutting it down, however, they did cut out a lot of stuff from the book.\nBesides that, the film is good and the last final battle is awesome, I could watch it over a thousand times.",
            "review_date": "2018-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved how they expanded the world in this movie. All the little trials they go on is very good. It also started the more adult tone. Barty Crouch Jr. Is really terrifying in this movie. But the tone and all the adult things just came to quick. And the movie just feels quite weird with this tone where adults are killing teenagers. So it feels quite weird and the twist at the end that moody is evil is just not that good. Also the quidditch tournament is way to underused and feels of to the rest of the film. I did not really buy the Voldemort reveal at the end either.",
            "review_date": "2018-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good movie 100% certified fresh",
            "review_date": "2018-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very solid movie in the Harry Potter franchise. While it may not have been as good as the third, this is the first movie where you get the sense that these characters have matured, and are no longer the same as when we first met them in The Sorcerers Stone. There are some great moments in this movie, especially around the Triwizard Cup, but it did feel rushed, as if they were skimming over important moments so that they could get to the even more important moments. Of course, this is normal, because it was an adaptation of an extremely long book, but it took away from the movie a little bit.",
            "review_date": "2018-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fourth chapter in the Harry Potter universe takes a dark turn for the best as audiences prep for the next rise and fall of the one who shall not be named.",
            "review_date": "2018-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is on it's own.  As an adaptation, it's a 2.",
            "review_date": "2018-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was great.",
            "review_date": "2018-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is not one film in this series that isnt great. And this one more than proves that.",
            "review_date": "2018-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. the Harry potter series is my favourite movies of all time. i highly recommend watching this",
            "review_date": "2018-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun to watch, but i hate the ending. I like the book version better. My least favourite Harry Potter movie.",
            "review_date": "2018-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is it me or  is Harry Potter one of the greatest trilogies ever!",
            "review_date": "2018-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Asian girl which harry fell inlove would be better if another person acted. Asians supposed to look cute. \nhttps://i.pinimg.com/originals/30/e6/07/30e607f9656d0c3b45b549e6e6456c8f.jpg\n\n\nOr maybe they did that in purpose so we would this harry and ginny matches. But nope. Ginny as a redhead might be acted by someone else a lots way better. Like this \nhttps://media.istockphoto.com/photos/gorgeous-redhead-girl-picture-id672109050?k=6&m=672109050&s=612x612&w=0&h=8J4Ksu8SUhDolqwpsESBfiM_r-_nLZc8pwObrZVkMmE=",
            "review_date": "2018-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing.  Another perfect movie in the franchise.",
            "review_date": "2018-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After reading the entire series the Goblet of Fire was my favorite book of the 7, however, this movie was a huge let-down, the pacing was too slow and general cinematography and story telling method was not interesting. I remember reading the book and feeling all these emotions such as fright, worry and understanding for these characters as they grow up, however, the movie seemed dull and bland and never had any interesting moments.",
            "review_date": "2018-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cringy, out of character, illogical and just plain stupid. Not only was this the weakest film yet, it was also the weakest story, that made little sense. The only good part was the finale, but it was resovled too quick, so the movie felt like fan-fiction or a filler episode with a teaser of what's ahead.",
            "review_date": "2018-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is where the \"powers that be\" should have begun making these movies into double-movies.  There was too much to go into one.   LOVE this entire series of films and stories.",
            "review_date": "2018-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was the turning point in the series, where it truly became dark and mature. The effects are at their peak and the actors are still going strong.",
            "review_date": "2018-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best one yet is darker and much quicker than its predecessors with a darker plot and even occasional moments of humor.\n-9/10",
            "review_date": "2018-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film really enjoyed it",
            "review_date": "2018-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite from the franchise.",
            "review_date": "2018-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one feels very out of tone than the others, maybe it's because everyones hair seems messy or that it's literally bringing up this hunger games related tournament that they never mentioned before let alone give details of actual death occurring!\nplus I will never forgive WB for just introducing Cedric as Harry's friend when he has been for quite some time. Makes the ending feel not deserved but still a good showdown.",
            "review_date": "2018-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly, this is one of the most best movies I've ever seen, I just can't stop watching it! In my opinion, this movie deserves at least over 90% rotten tomato score. This movie has everything a basic fiction movie needs. It has stuff like conflict, plot twists, action, and lovable characters! I recommend anyone to see it if they haven't.",
            "review_date": "2018-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter is now in a test he must do so pretty epic my favorite part is when he is dealing with a dragon and flying away from it. ",
            "review_date": "2018-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome book, movie still awesome, but not as good as the book...",
            "review_date": "2018-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That's my boy, that's my son! 😭",
            "review_date": "2018-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst film of the series. Very rushed and so many important parts left out from the book.",
            "review_date": "2018-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Taking the series into a more mature and adolescent direction, Goblet of Fire makes the  main trio much more socialized, adding distinct effects, memorable and well-crafted action and momentum further complements this movie's success, while also first showing Ralph Fiennes' iconic villain in body for the first time, adding up to a much more darker and exciting second half of the series.",
            "review_date": "2018-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overall, despite the missing elements from the book, and the fact that it is my least favourite of the 'Harry Potter' films, I still love the film and would rate it a 7/10.",
            "review_date": "2018-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter is my favorite. ",
            "review_date": "2018-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My least favorite one mainly because of that disrespectful beginning during the Victor Crum match that we never got to see. The last 45min are killer fantastic though.",
            "review_date": "2018-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I LOVED THIS MOVIE SO MUCH> YOU JUST KEAP FALLING IN LOVE WITH THE CHARECTERS> AND TRHE MOVIE IT SELF WAS VERY ENTERTAING> HIGHLY RECOMEND IT>",
            "review_date": "2018-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies in the series!!",
            "review_date": "2018-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "while it does have some of the best performances in the series the pacing is to fast and the movie felt a little rushed.",
            "review_date": "2018-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(89/100)\nA very good movie that sets the tone for how dangerous voldemort really is.",
            "review_date": "2018-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My personal favorite out of the Octilogy. I think the CGI is great, the acting is top-notch, the story is amazing, and the action is well done. For me, it gets a perfect 5 stars/100%",
            "review_date": "2018-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though I said in my review for Chamber of Secrets that Chamber is my least favorite, I take that back after watching this one. Unlike the other 3 movies so far this one tries to do to much with the story. I do like any scene with Mad eye and the resurrection of Voldemort. The things I didn't like however are things I really didn't like. The ball scene I thought was pointless, Ron acted like a massive baby almost the whole movie, and it felt like they where trying to hit at so many possible relationships to be explored in later films most notably Harry and Hermione and Harry and Cho but neither of those two things happened. Overall this is still enjoyable but definitely is the worst of the series for sure.",
            "review_date": "2018-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strengths: Prisoner of Azkaban was darker than the first two installments, but it was here that the series moved into a more adult style, which was for the better. As the three leads moved into adolescence, they get a lot more to work with and all three actors deliver. Visually, I love everything about this film. It looks fantastic, while also maintaining the dark tone it needs. The Triwizard Tournament makes for a great concept to adapt to film. All three challenges allow for great scenes filled with tension. Harry's battle with the dragon is exhilarating, while the underwater scenes look great and are filled with danger. The Yule Ball also gave us a lighthearted time out, with some quality character moments. Robert Pattinson (Cedric) was better here than all the Twilight films. You really felt for his death. Speaking of, that was one of the most well done scenes in the franchise. It was so sudden, yet still sad. It had the desired effect. The return of Voldemort (Ralph Fiennes) was also a great scene. It really signaled the tonal shift in the movies and set the stage for a thrilling final four films. Throw in good stuff  from Michael Gambon (Dumbledore), David Tennant (Barty Crouch Jr.), and the visitors from the other schools, and you've got a slew of great performances.\n\nWeaknesses: I honestly can't find many flaws with this film. I wasn't a big fan of adding a tick for Crouch Jr.'s character. I know why it was done, but it took away from the big reveal near the end. As a reader of the book, there could've been more done with Rita Skeeter. She was more prominent in the books and if she wasn't going to play a similar role in the movie, they probably should've just cut her character as a whole.  \n\nOverall: It's the best Harry Potter film. I raved about it already, yet I still left a bunch out. It's faithful enough to the book to satisfy those fans, while also delivering a great movie if you're unfamiliar with the series. The grown up performances by the leads, the fantastic special effects, and the scenes involving the Triwizard Tournament and Voldemort were all tremendous. Stellar.",
            "review_date": "2018-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "See Harry Potter do a tournament! And will it be hard. You know my favorite part is where harry will face off with a Dragon! It keeps getting more creepy. she’ll Voldemort come back all in good time find out! ",
            "review_date": "2018-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 4th film in the Harry Potter series is a vast improvement on the 3rd. There is real character development of the three leads - Harry, Ron and Hermione - as they became angst ridden teens. Also, it has a much darker, deeper story line, with Voldemort coming to full form - literally. There are a few ridiculous scenes - such as the mayhem wrought at the world quidditch match - but these are easy to overlook as you enjoy these familiar characters.",
            "review_date": "2018-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its entertaining bit did a real injustice to the book",
            "review_date": "2018-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Trash. They ruined the story by drastically changing it. What a halfassed 'script.'",
            "review_date": "2017-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great chapter to the Harry Potter movie franchise. New twist added to the school year with Hogwarts hosting the Triwizard Tournament and students from two other schools of witchcraft and wizardry. Professor Mad-Eye Moody is another great addition to the cast. Climax of the movie intensifies the rivalry between Potter and Voldemort to new life-or-death heights.",
            "review_date": "2017-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a solid follow up to Year 3 and challenges our titular character more than ever but loses sight of Ron and Hermione in the excitement of the Tri-Wizard Tournament which, rightfully so, dominates this film. Amazing action scenes and good comedy moments make this longer film feel short",
            "review_date": "2017-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst of the series. A disappointment to the rest of the wonderful films in this series. I don't know whose idea it was for EVERYONE to have really long hair in this film, but it doesn't fit the characters to me.",
            "review_date": "2017-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one has some of the funniest moments in the franchise for me. And one of the most shocking moments. Witch i believe is the turning point of the franchise that turns it more dark and better suited for adults. You can see they they raised the budget for this one. I like it.",
            "review_date": "2017-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was amazing but just like the Order Of the Phoenix \nHarry Potter seems as if he hit puberty and is like \"life is so hard I hate it, i'm a angsty teenager\"",
            "review_date": "2017-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First, a confession: I am not, by any stretch of the imagination, a Potter fan, so I felt something of a fraud as I sneaked into a media screening of Goblet of Fire while many bona fide devotees have had to wait it out.\n\nMy interest in the franchise has thus far consisted of sitting through the first film in a freezing cinema wondering what all the fuss was about, and skim-reading the second book on an aeroplane to appease my curiosity as to the young wizard's appeal. I have long been astonished at the sheer scale of Rowling's achievement, and while I may treat many of my fellow commuters - the regressive thirty-somethings who are buried in her CHILDREN'S novels on the tube - with something approaching contempt, I realise her success is very much deserved. It's a bit excessive though, and frankly enough to reduce any impoverished wannabe writer to a jealous whimper.\n\nBeing an outsider who will undoubtedly get all the names wrong, I won't spend long here on the plot, save to say it revolves around the \"tri-wizard tournament\" - an epic and dangerous event that threatens to split Hogwarts loyalties asunder.\n\nInstead, I'll concentrate on the performances, and, first up, I fear I must say I have reservations over the casting of Harry. Daniel Radcliffe looked an inspired choice after the first film - floppy hair and specs and an earnest charm - but I'm afraid to say, he is an ordinary actor. The trouble with hiring an eleven year old for a film project as massive as this, is you are rather in the lap of the gods when it comes to puberty. It's a bit like doting on a baby puppy and then being terribly upset a year or so later when a bloody great Alsatian smashes up your living room and defecates on your carpet.\n\nMuch better are his faithful chums. Rubber-faced Ron (Rupert Grint) handles the adolescent grunting with considerably more aplomb than Radcliffe, and he also says \"bloody hell\" a lot which elicited gasps of delight from some of the younger viewers around me. There is some nice chemistry between him and the hitherto gawky and posh Hermione who has blossomed into a snooty English rose, and the theme of teenage angst runs deep throughout the excellent supporting cast.\n\n\"Dark and difficult times lie ahead\" is the smartly worded tagline, and one gets the impression Harry is far more comfortable dodging fire-breathing dragons, than he is tiptoeing around the opposite sex. The growing pains are neatly handled by director Mike Newell, himself no stranger to the awkward whimsy of love's young dream after sterling work on Four Weddings and a Funeral - Indeed, many of the light-hearted interludes around the school dance scenes betray Newell's penchant for bittersweet comedy and romantic pratfalls.\n\nAnd, of course, the adults in the cast zoom around with a zest inspired by their youthful co-stars. Robbie Coltrane's Hagrid fashions an unlikely romance with a giantess played by Frances De La Tour; Michael Gambon is a sprightly Dumbledore; and Gary Oldman's screen time is restricted to one scene where he thrusts his head through the burning coals of a roaring fire to offer Harry some sage advice. Perhaps they should have simply hired a stunt double and saved on his fee.\n\nMost impressive of all is Ralph Fiennes who is genuinely terrifying as the evil Lord Voldemort. Fiennes is ably assisted in his wickedness by a suitably conniving Timothy Spall and also the most fearsome set of nostrils to grace the silver screen since Hannibal Lector flexed his snout at Agent Starling in The Silence of the Lambs.\n\nIt is pretty stirring stuff - visually extraordinary in places - and nicely paced. Potterfiles will love it and detractors may just find their criticisms stuck in their throats. However, my disdain for adults who proudly devour the novels on public transport without any sense of shame remains absolute.Based on one of the best books of the Harry Potter series, the film adaptation of 'Harry Potter and the Goblet' had a lot to live up to and I think it succeeded. As Potter fans will know, in GoF, Harry is now fourteen and in his Fourth Year at Hogwarts. When an ancient tournament between Hogwarts and two other European wizarding schools is held that year, a Seventh Year contestant is chosen from each school to compete but things go dramatically awry when Harry, three years too young to even be entered in the dangerous and challenging tournament, is somehow also chosen after his name is mysteriously nominated. GoF is a sharp turning point in the books as the tone darkens considerably and the characters themselves change from being rather wide-eyed innocent children to adolescents thrust the turbulent, uncertain adult world where being 'good' or even an innocent will not guarantee your survival. This shift is also reflected in the film, which was rated 12A (PG13 for Americans), the first of the HP films to be rated so high.\n\nI have to say I did enjoy this film, although Prisoner of Azkaban remains my favourite of the four. Unlike the first two films, this did not attempt to condescend as much to small children in the audience. The tasks of the Triwizard tournament captured most of the thrills of the book, particularly the second water-based task where the merpeople were suitably creepy (now we know why none of the kids go swimming in the summer term!), but the first task over-ran for a minute or two more than needed. Light romance was touched upon yet wasn't over-emphasised and the Yule Ball will please those who enjoyed the scenes in the book but audience members over the age of sixteen might find teens ogling each other a tad dull (Hermione is very out-of-character and the scene does drag).\n\nThe acting of the adult cast is, of course, exemplary as always. Alan Rickman's Snape may only have had four or so scenes but he definitely made his presences known while Maggie Smith really captured the essence of McGonagall. Many people do miss Richard Harris' Dumbledore but I found that Michael Gambon has done an excellent job of moulding the role to make it his own. In GoF, Dumbledore feels very human in the way he carries the weight of the wizarding world on his shoulders and though he struggles at times, his concern for his pupils is paramount. I finally felt the close rapport between Dumbledore and Harry in this film that was missing in the previous three HP flicks. However, the prize has to go to Brendan Gleeson for his scene-stealing depiction of Mad-Eye Moody. Gleeson clearly enjoyed illustrating Moody's dangerous, feral edge.\n\nThe younger cast have also grown into their roles, improving from their previous outing. Rupert Grint, usually used to playing a comical and stupid Ron, had the chance to cut his acting teeth and show Ron's darker, bitter side and he did well. The Phelp twins have also improved dramatically. No longer do they come across as wooden cut-outs just reading from a cue-card and instead they are able to show the mischievous spontaneity of the Weasley twins. And I look forward to seeing more of Matthew Lewis, who was great at showing Neville's sensitive side without making him too klutzy. Out of the younger cast, though, Dan Radcliffe is the one who has progressed the most. In PoA, he was awful in the 'he was their friend' scene so he seems like another boy in the harrowing graveyard scene and the aftermath, depicting Harry's anger, feelings of vulnerability and grief. He still stumbled on occasion in other scenes but I, at last, have faith he might be able to do the Harry of 'Order of the Phoenix' justice when the time comes.\n\nThe film did lose points on a few issues. Although most of the young cast have expanded their acting skills as they have gone on, Emma Watson is waning. She has a tendency of over-enunciating her lines and being too melodramatic, which worked in 'The Philosopher's Stone' when Hermione was condescending and childishly bossy, but is just annoying by this point. She spent most of the film sounding as if she was on the verge of tears or in a hormonal snit, even in scenes which were not remotely sad or upsetting. There was also a choppy feel to the film, as if Steve Kloves struggled to properly condense the book into a two-hour film. Those who haven't read the books will have missed quite a bit and those who have read the books will feel the film is very rushed. Molly Weasley and the Dursleys were also missed, especially since I think Julie Walters would have been exceptional in the Molly/Harry interactions that take place aftermath of the graveyard scenes of the novel as the film didn't round off in a manner that reflected a boy had died and Harry would be traumatised by what he saw.\n\nI think most Potter fans will enjoy this although they will remark that it could have been better. Non-fans will also get something from this film as I imagine it is hard not to be captivated by the many action and dramatic events but they may find themselves muddled by the story. I would recommend that parents of young children either keep away or, at the very least, check out the film firstly before deciding if their child is old enough to cope with it. When I went to see it, there was a small lad of four or five being dragged along and in the middle of a particularly fearsome incident, the silence of the moment was cut by a wee voice crying, 'Mummy, I'm scared' so, parents, be warned.Before I review the film, let me start off by saying that I am a fan of the Harry Potter films and have liked all of them up to this point. I'm not going to compare the movie to the book because, as most people know, they are two completely different animals. There is no way in heaven, hell or on God's green Earth that a book the size of Goblet of Fire could appropriate EVERYTHING that happened in the novel. I'm going to go by what I saw up on the screen.\n\nWhat I saw up on the screen was a completely pedestrian effort that made no attempt at contributing style, substance, or character development to a series that was getting better and better with each progressive film. Scenes start and stop with no explanation. The big action scenes (especially the fight with the dragon) just begin with no buildup whatsoever almost as if you've stumbled upon someone playing the new Harry Potter video game. There is no sense of the passage of time at all. The Tri-Wizard tournament consists of only three challenges yet the competition seems to last the entire school year. Ron and Hermione have a blow-up at the Yule Ball because of his misplaced jealousy yet six months go by (the last day of school) and NOTHING MORE is ever said about it? She even tells him that he made a mistake by not asking her out and he lets SIX MORE MONTHS go by without saying a word?!\n\nI can forgive the fact that a lot of these things are just glossed over because of the time crunch but I can not forgive situation after situation that has something happen only because the lead character needs to live. In the aforementioned fight with the dragon, Harry ends up hanging from a ledge 100 stories above the ground trying to reach his broom which is nearby. The dragon lands on the building and begins crawling down to him, slipping and sliding, peeling away shingles as it goes and it suddenly hit me. Harry is hanging from a ledge, defenseless, and the dragon is CRAWLING toward him. He is dealing with a creature who spits fire and who can FLY. One flap of its wings and a quick belch and Harry is crispy. The ONLY reason it doesn't is because Harry has to live. \n\nAnd for that matter, no one in the film acts or reacts to a situation because it's in their nature to do so. They react in a certain way because that's what the script demands that they do, even if it completely goes against their character and everything that we know about them. When Hermione blows up at Ron, it seems to come out of nowhere. She seems to be mad because Ron didn't ask her and she wanted to go with him. But if this is true, why is she so happy about being there with a competitor from a rival school? And I don't just mean happy, I mean she is absolutely BEAMING when she arrives with him. And at one point, Dumbledore grabs Harry and shakes him violently demanding that he answer a question. My reaction to that was WTF??? Has Dumbledore ever shown that he's a violent person or that he would grab a STUDENT, yelling in his face? Of course not but he does it because the script says he has to. At one point in the film, a particular curse is brought up that allows you to control another being. That's kind of funny because it seems like every character in this film is being controlled by the screenplay, even if it means going completely against character.\n\nBut I guess the biggest disappointment for me was the confrontation between Harry and Voldemort. For someone who has been built up to be the devil, he sure is beaten easily at the end of this film (and by a quartet of ghosts, no less, which took cheesiness to a new level). The appearance of Voldemort is obviously supposed to be chilling but, in actuality, he looks like a hairless rat wearing a cape. The great Ralph Fiennes does everything he can but part of the appeal of this character is NOT seeing him in closeup in full daylight. He shows up when he wants and manages to let Harry live because he'd rather talk him to death instead of just cutting off his head while Harry is pinned down. But, of course, that's because Harry has to live and this final confrontation, again, seems ridiculous in retrospect.\n\nThe entire Tri-Wizard tournament seemed a little off-kilter to me. You perform tasks that test your abilities and try to do better than your opponents, but to what end? The final test consists of entering an ever-changing maze and the first competitor to find the trophy wins the tournament. So, even if you finish DEAD LAST in every other challenge, if you're the first to find the trophy, you win anyway. So, I ask you, WHAT'S THE FRIGGIN' POINT OF EVEN COMPETING IN THE OTHER CHALLENGES?????? Why put yourself in harm's way three times when you only HAVE to do it once? \n\nLooking back, I just realized that you could completely skip this film and move right on to number five without missing a beat as long as you had someone to tell you two things about the film - Harry's interest in Cho and Voldemort being back, sort of. Here's hoping Order of the Phoenix doesn't follow the same path.",
            "review_date": "2017-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first three films but still stable.",
            "review_date": "2017-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have seen all 8 harry potter movies and this one is my favorite. Of course they are all good but I find that this one has a nicer story.",
            "review_date": "2017-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "8,5/10\n\nBetter visual effects, a more epic scope and character development. The conflict between Harry and Ron, the horror like third act, everything is making Harry Potter more mature, like its audience, and I like it.",
            "review_date": "2017-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ALWAYS THE BEST MOVIE",
            "review_date": "2017-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best of the Harry Potter films--very suspenseful.",
            "review_date": "2017-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First half was a little slow but it ended great.",
            "review_date": "2017-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The strongest out of all of them. A brilliant story and new characters. An incredible and memorable ending. Lots of action and it all gets dark and you feel the change. Incredible movie.",
            "review_date": "2017-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter was interesting it's cool how he has to take these tests and do the tournament, but over all Harry potter movies are not my favorite",
            "review_date": "2017-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The turn in the franchise that finally pushes the Harry Potter movies forward, filled with much more darkness, a little more comedy, and a lot more tragedy. \n\nHarry is introduced to yet another Defense Against the Dark Arts teacher: the grizzled Mad-Eye Moody (Brendan Gleeson), a former dark wizard catcher who agreed to take on the infamous \"DADA\" professorship as a personal favor to Headmaster Dumbledore (Michael Gambon). Of course, Harry's wishes for an uneventful school year are almost immediately shattered when he is unexpectedly chosen, along with fellow student Cedric Diggory (Robert Pattinson), as Hogwarts' representative in the Tri-Wizard Tournament, which awards whoever completes three magical tasks the most skillfully with a thousand-galleon purse and the admiration of the international wizard community.\n\nWithout question, I think this film is the best film in the franchise up to this date. It's easily the darkest, it has the most magic we've ever seen till now, it has deeper character development, it has a little more comedy, and it's just even more crazy. Without a doubt, it's one of my personal favorites in the entire series, which is saying a lot considering how good all the movies have been till this point. \n\nOne of the best things about this film is just how dark and emotional it is. This is the first PG-13 film in the franchise, and they really take advantage of that. This feels like the film that finally immerses you into the lore of Voldemort. From the very first scene, they establish the tone of what this film is going to be. It's much darker and more serious, showing us that the stakes are a lot more higher than we could ever imagine. The film is also simultaneously emotional, with a very impactful ending. It was a tragic ending and a perfect way to end this film. It ends on a question mark and a darker note, making us excited for what's next. \n\nI think that this film easily looks the best of the first four films. Granted, I feel like that's an obvious, but this easily is the most least dated movie till this point. Did that make sense? Probably not, but you get what I mean. The CGI and the sets look amazing in this film. The monotone and color pallet used suggests a much more darker and grim film. The camera work and the elaborate angles help tell a story through its visuals, which makes it even more impactful. I think this film looks amazing and it definitely deserves praise in that department. \n\nWith our main protagonists, I think this is also the point where you not only see them transition as older kids, but their acting also evolves a lot in this film. You can see their acting skills and how they've grown throughout the year. They're kids, but they act like they're older. Our characters also go through the same problems that a kid would at their age. They have problems expressing their feelings for one another, they struggle with their self image, they struggle finding dates to the ball, and so forth. It makes them even more relatable, and it makes us love our characters and cherish their relationships just as much. \n\nIn the end, this has been the most exciting film so far, while also being the dark turning point that makes this franchise what it is. I thought this film was fantastic, and a near perfect film.",
            "review_date": "2017-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is exciting, it is sad, and it is magical. It shows yet again another memorable moments of the Harry Potter series. It goes down a bit darker from The Prisoner of Azkaban, as it's vibe is more spooky and grim. But this Harry Potter has to be in my Top 3, it is that good.",
            "review_date": "2017-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I never knew what to expect with the continuing Harry Potter series, but after seeing this one, I was no longer only intrigued by these movies, rather I had become locked in a full on fandom.  Goblet of Fire was my favorite of all the HP movies for many years, and today still is one of the very best of the series.",
            "review_date": "2017-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing addition to the franchise that has now become a family classic and must see. It involves many of the beloved moments and characters from the movies. It involves an even further step into the darker places of the wizarding world. If you love Potter this is a film for you",
            "review_date": "2017-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To my mind the best HP film of the lot!",
            "review_date": "2017-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fourth installment, in this ever growing film franchise, doesn't disappoint. Radcliff is still an amazing Harry Potter and his acting abilities just keep growing. He is no longer a pinning pre-teen. Now Harry is an edgier teenager that knows more about himself and his abilities. His return to Hogwarts is thrown into a loop when the Triwizards tournament finds its way to the school. Watching Harry tackle the different obstacles and challenges that await him in the tournament has the audience at the edge of their seat. The CGI has come a long way since the sorcerers stone. The dragon sequence alone is breathtaking in how gorgeous it looks. The story telling is astounding, but falls just a bit shorter than The Prisoner of Azkaban. That is no knock against the film at all, as I saw that as a near masterpiece. I highly recommend this to any Harry Potter fan, and any fantasy fan alike.",
            "review_date": "2017-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Goblet of Fire is pretty intense in this movie :)",
            "review_date": "2017-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good Potter entry and my favorite film with Robert Pattinson in it. It wasn't my favorite film in the franchise but it has a great cast, good moments and overall is a good film.",
            "review_date": "2017-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Second Favorite Book 3rd favorite movie Why in the name of Merlin is Harry's and Ron's hair longer as they never were in the books",
            "review_date": "2017-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was quite a bit darker then the last three films. Ralph Fiennes was great as Lord Voldemort. Still a lot of fun.\n\n8.6/10",
            "review_date": "2017-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just like the books, the Goblet of Fire changes the whole series. Unexpectedly dark, great performances from Radcliffe, Grant and Watson, interesting and ends with one of the greatest climaxes I've ever seen, this movie, while not as complex as the 743 page book, is amazing.",
            "review_date": "2017-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This fourth entry in the franchise continues the compelling storytelling that made the previous installment so enriching while adding spectacle and humor to the mix.",
            "review_date": "2017-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Harry Potter movie with everything the third one did great only this one has some pacing issues.",
            "review_date": "2017-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "harry potter 4 was the only harry potter movie I hated",
            "review_date": "2017-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed this one especially first look at voldermort",
            "review_date": "2017-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Back when there was still hope for Robert Pattinson's career.",
            "review_date": "2017-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the funner entries into the franchise, this film can't quite match its novel, but is still a better Potter than the earlier films.",
            "review_date": "2017-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An AMAZING movie with a brilliant history!",
            "review_date": "2017-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked how this one starts to build the characters as adolescents instead of children.",
            "review_date": "2017-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WHAT I LIKED: The past three Harry Potter films have been crying out for a proper high-stakes story that tests these great characters, and they finally found it in 'The Goblet of Fire.' Yes thanks to a well constructed mystery-driven plot filled with lots of tense adventure, this film is far more able to engage and excite and there are fewer unneccessary tangents to go on. As such, this is without doubt the perfect time to have our cast at this greater age as they're far more able to fill the shoes a more in-depth adventure requires.\nWHAT I DIDN'T LIKE: It has to be said that on an aesthetic and spectacle level, it's far less pleasing than Michael Seresin and Alfonso Cuaron's efforts.\nVERDICT: Finally a properly exciting, engaging and adventurous journey for these great characters. This was much deserved.",
            "review_date": "2017-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was my least favorite of the movies so far. It was still well made and fun to watch but it wasn't as good as the 1st three. The acting was pretty good but the  story seemed so unrelated to the main story arc that it felt unnecessary. It was still a fun story but it didn't feel connected to the other movies, kind of like episodic shows like The X-Files. The climax with Voldemort was good though. Overall, I recommend it but it wasn't as good as the others.",
            "review_date": "2017-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was fly good to watch but... you can't (I don't think anyways) watch it on this app",
            "review_date": "2017-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not better than the third, but this fourth entry keeps the franchise going with incredible special effects and topnotch acting.",
            "review_date": "2017-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The special effects are great for a 2005 film, and the plot is intriguing. With good dialogue and an epic finale, the fourth HP movie doesn't disappoint.",
            "review_date": "2017-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter and the year no one got haircuts.",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great installment into the Harry Potter franchise. It is great to see the cast grow and mature just as their character are. The special effects are also getting stronger and stronger. Voldemort is finally here and has lived up to the hype so far. The Triwizard tournament is fun and a great idea. These movies keep getting better and better.",
            "review_date": "2017-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best fun lots of imagination",
            "review_date": "2017-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this film is so good with the Triwizard ternament all the great actors they put into this film wow!!",
            "review_date": "2017-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film moves the franchise into darker terrain and maturer themes. For what it does lack in storytelling, and some key book points that it leaves on the table, The Goblet of Fire makes up for with compelling drama and exciting action sequences.",
            "review_date": "2017-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first film of the series I lost interest in slightly.",
            "review_date": "2016-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By far my favorite Harry Potter movie. The only thing I would like to see next from the Harry Potter series would be a movie just about quiditch. That's my favorite part of any movie but with the cup in this movie it's almost just as good. The events were all amazing. Great movie. It has everything a good Harry Potter movie has and SO much more! Never skip this one when watching them all.",
            "review_date": "2016-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eternal Glory For Harry Potter",
            "review_date": "2016-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Tennant is in this movie!?  He rocks as Mr. Crouch!",
            "review_date": "2016-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More rushed than Azkaban but about as good.",
            "review_date": "2016-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it hits a few bumps on the road to PG-13 territory, Harry Potter and the Goblet of Fire - rather unsurprisingly the highest grossing film of 2005 - still boasts more mature performances from its young cast of teens, amazing special effects, a few funny moments here & there and a thrilling electrifying climax which introduces Ralph Fiennes in one of his most famous roles to date. The end result is ultimately one of the most thrilling Harry Potter films to date which even boasts complexity in terms of storytelling.",
            "review_date": "2016-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "well... i liked, it's a good movie and the first appear of Voldemort was great but i liked more the last one",
            "review_date": "2016-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My kids really like the Harry Potter series, books and movies.\n\nI like them too, up to a point. It's a creative and interesting universe.\n\nThis brings book one of the series to life very well, although it wasn't exactly as I had imagined it, pretty close.",
            "review_date": "2016-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favourite entry (so far) in the Harry Potter Series, The Goblet Of Fire has an emotional weight not quite reached in the previous 3 movies. The actors have really come into their own, and seem very comfortable with their roles. Radcliffe takes on the part of an angsty teen with realism and believability, showing us that, despite being a much-admired wizard, he has no magic to fight off the horrors of puberty. Burgeoning adolescence is an underlying theme here, and it's explored so effectively and with such heart that I actually found myself feeling deeply for the characters, particularly in regards to the romance between Ron and Hermione, which contains undoubtedly the most moving scene. The effects are still spectacular, the action scenes are tense and engaging, and while the supporting characters don't have a lot to do, the focus is maintained where it needs to be. It might go on a bit long, and the climax is somewhat disappointing, but it brings a greater depth and seriousness, while managing to be funnier than even. That's quite an achievement, and the film pulls it off with style.",
            "review_date": "2016-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I remember loving this movie!",
            "review_date": "2016-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think the action picks up a bit more compare to the 3rd film. It is 4th year of wizard school. Daniel Radcliffe dream of Voldermort and his minions. When the family and friends attend a national Quidditch tournament, Death Eaters came and Daniel saw the guy (David Tennant) who appear in his dream. Brendan Gleeson is the new defense against the dark arts teacher. This year the school held the Tri-Wizard Tournament and under 17 years old cannot participate because it is dangerous. Robert Pattinson is chosen to represent Hogwarts. Stanislav Ianevski from another school and he is also a German national team Quidditch seeker. Clémence Poésy is another from the girls school of France. Daniel's name is chosen as the 4th contestant, to the dismay of Rupert Grint mostly and many speculate he cheated in order to join. The council head decide to let him join although he is underage. Then there is the ballroom dance which Emma Watson go with Stanislav. Daniel want to invite Katie Leung but she agree to Robert. So it was disastrous for both Daniel and Ron. The first contest Daniel luckily outwit the Dragon and got the egg for the next clue. But Robbie Coltrane warn him beforehand. Unable to decipher the egg clue, Robert tell Daniel to take a bath and Daniel submerge it underwater and hear the clue. Matthew Lewis got hold of a herb to let Daniel breathe underwater. Clémence is defeated by the sea creatures. Daniel want to save 2 \"hostage\" but the creatures only allow one. He save 2 and himself attacked, uses magic to propel back on land. \nStanislav save Emma and Robert save Katie. Clémence thank Daniel and Ron for saving her sister. While in the woods, Daniel saw the corpse of the council head. The last contest is to grab the winners cup in the maze. All are defeated except Daniel. He reluctantly save Robert from being grab by the branches and together they hold the cup but whisk to a cemetery. Timothy Spall resurrect Voldermort (Ralph Fiennes) and kill Robert who is in the way. Turns out Jason Isaacs is also one of his followers. Ralph is gonna kill Daniel when their powers clash, his parents and Robert appear to hold Ralph distract to let Daniel grab the corpse and cup to the victory venue. Brendan bring Daniel to his room and he blurted out details which Daniel never mention. Michael Gambon, Maggie Smith and Alan Rickman rush in and reveal the chest hold the jailed and real Brendan. The fake is David all along using disguise potion. He is the one who make Daniel been chosen and win the tournament to let Voldermort revive because it need his blood. Michael decide to tell the school who kill Robert and they go for summer break..",
            "review_date": "2016-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Goblet of Fire triumphs in the way it resonates with all sorts of teen problems, primarily dating relationships. It's equally as enjoyable to see the spectacle of the Triwizard Tournament, ranging from the glamorous (Beauxbatons) to the spooky (Black Lake) to the disturbing (Mad-Eye Moody). But I got to say that of all the films, this by far has the most unbearable acting, with no thanks to David Tennant or Robert Pattinson .",
            "review_date": "2016-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much like with its predecessor, the film here definitely goes in a different direction in regards to its themes and sense of maturity and colour. But that's not to say that this is a bad thing, especially for this film specifically. While the plot still feels rushed, the pacing is much better than that of its predecessor. The characters still aren't as likeable, but they do have more moments that make them shine, and the action is still pretty intense. A good film overall.",
            "review_date": "2016-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The one when you-know-who makes an appearance. Based around a young wizard tournament with puberty thrown in for good measure.",
            "review_date": "2016-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Up until Goblet of Fire, the Potter franchise is a load of fun with some creepy imagery and dark concepts mixed in.  But Goblet of Fire is the turning point in the franchise for me.  Yes, Prisoner of Azkaban has its dark moments, but the grave sense of danger and threat isn't really present until the 4th film.\n\nThe Goblet of Fire opens with a pretty terrifying dream sequence involving a deformed Voldemort, which may very well be my favorite opening to any of the films in the series.  It comes right out and states that this franchise is no longer just a fun adventure, there are dangerously high stakes involved here, and Voldemort is a part of them.  Of course, part of the fun nature of this film is its mysteriousness and the unpredictability.  I've seen the film several times, but there's nothing quite like watching the Triwizard Tournament with someone who has no idea what they're in for.\n\nGoblet certainly brings some new characters along with its different identity.  Most notably, Brendan Gleeson's Professor Alastor 'Mad¬Eye' Moody.  Looking back, it's difficult to assess how much I enjoyed the character considering he was kidnapped for nearly the entire length of the film, but his impact on Harry's tribulations throughout the film are felt.  I mean, why wouldn't he be an interesting character?  He's just the 4th straight new defense against the dark arts teacher to be hiding something in one way or another.\n\nNo matter, The Goblet of Fire is full of fresh adventures for the trio of Harry, Ron, and Hermione.  Most of the film involves Harry competing in the various events of the tournament (which ends up feeling a whole lot like a Hunger Games), but there's always time for some quality trio scenes.  Weirdly enough, this film made those scenes mostly deal with romance at the Yule Ball involving the three schools.  It's admittedly the next logical step in these teenagers lives, but sometimes it can be a bit overboard.  Some of it plays for comedy, but did I really need to see EVERYONE at Hogwarts, and I mean everyone, share the dance floor or have a scene with a love interet.\n\nIn many ways, The Goblet of Fire is the turning point in the franchise, and the first time you see someone of importance get hurt in a grave way.  Although you don't have a ton of time for Cedric to develop, his death altered the course of the series and the mindsets of those at Hogwarts.  That in itself makes it an important installment in the series.  Not to mention the fact that there's a dragon, a bada** maze, and one unsettling resurrection towards the end.  This is one of the better films, by a good margin.\n\n+Moody's introduction\n\n+Voldemort officially returns\n\n+More mature and powerfully written than previous entries\n\n+Turning point in the franchise\n\n-Too much romance\n\n9.2/10",
            "review_date": "2016-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "VIKTOR KRUM! WORM TAIL! TOM RIDDLE! And dragons? MY PERSONAL FAVORITE IN THE ENTIRE SERIES.",
            "review_date": "2016-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Harry Potter\" hasn't lost it's charm, but if I were taken hostage by my school and chained to the bottom of a lake for a school-sponsored wizardry competition, I would, at least, be looking into other schools that I'm qualified to enroll in at the end of the semester.",
            "review_date": "2016-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one brings a new elements in to wizardying  world. Love and jealousy.",
            "review_date": "2016-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good, albeit the CGI looked a little too fake. I wish there had been more poc's in this movie though.",
            "review_date": "2016-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the best, movie ever",
            "review_date": "2016-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter and the Goblet of Fire was excellent. Depth, complexity, great story, more darker, great visuals. This fourth installment to the Harry Potter franchise proves to be more crafty, vibrant, great performance by all the cast, and it was way more entertaining.",
            "review_date": "2016-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "...Why do they all have long hair??? Is it the angst of adolescence? Goblet of Fire feels like it should be better than it is. It has all the elements of success: exciting new characters, dangerous competition, romance, and devious undertones. These exciting surface level encounters seem to make up for the lack of depth in the 4th Harry Potter installment.",
            "review_date": "2016-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great acting, twists, great action scenes. Good story.",
            "review_date": "2016-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I must say, this was a very well presented piece of work! I liked the Adolescent subplot, which was treated neatly by Mike Newell, and the outstanding visual effects & screenplay proposed by Steve Kloves. All for which I think this was an incredible movie!",
            "review_date": "2016-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This fourth instalment in the Harry Potter franchise not only sees the main characters maturing and undergoing their fourth year at Hogwarts but also see new levels of depth and drama. This is easily classed as the most intense and complex of the films so far with one again breathtaking visuals and terrific performances from the young actors. A fantastic film with lots to offer. Another must see.",
            "review_date": "2016-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the best but still good.",
            "review_date": "2016-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter returns in his fourth year at Hogwarts, where a magical inter-school tournament is taking place... one for which he is mysteriously entered for with malicious intentions. With a young cast giving their best and complex performances yet and an older cast as brilliant as ever, this Harry Potter film is the typical fantasy adventure, tipped off with the hormone-riddled atmosphere of teenage romance and comedy. Ralph Fiennes joins the cast as Lord Voldemort giving a stand-out performance and Daniel Radcliffe also carries the film the best he has so far. Though it can feel a little packed and predictable, Harry Potter and the Goblet of Fire is an entertaining and mostly slick film, that heightens the ever-growing suspense of the Potter franchise.",
            "review_date": "2016-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite a somewhat-rushed first act, Harry Potter and the Goblet of Fire boasts stunning visuals,talented cast, and a twist so great you'll rethink the entire movie.",
            "review_date": "2016-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies I have ever seen. I was watching it yesterday be cause it way a Harry Potter birthday marathon. Happy Birthday Harry Potter!",
            "review_date": "2016-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good. Newell has created a diverse movie, with humour and darkness perfectly dancing together at the Tri Wizard ball. \n\nFelt it was more consistent than Azkaban, with the light hearted moments creating an all round better feeling throughout the whole movie.\n\nExcellent installment.",
            "review_date": "2016-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Goblet of Fire is another great installment to the franchise! The return of the Dark Lord, the tasks, the manipulative times the characters are going through. Although the movie suffers from sudden halts after a task takes place, this is still a great Harry Potter flick, and great movie overall!",
            "review_date": "2016-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The beginning of Harry Potter's descent into darkness, this is one hell of a ride covering everything from mermaids to dragons and in between. But no one could have prepared for the darkness of the ending second only to Half Blood Prince.",
            "review_date": "2016-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Being the last time Harry truly got to enjoy a year at school before it all took a turn for the worst, I was surprised by how little school there was in it. I also thought that this was a worse adaptation than Prisoner, as they decide to leave out a very important ending, that practically cemented the philosophy of neither side being truly good. When the film came to a close on that incredibly up beat ending I wanted to find Newell and explain to him why the ending is so important. However, all those problems I have are taken back by the shear perfect directing. The style in this film is such a good balance between fun and dark that it creates its own. The story took Rowling 600 pages to explain, yet the film still manages to establish all the main details. The actors have once again improved, and the characters themselves now all have understandable and relatable motives. The mystery is excellent, the effects are wonderful, and the stakes have risen to new heights. A wonderful film, for a wonderful book.",
            "review_date": "2016-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not one of the best Harry Potter movies because some of the characters' motivations and decisions do not make sense.  Also, the story line isn't logical at some points.",
            "review_date": "2016-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun nicely paste and compelling along with its dark tone performance from Daniel and fines make this a magical film a joy to watch",
            "review_date": "2016-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even darker, more action packed and funnier than the other adaptions- Goblet of Fire is an adrenaline thrill ride.",
            "review_date": "2016-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This book is what many consider to be the best in the series, and I remember LOVING Goblet of Fire as a kid.  The movie touches upon most of the main events of the movie (and changes around a few things, too).  I stopped reading the Harry Potter books after GoF, because I had it in my head that Rowling's success was going to get to her head, and that would ultimately change the outcome of the story, and I didn't like that.  I was thirteen, so sue me.  I really enjoyed this film, other than the fact that I HATED Daniel Radcliffe's haircut.  Since when did Harry Potter have an emo sense of style that was plucked from Hot Topic?!  #Justice4Diggory",
            "review_date": "2016-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Triwizard Tournament was one of the better things to happen in the books, so I'm glad the excitement of that event translated perfectly into the movie. Harry's hair is longer than ever.",
            "review_date": "2016-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry's Journey Takes a Dark Turn\n\nOriginally Written November 18, 2005--\nThe fourth movie in the blockbuster Harry Potter franchise sees Harry (Daniel Radcliffe) returning for his fourth year at Hogwarts School of Witchcraft and Wizardry, along with his friends, Ron (Rupert Grint) and Hermione (Emma Watson). This year, the legendary Tri-Wizard Tournament brings the arrival of two competing schools to Hogwarts. When Harry's name is unexpectedly drawn by the Goblet of Fire to compete in the tournament---even though he is not eligible and is technically a fourth player---he must still compete in the dangerous contest.\n\nI really enjoyed this new Harry Potter film.  While condensed quite a bit from the largest novel in the series to date, screenwriter Steve Kloves streamlined J.K. Rowling's 700-plus-page opus into cinematic fighting form.  Meanwhile, director Mike Newell delicately balances between whimsy and the ominous, on the uncertain middle ground where Harry lives, poised between fun at school, teenage romance, and an ever-deepening dark abyss.  And the special effects, which threatened to overwhelm the first two movies, are seamlessly integrated here.  But the best part of the film are Radcliffe, Grint, and Watson, who are becoming amazing actors in their own right.  Who would have ever thought when these three kids were cast in these iconic roles all those years ago that they would be the best part of these films?  In a word, incredible!  Four-and-a-half stars.",
            "review_date": "2016-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quality movie. Longer, but worth it.",
            "review_date": "2016-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the better Harry Potter films",
            "review_date": "2016-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story slowly starts becoming more adult, with themes like racism, mourning, and the general feeling of the first steps out of the protected environment of childhood. Visually beautiful, as always.",
            "review_date": "2016-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as bad as the 3rd film but still could use plenty of help...",
            "review_date": "2016-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By far the most mature in this series so far, this is the movie that spawned the Harry Potter we've grown to love in the past few movies. Goblet of Fire is a showcase for the great cast and still solid writing that never tires; even if it isn't up to the standard of future sequels.\nVerdict: A-",
            "review_date": "2016-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love, humor, tragedy, friendship, courage... name it. This movie is a perfect balance of all things human, except for the fact that they're not muggles, of course!",
            "review_date": "2016-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A new darker step in the Harry Potter world. Offering up great entertainment for the whole family, all the way through to the end.",
            "review_date": "2016-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was good, however a few parts just seemed a little cheesy.",
            "review_date": "2016-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolute blast from start to finish, Harry Potter and the Goblet of Fire is simultaneously both grim and humorous - which perfectly represents the characters entrance into more adult territory.",
            "review_date": "2016-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked this Harry Potter because they where in a competition to win. But it was a little scary and the fighting was good! but it was a OK movie. I do not recommend children watching this",
            "review_date": "2016-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best movies of the series. I love it",
            "review_date": "2016-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While having very exciting action sequences and a few scenes that are very important to the remainder of the series, Goblet of Fire is overall an unimportant edition. The games overtake the majority of the move and add nothing to the overall story.",
            "review_date": "2016-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the best Harry Potter because there's a Goblet. An actual Goblet. The Goblet isn't a metaphor for someone's bravery or shit- there's a physical fucking Goblet.",
            "review_date": "2016-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though it has a few flaws, the darker tone does the film well and sets up the rest of the series nicely.",
            "review_date": "2016-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie and introduces Voldemort very well.",
            "review_date": "2016-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love it so so much!! (:",
            "review_date": "2016-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was a huge Harry Potter fan after the first three films, but now I'm totally obsessed with the movies. The Goblet of Fire is not only amazing as a Harry Potter movie, but as a movie in general.",
            "review_date": "2016-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Harry potter movies I love.\n There filled with drama action and romance. \nI feel always great watching all the movies from back to finish.",
            "review_date": "2016-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film was an interesting way to re-introduce the main antagonist, as well as put tension in between the main and secondary protagonists. I enjoyed the small details especially having watched one scene in the film about ten times more than the rest of the film. This film lost interest in some more intimate scenes meant to touch the heart, because harry potter films tend to have a certain distaste for heartfelt moments.",
            "review_date": "2016-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5 star isn't high enough",
            "review_date": "2016-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really liked this one with the different games it seemed to move much faster than the first 2 and the final showdown was great.",
            "review_date": "2016-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why does the user score only have a 74?",
            "review_date": "2016-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wow... Music and sounds make the movie more interesting, characters are funny without Lord Voldemort who is the uggliest of the movie! actors are playing very well their character and stunts look real! special effects are the most impressive we have ever seen! GO SEE IT!",
            "review_date": "2016-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "These movies suck, sorry",
            "review_date": "2016-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent set design doesn't really make up for disjointed storytelling. Occasionally scenes were true to the book - including the ending, with the ever-amazing Ralph Fiennes as Lord Voldemort - but for those who haver read the book: be prepared to be disappointed.",
            "review_date": "2016-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With action adventures scenes and humorous ones as well. Harry Potter not only has grown but so has it's content. Harry Potter and Goblet of Fire has a fire indeed.",
            "review_date": "2016-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unevenly paced and questionably deviant from its source at times, the Goblet of Fire still offers a fun and at times emotional fourth installment in the Harry Potter franchise.",
            "review_date": "2016-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even darker and more mature than the previous one, Goblet of Fire seems to improve on special effects while simultaneously keeping the magic that made Prisoner of Azkaban so great. The character development is likewise top notch, making for another truly magical experience.",
            "review_date": "2016-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Propably the most complex out of the series (except for the final one), this movie is a slight step down from the 3rd installment, but makes it a little more enjoyable for general audiences.",
            "review_date": "2016-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was greatly disappointed by this movie, the novel is a zillion times better and many crucial scenes from the novel were even omitted.",
            "review_date": "2015-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed watching Harry as he went through all the dangerous obstacles. I appreciated how Hufflepuffs actually had some glory.....but that's not the point. This movie was a very accurate representation of the book, unlike some of the other movies. All and all, this movie had a great mixture of adventure and suspense.",
            "review_date": "2015-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It admittedly falls for a remix of substance and storyline but Harry Potter And The Goblet Of Fire nonetheless strikes with suitably proper balance of high stakes action and few other essentials along the way.",
            "review_date": "2015-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A step down from the previous entry,but Goblet of Fire is a solid entry in the franchise.",
            "review_date": "2015-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Goblet of Fire has a plot that doesn't make much sense when you think about it and it lost the some of what made Prisoner Of Azkaban so unique, but it's still an extremely entertaining summer movie with a very interesting concept.",
            "review_date": "2015-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my least fav potter films",
            "review_date": "2015-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter and the goblet of fire can be slow at times but it has great new characters and a mind-blowing climax.",
            "review_date": "2015-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Goblet of Fire is extremely entertaining and once again very fun to watch. Much like the Prisoner of Azkaban, the Goblet of Fire is darker and more emotional, but this movie does the book the least justice and leaves so much out. At times it even feels like a bunch of random scenes put together, still the Goblet of Fire is another strong entry in the Harry Potter series!",
            "review_date": "2015-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Our fourth outing with Harry is a bit hollow with a shoe-horned first act, but a rather exciting conclusion that brings us to our first \"average\" entry in the Harry Potter franchise.",
            "review_date": "2015-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought it was just fine. It wasn't special but it wasn't terrible either. And I love a lot of the technical effects of this film, and the acting is pretty good. The only thing was that it wasn't like I imagined the book.",
            "review_date": "2015-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An action packed installment that finally introduces us to Voldemort. The acting keeps on increasing, especially with the addition of Ralph Fiennes as Voldemort. Harry faces dragons, evil mermaids, a deadly maze, and the nost evil wizard ever. The suspense and thrills are high in this film.",
            "review_date": "2015-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is amazing. Watch it IMMEDIATLY!",
            "review_date": "2015-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "me Luis how do i download it",
            "review_date": "2015-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very Good Climax It Was Very Authentic And Original",
            "review_date": "2015-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This entry into the series was always my favorite when I was younger. I was very curious today whether it would hold up against the self raised hype. It did. The Goblet Fire takes a giant step away from the formula set by the first three films. This makes it not only unpredictable but also much more exciting. It manages to carry over the darker tone set by Prisoner of Azkaban but also raises the stakes even higher. Although Harry never finds himself in easy situations, this task is definitely a frightening one. Aside from that, the way the friendship dynamic between Harry and Ron is handled in the film is great. Ron finally speaks up about how frustrating it can be being Harry Potter's best friend. It also made their friendship after the events even stronger. The way the film ends is nice as well, it is a concrete ending but leaves you wanting more. I'm excited to continue the franchise but don't know how easy it will be for the further sequels to compete against the high bar raised by this eventful fourth installment.",
            "review_date": "2015-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though often melodramatic and despite occasionally sloppy scene construction, the action in this fourth film is exciting, the climax thrilling.",
            "review_date": "2015-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They're growing up and questioning more.Right in the middle of the HP series is where you'd rank this complex but visually stunning offering.",
            "review_date": "2015-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With lots of entertainment and while it's similar to the olympics, the goblet of fire is a thriller that will have the audience cheering on.",
            "review_date": "2015-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that may drag at parts, but is still exciting. Harry competes in a life or death School TriWizard Tournament, which eventually leads to the official return of Lord Voldemort (Great performance by Raiph Feinnes) which sets up the playing field for the rest of the saga",
            "review_date": "2015-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great film and had the most to do with the storyline because if Voldemort hadn't come back the battle of Hogwarts would never have happened. 5 star film.",
            "review_date": "2015-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid movie, but with less magic",
            "review_date": "2015-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Harry Potter films have come a long way since year one, and at the fourth installment, I find myself not wanting to look away for a second. The Goblet of Fire is the most gripping, and simply the best, of the Harry Potter films so far.",
            "review_date": "2015-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The real crème de la crème to the franchise. This is what I was waiting for, finally! Proper intense fantasy action with a sincerely dark and twisted ending to show that harry potter is not for children any more. Fantastic Movie.",
            "review_date": "2015-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "for a long time was my favorite, till chapter eight arrived",
            "review_date": "2015-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well that was kind of a mess",
            "review_date": "2015-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I give 5to ALL the harry potters",
            "review_date": "2015-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rating: 68%\nIt is a confusing film, and some characters should have never been added, but Harry Potter and the Goblet of Fire will still please fans of the books and the movies with its charming leads and amazing visual effects.",
            "review_date": "2015-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was the Hunger Games before the Hunger Games, and brought the new, dark tone as well as Voldemort to Harry Potter.",
            "review_date": "2015-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As the characters and actors mature and age, so does the film itself with the series' first PG-13 rating. The Goblet of fire is the most energetic of the movies and sets up what is to come of the next four films with an epically climatic and bittersweet ending.",
            "review_date": "2015-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I gave this movie a A-",
            "review_date": "2015-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great visual effects in this movie. It just seemed like they were too focused on cool effects than the actual story line.",
            "review_date": "2015-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first PG-13 film in this franchise. It turned out successful, but it wasn't nearly better than the first two movies and some others. However, it was an enjoyable film to watch.",
            "review_date": "2015-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie so musch",
            "review_date": "2015-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the better Harry Potter movies, it is packed with action and excitement of the Quidditch World Cup, the Triwizard Tournament and of course Voldemort's return.",
            "review_date": "2015-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didyouputyournameinthegobletoffire?!?!",
            "review_date": "2015-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only reason why this movie gets at least a half a star is the epic transformation of voldemort but that's it.",
            "review_date": "2015-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome Harry Potter movie. Definitely darker than the first three.",
            "review_date": "2015-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slightly disappointing that the Quidditch World Cup wasn't shown after some build up, but doesn't fail to entertain.  Harry gets mixed up in a competition between schools, Victor Krum doesn't take his shirt off, and Rupert Grint makes a jealous face.",
            "review_date": "2015-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Of course it's a little silly why Harry MUST compete in the Tri-Wizard Tournament even though he never put his name in. Like he MUST? Really? He can't just get out of it? This poor kid! Then again, if he didn't compete then there wouldn't be a movie, and Goblet of Fire is a marvelously enjoyable addition to the franchise. It gets VERY dark at the end. Parents, be forewarned.",
            "review_date": "2015-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was alright, but not Harry Potter at it's best.",
            "review_date": "2015-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Here, we can really start to see the characters mature as you mature along with them. This installment has a much different feel that the rest of the Potter films.",
            "review_date": "2015-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily one of my favorite films of the already incredible series! It had everything you would want and it followed the book very well, it was action packed and very entertaining through out, not a dull moment in this one. Harry Potter keeps getting better and better!",
            "review_date": "2015-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Action packed, mature, dark, visual excitement eye candy make this another worthy and fantastic addition to the best series ever brought to the screen.",
            "review_date": "2015-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the earlier movies in the series were passable, this fourth installment finally takes the franchise to new heights of energy and humor. The full potential is now realized and put beautifully onto the screen.",
            "review_date": "2015-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Death is here. So is Voldemort (I said his name)\nA fresh rating of 88%\n   \"With better performances from the cast and an improved craft of the film, Goblet of Fire is the most complex yet of the Harry Potter films.\"",
            "review_date": "2015-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5 stars just because of Cedric!",
            "review_date": "2015-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Harry Potter movie!",
            "review_date": "2015-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A darker turn to the harry potter and a surprising film and is fun,exciting and a blast of a time.",
            "review_date": "2015-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best out of these movies!",
            "review_date": "2015-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good although more sluggish in some areas compared to the prior films. Then it makes up for everything in the last half! Definitely still a relevant Potter movie and one not to miss.",
            "review_date": "2015-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "These movies augment the Harry Potter experience if you've read the books.",
            "review_date": "2015-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When I was young, I was actually worried that I wasn't going to watch Harry Potter and the Goblet of Fire because it's PG-13 and I never watched a movie with that rating before. But when it came out, I surprisingly watched it anyway with my family. So anyway, now to the movie. With the director of the third movie wash't going to direct the fourth movie, and is directed by Mike Newell, I figured that it wasn't going to be as grand as the third movie. Unfortunately I was right, but like the other films, it's still amazing. The cast are maturing, and improving too with age. The special effects are getting better as usual, and the plot is actually more different than I thought was going to be which is now a competition movie with a little of mystery in it. Like Gary Oldman, one of the highlights of the movie is  Brendan Gleeson who is hilarious in this, and also Ralph Fiennes who is really intimidating and is really creepy. Steve Kloves really knows how to write serious scenes and there's also some funny moments as usual from the Harry Potter films. Only problem I had, is that there wasn't more character development on some of the characters. I didn't know much of the competitors except Cedric Diggory a bit. It does seem odd for me that I can find different flaws in each films, except for the third movie, and love it in the same way.",
            "review_date": "2015-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much more complex, lengthy, dark, violent and frightening than the previous one, but still wonderfully acted (mainly because of the growing maturity of the young actors and the filmmakers), visually engaging and thoroughly entertaining, 'Harry Potter and the Goblet of Fire' keeps on expanding the saga on a high note.",
            "review_date": "2015-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was my favorite book and is my favorite movie, the goblet of fire gives us new characters, new sort of \"games\" and Robert  Pattinson, and the other people but mainly him.",
            "review_date": "2015-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Taking a bunch of steps backward, Goblet of Fire still manages to be an entertaining ride - it's just a shame the plot's concept manages to both be the downfall of the novel and the film.",
            "review_date": "2015-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "[According to my word processor, I have reached over 30 000 words of movie reviews. Whoa.]\n\nWhile still a good story, this is my least favourite of the Harry Potter books. It (and, by extension, its film adaptation) has to bridge the gap between the middle-school feel of the first three stories, and the more adult themes of the last two books. The result is a little awkward and disjointed, but there are still some good parts.\n\nThere were some pretty major departures from the book here. This is, to a certain degree, understandable, as this book is significantly longer than its predecessors. What I take issue with is the adding in of extra scenes that could have been replaced with more plot-critical stuff. I take particular issue with the Horntail chase during the first task, and that awful mosh pit during the Yule Ball (I have never come so close to wanting to get up out of the theatre during a Potter film as I did here).\n\nAs always, we\u0092ve added some new cast members. Probably the biggest new part is Brendan Gleeson as Alastor Moody. He gives the role a certain uniqueness, although he plays it a little too comical (those are not words I would have ever expected to write). We also get Roger Lloyd-Pack as Barty Crouch Sr, who I didn\u0092t particularly care for; he had too many nervous ticks. On the other hand, his son was played by David Tennant, who I could gush about for another 30 000 words (I really like David Tennant, you guys). Pity he didn\u0092t have a bigger part. Finally, I would be remiss if I didn\u0092t mention every woman\u0092s favourite vampire, Robert Pattinson, who played Cedric Diggory. He did solidly, but was underwritten.\n\nThe tone of this film is significantly darker, signalling to us that we have left the innocence of childhood behind, and are about to enter a more adult world, filled with moral greys and ever-increasing danger.",
            "review_date": "2015-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter and the Goblet of Fire is a little bit more darker than the first three movies. It's loaded with comedy, violence, and drama. But that's what makes a great fantasy movie.",
            "review_date": "2015-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mike Newell's directing style rivals that of Alphonso Cuaron and is a worthy entry into the phenomenal Harry Potter series. Great acting, a smart adaption of a smart story, and loads of action make this one of the best movies of the year. \n9.5 out of 10 GREAT",
            "review_date": "2015-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a fantasy novel isn't that right? Is it me or the theme just gets heavier and heavier. Heavier by means, some images shows it's \"gothic\" and darker side. It is still as magical as it can get. But expect some creepy and frightening images as it goes further. To sum it up, the story is about Harry Potter unexpectedly chosen to be one of the Champions competing in the Tri - Wizard Tournament as a representative for Hogwarts. He's suspecting, someone is behind all of this. The film has some humorous, funny side. Like for instance, the yule ball dance ball scene. In short, It also shows the lighter side of the franchise. That is cool to me. The more the plot rolls on and on. It gets more interesting, and I want more. Can't wait  for the next stop. I would say definitely, this is a memorable episode of the story definitely. And as a movie goer, I enjoyed it pleasingly. 4.5/5",
            "review_date": "2015-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In this latest installment, Harry Potter (Daniel Radcliffe) must compete the Tri-Wizard Tournament.",
            "review_date": "2015-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harry Potter and the Goblet of Fire is a visually stunning movie with incredible characters!",
            "review_date": "2015-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Action packed and much, much darker, this installment introduces a whole lot of new characters and one in particular in its one-hell-of-an ending. Full review later.",
            "review_date": "2015-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I get what all this Harry Potter fuss is about. \"Goblet of Fire\" marks a critical turning point in the series, ratcheting up the stakes with the full fledged introduction of Voldemort (chillingly depicted in Palpatine style by Ralph Fiennes) and further develops it's themes of familial love, loyalty and friendship. The chronology of the characters is perfectly aligned with the subject matter, the turmoil of the teenage years in human experience perfectly captured in the story at hand. The hilarious dance sequence is flawless, insightfully depicting the strange mixture of excitement and drama accompanying dances at a younger age, but is rapidly succeeded by thrilling action, chilling turns, and solid development of characters and relationships. What's not to love about Harry, Hermione and Ron at this point? I'm finally sold on this whole Harry Potter business.\nAlso, hurrah for the special effects finally being up to snuff!\nFor the record, watching this particular episode in a post-Hunger Games society may make one acutely uncomfortable at the thought of a dangerous tri-wizard tournament, as the thematic similarities are uncanny. It didn't detract from the film, but I frequently agonized in frustration at Dumbledore allowing all this business to go on.",
            "review_date": "2015-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is pretty good, although not as good as the other ones.",
            "review_date": "2015-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie. I love this one",
            "review_date": "2015-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can definitely be seen as a very intense coming of age story.  I saw this in theaters when released so just re-watched and very much enjoyed it.  Sometimes a little slow, but there are some great moments of the underlying story coming through helping to build this multi-part saga.  \nI'm also really watching this fourth installment as a stand alone film, because I've not watched all the others or read the books, but it was still an enjoyable ride.",
            "review_date": "2015-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has become increasingly common for different instalments of a film franchise to be helmed by different directors. Even in a series as long-running as James Bond, it was quite common for directors like Guy Hamilton and John Glen to helm several consecutive stories. With the brand now seemingly more important than any form of directorial stamp, it is more usual for different hands to come in and do things their way, albeit within clearly set parameters.\n\nAll of which brings us to Harry Potter and the Goblet of Fire, the halfway point of the Harry Potter series. With Alfonso Cuarón electing not to direct a second film, and moving on to Children of Men, the job was given to Mike Newell, best known for the Oscar-nominated comedy Four Weddings and a Funeral. But whatever misgivings one may have about his back catalogue, the appointment paid off, with Goblet of Fire matching its predecessor in many respects and possibly even improving in others.\n\nNewell's versatility as a director is evident throughout Goblet of Fire, in that he is required to pull off many different kinds of scenes and handle several key emotional developments in the characters. Goblet of Fire was the point at which the Harry Potter books began to grow in size, which in turn meant that the filmmakers had to cram a lot more into the adaptations. Newell deliberately chose to \"put aside\" all elements of the novel which were not directly linked to Harry's journey, and the result is that the film remains a generally focussed effort, despite being the second-longest at 157 minutes.\n\nIn my review of the previous instalment, Harry Potter and the Prisoner of Azkaban, I commented that the film did a good job of setting up conflict between the three main characters, challenging Harry's image of a \"goody two-shoes\" and deepening the characters as a result. Newell's effort builds on this in spades, with all three characters now firmly in the throes of adolescence and Harry struggling with his reputation as the chosen one as his visions grow stronger and more terrifying.\n\nOne of the most refreshing and entertaining aspects of Goblet of Fire is seeing our three main characters go through periods of intensely hating each other. This may sound like schadenfreude, coming from a man who's always preferred Tolkien to Rowling, but conflict is essential to good drama, and the series was still playing catch-up after the emotional stodge of the first two films. Our three heroes are at a point where their identities are being called in question by forces beyond their control, whether their own hormones or the Dark Lord. Under such circumstances, in-fighting is not only expected, it should be welcomed.\n\nIt's for this reason that the ball scene is one of the best in the entire film. For all the thrilling spectacle of the Tri-Wizard Tournament, scenes like this are the emotional heart of the film. There is a degree of empathy that we share with the characters before any of the arguments occur: we remember how dorky and nervous we seemed at our high school dances. But once we see Hermione erupt at her embarassment, or Ron scowl at her in resentment, it all comes alive. By making us question these friendships so comprehensively, it makes the more malevolent moments more weighty, giving us more to fear and less on which to depend.\n\nMuch of Goblet of Fire is concerned with identity and about characters having to pretend to be something they're not. Harry spends the entire film in a state of reluctance: while he doesn't go all mopey about it, he clearly doesn't want to be involved in the Tri-Wizard Tournament. On the other side, we have Barty Crouch Jr. (played well by David Tennant), who uses polyjuice potion to impersonate a teacher and gain Harry's confidence. Both characters are under pressure to live up to their identities, with Harry even struggling to fight Voldemort in their climactic battle in the graveyard. The only real distinction between them is choice: Crouch chooses to be driven by malice, while Harry's destiny is already sealed.\n\nWhen the book was released, Rowling gave many interviews in which she cited the story's main theme as one of bigotry. She said in an interview with Entertainment Weekly that it was \"probably the thing I detest most. All forms of intolerance, the whole idea of 'that which is different from me is necessarily evil'.\" It would be fair to assume that the main vehicle for this theme would be Voldemort, whose contempt for muggles is conveyed in the graveyard. But the film also focusses on bigotry as an advanced form of favouritism, something evident in Draco Malfoy's behaviour and to a certain extent in the tournament.\n\nThis brings us on fittingly to the return of Voldemort, specifically his return to a physical body and the performance of Ralph Fiennes. Bringing Voldemort back was bound to happen sooner or later, and Newell and screenwriter Steve Kloves work hard to justify this, gradually building up the darker aspects of the plot until it becomes tragically inevitable. After this instalment the series struggled to keep Voldemort interesting, with the final conflict between him and Harry being steadily delayed for increasingly contrived reasons. But within the confines of this film, it works - at least up to a point.\n\nFiennes' performance has often been a sticking point with fans, with people being split over whether he was truly intimidating or unintentionally hilarious. It's certainly true that Fiennes walks the line between horror and comedy, and not always with confidence: while it's not exactly Victor Quartermaine from Wallace & Gromit: The Curse of the Were-Rabbit, it's a much more larger-than-life villain than Amon Goeth in Schindler's List. Ultimately Fiennes does what the film needs to do, giving Voldemort a believable presence and showing the threat he poses to Harry. It's not a complete success, but it fulfils the requirements of the role.\n\nOthers within the adult cast fare far better in delivering convincing portrayals. David Tennant may be associated with heroic roles after his tenure on Doctor Who, but his performance as Barty Crouch, Jr. has an appealingly skin-crawling quality. He manages to maintain an almost manic state without ever coming across as a ham, allowing his outbursts to become properly threatening. The late Roger Lloyd Pack is also good as his father, a bureaucrat who seems racked with guilt and nerves for what he did to his son and the peril which Harry is in. And Brendon Gleeson is perfectly cast as Mad Eye Moody, bringing his unusual physicality to the fore in the classroom scenes and giving us a lot to laugh at when he's angry.\n\nThe other big asset of Goblet of Fire is its visuals. Roger Pratt returns as cinematographer, having previously lent his talents to Harry Potter and the Chamber of Secrets. No longer shackled by Chris Columbus, he does a much better job here, continuing the work of Cuarón and Michael Seresin of bringing out the dark blues and blacks for an intimidating atmosphere. Pratt is a fantasy veteran, having worked with Terry Gilliam on Brazil, The Fisher King and 12 Monkeys; he knows a thing or two about creating a sense of magic or horror, making the maze scenes feel like they've escaped from The Shining.\n\nThere are a couple of faults with Goblet of Fire which prevent it from completely surpassing its predecessor. Despite Newell's best efforts and intentions to keep the action focussed on Harry, the plot still feels occasionally meandering, as if more effort were being expended on something than was necessary. Whole sections of the book have been left out, and others changed so that different characters could get screen time, and it may be that elements of the books simply don't work on film. But it's still a baggy offering, even if it's an enjoyable one.\n\nThe other flaw, as with many of the Potter films, is predictability. I complained in my Prisoner of Azkaban review about the Defence Against the Dark Arts convention, which has gone from being a mild irritation to an example of lazy writing. Equally Harry's inclusion in the wizard tournament may turn out to be narratively integral, but the circumstances in which he becomes involved are an enormous contrivance. It feels like the plot is making every effort to keep Harry at the centre of the action even when it doesn't make sense, to the point of setting up rules only to break them. The smart, or at least different thing to do, would be to have him completely marginalised, letting Voldemort approach him more directly rather than luring him in through coincidences. \n\nHarry Potter and the Goblet of Fire is a confident addition to the franchise which builds on the successes of its predecessor to create an emotionally satisfying experience. It still suffers from the ongoing flaws of bagginess and predictability, facets which would become more problematic during David Yates' tenure. But if you can look beyond that, you are looking at a film which rivals Prisoner of Azkaban as the high point to which the other films aspire.",
            "review_date": "2015-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite Harry Potter movie!",
            "review_date": "2015-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Arguably the film that strayed farthest from its book, The Goblet Of Fire repeatedly frustrates the audience by creating buildup for potential action sequences and then never actually shows them (the Quidditch World Cup, the battles with the dragons, etc). It also gets to a certain point where it seems as if major plot elements are shamelessly made up as it goes along, which as a result hinders the willing suspension of disbelief.",
            "review_date": "2014-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fourth entry of the series is one adventurous ride loaded with awesome special effects. However, obvious change of spectacle is inevitable as yet another switch of director had warranted a tonal shift -  a reversion of Cuaron's darker vision to Mike Newell's much lighter shades. As the pace is moderately kept in check, the whole 'video-game'-like environment involving the protagonist surviving through obstacle courses had added much higher entertainment value with plenty of spaces for stylized special effects here and there. Nevertheless, such thematic material had indeed made the film more action-oriented than its predecessors.",
            "review_date": "2014-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of four in my book that deserves a five star rating. Goblet of Fire is truly amazing. Tri-Wizard Tournament action is just freaking awesome and insane. Third favorite movie of them all!",
            "review_date": "2014-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most original Harry Potter movie that continues expanding this magical and creepy world, bringing to us a masterpiece like we never see before.",
            "review_date": "2014-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most original Harry Potter movie that continues expanding this magical and creepy world, bringing to us a masterpiece like we never see before.",
            "review_date": "2014-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie could have been better.",
            "review_date": "2014-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though slightly disappointing at first,the visual experience and emotions through out the movie makes the poor adaptation of the book forgiven.",
            "review_date": "2014-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing much I can say. The Harry Potter movies are always good so I can't keep giving the same reviews.",
            "review_date": "2014-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Goblet of Fire can entertain you with grander special effects and more soul to your favourite characters. But, the main story feels like it doesnt progress enough to make this entry a necessity.",
            "review_date": "2014-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps outside the finale, this film is one of my favorite in the Harry Potter franchise.  It is the most mature and most entertaining of the installments up to that time.  The effects are as inventive as ever and the themes get darker and more mature.  I am definitely a fan of the franchise and still impressed as to how well the films turned out.",
            "review_date": "2014-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A new and interesting tone for the franchise.",
            "review_date": "2014-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not my favourite movie from the harry potter films but still good in its own right",
            "review_date": "2014-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely an even darker Potter film with some really heavy themes and the payoff at the end that we've been waiting for.  Also, if there's one thing we've all learned from this series it's that Hogwarts goes through Defense against the Dark Arts teachers like a sanitary person goes through underwear.",
            "review_date": "2014-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie it's ama-zing",
            "review_date": "2014-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "little boy wearing glasses waving wands at fire laden giblets ... hmmm",
            "review_date": "2014-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it is the first installment in the HP series to be a step down from its predecessor and though it may have more book changes than the rest, Goblet of Fire has amazing storytelling and special effects that make it a strong installment.",
            "review_date": "2014-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The second weakest HP movie for me. There weren't many things wrong in terms of the adaptation just not a good story for me. Great performances from all the cast in particular Brendan Gleeson, Ralph Fiennes and David Tennant. There are some good scenes but looking back it's not as good as I remember nearly a decade ago.",
            "review_date": "2014-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the darkest and greatest entry into the Harry Potter series yet. Bringing amazing action sequences, a lovely ball and the highly anticipated return of lord voldemort.",
            "review_date": "2014-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Robert Pattinson may be most famous as Edward Cullen in the Twilight films, but his performance here as Cedric Diggory marked his film debut, and he's not too bad here. Brendan Gleeson as Mad-Eye Moody and Miranda Richardson as Rita Skeeter are also standouts. The three tasks of the Triwizard Tournament are breathtaking to watch, and Ralph Fiennes' debut as Voldemort is so good, I now cannot imagine what it would have been like if another actor was in the role. 10/10.",
            "review_date": "2014-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is that movie that seems as if it is detatched from the rest of the franchise, like alien resurrection. other than the reveal of voldemort (finally) we don't really see much going on here",
            "review_date": "2014-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Goblet of Fire is a welcome take on the series as a Summer blockbuster filled with great fun, action, and visuals.",
            "review_date": "2014-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great installation to the franchise, though not as strong at the previous film, a lot of content is condensed which it hurts the story a little. It's a little ridiculous that they'd put these teenagers in imminent dangers for the glory of winning a  cup... Thank god Ron and Harry get a hair cut after this one.",
            "review_date": "2014-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favourite harry potter film great actors great plot boss affects",
            "review_date": "2014-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though slightly disappointing at first,the visual experience and emotions through out the movie makes the poor adaptation of the book forgiven.",
            "review_date": "2014-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good even though it has shovel face but voldemort finally appears",
            "review_date": "2014-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A more exciting, if not also melodramatic, entry that throws many more environments and creatures at the viewer while taking the darkest turn in the series so far.",
            "review_date": "2014-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exciting and mysterious.",
            "review_date": "2014-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "89%\n\"Goblet\"'s length may seem troublesome, but it is all made up for with its dark tone, brilliant characters, and powerful ending.\n\nV: 72%",
            "review_date": "2014-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I recommend this to kids 10+",
            "review_date": "2014-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A marvelous faithful adaptation to the book in every possible way, even though half of the important elements in the story are obsolete, for time and budgetary reasons. One gripe I have with it is the fact that our main characters look like they didn't even care about what happened after the climax. It's like, \"Oh, we're sad.\" Then, \"Oh, We are excited about next year!\" Huh!? Thankfully, it was only one, but it didn't hurt the rest of the movie.",
            "review_date": "2014-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie so much! David Tennant's role as Barty Crouch JR. was wonderful as well! Over all I loved this movie",
            "review_date": "2014-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "pretty good  best one so far",
            "review_date": "2014-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never dull, a perfect mix of humor and cruelty. Enchanting!",
            "review_date": "2014-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film is so rushed and incoherent in its first 15 minutes it deserves a removal of a whole star for that. The rest of the film is spectacular.",
            "review_date": "2014-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Butchers the plot and character development of the books for cheesy high school cliches and lengthy, pointless special effects sequences.",
            "review_date": "2014-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i like this one I choked up more than I should have but it had the most Weasley twins",
            "review_date": "2014-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The mpaa rating went up. It gets much darker here. But its still AWESOME!!!",
            "review_date": "2014-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good, but the book is better.",
            "review_date": "2014-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Made NO sense What the Hell What this? Looks like the director Sh*t This out And call it Goblet of fire. There are only 2-4 Things Similiar to the Book.",
            "review_date": "2014-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst movie, and it's from one of the better books. It's still not bad though",
            "review_date": "2014-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's been great to watch these young children become young adults. Again new direction which makes it different in the best possible way. The effects have improved evidently in the movies climax. The most action packed of them all Harry Potter and the Goblet of Fire has a good balance of emotion, action and great character moments.",
            "review_date": "2014-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story is more complex and so are the character. Though one of the weaker out of the franchise, this movie does a very good job of growing the characters. The only problem I had was some of the acting and this brought down the score a lot. Daniel was pretty great in the other films, but he seemed to slack off in this one. Also what the hell was up with the long hair in this movie. Did they all decide to grow it out because everyone had long hair here. I so have give this movie credit. This is the first time where hermione is actually old enough to be hot. \n\nThe Tri wizard Tournament  is where this movie shines. Each challenge was more frightening than the next and the emotional content of the film was very good. Overall this wasn't harry potter standard, but not the worst so far. 8/10",
            "review_date": "2014-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's clear that the film is darker and the fourth installment is the first out of the franchise to take on a PG-13 rating. It's a pretty fun movie with tons of action and comedy. This is a fun movie with great visual effects.",
            "review_date": "2014-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's great to see these characters grow up from this point. Like just about every Harry Potter movie, Goblet of Fire is a well crafted film that has thrills, great effects, an imaginative atmosphere and great performances.",
            "review_date": "2014-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fourth entry in the Harry Potter franchise took a turn to a competition that is a fight to the death (Hunger Games if you will). Dragons, merpeople, and a maze that climaxes in the grip of Lord Voldemort, this movie had me in for a new take on the Potter saga. Loved seeing Ralph Fiennes dub the role of Voldemort at the climax (his only scene) and the different twists and turns along the way with action, a bit of romance and thrills throughout. Another great film for all Potter fans!!!",
            "review_date": "2014-07-16",
            "source": "rt",
            "lang": "en"
        }
    ]
}