{
    "rating": 1.9,
    "release_date": "2005-10-14",
    "num_reviews": 230,
    "genres": [
        "Horror",
        "Mystery&thriller"
    ],
    "summary": "The prosperous town of Antonio Bay, Ore., is born in blood, as the town's founders get their money by murdering a colony of lepers. But the truth of what they did is concealed from subsequent generations. More than 100 years later, Elizabeth Williams (Maggie Grace), whose family lives in Antonio Bay, returns just as a statue in tribute to the founders is to be unveiled. When a mysterious fog rolls in, Elizabeth and her boyfriend (Tom Welling) soon discover it has vengeful supernatural powers.",
    "reviews": [
        {
            "content": "I don't think that the filmmakers ever saw the original and made the film based on what they thought the original was about.",
            "review_date": "2023-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Actually quite good!!! Give it a chance folks...",
            "review_date": "2023-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Personally this is a very good flick in a campy sort of way.  I have always been a fan of these types of movies.",
            "review_date": "2022-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With Tom Welling, Maggie Grace and Selma Blair iand with it being a remake of a John Carpenter flick you'd think it'd be good.  Yet somehow these things do not add up to a good film. The script feels a bit confused, like maybe there were too many cooks in the kitchen sort of thing.  The direction gives you exactly what you expect without ever really pulling you in. It's serviceable as a film but lacking on anything resembling horror.",
            "review_date": "2022-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was better than one star.  Maybe, I liked more because I expected it to suck.  It did not.",
            "review_date": "2021-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a remake for john carpenters fog isn't a bad idea, I can see it being remade, the 2005 version of the fog is nothing but the standard horror clichés we have seen before with the stupid teenage characters and effortless jump scares",
            "review_date": "2021-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This remake version is definitely cursed.",
            "review_date": "2021-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another movie that really does not make any sense.",
            "review_date": "2021-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fog and special effects were a nice addition. This uninspired remake has a bigger focus on the backstory of how the town of Antonio Bay was founded, but none of what made The Fog (1980) great. It's unfortunately another boring example of why you don't need to remake a film that is already good or has achieved a cult-like fandom. \n\nThere was a clear opportunity at the end of the original to continue the story, but sadly Wainwright was tasked with directing a regurgitated and embellished version of the original. I wanted to like it because Carpenter produced while Debra Hill updated the story, but why was it made at all?\n\nMaggie Grace is a poor substitute for Jamie Lee Curtis as Elizabeth.",
            "review_date": "2021-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely amazing that this was released. I've never been angry with a movie until this came out.  Like the wb put out a horror movie that was utter crap.",
            "review_date": "2021-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Got this by mistake thinking it was the 1980 version.  What a disappointment!",
            "review_date": "2021-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I remember seeing this quite a few years ago and thinking it was utterly awful.  It's not like the original was some masterpiece of cinema but it did eventually get officially ‘creepy' before all was said and done.  This fell victim to over complicating something as simple as lethal fog, which is probably why the original works so well - it didn't over complicate it.  Also, there's just something better about horror when it's happening to dirty looking old people with bad haircuts and shitty cars.  Oh, they gave us pointless flashbacks instead.  This is just The Fog in name only.  At least watch the original before this, so you can see the difference for yourself.",
            "review_date": "2021-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A terrible remake of the 1980 movie. I really can't think of anything good to say about this mess.",
            "review_date": "2021-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original movie terrified me as a child, so when this movie was released I immediately went to the theater to hopefully relieve those chills and thrills and share that on a date with my then girlfriend, now wife... So... half an hour into this abomination of direction and acting, I get up, tell her let's go.... head to the box office and demand our money back or vouchers for another film. To this date (now 2021) I've only watched those first 30mins... I REALLY hated it that much that even 16 years later I'm writing a blurb about this atrocious remake from only 30 mins of actually watching it. \n\n* P.S. yes the theater did issue us a refund. So I can die happy knowing that my money never made it to the studio that released this trash.",
            "review_date": "2021-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would like to cast everyone who was involved with this film out to sea.\nLeave great 80's films alone!",
            "review_date": "2021-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Poor overall, I do like the idea though.\n\n'The Fog' has been absolutely obliterated on Letterboxd, 1.6 average rating is major yikes. I, honestly, don't think it's quite that awful but I fully understand the dislike this has. For me, it wastes a good concept.\n\nI actually don't mind the special effects, sure they aren't anything amazing but I never really felt let down by them; the only times it bothered me, in truth, was when there's a huge bundle of fog. For the \"natives\", though, I thought they looked fairly neat.\n\nThe film definitely goes on for too long, while the ending is terrible. Acting wise I think it's OK. Tom Welling (Nick) and Maggie Grace (Elizabeth) are passable, the rest of the cast give pretty lame performances granted.\n\nBad, but not *that* bad in my opinion. Remakes always tend to make people more annoyed, especially when they've seen the original. I haven't, so I guess that plays a part.",
            "review_date": "2020-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "without a doubt it is one of the worst films in history. Everything about him is rough.",
            "review_date": "2020-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun for Halloween 🎃 nonsense :)",
            "review_date": "2020-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The rare remake title that could have used modern story telling and effects to surpass the original and give us a quality movie..... Instead we got this.",
            "review_date": "2020-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Remake of a good film that as usual failed because the film in question did not need a remake as nobody felt the need. In general the plot is nice but not fully successful and can not scare in any way",
            "review_date": "2020-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The actors do their best but it is missing the cleverness and tension of the original. Effective sometimes.",
            "review_date": "2020-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Um, this was a very awful experience. It might just be the worst horror film I've ever seen. Just watch the original.",
            "review_date": "2020-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It blows even with Superman in it? 'The Fog' is simply not very interesting or entertaining.",
            "review_date": "2020-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible remake.  Watch the original instead.",
            "review_date": "2020-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not scarey at all doesn’t hold your attention ",
            "review_date": "2020-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was pretty scary but the story of it kinda lacks and the ending really sucks",
            "review_date": "2020-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Discussing waste of time",
            "review_date": "2019-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible cash-grab remake.",
            "review_date": "2019-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh man this was so bad. Like this was so bad. Part of me is afraid to go back and check out the original now, but the rest of me feels safe in the knowledge that it couldn't possibly be worse... I mean it couldn't, right? ...Right?",
            "review_date": "2019-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "im watchen on the horror channel in the uk",
            "review_date": "2018-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has grown on me over time.  Probably seen it over 5 times now.  Its not scary at all and only has a very basic premise.  The characters are relatable, even thouh they have some early 2000's cliches.  Doubt anyone else would like it, but I'll give it 3* for how the story unfolds plus the beautiful small town setting.",
            "review_date": "2018-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A remake of John Carpenter's underwhelming 1980 horror thriller that is about 1000x more original than the predecessor. When you have talent such as Tom Welling and Selma Blair, you're not gonna wanna miss it. Simple as that.",
            "review_date": "2018-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whoever wrote this movie must have been in a fog of their own. The dialogue is bad and made worse by the acting of beautiful people who spit it out as if being asked to phone everything in. The only reason I finished watching was to figure out the \"dark secret\" of the island, which I would have been better off just guessing.",
            "review_date": "2018-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why do a remake of the John Carpenter movie, which itself wasn't really a masterpiece, is beyond me. Since this one is hardly a mediocre effort I'm listing it under the things one needn't see.",
            "review_date": "2018-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From the 2000s you can forget about any remake, and look at the original !!! They had less money, computer effects, time ... and made movies that you can never forget - !!! Now they have everything and make films to forget. All the people of Hollywood - what's up with you? You can not even do finished work the same or better than the original one, what do you learn at the film school? The more you have, the less comes out, NO REMAKE is good for the last 20 years in all genres, shame on you all who call themselves filmmakers and their people.",
            "review_date": "2018-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fog is the most boring movie I have ever seen, nothing about it is interesting, the story is boring, the characters are thinner than paper, and the visual effects are terrible. The Fog is not on ls not only one of the worst horror movies, it is one of the worst movies in general.",
            "review_date": "2017-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This pointless remake gets worse the longer it goes on. Flat characters, too much dull back story and a yawnworthy over the top last 20 minutes. Stick with the atmospheric original.",
            "review_date": "2017-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good plot and entertaining until the ending. They left it too much up to the viewer to fill in a plot hole.",
            "review_date": "2017-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's terrible, don't watch it, don't let that even be a nudge to watch it \"just to see how horrible it is\". Do not watch!",
            "review_date": "2017-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I personally enjoyed this remake very much. Honestly it's almost a mirror copy of the original other than the cultural references and a few scenes. So I fail to see the reason for a huge gap in the reviews. However I would consider it more suspense than horror/slasher.",
            "review_date": "2017-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a good movie to watch",
            "review_date": "2017-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In nature it's much more interesting.",
            "review_date": "2016-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So bad. Worse than bad. Bad writing, bad cinematography, bad acting. Bad plot. Everything happens with very little motivation. The cliches are endless and dull. It's not even interesting enough to keep me watching the whole time. I found myself on my phone or staring at my knitting the vast majority of the time.",
            "review_date": "2016-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Paltry and glossy remake of a classic.",
            "review_date": "2016-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ok, nothing too interesting",
            "review_date": "2016-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just a rehash to the original Fog.",
            "review_date": "2016-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the best of remakes and definitely not as good as the original. The cast was good but it wasn't very scary either. I think this film had potential, but didn't deliver.",
            "review_date": "2016-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well the acting was pretty rough, the effects kinda cheesy, the scares in slight supply, at least the plot was great. Oh wait it sucked! Gimme John Carpenter, Hal Holbrook, JLC, and Tom Atkins any day.",
            "review_date": "2016-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Typical loud noise remake lacking many scares.",
            "review_date": "2015-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An insoliting remake to carpenter's classic.The film's lack of scares, suspense or originality make things even worse.",
            "review_date": "2015-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i actually enjoyed most of the film. I love spooky ghost stories and unraveling a bit of mystery. that said the cgi was offputting and a lot of the supernatural elements were over the top from the beginning. the part i totally cannot forgive however was the ending. in a despatate effort to throw in a twist the movie falls flat and leaves you with a bad taste in your mouth.",
            "review_date": "2015-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even as bad remakes of 70's iconic horror movies go,this is really bad.",
            "review_date": "2015-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "http://letterboxd.com/zbender/film/the-fog-2005/\n\n\n\n\"Did it come back for revenge? Or justice?\"\n\nQuite frankly I don't even think this film knew that question. The muddled back story behind the film was just one of a multitude of problems to this film. Now I can't compare this to the original since I haven't seen that, but you could still distinguish this from being an abomination when compared to most horror flicks.\n\nThis film already had lost points with me being that it's a horror remake. I despise remakes. This was no different. This was not scary and the story isn't suspenseful. Hell, I'm watching an episode of the kid's series Goosebumps and I'm sh**tting my pants compared to this. \n\nAlso the characters are annoying. I've noticed of late that I'm drawn to stories that have interesting characters rather than a compelling story. Everyone though is a walking stereotype with nothing in their brain. They make stupid decisions, some are sexualized, and I don't care for any of them. it also didn't help that the acting was bad for a horror film (I don't know how much that says about the horror film).\n\nThis movie just seemed like another lazy remake of a better (supposedly) horror film trying to grab your wallet. From the CGI to the story and everything in between \"The Fog\" is pretty lackluster.",
            "review_date": "2015-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fog remake disgraces the original cult classic with zero fright value, horrible acting, and no creativity in script or visuals.",
            "review_date": "2015-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ugh. Positively AWFUL. I want my money back please.",
            "review_date": "2015-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inferior to the original in every way except effects. The story was updated and slightly changed which also may have made a benefit, but not enough to surpass the original.",
            "review_date": "2015-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay.....wow this movie was bad.  I only saw it because I'm a fan of Smallville and Tom Welling is in it.  The plot was weak when they made the original back in the 70's, and it didn't improve with time.  Welling shot this simultaneously as he shot episodes of Smallville, and this is made very apparent by how he phones in his performance.  If you're looking for a cheesy, classic horror movie to mindlessly watch, it's worth a watch I suppose, but there are infinitely better horror flicks to watch",
            "review_date": "2015-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A billion time better than original. The original bored me but this was fun and entertaining all the way through. As usual internet trash hates on it. Always hates on good movies but praises sucky films.",
            "review_date": "2015-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Arguably, the WORST remake ever made.",
            "review_date": "2015-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They should have given Selma Blair a much bigger role. It seems that this is a remake of a movie made some 30 years ago. A bit slow at times and sometimes strayed from the core story. It had potential, but fell into mediocrity.",
            "review_date": "2015-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yikes! \"The Fog\" is not only an unnecessary remake, but it's one of the top 5 worst. Zero scares, bland acting, and god-awful CGI don't make a good ghost story. Avoid this one any which way you can.",
            "review_date": "2015-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched this re-make when it first came out and decided to re-watch it again.  I really liked this even though the reviews are not that great.  Very interesting concept and had me jump a couple of times.  I will have to watch the original to compare this to.",
            "review_date": "2015-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I want to see it by only shows the trailer. it said I could watch free movies but when I got in to it it's now telling me I have to pay. can you say false advertising. very disappointed",
            "review_date": "2014-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A horrible and horrendous remake of The Fog from the '80s, thr movie is tremendously boring and drawn out and I believe the back story has modified. The new one is about taking revenge out on the generations later children of the folks in the back story.",
            "review_date": "2014-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of those few moments I had to fight to stay awake during a \"horror\" movie. Nothing scary, thrilling, or even interesting. Effects look like this was done in the 1980s instead of in the 2000s. I went in wanting scares, I left with a nap.",
            "review_date": "2014-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is awful. Just about every effect is the worst (There is an overabundance of CGI fog which looks terrible, and general CGI spookiness including ghosts and footprints, there is one impressive burning man practical effect which was appreciated), and they make the lead cast all young, attractive people. The film adds one of the worst cinematic twists in history that not only doesn't make any sense, it also spits on the film it is remaking. All that said, I do like that they actually show the full events that inspired such rage from the ghosts, and that the film can be brutal at odd moments. Unfortunately, this is just a lazy, typical, generic remake...one of the absolute worst and the best example of why remakes normally just suck. Skip it skip it skip it!",
            "review_date": "2014-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fog didn't really need to be remade and it sure didn't need a remake like this.",
            "review_date": "2014-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A \"light\" creepy thriller which makes no senseâ?¦ bad plot, bad actingâ?¦ riddle with inconsistencies and improbable reactions to events. In spite of it all, it kept me interested in the outcome. Good for a wasted evening.",
            "review_date": "2014-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In this modern retelling of the original eighties horror film, townsfolk are terrorised by a mysterious force in the fog which surrounds an entire island and begins picking people off one by one. Now I never saw the original so I have nothing to compare it to - but it's half-way entertaining. There's nothing surprising in the film and there's very few actual scares throughout it; it's mostly a story of scorned lepers coming back for revenge against the descendents of those who wronged them, albeit in ghostly form. While some of the sequences involving the fog were interesting for the time, the characters are wooden and give you very little reason to root for them - which in the end makes the film less effective than it should be.",
            "review_date": "2014-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overly stylized camera work makes watching this film confusing, so watching it even for cheese value can be annoying. Plus the ending freakin sucks.",
            "review_date": "2014-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was just bad, terrible CGI and god awful acting mixed in with a bad script, the only good thing about this movie is it reminded me of The Mist, don't watch this movie it's  terrible!",
            "review_date": "2014-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A terrible remake of  a not so great movie to begin with.",
            "review_date": "2014-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an abysmal God Damn tragedy of a Remake, that someone should be absolutely bitch slapped for making. STOP RUINING GOOD MEMORIES HOLLYWOOD!!!",
            "review_date": "2014-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It doesn't seem to get anywhere, as there's too much origin story involved while trying to follow the original Carpenter film, but ultimately it forget the mood. Wasted CGI and and lackluster of an ending, the film doesn't get thrilling or scary. A forgettable, unnecessary remake.",
            "review_date": "2014-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It really wasn't all that bad just not scary",
            "review_date": "2014-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original was scarier then this, and the original was not scary.",
            "review_date": "2014-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was so bad that I thought it was a Scfy movie when it came out.",
            "review_date": "2014-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this way a Scfy movie when it came out. That's how bad I thought it was.",
            "review_date": "2014-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "don't waste your time watching this junk of a movie",
            "review_date": "2014-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The direction is not just car-crash: it's a multiple pile-up with a 10-mile tailback. The CGI is more ghastly than ghostly. The acting is lifted from the Joey Tribianni handbook. Stick to the original.",
            "review_date": "2014-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst kind of horror film: no scares, no gore, no camp value. Just boredom and bland acting. And a lame PG-13 rating.",
            "review_date": "2014-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I remember watching John Carpenter's The Fog when I was in high school, watching almost every horror movie I could. From what I remember, it wasn't too bad. Certainly not one of Carpenter's best, but definitely not his worst. With that being said, did we really need a remake to a film that was already classified as some-what mediocre? I finally caught this film to see what all the fuss was about. This does more than not doing justice to Carpenter's original. It flat out insults it. I hate how most modern day horror remakes try to go deeper into the story of a film that had such a basic premise. This film tries way too hard to be edgier than the original (kind of hard to do since it's PG-13) by exploring the history of the ghostly murderers. What results is a terrible story with barely anything interesting to redeem it. The pacing in this film is awful. Most of the film is incredibly slow and by the time some action finally does happen, there's only about 10-15 minutes left in the movie. The actors ranged from average to annoying. I absolutely couldn't stand one character, Spooner, because he was trying so hard to be \"hip\" and \"cool\" for the younger audience. The effects for this film were also pretty bad. It may seem like I'm a bit disjointed in this review, but that's because there's so much wrong with this film that it's hard for me to transition between everything. This film is all around stupid and completely pointless. The ending to this has to be one of the worst I've ever seen in horror movie history. Please, for the love of god, avoid this film like the plague. It had an interesting first 2 minutes, but everything afterwards was just bad, stupid, and a pitiful excuse for a horror movie.",
            "review_date": "2013-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A horribly inept, boring remake.",
            "review_date": "2013-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While I'm no fan of the original Fog, this movie is just terrible. They tried to flesh out the backstory a bit, but I feel they went down the midi-chlorians road too much. It feels too full of dialogue and bad acting, that it forgot to bring any sense of tension. Watch the original instead, this is just a mess.",
            "review_date": "2013-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fog remake of 2005 might be the worst horror remake out there and that is saying a great deal.  There are dozens of bad horror remakes out there like the remake of Halloween, Texas Chainsaw Massacre, Prom Night, Psycho, etc., but at least they had some degree of effort put into them.  Those remakes, as bad as they are, at least tried to do something different and to be entertaining, but this film has almost nothing going for it.  The Fog is a classic horror film, as well as one of my favorite horror movies of all time, and I am saddened that they treated it so poorly with the remake.  This movie has almost no good actors, no good performances, no scares, no suspense, no atmosphere, and no entertainment value.\nThe story is pretty much the same as the original.  100 years ago a group of leopards came to the town of Antonio Bay, California to set up a colony.  However, the townspeople tricked them into crashing their ship and drowning.  Now these leopards have returned to get their revenge aided by a supernatural fog.\nWhere do I begin describing what is wrong with this film.  The film has no good characters and hardly any good casting save two.  Tom Welling and Maggie Grace are in this film.  I am a fan of Tom Welling through Smallville and Maggie Grace through Lost and, honestly, they're the only saving grace, but neither of them is given anything to do and the script does not let them show off their acting talent at all.  All the other characters are basic horror film stereotypes like the token comic-relief black guy.  Most of these characters are just here to be used as cannon fodder.  The original film had interesting characters with great actors playing them, while this has nothing.\nThe worst thing about this film is that it is ungodly boring.  The original film had a great atmosphere, but there is no atmosphere to speak of here.  It is not even remotely scary.  I kept waiting for a scary moment but it never came even at the end.  The score was nothing, while the score in the original is very memorable.  The ghosts are not remotely scary, mainly because they are all bad CGI.  The CG in this film is some of the worst I have seen.  Even the fog is CGI.  In the original the ghosts were all silhouettes and done all practically.  Everything was done with practical effects, while here everything is horrible CGI.\nThe messed up the story really bad as well.  First of all we are told that the leopards were killed in 1880, but in the present time we are celebrating the 100th anniversary of Antonio Bay even though the film clearly takes place in 2005.  So the makers of the film cannot even tell time right.  The ghost's motivations are really weird as well.  We assume they came back for revenge like in the original, but it does not seem like it.  At the end of the film the head ghost (spoiler) turns Maggie Grace into a ghost then they all leave (spoiler end).  So the ghosts did not even get their revenge.  The ending makes absolutely no sense.\nOverall, this film is complete garbage and a spit in the face to the original.  Skip it at all costs and just watch the original.  I would recommend any horror remake over this honestly.",
            "review_date": "2013-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the acting was pretty bad, the atmosphere was set pretty well, the storyline sounded good but it was visually pretty bad.. killer fog was kinda lame... the movie was boring the last 30 minutes I really didn't care what happened to the actors.. at times I just wished an atomic bomb would go off so the movie would just end... it got old pretty quick.",
            "review_date": "2013-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not nearly as good as the original. But creepy and well casted.",
            "review_date": "2013-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie but a lot different from the one in1979.",
            "review_date": "2013-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "tonal shifts continuity errors and an ending that is just weird.",
            "review_date": "2013-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though it isn't perfect, this little film actually manages to capture the chilling atmosphere of the original. Even though it's made for teens it still is a chilling tale that is worth being retold.",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This would have been 4 of 5 stars if it had been made in the 1960's -- times have moved on and so should this film crew.",
            "review_date": "2013-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Completely unnecessary.",
            "review_date": "2013-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A terrible movie and a terrible remake! What a wasted opportunity!",
            "review_date": "2013-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inferior to the original in every way except effects. The story was updated and slightly changed which also may have made it benefit, but not enough to surpass the original.",
            "review_date": "2013-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this movie when I was working in Columbus Ohio with my brother Jack. It was an ok movie.",
            "review_date": "2013-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie, you should see it!!!!!!!!",
            "review_date": "2013-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not scary but a few jumps here and there. It's watchable, but I say Stephen King's 'The Mist' is a lot better.",
            "review_date": "2013-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring, sleep inducing, foggy plot.",
            "review_date": "2013-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie seemed ripe for remaking; John Carpenter's 1980 version had the style and mood down but the plot was a little thin and the characters could have been develop better. This movie made the same mistakes again, only this time the shortcomings were even worse. The revamped cast featured more eye candy but it comes with horrible acting. Not only is the cast bad but also the writing is even worse than the original. There is no attempt to add depth to these characters; many of them are intentionally annoying. The original made you care a little bit about all of the characters, where as this movie wrongfully intends the audience to cheer the murderous fog on. Perhaps the biggest disappointment is how the new high budget special effects are wasted. John Carpenter understood how to use lights, music, and camera work to set an ominous mood and built suspense very well in the original, it was actually the strong point of the movie. Rupert Wainwright has more tools at his disposal but fails time after time to generate suspense, which can build into a stronger form of scare. This was a disaster; it misses the mark in every way. I hoped that this could right some of the problems with the story, but it only made everything worse. Steer clear of this and just watch the original instead.",
            "review_date": "2013-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A small seaside town has a thick fog roll in a century after a ship mysteriously sunk. This remake is bad and when I mean bad I mean really bad, just bad acting and horrible visual effect's.",
            "review_date": "2013-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film tries to update the less than steller film from1980. It only succeeded in creating a less than steller sequel in 2005.\nThe film has little to no nudity, gore, or scares. The plot is terribly told and the one thing that should have been improved from the original. \nThere's a psychic... kinda and plenty of flashbacks to attempt to \"tell\" the story rather than just having people figure it out. In fact, nobody really figures anything out in this movie and even the viewer is left kinda half knowing what's going on.\nThe film was doomed to be campy from the start but failed to capitalize on any camp which would have at least made the film humourous at times. \nAs it is, you just sit back, and watch. Mindless horror that's not even told well enough to satiate the brain pan.",
            "review_date": "2013-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can read my review here - http://geektasticfilmreviews.blogspot.com/2012/10/the-fog-2005.html",
            "review_date": "2013-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A supernatural chiller that benefits from likeable leads Tom Welling and Maggie Grace, with a solid Selma Blair and cute Cole Heppell in supporting roles as a single mother and young son. \n\nIt's beautifully photographed (with wonderful use of silhouettes), the special effects are excellently done and the scares are top-notch, but this remake of John Carpenter's 1980 thriller suffers from all the padding that goes on in-between; the plot isn't anything special, the dialogue lacks much interest and the two-dimensional characters aren't given much to do except scream and run.",
            "review_date": "2013-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely slow and boring, though not the worst thing I've ever seen.",
            "review_date": "2013-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "NO NO NO....If the ghosts were killing people that descended from the towns people that screwed them over why did they kill the girls at the beginning and not kill the old lady.",
            "review_date": "2013-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the worst sequel ever.",
            "review_date": "2013-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Think about it, fog that kills people. Dumb.",
            "review_date": "2013-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really bad acting and bad plot...",
            "review_date": "2013-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "way better the the old one",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved the thriller, shocked at the ending.",
            "review_date": "2013-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first movie blew, so it makes sense to remake it... Too bad this is WORSE! And I LIKE Tom Welling and Maggie Grace!",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my review of The Fog (2005). I won't be telling the story much because I will be making a lot of comparisons instead of actually telling a proper review. While the original The Fog (1980) was creatively edgy, darkly spooky, the music was scary as shit and one of John Carpenter's most classical pieces of work amongst Halloween, The Thing (1982) and Escape From New York even though John said himself this was his least favourite work because he had to do so many cuts and re-shoots of the film; even though, it was still a great ghost story and one of the best. Now we get this horribly stupid, lousily written, lazily directed annoying soundtrack and dumb dumb dumb dumb dumb dumb wasted talent of actors and actresses. Not many people liked nor even watched the original movie and even though they did, they weren't a big fan of it and turned the film into a cult classic. This film however, deserves all the hatred it needs and for my god, I don't think the director has even seen the original. He just skimmed past certain scenes and thought he can recreate it without any sense of talent. Furthermore, whilst the original was a R rated professional horror movie, this basterd director was trying to aim for a teen horror film- FUCK YOU...Whoever you are! Even the poster looks fucking retarded! It just looks like a ghost version of Ghostface: You see, you keep making me bitch about how bad this movie is over and over again. How could you make a remake of a scary ghost movie so scarily unscary? And the ending was just awfully lame to finish off. I want to punch this director in the face for creating such trash. Selma Blair from the two Hellboy movies is wasted in this movies and Maggie Grace who has been in a lot of shitty movies over the years can add this to her damn list even though she was the only good thing about this movie and her shower scene. This remake is so bad that even Michael Bay's Platinum Dunes horror remakes that he produces with his company are better than this horrendousness. The Fog (2005) gets a I-don't-give-a-fuck/10. It's been ages since I gave that rating. What a disgrace this movie was!",
            "review_date": "2013-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than the Original one.",
            "review_date": "2013-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film started off well and was quite disturbing. The thing is though you don't really know what's going on untill near the end. The storyline had a good capability of making the film really good but it never got there. The acting was quite good and so was the special effects but its not one i would recommend or buy. Could of been a great film what a let down.",
            "review_date": "2013-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I haven't seen this since it originally arrived to DVD but remembered it seemed very made-for-TV. Upon viewing the original, it had no business being remade.",
            "review_date": "2013-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "no need for this remake, watch the classic original",
            "review_date": "2013-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't believe I wasted my time watching this piece of garbage.",
            "review_date": "2012-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really liked this movie somehow it was scary for me..I don't know why a lot of people dislike this movie but for sure they are doing a big mistake disliking this movie..",
            "review_date": "2012-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Meh. Visual effects good. That's it.",
            "review_date": "2012-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent film about revenge from beyond the grave, but the last word that I would use for this film is scary.",
            "review_date": "2012-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Freaked me out. But I scare easily. ;)",
            "review_date": "2012-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fog is reminiscent of one 100 years earlier that wrecked a ship and drowned the seamen aboard.",
            "review_date": "2012-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Got Kinda Boring in the Middle",
            "review_date": "2012-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love Tom Welling in htat cable knit sweater! Otherwise, this movie is a waste of time.",
            "review_date": "2012-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fog is a cheap horror movie, lacking decent scares and an intriguing plot",
            "review_date": "2012-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tom Welling is so hot",
            "review_date": "2012-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lacks the many thrills, scares and actual plot that would've made this film a hit. Sadly, it has very little of them...",
            "review_date": "2012-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This foggy chiller will literally eat you alive...yet another remake that doesn't measure up to the original, but as long as you don't take it too seriously it's a tolerable Friday night frightener.",
            "review_date": "2012-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is For Columbus Circle, not the fog. A preview movie. Not great, but some of the acting was ok.\n\n2010 Movies: 35",
            "review_date": "2012-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i enjoyed this even though i didn't really understand the end twist",
            "review_date": "2012-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "there are a million other preferable ways to spend 1 hr. and 40 mins.",
            "review_date": "2012-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "And again we are offered a remake of a classic ghost story.",
            "review_date": "2012-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe this movie would of been better without Clark Kent from Smallville in it. Hell no, this movie sucks no matter what you could of done differently. Just watch the original. Slow, bad editing, waste of SFX and cheesy.",
            "review_date": "2012-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The second remake in the same year for some of Carpenter's old classics and it doesn't seem like a lesson was learnt.\n\nThe age old saying of less is more goes begging yet again folks. This glossy remake simply offers nothing that the original doesn't offer in a better way. There are no real thrills, chills or scares anyway in this extremely poor remake. Not to say that the original was really scary, it wasn't, but it had great atmosphere and more importantly was for an older audience.\n\nYep you guessed it, this overly long remake is a PG-13 cert...oh good grief. The plot is of course nothing terribly scary, an old spooky sea yarn, but at least try for some genuine thrills and a creepy atmosphere. All you get is a pretty blonde boring teen screaming a lot, a token black guy, long drawn out effects which don't add anything and worse fog effects than the original!\n\nSome of the effects are nice admittedly but they aren't really needed, its like the plot, it just delves way too deep and goes on too long when it doesn't have to. A typical effect that shows the over the top nature of the production is the tsunami looking wave of fog that approaches the 'Seagrass'.\n\nDespite the plot being too long it still manages to not make a huge amount of sense right at the end. The ghost effects at the end are also laughable. A complete and utter mistake for all involved, could have been decent if made correctly but it wasn't. Devoid of anything remotely interesting or even slightly scary or spooky.",
            "review_date": "2012-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hmm...this wasn't as bad as I thought...",
            "review_date": "2012-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So shit just go out and see the original trust me its so much better",
            "review_date": "2012-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You cannot be serious...",
            "review_date": "2012-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not bad for a remake",
            "review_date": "2012-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sucked.  They ruined it.",
            "review_date": "2012-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than the original in every way.",
            "review_date": "2012-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i like both the remake and the origional",
            "review_date": "2012-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superman fights a ghostly gang of old sailors whose backstory is complete bullshit and in reality were a group of murdering backstabbing assholes. Horrible acting all-around. The story makes very little sense, but with the deleted full flashback scene I finally understood it and would give this movie a full star-and-a-half extra if they would've left it in. But they cut it. This movie sucks so bad not even Selma Blair is worth a shit in it.",
            "review_date": "2012-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fatal lack of terror and tension make this exceedingly bad remake truly forgettable. The dull script and over-reliance on CGI are the nails in the coffin for this one.",
            "review_date": "2012-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really corny, but it entertained me for a while.",
            "review_date": "2012-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An unworthy remake that doesn't even come close to the brilliant 1980's original despite the attempt to thicken the story's plot and horror scale!",
            "review_date": "2012-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mildly entertaining, but really pretty disappointing.",
            "review_date": "2012-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like My Bloody Valentine 3D, but with lighthouses and Maggie Grace.",
            "review_date": "2012-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A remake of a classic horror film, but then I enjoyed somehow...",
            "review_date": "2012-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "mmmm prefered the book",
            "review_date": "2012-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've seen scary movies but this one went from good to alright,the story of this movie was really stupid,something about lepers coming back from the sea to get revenge on an entire town,why do scary movies try to explain the senseless stupidity with an event stupider story???Also one more thing quite possibly the worst ending I've seen in some time.So for this not being as successful as I expected I gave it a C-.",
            "review_date": "2012-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That ending I did not expected",
            "review_date": "2012-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Let me break this movie down for you, beutiful scenery of Oregon, a distant/cold love story, a hidden past thats come back for it's revenge and a girl who's comeback reincarnated as the girl who died along side family in a mystery ship wreck. And Lots of scary fog. Special effects where incredible, great actors and story board... so what went wrong? A:It was too predictable, and not enough fear. The movie stole from the orginal and slaughters the whole \"scary\" effect.",
            "review_date": "2012-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "DVD Unrated Widescreen",
            "review_date": "2012-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ending sucked, it made no sense at all I was confused about it for a week and then still didn't fully understand what the heck the writers were thinking, and why the heck did they think to themselves, oh hey, these guys killed us it makes total sense that we come back later and kill there desendents 100 years after they're all dead that will just deviate them!",
            "review_date": "2012-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the original is a classic, this one wasn't too bad untill the special effects show up, from that point on it was just plain laughable",
            "review_date": "2012-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as bad as I was thinking it would be.",
            "review_date": "2012-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kinda scary?? A bit??",
            "review_date": "2012-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A decent thriller that has plenty of jumps.  Fog is scary! I appreciated the fact it didn't rely too much on violence to be scary.",
            "review_date": "2012-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok i thought it was funny, not scary or suspenseful at all...a little slow at times too",
            "review_date": "2012-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie it's not scary, the only reason to watch this movie is Tom Welling.",
            "review_date": "2012-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i hated the idea. turns out the movie sucked too.",
            "review_date": "2012-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A complete bastardisation of the 1980 John Carpenter original, The Fog is one of the worst remakes I've ever seen.",
            "review_date": "2012-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not even worth half a star. This film is sooo bad i woukd rather watch trolls 2 than have to sit through it again.",
            "review_date": "2012-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I so wanted this remake to be good. Alas, it is not.",
            "review_date": "2012-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wasn't very scary and the acting was bad. The plot was what kept me watching coz i really wanted to noe wat happens at the end. it's not a film i would watch again.",
            "review_date": "2012-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whatever happened to camp. This remake takes itself too seriously.",
            "review_date": "2012-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the original but at least it wasn't a rip-off of the original.",
            "review_date": "2012-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As much as I hated the original fog, I still decided to give this a chance, hoping it wouldn't be even worse.  Not great, but much better than the original.  Instead of stringy zombie-like ghosts, here they look a little more scary.  I like how the back story is shown and the past is revealed.\r\nHowever Selma Blair trying to sound like the voice of the original d.j. is rather annoying.\r\nQuestion: was Elizabeth a ghost all along?",
            "review_date": "2012-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's pretty good.  I like it.",
            "review_date": "2012-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "2 hours of crap!!!!!",
            "review_date": "2012-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just another awful horror remake, that's all folks.",
            "review_date": "2012-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Original movie was great but this i total crap!",
            "review_date": "2012-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its okay movie but it needs more gore, personally.",
            "review_date": "2012-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "original was better and the ending sucked!!",
            "review_date": "2012-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "original was better and the ending sucked!!",
            "review_date": "2012-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If there was a 0 star rating, this abortion would get it.",
            "review_date": "2012-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "worst stroy line ever",
            "review_date": "2012-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie wuzn't all that great even tho it made me jump just a lil bit wen i saw it in da movie theater",
            "review_date": "2012-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "sucked the old version is better",
            "review_date": "2012-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "another cheap remake of a classic.....",
            "review_date": "2012-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the original is much better.",
            "review_date": "2012-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "aaahhhh the fog is coming,\r\nit's it's, never mind it's just a smoker... that's about it when this movie comes round it's so lame that it reminds me of that Dog on familyguy, not scary in fact you kind of feel sorry for this movie that it could never be scary.",
            "review_date": "2012-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why would you attempt to remake the mist? It was a great story back then and great movie for it's time...",
            "review_date": "2012-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great soundtrack. Other than that, disapointing.",
            "review_date": "2012-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I rather liked this one. It has it's high's and low's and i think that some of the actors/actresses could have been re-caste to make more of an impact, but it is entertaining.",
            "review_date": "2012-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Original GREAT...this one i couldnt get through 30 mins.",
            "review_date": "2012-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was good the first time i saw it!!",
            "review_date": "2012-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "old school horror. Awsoe",
            "review_date": "2012-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love It seriously!!!",
            "review_date": "2012-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw it. Wasn't that great - as I expected it would be with the advertisements.",
            "review_date": "2012-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was ok but the original was better",
            "review_date": "2012-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "did a great job of urinating on john carpenter's original.",
            "review_date": "2012-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I believe this is one of the worst movies I have ever seen.",
            "review_date": "2012-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Twisty ending that didn't make a whole lot of sense, but Maggie and Tom were pretty good!",
            "review_date": "2012-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fact Wainwright thinks he made a good film makes me hate this travesty all the more. The heresy of turning a classic Carpenter film (that wrecked my nerves in childhood) into a teen slasher could have been borne if there was some heart or originality could have been used too. DeRay single handedly destroys every scene he is in with a character so generic he make a mockery of the word stereotype. Coupled with atrocious direction, simplistic editing and zero scares this film should never be viewed... not even for bad movie lovers.",
            "review_date": "2012-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just plain out HORRIBLE. Horrible CGI, horrible acting and performance and not at all scary whatsoever. My advice to you don't watch this film. The fog is just simply  a point-less mediocre remake.",
            "review_date": "2012-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Veryy good movie.\r\nNothing really like the first one.",
            "review_date": "2012-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I went see it in theatre just because of then young Superman Tom Welling.",
            "review_date": "2012-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not scary or good with the cast, this film will just dissapear into the forgotten films list.",
            "review_date": "2012-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stop making horror films where you actually WANT the people in it to DIE!",
            "review_date": "2012-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tom Welling makes it watchable.",
            "review_date": "2012-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was sorta creepy and it was evil that the 4 so called founders of that island did that to those ppl on the boat",
            "review_date": "2012-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A by the numbers ruination of a far superior and atmospheric ghost story. Poor John Carpenter has to deal with two Halloween remakes and this one too. At least the guy got a nice check sent his way for these steaming piles of excrement masquerading as films.",
            "review_date": "2012-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clark Kent and Shannon from LOST remake a sub par horror film very badly.",
            "review_date": "2012-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "hahahaha i saw this in theatres with friends and couldn't stop laughing at it cuz we predicted everything that was going 2 happen and when it did,we'd crack up and so would every1 else in the theatre. it was fun but i wouldnt watch it again",
            "review_date": "2012-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "bored out of my mind.",
            "review_date": "2012-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Straight up UNWATCHABLE! One of the worst remakes of all time in every conceivable way, substituting characters for catch phrases, decent actors for fan service girls, and all around slow building atmosphere for cheap special effect jump scares with no build-up, no character context, and all around no respect for the basic intelligence of the audience or characters within it's own story.",
            "review_date": "2012-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great remake of the original",
            "review_date": "2012-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fog sees a town come across some jewels washed up on the shore. They do not know that there hero's from 1871 were murderous and the ghosts come back to town through the fog and kill one by one",
            "review_date": "2012-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "crap, didn't enjoy at all, not scary in the slightest, pathetic movie.",
            "review_date": "2012-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "IT COULD HANVE ENDED A LITTLE BETTER",
            "review_date": "2012-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inferior to the original in every way except effects. The story was updated and slightly changed which also may have made it benefit, but not enough to surpass the original.",
            "review_date": "2012-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "typical horror movie where lots of people die. might make you rethink going out in the fog.",
            "review_date": "2011-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not too bad of a remake.",
            "review_date": "2011-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "awful the special effects are terrible and it was made in 2005",
            "review_date": "2011-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, Tom Welling is great in the leading role!",
            "review_date": "2011-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the best remake around, this film differs from the original in many ways there are some improvements but the baby faced cast do not add depth to this film,although the story is explained far better than the original, the annoying, black gay that hides in the freezer and lives is crazy, all the electric was off in the boat, so he shouldnt have been frozen, but he was but had he been in a small freezer overnight he would have died, bit ridiculous, and parts of the film were a little slow",
            "review_date": "2011-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original was pretty crappy but the remake finds a way to be worse",
            "review_date": "2011-12-17",
            "source": "rt",
            "lang": "en"
        }
    ]
}