{
    "rating": 8.9,
    "release_date": "1978-01-01",
    "num_reviews": 190,
    "genres": [
        "Drama"
    ],
    "summary": "A screen poem about life in America at the turn of the century. A story of love and murder told through the voice of a child and expressive images of nature in 1916. A steelworker flees Chicago after a fight with his boss; he takes his little sister and girlfriend with him.",
    "reviews": [
        {
            "content": "The best thing I can says about Days of Heaven is that there is no other movie that has ever made me feel the way this masterpiece does. It's the closest an old atheist like me has ever come to a spiritual experience. Definitely the kind of movie you either love or hate and I love it.",
            "review_date": "2023-03-22",
            "source": "rt"
        },
        {
            "content": "If you can get past the pretty-boy looks of Richard Gere, it's a good love triangle movie.  Sam Shepard, Brooke Adams, and my favorite - Linda Mantz - are all excellent.  I love this movie for two big reasons.  It really is a visual feast, and Linda Mantz as narrator is the most phenominal I've ever seen/heard.  Brilliant.",
            "review_date": "2023-02-23",
            "source": "rt"
        },
        {
            "content": "Worth seeing for the stunning-visuals-some references from European Romanticism school of paintings. They did their research on the historical era. Capturing the essence of nature on the screen is quite a feat. The plot and characters did not live up to the visuals. And who in their right mind would turn down Sam Shepard?",
            "review_date": "2023-02-18",
            "source": "rt"
        },
        {
            "content": "An All Time Classic. The acting was phenomenal but a bit slow to get invested fully into because of the extreme lack of dialogue besides voiceovers throughout the first half but the actors did such an amazing job with expressions and what lines they were given that it worked over time. The cinematography is the highlight, this is one of the most gorgeous films I have ever seen. Every shot looks like a painting. The music is very good but I wouldn't call it exactly catchy or memorable but definitely not generic. The editing is very well done. This is a very low key film for two thirds of the run time but does a phenomenal job in the third act ramping tension up and giving an excellent conclusion, making the investment of time 100% worth it. Everyone should give this a watch once.",
            "review_date": "2023-02-15",
            "source": "rt"
        },
        {
            "content": "Days of Heaven is a beautifully poetic and reflective film that is a pleasure to look at.",
            "review_date": "2022-01-27",
            "source": "rt"
        },
        {
            "content": "A stunning visual masterpiece. I was quite young when this hit the theaters originally, and it must have flown under the radar, but I'm so relieved I had a chance to experience it first hand. The creative team takes their time and makes the most of the medium - show don't tell.",
            "review_date": "2021-12-28",
            "source": "rt"
        },
        {
            "content": "Great soundtrack and beautiful shots. Story feels a bit boring at times, but the overall experience in visuals and music compensates for that.",
            "review_date": "2021-12-16",
            "source": "rt"
        },
        {
            "content": "Before disappearing from the world of movies for a couple of decades, Terrence Malick released what is probably his crowning achievement, 1978's Days of Heaven.  Set in the Texas Panhandle in 1916, it follows the story of Bill (Richard Gere), his young sister (Linda Manz) and his girlfriend (Brooke Adams) as they pursue their version of the American Dream.  The film is most notable for the Oscar-winning cinematography, bathing the land in a golden hue and effectively capturing the expansive vistas of the Texas landscape.  It's fascinating to note the directorial styles and techniques that would make him the cinema auteur he would become in the second half of his lengthy career.",
            "review_date": "2021-12-12",
            "source": "rt"
        },
        {
            "content": "Terrance Mallick's Texas translates very well into Alberta's striking landscapes. His depiction of natural beauty gives perfect context for the lives and relationships of his characters. The rural landscape becomes one of his characters. He is also masterful at the use of the voice-over to provide further insights into the problematic relationships among Bill, Abby and The Farmer. I was struck by the beauty of this movie when I saw it while living in  Alberta in 1979, and I am equally enamoured by it 42 years later.",
            "review_date": "2021-11-17",
            "source": "rt"
        },
        {
            "content": "the CGI wasn't as good as fast and furious 9",
            "review_date": "2021-07-15",
            "source": "rt"
        },
        {
            "content": "Beautifully filmed, but I kept waiting for the film to go somewhere.",
            "review_date": "2021-07-01",
            "source": "rt"
        },
        {
            "content": "Back when Malick really tried.\n\nDirector Terrence Malick's period romance drama Days of Heaven (1978) is a beautiful art film about early America, farmers, love, and hard work. Malick creates one of his most expressive and moving pictures with Days of Heaven. Nestor Almendros' cinematography uses gorgeous far wide shots to show the fields of grain being blown by wind for an ethereal feel to the entire film. His medium shots show faces that tell you the entire story. Days of Heaven could have been a silent picture and you'd still understand what was happening. Every shot feels gentle and expressive. Jack Fisk's art direction captures flares of light from flames to gusts of wind with effortless ease.\n\nUsually Malick's pictures now drag on and on with little emotion, but I wish Malick still directed great movies like Days of Heaven still. It has a slow pace with editor Billy Weber barely cutting in the middle of scenes. But, Days of Heaven grips you with memorable characters. Terrence Malick's best picture is still Badlands for me, but Days of Heaven is a solid movie. There's a bit too much farmwork that just isn't interesting to watch. A rabbit running by is more entertaining than the actual farm harvesting. All the character interactions, conversations, and arguments are far more enthralling.\n\nRobert Gould's set decoration is pretty with old Americana all over and a sense of realism to his furnishings. Ennio Morricone's score is lovely with a sense of serenity, romance, and intrigue. Patricia Norris and Jerry R. Allen's costumes are pretty nice with killer fitted suits for Richard Gere and Sam Shepard. Brooke Adams' dresses are gorgeous and period accurate, but most of all, I liked Linda Manz' little black coat as Linda.\n\nMalick's writing is interesting as you understand this couple hiding out on a farm, who get entangled with a love triangle. I didn't feel all the romance to be believable, and the plot is really predictable down to the downer ending, but you are entranced by Malick's writing of nuanced interactions and gazes. His actors elevate his basic script.\n\nRichard Gere gives his finest acting as Bill the farmhand, who puts his lover up to marrying a wealthy farmer for his money. Gere shows his loss and jealousy all on his face and in his spiteful eyes so well. The hunting scene and flame encounter are great scenes. I liked his chemistry with the lovely Brooke Adams' Abbey. She is so pretty in a natural and charming way. You feel bad as she's basically being used by two different men for separate reasons. She acts incredibly nuanced and moving. Sam Shepard's character The Farmer is intriguing as he's dying, but not really, and wants a wife, but somehow doesn't see the ruse. Shepard is always compelling and Days of Heaven is a great show of expressive and subtle acting in his sad looks of longing at Brooke Adams.\n\nI must mention my favorite performance in Days of Heaven is child actress Linda Manz' role as the tough little girl Linda. She's touching in her thoughtful narration from Terrence Malick's writing, while capturing Linda's sorrow at having to work so hard as a harvester. Manz is both funny and moving as you gaze into her captivating eyes that see all the world weariness of a girl brought up in those hard times.\n\nIn all, Days of Heaven is a classic picture of natural beauty, subtle acting, and emotional direction.",
            "review_date": "2021-04-20",
            "source": "rt"
        },
        {
            "content": "Terence Malick's Days of Heaven is a masterpiece, made by four masters:  Malick himself, as writer and director; Nestor Almendros and Haskell Wexler, whose cinematography created one of the most beautiful movies ever made; and Ennio Morricone, whose sublime score envelops us and seals the feelings imparted to us by the images.  Each of the five leads, Richard Gere, Sam Shepherd, Brooke Adams, Linda Manz and Robert Wilke, plays a fully etched character, but they do it by underplaying, by silence, by glances.  The film is many things:  a monumental Greek tragedy; a love story of manipulation and repressed feelings; an impressionistic look, both realistic and romanticized, at the hard life of ordinary people at the turn of the century in America; and an ode to both the harsh and bountiful nature of the great prairie.  Without changing any part of the storyline, Malick could have made a melodrama, with dialogue as monumental and sentimental as the images.  Instead, he made it with restraint, and it thus ended up a portrait of real life, which is full of decisions and mistakes and consequences.",
            "review_date": "2021-04-17",
            "source": "rt"
        },
        {
            "content": "This is my first foray into Terrence Malick's filmography. Days of Heaven remind me of Impressionist paintings, and not just for the rich, pastoral pictures. Rather, the movie consists of short, dense strokes paint a broad picture of a love triangle in the Texas panhandle. Even with the narration, it's left up to you the viewer to fill in the spaces in-between. While the film certainly has artistic merits and climatic third act, the sparse plot left me without an emotional connection.",
            "review_date": "2020-12-24",
            "source": "rt"
        },
        {
            "content": "A: 3/5\nE: 3.5/5\nR: 7.5/10",
            "review_date": "2020-12-14",
            "source": "rt"
        },
        {
            "content": "One of the more visually stunning films I have seen in awhile, maybe since my last Malick picture. I always love and appreciate his natural and reserved style, inducing goosebumps yet again as I found myself becoming totally lost and absorbed in this eye popping work of art.",
            "review_date": "2020-12-13",
            "source": "rt"
        },
        {
            "content": "Wife review; She didn't like the story, and the bizarre interactions between characters.",
            "review_date": "2020-11-13",
            "source": "rt"
        },
        {
            "content": "My favorite Terrence Malick film, but that’s a low bar. You know if he was making it now he would slow down the pace by 90% and intersperse the whole thing with breathy “sister, brother, lover” voiceovers. Instead we get beautiful rural American cinematography, a quirky narration from the young female character, and a slightly disjointed but interesting perspective of struggling poor people trying to make it in early 20th century America. ",
            "review_date": "2020-11-07",
            "source": "rt"
        },
        {
            "content": "I'm completely unashamed to say that I am unsure what to make of the narrative of Days of Heaven, with its relatively traditional concept (love triangle) and rather shallow exploration. Ebert suggests that the restricted nature of the plot is the result of its narrator (Manz's Linda), whose lack of involvement and mental underdevelopment prevent her from reflecting on the depth of passion but do not prevent her from feeling the tangential benefits or eventual fallout. That may be true, but I'm less certain; what I do know is that the film is visually breathtaking. Fantastic use of lighting, motion, and lanscape that creates a unique visual niche among period films. (4.5/5)",
            "review_date": "2020-09-15",
            "source": "rt"
        },
        {
            "content": "Even at 93 min it felt far too long.",
            "review_date": "2020-07-15",
            "source": "rt"
        },
        {
            "content": "Yes, it is the most marvelous thing you'll see but is also a great story of social inequality, human nature, sorrow and regret. The quick shots keep the film going, but I felt something was missing, perhaps a more present soundtrack would fill in.",
            "review_date": "2020-06-25",
            "source": "rt"
        },
        {
            "content": "Found this very impressive. Where the days of heaven are is unclear to me. Certainly saw the plagues if he'll that followed and it was a well set up film. Richard was Young once and he puts in a good show. Great depiction of early twentieth century panhandle.",
            "review_date": "2020-06-22",
            "source": "rt"
        },
        {
            "content": "Touching story, good cinematography, remarkable cast and it manages to go through the entire film jost enjoying it without noticing it is only an hour and a half.",
            "review_date": "2020-05-20",
            "source": "rt"
        },
        {
            "content": "My favorite Terrence Malick film, no doubt about it. Such beauty, such melancholy.",
            "review_date": "2020-05-14",
            "source": "rt"
        },
        {
            "content": "A simple story told with eloquence and grace but in the end it feels too formulaic.",
            "review_date": "2020-03-31",
            "source": "rt"
        },
        {
            "content": "It is an absolutely beauty to watch. The story sadly comes to a secondary importance",
            "review_date": "2020-02-05",
            "source": "rt"
        },
        {
            "content": "The strikingly beautiful cinematography of this period movie is almost a character of its own as it underscores its achingly romantic story.",
            "review_date": "2019-11-07",
            "source": "rt"
        },
        {
            "content": "Not my cup of tea. I couldn't understand why the pretense of her being his sister.",
            "review_date": "2019-08-08",
            "source": "rt"
        },
        {
            "content": "Days of Heaven Review\n\nNever have I cared more in my life about the fate of a field of wheat than I did in Days of Heaven (1978), but it's not just the agricultural landscape that we're invested in during this film as we have four deliberately sketched characters each with their own passions, motivations, flaws and fears in this remarkably short American epic. \n\nThe film concerns Abby and Bill, two young lovers/con-artists who tell employers that they are siblings, \"Because it's easier that way\", and Bill's younger sister Linda who travels with them on their journeys around the United States usually caused by Bill's temper getting the best of him. This time he has severely injured or killed his employer at a steel mill and he and the two women in his life have to escape from Chicago before the police find him. They end up on a farm owned by a mysterious and ethereal but lonely farmer who has an intense attraction to Abby. When Bill sees a way to manipulate this it spells trouble for all involved.\n\nIt is a tribute to the incomparable Terrence Malick that he manages to cram this much emotion and meaning into just 94 minutes with some of the most beautiful cinematography ever seen on film and the flowing, poetic passages that Malick would become known for springing from the lips of Linda Manz. The style that Malick would become associated with over his next 6 films, elements of which were developed in Badlands, are fully solidified here with natural light drenching every frame, women in flowing dresses frolicking in fields, poetic voiceovers, operatic music that swells dramatically at moments of grief and a lack of dialogue all present. What makes these elements all work so well when compared to Song to Song or To the Wonder is that the film's short running time allows you to marvel at the beauty and visual poetry that Malick creates without becoming bored with the slight story or confused by the lack of dialogue, Days of Heaven never outstays it welcome and that makes it near perfect.\n\nThe performances although largely non-verbal are also terrific with Richard Gere's fractious, manipulative performance as Bill shows just how interesting he can be as a performer when not saddled with the task of being a stolid, flawless, leading man. Here he plays a man who is clearly flawed and yet Gere has a sensitivity that allows us to care about this anti-hero. Sam Shepard is equally wonderful but entirely different as Gere's romantic rival, simply â~The Farmer', he has an innocent, almost angelic quality that makes us even more saddened when he faces an enemy that cannot be defeated. Linda Manz gives a remarkable performance as a child actor making Linda seem both without the annoying precociousness that child actors often employ and yet still self-aware and understanding of her situation, making her character uniquely able to serve as a mouthpiece for Malick's idealistic, almost childlike views. Brooke Adams is successful in playing a conflicted object of desire and her dark eyes and pinched face do everything they can to convey to us the depths of her torment as he struggles with her love for two very different men. Without performances with this level of depth this story could easily slide into being just another clichÃ (C)d love triangle but it manages to avoid this by crafting characters whose anxieties feel real and relatable no matter how outlandish the story on paper may seem.\n\nThe portrait of this period of American history that Linda Manz clearly sketches in her monologues discuss the unique problems that these people faced and at the same time the idyllic, simple lives they lived. This contrast does not feel imbalanced and it does not feel like Linda lurches between the positive and negative view of her life on the wheat field, it simply feels like a young girl's insightful view of the world she lives one, one that perfectly accompanies the overall tone of the film.\n\nI would definitely recommend this film to all audiences because it is beautiful, insightful, sensitive, features great performances and is one of 4 masterpieces that Terrence Malick has made and is in my opinion his best film. I engaged with it even more than I did with The New World (2005), therefore I would call it Malick's best film.",
            "review_date": "2019-04-19",
            "source": "rt"
        },
        {
            "content": "Days of Heaven: Its not Malicks best film, however the continued visual poetry, infectious symbolism, gorgeous cinematography and slick writing help transends Days Of Heaven above many other love triangle films.",
            "review_date": "2019-02-09",
            "source": "rt"
        },
        {
            "content": "\"Sometimes I'd feel very old, like my whole life is over, like I'm not around no more\".\n\n'Days of Heaven' is a mesmerizing film that captures the beauty and calm activities in life, while having this unexplained sadness underneath. At the end, you learn that memories, good or bad, will occasionally haunt your thoughts and emotional state - since the film is about someone reflecting on their memory.\n\nMy relationship with Terrence Malick can be complicated, but when he scores, it's remarkable.\n\nOne of the highest forms of art.",
            "review_date": "2019-02-03",
            "source": "rt"
        },
        {
            "content": "The best, GREATEST romance movie ever made!",
            "review_date": "2019-01-26",
            "source": "rt"
        },
        {
            "content": "My issue with Malik films is I simply don't like his characters.  This film seems way overrated to me... the characters are not sympathetic and the images rather mundane. The ending  was the best part of the film and the good hair on Gere and Shepherd.  Gonna say avoid this one.",
            "review_date": "2018-08-17",
            "source": "rt"
        },
        {
            "content": "Days of Heaven has a fairly simple love triangle at its core, and the anachronistic presence of Richard Gere, but the breathtaking canvas, groundbreaking editing, lyrical storytelling, and some of the best cinematography ever captured on film elevate it to something very special.",
            "review_date": "2018-07-10",
            "source": "rt"
        },
        {
            "content": "One of the greatest poetic achievements. Yes, Days of Heaven is not a movie, it's a poem. I'm totally serious!\n\n(8.5/10)",
            "review_date": "2018-05-15",
            "source": "rt"
        },
        {
            "content": "Visually beautiful. An ethereal and dreamy love triangle. The problem is I never felt dragged in, like it happen to me just a week ago with Badlands (for me the director masterpiece). The original (and not) soundtrack is among the things I like the most. Thank you maestro.",
            "review_date": "2018-05-15",
            "source": "rt"
        },
        {
            "content": "A mí déjenme a Terrence Malick. Su dialéctica cinematográfica es poesía pura.",
            "review_date": "2018-05-13",
            "source": "rt"
        },
        {
            "content": "Quite a lovely film, a great American life film. But it's hard to really fall in love with it.",
            "review_date": "2018-05-07",
            "source": "rt"
        },
        {
            "content": "and a lot of money..\n\nDays Of Heaven\n\nThe cinematography as always is stunning in a metaphorical tone that communicates to audience about the fueled intense exoticism that is explored in here. Terrence Malick's; the writer-director, keeps it simple on paper but takes out his big guns while executing (it surpasses the script) which is mesmerizing and thought provoking at the same time. On performance level, Richard Gere has done some decent work but other than that it seems like it wasn't Brooke Adams and Sam Shepard's forte. Days Of Heaven is weak on offering fresh or concrete material and performance, but still works like a charm due to the deep ideology and anatomy of human nature in all aspects of its time with different perspective.",
            "review_date": "2018-05-05",
            "source": "rt"
        },
        {
            "content": "Amazing cinematography, every part of the production is superb and the acting from everyone is fantastic.",
            "review_date": "2018-04-04",
            "source": "rt"
        },
        {
            "content": "Gorgeous cinematography coupled with an engaging score and Malick's signature realism makes for a visual treat. It's more of a living portrait than a simple cohesive narrative. There's also biblical allegory undertones that make the whole thing ripe for dissection.",
            "review_date": "2018-03-25",
            "source": "rt"
        },
        {
            "content": "Days of Heaven is impeccably shot and full of Terrence Malick's signature beautiful imagery that creates a profound, detail-oriented period piece.",
            "review_date": "2017-11-24",
            "source": "rt"
        },
        {
            "content": "Before his 20-year sabbatical absence, Terrence Malick won the best director award at Cannes in 1979 for romancing the screens with a sensory cinematic pleasure of the most overwhelmingly heroic images of pastoral idyll by Oscar-winner Néstor Almendros and melancholic music by Ennio Morricone.",
            "review_date": "2017-08-08",
            "source": "rt"
        },
        {
            "content": "Terrence Malick's last movie before a 20 year gap is his first formula-driven picture, which usually ditches straight narrative for visual poetry. Malick is one of my biggest inspirations, but seriously I would opt for Badlands or The Tree of Life any day. It's a solid movie, sure, but the acting is just wooden. It's more like watching a brilliantly organized patchwork of poems and paintings than your standard, thought-provoking, emotional, and affecting film.",
            "review_date": "2017-06-19",
            "source": "rt"
        },
        {
            "content": "Days of Heaven is an hour and a half long, but it feels much longer due to the plodding it does for much of the runtime. This aside, I really did enjoy the plot, and I found the film picked up enough to not feel completely bogged down. There is some really special shots that are iconic in this film, Malick knows how to shoot a film for sure. My biggest problem with the film is that the daughter character served absolutely no purpose to the film, and her presence was simply confusing to me. Combine this with the slower pacing, and the fact that the film isn't really my type in the first place, I'm surprised I liked it this much, and there is definitely some level of greatness this film achieves. For myself personally though, I probably won't watch it by myself again",
            "review_date": "2017-06-17",
            "source": "rt"
        },
        {
            "content": "Breathtaking. Watching it makes me feel alive.",
            "review_date": "2017-06-15",
            "source": "rt"
        },
        {
            "content": "5/5 cinematography. Story a bit minimalist for the large themes.",
            "review_date": "2017-05-18",
            "source": "rt"
        },
        {
            "content": "I've never been so terrified of locusts in my life until watching this movie. The way Terrence shot the insects and the whole scene was so National Geographic. This movie is such a feast for the eyes. You can tell Terrence Malick was getting all kinds of inspiration from Barry Lyndon. I can see it in his shots.\n\nWhile the movie was amazing, and I will definitely be watching it again, it felt too short of a movie. It felt like Terrence took a movie that was supposed to be 3 hours long, and condensed it to half of that. \n\nNonetheless, this movie was beautiful in every sense of the word.",
            "review_date": "2017-04-23",
            "source": "rt"
        },
        {
            "content": "This movie wants me to see more classics. Wow.",
            "review_date": "2017-03-12",
            "source": "rt"
        },
        {
            "content": "beautifully shot film plays like a textbook for cinematographers and film students, picture has faded in some prints though, additionally the pictures core drama of romantic betrayal focuses on a flawlessly attractive male protagonist, supposedly also an unskilled, hard living farm laborer with a violent streak, practically homeless etc. Philosophy academic and director Terrence Malick adds depth, drama and a sense of national history to the film.",
            "review_date": "2017-03-03",
            "source": "rt"
        },
        {
            "content": "Days Of Heaven, a.k.a., Wheat Fields: The Movie, is an absolutely gorgeous film, with stunning lighting, gigantic skies and countless scenes of authentically dressed extras milling about in the Texas countryside. Terrence Malick movies get plenty of praise for their visuals, but also receive a near-equal amount of exasperation for their unfocused narrations and air of pretention. This is very evident here, as a film that's only an hour and a half is made to feel twice that length with so much scenery, so much dull dialogue, and so much focus on large groups of people doing nothing of interest. As with his debut feature Badlands, we aren't allowed to learn about what the characters are feelings or what they want by hearing them interact with each other, but instead we get everything through an omniscient and increasingly irritating narration, which always feels to me like a cheap emotional shortcut. Aside from the visuals, there's nothing in Days Of Heaven that is worth the hype it constantly receives.",
            "review_date": "2016-10-25",
            "source": "rt"
        },
        {
            "content": "tries to be artsy. fails. would have been better without dialogue.",
            "review_date": "2016-09-27",
            "source": "rt"
        },
        {
            "content": "\"Days of Heaven\" is a powerful and emotional portrait of early 20th century working class.",
            "review_date": "2016-06-03",
            "source": "rt"
        },
        {
            "content": "One of the most visually stunning films I've ever seen. I didn't expect Malick to have topped his prior \"Badlands\" with this film, but \"Days of Heaven\" is so brilliant and memorable that it almost makes Badlands look like a minor piece.",
            "review_date": "2016-05-16",
            "source": "rt"
        },
        {
            "content": "A feast for the eyes and ears.",
            "review_date": "2016-04-14",
            "source": "rt"
        },
        {
            "content": "Days of Heaven is a major step up for filmmaker Terrence Malick. While his debut feature, Badlands, showed promise, it ultimately left me feeling cold. His second feature, however, is a haunting portrait of youth, love, and the mistakes that accompany each. The Oscar-winning cinematography is a highlight, as is the surprisingly terrific and helpful voiceover narration. But the star is Malick, who takes what worked in his first film and adds a much-needed emotional component. Days of Heaven still features that meditative, hands-off style one might expect from a Malick film, but it reels you in on a whole other level.\n\nBill (Richard Gere) and Abby (Brooke Adams) are young lovers and drifters in the Midwest during the early 1900s. Along with their young partner, Linda (Linda Manz), they roam around looking for work and trying to conceal the fact that they're unmarried. To do so, they tell people they're brother and sister, which earns them some awkward looks when they land at a wheat farm in the South. During the harvest, Abby catches the eye of farm's owner (Sam Shepard). Bill notices this and feels a tinge of jealousy, but he recognizes an opportunity when he sees it. If the owner, who is very sick, marries Abby, she'll be the heir to the whole farm. So rather than rebuff his advances, she plays along and eventually marries the farm owner. But not long after the marriage, Bill starts to really regret things. He sees Abby starting to fall out of love with him, and this drives him crazy. And despite their best efforts, Bill and Abby can't quite seem to conceal the true nature of their relationship. So with two men jealous and one woman confused, everything comes to a head, just at the moment when everything on the farm goes to hell.\n\nBy telling the story from Linda's point of view, Malick accomplishes two things. First, he allows us to ponder the meaning of love from an outsider's perspective. Linda has little else to do in the film but help harvest some wheat and run around on the farm. She's not educated (she regularly mispronounces or misuses words in her narration), and she's obviously never been in love. As a result, she's somewhat unaware of the complicated feelings that surround her and her loved ones, and we can observe from a distance along with her.\n\nSecondly, we're able to generate our own conclusions regarding the characters and their feelings because Linda is our window into this world. Is Bill's anger and temper justified? Or is he pushing it too far? Is Abby's flighty? Or is she driven away by Bill? These are questions that can't be easily answered because we don't see the film from their perspective at all. It's a smart love that adds a layer of complexity to an otherwise familiar story.\n\nMalick's other great achievement is his pacing. Days of Heaven usually zigs when its supposed to zig and zags when it should zag, but every once in a while, it throws in a surprise or two to keep us on our toes. The disaster at the farm, for instance, comes out of nowhere, but it's a welcome jolt. Better than just having a few twists, however, is that they don't feel cheap at all. The scene mentioned above, in addition to surprising us, drips with meaning, as the farm owner's decent into bitterness and hostility couples well with his farm's problems.\n\nRichard Gere turns out one of his better performances as a hot head who brings a whole mess of trouble onto himself. He's sympathetic, though, as we see his heart is in the right place. He just is too young and naive to realize there's always a consequence to sneaky behavior. Brooke Adams is a little blah as Abby, who's not exactly one of film's legendary heroines. Sam Shepard, however, is spot-on. He portrays the world-weariness of a man who's been burned one to many times, as well as the innocence of someone who's still hoping for love to find him. He's definitely the heart of the picture, as we pity and root for him despite his obvious third-wheel status. Linda Manz, however, gives the film's best performance. Though I'm on record for saying she doesn't have much to do, the narration work is sensational. Usually a crutch to tell rather than show, I'm not a fan of this device. Yet it works here, as in most Malick films. But Manz is just the perfect storyteller. So much is conveyed just in her tone that when she actually appears on screen, she has already earned our attention.\n\nThough I wouldn't go so far as to say Days of Heaven is Malick's best work, I would say that Days of Heaven is essential viewing for all film fans and anyone who enjoys a thoughtful and well-made romantic drama. It's a film that rewards patience and really stays with you, and for that, it earns a hearty recommendation.\n\nhttp://www.johnlikesmovies.com/days-of-heaven-review/",
            "review_date": "2016-03-13",
            "source": "rt"
        },
        {
            "content": "Caught up in the rapture of the brilliance..",
            "review_date": "2016-03-11",
            "source": "rt"
        },
        {
            "content": "1978's Days of Heaven was Terrence Malick's second feature, and last featue before he took an abrupt 20 year leave to teach Philosophy in France, and then came back smashing with The Thin Red Line.\nHowever. Days of Heaven is a great film, right after he made Badlands which was also impeccable, the performances are great, Richard Gere as an up and coming star shines as the hot-tempered lover, and Brooke Adams is impeccable as the lover of both Bill and ''The Farmer''. The script is intelligent, but might be predictable, as i thought aswell, but it isnt, it keeps you guessing as of how the movie is going to flow, and how it is going to end.\nTerrence malick's beautiful masterpiece has to be a must watch for true cinema lovers. Another malick masterpiece into his reduced filmography. Considered at that time an instant classic and a rare and beautiful film, still now absorbs that tittle with its infinite imagery and vision. Probably richard gere's best film alongside Primal Fear, Hachi, and the infoumasly loved Pretty Woman.\nDays of Heaven is an achingly tragic love story, filmed in a strange yet appealing quasi-documentary style. A beautiful masterpiece composed of breathtaking cinematography, subtle acting, smart writing, and ingenious direction. Malick is known and revered for his cinematography, and elements of nature within his movies, but this is where it all began. His second movie, Days of Heaven is a visual feast. Stunning landscapes, minute images of nature and incredible use of light. Even 35 years later it cannot be faulted, cinematographically. \n\nYou could hang almost any shot of this movie on a wall and call it art.",
            "review_date": "2016-03-10",
            "source": "rt"
        },
        {
            "content": "A beautiful presentation of the panhandle's endless plains of grain and a solitary mansion dominating the landscape. Sadly the story falls apart at the end leaving you disappointed. 1001 movies to see before you die.",
            "review_date": "2016-02-14",
            "source": "rt"
        },
        {
            "content": "This is a great film.  I never thought Richard Gere is a good actor, in fact, I think he is one of the most overrated actors in the industry.  Even Tom Cruise is stronger.  However, the cinematography alone in this film makes it a masterpiece of capturing the early farmers' struggles in early 20th century Texas.  I don't think this film would stand up as great if it wasn't for the cinematography.  Much like a Stanley Kubrick film, the pictures tell more of the story than the dialogue.  Along with a genuine narration tying together the various scenes, there is little need for dialogue.  At its core it is a believable story of desperation, love and jealousy.",
            "review_date": "2016-02-13",
            "source": "rt"
        },
        {
            "content": "Horrible movie. Every decision on dialogue and direction the writer/director made was wrong. Cinematography was great.",
            "review_date": "2016-02-08",
            "source": "rt"
        },
        {
            "content": "Gorgeous film. Dark and very moving.",
            "review_date": "2015-11-16",
            "source": "rt"
        },
        {
            "content": "If you are not familiar with Terrence Malick I whole-heartedly recommend that you make the time. Days of Heaven is his sophomore film after Badlands. It tells a story similar to the story of Abraham and Sarah in the Bible. Bill and Abby, played by Richard Gere and Brooke Adams are two unmarried lovers who travel to a farm in search of work in the breadbasket in 1916. To remain together while on the job they pretend to be brother and sister which work fairly well until the owner of the farm, Sam Shepard, falls in love with Abby.\nThis melodrama is something that typically turns me off and it would have here were it not for Malick's ability, along with DPs Nestor Almendros and Haskell Wexler, to capture one of the most beautiful mid-west films I have ever watched. Every single shot gave something special and almost unique (which is troublesome when filming in a wheat field).  I can hardly recommend Days of Heaven enough.",
            "review_date": "2015-10-22",
            "source": "rt"
        },
        {
            "content": "Days of Heaven (1978) ????\nHard to put into words this movie's visual beauty. Néstor Almendros won richly deserved Oscar for his almost overwhelmingly beautiful photography in eloquent story of two farm laborers, a man and his lover, whom he convinces her to marry their rich but dying boss so that they can have a claim to his fortune. Breathtaking to say the least, with many layered meanings and images, nothing short from a master visionary, Terrance Malick, in his finest film to date. Extraordinarily good on every level.",
            "review_date": "2015-10-01",
            "source": "rt"
        },
        {
            "content": "Ennio Morricone and Néstor Almendros. Sometimes, a story doesn't matter to me. Every single shot is beautiful.",
            "review_date": "2015-09-25",
            "source": "rt"
        },
        {
            "content": "\"Nobody's perfect. There was never a perfect person around. You just have half-angel and half-devil in you.\"                                                \n\n\nThat's a quote taken from actress Linda Manz who narrates Terrence Malick's second feature film \"Days of Heaven,\" which is such a remarkable and breathtaking film as all of Malick's films are as we can clearly see from beginning to end as Malick gets perfect shot after perfect shot of the beautiful nature scenes that he is so famous for doing in all of his films. The movie takes place somewhere in the Midwest outside Chicago, Illinois, where narrator and actress Linda Maze, goes on a this beautiful journey out into the Midwest with her older brother and guardian who just so happens to be a very young and magnetic looking Richard Gere and his girlfriend who is played by the very talented Brooke Adams, after Gere's character accidentally kills a fellow worker in by hitting him over the head with a shovel after a dispute between the two men in a Chicago factory. Gere's character then goes on the run with his little sister and girlfriend as all three head out into the magnificent wheat fields in the Midwest where they immediately begin work in a wheat field owned by Sam Shephard, who takes an immediate liking to Brooke Adams once he lays eyes on her. Before they arrive at the wheat field, they tell everybody aboard the train that Gere and Adams are sisters, not lovers so they do not arouse any suspicion invade they are being looked for after Gere's incident at the Chicago factory with the worker that he killed. They hustle and earn three dollars a day, which by the way I am guessing the movie takes place sometime in the early 1900's so three dollars an hour is really not that bad for a days pay back then. But things get complicated when Shepard's character begins to take a liking to Brooke Adams and asks her to stay on the wheat farm and continue working on the wheat farm after the harvest is over. Once she relays the message back to Richard Gere, he tells her to do it and possibly put on a show for him so that if he falls in love with her, all three of them can remain on the farm. The thing is though that we find out early when we meet Shepard's character that he is dying and only has a year to live. What he is dying from remains unknown, but we can assume it is probably cancer or some other type of major illness. Once Gere figures out what is happening to Shepard, he figures if he falls in love with Adams and marries her and they remain in the wheat farm, when Shepard dies, they can inherit the wheat farm. So Brooke Adams says yes to Shepard's offer on the condition that Gere and Manz stay with her on the wheat farm as she informs Shepard that Richard Gere is her brother not her lover, even Brooke Adams and Richard Gere continue romancing with each other on the side, even after Shepard marries Adams. Things go good for a while until Shepard grows suspicion that Gere and Adams are not who they say they are after seeing them touch each other sexually as he is walking along his wheat farm at night during which a belly dancer dances for them inside a little hut and then after confronting Adams about it and flat out denying it to his face, Adams begins to worry about Shepard finding out as she fears she is going to hurt him if he finds out. That's when Richard Gere realizes that Adams has fallen in love with Shepard and that this is now become a serious problem for all three of them. Even before when Shepard was warned by his over looker of the wheat farm who knows that Gere, Adams, and Manz are not who they say they are, Shepard refuses to hear it. That is until he sees from a distance on top of his farm house when Adams touches Gere on the face as if a happy together would do to one another, we then get a real close up look of Shepard back inside under the roof as we can clearly see by his expression on his face that he feels truly betrayed. This is where the last hour turns into a somewhat revenge saga as Shepard tries to attack Richard Gere during an infestation of what seems to be cicadas which vastly threaten the wheat farm after they harvest all over the wheat fields, eating everything insight. Shepard attacks Gere with a torch lamp that by accident breaks when swinging at Gere which ends up putting almost the whole farm up in flames as everyone working in the wheat field tries everything in their power to put the large flames out. Shepard then takes matters into his own hands as he gets a pistol from his room after giving Adams a hard look that he knows what is going on, and goes after Gere in which Gere ends up *SPOILER ALERT* killing Shepard in self defense with a knifing tool. Realizing now that he is in deep shit Gere quickly takes Adams and Manz and they quickly escape from the wheat farm before anybody finds out that Shepard has been killed. Once discovered by the over looker that made it clear to Richard Gere that he knows what he's up to and that Shepard is like a son to him, it then becomes a manhunt to track and kill Richard Gere in the last half hour of the film. The movie is absolutely filled with great Terrence Malick magic of nature as I said before that will definitely suck in all die hard Malick fans as Malick truly is in my opinion a director from God himself, as he truly is a gifted visualizer of movies. \"Days of Heaven\" definitely deserves to be in the top 100 best movies ever made as for that time in the late 1970's to capture what Malick had captured in this movie I can only imagine must have been staggering to watch at that time. The man has a true gift for both animals and nature, which definitely brings up the conclusion that Terrence Malick will go down in history as one of the most gifted, compelling, and artistic directors to ever walk the face of this earth. God bless him.",
            "review_date": "2015-08-24",
            "source": "rt"
        },
        {
            "content": "Breathtaking cinematography and scenography flooded in Ennio Morricone music.",
            "review_date": "2015-08-08",
            "source": "rt"
        },
        {
            "content": "Painfully boring and tedious.",
            "review_date": "2015-08-02",
            "source": "rt"
        },
        {
            "content": "It would be close to 5 years before Terrence Malick would follow up his groundbreaking and unforgettable, Badlands. \n\nDays of Heaven presents a more mature vision, but an evolving perspective on reality that retains grounding through the insightful but limited perspective of a child's musings of a past that seems to have either immediately occurred or happened not too long ago. \n\nThe tone and plot of Days of Heaven is quite different in respect to Badlands. Yet there is stream of cinematic thought that connects both films. \n\nWhere Badlands was an almost detached view of reality, Days of Heaven takes the form of a cinematic poem connected to the characters by a child whose life has required her to adapt a slightly skewed version of an adult.\n\nWhile it never quite soars to the level of Badlands -- it clearly soars to what Malick intended. This would be the last time Malick approached humanity from what I would term a \"human emotional\" perspective. Malick's style would and continues to sprout further into the realm of the experimental with aspects of \"nature\" and even \"metaphysical\" replacing the less challenging perspectives presented here and in Badlands. \n\nThis is not necessarily a bad thing. But Malick's cinematic perspective no longer blend easily with Humanity, Surrealism or Experimental Film. After this movie Malick's films have become polarizing. How an individual manages to access understanding and connection to his work has now become more radical. \n\nFrom my perspective this is sad. He has never managed to capture humanity as simply as he did with his second and third movies. \n\nIt is interesting to me that Lynda Manz's character delivered one narrative line that I so seared into my then 11 year old mind that I can still recite it easily today:\n\n\"I was hopin' things would work out for her. She was a good friend of mine.\" ...and the meanings/powers of the line have changed over the span of my life.",
            "review_date": "2015-07-04",
            "source": "rt"
        },
        {
            "content": "My full opinion: I wouldn't say that this film got to me all the way through, but the story is good, Ennio Morricone's music is beautiful, and the cinematography by Nestor Almendros is really breathtaking, which i'm glad that it won an Oscar for that. 8.2/10",
            "review_date": "2015-04-30",
            "source": "rt"
        },
        {
            "content": "Sublime poetry riding the new american cinema. Malick is letting the pictures talk in total universal scale. A love triangle kneeling into the arms of the earth. Sensual cinematic and spiritual story huzzling into the endless wound of love. Unsettling distraction of the unknown psyche, tormenting the vermin.",
            "review_date": "2015-03-23",
            "source": "rt"
        },
        {
            "content": "The visuals are nice but nothing special.A few noteworthy shots such as light shining on the workers walking beside the hay truck or the locust scenes.The scenes seem to not last even 20 seconds before fading into another short scene and so on,accompanied by the little girl´s realistic but also awful sounding narration.It feels as if the director was intentionally trying to muddle some scenes, such as the introductory fight scene in the foundry or when the landlord (he ain´t no farmer) forces Gere´s character to leave,starting a fire in the process.The feeling he was trying to give the scenes is understandable,but drowning out the voices,and feelings along with it,feels forced and irritable.\n\nThe sequence of quick,pointless scene to scene makes the film feel more of a documentary on pastoral life,in which case it succeeds,but it presents us with nothing interesting as a movie,with the only story being the con-marriage,which for all the time wasted on irrelevant scenes and shots of birds roaming the fields, is quite rushed,as one second they´re talking and the next we get a marriage scene.\n\nI fully understand the intention the director had,the feeling he was going for,and he succeeds in creating his vision,but this does not necessarily leave us with a good movie,which it barely is,a movie.Even the end is baffling,with the girl talking about the future of a girl she just met and who has been on screen for 17 seconds before the movie ends,as if anyone is supposed to care about her. Maybe it´s supposed to reflect on a second chance,a second incarnation of the main female character,but it feels superficial and barely worked upon,as all the other human interactions in the movie.\n\nI´ll give this a 2nd chance for it being Terrence Malick,but not impressed at all.",
            "review_date": "2015-03-20",
            "source": "rt"
        },
        {
            "content": "Beautiful cinematography, score, editing, setting, and themes.\nHowever, the story never really seems to become much of anything. \nThe beginning is horribly rushed and the great meaning is somewhat blunted by the film's lack of involving storytelling and mostly simple plot.\nThis could have been so much more.\nDays of Heaven is a beautifully made film, but not a beautifully written one.\n7.5/10 (B)",
            "review_date": "2015-03-13",
            "source": "rt"
        },
        {
            "content": "I guess I needed to watch this when it was new and had this movie to compare to others at the time. It's slow and there isn't a lot going on that would compel me to get attached to any of the characters. I found myself getting annoyed with the way it was filmed- I would have rather had more substance and dialogue with the the character building instead of all of the cut aways to birds and other random field creatures. Should I feel more sorry for the birds that died in this film? They had as much screen time as some of the actors and it felt like I was watching Nat Geo at times. Without the really odd narrative from the girl there wouldn't have been any cohesive movie at all. I'll stick with Gone With the Wind.",
            "review_date": "2015-03-03",
            "source": "rt"
        },
        {
            "content": "As with all Malick films, \"Days of Heaven\" contains gorgeous visuals, existential musings, commentary on American life, etc.The story is barebones; Malick's camera hovers and zooms in unexpected ways, allowing the viewer to remain an objective observer experiencing human interactions in lovely, nuanced ways. If you're willing to engage with what he gives you, its a wonderfully rewarding piece of work.",
            "review_date": "2015-03-02",
            "source": "rt"
        },
        {
            "content": "A visually stunning epic of passion and desire.",
            "review_date": "2015-02-02",
            "source": "rt"
        },
        {
            "content": "You could hang almost any shot of this movie on a wall and call it art. Full review later.",
            "review_date": "2015-01-30",
            "source": "rt"
        },
        {
            "content": "This was a re-watch. A beautiful, tragic movie.",
            "review_date": "2015-01-24",
            "source": "rt"
        },
        {
            "content": "Simply put, Terrence Malick directed the most beautifully shot romance melodrama of all time and here it is.",
            "review_date": "2015-01-19",
            "source": "rt"
        },
        {
            "content": "A breathtakingly beautiful movie about love and violence that show nature as an indifferent, ever-changing landscape. While our petty squabbles and minute problems burden us at every second, nature flows freely, without care and without concern.",
            "review_date": "2015-01-19",
            "source": "rt"
        },
        {
            "content": "A screen poem about life at the turn of the century recalled through the eyes of a child. My first viewing left me confused and slightly angry at what I saw to be a muddled narrative, coated with typical Malick flourishes but the second and third viewing had me coming close to labeling it a masterpiece. Watching it for a second and third time I realized that this film is the memory of a small girl. We never get a fully constructed narrative because the love triangle between The Farmer, Bill and Abby is seen from the outside looking in, through the eyes of Linda (a 12 year old girl). So the only information were getting is what Linda saw or imagined. What were left with is a tender remembrance of a time and place near to this girls heart that is both beautiful and enigmatic, continually floating just beyond our grasp.",
            "review_date": "2014-12-30",
            "source": "rt"
        },
        {
            "content": "Although this was my first watch of the classic Malick film I was captured by the sheer beauty of the visuals and ebb and flow of the plot. Although it was a slow pace film and seems at first glance more tradition, Days of Heaven is riveting film filled of subdued but nuanced passion and emotion. Look forward to watching this again and digging deeper into this film.",
            "review_date": "2014-12-27",
            "source": "rt"
        },
        {
            "content": "While boasting poetic, vast rural landscape of America, Days of Heaven does not have strong or gripping narrative to balance. It ends up being an ephemeral, fleeting slice of life: poignant and beautiful but not necessarily having a lasting strong impression.",
            "review_date": "2014-12-18",
            "source": "rt"
        },
        {
            "content": "best photography ever or in the top 5 of all times",
            "review_date": "2014-12-16",
            "source": "rt"
        },
        {
            "content": "A visually stunning film from Filmmaking Legend Terrence Malick. Days of Heaven in a nut shell is a film about a hot headed mill worker named Bill (Richard Gere) who kills his boss fighting during work, so he runs off with his girlfriend Abby (Brooke Adams) and his younger sister Linda (Linda Manz). They turn up in a rural part of Texas and work at a farmers ranch for the summer. The Farmer (Sam Shepard) is dying from an illness, but falls madly in love with Abby. Bill see's this as an opportunity to get out of the rut they've been in all his life, so he tells Abby to marry the Farmer, so that they can inherit his money. Abby agrees, but soon finds herself falling for the man that she's suppose to be just falsely in love with. Bill can't take it and soon thing get out of hand. First off the cinematography in this film is outstanding!!! Literally each shot presents itself like its a work of art. Colors burst from the screen (part of the magic of shooting during the magic hours of the day), and the performances really convey the feeling to the viewers of the despair, passion and pain the characters have. I really enjoyed this one and recommend people that appreciate film give it a look!",
            "review_date": "2014-12-02",
            "source": "rt"
        },
        {
            "content": "A jaw dropping beautiful work of high art coupled with one Enio Morrecone's finest sound tracks.",
            "review_date": "2014-10-01",
            "source": "rt"
        },
        {
            "content": "Breath-taking in its beauty and poetic in all aspects.",
            "review_date": "2014-09-17",
            "source": "rt"
        },
        {
            "content": "Although the story is not inventive, it takes a backseat to the mesmerizingly serene photography anyway.  I'd never truly want to live in '10s America, but Malick has awakened a naive longing in me to live for a year, or a few, on a farm like that during that period, or even in the village depicted, with its undeniable quaintness.  The narration comes and goes but achieves maximum poignancy at the end, up to the last shot.  Morricone delivers a meekly beautiful little score as well, that seems most effective during dusk scenes when the moon is out.  The picture was a moving experience.",
            "review_date": "2014-09-02",
            "source": "rt"
        },
        {
            "content": "Typical Malick genius. The characters motivations and actions are not only real, but they're expertly crafted. The photography is stunning, as it always is in Malick films. It isn't the most eventful movie though, so unless you can wait a couple dozen minutes for things to develop you won't like this movie.",
            "review_date": "2014-09-01",
            "source": "rt"
        },
        {
            "content": "Not Badlands, but still damn good. Full review soon.",
            "review_date": "2014-07-03",
            "source": "rt"
        },
        {
            "content": "One of those movies in which a single shot is already a work of art.\n\nFull review at filmbroadcaster.weebly.com",
            "review_date": "2014-06-23",
            "source": "rt"
        },
        {
            "content": "While the film itself looked amazing, I didn't find much else amazing about it.",
            "review_date": "2014-06-20",
            "source": "rt"
        },
        {
            "content": "Amazing cinematography and great use of the landscape. Another visually interesting movie by Terrence Malick that has more of a plot line to follow.",
            "review_date": "2014-06-07",
            "source": "rt"
        },
        {
            "content": "Now here's a Terrence Malick flick I can get behind! Believe the hype, the visuals here are just as jaw-droppingly stunning as everyone makes them out to be, the narrative is tight, the characters are strong, and the score jibes with it all - it's like watching a poem.",
            "review_date": "2014-05-28",
            "source": "rt"
        },
        {
            "content": "Outstanding. My second favourite Malick film next to Badlands. I'm not sure anyone has ever been better at photographing fire. The only other of his films I have seen thus far is 'To the Wonder', but it's films like this that make me such a lover of cinema. I'm not a Richard Gere fan in the slightest (though I have always loved Brooke Adams), but it's roles like this that cement his reputation as a cinematic icon in my books. I didn't say 'actor' because I'm not really sure that's his strength--it's more a presence, such as Alain Delon in 'Le Samourai'.",
            "review_date": "2014-05-10",
            "source": "rt"
        },
        {
            "content": "Classic docudrama, yet highly rich backdrop of the maize field and sepia-toned sky",
            "review_date": "2014-05-04",
            "source": "rt"
        },
        {
            "content": "Incredibly beautiful and deeply philosophical, Days Of Heaven is a testament to Terrence Malick talents as a creative and morally conscious director.",
            "review_date": "2014-04-22",
            "source": "rt"
        },
        {
            "content": "Great landscapes, great photography in this Terrence Mailick film",
            "review_date": "2014-04-18",
            "source": "rt"
        },
        {
            "content": "Terrence malick's beautiful masterpiece has to be a must watch for true cinema lovers. Another malick masterpiece into his reduced filmography. Considered at that time an instant classic and a rare and beautiful film, still now absorbs that tittle with its infinite imagery and vision. Probably richard gere's best film.",
            "review_date": "2014-04-16",
            "source": "rt"
        },
        {
            "content": "HERMOSA PELICULA DEL DIRECTOR MALICK",
            "review_date": "2014-04-02",
            "source": "rt"
        },
        {
            "content": "This movie is a visual poem, it's so rich and fluid that it's almost breathtaking. The story is rather simple, but works well here, the look and feel is really the main story.",
            "review_date": "2014-03-16",
            "source": "rt"
        },
        {
            "content": "Another film I watched in my Film Studies class. The only things I can really remember about this movie were the pretty cinematography and a couple scenes. Other than that, nothing.",
            "review_date": "2014-03-15",
            "source": "rt"
        },
        {
            "content": "Its an alright film. Not all it's hyped up to be. It's a nice concept, simple plot, however it drags like hell and is edited very sloppily. The cinematography however, is outstanding.",
            "review_date": "2014-02-13",
            "source": "rt"
        },
        {
            "content": "4.4./5 Al escuchar una trama con el término \"love triangle\", uno no puede tener otra reacción más que de desprecio; afortunadamente Terrence Malick crea una película donde cada composición del cuadro es estética y maravillosa; crea algo complejo, donde se siente que la historia principial es realmente superficial, es la punta del iceberg; Days of Heaven tiene que verse repetidas veces para analizar todo el detalle que puso Malick, y es de los pocos clásicos del cine que no están sobrevalorados ni derruidos por el tiempo.",
            "review_date": "2014-01-28",
            "source": "rt"
        },
        {
            "content": "I was bored to death and would rather gauge my eyes out than watch this again.",
            "review_date": "2014-01-26",
            "source": "rt"
        },
        {
            "content": "One of the most beautifully photographed movies ever made. How can you go wrong when Néstor Almendros, Haskell Wexler and Terrence Malick team up? You can't. This movie is Malick's masterpiece without any doubt.",
            "review_date": "2014-01-05",
            "source": "rt"
        },
        {
            "content": "Vähän hidas, mutta ei oikeastaan heikkoja hetkiä ollenkaan. Hyvin kuvattu.",
            "review_date": "2013-12-27",
            "source": "rt"
        },
        {
            "content": "Classic Malick, which means beautiful, self-conscious cinematography and not much else.",
            "review_date": "2013-12-24",
            "source": "rt"
        },
        {
            "content": "Gorgeous, captivating, and Linda Manz is a real treat.\n\nSecond watching 19/12/16: Agree with the above.",
            "review_date": "2013-12-22",
            "source": "rt"
        },
        {
            "content": "There is great beauty in Terrence Malick's poetic masterpiece, which, visually and thematically is about as close to perfect as a movie can be.",
            "review_date": "2013-12-18",
            "source": "rt"
        },
        {
            "content": "Terrence Malick's second masterpiece(after 1973's Badlands) is set in the Texas Panhandle in the early 20th century. On the run from the law, two lovers posing as brother and sister named Bill and Abby(Richard Gere and Brooke Adams) find work as stackers on a Texas prairie. Tagging along is Bill's little sister, Linda(Linda Manz-also the films narrator). In this new landscape a wealthy but terminally ill farmer(Sam Shepherd) falls in love with Abby. In an act of startling immorality, Bill urges Abby to accept the ailing farmers courting, so that when he dies they might inherit his vast fortune. The plan goes horribly wrong, resulting in a complex love triangle and a series of devastating events. \r\n\r\nThe plot is quite slight but this is more than compensated for by the rich themes, beautiful images and a wonderfully written and delivered narrative voice. In one of her very few starring roles, Linda Mantz gives her namesake character a voice that is naive, wistful and oddly detached. Malick's writing, perhaps somewhat inspired by Twain's 'Huckleberry Finn,' finds poetry in the simple, idiomatic speech of this young girl.\r\n\r\nThere was never a perfect person around.\r\nyou just got half devil and half angel in you.\r\n\r\nIn the lines above Linda is struggling to reconcile her natural love for her older brother with her knowledge of his wicked actions. At times the narrative voice achieves an almost heart-breaking pathos and depth. Aside from her voiceover work, Manz gives a very natural and uninhibited all round performance. As shown in 'The Tree of Life,' Malick seems to know how to get great performances from young players, and like that film it almost seems as if Mantz is being filmed without knowing it here.\r\n \r\nAs with any Malick film, I must of course mention the stunning visuals. For this project Malick teamed up with acclaimed Spanish cinematographer Nestor Almendros, and American cinematographer Haxell Wexler. The three of them combined to create some truly spectacular images. The photography is wonderful and captures the essence of this time period. The painterly canvas boasts images of long wheat fields, Victorian wood mansions, and old time trains puffing picturesque black smoke. The movie was shot almost entirely at twilight and the tranquil grey lighting lends the movie a very distinctive look and atmosphere. In the latter stages of the story, as Malick engulfs us in religious and apocalyptic symbolism, we are shown the powerful biblical image of a plague of locusts descending into the sky and a field of wheat aflame. \r\n\r\nThe performances are very solid throughout. As I have mentioned Linda Mantz is superb. The other players are all great too, in particular Sam Shepherd as the lonely and lovelorn farmer. He is a very complex, stoic character and it's difficult not to feel sympathy for him. It's less easy to feel for Gere's character, Bill. Bill is  hot-tempered and passionate. He acts instinctively and is willing to use violence if necessary. Richard Gere and Brooke Adams both do very well in their roles.\r\n\r\nTypical of Malick, Days of Heaven contains gorgeous images that are as important to the telling of the story as any character or plot device. However, I think what really sets this movie apart from his later work(The Thin Red Line, The Tree of Life, The New World etc.) is the strength of the narrative voice. Similar to what Sissy Spacek achieved in Badlands, Linda Mantz delivers Malick's writing in a way that is natural, poetic and chilling. This is one of my favourite movies of all time. 10/10",
            "review_date": "2013-12-08",
            "source": "rt"
        },
        {
            "content": "Terrence Malick is known and revered for his cinematography, and elements of nature within his movies, but this is where it all began.  His second movie, Days of Heaven is a visual feast.  Stunning landscapes, minute images of nature and incredible use of light.  Even 35 years later it cannot be faulted, cinematographically.  \n\nStory-wise, it's like something between Thomas Hardy and John Steinbeck.  Slow-moving but deeply engaging, with a fair amount of social commentary.  Not always coherent though.  Some sub-plots go nowhere, and some characters seem surplus to the story.  The movie also lasts one or two scenes too many.  A more powerful movie could have been achieved by ending it at the climax, rather than trying to tie up some loose ends, none of which are really tied up that well in the end anyway.\n\nGood performances by Richard Gere and Brooke Adams in the lead roles.  Good support from Sam Shepard and Linda Manz.",
            "review_date": "2013-11-19",
            "source": "rt"
        },
        {
            "content": "bombed and critically destroyed when first released i really like this period piece its gorgous to look at with a gr8 cast to boot.",
            "review_date": "2013-11-02",
            "source": "rt"
        },
        {
            "content": "The scenery is prairie and is picturesque in its own right. Photography picks out the beauty and the repeated blandness making for an out of the ordinary visual that shrugs the mind. Actors take their parts to a deep place that forces the mind to make moral judgments on what is taking place. Narration is rather odd and does not fit the scene. Nibbles: Cornflakes.",
            "review_date": "2013-10-21",
            "source": "rt"
        },
        {
            "content": "Very great movie. Especially the soundtrack. Great story and acting. I just thought it was a bit slow and confusing at times. But great.",
            "review_date": "2013-10-18",
            "source": "rt"
        },
        {
            "content": "Beautiful and empty.",
            "review_date": "2013-10-12",
            "source": "rt"
        },
        {
            "content": "Una de las más aclamadas obras de Terrence Malick, hasta el momento. Tantas buenas reseñas me hicieron pensar que me encontraría ante una de las mejores películas que he visto, pero sinceramente me decepcionó un poco.\nDesde sus primeras cintas, ya podíamos ver la capacidad de Malick para transmitir sentimientos mediante imágenes hermosas, y en este caso, también podemos ver cómo el director de fotografía puede marcar una gran diferencia; definitivamente el trabajo de Néstor Almendros es bastante distinto del de el mexicano Emmanuel Lubezki. Ambos son capaces de ayudar a Terrence a producir hermosas estampas, y sin embargo, cada uno lo hace con su estilo, dándole diferentes sensaciones y matices a la filmografía de éste director.\nA pesar de la belleza visual de ésta película, la historia no es lo suficientemente atrapante ni interesante. En ocasiones llega a ser tediosa y repetitiva.\nÉste es un importante filme en la carrera de Malick, pero no es su mejor trabajo.",
            "review_date": "2013-10-07",
            "source": "rt"
        },
        {
            "content": "Haunting music, beautifully shot, and well acted, this Terrence Malick film is his best in his short list of films and my favorite from him. This is before Malick got too deep with his narrations and storytelling. A nice period film about love and murder.\n\nGrade: A-",
            "review_date": "2013-10-07",
            "source": "rt"
        },
        {
            "content": "I found this to be tiresome to the point of tedium. I like Malick when he is good but some of his work just fails to engage me. This is one such piece of work.",
            "review_date": "2013-09-24",
            "source": "rt"
        },
        {
            "content": "Days of Heaven is an achingly tragic love story, filmed in a strange yet appealing quasi-documentary style.  A beautiful masterpiece composed of breathtaking cinematography, subtle acting, smart writing, and ingenious direction.",
            "review_date": "2013-09-21",
            "source": "rt"
        },
        {
            "content": "Beautiful film. This is where Malick was in his true element; lyrical, emotional, and heartfelt, with a simple yet breathtaking story.",
            "review_date": "2013-09-14",
            "source": "rt"
        },
        {
            "content": "Stark, compelling drama that sucks you in and leaves you wondering.",
            "review_date": "2013-09-14",
            "source": "rt"
        },
        {
            "content": "Before Terrence Malick went all dreamy and metaphorical on us he indulged in linear film-making. Days of Heaven is such a film. You can see the early signs of Malick's fascination with nature and bringing the best possible camera-angle to capture the environment in the most eloquent manner. The shot of the epic house standing out in a vast & seemingly endless landscape occupies multiple scenes & is just one of the many technical highlights of the film.\n\nIn terms of story, Days of Heaven comes off as less complex than it was probably conceived as on paper. This may be largely due to its awkward editing & what I can only conclude as distracting ADR (additional dialogue recording). Many lines fall flat and the emotive moments are not effectively captured.\n\nNonetheless, the film is short and the story is still interesting if not as impactful as I'd hoped for. It has an epic scope despite a short running-time and in the end makes for decent entertainment.",
            "review_date": "2013-09-09",
            "source": "rt"
        },
        {
            "content": "Terrence Malick means well, but his flaw as a director is that he prefers visuals and art direction over plot and story structure. I'll admit that Day's of Heaven is and impressive film both technically and visually, but  its light on story and the characters lack enough depth, development or personality to make them anything more than one dimensional, which makes the story very uninvolving. Malick's narrative structure also feels extremely rushed because he  often has the film jump too quickly from one scene to the next which never really lets us see the complexity of the character's relationships and how they each evolve as time goes on. Overall I did somewhat enjoy the movie, but Malick's restrictions turned what could have been a great movie into a somewhat good one.",
            "review_date": "2013-09-09",
            "source": "rt"
        },
        {
            "content": "Some beautiful imagery but unaffecting. More an accomplished formal exercise than compelling art.",
            "review_date": "2013-08-24",
            "source": "rt"
        },
        {
            "content": "Slow, visually sexy, but boring, no character development... i guess it was stylized but i didn't feel anything",
            "review_date": "2013-08-01",
            "source": "rt"
        },
        {
            "content": "Days of Heaven ist einer der schönsten Filme den ich je gesehen habe - rein visuell zumindest (und nein, das liegt nicht an Richard Gere).\n\nSchön ist ein breit gefasstes Wort in der heutigen Sprache. Ein schöner Film kann emotional berührend sein, oder ein gutes Ende haben, oder, so wie ich den Begriff in diesem Fall verwende, eine Reihe von umwerfenden Bildern bieten - schön im Sinne der Kamera, die Beeindruckendes und Bedrückendes und pure Ästhetik eingefangen hat.\n\nWenig verwunderlich stammt dieser Film aus den Händen von Terrence Malick. Malick ist ein notorischer Macher von schönen\" Filmen. Geniale Landschaftsaufnahmen machen einen großen Teil der enigmatischen Anziehungskraft seiner meditativ-philosophischen Spielfilmessays aus.\n\nDays of Heaven, der letzte in der Reihe der Malick-Filme der mir bis dato gefehlt hat, tanzt dabei jedoch etwas aus der Reihe. Wie auch in seinem Erstlingswerk Badlands, aber in Days of Heaven noch deutlicher, widmet sich Malick hier tatsächlich einer linearen Geschichte.\nZwar darf Voice-over Narration (von Linda Manz, die die kleine Schwester spielt) nicht fehlen, doch ist Days of Heaven weniger Poesie und mehr Melodrama.\n\nImmer noch nicht Melodrama genug, als dass sich der Film in den Staaten gut verkauft hätte, aber für Malick-Verhältnisse erstaunlich straight\" (sein The Elephant Man sozusagen).\n\nAuch ist keine einzige Großaufnahme eines Asts oder Baums zu sehen (was wohl an der texanischen Steppe liegt, die nicht gerade vor Bäumen strotzt), dafür gibt's eine Menge Silhouetten im Sonnenuntergang und eine unglaubliche Szene einer Heuschreckenplage zu bestaunen.\n\nMalick war schon immer ein Poet und gleichzeitig ein Filmemacher. Kein visueller Poet, der mittels Bildern dichtet, sondern ein meditativer Filmemacher, der seine Bilder gerne mit philosophischen Voice-over Poemen versieht und kommentiert.\n\nEin eigenwilliger Stil, zugegebenermaßen, aber nichtsdestotrotz effektiv, und richtig angewendet ein Rezept für Meisterwerke.\nDeren hat er meiner Meinung nach mindestens zwei produziert - The Thin Red Line und Days of Heaven. Das erstere als Quintessenz dessen für was Malick steht und der zweitere, weil er mich dazu nötigte vorm Bildschirm zu setzen und Der Film ist so schön\" zu murmeln (Pluspunkte für Morricone-Soundtrack, Abzüge für recht schwache Dialoge).",
            "review_date": "2013-07-31",
            "source": "rt"
        },
        {
            "content": "Malick's follow-up to Badlands reveals him as a cinematic poet with a distinctive cinematic language. Days of Heaven stands as a beautiful achievement in cinema, as Malick uncovers the many sides of the melodramatic romantic machinations by also juxtaposing the material side and spiritual side, as well as the bright side and good side, of love in a narrative structure which resembles the one of classic literature. In so doing, he employs a remarkably free and playful use of cinematography for which Nestor Almendros won an Academy Award, which prominently shows the filmmaker's love affair with nature and light and heightens the reflective aspect of the film.",
            "review_date": "2013-07-30",
            "source": "rt"
        },
        {
            "content": "Didn't even know I was capable of hating a film this much.",
            "review_date": "2013-07-29",
            "source": "rt"
        },
        {
            "content": "The majestic stillness is unsurpassed. Malick is a poet, on par with Kubrick & Ozu.",
            "review_date": "2013-07-29",
            "source": "rt"
        },
        {
            "content": "How the heck does this get rated so high? Richard Gere is just an awful actor.",
            "review_date": "2013-07-29",
            "source": "rt"
        },
        {
            "content": "Great story, great acting, great cinematography and great music. This is all part of Terrence Maclick's fantastic vision and are just some of the reasons this film has stood the test of time. \"Days of Heaven\" is a showcase for Malick's cinematic mastery and is one of cinema's greatest achievements",
            "review_date": "2013-07-13",
            "source": "rt"
        },
        {
            "content": "As expected: gorgeous film, dull characters, thin story, annoying voice over.",
            "review_date": "2013-07-09",
            "source": "rt"
        },
        {
            "content": "Malick is a brilliant director, and in this early film one can see his philosophical creativity reaching toward a goal it has not yet found. Weak on dialogue but flawless in imagery, \"Days of Heaven\" would have made a wonderful silent film, with a few titles replacing Linda's narrative and its contrived innocence.",
            "review_date": "2013-07-05",
            "source": "rt"
        },
        {
            "content": "\"nobody's perfect, everybody's got an angel and a devil in'em\"",
            "review_date": "2013-06-30",
            "source": "rt"
        },
        {
            "content": "An incredible masterpiece from one of America's foremost auteurs behind the camera. Writer/Director Terrence Malick created an interesting period piece with strong writing, performances, and production design. The cinematography is simply breathtaking and is the standard by which so many filmmakers still aspire to.",
            "review_date": "2013-06-29",
            "source": "rt"
        },
        {
            "content": "The first thing that stuns you while experiencing, not viewing, \"Days of Heaven\" is Terrence Malick's ability to create mood and atmosphere all while manipulating and maintaining it. Its probably the most effective love triangle story. A poor, young man convinces his girlfriend, who is known to everyone except for his younger sister as his older sister, to marry the owner of the land on which he works on. He does this since he overhears that the owner will soon die. However, when his girlfriend is gradually falling in love with her husband, and the owner does not die, her young lover grows more and more frustrated. The narration is impeccably told by a raspy voice highlighted by a Chicago accent by Linda Manz, the younger sister. Everything is told as if it was a projection of what she saw except its not it POV. The passion of the three young lovers is inexistent, the film feels very innocent with hidden layers of evil, and the conflicts are ever so powerful due to the teen's perspective. The acting is good especially from new-comer Richard Gere. The score by Ennio Morricone will go down as history's greatest film score and the cinematography always gets enough praise from other critics, but can never get too much. Everything is technically perfect in this film like many other classics. We get transported to the valleys of wheat stretch to the horizon .Even though there is certainly a sub-theme regarding poverty and industrialization, the movie mainly question's man's innocence. All of his film's are so spiritual that they please to the good of your soul. Its not really an epic, but sometimes it will feel that way. \"Days of Heaven\" is such a powerful film without being a tearjerker carried by beautiful images, a pleasing score, and maybe the best occurrence of narration in cinematic history highlighted by Malick's sensitive and unique direction.",
            "review_date": "2013-06-28",
            "source": "rt"
        },
        {
            "content": "I think I just am not a fan of Terrence Malick. Brooke Adams was a dream whenever she was on the screen. But as a character she wasn't engaging. The only engaging character was Linda, and she merely flitted at the edges of the story.\n\nAt least one of the best horror scenes in a non-horror film is featured here. So that's something.",
            "review_date": "2013-06-25",
            "source": "rt"
        },
        {
            "content": "Evocative and beautiful. A truly pure film.",
            "review_date": "2013-06-08",
            "source": "rt"
        },
        {
            "content": "\"Days of Heaven\" es uno de los grandes logros visuales del cine; es, sin duda, una rica y evocativa historia sobre una familia que vive de trabajo en trabajo y que finalmente se asienta al lado de un granjero que decide casarse con la mujer (que en realidad es pareja del hombre a quien le dice a todos es su hermano).\nMalick ha creado un festín visual adentrándonos en la vida de la granja y de aquellos que la trabajan mientras sutilmente nos involucra en esta trágica historia de traición.\n\"Days of Heaven\" es una magnifica película, de las mejores de Malick. Muy recomendable.",
            "review_date": "2013-06-07",
            "source": "rt"
        },
        {
            "content": "It is for sure the best photographed film in American cinematic history.",
            "review_date": "2013-06-05",
            "source": "rt"
        },
        {
            "content": "My Favorite Film Is 1941's Citizen Kane.",
            "review_date": "2013-06-02",
            "source": "rt"
        },
        {
            "content": "Cosmic, ethereal, maddening, and sublime, Days Of Heaven is extraordinary. The film is a deliberately haunting poem, and the epic scope of the picture makes experiencing it an unreal exercise. What I love most is a film that challenges me. The films of Terrence Malick do just that. Days Of Heaven is a bizarre Hollywood time-piece with an Avante Garde fluidity. Lyrical storytelling is habitual of Malick and his work, but Days Of Heaven is not just lyrical, it is astounding in its complexities, and unbelievably bold in its philosophical austerity.\n\nThe philosophical ideas the film meditates on are numerous, but it is impossible to pin even a single one of those deeply stirring ideas down. Sure, in the subtext traces of the natural order of things, and man's place in it, transient and makeshift, or seasonal, in existence, and so forth can be found. The film communicates so much to its audience, but any attempt to try and pass the 'message' along is a foolhardy task, as the film is so abundant with meditations on life, and far too beautiful to hold under the crude magnifying glass of self-referential analysis. The film is too special for all of that. Each and every single viewer will take away something different and wholly unique. Days Of Heaven has the ability to mean many different things to many different people, and I must say that the film holds untold fortunes for the readily open and available viewer. Days Of Heaven is why I love films. The films of Terrence Malick represent everything I've always wanted films to be, but never thought even remotely possible. 'Cosmic' is the word I'm searching for.\n\nSo far as I'm concerned, the single most important player in Malick's ongoing circus has always been his longtime editor, Billy Weber. Weber is a genius film editor and without his contributions I am convinced Days Of Heaven would not be half the film it is. Weber assembles Malick's philosophically ambiguous and broad vision into something coherent, fluid, and structurally sound, all the while retaining the grandeur and scope of his artistic intentions. It is as if Weber establishes a narrative for the subtext, a home for the details. With Weber's assistance, Days Of Heaven is not only a beautiful film, it is a beautifully imagined one, expertly assembled by the best scissors in the business.\n\nViewer beware! Watching the film may cause an adverse effect as the viewer gains a new found respect for its leading man, Richard Gere. Gere has well earned some scrutiny in his career, but bite your tongue until you see his work in Days Of Heaven, which is easily his finest hour. Actors play a strange role in Malick's films. I wouldn't go so far as to call them props, but they aren't the featured elements of his films. Rather the actors make up but a small part of what his films eventually become. No one single element of Days Of Heaven is more significant than the other, everything comes together to create the perfect film. The film is not star-centic, nor are any of Malick's films.\n\nAlthough I do believe that the actual story of Days Of Heaven is told in the subtext, the base premise is unbelievably well conceived and watching it develop is truly a gift.\n\nIn closing, I am in love with Days Of Heaven. Head over heels crazy about it. The perfect art film.",
            "review_date": "2013-05-23",
            "source": "rt"
        },
        {
            "content": "A gorgeous film set in a gorgeous environment that all serves as a backdrop to a rather grim and tragic story.",
            "review_date": "2013-05-21",
            "source": "rt"
        },
        {
            "content": "One of my top 3.  Such a moving story, with great narration.",
            "review_date": "2013-05-19",
            "source": "rt"
        },
        {
            "content": "Read my review on letterboxd.com/albethos",
            "review_date": "2013-05-13",
            "source": "rt"
        },
        {
            "content": "would make a great companion piece with \"Beasts of the Southern Wild\".. bet it was an influence on this much more recent film...",
            "review_date": "2013-05-13",
            "source": "rt"
        },
        {
            "content": "Even the story to me is not of a fear love, I love that almost every single shot of the movie is a great photography...pieces of art!",
            "review_date": "2013-05-08",
            "source": "rt"
        },
        {
            "content": "One of Malick's first opuses. Gloriously told and a marvel to be seen, explores good vs evil and nature vs man. Love the detached narration. Visual poetry.",
            "review_date": "2013-05-01",
            "source": "rt"
        },
        {
            "content": "'Days of Heaven'. Terrence Malick's almost perfect exploration and adoration of nature, love and The American Dream. You can definitely see the origins of 'Tree of Life' and 'To the Wonder' in this, and it's much tighter in its focus too. Seeing a 35mm print made it all the more beautiful!",
            "review_date": "2013-04-28",
            "source": "rt"
        },
        {
            "content": "It's simple, elegant, original and interesting. As much as I liked this film, I didn't see it as a masterpiece of cinema. At times the pace felt too slow and the characters underdeveloped. However, I can appreciate that this is a great film in almost every aspect.",
            "review_date": "2013-04-23",
            "source": "rt"
        },
        {
            "content": "Days of Heaven has what might be the best cinematography I have ever seen.  It's a flawlessly made film filled with so many images so perfect that it feels as though they have instantly become cultural artifacts as they are seen.  Take for example all the glorious images of characters with the Farmer's mansion hovering in the background or that glorious shot of the workers running to the train.  This could be Malick's best film, and that's saying a lot.",
            "review_date": "2013-04-14",
            "source": "rt"
        },
        {
            "content": "Beautifully shot. The presentation confuses time as it passes fast and years are seen in minutes. It is a good experience and the acting is good. It has a sadness to it that only comes from the loss of past lives or the memory of youth.",
            "review_date": "2013-04-13",
            "source": "rt"
        },
        {
            "content": "In Terrence Malick's hands, the loss of Eden becomes an operatic, impressionistic tragedy, and American industry the fallen state from which man is want to be saved.",
            "review_date": "2013-04-02",
            "source": "rt"
        },
        {
            "content": "Ambientada en los comienzos del siglo XX y sirviéndose de una trama relativamente simple, Days of Heaven se erige como un monumento cinematográfico del más alto nivel. Malick (Dirección), Almendros (Dirección de Fotografía) y Morricone (Música) nos entregan algunas de las imágenes (visuales y sonoras) más bellas de la historia del cine, imágenes que se fijan para siempre en la conciencia del espectador. Si la trama es \"simple\", los temas tratados son complejos. La película integra en un mismo universo lo efímero y lo duradero de la existencia, entremezclando imágenes de todo tipo y color (personas, animales, insectos, plantas, nubes, y un largo etcétera). Para Malick, el ser humano es igual de importante que su entorno. Según su visión, antes que \"seres sociales\", somos \"seres\" a secas, conectados estrechamente con la naturaleza, de la cuál nos servimos para obtener recursos y así subsistir. Days of Heaven es una obra atemporal, que se sirve de recursos técnicos majestuosos y una edición completamente libre y original para contar lo que todos sentimos pero nunca pudimos imaginar; sentimientos abstractos como \"melancolía\", \"felicidad\" o \"tristeza\" son liberados de su abstracción y expresados como significantes visuales y sonoros que perduran luego de que la historia llega a su fin.",
            "review_date": "2013-03-30",
            "source": "rt"
        },
        {
            "content": "A terrific film and a visual masterpiece. So many great images, amazing cinematography and a simple but still quite original story.  It felt new, at least a mid-nintees film. The acting is good, but not super impressive. Nothing more is needed though, this is a timeless flick and you will watch it for it's beauty, not the acting. The fantastic score from Morricone meeds a mention too. I like the colors here, the open nature and especially the fire scene. Few poor scenes, but that one will stick with me. The \"magic hour\"-filming is really fascinating and the two years Malick spent editing this piece is pretty wild too. The only thing I don't like here is the setting. The life of the 1910's is quite boring stuff to be honest.\n\nOne of the best shot films I've seen. See it if you often care as much for the imagery as you do for the story.\n\n8.5 out of 10 years of editing.",
            "review_date": "2013-03-29",
            "source": "rt"
        },
        {
            "content": "This has got to be one of the most beautiful films ever made, even if the story is slightly weak if you want to see how to photograph a film, watch this one.",
            "review_date": "2013-03-26",
            "source": "rt"
        },
        {
            "content": "Days of Heaven lingers for a good portion of the film but really makes up for the slow and deliberately paced first half with an impressive climax and tragic ending. Richard Gere is good in his role and the camerawork here is beautiful.",
            "review_date": "2013-03-25",
            "source": "rt"
        },
        {
            "content": "Perhaps the most beautifully photographed film ever made. Each member of the main quartet is excellent, but the young Linda Manz (whose story this is) is particularly striking. \"Days of Heaven\" is haunting and powerful like few films are.",
            "review_date": "2013-03-23",
            "source": "rt"
        },
        {
            "content": "'Days of Heaven' is truly a sight to behold: just one beautiful shot after another. With a stellar cast, introspective script and visionary direction from one of film's most elusive masters, Terence Malick.",
            "review_date": "2013-03-22",
            "source": "rt"
        },
        {
            "content": "One of the most beautiful films I've ever seen. While the ending scene doesn't seem to be the most proper way to end it, everything else is near flawless. Terrence Malick has made a masterpiece in the relation to nature and human much like a lot of his work.",
            "review_date": "2013-03-12",
            "source": "rt"
        },
        {
            "content": "Powerful and poetic...almost biblical story with some of the most beautiful cinematography I've ever seen. It's look, it's style is 20 years ahead of its time at least. As much about life and its cycles as it is about the story. Only Malick can make the characters the background and the scenery the foreground while still painting a perfect picture.",
            "review_date": "2013-03-10",
            "source": "rt"
        },
        {
            "content": "Gorgeous. In the hands of any other director, this would be forgettable pulpy melodrama, but Terrence Malick inverts the whole enterprise. The scenery is the point, and the plot is the background. Dialogue is on an as-needed basis. It's also grounded and direct in a way that later Malick films aren't. Apparently this movie took a year to shoot and two years to edit. Time well spent.",
            "review_date": "2013-03-10",
            "source": "rt"
        },
        {
            "content": "I don't get how this is so highly rated. It was very boring, the same things kept happening with a very annoying narrator of a little kid with a horrible accent. I was surprised that I didn't fall asleep during this. All it was was people working in hay fields for half the movie and a guy and a girl basically trying to stay together when she married some guy. They even said they were brother and sister so the guy wouldn't get jealous but it was just plain weird. The acting wasn't that great too, it was just a very boring movie and almost put me to sleep.",
            "review_date": "2013-03-07",
            "source": "rt"
        },
        {
            "content": "It's Malick, so you know it's going to look good (which it does). The narrative is decent, and certainly more coherent and traditional than his more recent films. I never really cared that much about any of the characters though or what happened to them. You don't spend much time with them, except for the little girl.",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "Days of Heaven seems to cut closer to true filmmaking, to pure visual storytelling.",
            "review_date": "2013-02-17",
            "source": "rt"
        },
        {
            "content": "This is a Terrence Malick film and you can tell.",
            "review_date": "2013-02-12",
            "source": "rt"
        },
        {
            "content": "Photography is stunning...one of the most beautifully filmed movies I've ever seen",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "This is my first Terrence Malick film and I am pretty sure, I am going to watch many of them because of this movie's rich nature. Brilliant cinematography accompanied with great music makes it a treat to watch.",
            "review_date": "2013-02-01",
            "source": "rt"
        },
        {
            "content": "This is the best Malick movie in my opinion.",
            "review_date": "2013-01-31",
            "source": "rt"
        },
        {
            "content": "Breathtaking. Very much like \"Tree of Life\".",
            "review_date": "2013-01-28",
            "source": "rt"
        },
        {
            "content": "An earlier entry from visual director Terrence Mallik that has been observed by many as his more commercial film but I still found it quite enjoyable.\n\nThe story of two drifters (man & woman) in depression era who land a job sacking wheat for a rich man in vast country. The lady then captures the attention of the rich man but is still in love with her drifter friend.\n\nThe visual sense to this film is extraordinary the strength of nearly every frame of this film is so commendable. It's stunning but also rather slow but I found at most times engaging.",
            "review_date": "2013-01-18",
            "source": "rt"
        },
        {
            "content": "The one with the awesome \"magic Hour\" cinemetography.",
            "review_date": "2013-01-14",
            "source": "rt"
        },
        {
            "content": "I recently bought myself a LED flat-screen TV and this is the film that I picked to break it in. I've seen it before and it's a beautiful film. It looks GORGEOUS on Blu-ray (Criterion of course).",
            "review_date": "2013-01-13",
            "source": "rt"
        },
        {
            "content": "Often cited as some of Terrence Malick's greatest work, \"Days of Heaven\" stands as an American classic, an hour and a half long romance set in the poor conditions of Texan fields teeming with disenfranchised workers. Every single shot could be framed and hung on a wall as artwork, the whispery narratives are as philosophical as always and is captured to feel extremely lively and realistic. Of course, it's somewhat brief runtime seems at least double it's length, as most of this motion picture is incredibly boring. I'd still recommend it to anyone with an interest in art-house films, but aside from that I was not too blown away by the real substance of this pretty picture.",
            "review_date": "2013-01-09",
            "source": "rt"
        },
        {
            "content": "I am both intrigued and appalled at how much young Linda Manz resembles a full-grown Jim Caviezel, who would star in Malick's The Thin Red Line 20 years later.",
            "review_date": "2013-01-08",
            "source": "rt"
        },
        {
            "content": "\"Paradise\" says the synopsis, but I didn't feel much like I was in it. It's certainly one of the most visually beautiful films I've seen, but it seemed that rather more money was given disproportionately to the camermen than to the scriptwriter. Days of Heaven is a very realist and minimalist work, in which we observe things that happen to occur. There are no conversations longer than a few exchanged sentences and the camera's viewpoint endlessly switches from breathtaking panorama to snippet of conversation to breathtaking panorama. I felt no commitment at all to the characters, least of all the tired-sounding voice-over. Little emotion was shown by the actors, even in the scenes of highest passion.\nI can't deny that Days of Heaven is well made, and it succeeds in what it intends to do. But the results leave me feeling very empty and unaffected - I prefer films with a  bit more emotion.",
            "review_date": "2013-01-03",
            "source": "rt"
        },
        {
            "content": "Terrence Malick certainly knows how to take a story of loss and sadness and make it into something beautiful and elegant that was a classic the moment it graces the screen.",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "She didn't care if she was happy or not.  She just wanted to make up for what she did wrong.\r\n\r\nA poor couple and a little girl travel together and work as day laborers on farms.  The couple pretends to be brother and sisters to keep questions to a minimum.  When they discover a landowner is sick, the couple talk themselves into to being separated so the male can work the field and the female can marry the landowner to gain his riches.  The male quickly becomes jealous and torn by the decision and the female tries to make the best of things but finds her new world tough to be happy in with both men still in her life.\r\n\r\n\"Instead of getting sicker he just stayed the same.  He didn't get sicker and he didn't get better.\"\r\n\r\nTerrence Malick, director of The Thin Red Line, Badlands, The Tree of Life, The New World, and the upcoming To the Wonder (Ben Affleck, Javier Bardem, and Rachel McAdams), delivers Days of Heaven.  The storyline for this picture is amazing and reminded me of Wuthering Heights.  The love story is excellent and the acting is beautiful.  The cast includes Richard Gere, Sam Shepard, Brooke Adams, Stuart Magolin, and Robert Wilke.\r\n\r\n\"You know how people are.  You tell them something.  They start talking.\"\r\n\r\nI had marked this down as a must see some time ago to someone's recommendation on rottentomatoes (I honestly can't remember whose).  I didn't even realize this was a Terrence Malick picture until just now.  This was an amazing film with a wonderful storyline.  This, much like Wuthering Heights, is a tale of tragedy and torn star crossed lovers.  I strongly recommend seeing this picture. \r\n\r\n\"You've just got half devil and half angel in you.\"\r\n\r\nGrade: A",
            "review_date": "2012-12-09",
            "source": "rt"
        },
        {
            "content": "Terrence Malick followed his debut film with this beautiful film (visually speaking) about a man who flees Chicago after accidentally murdering a man, and take his girlfriend and sister along with him.  To avoid gossip, I guess, he tells people his girlfriend is his sister, and this causes a series of unfortunate events to unfold, including her marrying the farmer they come to work for (believing he doesn't have long to live and they could inherit his farm).  The film is short on story really...it has a simple straightforward plot, but the cinematography is gorgeous and every frame looks excellent.",
            "review_date": "2012-12-07",
            "source": "rt"
        },
        {
            "content": "Beautiful and tragic. This movie is pure magic. I can't believe that I hadn't seen it until today.",
            "review_date": "2012-12-07",
            "source": "rt"
        },
        {
            "content": "Linda Manz, who played the little sister, was fantastic.  Her narration of the film was so honest and natural that her words didn't seem to come from an actress at all, but more like an actual girl from 1916 Chicago.",
            "review_date": "2012-12-06",
            "source": "rt"
        },
        {
            "content": "You could hang almost any shot of this movie on a wall and call it art. Full review later.",
            "review_date": "2012-11-20",
            "source": "rt"
        },
        {
            "content": "There are films that stay within the perimeters of the visual screen, and there are others that contain the power to transcend such boundaries. 'Days of Heaven' evidently belongs with the latter category. A film, similar to Kubrick's '2001: A Space Odyssey,' that moves with such swift elegance and grace that it very much resembles a moving painting of the tranquility that nature inhabits. From the opening to the final shot, I doubt that there isn't a single frame that couldn't qualify for a beautiful painting.",
            "review_date": "2012-11-03",
            "source": "rt"
        },
        {
            "content": "Stunning cinematography",
            "review_date": "2012-11-03",
            "source": "rt"
        },
        {
            "content": "Great film with some interesting themes, and fantastic visuals. Out of the Malick films I have seen this would have to be my favourite.",
            "review_date": "2012-10-28",
            "source": "rt"
        },
        {
            "content": "Cinematic! Essential viewing.",
            "review_date": "2012-10-28",
            "source": "rt"
        },
        {
            "content": "Beautiful cinematography all through the movie. The end sequence is just amazing! I love this movie and its story. One of Malick's best.",
            "review_date": "2012-10-28",
            "source": "rt"
        },
        {
            "content": "Also known as \"Golden Hour: The Movie\", Terrence Malick's sophomore feature is  indisputably one of the most visually beautiful period dramas ever made. Nearly every shot the director puts in front of you almost makes the screen melt away, so uncanny is his eye for historical detail and sense of time and place. The cast is superb as well, with Richard Gere in a star-making role.",
            "review_date": "2012-10-23",
            "source": "rt"
        },
        {
            "content": "The story is slight and generically biblical, but that matters not.  One of the most beautiful packages of moving images that you will ever behold. Moviemaking at its bare essence. Would be just as inspiring with the sound off. Malick's finest by far.",
            "review_date": "2012-10-21",
            "source": "rt"
        }
    ]
}